Repository: rueisnom/feedback
Catalog: xlf/97/92/56/979256.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Hi after reading this article, I made a sortComparator for my needs, with the functionality to compare more than one json attributes, and i want to share it with you.
es: Hola después de leer este artículo,hice un sortComparator para mis necesidades,con la funcionalidad de comparar más de un atributo json,y quiero compartirlo con ustedes.
ja: この記事を読んだ後、私は私のニーズのために、複数のjson属性を比較する機能を持つsortComparatorを作ったので、それをあなたと共有したいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안녕하세요,이 기사를 읽은 후 두 가지 이상의 json 속성을 비교할 수있는 기능으로 내 요구에 맞는 sortComparator를 만들었으며 귀하와 공유하고 싶습니다.</font></font>
ru: Привет после прочтения этой статьи,я сделал sortComparator для своих нужд,с функциональностью для сравнения более чем одного json атрибута,и я хочу поделиться им с вами.
zh_cn: 大家好,看完这篇文章后,我根据自己的需求做了一个sortComparator,具有比较多个json属性的功能,想和大家分享一下。

source: How do I create a function to sort the objects by the <code>price</code> property in <em>ascending</em><strong>or</strong><em>descending</em> order using JavaScript only?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo creo una funci&oacute;n para ordenar los objetos por la </font><font style="vertical-align: inherit;">propiedad </font><font style="vertical-align: inherit;">del </font></font> <code>price</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font><font style="vertical-align: inherit;">orden </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ascendente </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">descendente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando solo JavaScript?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptのみを使用</font><font style="vertical-align: inherit;">して、</font></font> <code>price</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティで</font><font style="vertical-align: inherit;">オブジェクト</font><font style="vertical-align: inherit;">を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">昇順</font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">降順</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">並べ替える関数を作成するにはどうすればよい</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 만 사용하여 </font></font> <code>price</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 특성 </font><font style="vertical-align: inherit;">별로 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오름차순 </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내림차순 </font></font></em><font style="vertical-align: inherit;"><em><font style="vertical-align: inherit;">으로</font></em><font style="vertical-align: inherit;"> 오브젝트를 정렬하는 함수를 작성하는 방법은 </font><font style="vertical-align: inherit;">무엇입니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как создать функцию для сортировки объектов по </font><font style="vertical-align: inherit;">свойству </font></font> <code>price</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в порядке </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">возрастания </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">убывания</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используя только JavaScript?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如何创建</font><font style="vertical-align: inherit;">仅使用JavaScript </font><em><font style="vertical-align: inherit;">按</font></em></font> <code>price</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">按升序</font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">降序</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对对象进行排序的函数</font><font style="vertical-align: inherit;">？</font></font>

source: I also worked with some kind of rating and multiple fields sort:
es: También trabajé con algún tipo de clasificación y de campos múltiples:
ja: 私も何かしらのレーティングや複数フィールドのソートをして作業していました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 또한 일종의 등급과 여러 분야를 다루었습니다.</font></font>
ru: Я также работал с каким-то рейтингом и сортировкой по нескольким полям:
zh_cn: 我也做了一些评级和多字段排序。

source: I have added <code>isAscending</code> parameter to it. Also converted it to <code>ES6</code> standards and "newer" good parts as recommended by the author.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Le </font></font> <code>isAscending</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> par&aacute;metro </font><font style="vertical-align: inherit;">isAscending</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Tambi&eacute;n lo convirti&oacute; a los </font><font style="vertical-align: inherit;">est&aacute;ndares </font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y partes buenas "m&aacute;s nuevas" seg&uacute;n lo recomendado por el autor.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>isAscending</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメータを</font><font style="vertical-align: inherit;">追加しまし</font><font style="vertical-align: inherit;">た。</font><font style="vertical-align: inherit;">また</font><font style="vertical-align: inherit;">、著者が推奨するように、</font><font style="vertical-align: inherit;">それを</font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準および「新しい」良品に</font><font style="vertical-align: inherit;">変換しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>isAscending</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 매개 변수를 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">했습니다. </font><font style="vertical-align: inherit;">또한 </font><font style="vertical-align: inherit;">저자가 권장 한대로 </font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 표준 및 "최신"좋은 부품으로 </font><font style="vertical-align: inherit;">변환했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я добавил </font><font style="vertical-align: inherit;">параметр </font></font> <code>isAscending</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к нему. </font><font style="vertical-align: inherit;">Также преобразовал это в </font><font style="vertical-align: inherit;">стандарты </font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и "более новые" хорошие части как рекомендовано автором.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我已经添加了</font></font> <code>isAscending</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数。</font><font style="vertical-align: inherit;">还</font><font style="vertical-align: inherit;">按照作者的建议</font><font style="vertical-align: inherit;">将其转换为</font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准和&ldquo;较新的&rdquo;优质零件。</font></font>

source: I recently wrote a universal function to manage this for you if you want to use it.
es: Recientemente escribí una función universal para manejar esto para ti si quieres usarlo.
ja: 最近、使いたい人にはこれを管理するためのユニバーサル機能を書いてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최근에 이것을 사용하려는 경우이를 관리 할 수있는 범용 함수를 작성했습니다.</font></font>
ru: Недавно я написал универсальную функцию для управления ею,если вы хотите ее использовать.
zh_cn: 我最近写了一个万能的功能,如果你想用的话,我帮你管理这个。

source: I recommend <a href="https://github.com/jherax/array-sort-by">GitHub: Array sortBy</a> - a best implementation of <code>sortBy</code> method which uses the <a href="https://en.wikipedia.org/wiki/Schwartzian_transform">Schwartzian transform</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Recomiendo </font></font><a href="https://github.com/jherax/array-sort-by"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub: Array sortBy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : una mejor implementaci&oacute;n del </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>sortBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que utiliza la </font></font><a href="https://en.wikipedia.org/wiki/Schwartzian_transform"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">transformaci&oacute;n Schwartzian</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は</font></font><a href="https://github.com/jherax/array-sort-by"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をお勧めし</font><font style="vertical-align: inherit;">ます：配列sortBy- </font><a href="https://en.wikipedia.org/wiki/Schwartzian_transform"><font style="vertical-align: inherit;">シュワルツ変換</font></a><font style="vertical-align: inherit;">を使用する</font></font> <code>sortBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドの</font><font style="vertical-align: inherit;">最良の実装</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/jherax/array-sort-by"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 추천합니다 </font><font style="vertical-align: inherit;">: Array sortBy</font><font style="vertical-align: inherit;"> - </font><a href="https://en.wikipedia.org/wiki/Schwartzian_transform"><font style="vertical-align: inherit;">Schwartzian 변환</font></a><font style="vertical-align: inherit;"> 을 사용하는 </font></font> <code>sortBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">의 최상의 구현</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я рекомендую </font></font><a href="https://github.com/jherax/array-sort-by"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub: Array sortBy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - лучшая реализация </font><font style="vertical-align: inherit;">метода </font></font> <code>sortBy</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использующего </font></font><a href="https://en.wikipedia.org/wiki/Schwartzian_transform"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">преобразование Шварца</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我建议使用</font></font><a href="https://github.com/jherax/array-sort-by"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub：Array sortBy-</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><a href="https://en.wikipedia.org/wiki/Schwartzian_transform"><font style="vertical-align: inherit;">Schwartzian变换</font></a><font style="vertical-align: inherit;">的</font></font> <code>sortBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">的最佳实现</font></font><font style="vertical-align: inherit;"></font>

source: I'm little late for the party but below is my logic for sorting.
es: Llego un poco tarde a la fiesta pero abajo está mi lógica de clasificación.
ja: 少し遅れてしまいましたが、以下に仕分けのロジックをご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 파티에 조금 늦었지만 아래는 정렬의 논리입니다.</font></font>
ru: Я немного опаздываю на вечеринку,но ниже моя логика сортировки.
zh_cn: 我有点晚了,但下面是我的整理逻辑。

source: I've got the following objects using AJAX and stored them in an array:
es: Tengo los siguientes objetos usando AJAX y los he almacenado en una matriz:
ja: AJAXを使って以下のオブジェクトを取得し、配列に格納しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX를 사용하여 다음 객체를 가져 와서 배열에 저장했습니다.</font></font>
ru: Я получил следующие объекты с помощью AJAX и сохранил их в массиве:
zh_cn: 我使用AJAX得到以下对象,并将其存储在一个数组中。

source: If you have an <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla">ES6</a> compliant browser you can use:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si tiene un </font><font style="vertical-align: inherit;">navegador compatible con </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede usar:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">準拠のブラウザを使用し</font><font style="vertical-align: inherit;">ている場合は、</font><font style="vertical-align: inherit;">次を使用できます。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호환 브라우저 </font><font style="vertical-align: inherit;">가있는 경우 다음을 </font><font style="vertical-align: inherit;">사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если у вас есть </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">браузер,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> совместимый </font><font style="vertical-align: inherit;">с </font><font style="vertical-align: inherit;">ES6,</font><font style="vertical-align: inherit;"> вы можете использовать:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您拥有</font><font style="vertical-align: inherit;">符合</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/New_in_JavaScript/ECMAScript_6_support_in_Mozilla"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">浏览器，则可以使用：</font></font>

source: If you use <a href="http://underscorejs.org/">Underscore.js</a>, try sortBy:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si usa </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , intente sortBy:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用している場合は</font><font style="vertical-align: inherit;">、sortByを試してください。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 경우 </font><font style="vertical-align: inherit;">sortBy를 시도하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , попробуйте sortBy:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果你使用</font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，尝试sortBy：</font></font>

source: If you want to convert the <code>"date"</code> field as <code>Date</code> type:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea convertir el </font><font style="vertical-align: inherit;">campo </font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como </font><font style="vertical-align: inherit;">Tipo de </font></font> <code>Date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールドを</font></font> <code>Date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプ</font><font style="vertical-align: inherit;">に変換する場合</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 필드를 </font></font> <code>Date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유형 </font><font style="vertical-align: inherit;">으로 변환하려면 </font><font style="vertical-align: inherit;">다음을 수행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите преобразовать поле </font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><font style="vertical-align: inherit;">тип &laquo; </font></font> <code>Date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要将</font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字段</font><font style="vertical-align: inherit;">转换</font><font style="vertical-align: inherit;">为</font></font> <code>Date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型：</font></font>

source: If you want to ignore case sensitive, set the <code>parser</code> callback:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea ignorar may&uacute;sculas y min&uacute;sculas, configure la </font><font style="vertical-align: inherit;">devoluci&oacute;n de llamada del </font></font> <code>parser</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大文字と小文字を区別する場合は、</font></font> <code>parser</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コールバックを</font><font style="vertical-align: inherit;">設定し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대소 문자를 구분하지 않으려면 </font></font> <code>parser</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 콜백을 </font><font style="vertical-align: inherit;">설정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите игнорировать регистр, установите </font><font style="vertical-align: inherit;">обратный вызов </font></font> <code>parser</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要忽略大小写，请设置</font></font> <code>parser</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">回调：</font></font>

source: If you want to sort ascending switch the expressions on each side of the minus sign.
es: Si quieres ordenar ascendente cambia las expresiones a cada lado del signo menos.
ja: 昇順にソートしたい場合は、マイナス記号の両側にある式を切り替えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오름차순으로 정렬하려면 빼기 부호의 양쪽에있는 표현식을 전환하십시오.</font></font>
ru: Если вы хотите отсортировать по возрастанию,переключите выражения с каждой стороны знака "минус".
zh_cn: 如果你想进行升序排序,可以在减号的每一侧切换表达式。
