Repository: rueisnom/feedback
Catalog: xlf/97/92/56/979256.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You want to sort it in Javascript, right? What you want is the <a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"><code>sort()</code> function</a>. In this case you need to write a comparator function and pass it to <code>sort()</code>, so something like this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Quieres ordenarlo en Javascript, verdad? </font><font style="vertical-align: inherit;">Lo que se quiere es la </font></font><a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la funci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En este caso, debe escribir una funci&oacute;n de comparaci&oacute;n y pasarla a </font></font> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , as&iacute; que algo como esto:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはそれをJavascriptでソートしたいですよね？</font><font style="vertical-align: inherit;">必要なのは</font></font><a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">この場合、コンパレーター関数を作成して</font></font> <code>sort()</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">渡す必要があるため、</font><font style="vertical-align: inherit;">次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트로 정렬 하시겠습니까? </font><font style="vertical-align: inherit;">당신이 원하는 것은 </font></font><a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">이 경우 비교기 함수를 작성하여 </font></font> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 전달해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы хотите отсортировать его в Javascript, верно? </font><font style="vertical-align: inherit;">Вам нужна </font><a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"><font style="vertical-align: inherit;">функция </font></a></font> <code>sort()</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В этом случае вам нужно написать функцию сравнения и передать ее в </font></font> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , примерно так:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您想用Javascript排序吗？</font><font style="vertical-align: inherit;">您想要的是</font></font><a href="http://www.javascriptkit.com/javatutors/arraysort.shtml"> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这种情况下，您需要编写一个比较器函数并将其传递给</font></font> <code>sort()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，如下所示：</font></font>

source: You will need two function
es: Necesitarás dos funciones
ja: 2つの機能が必要になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 기능이 필요합니다</font></font>
ru: Вам понадобятся две функции
zh_cn: 你将需要两个功能

source: Your comparator takes one of each of the nested hashes inside the array and decides which one is higher by checking the "price" field.
es: Su comparador toma uno de cada uno de los hashes anidados dentro de la matriz y decide cuál es más alto marcando el campo "precio".
ja: コンパレータは配列内のネストされたハッシュのうちの1つを取り、"price "フィールドをチェックしてどれがより高いかを決定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비교기는 배열 내부의 각 중첩 해시 중 하나를 가져 와서 "price"필드를 확인하여 더 높은 값을 결정합니다.</font></font>
ru: Ваш компаратор берет по одному из каждого из вложенных хэшей внутри массива и решает,какой из них выше,проверяя поле "цена".
zh_cn: 你的比较器从数组中的每一个嵌套的哈希值中提取一个,并通过检查 "价格 "字段来决定哪一个高。

source: and another sort
es: y otro tipo
ja: と別の種類の
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 다른 종류</font></font>
ru: и другой вид
zh_cn: 而另一种

source: and the result is
es: y el resultado es
ja: となり、その結果は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과는</font></font>
ru: и в результате
zh_cn: 结果是

source: for string sorting in case some one needs it,
es: para la clasificación de las cuerdas en caso de que alguien lo necesite,
ja: を使用して文字列の並べ替えを行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필요하다면 문자열 정렬을 위해</font></font>
ru: для сортировки строк на случай,если кому-то это понадобится,
zh_cn: 用于字符串排序,以备不时之需。

source: sort() function
es: función sort()
ja: ソート関数
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sort () 함수</font></font>
ru: функция сортировки
zh_cn: 排序()函数

source: with result
es: con el resultado
ja: 結果ありき
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과</font></font>
ru: с результатом
zh_cn: 有结果
