Repository: rueisnom/feedback
Catalog: xlf/97/92/56/979256.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Let create some functions that sort an array ascending or descending and that contains object or string or numeric values.
es: Vamos a crear algunas funciones que ordenen una matriz ascendente o descendente y que contenga objetos o cadenas o valores numéricos.
ja: オブジェクトや文字列、数値を含む配列を昇順・降順に並べ替える関数を作ってみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 오름차순 또는 내림차순으로 정렬하고 객체, 문자열 또는 숫자 값을 포함하는 일부 함수를 작성하십시오.</font></font>
ru: Создадим несколько функций,сортирующих массив по возрастанию или убыванию и содержащих объекты,строковые или числовые значения.
zh_cn: 让我们创建一些函数来对一个数组进行升序或降序排序,该数组包含对象或字符串或数字值。

source: Let's create a method to sort arrays being able to arrange objects by some property.
es: Vamos a crear un método para ordenar las matrices siendo capaces de ordenar los objetos por alguna propiedad.
ja: オブジェクトをプロパティで並べ替えられるように配列をソートするメソッドを作ってみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성을 기준으로 객체를 정렬 할 수있는 배열을 정렬하는 메서드를 만들어 보겠습니다.</font></font>
ru: Создадим метод сортировки массивов,имеющих возможность упорядочивать объекты по какому-либо свойству.
zh_cn: 让我们创建一个方法来对数组进行排序,通过一些属性来排列对象。

source: Note that <code>localCompare</code> is case <strong>in</strong>sensitive
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que </font></font> <code>localCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font><font style="vertical-align: inherit;">sensible a </font><font style="vertical-align: inherit;">may&uacute;sculas </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> min&uacute;sculas</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>localCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は大文字</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">小文字を区別する</font><font style="vertical-align: inherit;">ことに注意してください</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 </font></font> <code>localCompare</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우가 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 민감</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание , </font><font style="vertical-align: inherit;">что </font></font> <code>localCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является случай </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чувствительной</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要注意的是</font></font> <code>localCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的情况下，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">敏感</font></font>

source: Number() function
es: Función de número()
ja: Number()関数
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 () 함수</font></font>
ru: Функция Number()
zh_cn: Number()函数

source: Or after ES6 version:
es: O después de la versión ES6:
ja: もしくはES6版以降。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 ES6 버전 이후 :</font></font>
ru: Или после версии ES6:
zh_cn: 或者是在ES6版本之后。

source: Same letter (A/a, B/b) values should be grouped together
es: Los mismos valores de letras (Aa,Bb)deben ser agrupados
ja: 同一文字(Aa、Bb)の値はグループ化してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한 문자 (A / a, B / b) 값을 함께 그룹화해야합니다</font></font>
ru: Значения одной и той же буквы (Aa,Bb)должны быть сгруппированы вместе.
zh_cn: 同一字母(Aa、Bb)的值应归为一组。

source: Setting unsorted data
es: Establecer datos sin clasificar
ja: ソートされていないデータを設定する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬되지 않은 데이터 설정</font></font>
ru: Установка несортированных данных
zh_cn: 设置未排序数据

source: Some documentation can be found <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Alguna documentaci&oacute;n se puede encontrar </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いくつかのドキュメントは</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここにあります</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 설명서는 </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 찾을 수 </font><font style="vertical-align: inherit;">있습니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Некоторая документация может быть найдена </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一些文档可以在</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/sort"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到</font><font style="vertical-align: inherit;">。</font></font>

source: Sort alphabetically A-Z
es: Ordenar alfabéticamente de la A a la Z
ja: アルファベット順に並べ替え
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알파벳순으로 AZ 정렬</font></font>
ru: Сортировать по алфавиту A-Z
zh_cn: 按字母顺序A-Z排序

source: Sort homes by price in ascending order:
es: Ordena las casas por precio en orden ascendente:
ja: 価格の高い順に家を並べ替えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가격을 기준으로 오름차순으로 집 정렬 :</font></font>
ru: Сортируйте дома по цене в порядке возрастания:
zh_cn: 按价格依次排序的房屋。

source: Sorting an array of objects by property values
es: Clasificar un conjunto de objetos por valores de propiedad
ja: プロパティ値によるオブジェクトの配列のソート
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 값을 기준으로 객체 배열 정렬</font></font>
ru: Сортировка массива объектов по значениям свойств
zh_cn: 按属性值排序对象的数组

source: Sorting by multiple keys:
es: Clasificando por múltiples claves:
ja: 複数のキーでソートします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 키를 기준으로 정렬 :</font></font>
ru: Сортировка по нескольким клавишам:
zh_cn: 按多键排序。

source: Sorting by nested properties with dot-syntax or array-syntax:
es: Clasificar por propiedades anidadas con sintaxis de puntos o de matrices:
ja: dot-syntax または array-syntax を使用した入れ子になったプロパティによる並べ替え。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도트 구문 또는 배열 구문을 사용하여 중첩 된 속성을 기준으로 정렬 :</font></font>
ru: Сортировка по вложенным свойствам с синтаксисом точек или массивов:
zh_cn: 用点-syntax或数组-syntax按嵌套属性排序。

source: Thanks to <strong>@Ozesh</strong> by his feedback, the issue related to properties with <em><strong>falsy</strong></em> values was fixed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gracias a </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ozesh</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por sus comentarios, </font><font style="vertical-align: inherit;">se solucion&oacute; </font><font style="vertical-align: inherit;">el problema relacionado con las propiedades con </font><font style="vertical-align: inherit;">valores </font></font><em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">falsos</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">彼のフィードバックによる</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ozeshの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おかげで</font><font style="vertical-align: inherit;">、</font></font><em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">偽の</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値</font><font style="vertical-align: inherit;">を持つプロパティに関連する問題</font><font style="vertical-align: inherit;">が修正されました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">감사 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ozesh</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그 피드백에 의해이 특성과 관련된 문제 </font></font><em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">falsy</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값으로 고정 하였다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Благодаря </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ozesh</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по его отзывам, проблема, связанная со свойствами с </font></font><em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ложными</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> значениями, была исправлена.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">感谢</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ozesh</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的反馈，解决了与</font></font><em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">伪造</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性有关的问题</font><font style="vertical-align: inherit;">。</font></font>

source: The difference between ascending and descending sort order is the sign of the value returned by your compare function:
es: La diferencia entre el orden de clasificación ascendente y descendente es el signo del valor devuelto por su función de comparación:
ja: 昇順と降順の違いは、比較関数が返す値の符号です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오름차순 정렬 순서와 내림차순 정렬 순서의 차이는 비교 함수에서 반환 된 값의 부호입니다.</font></font>
ru: Разница между порядком сортировки по возрастанию и по убыванию является признаком значения,возвращаемого функцией сравнения:
zh_cn: 升序和降序排序的区别在于你的比较函数返回的值的符号。

source: Then you can apply this to any object property:
es: Entonces puedes aplicar esto a cualquier propiedad del objeto:
ja: そして、これを任意のオブジェクトプロパティに適用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음이를 모든 객체 속성에 적용 할 수 있습니다.</font></font>
ru: Тогда вы можете применить это к любому объекту собственности:
zh_cn: 那么你可以将其应用于任何对象属性。

source: This could have been achieved through a simple one line <strong>valueof()</strong> sort function. Run code snippet below to see demo.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto podr&iacute;a haberse logrado a trav&eacute;s de una funci&oacute;n simple de valor de una l&iacute;nea de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">()</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ejecute el fragmento de c&oacute;digo a continuaci&oacute;n para ver la demostraci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、単純な1行の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">valueof（）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソート関数</font><font style="vertical-align: inherit;">によって実現できたはず</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">デモを表示するには、以下のコードスニペットを実行してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 간단한 한 줄 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">valueof ()</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정렬 함수를 </font><font style="vertical-align: inherit;">통해 달성 할 수있었습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">데모를 보려면 아래 코드 스 니펫을 실행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этого можно было бы достичь с помощью простой однострочной </font><font style="vertical-align: inherit;">функции сортировки </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">valueof ()</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Запустите фрагмент кода ниже, чтобы увидеть демо.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这可以通过简单的一行</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">valueof（）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排序函数来实现。</font><font style="vertical-align: inherit;">运行下面的代码片段以查看演示。</font></font>

source: This solution compares only strings in ascending order, but the solution can be easy extended for each attribute to support: reverse ordering, other data types, to use locale, casting etc
es: Esta solución sólo compara las cadenas en orden ascendente,pero la solución puede extenderse fácilmente para cada atributo para apoyar:el orden inverso,otros tipos de datos,para utilizar la localización,el casting,etc.
ja: このソリューションは文字列のみを昇順で比較しますが、各属性ごとに簡単に拡張して、逆順、他のデータ型、ロケールの使用、キャストなどをサポートすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 솔루션은 문자열 만 오름차순으로 비교하지만 역순, 기타 데이터 유형, 로케일 사용, 캐스팅 등 각 속성에 대해 솔루션을 쉽게 확장 할 수 있습니다.</font></font>
ru: Это решение сравнивает только строки в порядке возрастания,но решение может быть легко расширена для каждого атрибута для поддержки:обратный заказ,другие типы данных,чтобы использовать локаль,кастинг и т.д.
zh_cn: 这个解决方案只比较了按升序排列的字符串,但该解决方案可以很容易地扩展到每个属性,支持:反向排序、其他数据类型、使用locale、铸造等。

source: This tells the function to sort uppercase values before lowercase values. The second parameter in the <code>localeCompare</code> function is to define the locale but if you leave it as <code>undefined</code> it automatically figures out the locale for you.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto le dice a la funci&oacute;n que ordene los valores en may&uacute;scula antes que los valores en min&uacute;scula. </font><font style="vertical-align: inherit;">El segundo par&aacute;metro en la </font><font style="vertical-align: inherit;">funci&oacute;n </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es definir el entorno local, pero si lo deja como </font></font> <code>undefined</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , autom&aacute;ticamente descubrir&aacute; el entorno local por usted.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、小文字の値の前に大文字の値をソートするように関数に指示します。</font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font><font style="vertical-align: inherit;">の2番目のパラメーター</font><font style="vertical-align: inherit;">はロケールを定義することですが、</font></font> <code>undefined</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すると、自動的に</font><font style="vertical-align: inherit;">ロケールが計算さ</font><font style="vertical-align: inherit;">れます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 함수가 대문자 값을 소문자 값보다 먼저 정렬하도록 지시합니다. </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수 </font><font style="vertical-align: inherit;">의 두 번째 매개 변수 </font><font style="vertical-align: inherit;">는 로케일을 정의하는 것이지만 </font></font> <code>undefined</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 상태로두면 </font><font style="vertical-align: inherit;">자동으로 로케일이 계산됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это говорит функции сортировать заглавные значения перед строчными. </font><font style="vertical-align: inherit;">Второй параметр в </font><font style="vertical-align: inherit;">функции </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это определение языкового стандарта, но если вы оставите его как </font></font> <code>undefined</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> он автоматически определит для вас языковой стандарт.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这告诉函数将大写值排在小写值之前。</font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数中</font><font style="vertical-align: inherit;">的第二个参数</font><font style="vertical-align: inherit;">是定义语言环境，但是如果您将其保留为</font></font> <code>undefined</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它将自动为您找出语言环境。</font></font>

source: This works the same for sorting an array of objects as well:
es: Esto funciona de la misma manera para clasificar una serie de objetos también:
ja: これはオブジェクトの配列をソートするときにも同じように動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 객체 배열을 정렬 할 때도 동일하게 작동합니다.</font></font>
ru: То же самое работает и при сортировке массива объектов:
zh_cn: 这对于排序对象的数组也是一样的。

source: To sort it you need to create a comparator function taking two arguments. Then call the sort function with that comparator function as follows:
es: Para clasificarlo necesitas crear una función de comparación tomando dos argumentos.Entonces llama a la función de clasificación con esa función de comparación de la siguiente manera:
ja: ソートするには、2つの引数を取るコンパレータ関数を作成する必要があります。そして、そのコンパレータ関数を使って次のようにソート関数を呼び出します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬하려면 두 개의 인수를 사용하는 비교기 함수를 작성해야합니다. </font><font style="vertical-align: inherit;">그런 다음 다음과 같이 해당 비교기 함수를 사용하여 정렬 함수를 호출하십시오.</font></font>
ru: Для сортировки необходимо создать функцию компаратора,принимающую два аргумента.Затем вызовите функцию сортировки с этой функцией компаратора следующим образом:
zh_cn: 要对其进行排序,你需要创建一个比较器函数,它包含两个参数。然后用该比较器函数调用排序函数,如下所示。

source: Uppercase values of the same word should come before lowercase values
es: Los valores en mayúsculas de la misma palabra deben preceder a los valores en minúsculas
ja: 同じ単語の大文字の値は、小文字の値の前に来るべきです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은 단어의 대문자 값은 소문자 값 앞에 와야합니다</font></font>
ru: Прописные значения одного и того же слова должны предшествовать строчным значениям
zh_cn: 同一单词的大写值应排在小写值之前。
