Repository: rueisnom/feedback
Catalog: xlf/97/92/56/979256.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Use <a href="https://lodash.com/docs#sortBy">lodash.sortBy</a>, (instructions using commonjs, you can also just put the <a href="https://www.jsdelivr.com/projects/lodash">script include-tag for the cdn</a> at the top of your html)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font><a href="https://lodash.com/docs#sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lodash.sortBy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , (instrucciones usando commonjs, tambi&eacute;n puede poner el </font></font><a href="https://www.jsdelivr.com/projects/lodash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">script include-tag para el cdn</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la parte superior de su html)</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://lodash.com/docs#sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lodash.sortByを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">（</font><font style="vertical-align: inherit;">commonjsを</font><font style="vertical-align: inherit;">使用する</font><font style="vertical-align: inherit;">手順</font><font style="vertical-align: inherit;">、</font></font><a href="https://www.jsdelivr.com/projects/lodash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cdnのスクリプトinclude-tagを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> HTMLの上部に</font><font style="vertical-align: inherit;">配置することもでき</font><font style="vertical-align: inherit;">ます）</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://lodash.com/docs#sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lodash.sortBy를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하십시오 ( </font><font style="vertical-align: inherit;">commonjs를</font><font style="vertical-align: inherit;"> 사용하는 </font><font style="vertical-align: inherit;">지침 </font><font style="vertical-align: inherit;">은 HTML 상단에 </font><font style="vertical-align: inherit;">cdn에 대한 </font></font><a href="https://www.jsdelivr.com/projects/lodash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스크립트 include-tag를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 넣을 수도 있습니다 </font><font style="vertical-align: inherit;">)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font><a href="https://lodash.com/docs#sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lodash.sortBy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (инструкции, использующие commonjs, вы также можете просто поместить </font></font><a href="https://www.jsdelivr.com/projects/lodash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">скрипт include-тега для cdn</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вверху вашего html)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><a href="https://lodash.com/docs#sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lodash.sortBy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（使用commonjs的指令，您也可以将cdn的</font></font><a href="https://www.jsdelivr.com/projects/lodash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">脚本include-tag</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">放在html的顶部）</font></font>

source: Using it
es: Usarlo
ja: それを使って
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것을 사용하여</font></font>
ru: Используя его
zh_cn: 使用它

source: What I expect is <code>[ A, a, B, b, C, c ]</code> but the answers above return <code>A, B, C, a, b, c</code>. I actually scratched my head on this for longer than I wanted (which is why I am posting this in hopes that it will help at least one other person). While two users mention the <code>localeCompare</code> function in the comments for the marked answer, I didn't see that until after I stumbled upon the function while searching around. After reading <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare">the String.prototype.localeCompare() documentation</a> I was able to come up with this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo que espero es </font></font> <code>[ A, a, B, b, C, c ]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero las respuestas anteriores devuelven </font></font> <code>A, B, C, a, b, c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">De hecho, me rasqu&eacute; la cabeza por m&aacute;s tiempo de lo que quer&iacute;a (por eso publico esto con la esperanza de que ayude al menos a otra persona). </font><font style="vertical-align: inherit;">Si bien dos usuarios mencionan la </font><font style="vertical-align: inherit;">funci&oacute;n </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en los comentarios para la respuesta marcada, no lo vi hasta despu&eacute;s de tropezar con la funci&oacute;n mientras buscaba. </font><font style="vertical-align: inherit;">Despu&eacute;s de leer </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la documentaci&oacute;n de String.prototype.localeCompare ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pude llegar a esto:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が期待するのは</font></font> <code>[ A, a, B, b, C, c ]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が、上記の答えは</font></font> <code>A, B, C, a, b, c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">私は実際に思ったよりも長い間、これに頭を悩ませました（これが、少なくとも1人の人の役に立つことを期待してこれを投稿している理由です）。</font><font style="vertical-align: inherit;">2人のユーザー</font><font style="vertical-align: inherit;">がマークされた回答のコメントで</font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font><font style="vertical-align: inherit;">について言及</font><font style="vertical-align: inherit;">していますが、周りを検索しているときにその関数に出会うまでは、そのことを知りませんでした。</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.prototype.localeCompare（）のドキュメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">読んだ後</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">私はこれを思いつくことができました：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 기대하는 것은 </font></font> <code>[ A, a, B, b, C, c ]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이지만 위의 답변은 </font></font> <code>A, B, C, a, b, c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반환 </font><font style="vertical-align: inherit;">합니다. 나는 실제로 내가 원하는 것보다 더 오랫동안 이것에 대해 머리를 긁었다 (그래서 나는 이것이 적어도 다른 사람에게 도움이되기를 희망하여 이것을 게시하고있다). 두 명의 사용자 </font><font style="vertical-align: inherit;">가 표시된 답변에 대한 설명에서 </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수를 </font><font style="vertical-align: inherit;">언급 </font><font style="vertical-align: inherit;">했지만 검색하는 동안 함수를 우연히 만날 때까지는 보지 못했습니다. </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.prototype.localeCompare () 문서를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 읽은 후에 </font><font style="vertical-align: inherit;">나는 이것을 생각해 낼 수있었습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я ожидаю, что </font></font> <code>[ A, a, B, b, C, c ]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> но ответы выше возвращают </font></font> <code>A, B, C, a, b, c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Я на самом деле почесал голову над этим дольше, чем хотел (вот почему я публикую это в надежде, что это поможет хотя бы одному человеку). </font><font style="vertical-align: inherit;">В то время как два пользователя упоминают </font><font style="vertical-align: inherit;">функцию </font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в комментариях для помеченного ответа, я не видел этого до тех пор, пока не наткнулся на функцию при поиске. </font><font style="vertical-align: inherit;">После прочтения </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">документации String.prototype.localeCompare ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> я смог придумать это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我期望的是</font></font> <code>[ A, a, B, b, C, c ]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但上面的答案返回</font></font> <code>A, B, C, a, b, c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">实际上，我在这个问题上挠头的时间比我想要的要长（这就是为什么我发布此文档，希望它可以帮助至少一个其他人）。</font><font style="vertical-align: inherit;">虽然有两个用户</font><font style="vertical-align: inherit;">在注释中为标记的答案</font><font style="vertical-align: inherit;">提到了</font></font> <code>localeCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数，但是直到我在搜索时偶然发现该函数后，我才看到它。</font><font style="vertical-align: inherit;">阅读</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.prototype.localeCompare（）文档后，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我可以提出以下建议：</font></font>

source: While I am aware that the OP wanted to sort an array of numbers, this question has been marked as the answer for similar questions regarding strings. To that fact, the above answers do not consider sorting an array of text where casing is important. Most answers take the string values and convert them to uppercase/lowercase and then sort one way or another. The requirements that I adhere to are simple:
es: Aunque soy consciente de que la OP quería clasificar una serie de números,esta pregunta ha sido marcada como la respuesta a preguntas similares relativas a las cuerdas.A este hecho,las respuestas anteriores no consideran la clasificación de un conjunto de texto donde la carcasa es importante.La mayoría de las respuestas toman los valores de las cadenas y los convierten a mayúsculas y minúsculas y luego los ordenan de una manera u otra.Los requisitos a los que me adhiero son simples:
ja: OPが数字の配列をソートしたいと思っていたことは承知していますが、この質問は文字列に関する同様の質問に対する回答としてマークされています。それほどまでに、上記の回答では、文字列の配列をソートする際に大文字小文字が重要になることは考慮していません。ほとんどの回答は、文字列の値を取り、大文字小文字に変換してから、1つの方法または別の方法でソートします。私が守るべき要件は単純です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP가 숫자 배열을 정렬하려고한다는 것을 알고 있지만이 질문은 문자열에 관한 비슷한 질문에 대한 답변으로 표시되었습니다. </font><font style="vertical-align: inherit;">사실 위의 답변은 대소 문자가 중요한 텍스트 배열을 정렬하는 것을 고려하지 않습니다. </font><font style="vertical-align: inherit;">대부분의 답변은 문자열 값을 사용하여 대문자 / 소문자로 변환 한 다음 한 가지 방법으로 정렬합니다. </font><font style="vertical-align: inherit;">내가 준수하는 요구 사항은 간단합니다.</font></font>
ru: Хотя я знаю,что ОП хотел отсортировать массив чисел,этот вопрос был отмечен как ответ на аналогичные вопросы,касающиеся строк.На этот факт вышеприведенные ответы не рассматривают сортировку массива текста,где важна оболочка.Большинство ответов берут строковые значения и преобразуют их в заглавные и строчные,а затем сортируют тем или иным способом.Требования,которых я придерживаюсь,просты:
zh_cn: 虽然我知道OP想要对数字数组进行排序,但这个问题已经被标记为类似于字符串的问题的答案。事实上,以上的答案并没有考虑到对字符串的排序,因为字符串的大小写很重要。大多数答案都是把字符串的值转换成大写的小写的,然后进行这样或那样的排序。我所坚持的要求很简单。

source: While it is a bit of an overkill for just sorting a single array, this prototype function allows to sort Javascript arrays by any key, in ascending or descending order, <strong>including nested keys</strong>, using <code>dot</code> syntax.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si bien es un poco exagerado solo para ordenar una sola matriz, esta funci&oacute;n prototipo permite ordenar las matrices Javascript por cualquier tecla, en orden ascendente o descendente, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">incluidas las teclas anidadas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , utilizando </font></font> <code>dot</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sintaxis de </font><font style="vertical-align: inherit;">puntos</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">単一の配列を並べ替えるだけでは少しやり過ぎですが、このプロトタイプ関数を使用すると</font><font style="vertical-align: inherit;">、</font> <code>dot</code> <font style="vertical-align: inherit;">構文</font><font style="vertical-align: inherit;">を使用して、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ネストされたキーを含め</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、任意のキーでJavascript配列を昇順または降順に並べ替えることができ</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 배열을 정렬하는 데 약간의 과도한 노력이지만,이 프로토 타입 함수를 사용하면 </font> <code>dot</code> <font style="vertical-align: inherit;"> 구문을 </font><font style="vertical-align: inherit;">사용 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하여 중첩 키를 포함하여</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 오름차순 또는 내림차순으로 키별로 Javascript 배열을 정렬 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя это немного излишне для простой сортировки одного массива, эта функция-прототип позволяет сортировать массивы Javascript по любому ключу в порядке возрастания или убывания, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">включая вложенные ключи</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используя </font></font> <code>dot</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> синтаксис.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">虽然仅对单个数组进行排序有点过头，但是此原型函数允许</font><font style="vertical-align: inherit;">使用</font> <code>dot</code> <font style="vertical-align: inherit;">语法</font><font style="vertical-align: inherit;">按任意键以升序或降序（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包括嵌套键）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对Javascript数组进行排序</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: With ECMAScript 6 StoBor's answer can be done even more concise:
es: Con ECMAScript 6 la respuesta de StoBor puede ser aún más concisa:
ja: ECMAScript 6 を使うことで、StoBor の答えがさらに簡潔にできるようになりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6를 사용하면 StoBor의 답변을 훨씬 간결하게 수행 할 수 있습니다.</font></font>
ru: С помощью ECMAScript 6 ответ StoBor можно сделать еще более лаконичным:
zh_cn: 有了ECMAScript 6 StoBor的答案可以做得更简洁。

source: You can fork the repo: <a href="https://github.com/eneko/Array.sortBy">https://github.com/eneko/Array.sortBy</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede bifurcar el repositorio: </font></font><a href="https://github.com/eneko/Array.sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/eneko/Array.sortBy</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">レポをフォークすることができ</font><a href="https://github.com/eneko/Array.sortBy"><font style="vertical-align: inherit;">ます</font></a><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">https</font><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/eneko/Array.sortBy</font></font>
ko: <font style="vertical-align: inherit;"><a href="https://github.com/eneko/Array.sortBy"><font style="vertical-align: inherit;">https://github.com/eneko/Array.sortBy를</font></a><font style="vertical-align: inherit;"> 통해 저장소를 포크 할 수 있습니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете раскошелиться на репо: </font></font><a href="https://github.com/eneko/Array.sortBy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/eneko/Array.sortBy</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以分叉仓库：</font><a href="https://github.com/eneko/Array.sortBy"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/eneko/Array.sortBy</font></font>

source: You can sort ascending as well as descending and chain sort by multiple properties.
es: Puedes clasificar tanto ascendentes como descendentes y clasificar en cadena por múltiples propiedades.
ja: 昇順ソートだけでなく、降順ソートや複数のプロパティによるチェーンソートも可能です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 속성으로 오름차순 및 내림차순 및 체인 정렬을 정렬 할 수 있습니다.</font></font>
ru: Вы можете сортировать как по восходящей,так и по нисходящей и по цепочке по нескольким свойствам.
zh_cn: 您可以按多个属性进行升序排序,也可以进行降序排序和链式排序。

source: You can use string1.localeCompare(string2) for string comparison
es: Puedes usar string1.localeCompare(string2)para la comparación de cadenas
ja: 文字列比較には string1.localeCompare(string2)を使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 비교에 string1.localeCompare (string2)를 사용할 수 있습니다</font></font>
ru: Для сравнения строк можно использовать string1.localeCompare(string2).
zh_cn: 你可以使用string1.localeCompare(string2)进行字符串比较。

source: You can use the JavaScript <code>sort</code> method with a callback function:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar el </font><font style="vertical-align: inherit;">m&eacute;todo de </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">con una funci&oacute;n de devoluci&oacute;n de llamada:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptの</font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドをコールバック関数で</font><font style="vertical-align: inherit;">使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">콜백 함수와 함께 </font><font style="vertical-align: inherit;">JavaScript </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font><font style="vertical-align: inherit;">метод </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">с функцией обратного вызова:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以将JavaScript </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法与回调函数一起使用：</font></font>
