Repository: rueisnom/feedback
Catalog: xlf/97/92/56/979256.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>NOTE</strong>: This version of <code>by</code> is <strong>stable</strong>. It preserves the order of the first sort while performing the next chained sort.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NOTA</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Esta versi&oacute;n de </font></font> <code>by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">estable</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Conserva el orden del primer tipo mientras realiza el siguiente tipo encadenado.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font> <code>by</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このバージョン</font><font style="vertical-align: inherit;">は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">安定してい</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">次の連鎖ソートを実行しながら、最初のソートの順序を保持します。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :이 버전의 </font></font> <code>by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안정적</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">다음 체인 정렬을 수행하는 동안 첫 번째 정렬 순서를 유지합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Эта версия </font></font> <code>by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стабильной</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он сохраняет порядок первой сортировки при выполнении следующей цепочки сортировки.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：此版本的</font></font> <code>by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">稳定的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在执行下一个链式排序时，它将保留第一个排序的顺序。</font></font>

source: <strong>Sort numbers (alphabetically and ascending):</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ordenar n&uacute;meros (alfab&eacute;ticamente y ascendentes):</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソート番号（アルファベット順および昇順）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알파벳순 및 오름차순으로 숫자 정렬 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сортировка чисел (по алфавиту и по возрастанию):</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排序数字（按字母顺序和升序排列）：</font></font></strong>

source: <strong>Sort numbers (alphabetically and descending):</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ordenar n&uacute;meros (alfab&eacute;ticamente y descendentes):</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソート番号（アルファベット順および降順）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알파벳순 및 내림차순으로 숫자 정렬 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сортировка чисел (по алфавиту и по убыванию):</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排序数字（按字母顺序和降序排列）：</font></font></strong>

source: <strong>Sort numbers (numerically and ascending):</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ordenar n&uacute;meros (num&eacute;ricos y ascendentes):</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">番号を並べ替える（数値および昇順）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 정렬 (숫자 및 오름차순) :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сортировка чисел (по возрастанию):</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排序数字（数字和升序）：</font></font></strong>

source: <strong>Sort numbers (numerically and descending):</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ordenar n&uacute;meros (num&eacute;ricamente y descendentes):</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">並べ替え番号（数値順および降順）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 정렬 (숫자 및 내림차순) :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сортировка чисел (по номерам и по убыванию):</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排序数字（数字和降序）：</font></font></strong>

source: A simple code :
es: Un simple código:
ja: シンプルなコード .
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 코드 :</font></font>
ru: Простой код :
zh_cn: 一个简单的代码。

source: Arrange the array, by <code>"date"</code> as <code>String</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Organice la matriz, por </font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como </font></font> <code>String</code>
ja: <font style="vertical-align: inherit;"></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font> <code>String</code> <font style="vertical-align: inherit;">として</font><font style="vertical-align: inherit;">配列を配置し</font><font style="vertical-align: inherit;">ます</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에 의해 배열, 정렬 </font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같은 </font></font> <code>String</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Упорядочить массив по </font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как </font></font> <code>String</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">排列数组，以</font></font> <code>"date"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为</font></font> <code>String</code>

source: Arrow functions
es: Funciones de las flechas
ja: 矢印関数
ko: 화살표 기능
ru: Функции стрелок
zh_cn: 箭头功能

source: As above use sorterPriceAsc and sorterPriceDes method with your array with desired key.
es: Como arriba,use el método sorterPriceAsc y sorterPriceDes con su matriz con la tecla deseada.
ja: 上記のように、希望のキーを持つ配列でsorterPriceAscとsorterPriceDesメソッドを使用してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위에서와 같이 sorterPriceAsc 및 sorterPriceDes 메소드를 원하는 키로 배열과 함께 사용하십시오.</font></font>
ru: Как и выше,используйте метод сортировкиPriceAsc и метод сортировкиPriceDes с вашим массивом с нужным ключом.
zh_cn: 如上所述,使用sorterPriceAsc和sorterPriceDes方法与你的数组中的key一起使用。

source: Ascending order
es: Orden ascendente
ja: 昇順
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오름차순</font></font>
ru: Возрастающий ордер
zh_cn: 升序

source: Ascending order of price:
es: Orden ascendente del precio:
ja: 価格の昇順。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가격 오름차순 :</font></font>
ru: Возрастающий порядок цены:
zh_cn: 按价格高低排序。

source: But for now we are going to try this approach <a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37">Gist: sortBy-old.js</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero por ahora vamos a probar este enfoque </font></font><a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gist: sortBy-old.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし今のところ、このアプローチ</font></font><a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gist：sortBy-old.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を試してみましょう</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 지금은 </font></font><a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gist : sortBy-old.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 접근 방식을 시도 할 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но сейчас мы собираемся попробовать этот подход </font></font><a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gist: sortBy-old.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是现在，我们将尝试这种方法</font></font><a href="https://gist.github.com/jherax/8781f45dcd068a9e3e37"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gist：sortBy-old.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Create a function and sort based on the input using below code
es: Crear una función y ordenar en base a la entrada usando el siguiente código
ja: 以下のコードを使用して関数を作成し、入力に基づいてソートします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 코드를 사용하여 입력을 기반으로 함수를 만들고 정렬</font></font>
ru: Создайте функцию и отсортируйте по входу,используя нижеприведенный код
zh_cn: 使用下面的代码创建一个函数,并根据输入进行排序。

source: Creating the sorting function
es: Creando la función de clasificación
ja: ソート機能の作成
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬 기능 만들기</font></font>
ru: Создание функции сортировки
zh_cn: 创建分类功能

source: Descending order
es: Orden descendente
ja: 降順
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내림차순</font></font>
ru: Постепенный порядок
zh_cn: 递减顺序

source: Descending order of price:
es: Orden descendente del precio:
ja: 価格の降順。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가격의 내림차순 :</font></font>
ru: Постепенный порядок цены:
zh_cn: 按价格高低排序。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Fiddle validation: <a href="http://jsfiddle.net/bobberino/4qqk3/">http://jsfiddle.net/bobberino/4qqk3/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Validaci&oacute;n de viol&iacute;n: </font></font><a href="http://jsfiddle.net/bobberino/4qqk3/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/bobberino/4qqk3/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィドル検証：</font><a href="http://jsfiddle.net/bobberino/4qqk3/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/bobberino/4qqk3/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바이올린 유효성 검사 : </font></font><a href="http://jsfiddle.net/bobberino/4qqk3/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/bobberino/4qqk3/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверка скрипки: </font></font><a href="http://jsfiddle.net/bobberino/4qqk3/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/bobberino/4qqk3/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">小提琴验证：</font><a href="http://jsfiddle.net/bobberino/4qqk3/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/bobberino/4qqk3/</font></font>

source: For a normal array of elements values only:
es: Sólo para un conjunto normal de valores de elementos:
ja: 通常の配列の要素値のみの場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요소 값의 일반 배열에만 해당 :</font></font>
ru: Только для обычного массива значений элементов:
zh_cn: 仅用于普通数组的元素值。

source: For an array of objects:
es: Para un conjunto de objetos:
ja: オブジェクトの配列の場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 배열의 경우 :</font></font>
ru: Для массива объектов:
zh_cn: 对于一个对象的数组。

source: For sort on multiple array object field. Enter your field name in <code>arrprop</code> array like <code>["a","b","c"]</code> then pass in second parameter <code>arrsource</code> actual source we want to sort.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para ordenar en campo de objeto de matriz m&uacute;ltiple. </font><font style="vertical-align: inherit;">Introduzca su nombre de campo en </font></font> <code>arrprop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> matriz como </font></font> <code>["a","b","c"]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> luego pasar en segundo par&aacute;metro </font></font> <code>arrsource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> fuente real que desea ordenar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数の配列オブジェクトフィールドでのソート用。</font> <code>["a","b","c"]</code> <font style="vertical-align: inherit;">ような</font></font> <code>arrprop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列に</font><font style="vertical-align: inherit;">フィールド名を入力してから</font><font style="vertical-align: inherit;"> 、2番目のパラメーター</font> <code>arrsource</code> でソートする<font style="vertical-align: inherit;">実際のソースを</font><font style="vertical-align: inherit;">渡し</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 배열 객체 필드에서 정렬합니다. </font> <code>["a","b","c"]</code> <font style="vertical-align: inherit;"> 와 같이 </font></font> <code>arrprop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열에 </font><font style="vertical-align: inherit;">필드 이름을 입력 </font><font style="vertical-align: inherit;"> 한 다음 </font><font style="vertical-align: inherit;">정렬하려는 </font><font style="vertical-align: inherit;">두 번째 매개 변수 </font> <code>arrsource</code> <font style="vertical-align: inherit;"> 실제 소스 </font><font style="vertical-align: inherit;">를 전달하십시오 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для сортировки по нескольким объектам поля. </font><font style="vertical-align: inherit;">Введите имя поля в </font><font style="vertical-align: inherit;">массиве </font></font> <code>arrprop</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> например </font></font> <code>["a","b","c"]</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем передайте второй параметр </font></font> <code>arrsource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> фактический источник, который мы хотим отсортировать.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于对多个数组对象字段进行排序。</font><font style="vertical-align: inherit;">在</font></font> <code>arrprop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组中</font><font style="vertical-align: inherit;">输入您的字段名称，</font><font style="vertical-align: inherit;">例如</font></font> <code>["a","b","c"]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 然后传入</font><font style="vertical-align: inherit;">我们要排序的</font><font style="vertical-align: inherit;">第二个参数</font></font> <code>arrsource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际源。</font></font>

source: For sorting a array you must define a comparator function. This function always be different on your desired sorting pattern or order(i.e. ascending or descending).
es: Para clasificar una matriz debes definir una función de comparación.Esta función siempre será diferente en su patrón u orden de clasificación deseado (es decir,ascendente o descendente).
ja: 配列をソートするには、コンパレータ関数を定義する必要があります。この関数は,ソートのパターンや順序(昇順,降順など)によって常に異なります.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 정렬하려면 비교기 함수를 정의해야합니다. </font><font style="vertical-align: inherit;">이 기능은 원하는 정렬 패턴 또는 순서 (예 : 오름차순 또는 내림차순)에서 항상 다릅니다.</font></font>
ru: Для сортировки массива необходимо определить функцию компаратора.Эта функция всегда будет отличаться на нужной детали или порядке сортировки (т.е.по восходящей или нисходящей).
zh_cn: 对于一个数组的排序,你必须定义一个比较器函数。这个函数总是根据你所希望的排序模式或顺序(即升序或降序)而有所不同。

source: Here is a culmination of all answers above.
es: Aquí está la culminación de todas las respuestas anteriores.
ja: 上記の回答の集大成がここにあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 모든 답변의 정점은 다음과 같습니다.</font></font>
ru: Вот кульминация всех вышеприведенных ответов.
zh_cn: 下面是上面所有答案的高潮。

source: Here is a slightly modified version of elegant implementation from the book "JavaScript: The Good Parts".
es: Aquí hay una versión ligeramente modificada de la elegante implementación del libro "JavaScript":Las partes buenas".
ja: ここでは、「JavaScript」という本の中から、エレガントな実装を少し修正したものを紹介します。The Good Parts "に掲載されているエレガントな実装を少し修正したものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 "JavaScript : The Good Parts"책에서 약간 수정 된 고급 구현입니다.</font></font>
ru: Вот несколько измененная версия элегантной реализации из книги "JavaScript:Хорошие части".
zh_cn: 这里是对《JavaScript》一书中的优雅实现略作修改的版本。好的部分"。

source: Here you can play with the code: <a href="http://jsbin.com/lesebi/edit?js,console">jsbin.com/lesebi</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; puedes jugar con el c&oacute;digo: </font></font><a href="http://jsbin.com/lesebi/edit?js,console"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsbin.com/lesebi</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここであなたはコードで遊ぶことができます： </font></font><a href="http://jsbin.com/lesebi/edit?js,console"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsbin.com/lesebi</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 코드로 재생할 수 있습니다 : </font></font><a href="http://jsbin.com/lesebi/edit?js,console"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsbin.com/lesebi</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь вы можете поиграть с кодом: </font></font><a href="http://jsbin.com/lesebi/edit?js,console"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsbin.com/lesebi</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以在此处使用以下代码： </font></font><a href="http://jsbin.com/lesebi/edit?js,console"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsbin.com/lesebi</font></font></a>

source: Here's a more flexible version, which allows you to create reusable sort functions, and sort by any field.
es: Aquí hay una versión más flexible,que permite crear funciones de clasificación reutilizables,y clasificar por cualquier campo.
ja: これは、再利用可能なソート関数を作成したり、任意のフィールドでソートしたりできる、より柔軟なバージョンです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 재사용 가능한 정렬 함수를 만들고 필드별로 정렬 할 수있는보다 유연한 버전입니다.</font></font>
ru: Вот более гибкая версия,которая позволяет создавать многократно используемые функции сортировки,а также сортировать по любому полю.
zh_cn: 这里有一个更灵活的版本,它允许你创建可重复使用的排序函数,并通过任意字段进行排序。

source: Here's a working code snippet:
es: Aquí hay un fragmento de código de trabajo:
ja: ここに作業用のコードスニペットがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동하는 코드 스 니펫은 다음과 같습니다.</font></font>
ru: Вот рабочий фрагмент кода:
zh_cn: 这里是一个工作代码片段。
