Repository: rueisnom/feedback
Catalog: xlf/25/70/62/16/25706216.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Literals: like <code>42</code> and <code>'X'</code> and <code>"Hi mum!"</code>.
es: Literales: como <code>42</code> y <code>'X'</code> y <code>"Hi mum!"</code> .
ja: リテラル： <code>42</code> や <code>'X'</code> や <code>"Hi mum!"</code> など 。
ko: 리터럴 : <code>42</code> 와 같은 <code>'X'</code> 와 <code>"Hi mum!"</code> .
ru: Литералы: как <code>42</code> и <code>'X'</code> и <code>"Hi mum!"</code> ,
zh_cn: 文字：例如 <code>42</code> 和 <code>'X'</code> 以及 <code>"Hi mum!"</code> 。

source: Look at the line in the file indicated by the compilation error message.
es: Mira la línea del archivo indicada por el mensaje de error de compilación.
ja: コンパイルエラーメッセージが表示されているファイルの行を見てください。
ko: 컴파일 오류 메시지로 표시된 파일의 행을보십시오.
ru: Посмотрите на строку в файле,на которую указывает сообщение об ошибке компиляции.
zh_cn: 看一下文件中的编译错误信息所表示的行。

source: Move <code>context.xml</code> file from <code>src/java/package</code> to the <code>resource</code> directory (IntelliJ IDE)
es: Mueva el archivo <code>context.xml</code> de <code>src/java/package</code> al directorio de <code>resource</code> (IntelliJ IDE)
ja: <code>context.xml</code> ファイルを <code>src/java/package</code> から <code>resource</code> ディレクトリに移動します（IntelliJ IDE）
ko: <code>context.xml</code> 파일을 <code>src/java/package</code> 에서 <code>resource</code> 디렉토리 (IntelliJ IDE)로 이동
ru: Переместите файл <code>context.xml</code> из <code>src/java/package</code> в каталог <code>resource</code> (IntelliJ IDE)
zh_cn: 将 <code>context.xml</code> 文件从 <code>src/java/package</code> 移到 <code>resource</code> 目录（IntelliJ IDE）

source: Not really. "Cannot find symbol" and "Cannot resolve symbol" mean the same thing. Some Java compilers use one phrase, and some the other one.
es: En realidad no."No puedo encontrar el símbolo" y "No puedo resolver el símbolo" significan lo mismo.Algunos compiladores de Java usan una frase,y otros la otra.
ja: そうでもないんです。"シンボルが見つからない" と "シンボルを解決できない" は同じ意味です。Javaのコンパイラによっては、片方のフレーズを使うものもあれば、もう片方のフレーズを使うものもあります。
ko: 실제로는 아닙니다. "기호를 찾을 수 없습니다"와 "기호를 확인할 수 없습니다"는 같은 의미입니다. 일부 Java 컴파일러는 하나의 문구를 사용하고 일부는 다른 문구를 사용합니다.
ru: Не совсем."Не могу найти символ" и "Не могу разрешить символ" означают одно и то же.Некоторые компиляторы Java используют одну фразу,а некоторые-другую.
zh_cn: 不是真的。"无法找到符号 "和 "无法解析符号 "的意思是一样的。有些Java编译器使用一个词组,有些则是另一个词组。

source: Note that not every "correction" is correct. Consider this:
es: Tenga en cuenta que no todas las "correcciones" son correctas.Considere esto:
ja: すべての「修正」が正しいとは限らないことに注意してください。これを考えてみてください。
ko: 모든 "수정"이 올바른 것은 아닙니다. 이걸 고려하세요:
ru: Обратите внимание,что не все "исправления" верны.Обратите внимание на это:
zh_cn: 注意,不是每一个 "修正 "都是正确的。考虑到这一点。

source: Now look at the new output...
es: Ahora mira la nueva salida...
ja: さて、新しい出力を見てください...
ko: 이제 새로운 출력을보십시오 ...
ru: Теперь посмотрите на новый выход...
zh_cn: 现在看看新的输出.....

source: Now look at the result..
es: Ahora mira el resultado...
ja: さて、結果を見てみましょう。
ko: 이제 결과를보십시오 ..
ru: Теперь посмотрите на результат...
zh_cn: 现在看看结果.....

source: Ok Successfully solved that error..At the same time , if you could get "can not find method " or "can not find class" something , At first,define a class or method and after use that..
es: Ok,resolvimos exitosamente ese error...Al mismo tiempo,si pudieras obtener "no puedo encontrar el método" o "no puedo encontrar la clase" algo,al principio,define una clase o método y después de usar eso...
ja: 同時に、「メソッドが見つからない」「クラスが見つからない」などのエラーが発生した場合は、まずクラスやメソッドを定義して、それを使ってみましょう。
ko: Ok는 성공적으로 그 오류를 해결했습니다 .. 동시에, 당신이 "메소드를 찾을 수 없습니다"또는 "클래스를 찾을 수 없습니다"를 얻을 수 있다면, 처음에는 클래스 또는 메소드를 정의하고 사용 후에 ..
ru: Ok Успешно справился с этой ошибкой...В то же время,если можно было получить "не могу найти метод" или "не могу найти класс" что-то,то сначала определите класс или метод и после использования...
zh_cn: 好吧,成功解决了这个错误,同时,如果你能得到 "找不到方法 "或 "找不到类 "的东西,首先,定义一个类或方法,然后用这个类或方法。

source: One other cause is unsupported method of for java version say jdk7 vs 8. Check your %JAVA_HOME%
es: Otra causa es el método sin soporte de para la versión de Java,digamos jdk7 vs 8.Comprueba tu %JAVA_HOME%
ja: 他の原因としては、Java のバージョンが jdk7 と 8 の場合、サポートされていないメソッドがあります。
ko: 또 다른 원인은 jdk7 대 8 버전의 Java 버전에서 지원되지 않는 방법입니다. % JAVA_HOME % 확인
ru: Еще одна причина-неподдерживаемый метод для java версии скажем jdk7 vs 8.Проверьте вашу %JAVA_HOME%
zh_cn: 还有一个原因是不支持java版本的方法,比如jdk7 vs 8。

source: One way to get this error in Eclipse :
es: Una forma de obtener este error en Eclipse:
ja: Eclipse .NETでこのエラーを取得する1つの方法があります。
ko: 이클립스 에서이 오류를 얻는 한 가지 방법 :
ru: Один из способов получить эту ошибку в Eclipse :
zh_cn: 一种方法是在Eclipse .NET中得到这个错误。

source: Operators and other non-alphanumeric tokens: like <code>+</code>, <code>=</code>, <code>{</code>, and so on.
es: Operadores y otros tokens no alfanum&eacute;ricos: como <code>+</code> , <code>=</code> , <code>{</code> , y as&iacute; sucesivamente.
ja: 演算子とその他の英数字以外のトークン： <code>+</code> 、 <code>=</code> 、 <code>{</code> など。
ko: 연산자 및 영숫자가 아닌 다른 토큰 (예 : <code>+</code> , <code>=</code> , <code>{</code> 등)
ru: Операторы и другие не алфавитно-цифровые токены: например, <code>+</code> , <code>=</code> , <code>{</code> и т. Д.
zh_cn: 运算符和其他非字母数字标记：如 <code>+</code> ， <code>=</code> ， <code>{</code> 等。

source: Other symbol errors on Android are likely to be due to previously mention reasons; e.g. missing or incorrect dependencies, incorrect package names, method or fields that don't exist in a particular API version, spelling / typing errors, and so on.
es: Es probable que otros errores de símbolos en Android se deban a razones mencionadas anteriormente;por ejemplo,dependencias inexistentes o incorrectas,nombres de paquetes incorrectos,métodos o campos que no existen en una versión particular de la API,errores ortográficos de mecanografía,etc.
ja: Android でのその他のシンボルエラーは、先に述べた理由に起因する可能性があります。例えば、依存関係の欠落や不正確なパッケージ名、特定の API バージョンには存在しないメソッドやフィールド、スペルの入力ミスなどです。
ko: Android의 다른 기호 오류는 이전에 언급 한 이유 때문일 수 있습니다. 예 : 누락되거나 잘못된 종속성, 잘못된 패키지 이름, 특정 API 버전에 존재하지 않는 메소드 또는 필드, 철자 / 입력 오류 등
ru: Другие ошибки в символах на Android,скорее всего,связаны с ранее упомянутыми причинами;например,пропущенные или неправильные зависимости,неправильные имена пакетов,методы или поля,которые не существуют в конкретной версии API,ошибки орфографического набора и так далее.
zh_cn: Android上的其他符号错误很可能是由于前面提到的原因造成的,例如:依赖关系的缺失或不正确,包名不正确,方法或字段不存在于特定的API版本中,拼写错误等。

source: Paste following link <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a> at <strong><em>Work With</em></strong>
es: Pegue el siguiente enlace <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a> at <strong><em>Work With</em></strong>
ja: 次のリンクを貼り付け<a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a> at <strong><em>Work With</em></strong>
ko: 다음 링크에서 <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a> 링크 붙여 넣기
ru: Вставьте следующую ссылку <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a> при <strong><em>работе с</em></strong>
zh_cn: 在<strong><em>工作时</em></strong>粘贴以下链接<a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a>

source: Perhaps the variable declaration is out of scope at the point you tried to use it. (See example below)
es: Tal vez la declaración de la variable está fuera de alcance en el punto en que trató de usarla.(Véase el ejemplo a continuación)
ja: おそらく、使用しようとした時点で変数宣言がスコープ外になっているのではないでしょうか。(以下の例を参照してください)
ko: 아마도 변수 선언이 사용하려고 한 시점에서 범위를 벗어났습니다. (아래 예 참조)
ru: Возможно,объявление переменной вышло из-под контроля в тот момент,когда вы пытались ее использовать.(См.пример ниже)
zh_cn: 也许在你试图使用变量声明的时候,变量声明已经超出了范围。(见下面的例子)

source: Perhaps you are mistakenly operating on an array rather than array element; e.g.
es: Tal vez esté operando erróneamente en una matriz en lugar de un elemento de matriz;por ejemplo.
ja: おそらく、間違って配列要素ではなく配列を操作しているのではないでしょうか。
ko: 아마도 배열 요소가 아닌 배열에서 실수로 작동하고있을 것입니다. 예 :
ru: Возможно,вы ошибаетесь,работая с массивом,а не с элементом массива;например.
zh_cn: 也许你错误地操作了一个数组而不是数组元素,例如

source: Perhaps you are shadowing a static or instance variable.
es: Tal vez esté siguiendo una variable estática o de instancia.
ja: おそらく、静的変数やインスタンス変数をシャドウイングしているのではないでしょうか。
ko: 아마도 당신은 정적 변수 나 인스턴스 변수를 가리고있을 것입니다.
ru: Возможно,вы затеняете статическую переменную или переменную экземпляра.
zh_cn: 也许你的影子是一个静态或实例变量。

source: Perhaps you are trying to refer to a method or field that does not exist (i.e. has not been declared) in the type you are using; e.g. <code>"someString".push()</code><sup>2</sup>.
es: Quiz&aacute;s est&eacute; intentando referirse a un m&eacute;todo o campo que no existe (es decir, no ha sido declarado) en el tipo que est&aacute; utilizando; por ejemplo, <code>"someString".push()</code> <sup>2</sup> .
ja: おそらく、使用している型に存在しない（つまり、宣言されていない）メソッドまたはフィールドを参照しようとしている可能性があります。 例： <code>"someString".push()</code> <sup>2</sup> 。
ko: 사용중인 유형에 존재하지 않는 (즉, 선언되지 않은) 메소드 또는 필드를 참조하려고합니다. 예 : <code>"someString".push()</code> <sup>2</sup> .
ru: Возможно, вы пытаетесь сослаться на метод или поле, которые не существуют (т.е. не были объявлены) в используемом вами типе; например, <code>"someString".push()</code> <sup>2</sup> .
zh_cn: 也许您正在尝试引用所使用的类型中不存在（即尚未声明）的方法或字段； 例如 <code>"someString".push()</code> <sup>2</sup> 。

source: Perhaps you are trying to refer to an inherited method or field that wasn't declared in the parent / ancestor classes or interfaces.
es: Tal vez esté tratando de referirse a un método o campo heredado que no fue declarado en las clases o interfaces de los antepasados.
ja: おそらく、親の祖先クラスやインターフェイスで宣言されていない継承されたメソッドやフィールドを参照しようとしているのではないでしょうか。
ko: 아마도 부모 / 조상 클래스 나 인터페이스에서 선언되지 않은 상속 된 메서드 나 필드를 참조하려고합니다.
ru: Возможно,вы пытаетесь обратиться к унаследованному методу или полю,которое не было объявлено в классах или интерфейсах родительского предка.
zh_cn: 也许你要引用的是一个继承的方法或字段,而这个方法或字段并没有在父类或接口中声明。

source: Perhaps you are trying to use a method as a field, or vice versa; e.g. <code>"someString".length</code> or <code>someArray.length()</code>.
es: Quiz&aacute;s est&eacute; intentando utilizar un m&eacute;todo como campo, o viceversa; por ejemplo, <code>"someString".length</code> o <code>someArray.length()</code> .
ja: おそらく、メソッドをフィールドとして使用しようとしている、またはその逆です。 例： <code>"someString".length</code> または <code>someArray.length()</code> 。
ko: 아마도 메소드를 필드로 사용하려고하거나 그 반대의 경우도 있습니다. 예를 들어 <code>"someString".length</code> 또는 <code>someArray.length()</code> 입니다.
ru: Возможно, вы пытаетесь использовать метод в качестве поля или наоборот; например, <code>"someString".length</code> или <code>someArray.length()</code> .
zh_cn: 也许您正在尝试将方法用作字段，反之亦然； 例如 <code>"someString".length</code> 或 <code>someArray.length()</code> 。

source: Perhaps you are trying to use something that was declared "somewhere else"; i.e. in a different context to where you have implicitly told the compiler to look. (A different class? A different scope? A different package? A different code-base?)
es: Tal vez esté tratando de utilizar algo que fue declarado "en otro lugar";es decir,en un contexto diferente al que implícitamente le ha dicho al compilador que busque.(¿Una clase diferente? ¿Un ámbito diferente? ¿Un paquete diferente? ¿Una base de código diferente?)
ja: おそらく、「どこか他の場所」で宣言されたものを使おうとしているのではないでしょうか。(別のクラス?違うスコープ?別のパッケージ?違うコードベース?)
ko: 아마도 당신은 "다른 곳에서"선언 된 것을 사용하려고 할 것입니다. 즉, 컴파일러가 암시 적으로 보도록 지시 한 다른 컨텍스트에서. (다른 클래스? 다른 범위? 다른 패키지? 다른 코드 기반?)
ru: Возможно,Вы пытаетесь использовать что-то,что было объявлено "где-то в другом месте",т.е.в другом контексте,чем тот,где Вы неявно сказали компилятору посмотреть.(Другой класс? Другая область применения? Другой пакет? Другая кодовая база?)
zh_cn: 也许你是想使用在 "其他地方 "声明的东西;也就是说,在不同的上下文中,你已经隐含地告诉编译器要找的东西。(不同的类?不同的类?不同的包?不同的代码库?)

source: Perhaps you are using (compiling against) the wrong version of an API.
es: Tal vez estés usando (compilando contra)la versión equivocada de una API.
ja: おそらく、間違ったバージョンのAPIを使っている(コンパイルしている)のではないでしょうか。
ko: 아마도 잘못된 버전의 API를 사용하고 있습니다 (컴파일).
ru: Возможно,вы используете (компилируете против)неверную версию API.
zh_cn: 也许你使用的是(针对)错误的API版本。

source: Perhaps you forgot a <code>new</code> as in:
es: Quiz&aacute;s olvidaste un <code>new</code> como en:
ja: おそらくあなたは次のように <code>new</code> ものを忘れました：
ko: 아마도 다음과 같이 <code>new</code> 것을 잊었을 것입니다.
ru: Возможно, вы забыли <code>new</code> как в:
zh_cn: 也许您忘记了以下 <code>new</code> ：

source: Perhaps you forgot to cast your object to an appropriate subclass.
es: Tal vez se olvidó de arrojar su objeto a una subclase apropiada.
ja: おそらく、オブジェクトを適切なサブクラスにキャストするのを忘れたのでしょう。
ko: 아마도 객체를 적절한 서브 클래스로 캐스팅하는 것을 잊었을 것입니다.
ru: Возможно,вы забыли отнести свой объект к соответствующему подклассу.
zh_cn: 也许你忘了把你的对象投给一个合适的子类。

source: Perhaps you forgot to declare the variable.
es: Tal vez olvidó declarar la variable.
ja: おそらく、変数を宣言するのを忘れていたのでしょう。
ko: 변수 선언을 잊었을 수 있습니다.
ru: Возможно,вы забыли объявить переменную.
zh_cn: 也许你忘了声明变量了。

source: Perhaps you forgot to import the class.
es: Tal vez olvidó importar la clase.
ja: おそらく、クラスをインポートするのを忘れているのではないでしょうか。
ko: 클래스를 가져 오는 것을 잊었을 수 있습니다.
ru: Возможно,вы забыли импортировать класс.
zh_cn: 也许你忘了导入类。

source: Perhaps you got the case wrong; i.e. <code>stringBuilder</code> instead of <code>StringBuilder</code>. All Java identifiers are case sensitive.
es: Quiz&aacute;s te equivocaste de caso; es decir, <code>stringBuilder</code> en lugar de <code>StringBuilder</code> . Todos los identificadores de Java distinguen entre may&uacute;sculas y min&uacute;sculas.
ja: おそらくあなたはケースを間違ってしまった。 つまり、 <code>StringBuilder</code> ではなく <code>stringBuilder</code> です。 すべてのJava識別子は大文字と小文字を区別します。
ko: 아마도 당신은 사건이 잘못되었을 것입니다. 즉 <code>StringBuilder</code> 대신 <code>stringBuilder</code> 입니다. 모든 Java 식별자는 대소 문자를 구분합니다.
ru: Возможно, вы ошиблись; т.е. <code>stringBuilder</code> вместо StringBuilder . Все идентификаторы Java чувствительны к регистру.
zh_cn: 也许你错了。 即 <code>stringBuilder</code> 而不是 <code>StringBuilder</code> 。 所有Java标识符均区分大小写。

source: Perhaps you have declared a nested class or a generic parameter that <em>shadows</em> the type you were meaning to use.
es: Quiz&aacute;s haya declarado una clase anidada o un par&aacute;metro gen&eacute;rico que <em>sombrea</em> el tipo que quer&iacute;a usar.
ja: おそらく、使用するつもりだった型を<em>隠す</em>ネストされたクラスまたはジェネリックパラメーターを宣言しました。
ko: 아마도 사용하려는 유형을 <em>가리는</em> 중첩 클래스 또는 일반 매개 변수를 선언했을 것입니다.
ru: Возможно, вы объявили вложенный класс или универсальный параметр, который <em>скрывает</em> тип, который вы хотели использовать.
zh_cn: 也许您已经声明了一个嵌套类或泛型参数，该类<em>掩盖</em>了您打算使用的类型。

source: Perhaps you imported the wrong type; e.g. due to IDE completion or auto-correction.
es: Tal vez importó el tipo equivocado;por ejemplo,debido a la finalización del IDE o a la autocorrección.
ja: IDEの補完や自動修正などの理由で、間違ったタイプをインポートしてしまったのかもしれません。
ko: 아마도 잘못된 유형을 가져 왔을 것입니다. 예를 들어 IDE 완성 또는 자동 수정으로 인해.
ru: Возможно,вы импортировали не тот тип,например,из-за завершения работы IDE или автокоррекции.
zh_cn: 也许你导入了错误的类型;例如,由于IDE完成或自动校正的原因。

source: Perhaps you spelled the name incorrectly; i.e. <code>StringBiulder</code> instead of <code>StringBuilder</code>. Java cannot and will not attempt to compensate for bad spelling or typing errors.
es: Quiz&aacute;s deletreaste el nombre incorrectamente; es decir, <code>StringBiulder</code> en lugar de <code>StringBuilder</code> . Java no puede y no intentar&aacute; compensar los errores ortogr&aacute;ficos o de escritura incorrectos.
ja: おそらく、名前のスペルを間違えたかもしれません。 つまり、 <code>StringBuilder</code> ではなく <code>StringBiulder</code> です。 Javaは、スペルミスや入力ミスを補うことはできません。
ko: 아마도 당신은 이름의 철자를 잘못 입력했을 것입니다; 즉 <code>StringBuilder</code> 대신 <code>StringBiulder</code> 입니다. Java는 잘못된 철자 나 타이핑 오류를 보상하려고 시도하지 않습니다.
ru: Возможно, вы написали имя неправильно; т.е. <code>StringBiulder</code> вместо StringBuilder . Java не может и не будет пытаться компенсировать плохие орфографические или печатные ошибки.
zh_cn: 也许您拼写的名字不正确； 即 <code>StringBiulder</code> 而不是 <code>StringBuilder</code> 。 Java不能也不会尝试弥补拼写错误或输入错误。

source: Perhaps you used "star" imports, but the class isn't defined in any of the packages that you imported.
es: Tal vez usó importaciones "estrella",pero la clase no está definida en ninguno de los paquetes que importó.
ja: おそらく "star" のインポートを使用したのでしょうが、インポートしたパッケージではクラスが定義されていません。
ko: "스타"가져 오기를 사용했을 수도 있지만 가져온 패키지에 클래스가 정의되어 있지 않습니다.
ru: Возможно,вы использовали импорт "звезды",но класс не определен ни в одном из импортированных вами пакетов.
zh_cn: 也许你使用的是 "星型 "导入,但在你导入的任何一个包中都没有定义这个类。

source: Perhaps you used underscores inappropriately; i.e. <code>mystring</code> and <code>my_string</code> are different. (If you stick to the Java style rules, you will be largely protected from this mistake ...)
es: Tal vez usaste guiones bajos inapropiadamente; es decir, <code>mystring</code> y <code>my_string</code> son diferentes. (Si se apega a las reglas de estilo Java, estar&aacute; protegido en gran medida de este error ...)
ja: アンダースコアを不適切に使用した可能性があります。 つまり、 <code>mystring</code> と <code>my_string</code> は異なります。 （Javaスタイルのルールに固執すれば、この間違いからほぼ保護されます...）
ko: 아마도 밑줄을 부적절하게 사용했을 것입니다. 즉, <code>mystring</code> 과 <code>my_string</code> 은 다릅니다. (자바 스타일 규칙을 고수하면이 실수로부터 크게 보호됩니다 ...)
ru: Возможно, вы неправильно использовали подчеркивание; т.е. <code>mystring</code> и <code>my_string</code> разные. (Если вы будете придерживаться правил стиля Java, вы будете в значительной степени защищены от этой ошибки ...)
zh_cn: 也许您不恰当地使用了下划线； 即 <code>mystring</code> 和 <code>my_string</code> 不同。 （如果您坚持使用Java样式规则，则将在很大程度上避免出现此错误...）

source: Please explain the following about "Cannot find symbol" and "Cannot resolve symbol" errors:
es: Por favor,explique lo siguiente sobre los errores de "No se puede encontrar el símbolo" y "No se puede resolver el símbolo":
ja: シンボルが見つからない」「シンボルが解決できない」というエラーについて、以下の説明をお願いします。
ko: "기호를 찾을 수 없음"및 "기호를 확인할 수 없음"오류에 대해 다음을 설명하십시오.
ru: Пожалуйста,объясните следующее об ошибках "Cannot find symbol" и "Cannot resolve symbol":
zh_cn: 关于 "无法找到符号 "和 "无法解决符号 "的错误,请解释如下。

source: Regularly build your codebase using Maven so that you pick up this mistake early. One way to do that is to use a CI server.
es: Construye regularmente tu base de código usando Maven para que puedas detectar este error temprano.Una forma de hacerlo es usar un servidor de información.
ja: この間違いを早期に発見できるように、定期的にMavenを使ってコードベースを構築してください。そのための1つの方法はCIサーバを使うことです。
ko: Maven을 사용하여 정기적으로 코드베이스를 구축하여이 실수를 조기에 해결하십시오. 이를 수행하는 한 가지 방법은 CI 서버를 사용하는 것입니다.
ru: Регулярно стройте свою кодовую базу с помощью Maven,чтобы вы могли обнаружить эту ошибку пораньше.Один из способов сделать это-использовать CI-сервер.
zh_cn: 定期使用 Maven 构建你的代码库,这样你就可以及早发现这个错误。其中一个方法是使用CI服务器。

source: Result : Eclipse will compile the code, but maven will give "Cannot find symbol".
es: Resultado:Eclipse compilará el código,pero Maven dará "No puedo encontrar el símbolo".
ja: 結果:Eclipseはコードをコンパイルしますが、mavenは "Cannot find symbol "と表示されます。
ko: 결과 : Eclipse는 코드를 컴파일하지만 maven은 "기호를 찾을 수 없음"을 표시합니다.
ru: Результат:Eclipse скомпилирует код,но maven выдаст "Cannot find symbol".
zh_cn: 结果:Eclipse会编译代码,但maven会给出 "Cannot find symbol"。

source: Select <strong>Build</strong>-&gt;<strong>Rebuild Project</strong> will solve it
es: Seleccione <strong>Build</strong> -&gt; <strong>Rebuild Project</strong> lo resolver&aacute;
ja: <strong>ビルド</strong> -&gt; <strong>プロジェクトの再</strong> <strong>ビルドを</strong>選択して解決します
ko: <strong>빌드</strong> -&gt; <strong>프로젝트 다시</strong> <strong>빌드를</strong> 선택하면 해결됩니다.
ru: Выберите <strong>Build</strong> -&gt; <strong>Rebuild Project,</strong> чтобы решить его
zh_cn: 选择<strong>Build-</strong> &gt; <strong>Rebuild Project</strong>将解决它

source: Solution :
es: Solución :
ja: 解決策 .
ko: 해결책 :
ru: Решение :
zh_cn: 解决方案 :

source: Solution: Again compile it and then run test. For me it worked this way.
es: Solución:Volver a compilarlo y luego hacer una prueba.Para mí funcionó de esta manera.
ja: 解決策です。もう一度コンパイルしてからテストを実行してください。私の場合はこのように動作しました。
ko: 솔루션 : 다시 컴파일 한 다음 테스트를 실행하십시오. 나에게 이런 식으로 일했다.
ru: Решение:Снова скомпилируйте его и запустите тест.Для меня это сработало.
zh_cn: 解决办法。再次编译,然后运行测试。对我来说,它是这样工作的。

source: Suppose that the compiler says "Cannot find symbol" for <code>j</code>. There are many ways I could "fix" that:
es: Supongamos que el compilador dice "No se puede encontrar el s&iacute;mbolo" para <code>j</code> . Hay muchas maneras en que podr&iacute;a "arreglar" eso:
ja: コンパイラが <code>j</code> に対して「シンボルが見つかりません」と言ったとします。 それを「修正」できる方法はたくさんあります。
ko: 컴파일러가 <code>j</code> 에 대해 "심볼을 찾을 수 없음"이라고 가정합니다. 내가 "수정"할 수있는 방법은 여러 가지가 있습니다.
ru: Предположим, что компилятор говорит &laquo;Не удается найти символ&raquo; для <code>j</code> . Есть много способов, которыми я мог бы &laquo;исправить&raquo; это:
zh_cn: 假设编译器为 <code>j</code> 说&ldquo;找不到符号&rdquo;。 我可以通过多种方式&ldquo;修复&rdquo;该问题：

source: That error says, "variable name can not find"..Defining and initializing value for 'name' variable can be abolished that error..Actually like this,
es: Ese error dice,"nombre de la variable no puede encontrar"...Definir e inicializar el valor de la variable "nombre" puede abolir ese error...en realidad así,
ja: このエラーは「変数名が見つかりません」というもので、変数名を定義して初期化することでそのエラーをなくすことができます。
ko: '변수 이름을 찾을 수 없습니다'라는 오류가 표시됩니다. 'name'변수의 값을 정의하고 초기화하면 해당 오류를 폐지 할 수 있습니다.
ru: Эта ошибка говорит о том,что "имя переменной не может найти"...Определение и инициализация значения для переменной 'name' может быть устранена...На самом деле,вот так,
zh_cn: 这个错误提示 "变量名称无法找到"...定义和初始化'name'变量的值,可以取消这个错误。

source: That's invalid code. Because neither of the variables named <code>message</code> is visible outside of their respective scope - which would be the surrounding brackets <code>{}</code> in this case.
es: Ese es un c&oacute;digo inv&aacute;lido. Debido a que ninguna de las variables nombradas <code>message</code> es visible fuera de su &aacute;mbito respectivo, que ser&iacute;an los corchetes <code>{}</code> en este caso.
ja: これは無効なコードです。 というのも、 <code>message</code> という名前の変数は、それぞれのスコープの外には表示されません。この場合、括弧 <code>{}</code> になります。
ko: 유효하지 않은 코드입니다. <code>message</code> 라는 변수 중 어느 것도 해당 범위 외부에 표시되지 않기 때문에이 경우 주변 괄호 <code>{}</code> 가 됩니다.
ru: Это неверный код. Потому что ни одна из переменных с именем <code>message</code> не видна за пределами их соответствующей области видимости - которые в этом случае были бы окружающими скобками <code>{}</code> .
zh_cn: 那是无效的代码。 因为没有两个名为 <code>message</code> 的变量在它们各自的作用域之外可见-在这种情况下，将用括号 <code>{}</code> 括起来。

source: The most common way to deal with this kind of scope-trouble would be to pre-assign the else-values to the variable names in the outside scope and then reassign in if:
es: La forma más común de tratar este tipo de problema de alcance sería preasignar los valores restantes a los nombres de las variables en el alcance exterior y luego reasignarlos a si:
ja: この種のスコープトラブルに対処する最も一般的な方法は、外部スコープ内の変数名に else-value を事前に代入し、if 内で再代入することです。
ko: 이러한 종류의 범위 문제를 처리하는 가장 일반적인 방법은 else-values를 외부 범위의 변수 이름에 미리 할당 한 다음 다음과 같은 경우에 다시 할당하는 것입니다.
ru: Самым распространенным способом решения такого рода проблем со сферой видимости было бы предварительное назначение остальных значений именам переменных во внешней области видимости и последующее переназначение в if:
zh_cn: 处理这种作用域问题的最常见的方法是将 else-值预分配给外部作用域中的变量名,然后在if中重新分配。
