Repository: rueisnom/feedback
Catalog: xlf/25/70/62/16/25706216.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>{ ... }</code> block is NOT the body of the <code>for</code> loop, and therefore the previous declaration of <code>i</code> in the <code>for</code> statement is <em>out of scope</em> in the block.
es: El bloque <code>{ ... }</code> NO es el cuerpo del ciclo <code>for</code> y, por lo tanto, la declaraci&oacute;n previa de <code>i</code> en la declaraci&oacute;n <code>for</code> est&aacute; <em>fuera del alcance</em> del bloque.
ja: <code>{ ... }</code> ブロックは <code>for</code> ループの本体ではないため、 <code>for</code> ステートメントでの <code>i</code> の以前の宣言はブロック<em>のスコープ外</em>です。
ko: <code>{ ... }</code> 블록은 <code>for</code> 루프의 본문이 아니므로 <code>for</code> 문에서 <code>i</code> 의 이전 선언이 블록 <em>의 범위</em> 를 벗어납니다.
ru: Блок <code>{ ... }</code> НЕ является телом цикла <code>for</code> , и поэтому предыдущее объявление <code>i</code> в операторе <code>for</code> находится <em>вне области действия</em> в блоке.
zh_cn: <code>{ ... }</code> 块不是 <code>for</code> 循环的主体，因此 <code>for</code> 语句中 <code>i</code> 的先前声明<em>超出了</em>该块<em>的范围</em> 。

source: The class being referenced was in another project and that dependency was not added to the Gradle build file of my project. So I added the dependency using
es: La clase a la que se hace referencia estaba en otro proyecto y esa dependencia no se añadió al archivo de construcción de Gradle de mi proyecto.Así que añadí la dependencia usando
ja: 参照されているクラスは別のプロジェクトにあり、その依存関係は私のプロジェクトのGradleビルドファイルには追加されていませんでした。そこで、依存関係を追加するには
ko: 참조되는 클래스가 다른 프로젝트에 있었고 해당 종속성이 내 프로젝트의 Gradle 빌드 파일에 추가되지 않았습니다. 그래서 다음을 사용하여 종속성을 추가했습니다.
ru: Класс,на который делается ссылка,был в другом проекте,и эта зависимость не была добавлена в файл сборки Gradle моего проекта.Поэтому я добавил зависимость,используя
zh_cn: 被引用的类是在另一个项目中,而这个依赖关系没有被添加到我的项目的Gradle构建文件中。所以我使用了以下方法添加了这个依赖关系

source: The point is that you <em>need</em> to understand what your code is trying to do in order to find the right fix.
es: El punto es que <em>necesita</em> comprender lo que su c&oacute;digo est&aacute; tratando de hacer para encontrar la soluci&oacute;n correcta.
ja: ポイントは、正しい修正を見つけるために、コードが何をしようとしているのかを理解する<em>必要</em>があるということです。
ko: 요점은 올바른 수정을 찾기 위해 코드에서 수행하려는 작업을 이해해야한다는 것입니다.
ru: Дело в том, что вам <em>нужно</em> понимать, что ваш код пытается сделать, чтобы найти правильное решение.
zh_cn: 关键是您<em>需要</em>了解您的代码正在尝试做什么才能找到正确的修复程序。

source: The problem is often a combination of the above. For example, maybe you "star" imported <code>java.io.*</code> and then tried to use the <code>Files</code> class ... which is in <code>java.nio</code> not <code>java.io</code>. Or maybe you meant to write <code>File</code> ... which <em>is</em> a class in <code>java.io</code>.
es: El problema es a menudo una combinaci&oacute;n de lo anterior. Por ejemplo, tal vez usted "destac&oacute;" import&oacute; <code>java.io.*</code> y luego intent&oacute; usar la clase <code>Files</code> ... que est&aacute; en <code>java.nio</code> y no en java.io. O tal vez quisiste escribir <code>File</code> ... que <em>es</em> una clase en <code>java.io</code> .
ja: 多くの場合、問題は上記の組み合わせです。 たとえば、インポートした <code>java.io.*</code> に 「スター」を付けてから、 <code>java.io</code> ではなく <code>java.nio</code> にある <code>Files</code> クラス...を使用しようとした可能性があります 。 または、多分 <code>java.io</code> のクラスである <code>File</code> ...を書くつもりでした。
ko: 문제는 종종 위의 조합입니다. 예를 들어 <code>java.io.*</code> 를 "star"로 가져온 다음 <code>java.io</code> 가 아닌 <code>java.nio</code> 에 있는 <code>Files</code> 클래스를 사용하려고했습니다. 또는 <code>java.io</code> 의 클래스 인 <code>File</code> ...을 작성하려고했습니다.
ru: Проблема часто заключается в сочетании вышеперечисленного. Например, может быть, вы &laquo; <code>java.io.*</code> звезду&raquo; импортированным java.io. *, а затем попытались использовать класс <code>Files</code> ... который находится в <code>java.nio</code> ,а не в <code>java.io</code> . Или, может быть, вы хотели написать <code>File</code> ... который <em>является</em> классом в <code>java.io</code> .
zh_cn: 问题通常是上述情况的组合。 例如，也许您&ldquo;星标&rdquo;了导入的 <code>java.io.*</code> ，然后尝试使用 <code>Files</code> 类...，它在 <code>java.nio</code> 中而不是 <code>java.io</code> 中 。 也许您打算编写 <code>File</code> ...，这<em>是</em> <code>java.io</code> 中的一个类。

source: The problem is the sneaky semicolon ( <code>;</code> ) before the <code>{</code>. The Java language syntax defines a semicolon in that context to be an <em>empty statement</em>. The empty statement then becomes the body of the <code>for</code> loop. So that code actually means this:
es: El problema es el sigiloso punto y coma ( <code>;</code> ) antes de <code>{</code> . La sintaxis del lenguaje Java define un punto y coma en ese contexto como una <em>declaraci&oacute;n vac&iacute;a</em> . La declaraci&oacute;n vac&iacute;a se convierte en el cuerpo del bucle <code>for</code> . Entonces ese c&oacute;digo realmente significa esto:
ja: 問題は、 <code>{</code> の前の卑劣なセミコロン（ <code>;</code> ）です。 Java言語の構文では、そのコンテキストのセミコロンを<em>空のステートメント</em>として定義しています。 次に、空のステートメントが <code>for</code> ループの本体になります。 したがって、そのコードは実際にこれを意味します：
ko: 문제는 <code>{</code> . 이전의 부적절한 세미콜론 ( <code>;</code> )입니다. Java 언어 구문은 해당 컨텍스트에서 세미콜론을 <em>빈 명령문으로</em> 정의합니다. 그런 다음 빈 명령문은 <code>for</code> 루프의 본문이됩니다. 그래서 그 코드는 실제로 이것을 의미합니다 :
ru: Проблема в хитрой точке с запятой ( <code>;</code> ) перед <code>{</code> . Синтаксис языка Java определяет точку с запятой в этом контексте как <em>пустой оператор</em> . Пустой оператор становится телом цикла <code>for</code> . Так что код на самом деле означает это:
zh_cn: 问题在于 <code>{</code> 之前的冒号（ <code>;</code> ）。 Java语言语法在该上下文中将分号定义为<em>空语句</em> 。 空语句然后成为 <code>for</code> 循环的主体。 因此该代码实际上意味着：

source: Then you <em>think</em> about what your code is supposed to be saying. Then finally you work out what correction you need to make to your source code to do what you want.
es: Entonces <em>piensas</em> en lo que se supone que dice tu c&oacute;digo. Luego, finalmente, determina qu&eacute; correcci&oacute;n necesita hacer en su c&oacute;digo fuente para hacer lo que desea.
ja: 次に、コードが何を言っているのかを考えます。 次に、最終的に、ソースコードに必要な修正を加えて、必要なことを行います。
ko: 그런 다음 코드의 내용에 대해 생각합니다. 그런 다음 마지막으로 원하는 것을 수행하기 위해 소스 코드를 수정해야하는 문제를 해결합니다.
ru: Затем вы <em>думаете</em> о том, что ваш код должен говорить. Затем, наконец, вы решаете, какое исправление необходимо внести в исходный код, чтобы сделать то, что вы хотите.
zh_cn: 然后，您<em>考虑</em>一下您的代码应该说什么。 最后，您确定需要对源代码进行哪些更正以执行所需的操作。

source: There are some other more obscure causes too ... which I will deal with below.
es: Hay algunas otras causas más oscuras también...de las que me ocuparé más adelante.
ja: 他にもいくつかの不明瞭な原因があります......それは以下で説明します。
ko: 다른 더 모호한 원인도 있습니다 ... 아래에서 다루겠습니다.
ru: Есть и другие,более непонятные причины...с которыми я разберусь ниже.
zh_cn: 还有其他一些更隐晦的原因...........下面我将讨论一下。

source: There can be various scenarios as people have mentioned above. A couple of things which have helped me resolve this.
es: Puede haber varios escenarios,como se ha mencionado anteriormente.Un par de cosas que me han ayudado a resolver esto.
ja: 上で述べたように、様々なシナリオが考えられます。これを解決してくれたものがいくつかあります。
ko: 사람들이 위에서 언급 한 것처럼 다양한 시나리오가있을 수 있습니다. 이 문제를 해결하는 데 도움이 된 몇 가지 사항이 있습니다.
ru: Могут быть различные сценарии,как уже упоминалось выше.Пара вещей,которые помогли мне разрешить это.
zh_cn: 如上文中大家提到的各种情况,可以有各种情况。有几件事情帮我解决了这个问题。

source: There is another reason why the compiler might not find a symbol if you are compiling from the command line. You might simply have forgotten to compile or recompile some other class. For example, if you have classes <code>Foo</code> and <code>Bar</code> where <code>Foo</code> uses <code>Bar</code>. If you have never compiled <code>Bar</code> and you run <code>javac Foo.java</code>, you are liable to find that the compiler can't find the symbol <code>Bar</code>. The simple answer is to compile <code>Foo</code> and <code>Bar</code> together; e.g. <code>javac Foo.java Bar.java</code> or <code>javac *.java</code>. Or better still use a Java build tool; e.g. Ant, Maven, Gradle and so on.
es: Hay otra raz&oacute;n por la cual el compilador podr&iacute;a no encontrar un s&iacute;mbolo si est&aacute; compilando desde la l&iacute;nea de comandos. Es posible que simplemente haya olvidado compilar o recompilar alguna otra clase. Por ejemplo, si tiene clases <code>Foo</code> y <code>Bar</code> donde <code>Foo</code> usa <code>Bar</code> . Si nunca compil&oacute; <code>Bar</code> y ejecuta <code>javac Foo.java</code> , es probable que encuentre que el compilador no puede encontrar el s&iacute;mbolo <code>Bar</code> . La respuesta simple es compilar <code>Foo</code> y <code>Bar</code> juntos; por ejemplo, <code>javac Foo.java Bar.java</code> o <code>javac *.java</code> . O mejor a&uacute;n, use una herramienta de compilaci&oacute;n Java; por ejemplo, Ant, Maven, Gradle, etc.
ja: コマンドラインからコンパイルしている場合、コンパイラがシンボルを見つけられない場合があるもう1つの理由があります。 他のクラスをコンパイルまたは再コンパイルするのを忘れただけかもしれません。 たとえば、 <code>Foo</code> が <code>Bar</code> を使用するクラス <code>Foo</code> と <code>Bar</code> があるとします。 <code>Bar</code> をコンパイルしたことがなく、 <code>javac Foo.java</code> を実行した場合、コンパイラーがシンボル <code>Bar</code> を見つけられないことがあります。 簡単な答えは、 <code>Foo</code> と <code>Bar</code> を一緒にコンパイルすることです。 例： <code>javac Foo.java Bar.java</code> または <code>javac *.java</code> 。 または、Javaビルドツールを使用することをお勧めします。 例：Ant、Maven、Gradleなど。
ko: 명령 행에서 컴파일하는 경우 컴파일러가 기호를 찾지 못하는 또 다른 이유가 있습니다. 다른 클래스를 컴파일하거나 다시 컴파일하는 것을 잊었을 수 있습니다. 예를 들어, <code>Foo</code> 가 <code>Bar</code> 를 사용하는 클래스 <code>Foo</code> 및 <code>Bar</code> 가 있는 경우 <code>Bar</code> 를 컴파일 한 적이없고 <code>javac Foo.java</code> 를 실행하면 컴파일러가 <code>Bar</code> 기호를 찾을 수 없다는 것을 알게됩니다. 간단한 대답은 <code>Foo</code> 와 <code>Bar</code> 를 함께 컴파일하는 것입니다. 예를 들어 <code>javac Foo.java Bar.java</code> 또는 <code>javac *.java</code> 입니다. 또는 여전히 Java 빌드 도구를 사용하는 것이 좋습니다. 예를 들어 Ant, Maven, Gradle 등.
ru: Есть еще одна причина, по которой компилятор может не найти символ, если вы компилируете из командной строки. Возможно, вы просто забыли скомпилировать или перекомпилировать какой-то другой класс. Например, если у вас есть классы <code>Foo</code> и <code>Bar</code> , где <code>Foo</code> использует <code>Bar</code> . Если вы никогда не компилировали <code>Bar</code> и запускаете <code>javac Foo.java</code> , вы наверняка обнаружите, что компилятор не может найти символ <code>Bar</code> . Простой ответ - собрать <code>Foo</code> и <code>Bar</code> вместе; например, <code>javac Foo.java Bar.java</code> или <code>javac *.java</code> . Или лучше использовать инструмент сборки Java; например муравей, мавен, градль и так далее.
zh_cn: 如果从命令行进行编译，则编译器可能找不到符号的另一个原因。 您可能只是忘记了编译或重新编译其他类。 例如，如果您有 <code>Foo</code> 和 <code>Bar</code> 类，其中 <code>Foo</code> 使用 <code>Bar</code> 。 如果您从未编译过 <code>Bar</code> 并且运行了 <code>javac Foo.java</code> ，则很可能会发现编译器找不到 <code>Bar</code> 的符号。 简单的答案是将 <code>Foo</code> 和 <code>Bar</code> 一起编译。 例如 <code>javac Foo.java Bar.java</code> 或 <code>javac *.java</code> 。 或者最好还是使用Java构建工具； 例如Ant，Maven，Gradle等。

source: This could be an IDE bug. For instance @Joel Costigliola describes a scenario where Eclipse does not handle a Maven "test" tree correctly: <a href="https://stackoverflow.com/a/37207223/139985"><strong>see this answer</strong></a>.
es: Esto podr&iacute;a ser un error IDE. Por ejemplo, @Joel Costigliola describe un escenario en el que Eclipse no maneja un &aacute;rbol de "prueba" de Maven correctamente: <a href="https://stackoverflow.com/a/37207223/139985"><strong>vea esta respuesta</strong></a> .
ja: これはIDEのバグである可能性があります。 たとえば、@ Joel Costigliolaは、EclipseがMavenの「テスト」ツリーを正しく処理しないシナリオについて説明してい<a href="https://stackoverflow.com/a/37207223/139985"><strong>ます</strong></a> 。 <strong>この回答を参照してください</strong> 。
ko: 이것은 IDE 버그 일 수 있습니다. 예를 들어 @Joel Costigliola는 Eclipse가 Maven "테스트"트리를 올바르게 처리하지 않는 시나리오를 설명합니다 ( <a href="https://stackoverflow.com/a/37207223/139985"><strong>이 답변 참조)</strong></a> .
ru: Это может быть ошибка IDE. Например, @Joel Costigliola описывает сценарий, в котором Eclipse неправильно обрабатывает &laquo;тестовое&raquo; дерево Maven: <a href="https://stackoverflow.com/a/37207223/139985"><strong>см. Этот ответ</strong></a> .
zh_cn: 这可能是一个IDE错误。 例如，@ Joel Costigliola描述了Eclipse无法正确处理Maven&ldquo;测试&rdquo;树的情况： <a href="https://stackoverflow.com/a/37207223/139985"><strong>请参见以下答案</strong></a> 。

source: This could happen if the IDE has been configured with the wrong JDK version.
es: Esto podría suceder si el IDE ha sido configurado con la versión incorrecta del JDK.
ja: これは、IDE が間違った JDK バージョンで設定されている場合に発生する可能性があります。
ko: IDE가 잘못된 JDK 버전으로 구성된 경우 발생할 수 있습니다.
ru: Это может произойти,если IDE была настроена с неправильной версией JDK.
zh_cn: 如果IDE配置了错误的JDK版本,可能会出现这种情况。

source: This could happen if the IDE's caches get out of sync with the file system. There are IDE specific ways to fix that.
es: Esto podría suceder si las cachés del IDE se desincronizan con el sistema de archivos.Hay formas específicas del IDE para arreglar eso.
ja: これは、IDE のキャッシュがファイル システムと同期していない場合に発生する可能性があります。これを修正するための IDE 固有の方法があります。
ko: IDE의 캐시가 파일 시스템과 동기화되지 않으면 이런 일이 발생할 수 있습니다. 이를 해결하는 IDE 특정 방법이 있습니다.
ru: Это может произойти,если кэш IDE выйдет из синхронизации с файловой системой.Есть специальные способы IDE исправить это.
zh_cn: 如果IDE的缓存与文件系统不同步,可能会出现这种情况。有IDE特定的方法可以解决这个问题。

source: This will give a "Cannot find symbol" error for <code>i</code> in the <code>if</code> statement. Though we previously declared <code>i</code>, that declaration is only <em>in scope</em> for the <code>for</code> statement and its body. The reference to <code>i</code> in the <code>if</code> statement <em>cannot see</em> that declaration of <code>i</code>. It is <em>out of scope</em>.
es: Esto dar&aacute; un error de "No se puede encontrar el s&iacute;mbolo" para <code>i</code> en la instrucci&oacute;n <code>if</code> . Aunque previamente declaramos <code>i</code> , esa declaraci&oacute;n solo est&aacute; <em>en el alcance</em> de la declaraci&oacute;n <code>for</code> y su cuerpo. La referencia a <code>i</code> en la declaraci&oacute;n <code>if</code> <em>no puede ver</em> esa declaraci&oacute;n de <code>i</code> . Est&aacute; <em>fuera de alcance</em> .
ja: これにより、 <code>if</code> ステートメントの <code>i</code> に「シンボルが見つかりません」エラーが発生します。 以前に <code>i</code> を宣言しましたが、その宣言は <code>for</code> ステートメントとその本体の<em>スコープ内</em>のみです。 <code>if</code> ステートメントでの <code>i</code> への <em>参照は</em> 、そのiの宣言を<em>見る</em>こと<em>ができません</em> 。 <em>範囲外</em>です。
ko: <code>if</code> 문에서 <code>i</code> 에 "기호를 찾을 수 없음"오류가 발생합니다. 이전에 <code>i</code> 를 선언했지만 해당 선언은 <code>for</code> 문과 본문의 <em>범위</em> 에만 있습니다. <code>if</code> 문의 <code>i</code> 에 대한 <em>참조는</em> 해당 <code>i</code> 의 선언을 <em>볼 수 없습니다</em> . <em>범위를 벗어났습니다</em> .
ru: Это приведет к ошибке &laquo;Не удается найти символ&raquo; для <code>i</code> в операторе <code>if</code> . Несмотря на то, что ранее мы объявили <code>i</code> , эта декларация доступна только <code>for</code> оператора for и его тела. Ссылка на <code>i</code> в операторе <code>if</code> <em>не может видеть</em> эту декларацию <code>i</code> . Это <em>выходит за рамки</em> .
zh_cn: <code>if</code> 在if语句中，这将为我提供&ldquo;找不到符号&rdquo;错误。 尽管我们之前曾声明过 <code>i</code> ，但该声明仅<em>在</em> <code>for</code> 语句及其主体的<em>范围内</em> 。 在 <code>if</code> 语句中对 <code>i</code> 的引用<em>看不到</em> <code>i</code> 的声明。 它<em>超出范围</em> 。

source: This will give you a compilation error in the <code>println</code> call saying that <code>i</code> cannot be found. But (I hear you say) I did declare it!
es: Esto le dar&aacute; un error de compilaci&oacute;n en la llamada <code>println</code> diciendo que no se puede encontrar. Pero (te escucho decir) &iexcl;lo dije!
ja: これにより、 <code>println</code> 呼び出しで、見つからないというコンパイルエラーが発生します。 しかし、（私はあなたが言うのを聞きます）私はそれを宣言しました！
ko: 이것은 <code>println</code> 호출에서 <code>i</code> 찾을 수 없다는 컴파일 오류를 줄 것입니다. 그러나 나는 당신이 그것을 선언했다!
ru: Это даст вам ошибку компиляции в вызове <code>println</code> о том, что <code>i</code> не могу быть найден. Но (я слышу, как вы говорите), я это объявил!
zh_cn: 这将在 <code>println</code> 调用中给您一个编译错误，提示找不到我。 但是（我听到你说）我确实宣布了！

source: Underlying cause : Eclipse is using a combined build path for the main and test trees. Unfortunately, it does not support using different build paths for different parts of an Eclipse project, which is what Maven requires.
es: Causa subyacente:Eclipse está usando una ruta de construcción combinada para los árboles principales y de prueba.Desafortunadamente,no apoya el uso de diferentes rutas de construcción para diferentes partes de un proyecto de Eclipse,que es lo que Maven requiere.
ja: 根本的な原因:Eclipse はメインツリーとテストツリーに結合されたビルドパスを使用しています。残念ながら、Eclipse プロジェクトの異なる部分に異なるビルドパスを使用することはサポートされていません。
ko: 기본 원인 : Eclipse는 기본 트리와 테스트 트리에 대해 빌드 경로를 결합하여 사용합니다. 불행히도 Maven이 요구하는 Eclipse 프로젝트의 다른 부분에 대해 다른 빌드 경로 사용을 지원하지 않습니다.
ru: Основополагающая причина:Eclipse использует комбинированный путь построения для основных и тестовых деревьев.К сожалению,он не поддерживает использование разных путей сборки для разных частей проекта Eclipse,что и требуется Maven.
zh_cn: 基本原因:Eclipse使用了主树和测试树的组合构建路径。不幸的是,它不支持对Eclipse项目的不同部分使用不同的构建路径,而这正是Maven所要求的。

source: What does a “Cannot find symbol” or “Cannot resolve symbol” error mean
es: ¿Qué significa un error de "No se puede encontrar el símbolo" o "No se puede resolver el símbolo"?
ja: シンボルが見つかりません」または「シンボルを解決できません」というエラーは何を意味しているのでしょうか?
ko: "기호를 찾을 수 없음"또는 "기호를 확인할 수 없음"오류의 의미
ru: Что означает ошибка "Не могу найти символ" или "Не могу разрешить символ"?
zh_cn: "无法找到符号 "或 "无法解析符号 "错误是什么意思?

source: What does they mean?
es: ¿Qué significan?
ja: どういう意味なんだろう?
ko: 그들은 무엇을 의미합니까?
ru: Что они означают?
zh_cn: 他们是什么意思?

source: What things can cause them?
es: ¿Qué cosas pueden causarlas?
ja: どのようなことが原因になるのでしょうか?
ko: 어떤 일이 그들을 일으킬 수 있습니까?
ru: Какие вещи могут их вызвать?
zh_cn: 哪些事情会导致他们?

source: You can avoid this by restricting yourself to ASCII or Latin-1 as the source file encoding, and using Java <code>\uxxxx</code> escapes for other characters.
es: Puede evitar esto restringi&eacute;ndose a ASCII o Latin-1 como la codificaci&oacute;n del archivo fuente, y utilizando escapes Java <code>\uxxxx</code> para otros caracteres.
ja: これを回避するには、ソースファイルのエンコーディングをASCIIまたはLatin-1に制限し、他の文字にJava <code>\uxxxx</code> エスケープを使用します。
ko: 소스 파일 인코딩으로 ASCII 또는 Latin-1로 제한하고 다른 문자에 Java <code>\uxxxx</code> 이스케이프를 사용하면이를 피할 수 있습니다.
ru: Вы можете избежать этого, ограничившись ASCII или Latin-1 в качестве кодировки исходного файла, и используя Java <code>\uxxxx</code> для других символов.
zh_cn: 通过将自己限制为ASCII或Latin-1作为源文件编码，并对其他字符使用Java <code>\uxxxx</code> 转义，可以避免这种情况。

source: You might say: "But a variable named message is defined either way - so message <em>is</em> defined after the <code>if</code>".
es: Puede decir: "Pero una variable llamada mensaje se define de cualquier manera, por lo que el mensaje <em>se</em> define despu&eacute;s del <code>if</code> ".
ja: あなたは言うかもしれません：「しかし、メッセージという名前の変数はどちらかの方法で定義されます-したがって、メッセージ<em>は</em> <code>if</code> の後に定義されます」。
ko: "하지만 message라는 변수는 어느 쪽이든 정의되어 있으므로 <code>if</code> 뒤에 메시지 <em>가</em> 정의 됩니다 ."
ru: Вы можете сказать: &laquo;Но переменная с именем message определяется в любом случае - поэтому сообщение определяется после <code>if</code> &raquo;.
zh_cn: 您可能会说：&ldquo;但是以任何一种方式都定义了一个名为message的变量-因此message <em>是</em>在 <code>if</code> 后面定义的。

source: You'll also get this error if you forget a <code>new</code>:
es: Tambi&eacute;n recibir&aacute; este error si olvida un <code>new</code> :
ja: <code>new</code> を忘れた場合にも、このエラーが発生します。
ko: <code>new</code> 것을 잊어 버린 경우 에도이 오류가 발생합니다.
ru: Вы также получите эту ошибку, если забудете <code>new</code> :
zh_cn: 如果您忘记了一个 <code>new</code> 也会得到这个错误：

source: Your Java source code consists of the following things:
es: Su código fuente de Java consiste en las siguientes cosas:
ja: あなたのJavaソースコードは、以下のもので構成されています。
ko: Java 소스 코드는 다음으로 구성됩니다.
ru: Ваш исходный код Java состоит из следующих вещей:
zh_cn: 你的Java源码包括以下内容。

source: and it worked. HTH!
es: y funcionó.HTH!
ja: そして、それはうまくいった。HTH!
ko: 그리고 효과가있었습니다. HTH!
ru: и это сработало.HTH!
zh_cn: 它的工作。HTH!

source: and so on.
es: y así sucesivamente.
ja: といったようなことを言っています。
ko: 등등.
ru: и так далее.
zh_cn: 诸如此类。

source: because the call without the <code>new</code> keyword will try and look for a (local) method called <code>String</code> without arguments - and that method signature is likely not defined.
es: porque la llamada sin la <code>new</code> palabra clave intentar&aacute; buscar un m&eacute;todo (local) llamado <code>String</code> sin argumentos, y es probable que la firma del m&eacute;todo no est&eacute; definida.
ja: <code>new</code> キーワードなしの呼び出しは、引数なしで <code>String</code> と呼ばれる（ローカル）メソッドを探して探すためです。また、そのメソッドシグネチャは定義されていない可能性があります。
ko: <code>new</code> 키워드가없는 호출은 인수가없는 <code>String</code> 이라는 (로컬) 메소드를 찾고 시도하기 때문에 메소드 서명이 정의되지 않았을 수 있습니다.
ru: потому что вызов без ключевого слова <code>new</code> попытается найти (локальный) метод с именем <code>String</code> без аргументов - и эта сигнатура метода, вероятно, не определена.
zh_cn: 因为不带 <code>new</code> 关键字的调用将尝试查找不带参数的名为 <code>String</code> 的（本地）方法-该方法签名可能未定义。

source: then update Java version in Maven properties of <strong>pom.xml</strong> file as below
es: luego actualice la versi&oacute;n de Java en las propiedades Maven del archivo <strong>pom.xml</strong> como se muestra a continuaci&oacute;n
ja: 次に、以下のように<strong>pom.xml</strong>ファイルのMavenプロパティのJavaバージョンを更新します
ko: 다음과 같이 <strong>pom.xml</strong> 파일의 Maven 속성에서 Java 버전을 업데이트하십시오.
ru: затем обновите версию Java в свойствах <strong>Maven</strong> файла <strong>pom.xml,</strong> как <strong>показано</strong> ниже
zh_cn: 然后如下所示更新<strong>pom.xml</strong>文件的Maven属性中的Java版本

source: you compiled your code using maven compile and then used maven test to run it worked fine. Now if you changed something in your code and then without compiling you are running it, you will get this error.
es: compilaste tu código usando maven compilar y luego usaste maven test para ejecutarlo funcionó bien.Ahora,si cambiaste algo en tu código y luego sin compilar lo estás ejecutando,obtendrás este error.
ja: を使用してコードをコンパイルした後、mavenのテストを使用して実行した場合、問題なく動作しました。今、あなたのコードで何かを変更した後、コンパイルせずに実行している場合、このエラーが発生します。
ko: maven compile을 사용하여 코드를 컴파일 한 다음 maven 테스트를 사용하여 정상적으로 작동했습니다. 이제 코드에서 무언가를 변경하고 컴파일하지 않고 실행하면이 오류가 발생합니다.
ru: вы скомпилировали свой код с помощью maven-компиляции,а затем использовали maven-тест,чтобы запустить его нормально.Теперь,если вы что-то изменили в своем коде,а затем без компиляции выполняете его,вы получите эту ошибку.
zh_cn: 你用maven编译了你的代码,然后用maven测试来运行,效果很好。现在,如果你在代码中修改了一些东西,然后在没有编译的情况下运行,你会得到这个错误。
