Repository: rueisnom/feedback
Catalog: xlf/25/70/62/16/25706216.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Can not find " means that , compiler who can't find appropriate variable, method ,class etc...if you got that error massage , first of all you want to find code line where get error massage..And then you will able to find which variable , method or class have not define before using it.After confirmation initialize that variable ,method or class can be used for later require...Consider the following example.
es: "No puedo encontrar" significa que el compilador no puede encontrar la variable,método,clase,etc...si tienes ese mensaje de error,primero que nada quieres encontrar la línea de código donde obtener el mensaje de error...y luego podrás encontrar la variable,método o clase que no has definido antes de usarla.Después de la confirmación,inicializa esa variable,método o clase para que pueda ser usada más tarde...Considera el siguiente ejemplo.
ja: "見つからない」というのは、コンパイラが適切な変数やメソッド、クラスなどを見つけられないことを意味します。もし、エラーが発生した場合は、まず、エラーが発生したコード行を見つけ、それを使用する前に定義されていない変数やメソッド、クラスを見つけることができます。
ko: "찾을 수 없음"은 적절한 변수, 메소드, 클래스 등을 찾을 수없는 컴파일러를 의미합니다. 오류 마사지를 받으면 먼저 오류 마사지를받는 코드 줄을 찾으십시오. 사용하기 전에 정의하지 않은 변수, 메소드 또는 클래스를 찾을 수 있습니다. 확인 후 해당 변수, 메소드 또는 클래스를 초기화하여 나중에 요구할 수 있습니다 ... 다음 예제를 고려하십시오.
ru: "Не могу найти" означает,что,компилятор,который не может найти подходящую переменную,метод,класс и т.д....если вы получили этот массаж ошибок,то в первую очередь вы хотите найти строку кода,в которой находится массаж ошибок...А затем вы сможете найти,какую переменную,метод или класс не определили перед использованием.После подтверждения инициализируйте,что переменная,метод или класс может быть использован для последующего требования...Рассмотрим следующий пример.
zh_cn: "找不到 "是指,编译器找不到合适的变量、方法、类等...........如果你得到了那个错误的按摩,首先你要找到得到错误按摩的代码行,然后你就能找到哪个变量、方法或类在使用前没有定义,确认后初始化那个变量、方法或类就可以用于以后的需求.........考虑一下下面的例子。

source: "Oh, there's duplicated code, let's pull that common line out" -&gt; and there it it.
es: "Oh, hay c&oacute;digo duplicado, saquemos esa l&iacute;nea com&uacute;n" -&gt; y ah&iacute; est&aacute;.
ja: 「ああ、重複したコードがあるので、その共通の行を引き出しましょう」-&gt;そして、それです。
ko: "오, 중복 된 코드가 있습니다. 공통 라인을 뽑아 봅시다"-&gt; 그리고 거기에 있습니다.
ru: &laquo;О, есть дублированный код, давайте вытянем эту общую строку&raquo; -&gt; и вот оно.
zh_cn: &ldquo;哦，有重复的代码，让我们拉出这条共同的线&rdquo;-&gt;到那里。

source: (An appropriate correction here might be to move the <code>if</code> statement inside the loop, or to declare <code>i</code> before the start of the loop.)
es: (Una correcci&oacute;n apropiada aqu&iacute; podr&iacute;a ser mover la declaraci&oacute;n <code>if</code> dentro del ciclo, o declarar <code>i</code> antes del inicio del ciclo).
ja: （ここでの適切な修正は、ループ内で <code>if</code> ステートメントを移動するか 、ループの開始前に <code>i</code> を宣言することです。）
ko: (여기서 루프 내에서 <code>if</code> 문을 이동하거나 루프 시작 전에 <code>i</code> 를 선언하는 것이 적절할 수 있습니다.)
ru: (Соответствующим исправлением здесь может быть перемещение оператора <code>if</code> внутри цикла или объявление <code>i</code> перед началом цикла.)
zh_cn: （这里的一个适当的更正可能是在循环内移动 <code>if</code> 语句，或者在循环开始之前声明 <code>i</code> 。）

source: 0. Is there any difference between the two errors?
es: 0.¿Hay alguna diferencia entre los dos errores?
ja: 0.2つのエラーの違いはありますか?
ko: 0. 두 오류간에 차이가 있습니까?
ru: 0.Есть ли разница между этими двумя ошибками?
zh_cn: 0.这两个错误之间是否有区别?

source: 1. What does a "Cannot find symbol" error mean?
es: 1.¿Qué significa un error de "No se puede encontrar el símbolo"?
ja: 1.シンボルが見つからない」というエラーの意味は?
ko: 1. "기호를 찾을 수 없음"오류는 무엇을 의미합니까?
ru: 1.Что означает ошибка "Не могу найти символ"?
zh_cn: 1."无法找到符号 "错误是什么意思?

source: 2. What can cause a "Cannot find symbol" error?
es: 2.¿Qué puede causar un error de "No puedo encontrar el símbolo"?
ja: 2.シンボルが見つからない」エラーの原因は何ですか?
ko: 2. "기호를 찾을 수 없음"오류의 원인은 무엇입니까?
ru: 2.Что может вызвать ошибку "Не могу найти символ"?
zh_cn: 2.什么会导致 "无法找到符号 "错误?

source: 3. How do I fix these errors ?
es: 3.¿Cómo arreglo estos errores?
ja: 3.どのようにしてこれらのエラーを修正できますか?
ko: 3.이 오류를 어떻게 해결합니까?
ru: 3.Как исправить эти ошибки?
zh_cn: 3.如何修复这些错误?

source: 4. Obscure causes
es: 4.4.Causas oscuras
ja: 4.曖昧な原因
ko: 4. 모호한 원인
ru: 4.Неизвестные причины
zh_cn: 4.隐晦的原因

source: <code>Name:</code> Java 11 support <code>Location:</code><a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a>
es: <code>Name:</code> Soporte de Java 11 <code>Location:</code> <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a>
ja: <code>Name:</code> Java 11サポート <code>Location:</code> <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http</a> : //download.eclipse.org/eclipse/updates/4.9-P-builds
ko: <code>Name:</code> Java 11 지원 <code>Location:</code> <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a>
ru: <code>Name:</code> поддержка Java 11 <code>Location:</code> <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http://download.eclipse.org/eclipse/updates/4.9-P-builds</a>
zh_cn: <code>Name:</code> Java 11支持 <code>Location:</code> <a href="http://download.eclipse.org/eclipse/updates/4.9-P-builds">http</a> : //download.eclipse.org/eclipse/updates/4.9-P-builds

source: <em>This question is designed to seed a comprehensive Q&amp;A about these common compilation errors in Java.</em>
es: <em>Esta pregunta est&aacute; dise&ntilde;ada para generar un Q&amp;A completo sobre estos errores comunes de compilaci&oacute;n en Java.</em>
ja: <em>この質問は、Javaでのこれらの一般的なコンパイルエラーに関する包括的なQ＆Aを作成するためのものです。</em>
ko: <em>이 질문은 Java에서 이러한 일반적인 컴파일 오류에 대한 포괄적 인 Q &amp; A를 제공하기 위해 고안되었습니다.</em>
ru: <em>Этот вопрос предназначен для получения исчерпывающих ответов на вопросы об этих распространенных ошибках компиляции в Java.</em>
zh_cn: <em>该问题旨在对Java中的这些常见编译错误进行全面的问答。</em>

source: <strong>An earlier build problem</strong>: It is possible that an earlier build failed in a way that gave a JAR file with missing classes. Such a failure would typically be noticed if you were using a build tool. However if you are getting JAR files from someone else, you are dependent on <em>them</em> building properly, and noticing errors. If you suspect this, use <code>tar -tvf</code> to list the contents of the suspect JAR file.
es: <strong>Un problema de compilaci&oacute;n anterior</strong> : es posible que una compilaci&oacute;n anterior fallara de una manera que dio un archivo JAR con clases faltantes. Tal falla normalmente se notar&iacute;a si estuviera utilizando una herramienta de compilaci&oacute;n. Sin embargo, si obtiene archivos JAR de otra persona, depende de <em>que se</em> construyan correctamente y noten errores. Si sospecha esto, use <code>tar -tvf</code> para enumerar el contenido del archivo JAR sospechoso.
ja: <strong>以前のビルドの問題</strong> ：欠落しているクラスを含むJARファイルを提供するように、以前のビルドが失敗した可能性があります。 このような障害は、ビルドツールを使用している場合に通常発生します。 ただし、他の人からJARファイルを取得している場合は、 <em>それら</em>が適切にビルドされ、エラーが発生し<em>ている</em>ことに依存し<em>て</em>います。 これが疑われる場合は、 <code>tar -tvf</code> を使用して、疑わしいJARファイルの内容をリストします。
ko: <strong>이전 빌드 문제</strong> : 클래스가 누락 된 JAR 파일을 제공하는 방식으로 이전 빌드가 실패했을 수 있습니다. 빌드 도구를 사용하는 경우 일반적으로 이러한 실패가 나타납니다. 그러나 다른 사람으로부터 JAR ​​파일을 얻는 경우 파일을 올바르게 빌드하고 오류를 확인 <em>하는</em> 데 의존합니다. 의심되는 경우 <code>tar -tvf</code> 를 사용하여 의심스러운 JAR 파일의 내용을 나열하십시오.
ru: <strong>Проблема с более ранней сборкой</strong> . Возможно, что более ранняя сборка завершилась неудачно, что дало JAR-файл с отсутствующими классами. Такой сбой, как правило, будет замечен, если вы используете инструмент сборки. Однако, если вы получаете файлы JAR от кого-то другого, вы зависите от <em>их</em> правильной сборки и замечаете ошибки. Если вы подозреваете это, используйте <code>tar -tvf</code> для просмотра содержимого подозрительного JAR-файла.
zh_cn: <strong>较早的构建问题</strong> ： <strong>较早的构建</strong>可能会失败，从而导致JAR文件缺少类。 如果使用构建工具，通常会注意到这种故障。 但是，如果您从其他人那里获取JAR文件，则取决于<em>它们</em>是否可以正确构建并注意到错误。 如果您怀疑这一点，请使用 <code>tar -tvf</code> 列出可疑JAR文件的内容。

source: <strong>Android issues</strong>: When you are programming for Android, and you have "Cannot find symbol" errors related to <code>R</code>, be aware that the <code>R</code> symbols are defined by the <code>context.xml</code> file. Check that your <code>context.xml</code> file is correct and in the correct place, and that the corresponding <code>R</code> class file has been generated / compiled. Note that the Java symbols are case sensitive, so the corresponding XML ids are be case sensitive too.
es: <strong>Problemas de Android</strong> : cuando est&eacute; programando para Android y tenga errores de "No se pueden encontrar s&iacute;mbolos" relacionados con <code>R</code> , tenga en cuenta que los s&iacute;mbolos <code>R</code> est&aacute;n definidos por el archivo <code>context.xml</code> . Verifique que su archivo <code>context.xml</code> sea ​​correcto y est&eacute; en el lugar correcto, y que el archivo de clase <code>R</code> correspondiente ha sido generado / compilado. Tenga en cuenta que los s&iacute;mbolos Java distinguen entre may&uacute;sculas y min&uacute;sculas, por lo que los identificadores XML correspondientes tambi&eacute;n distinguen entre may&uacute;sculas y min&uacute;sculas.
ja: <strong>Androidの問題</strong> ：Android向けにプログラミングしているときに、 <code>R</code> に関連する「シンボルが見つかりません」エラーが発生した場合、 <code>R</code> シンボルは <code>context.xml</code> ファイルで定義されていることに注意してください。 <code>context.xml</code> ファイルが正しく、正しい場所にあること、および対応する <code>R</code> クラスファイルが生成/コンパイルされていることを確認してください。 Javaシンボルでは大文字と小文字が区別されるため、対応するXML IDでも大文字と小文字が区別されることに注意してください。
ko: <strong>Android 문제</strong> : <strong>Android 용</strong> 으로 프로그래밍하고 <code>R</code> 과 관련된 "기호를 찾을 수 없습니다"오류가 발생하면 <code>R</code> 기호는 <code>context.xml</code> 파일에 의해 정의됩니다. <code>context.xml</code> 파일이 올 바르고 올바른지, 해당 <code>R</code> 클래스 파일이 생성 / 컴파일되었는지 확인하십시오. Java 기호는 대소 문자를 구분하므로 해당 XML ID도 대소 문자를 구분합니다.
ru: <strong>Проблемы с Android</strong> : если вы программируете для Android и у вас есть ошибки &laquo;Не удается найти символ&raquo;, связанные с <code>R</code> , помните, что символы <code>R</code> определены в файле <code>context.xml</code> . Убедитесь, что ваш файл <code>context.xml</code> правильный и в правильном месте, и что соответствующий файл класса <code>R</code> был сгенерирован / скомпилирован. Обратите внимание, что символы Java чувствительны к регистру, поэтому соответствующие идентификаторы XML также чувствительны к регистру.
zh_cn: <strong>Android问题</strong> ：在为Android编程时，您遇到与 <code>R</code> 相关的&ldquo;找不到符号&rdquo;错误，请注意， <code>R</code> 符号是由 <code>context.xml</code> 文件定义的。 检查您的 <code>context.xml</code> 文件是正确的并且在正确的位置，并且已经生成/编译了相应的 <code>R</code> 类文件。 请注意，Java符号区分大小写，因此相应的XML ID也区分大小写。

source: <strong>Homoglyphs:</strong> If you use UTF-8 encoding for your source files, it is possible to have identifiers that <em>look</em> the same, but are in fact different because they contain homoglyphs. See <a href="http://en.wikipedia.org/wiki/Homoglyph">this page</a> for more information.
es: <strong>Homoglifos:</strong> si usa la codificaci&oacute;n UTF-8 para sus archivos fuente, es posible tener identificadores que se <em>vean</em> iguales, pero de hecho son diferentes porque contienen homoglifos. Vea <a href="http://en.wikipedia.org/wiki/Homoglyph">esta p&aacute;gina</a> para m&aacute;s informaci&oacute;n.
ja: <strong>ホモグリフ：</strong>ソースファイルにUTF-8エンコーディングを使用している場合、同じ<em>ように見える</em>識別子を使用できますが、 <strong>ホモグリフ</strong>が含まれているため、実際には異なります。 詳細については、 <a href="http://en.wikipedia.org/wiki/Homoglyph">このページ</a>を参照してください 。
ko: <strong>상형 문자 :</strong> 소스 파일에 UTF-8 인코딩을 사용하는 경우 식별자는 동일하지만 상형 문자를 포함하므로 실제로 다른 식별자를 가질 수 있습니다. 자세한 내용은 <a href="http://en.wikipedia.org/wiki/Homoglyph">이 페이지</a> 를 참조하십시오.
ru: <strong>Гомоглифы:</strong> если вы используете кодировку UTF-8 для своих исходных файлов, возможно, что идентификаторы <em>выглядят</em> одинаково, но на самом деле они разные, поскольку содержат гомоглифы. Смотрите <a href="http://en.wikipedia.org/wiki/Homoglyph">эту страницу</a> для получения дополнительной информации.
zh_cn: <strong>同源符号：</strong>如果对源文件使用UTF-8编码，则可能具有<em>看起来</em>相同但实际上不同的标识符，因为它们包含同源符号。 有关更多信息，请参<a href="http://en.wikipedia.org/wiki/Homoglyph">见此页面</a> 。

source: <strong>IDE issues</strong>: People have reported cases where their IDE gets confused and the compiler in the IDE cannot find a class that exists ... or the reverse situation.
es: <strong>Problemas de IDE</strong> : las personas han informado casos en los que su IDE se confunde y el compilador en el IDE no puede encontrar una clase que exista ... o la situaci&oacute;n inversa.
ja: <strong>IDEの問題</strong> ：IDEが混乱し、IDEのコンパイラーが存在するクラスを見つけられない、またはその逆の状況が報告されています。
ko: <strong>IDE 문제</strong> : 사람들은 IDE가 혼란스러워 IDE의 컴파일러가 존재하는 클래스를 찾을 수없는 경우 또는 반대 상황을보고했습니다.
ru: <strong>Проблемы IDE</strong> : Люди сообщали о случаях, когда их IDE путается, и компилятор в IDE не может найти класс, который существует ... или обратная ситуация.
zh_cn: <strong>IDE问题</strong> ：人们已经报告了他们的IDE混乱并且IDE中的编译器找不到存在的类的情况&hellip;&hellip;或相反的情况。

source: <strong>Incorrect dependencies</strong>: If you are using an IDE or a build tool that manages the build path and project dependencies, you may have made a mistake with the dependencies; e.g. left out a dependency, or selected the wrong version. If you are using a build tool (Ant, Maven, Gradle, etc), check the project's build file. If you are using an IDE, check the project's build path configuration.
es: <strong>Dependencias incorrectas</strong> : si est&aacute; utilizando un IDE o una herramienta de compilaci&oacute;n que gestiona la ruta de compilaci&oacute;n y las dependencias del proyecto, es posible que haya cometido un error con las dependencias; por ejemplo, dej&oacute; de lado una dependencia o seleccion&oacute; la versi&oacute;n incorrecta. Si est&aacute; utilizando una herramienta de compilaci&oacute;n (Ant, Maven, Gradle, etc.), verifique el archivo de compilaci&oacute;n del proyecto. Si est&aacute; utilizando un IDE, verifique la configuraci&oacute;n de la ruta de compilaci&oacute;n del proyecto.
ja: <strong>不適切な依存関係</strong> ： <strong>ビルドパス</strong>とプロジェクトの依存関係を管理するIDEまたはビルドツールを使用している場合、依存関係に誤りがある可能性があります。 たとえば、依存関係を省略したり、間違ったバージョンを選択した。 ビルドツール（Ant、Maven、Gradleなど）を使用している場合は、プロジェクトのビルドファイルを確認してください。 IDEを使用している場合は、プロジェクトのビルドパス構成を確認してください。
ko: <strong>잘못된 종속성</strong> : 빌드 경로 및 프로젝트 종속성을 관리하는 IDE 또는 빌드 도구를 사용하는 경우 종속성에 실수가있을 수 있습니다. 예를 들어 종속성을 제거하거나 잘못된 버전을 선택했습니다. 빌드 도구 (Ant, Maven, Gradle 등)를 사용하는 경우 프로젝트의 빌드 파일을 확인하십시오. IDE를 사용하는 경우 프로젝트의 빌드 경로 구성을 확인하십시오.
ru: <strong>Неверные зависимости</strong> : если вы используете IDE или инструмент сборки, который управляет путем сборки и зависимостями проекта, возможно, вы допустили ошибку с зависимостями; например, исключил зависимость или выбрал неправильную версию. Если вы используете инструмент сборки (Ant, Maven, Gradle и т. Д.), Проверьте файл сборки проекта. Если вы используете IDE, проверьте конфигурацию пути сборки проекта.
zh_cn: <strong>不正确的依赖关系</strong> ：如果您使用的是IDE或管理构建路径和项目依赖关系的构建工具，则可能是错误的依赖关系； 例如遗漏了一个依赖项，或者选择了错误的版本。 如果您使用的是构建工具（Ant，Maven，Gradle等），请检查项目的构建文件。 如果使用的是IDE，请检查项目的构建路径配置。

source: <strong>One more example of 'Variable is out of scope'</strong>
es: <strong>Un ejemplo m&aacute;s de 'La variable est&aacute; fuera de alcance'</strong>
ja: <strong>「変数は範囲外です」のもう1つの例</strong>
ko: <strong>'가변이 범위를 벗어남'의 또 다른 예</strong>
ru: <strong>Еще один пример &laquo;Переменная выходит за рамки&raquo;</strong>
zh_cn: <strong>&ldquo;变量超出范围&rdquo;的另一个示例</strong>

source: <strong>Problem:</strong> I was calling a static method defined in the class of a project A from a class defined in another project B. I was getting the following error:
es: <strong>Problema:</strong> estaba llamando a un m&eacute;todo est&aacute;tico definido en la clase de un proyecto A desde una clase definida en otro proyecto B. Recib&iacute;a el siguiente error:
ja: <strong>問題：</strong>プロジェクトAのクラスで定義された静的メソッドを別のプロジェクトBで定義されたクラスから呼び出していました。次のエラーが発生しました：
ko: <strong>문제점 :</strong> 다른 프로젝트 B에 정의 된 클래스에서 프로젝트 A의 클래스에 정의 된 정적 메소드를 호출했습니다. 다음 오류가 발생했습니다.
ru: <strong>Проблема:</strong> я вызывал статический метод, определенный в классе проекта A, из класса, определенного в другом проекте B. Я получил следующую ошибку:
zh_cn: <strong>问题：</strong>我正在从另一个项目B中定义的类调用在项目A的类中定义的静态方法。出现以下错误：

source: <strong>Redefining system classes</strong>: I've seen cases where the compiler complains that <code>substring</code> is an unknown symbol in something like the following
es: <strong>Redefiniendo las clases del sistema</strong> : he visto casos en los que el compilador se queja de que la <code>substring</code> es un s&iacute;mbolo desconocido en algo como lo siguiente
ja: <strong>システムクラスの再定義</strong> ：コンパイラが次のような <code>substring</code> が不明なシンボルであると不平を言う場合を見てきました
ko: <strong>시스템 클래스 재정의</strong> : 컴파일러에서 <code>substring</code> 이 다음과 같은 알 수없는 기호라고 불평하는 경우를 보았습니다.
ru: <strong>Переопределение системных классов</strong> : я видел случаи, когда компилятор жалуется, что <code>substring</code> является неизвестным символом в чем-то вроде следующего
zh_cn: <strong>重新定义系统类</strong> ：我已经看到编译器抱怨 <code>substring</code> 是未知符号的情况，如下所示

source: <strong>Solution:</strong> I resolved this by first building the project where the method is defined then the project where the method was being called from.
es: <strong>Soluci&oacute;n:</strong> Resolv&iacute; esto construyendo primero el proyecto donde se define el m&eacute;todo y luego el proyecto desde el que se llam&oacute; al m&eacute;todo.
ja: <strong>解決策：</strong>最初にメソッドが定義されているプロジェクトをビルドし、次にメソッドが呼び出されているプロジェクトをビルドすることで、これを解決しました。
ko: <strong>솔루션 :</strong> 먼저 메소드가 정의 된 프로젝트를 빌드 한 다음 메소드가 호출 된 프로젝트를 빌드하여이 문제를 해결했습니다.
ru: <strong>Решение:</strong> я решил эту проблему, сначала создав проект, в котором определяется метод, а затем проект, из которого вызывался метод.
zh_cn: <strong>解决方案：</strong>我首先通过建立定义方法的项目，然后再从其中调用方法的项目来解决此问题。

source: <strong>You are not recompiling</strong>: It sometimes happens that new Java programmers don't understand how the Java tool chain works, or haven't implemented a repeatable "build process"; e.g. using an IDE, Ant, Maven, Gradle and so on. In such a situation, the programmer can end up chasing his tail looking for an illusory error that is <em>actually</em> caused by not recompiling the code properly, and the like ...
es: <strong>No est&aacute; volviendo a compilar</strong> : a veces sucede que los nuevos programadores de Java no entienden c&oacute;mo funciona la cadena de herramientas de Java o no han implementado un "proceso de compilaci&oacute;n" repetible; por ejemplo, usando un IDE, Ant, Maven, Gradle, etc. En tal situaci&oacute;n, el programador puede terminar persiguiendo su cola en busca de un error ilusorio que en <em>realidad</em> es causado por no volver a compilar el c&oacute;digo correctamente, y similares ...
ja: <strong>再コンパイルしていない</strong> ：新しいJavaプログラマーがJavaツールチェーンの動作を理解していない、または繰り返し可能な「ビルドプロセス」を実装していない場合があります。 たとえば、IDE、Ant、Maven、Gradleなどを使用します。 そのような状況では、プログラマーはコードを適切に再コンパイルしなかったことなどによって<em>実際に</em>引き起こされている幻想的なエラーを探して尾を追いかけてしまう可能性があります...
ko: <strong>재 컴파일</strong> 하지 않는 경우 : 새로운 Java 프로그래머가 Java 툴 체인의 작동 방식을 이해하지 못하거나 반복 가능한 "빌드 프로세스"를 구현하지 않은 경우가 있습니다. 예를 들어 IDE, Ant, Maven, Gradle 등을 사용합니다. 이러한 상황에서 프로그래머는 꼬리를 쫓아 결국 코드를 ​​올바르게 다시 컴파일하지 않아서 발생하는 환상적인 오류를 찾을 수 있습니다 ...
ru: <strong>Вы не перекомпилируете</strong> : иногда случается, что новые Java-программисты не понимают, как работает цепочка инструментов Java, или не реализуют повторяемый &laquo;процесс сборки&raquo;; например, используя IDE, Ant, Maven, Gradle и так далее. В такой ситуации программист может в итоге гоняться за хвостом в поисках иллюзорной ошибки, которая на <em>самом деле</em> вызвана неправильной перекомпиляцией кода и тому подобным ...
zh_cn: <strong>您无需重新编译</strong> ：有时候，新Java程序员可能不了解Java工具链的工作方式，或者没有实现可重复的&ldquo;构建过程&rdquo;； 例如，使用IDE，Ant，Maven，Gradle等。 在这种情况下，程序员最终可能会追尾寻找一个虚幻的错误，该错误<em>实际上是</em>由于未正确地重新编译代码而导致的，等等。

source: <sup>1 - If, perchance, you <em>do</em> see this in a runtime exception or error message, then either you have configured your IDE to run code with compilation errors, or your application is generating and compiling code .. at runtime.</sup>
es: <sup>1 - Si, por casualidad, ve esto en una excepci&oacute;n de tiempo de ejecuci&oacute;n o mensaje de error, entonces ha configurado su IDE para ejecutar c&oacute;digo con errores de compilaci&oacute;n, o su aplicaci&oacute;n est&aacute; generando y compilando c&oacute;digo ... en tiempo de ejecuci&oacute;n.</sup>
ja: <sup>1-ありがたいことに、実行時例外またはエラーメッセージにこれが表示される場合は、コンパイルエラーでコードを実行するようにIDEを構成しているか、アプリケーションが実行時にコードを生成およびコンパイルしています。</sup>
ko: <sup>1-퍼런 스가 런타임 예외 또는 오류 메시지에 표시되면 컴파일 오류로 코드를 실행하도록 IDE를 구성했거나 런타임시 응용 프로그램이 코드를 생성 및 컴파일하는 중입니다.</sup>
ru: <sup>1 - Если, возможно, вы видите это в исключительной ситуации или сообщении об ошибке во время выполнения, то либо вы настроили IDE для выполнения кода с ошибками компиляции, либо ваше приложение генерирует и компилирует код ... во время выполнения.</sup>
zh_cn: <sup>1-如果有可能在运行时异常或错误消息中看到此错误，则说明您已将IDE配置为运行带有编译错误的代码，或者您的应用程序正在运行时生成和编译代码。</sup>

source: <sup>2 - The three basic principles of Civil Engineering: water doesn't flow uphill, a plank is stronger on its side, and <em>you can't push on a string</em>.</sup>
es: <sup>2 - Los tres principios b&aacute;sicos de la Ingenier&iacute;a Civil: el agua no fluye cuesta arriba, un tabl&oacute;n es m&aacute;s fuerte de lado y <em>no se puede empujar una cuerda</em> .</sup>
ja: <sup>2-土木工学の3つの基本原則：水は上り坂に流れず、厚板はその側が強く<em>、紐を押すことはできません</em> 。</sup>
ko: <sup>2-토목 공학의 세 가지 기본 원칙 : 물이 오르막으로 흐르지 않고 판자가 더 강해져 <em>끈을 밀 수 없습니다</em> .</sup>
ru: <sup>2 - Три основных принципа гражданского строительства: вода не течет в гору, доска сильнее на ее стороне, и <em>вы не можете толкнуть веревку</em> .</sup>
zh_cn: <sup>2-土木工程的三个基本原则：水不向上流，木板在其侧面更坚固，并且<em>您不能用力压绳子</em> 。</sup>

source: A "Cannot find symbol" error is about the identifiers. When your code is compiled, the compiler needs to work out what each and every identifier in your code means.
es: Un error de "No se puede encontrar el símbolo" se refiere a los identificadores.Cuando tu código es compilado,el compilador necesita averiguar qué significan todos y cada uno de los identificadores de tu código.
ja: Cannot find symbol" エラーは識別子に関するものです。あなたのコードがコンパイルされるとき、コンパイラはあなたのコードの各識別子が何を意味するのかを調べる必要があります。
ko: "심볼을 찾을 수 없습니다"오류는 식별자에 관한 것입니다. 코드가 컴파일되면 컴파일러는 코드의 각 식별자가 의미하는 바를 해결해야합니다.
ru: Ошибка "Не могу найти символ" связана с идентификаторами.Когда Ваш код скомпилирован,компилятору необходимо выяснить,что означает каждый идентификатор в Вашем коде.
zh_cn: "无法找到符号 "错误是关于标识符的问题。当你的代码被编译时,编译器需要找出你代码中的每一个标识符的含义。

source: A "Cannot find symbol" error means that the compiler cannot do this. Your code appears to be referring to something that the compiler doesn't understand.
es: Un error de "No se puede encontrar el símbolo" significa que el compilador no puede hacer esto.Su código parece referirse a algo que el compilador no entiende.
ja: Cannot find symbol" エラーは、コンパイラがこれを実行できないことを意味します。あなたのコードは、コンパイラが理解できない何かを参照しているように見えます。
ko: "기호를 찾을 수 없음"오류는 컴파일러가이를 수행 할 수 없음을 의미합니다. 코드가 컴파일러가 이해하지 못하는 것을 나타내는 것으로 보입니다.
ru: Ошибка "Cannot find symbol" означает,что компилятор не может этого сделать.Похоже,что ваш код относится к чему-то,что компилятор не понимает.
zh_cn: "Cannot find symbol "错误意味着编译器无法完成这个任务。你的代码似乎指的是编译器不理解的东西。

source: Add (Popup window will open) -&gt;
es: Agregar (se abrir&aacute; una ventana emergente) -&gt;
ja: 追加（ポップアップウィンドウが開きます）-&gt;
ko: 추가 (팝업 창이 열립니다)-&gt;
ru: Добавить (откроется всплывающее окно) -&gt;
zh_cn: 添加（将打开弹出窗口）-&gt;
