Repository: rueisnom/feedback
Catalog: xlf/25/70/62/16/25706216.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As I've seen that kind of questions a few times already, maybe one more example to what's illegal even if it might <em>feel</em> okay.
es: Como ya he visto ese tipo de preguntas varias veces, tal vez un ejemplo m&aacute;s de lo que es ilegal, incluso si se <em>siente</em> bien.
ja: この種の質問をすでに何度か見てきたので、たとえ大丈夫だと<em>感じ</em>ても違法なものの例をもう1つ挙げます。
ko: 내가 몇 번이나 그런 종류의 질문을 보았 듯이, 그것이 괜찮다고 <em>느낄</em> 지라도 불법적 인 것에 대한 또 다른 예일 <em>것</em> 입니다.
ru: Как я уже видел подобные вопросы уже несколько раз, может быть, еще один пример того, что незаконно, даже если это может <em>показаться</em> нормальным.
zh_cn: 正如我已经看过几次这样的问题一样，即使可能<em>觉得</em>没问题，也许还有另一个例子说明违法行为。

source: As a first order, there is only one cause. The compiler looked in all of the places where the identifier <em>should</em> be defined, and it couldn't find the definition. This could be caused by a number of things. The common ones are as follows:
es: Como primer orden, solo hay una causa. El compilador busc&oacute; en todos los lugares donde se <em>deber&iacute;a</em> definir el identificador, y no pudo encontrar la definici&oacute;n. Esto podr&iacute;a ser causado por varias cosas. Los comunes son los siguientes:
ja: 最初の注文として、原因は1つだけです。 コンパイラは、識別子<em>を</em>定義する<em>必要</em>があるすべての場所を調べましたが、定義を見つけることができませんでした。 これにはいくつかの原因が考えられます。 一般的なものは次のとおりです。
ko: 첫 번째 주문은 원인이 하나뿐입니다. 컴파일러는 식별자 <em>를</em> 정의 <em>해야하는</em> 모든 위치를 조사했으며 정의를 찾을 수 없습니다. 여러 가지가 원인 일 수 있습니다. 일반적인 것은 다음과 같습니다.
ru: Как первый заказ, есть только одна причина. Компилятор просматривал все места, где <em>должен</em> быть определен идентификатор, и не смог найти определение. Это может быть вызвано рядом вещей. Общие из них следующие:
zh_cn: 首先，只有一个原因。 编译器查看了<em>应该</em>定义标识符的所有位置，但找不到该定义。 这可能是由多种原因引起的。 常见的如下：

source: But you'd be wrong.
es: Pero te equivocas.
ja: でも、あなたは間違っているでしょう。
ko: 그러나 당신은 틀릴 것입니다.
ru: Но ты ошибаешься.
zh_cn: 但你会错了。

source: Clean <code>target</code> directory.
es: Limpie <code>target</code> directorio de destino .
ja: <code>target</code> ディレクトリを消去します。
ko: <code>target</code> 디렉토리를 정리하십시오.
ru: Очистите <code>target</code> каталог.
zh_cn: 清理 <code>target</code> 目录。

source: Comments and whitespace.
es: Comentarios y espacio en blanco.
ja: コメントと空白。
ko: 주석과 공백.
ru: Комментарии и пробелы.
zh_cn: 评论和空白处。

source: Consider this code:
es: Considere este código:
ja: このコードを考えてみてください。
ko: 이 코드를 고려하십시오.
ru: Рассмотрим этот код:
zh_cn: 考虑一下这个代码。

source: Define a class <code>A</code> in <code>src/test/java</code>.
es: Defina una clase <code>A</code> en <code>src/test/java</code> .
ja: <code>src/test/java</code> でクラス <code>A</code> を定義します。
ko: <code>src/test/java</code> 에서 클래스 <code>A</code> 를 정의하십시오.
ru: Определите класс <code>A</code> в <code>src/test/java</code> .
zh_cn: 在 <code>src/test/java</code> 中定义 <code>A</code> 类。

source: Define another class <code>B</code> in <code>src/main/java</code> that uses class <code>A</code>.
es: Defina otra clase <code>B</code> en <code>src/main/java</code> que use la clase <code>A</code> .
ja: クラス <code>A</code> を使用する別のクラス <code>B</code> を <code>src/main/java</code> で定義します。
ko: 클래스 <code>A</code> 를 사용하는 다른 클래스 <code>B</code> 를 <code>src/main/java</code> 에 정의하십시오.
ru: Определите другой класс <code>B</code> в <code>src/main/java</code> , который использует класс <code>A</code> .
zh_cn: 在 <code>src/main/java</code> 中定义另一个使用类 <code>A</code> 的类 <code>B</code> 。

source: Despite the previous declaration, the <code>tmp</code> in the <code>tmp(...)</code> expression is erroneous. The compiler will look for a method called <code>tmp</code>, and won't find one. The previously declared <code>tmp</code> is in the namespace for variables, not the namespace for methods.
es: A pesar de la declaraci&oacute;n anterior, el <code>tmp</code> en la expresi&oacute;n <code>tmp(...)</code> es err&oacute;neo. El compilador buscar&aacute; un m&eacute;todo llamado <code>tmp</code> , y no encontrar&aacute; uno. El <code>tmp</code> declarado previamente est&aacute; en el espacio de nombres para las variables, no en el espacio de nombres para los m&eacute;todos.
ja: 前の宣言にもかかわらず、 <code>tmp(...)</code> 式のtmpに誤りがあります。 コンパイラーは <code>tmp</code> というメソッドを探しますが、見つかりません。 以前に宣言された <code>tmp</code> は、メソッドの名前空間ではなく、変数の名前空間にあります。
ko: 이전 선언에도 불구하고 <code>tmp(...)</code> 식의 tmp 가 잘못되었습니다. 컴파일러는 <code>tmp</code> 라는 메소드를 찾고 찾지 않습니다. 이전에 선언 된 <code>tmp</code> 는 메서드의 네임 스페이스가 아니라 변수의 네임 스페이스에 있습니다.
ru: Несмотря на предыдущее объявление, <code>tmp</code> в выражении <code>tmp(...)</code> ошибочен. Компилятор будет искать метод с именем <code>tmp</code> и не найдет его. Ранее объявленный <code>tmp</code> находится в пространстве имен для переменных, а не в пространстве имен для методов.
zh_cn: 尽管有先前的声明，但 <code>tmp(...)</code> 表达式中的tmp是错误的。 编译器将寻找一种名为 <code>tmp</code> 的方法，但找不到。 先前声明的 <code>tmp</code> 在变量的名称空间中，而不在方法的名称空间中。

source: Don't define your dependencies that way; i.e. don't make this mistake.
es: No defina sus dependencias de esa manera;es decir,no cometa este error.
ja: 依存関係をそのように定義してはいけません。
ko: 그런 식으로 의존성을 정의하지 마십시오. 즉,이 실수를하지 마십시오.
ru: Не определяйте так свои зависимости,т.е.не делайте эту ошибку.
zh_cn: 不要这样定义你的依赖关系;也就是说,不要犯这个错误。

source: Figure out <em>why</em> the compiler is saying that it cannot find the symbol; see above!
es: Averigua <em>por qu&eacute;</em> el compilador dice que no puede encontrar el s&iacute;mbolo; &iexcl;v&eacute;ase m&aacute;s arriba!
ja: コンパイラがシンボルを見つけられないと言っている<em>理由を理解し</em>てください。 上記を参照！
ko: 컴파일러가 심볼을 찾을 수 없다고 말하는 <em>이유</em> 를 파악하십시오. 위 참조!
ru: Выясните, <em>почему</em> компилятор говорит, что он не может найти символ; смотри выше!
zh_cn: 弄清楚<em>为什么</em>编译器说找不到符号； 看上面！

source: Finally do right click on project Debug as -&gt; Maven clean, Maven build steps
es: Finalmente haga clic derecho en la depuraci&oacute;n del proyecto como -&gt; Maven clean, Maven build steps
ja: 最後にプロジェクトを右クリックして、Debug as-&gt; Maven clean、Maven build stepsを実行します
ko: 마지막으로 프로젝트 디버그를 마우스 오른쪽 버튼으로 클릭하십시오-&gt; Maven clean, Maven 빌드 단계
ru: Наконец, щелкните правой кнопкой мыши на проекте Debug as -&gt; Maven clean, шаги сборки Maven.
zh_cn: 最后，右键单击项目Debug as-&gt; Maven clean，Maven构建步骤

source: Firstly, it is a <em>compilation error</em><sup>1</sup>. It means that <em>either</em> there is a problem in your Java source code, <em>or</em> there is a problem in the way that you are compiling it.
es: En primer lugar, es un <em>error de compilaci&oacute;n</em> <sup>1</sup> . Significa que hay un problema en su c&oacute;digo fuente de Java, <em>o</em> hay un problema en la forma en que lo est&aacute; compilando.
ja: まず、 <em>コンパイルエラー</em> <sup>1</sup>です。 これは、Javaソースコードに問題があるか、それをコンパイルする方法に問題があることを意味します。
ko: 먼저 <em>컴파일 오류</em> <sup>1</sup> 입니다. Java 소스 코드에 문제가 <em>있거나</em> 컴파일하는 데 문제가 있음을 의미합니다.
ru: Во-первых, это <em>ошибка компиляции</em> <sup>1</sup> . Это означает, что <em>либо</em> проблема в исходном коде Java, <em>либо</em> в способе его компиляции.
zh_cn: 首先，它是<em>编译错误</em> <sup>1</sup> 。 这意味着您的Java源代码有问题， <em>或者</em>您的编译方式有问题。

source: For cases where type or instance doesn't appear to have the member you were expecting it to have:
es: Para los casos en los que el tipo o la instancia no parece tener el miembro que esperabas que tuviera:
ja: 型やインスタンスが期待していたメンバを持っていないように見える場合。
ko: 유형 또는 인스턴스에 예상 한 멤버가없는 것으로 보이는 경우 :
ru: Для случаев,когда тип или экземпляр,кажется,не имеет члена,которого вы ожидали:
zh_cn: 对于类型或实例不具备您所期望的成员的情况。

source: For example, Java 7 and Java 8 have different APIs, so calling a non-existent API in an older Java version would cause this error.
es: Por ejemplo,Java 7 y Java 8 tienen diferentes APIs,por lo que llamar a una API inexistente en una versión antigua de Java causaría este error.
ja: 例えば、Java 7とJava 8ではAPIが異なるため、古いJavaバージョンで存在しないAPIを呼び出すと、このエラーが発生します。
ko: 예를 들어, Java 7과 Java 8의 API는 서로 다르므로 이전 Java 버전에서 존재하지 않는 API를 호출하면이 오류가 발생합니다.
ru: Например,Java 7 и Java 8 имеют разные API,поэтому вызов несуществующего API в старой версии Java приведет к этой ошибке.
zh_cn: 例如,Java 7和Java 8有不同的API,所以在旧的Java版本中调用一个不存在的API会导致这个错误。

source: For hints, look closer at the class name name that throws an error and the line number, example: Compilation failure [ERROR] \applications\xxxxx.java:[44,30] error: cannot find symbol
es: Para pistas,mira más de cerca el nombre de la clase que arroja un error y el número de línea,por ejemplo:Fallo en la compilación [ERROR]\\N-aplicaciones \N-xxxxxx.java:[44,30]error:no se puede encontrar el símbolo
ja: ヒントは、エラーが出るクラス名と行番号をよく見てください。
ko: 힌트를 보려면 오류가 발생하는 클래스 이름 이름과 줄 번호를 자세히 살펴보십시오. 예 : 컴파일 실패 [ERROR] \ applications \ xxxxx.java : [44,30] 오류 : 기호를 찾을 수 없습니다
ru: Для подсказок присмотритесь к имени класса,которое вызывает ошибку,и к номеру строки,например:Ошибка компиляции [ERROR]\applications\xxxxx.java:[44,30]error:cannot find symbol
zh_cn: 关于提示,请仔细看一下抛出错误的类名和行号,例如。Compilation failure [ERROR]\applications\xxxxx.java:[44,30]error:cannot find symbol

source: For identifiers in general:
es: Para los identificadores en general:
ja: 識別子全般について。
ko: 일반적으로 식별자의 경우 :
ru: Для идентификаторов в целом:
zh_cn: 对于一般的标识符:

source: For identifiers that should be class names:
es: Para los identificadores que deben ser nombres de clase:
ja: クラス名であるべき識別子の場合。
ko: 클래스 이름이어야하는 식별자의 경우 :
ru: Для идентификаторов,которые должны быть именами классов:
zh_cn: 对于应该是类名的标识符。

source: For identifiers that should be method or field names:
es: Para los identificadores que deben ser nombres de método o de campo:
ja: メソッド名やフィールド名であるべき識別子を指定します。
ko: 메소드 또는 필드 이름이어야하는 식별자의 경우 :
ru: Для идентификаторов,которые должны быть именами методов или полей:
zh_cn: 对于应该是方法或字段名称的标识符:

source: For identifiers that should refer to variables:
es: Para los identificadores que deben referirse a las variables:
ja: 変数を参照すべき識別子の場合。
ko: 변수를 참조해야하는 식별자 :
ru: Для идентификаторов,которые должны относиться к переменным:
zh_cn: 对于应指变量的标识符:

source: Generally speaking, you start out by figuring out what <em>caused</em> the compilation error.
es: En t&eacute;rminos generales, comienza por descubrir qu&eacute; <em>caus&oacute;</em> el error de compilaci&oacute;n.
ja: 一般的に言えば、コンパイルエラーの<em>原因を</em>突き止めることから始めます。
ko: 일반적으로 컴파일 오류의 <em>원인</em> 을 파악하여 시작합니다.
ru: Вообще говоря, вы начинаете с выяснения причины ошибки компиляции.
zh_cn: 一般来说，首先要弄清楚是什么<em>导致</em>了编译错误。

source: Here are a couple of cases where the "Cannot find symbol" is seemingly inexplicable ... until you look closer.
es: Aquí hay un par de casos en los que el "Símbolo de no encontrar" es aparentemente inexplicable...hasta que se mira más de cerca.
ja: ここでは、「シンボルが見つからない」という一見不可解なケースをいくつか紹介します......よく見るまでは。
ko: 다음은 "심볼을 찾을 수 없음"이 더 이상 보이지 않을 때까지 설명 할 수없는 몇 가지 경우입니다.
ru: Вот пара случаев,когда "Символ "Не могу найти" кажется необъяснимым...пока вы не посмотрите поближе.
zh_cn: 下面是几个看似莫名其妙的 "找不到符号 "的情况...........直到你走近一看,才发现。

source: Here is an example of how incorrect variable scoping can lead to a "Cannot find symbol" error:
es: He aquí un ejemplo de cómo un alcance variable incorrecto puede llevar a un error de "No se puede encontrar el símbolo":
ja: ここでは、変数のスコープが正しくないと「シンボルが見つかりません」というエラーが発生する例を示します。
ko: 다음은 잘못된 변수 범위 지정으로 인해 "기호를 찾을 수 없음"오류가 발생하는 예입니다.
ru: Приведем пример того,как некорректный поиск переменных может привести к ошибке "Cannot find symbol":
zh_cn: 下面是一个例子,说明不正确的变量范围界定会导致 "无法找到符号 "错误。

source: Here is an example that causes puzzlement where a typo leads to a seemingly inexplicable "Cannot find symbol" error:
es: He aquí un ejemplo que causa perplejidad,en el que una errata conduce a un error aparentemente inexplicable de "No se puede encontrar el símbolo":
ja: ここでは、タイプミスが原因で、一見不可解な「記号が見つかりません」というエラーが発生し、困惑させてしまう例を紹介します。
ko: 다음은 오타가 설명 할 수없는 "기호를 찾을 수 없음"오류로 이어지는 당황스러운 예입니다.
ru: Вот пример,который вызывает недоумение,когда опечатка приводит к,казалось бы,необъяснимой ошибке "Cannot find symbol":
zh_cn: 这里有一个例子让人疑惑不解,在这个例子中,一个错别字导致了一个看似莫名其妙的 "找不到符号 "的错误。

source: Here is another example of "Cannot find symbol" error that is caused by a typo.
es: Aquí hay otro ejemplo de error de "No se puede encontrar el símbolo" causado por una errata.
ja: ここにも、タイプミスによる「シンボルが見つからない」エラーの例があります。
ko: 다음은 오타로 인한 "기호를 찾을 수 없음"오류의 다른 예입니다.
ru: Вот еще один пример ошибки "Cannot find symbol",вызванной опечаткой.
zh_cn: 下面是另一个由错别字引起的 "找不到符号 "错误的例子。

source: How does the programmer go about fixing them?
es: ¿Cómo hace el programador para arreglarlos?
ja: プログラマーはどうやって直すの?
ko: 프로그래머는 그것들을 어떻게 고치나요?
ru: Как программист собирается их исправлять?
zh_cn: 程序员该如何去解决?

source: I could add a declaration for <code>j</code><em>before</em> the inner <code>for</code> loop, or the outer <code>for</code> loop - possibly correct.
es: Podr&iacute;a agregar una declaraci&oacute;n para <code>j</code> <em>antes</em> del bucle <code>for</code> interno o el bucle <code>for</code> externo, posiblemente correcto.
ja: 内側の <code>for</code> ループまたは外側の <code>for</code> ループの<em>前</em>に <code>j</code> の宣言を追加できます-おそらく正しいです。
ko: 내부 <code>for</code> 루프 또는 외부 <code>for</code> 루프 <em>앞에</em> <code>j</code> 에 대한 선언을 추가 할 수 있습니다.
ru: Я мог бы добавить объявление для <code>j</code> <em>перед</em> внутренним циклом <code>for</code> или внешним <code>for</code> - возможно, правильным.
zh_cn: 我可以在内部 <code>for</code> 循环或外部 <code>for</code> 循环<em>之前</em>添加 <code>j</code> 的声明-可能是正确的。

source: I could change <code>j</code> to <code>i</code> in the inner <code>for</code> loop - probably wrong!
es: Podr&iacute;a cambiar <code>j</code> a <code>i</code> en el bucle <code>for</code> interno, &iexcl;probablemente incorrecto!
ja: 内部の <code>for</code> ループで <code>j</code> を <code>i</code> に変更できます-おそらく間違っています！
ko: 내부 <code>for</code> 루프에서 <code>j</code> 를 <code>i</code> 로 변경할 수 있습니다.
ru: Я мог бы изменить <code>j</code> на <code>i</code> во внутреннем цикле <code>for</code> - вероятно, неправильно!
zh_cn: 我可以在内部 <code>for</code> 循环中将 <code>j</code> 更改为 <code>i</code> -可能错了！

source: I could change the inner <code>for</code> to <code>for (int j = 1; j &lt; 10; j++)</code> - probably correct.
es: Podr&iacute;a cambiar el interno <code>for</code> <code>for (int j = 1; j &lt; 10; j++)</code> , probablemente correcto.
ja: 私はインナーを <code>for (int j = 1; j &lt; 10; j++)</code> 変更できます-おそらく正しいです。
ko: 내부를 <code>for (int j = 1; j &lt; 10; j++)</code> 바꿀 수 있습니다. 아마 맞습니다.
ru: Я мог бы изменить внутренний <code>for</code> на <code>for (int j = 1; j &lt; 10; j++)</code> - возможно, правильный.
zh_cn: 我可以将 <code>for</code> 的内部变量更改 <code>for (int j = 1; j &lt; 10; j++)</code> -可能是正确的。

source: I too was getting this error. (for which I googled and I was directed to this page)
es: Yo también estaba recibiendo este error.(por el cual busqué en Google y fui dirigido a esta página)
ja: 私もこのエラーが出ました。(そのためにググったらこのページにたどり着きました)
ko: 나도이 오류가 발생했습니다. (내가 Google에 접속하여이 페이지로 연결됨)
ru: Я тоже получил эту ошибку.(за которую я погуглил и меня направили на эту страницу).
zh_cn: 我也得到这个错误。(为此,我上网搜索了一下,结果被引导到了这个页面)

source: I'll create a demo class and print a name...
es: Crearé una clase de demostración e imprimiré un nombre...
ja: デモクラスを作って名前を印刷してみる・・・。
ko: 데모 클래스를 만들고 이름을 인쇄하겠습니다.
ru: Я создам демонстрационный класс и напечатаю имя...
zh_cn: 我会创建一个演示类并打印一个名字......

source: Identifiers: like <code>Reader</code>, <code>i</code>, <code>toString</code>, <code>processEquibalancedElephants</code>, and so on.
es: Identificadores: como <code>Reader</code> , <code>i</code> , <code>toString</code> , <code>processEquibalancedElephants</code> , etc.
ja: 識別子： <code>Reader</code> 、 <code>i</code> 、 <code>toString</code> 、 <code>processEquibalancedElephants</code> などのように。
ko: 식별자 : <code>Reader</code> , <code>i</code> , <code>toString</code> , <code>processEquibalancedElephants</code> 등.
ru: Идентификаторы: как <code>Reader</code> , <code>i</code> , <code>toString</code> , <code>processEquibalancedElephants</code> и т. Д.
zh_cn: 标识符：如 <code>Reader</code> ， <code>i</code> ， <code>toString</code> ， <code>processEquibalancedElephants</code> 等。

source: Identify which symbol that the error message is talking about.
es: Identifica el símbolo del que habla el mensaje de error.
ja: エラーメッセージが話しているシンボルを特定してください。
ko: 오류 메시지가 말하는 기호를 식별하십시오.
ru: Определите,о каком символе идет речь в сообщении об ошибке.
zh_cn: 辨别出错误信息说的是哪个符号。

source: If eclipse Java build path is mapped to 7, 8 and in Project pom.xml Maven properties java.version is mentioned higher Java version(9,10,11, etc..,) than 7,8 you need to update in pom.xml file.
es: Si la ruta de construcción de Java del eclipse está mapeada a 7,8 y en el proyecto pom.xml las propiedades de Maven java.version se mencionan más arriba de la versión de Java(9,10,11,etc.,)que la 7,8 es necesario actualizar en el archivo pom.xml.
ja: eclipseのJavaビルドパスが7,8にマップされていて、Project pom.xmlのMavenプロパティでjava.versionが7,8よりも高いJavaバージョン(9,10,11など)と記載されている場合は、pom.xmlファイルを更新する必要があります。
ko: 일식 Java 빌드 경로가 7, 8에 매핑되고 Project pom.xml에서 Maven 속성 java.version이 7,8보다 높은 Java 버전 (9,10,11 등)으로 언급되면 pom에서 업데이트해야합니다. xml 파일.
ru: Если путь к сборке eclipse Java отображен в 7,8 и в проекте pom.xml указаны свойства Maven java.version выше Java версии(9,10,11 и т.д.),чем 7,8,то вам необходимо обновиться в файле pom.xml.
zh_cn: 如果eclipse的Java构建路径被映射到7、8,并且在Project pom.xml Maven属性中提到java.version比7、8更高的Java版本(9、10、11等),你需要在pom.xml文件中更新。

source: If you are using IntelliJ
es: Si usted está usando IntelliJ
ja: IntelliJを使用している場合
ko: IntelliJ를 사용하는 경우
ru: Если вы используете IntelliJ
zh_cn: 如果您正在使用 IntelliJ

source: If you're getting this error in the build somewhere else, while your IDE says everything is perfectly fine, then check that you are using the same Java versions in both places.
es: Si recibes este error en la compilación en otro lugar,mientras que tu IDE dice que todo está perfectamente bien,entonces comprueba que estás usando las mismas versiones de Java en ambos lugares.
ja: もし、IDE が問題ないと言っているのに、どこか他の場所のビルドでこのエラーが発生している場合は、両方の場所で同じ Java のバージョンを使用しているかどうかを確認してください。
ko: IDE에서 모든 것이 완벽하다고 말하면서 빌드 에서이 오류가 발생하면 두 곳에서 동일한 Java 버전을 사용하고 있는지 확인하십시오.
ru: Если вы получаете эту ошибку в сборке где-то в другом месте,в то время как ваша IDE говорит,что все в полном порядке,то проверьте,что вы используете одни и те же версии Java в обоих местах.
zh_cn: 如果你在其他地方得到这个错误,而你的IDE却说一切正常,那么检查一下你在两个地方使用的Java版本是否相同。

source: In Eclipse if Java is mapped to Java version 11 and in pom.xml it is mapped to Java version 8. Update Eclipse support to Java 11 by go through below steps in eclipse IDE Help -&gt; Install New Software -&gt;
es: En Eclipse si Java est&aacute; asignado a Java versi&oacute;n 11 y en pom.xml est&aacute; asignado a Java versi&oacute;n 8. Actualice el soporte de Eclipse a Java 11 siguiendo los pasos a continuaci&oacute;n en la Ayuda de eclipse IDE -&gt; Instalar nuevo software -&gt;
ja: Eclipseでは、JavaがJavaバージョン11にマップされ、pom.xmlでJavaバージョン8にマップされます。EclipseIDEヘルプ-&gt;新しいソフトウェアのインストール-&gt;で以下の手順を実行して、EclipseサポートをJava 11に更新します。
ko: Eclipse에서 Java가 Java 버전 11에 맵핑되고 pom.xml에서는 Java 버전 8에 맵핑됩니다. Eclipse IDE 도움말-&gt; 새 소프트웨어 설치-&gt;에서 아래 단계를 수행하여 Eclipse 지원을 Java 11로 갱신하십시오.
ru: В Eclipse, если Java сопоставлена ​​с Java версии 11, а в pom.xml она сопоставлена ​​с Java версии 8. Обновите поддержку Eclipse до Java 11, выполнив следующие шаги в справке IDE eclipse -&gt; Установить новое программное обеспечение -&gt;
zh_cn: 在Eclipse中，如果Java映射到Java版本11，在pom.xml中，它映射到Java版本8，请通过执行Eclipse IDE帮助-&gt;安装新软件-&gt;中的以下步骤来将Eclipse支持更新为Java 11。

source: In my case - I had to perform below operations:
es: En mi caso...tuve que hacer operaciones de abajo:
ja: 私の場合は-以下の操作をしなければならなかった。
ko: 제 경우에는 아래 작업을 수행해야했습니다.
ru: В моем случае-я должен был выполнить нижеописанные операции:
zh_cn: 在我的情况下--我不得不执行下面的操作。

source: In the example I came across, the programmer had actually left out an operator. What he meant to write was this:
es: En el ejemplo que encontré,el programador había dejado fuera a un operador.Lo que quería escribir era esto:
ja: 私が出くわした例では、実はプログラマーは演算子を省いていました。彼が書きたかったのは、次のようなことです。
ko: 내가 만난 예에서 프로그래머는 실제로 운영자를 제외했습니다. 그가 쓰려고 한 것은 이것입니다.
ru: В примере,на который я наткнулся,программист на самом деле пропустил оператор.Он хотел написать вот это:
zh_cn: 在我接触到的例子中,程序员实际上遗漏了一个运算器。他的意思是这样写的。

source: It turned out that the programmer had created their own version of <code>String</code> and that his version of the class didn't define a <code>substring</code> methods.
es: Result&oacute; que el programador hab&iacute;a creado su propia versi&oacute;n de <code>String</code> y que su versi&oacute;n de la clase no defin&iacute;a los m&eacute;todos de una <code>substring</code> .
ja: プログラマーが独自のバージョンの <code>String</code> を作成し、クラスの彼のバージョンは <code>substring</code> メソッドを定義していないことがわかりました 。
ko: 프로그래머가 자체 버전의 <code>String</code> 을 작성했으며 클래스의 버전에서 <code>substring</code> 메소드를 정의하지 않은 것으로 나타났습니다.
ru: Оказалось, что программист создал свою собственную версию <code>String</code> и что его версия класса не определяла методы <code>substring</code> .
zh_cn: 事实证明，程序员创建了自己的 <code>String</code> 版本，而他的类版本未定义 <code>substring</code> 方法。

source: It's especially bad if you thought you did something good. I've seen this kind of error after "optimizing" code like this:
es: Es especialmente malo si piensas que hiciste algo bueno.He visto este tipo de error después de "optimizar" un código como este:
ja: 特に良いことをしたと思っていた場合は最悪です。このようなコードを「最適化」した後にこのようなエラーが出るのを見たことがあります。
ko: 좋은 일을했다고 생각하면 특히 나쁩니다. 다음과 같은 코드를 "최적화"한 후에 이런 종류의 오류가 발생했습니다.
ru: Особенно плохо,если ты думаешь,что сделал что-то хорошее.Я видел подобную ошибку после такой "оптимизации" кода:
zh_cn: 如果你以为自己做了什么好事,那就特别糟糕了。我见过这样的代码 "优化 "后出现这样的错误。

source: Java has no <code>free()</code> or <code>delete</code> operators, so it has to rely on tracking variable scope to find out when variables are no longer used (together with references to these variables of cause).
es: Java no tiene operadores <code>free()</code> o de <code>delete</code> , por lo que debe confiar en el alcance de la variable de seguimiento para averiguar cu&aacute;ndo las variables ya no se usan (junto con referencias a estas variables de causa).
ja: Javaには <code>free()</code> または <code>delete</code> 演算子がないため、変数が使用されなくなったときに（原因のこれらの変数への参照と共に）変数スコープの追跡に依存する必要があります。
ko: Java에는 <code>free()</code> 또는 <code>delete</code> 연산자가 없으므로 변수가 더 이상 사용되지 않는시기 (이러한 원인 변수에 대한 참조와 함께)를 찾으려면 변수 범위 추적에 의존해야합니다.
ru: В Java нет операторов <code>free()</code> или <code>delete</code> , поэтому она должна полагаться на отслеживание области видимости переменных, чтобы выяснить, когда переменные больше не используются (вместе со ссылками на эти переменные причины).
zh_cn: Java没有 <code>free()</code> 或 <code>delete</code> 运算符，因此它必须依靠跟踪变量范围来确定何时不再使用变量（以及对这些cause变量的引用）。

source: Keywords: like <code>true</code>, <code>false</code>, <code>class</code>, <code>while</code>, and so on.
es: Palabras clave: como <code>true</code> , <code>false</code> , <code>class</code> , <code>while</code> , etc.
ja: キーワード： <code>true</code> 、 <code>false</code> 、 <code>class</code> 、 <code>while</code> のように。
ko: 키워드 : <code>true</code> , <code>false</code> , <code>class</code> , <code>while</code> 등
ru: Ключевые слова: как <code>true</code> , <code>false</code> , <code>class</code> , <code>while</code> и так далее.
zh_cn: 关键字：像 <code>true</code> ， <code>false</code> ， <code>class</code> ， <code>while</code> 等等。

source: Lesson: Don't define your own classes with the same names as common library classes!
es: Lección:¡No defina sus propias clases con los mismos nombres que las clases comunes de la biblioteca!
ja: レッスンです。一般的なライブラリクラスと同じ名前で自分のクラスを定義してはいけません!
ko: 레슨 : 공통 라이브러리 클래스와 이름이 같은 클래스를 직접 정의하지 마십시오!
ru: Урок:Не определяйте свои собственные классы с теми же именами,что и обычные классы библиотеки!
zh_cn: 教训。不要把自己的班级定义成和普通库里的班级一样的名字!
