Repository: rueisnom/feedback
Catalog: xlf/59/63/51/596351.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This is working for me.
es: Esto funciona para mí.
ja: これは私のために働いています。
ko: 이것은 나를 위해 일하고 있습니다.
ru: Это работает на меня.
zh_cn: 这对我来说是有效的。

source: This should work:
es: Esto debería funcionar:
ja: これはうまくいくはずです。
ko: 이것은 작동해야합니다 :
ru: Это должно сработать:
zh_cn: 这应该可以的

source: This way I don't have to copy the much more complicated previous C# code also. The heavy lifting is being done right here.
es: De esta manera no tengo que copiar el código C#anterior mucho más complicado también.El trabajo pesado se hace aquí mismo.
ja: こうすることで、以前のC#のコードもずっと複雑なものをコピーしなくて済むようになりました。重い作業はここで行われています。
ko: 이렇게하면 훨씬 복잡한 이전 ​​C # 코드도 복사 할 필요가 없습니다. 여기서 무거운 짐을지고 있습니다.
ru: Таким образом,мне не придется копировать и гораздо более сложный предыдущий код на C#.Тяжелый подъем делается прямо здесь.
zh_cn: 这样一来,我就不用再复制之前更复杂的C#代码了。重活就在这里完成了。

source: This works fine
es: Esto funciona bien.
ja: これは正常に動作します。
ko: 이것은 잘 작동합니다
ru: Это прекрасно работает
zh_cn: 这样做很好

source: To get the value of the <strong>selected</strong><code>radioName</code> item of a form with id <code>myForm</code>:
es: Para obtener el valor del elemento <code>radioName</code> <strong>seleccionado</strong> de un formulario con id <code>myForm</code> :
ja: id <code>myForm</code> を持つフォームの<strong>選択された</strong> <code>radioName</code> アイテムの値を取得するには、次のようにします 。
ko: id가 <code>myForm</code> 인 양식의 <strong>선택된</strong> <code>radioName</code> 항목의 값을 가져 오려면 다음을 수행하십시오.
ru: Чтобы получить значение <strong>выбранного</strong> элемента <code>radioName</code> формы с идентификатором <code>myForm</code> :
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要获取</font><font style="vertical-align: inherit;">ID为</font> <code>myForm</code> <font style="vertical-align: inherit;">的表单</font><font style="vertical-align: inherit;">的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选定</font></font></strong> <code>radioName</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">项目</font><font style="vertical-align: inherit;">的值</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: To get the value of the selected radio that uses a class:
es: Para obtener el valor de la radio seleccionada que utiliza una clase:
ja: クラスを使用している選択されたラジオの値を取得します。
ko: 클래스를 사용하는 선택된 라디오의 값을 얻으려면 :
ru: Получить значение выбранного радио,использующего класс:
zh_cn: 为了获得使用类的选择的收音机的值。

source: To retrieve all radio buttons values in JavaScript array use following jQuery code :
es: Para recuperar todos los valores de los botones de radio en la matriz de JavaScript utilice el siguiente código de jQuery :
ja: JavaScriptの配列ですべてのラジオボタンの値を取得するには、次のjQueryコードを使用します。
ko: JavaScript 배열에서 모든 라디오 버튼 값을 검색하려면 다음 jQuery 코드를 사용하십시오.
ru: Для получения всех значений радиокнопок в массиве JavaScript используйте следующий код jQuery :
zh_cn: 要检索所有单选按钮的值,在JavaScript数组中使用以下jQuery代码。

source: Use the <code>filter()</code> function, not <code>find()</code>. (<code>find()</code> is for locating child/descendant elements, whereas <code>filter()</code> searches top-level elements in your selection.)
es: Use la funci&oacute;n <code>filter()</code> , no <code>find()</code> . ( <code>find()</code> es para ubicar elementos secundarios / descendientes, mientras que <code>filter()</code> busca elementos de nivel superior en su selecci&oacute;n).
ja: <code>find()</code> ではなく、 <code>filter()</code> 関数を使用します 。 （ <code>find()</code> は子/子孫要素の検索用ですが、 <code>filter()</code> は選択範囲の最上位要素を検索します。）
ko: <code>find()</code> 아닌 <code>filter()</code> 함수를 사용하십시오. <code>find()</code> 는 하위 / 하위 요소를 찾기위한 것이며 <code>filter()</code> 는 선택한 최상위 요소를 검색합니다.)
ru: Используйте функцию <code>filter()</code> , а не <code>find()</code> . ( <code>find()</code> предназначена для поиска дочерних / дочерних элементов, тогда как <code>filter()</code> ищет элементы верхнего уровня в вашем выделении.)
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>filter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数，而不是</font></font> <code>find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">（</font></font> <code>find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于定位子元素/后代元素，而</font></font> <code>filter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">搜索所选内容中的顶级元素。）</font></font>

source: Use this..
es: Usa esto...
ja: これを使って...
ko: 이것을 사용하십시오 ..
ru: Используй это...
zh_cn: 用这个.....

source: Use this:
es: Usa esto:
ja: これを使って
ko: 이것을 사용하십시오 :
ru: Используй это:
zh_cn: 用这个。

source: Using a form called myForm:
es: Usando un formulario llamado myForm:
ja: myFormというフォームを使って
ko: myForm이라는 양식을 사용하십시오.
ru: Используя форму под названием MyForm:
zh_cn: 使用一个名为myForm的表格。

source: What I needed to do was simplify C# code, that is do as much as possible in the front end JavaScript. I'm using a fieldset container because I'm working in DNN and it has its own form. So I can't add a form.
es: Lo que necesitaba hacer era simplificar el código C#,es decir,hacer todo lo posible en el front end JavaScript.Estoy usando un contenedor de fieldset porque estoy trabajando en DNN y tiene su propia forma.Así que no puedo añadir un formulario.
ja: 私が必要としていたのは、C#のコードをシンプルにすることでした。私はDNNで作業しているので、フィールドセットコンテナを使用していますが、それは独自のフォームを持っています。だから私はフォームを追加することはできません。
ko: 내가해야했던 일은 C # 코드를 단순화하는 것이 었습니다. 프론트 엔드 JavaScript에서 가능한 많은 작업을 수행했습니다. DNN에서 작업하고 자체 양식을 가지고 있기 때문에 fieldset 컨테이너를 사용하고 있습니다. 양식을 추가 할 수 없습니다.
ru: Что мне нужно было сделать,так это упростить код на C#,то есть сделать как можно больше в передней части JavaScript.Я использую контейнер fieldset,потому что я работаю в DNN и у него есть своя форма.Так что я не могу добавить форму.
zh_cn: 我需要做的是简化C#代码,也就是在前端的JavaScript中尽可能多的做一些事情。我使用的是一个字段集容器,因为我在DNN中工作,它有自己的表单。所以我不能添加一个表单。

source: You can use the :checked selector along with the radio selector.
es: Puedes usar el selector :marcado junto con el selector de radio.
ja: ラジオセレクタと一緒に :checked セレクタを使うことができます。
ko: 라디오 선택기와 함께 : checked 선택기를 사용할 수 있습니다.
ru: Вы можете использовать :отмеченный селектор вместе с селектором радио.
zh_cn: 您可以使用:检查选择器和单选器一起使用。

source: You can visit this jsFiddle to try it in action, and see how it works.
es: Puedes visitar este jsFiddle para probarlo en acción,y ver cómo funciona.
ja: こちらのjsFiddleにアクセスして実際に試してみて、どのように動作するのかを確認することができます。
ko: 이 jsFiddle을 방문하여 실제로 사용 해보고 작동 방식을 확인할 수 있습니다.
ru: Вы можете посетить эту jsFiddle,чтобы попробовать ее в действии,и посмотреть,как она работает.
zh_cn: 你可以访问这个jsFiddle来试一试,看看效果如何。

source: try it-
es: Inténtalo...
ja: やってみる
ko: 시도 해봐-
ru: попробовать...
zh_cn: 试一试

source: where selectOneRadio ID is <strong>radiobutton_id</strong> and form ID is <strong>form_id</strong>.
es: donde selectOneRadio ID es <strong>radiobutton_id</strong> y form ID es <strong>form_id</strong> .
ja: ここで、selectOneRadio IDはradiobutton_idであり、フォームIDは<strong>form_id</strong>です。
ko: 여기서 selectOneRadio ID는 <strong>radiobutton_id</strong> 이고 양식 ID는 <strong>form_id</strong> 입니다.
ru: где selectOneRadio ID - <strong>radiobutton_id,</strong> а идентификатор формы - <strong>form_id</strong> .
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其中selectOneRadio ID为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">radiobutton_id，</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而表单ID为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">form_id</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: will give you:
es: te dará:
ja: が与えてくれます。
ko: 당신에게 줄 것이다 :
ru: даст тебе:
zh_cn: 会给你。
