Repository: rueisnom/feedback
Catalog: xlf/59/63/51/596351.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <em>Notes:</em> This answer was originally correcting another answer that recommended using <code>find()</code>, which seems to have since been changed. <code>find()</code> could still be useful for the situation where you already had a reference to a container element, but not to the radio buttons, e.g.:
es: <em>Notas:</em> Esta respuesta originalmente corrigi&oacute; otra respuesta que recomendaba usar <code>find()</code> , que parece haber cambiado desde entonces. <code>find()</code> a&uacute;n podr&iacute;a ser &uacute;til para la situaci&oacute;n en la que ya ten&iacute;a una referencia a un elemento contenedor, pero no a los botones de opci&oacute;n, por ejemplo:
ja: <em>注：</em>この回答は元々、 <code>find()</code> の使用を推奨する別の回答を修正していたため、変更されているようです。 <code>find()</code> は、コンテナ要素への参照がすでにあるが、ラジオボタンへの参照がなかった場合に役立つ場合があります。例：
ko: <em>참고 :</em> 이 답변은 원래 <code>find()</code> 사용을 권장하는 다른 답변을 수정 한 것으로 변경되었습니다. <code>find()</code> 는 컨테이너 요소에 대한 참조가 있지만 라디오 버튼에 대한 참조는 이미없는 상황에서 여전히 유용 할 수 있습니다.
ru: <em>Примечания:</em> Этот ответ изначально исправлял другой ответ, который рекомендовал использовать <code>find()</code> , который, похоже, с тех пор был изменен. <code>find()</code> все еще может быть полезен для ситуации, когда у вас уже есть ссылка на элемент контейнера, но не на переключатели, например:
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该答案最初是在纠正使用</font></font> <code>find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">建议的另一个答案，此答案</font><font style="vertical-align: inherit;">似乎已被更改。</font><font style="vertical-align: inherit;">对于已经引用了容器元素而不是单选按钮的情况，</font></font> <code>find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仍然很有用，例如：</font></font>

source: <strong>API for <code>:checked Selector</code></strong>
es: <strong>API para <code>:checked Selector</code> </strong>
ja: <strong> <code>:checked Selector</code> の API</strong>
ko: <strong> <code>:checked Selector</code> 기용 API</strong>
ru: <strong>API для <code>:checked Selector</code> </strong>
zh_cn: <strong><font style="vertical-align: inherit;"> <code>:checked Selector</code> <font style="vertical-align: inherit;"> API</font></font><font style="vertical-align: inherit;"></font></strong>

source: <strong>DEMO</strong> : <a href="https://jsfiddle.net/ipsjolly/xygr065w/">https://jsfiddle.net/ipsjolly/xygr065w/</a>
ja: <strong>デモ</strong> ： <a href="https://jsfiddle.net/ipsjolly/xygr065w/">https</a> : //jsfiddle.net/ipsjolly/xygr065w/
ko: <strong>데모</strong> : <a href="https://jsfiddle.net/ipsjolly/xygr065w/">https://jsfiddle.net/ipsjolly/xygr065w/</a>
ru: <strong>ДЕМО</strong> : <a href="https://jsfiddle.net/ipsjolly/xygr065w/">https://jsfiddle.net/ipsjolly/xygr065w/</a>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font><a href="https://jsfiddle.net/ipsjolly/xygr065w/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/ipsjolly/xygr065w/</font></font>

source: <strong>Working Demo</strong>
es: <strong>Demo de trabajo</strong>
ja: <strong>作業デモ</strong>
ko: <strong>실무 데모</strong>
ru: <strong>Рабочая Демо</strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">工作示范</font></font></strong>

source: Also, check if the user does not select anything.
es: Además,comprueba si el usuario no selecciona nada.
ja: また、ユーザーが何も選択していないかどうかも確認してください。
ko: 또한 사용자가 아무것도 선택하지 않았는지 확인하십시오.
ru: Также проверьте,не выбрал ли пользователь что-нибудь.
zh_cn: 同时,检查用户是否没有选择任何东西。

source: And my JavaScript is:
es: Y mi JavaScript es:
ja: そして、私のJavaScriptは
ko: 그리고 내 JavaScript는 다음과 같습니다
ru: И мой JavaScript:
zh_cn: 而我的JavaScript是。

source: Another option is:
es: Otra opción es:
ja: もう一つの選択肢は
ko: 다른 옵션은 다음과 같습니다.
ru: Другой вариант:
zh_cn: 另一个选择是:

source: Another way to get it:
es: Otra forma de conseguirlo:
ja: 別の方法で手に入れることができます。
ko: 그것을 얻는 또 다른 방법 :
ru: Другой способ достать его:
zh_cn: 另一种方式是获得它。

source: Be sure to use <strong>name</strong> instead <strong>id</strong>, as indicated, because jQuery uses this attribute (<strong>name</strong> is generated automatically by JSF resembling control ID).
es: Aseg&uacute;rese de usar <strong>name en</strong> lugar de <strong>id</strong> , como se indica, porque jQuery usa este atributo (JSF genera autom&aacute;ticamente el <strong>nombre que</strong> se parece al ID de control).
ja: jQueryはこの属性を使用するため、示されているように、 <strong>id</strong>ではなく<strong>nameを</strong>必ず使用してください（ <strong>名前</strong>は、JSFに似たコントロールIDによって自動的に生成されます）。
ko: jQuery가이 속성을 사용하기 때문에 표시된대로 <strong>id</strong> 대신 <strong>name</strong> 을 사용해야합니다 ( <strong>이름</strong> 은 제어 ID와 유사한 JSF에 의해 자동으로 생성됨).
ru: Обязательно используйте <strong>имя</strong> вместо <strong>id</strong> , как указано, потому что jQuery использует этот атрибут ( <strong>имя</strong> генерируется автоматически с помощью JSF, напоминающего идентификатор элемента управления).
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如图所示，</font><font style="vertical-align: inherit;">请确保使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名称</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">id</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因为jQuery使用此属性（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名称</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由类似于控件ID的JSF自动生成）。</font></font>

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Filter to get the one thats checked
es: Filtro para obtener el que se comprueba
ja: チェックされたものを取得するためのフィルタ
ko: 확인한 것을 얻기위한 필터
ru: Фильтр для проверки
zh_cn: 筛选出被选中的那一个

source: From <a href="https://stackoverflow.com/q/34815656/1541563">this question</a>, I came up with an alternate way to access the currently selected <code>input</code> when you're within a <code>click</code> event for its respective label. The reason why is because the newly selected <code>input</code> isn't updated until after its <code>label</code>'s click event.
es: A partir de <a href="https://stackoverflow.com/q/34815656/1541563">esta pregunta</a> , se me ocurri&oacute; una forma alternativa de acceder a la <code>input</code> seleccionada actualmente cuando est&aacute; dentro de un evento de <code>click</code> para su etiqueta respectiva. La raz&oacute;n es porque la <code>input</code> reci&eacute;n seleccionada no se actualiza hasta despu&eacute;s del evento de clic de la <code>label</code> .
ja: <a href="https://stackoverflow.com/q/34815656/1541563">この質問</a>から、それぞれのラベルの <code>click</code> イベント内にいるときに、現在選択されている <code>input</code> にアクセスする別の方法を考え出しました。 その理由は、新しく選択された <code>input</code> は、その <code>label</code> のクリックイベントの後まで更新されないためです。
ko: <a href="https://stackoverflow.com/q/34815656/1541563">이 질문에서</a> , 당신은 각각의 레이블에 대한 <code>click</code> 이벤트 내에있을 때 현재 선택된 <code>input</code> 에 액세스하는 다른 방법을 생각해 냈습니다. 그 이유는 새로 선택한 <code>input</code> 이 해당 <code>label</code> 의 클릭 이벤트가 끝날 때까지 업데이트되지 않기 때문입니다.
ru: Из <a href="https://stackoverflow.com/q/34815656/1541563">этого вопроса</a> я придумал альтернативный способ доступа к текущему выбранному <code>input</code> когда вы находитесь в пределах события <code>click</code> для соответствующей метки. Причина в том, что вновь выбранный <code>input</code> не обновляется до тех пор, пока не будет щелкнуто событие <code>label</code> .
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="https://stackoverflow.com/q/34815656/1541563"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">当您处于</font><font style="vertical-align: inherit;">相应标签</font><font style="vertical-align: inherit;">的</font> <code>click</code> <font style="vertical-align: inherit;">事件中</font><font style="vertical-align: inherit;">时</font><font style="vertical-align: inherit;">，我想出了另一种方法来访问当前选定的</font></font> <code>input</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">原因是因为新选择的</font> <code>input</code> <font style="vertical-align: inherit;">要等到其</font> <code>label</code> <font style="vertical-align: inherit;">的click事件</font><font style="vertical-align: inherit;">之后才更新</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Get all radios:
es: Consigue todas las radios:
ja: 全ての無線機を手に入れろ
ko: 모든 라디오를 받으십시오 :
ru: Достаньте все рации:
zh_cn: 获取所有的收音机。

source: Get the value from the form:
es: Obtener el valor del formulario:
ja: フォームから値を取得します。
ko: 양식에서 값을 얻으십시오.
ru: Получите значение из формы:
zh_cn: 从表格中获取值。

source: Having a class name on the input allows me to easily style the inputs...
es: Tener un nombre de clase en la entrada me permite estilizar fácilmente las entradas...
ja: 入力にクラス名をつけることで、入力のスタイルを簡単に設定できるようになりました。
ko: 입력에 클래스 이름이 있으면 입력의 스타일을 쉽게 지정할 수 있습니다.
ru: Наличие имени класса на входе позволяет легко стилизовать входы....
zh_cn: 在输入端有一个类名,可以让我轻松地对输入端进行样式化.....

source: Here's an example:
es: Aquí hay un ejemplo:
ja: 一例を挙げてみます。
ko: 예를 들면 다음과 같습니다.
ru: Вот пример:
zh_cn: 这里有一个例子。

source: Here's how I would write the form and handle the getting of the checked radio.
es: Así es como yo escribiría el formulario y me encargaría de conseguir el cheque de la radio.
ja: ここでは、私がどのようにフォームを書いて、チェックされたラジオの取得を処理するかを説明します。
ko: 다음은 양식을 작성하고 확인 된 라디오 수신을 처리하는 방법입니다.
ru: Вот как я бы написал форму и разобрался с получением проверенного радио.
zh_cn: 以下是我如何写好表格,并处理好了检查电台的获取。

source: How can I know which radio button is selected via jQuery
es: ¿Cómo puedo saber qué botón de radio se selecciona a través de jQuery
ja: jQueryでどのラジオボタンが選択されているかを知るにはどうすればいいですか?
ko: jQuery를 통해 선택된 단일 선택 단추를 어떻게 알 수 있습니까
ru: Как узнать,какая кнопка выбрана с помощью jQuery?
zh_cn: 我怎么知道哪个单选按钮是通过jQuery选择的?

source: How do I know which one is selected?
es: ¿Cómo sé cuál es el seleccionado?
ja: どれが選ばれているかを知るにはどうすればいいのでしょうか?
ko: 어느 것이 선택되었는지 어떻게 알 수 있습니까?
ru: Как узнать,какой из них выбран?
zh_cn: 我怎么知道哪一个被选中了?

source: I can get all of them like this:
es: Puedo conseguirlos todos así:
ja: こんな感じで全部手に入ります。
ko: 나는 이것들 모두를 얻을 수 있습니다 :
ru: Я могу получить их всех вот так:
zh_cn: 我可以把它们都弄成这样。

source: I had to look a bit for this and then tinker with it to get it to work. So for other DNNers, hopefully this is easy to find.
es: Tuve que buscar un poco para esto y luego retocarlo para que funcionara.Así que para otros DNNers,espero que esto sea fácil de encontrar.
ja: 私はこれを探すために少し探して、それが動作するようにするためにそれをいじっていました。だから、他のDNNの人にとっては、これが簡単に見つかることを願っています。
ko: 나는 이것을 조금 보았고 그것을 작동시키기 위해 그것을 땜질했다. 따라서 다른 DNN 사용자에게는 이것이 쉽게 찾을 수 있기를 바랍니다.
ru: Пришлось немного поискать,а потом подправить,чтобы заставить его работать.Так что для других DNNers,надеюсь,это легко найти.
zh_cn: 这一点我找了一下,然后又修修补补了一下,才有了效果。所以对于其他DNN的玩家来说,希望这个很容易找到。

source: I have two radio buttons and want to post the value of the selected one. How can I get the value with jQuery?
es: Tengo dos botones de radio y quiero publicar el valor del seleccionado.¿Cómo puedo obtener el valor con jQuery?
ja: ラジオボタンを2つ持っていて、選択した方の値を投稿したいです。jQueryで値を取得する方法を教えてください。
ko: 두 개의 라디오 버튼이 있으며 선택한 버튼의 값을 게시하고 싶습니다. jQuery로 가치를 얻으려면 어떻게해야합니까?
ru: У меня есть две радиокнопки и я хочу опубликовать значение выбранной.Как я могу получить значение с помощью jQuery?
zh_cn: 我有两个单选按钮,想发布所选按钮的值。如何用jQuery获取值?

source: I need to test which text box out of 3 is being used and if it is, what's the type of search? Starts with the value, Contains the value, Exact Match of the value.
es: Necesito probar cuál de los tres cuadros de texto se está usando y si es así,¿cuál es el tipo de búsqueda? Comienza con el valor,Contiene el valor,Coincidencia exacta del valor.
ja: 私は3つのうちどのテキストボックスが使用されているかをテストする必要があり、それがある場合は、検索の種類は何ですか?値で始まる、値を含む、値の完全一致。
ko: 3 중 어떤 텍스트 상자가 사용되고 있는지 테스트해야하며, 사용중인 경우 검색 유형은 무엇입니까? 값으로 시작하고 값을 포함하며 값의 정확한 일치 값을 갖습니다.
ru: Мне нужно проверить,какое текстовое поле из 3 используется,и если да,то какой тип поиска? Начинается со значения,Содержит значение,Точное совпадение значения.
zh_cn: 我需要测试3个文本框中的哪一个文本框,如果是,请问搜索的类型是什么?从值开始,包含值,值的精确匹配。

source: I use this simple script
es: Utilizo este simple guión
ja: 私はこのシンプルなスクリプトを使用しています。
ko: 이 간단한 스크립트를 사용합니다
ru: Я использую этот простой сценарий
zh_cn: 我用的是这个简单的脚本

source: I wrote a jQuery plugin for setting and getting radio-button values. It also respects the "change" event on them.
es: Escribí un plugin jQuery para configurar y obtener los valores de los botones de radio.También respeta el evento de "cambio" en ellos.
ja: ラジオボタンの値を設定したり取得したりするためのjQueryプラグインを書いてみました。このプラグインは、ラジオボタンの "change "イベントにも対応しています。
ko: 라디오 버튼 값을 설정하고 얻는 jQuery 플러그인을 작성했습니다. 또한 "변경"이벤트도 존중합니다.
ru: Я написал плагин jQuery для установки и получения значений радиокнопок.Он также уважает событие "изменения" на них.
zh_cn: 我写了一个jQuery插件来设置和获取单选按钮的值。它还尊重它们的 "改变 "事件。

source: I've released a library to help with this. Pulls all possible input values, actually, but also includes which radio button was checked. You can check it out at <a href="https://github.com/mazondo/formalizedata">https://github.com/mazondo/formalizedata</a>
es: He lanzado una biblioteca para ayudar con esto. Extrae todos los valores de entrada posibles, en realidad, pero tambi&eacute;n incluye qu&eacute; bot&oacute;n de radio se verific&oacute;. Puede consultarlo en <a href="https://github.com/mazondo/formalizedata">https://github.com/mazondo/formalizedata</a>
ja: これを支援するライブラリをリリースしました。 実際にはすべての可能な入力値を取得しますが、チェックされたラジオボタンも含まれます。 <a href="https://github.com/mazondo/formalizedata">https://github.com/mazondo/formalizedataで</a>確認できます。
ko: 이를 돕기 위해 라이브러리를 출시했습니다. 가능한 모든 입력 값을 가져 오지만 실제로 확인 된 라디오 버튼도 포함합니다. <a href="https://github.com/mazondo/formalizedata">https://github.com/mazondo/formalizedata</a> 에서 확인할 수 있습니다
ru: Я выпустил библиотеку, чтобы помочь с этим. На самом деле извлекает все возможные входные значения, но также включает переключатель, который был отмечен. Вы можете проверить это на <a href="https://github.com/mazondo/formalizedata">https://github.com/mazondo/formalizedata</a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我已经发布了一个库来帮助解决这个问题。</font><font style="vertical-align: inherit;">实际上提取所有可能的输入值，但还包括选中了哪个单选按钮。</font><font style="vertical-align: inherit;">您可以在</font><a href="https://github.com/mazondo/formalizedata"><font style="vertical-align: inherit;">https://github.com/mazondo/formalizedata上</font></a><font style="vertical-align: inherit;">查看</font></font><font style="vertical-align: inherit;"></font>

source: If you already have a reference to a radio button group, for example:
es: Si ya tiene una referencia a un grupo de botones de radio,por ejemplo:
ja: すでにラジオボタングループへの参照がある場合、例えば
ko: 라디오 버튼 그룹에 대한 참조가 이미있는 경우 예를 들면 다음과 같습니다.
ru: Если у вас уже есть ссылка,например,на группу радиокнопок:
zh_cn: 如果你已经有一个单选按钮组的引用,比如说。

source: If you have Multiple radio buttons in single form then
es: Si tienes varios botones de radio en una sola forma entonces
ja: 単一のフォームで複数のラジオボタンを持っている場合は
ko: 단일 형태의 다중 라디오 버튼이있는 경우
ru: Если у вас есть несколько радиокнопок в одной форме,то
zh_cn: 如果你有多个单选按钮在一个表单中,那么

source: If you only have 1 set of radio buttons on 1 form, the jQuery code is as simple as this:
es: Si sólo tienes un juego de botones de radio en un formulario,el código de jQuery es tan simple como esto:
ja: 1つのフォームに1セットのラジオボタンしかない場合、jQueryのコードはこのように簡単です。
ko: 하나의 폼에 하나의 라디오 버튼 세트 만있는 경우 jQuery 코드는 다음과 같이 간단합니다.
ru: Если у вас только 1 набор радио кнопок на 1 форме,код jQuery так же прост:
zh_cn: 如果你在一个表单上只有1个单选按钮,那么jQuery代码就是这么简单。

source: If you want just the boolean value, i.e. if it's checked or not try this:
es: Si quieres sólo el valor booleano,es decir,si está marcado o no,prueba esto:
ja: ブール値だけを表示したい場合、つまりチェックされているかどうかを表示したい場合は、次のようにしてみてください。
ko: 부울 값만 원하는 경우, 예를 들어 확인하거나 시도하지 않은 경우 :
ru: Если вам нужно только булевое значение,т.е.если оно проверено или нет,попробуйте это:
zh_cn: 如果你只想要布尔值,即是否被选中,可以试试这个。

source: If you're not posting the form, I would simplify it further by using:
es: Si no está publicando el formulario,lo simplificaría aún más usando:
ja: フォームを投稿していないのであれば、さらにシンプルにするために
ko: 양식을 게시하지 않는 경우 다음을 사용하여 양식을 더 단순화합니다.
ru: Если вы не размещаете форму,я бы упростил ее использование:
zh_cn: 如果你不贴表格,我会通过使用,进一步简化它。

source: In a <strong>JSF</strong> generated radio button (using <code>&lt;h:selectOneRadio&gt;</code> tag), you can do this:
es: En un bot&oacute;n de radio generado por <strong>JSF</strong> (usando la etiqueta <code>&lt;h:selectOneRadio&gt;</code> ), puede hacer esto:
ja: <strong>JSFで</strong>生成されたラジオボタン（ <code>&lt;h:selectOneRadio&gt;</code> タグを使用）では、次の操作を実行できます。
ko: <strong>JSF</strong> 생성 라디오 버튼 ( <code>&lt;h:selectOneRadio&gt;</code> 태그 사용)에서 다음을 수행 할 수 있습니다.
ru: В сгенерированном <strong>JSF-</strong> переключателе (используя <code>&lt;h:selectOneRadio&gt;</code> ) вы можете сделать это:
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">生成的单选按钮（使用</font></font> <code>&lt;h:selectOneRadio&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标记）中，您可以执行以下操作：</font></font>

source: In my case I have two radio buttons in one form and I wanted to know the status of each button. This below worked for me:
es: En mi caso tengo dos botones de radio en un formulario y quería saber el estado de cada botón.Esto de abajo me funcionó:
ja: 私の場合、1つのフォームに2つのラジオボタンがあり、それぞれのボタンの状態を知りたいと思いました。これは私のために働いてくれました。
ko: 필자의 경우 하나의 양식에 두 개의 라디오 버튼이 있으며 각 버튼의 상태를 알고 싶었습니다. 이것은 아래에서 나를 위해 일했습니다 :
ru: В моем случае у меня есть две радио-кнопки в одной форме,и я хотел бы знать состояние каждой из них.Это ниже сработало для меня:
zh_cn: 在我的例子中,我有两个单选按钮,我想知道每个按钮的状态。下面这个方法对我来说是有效的。

source: It'll give you a js object of the answers, so a form like:
es: Te dará un objeto JS de las respuestas,así que una forma como:
ja: これは答えのjsオブジェクトを与えてくれるので、次のような形になります。
ko: 그것은 당신에게 답변의 js 객체를 줄 것입니다.
ru: Это даст вам объект js ответов,так что форма как:
zh_cn: 它会给你一个js对象的答案,所以像这样的形式。

source: JQuery to get all the radio buttons in the form and the checked value.
es: JQuery para obtener todos los botones de radio en la forma y el valor comprobado.
ja: フォーム内のすべてのラジオボタンとチェックされた値を取得するJQuery。
ko: JQuery는 양식의 모든 라디오 버튼과 선택된 값을 가져옵니다.
ru: JQuery,чтобы получить все радио-кнопки в форме и установленное значение.
zh_cn: 用JQuery获取表单中所有单选按钮和选中的值。

source: Just saying any containing tag with an ID can be used. For DNNers, this is good to know. The end goal here is pass to the mid-level code what is needed to start a parts search in SQL Server.
es: Sólo digo que se puede usar cualquier etiqueta de contenido con una identificación.Para los DNNers,es bueno saberlo.El objetivo final aquí es pasar al código de nivel medio lo que se necesita para iniciar una búsqueda de partes en el servidor SQL.
ja: IDを含むタグがあれば何でもいいというだけのことです。DNNの人にとっては、これは知っておいて損はないでしょう。ここでの最終的な目標は、SQL Serverで部品検索を開始するために必要なものを中間レベルのコードに渡すことです。
ko: ID가있는 포함 태그를 사용하면됩니다. DNN 사용자에게는이 점을 잘 알고 있습니다. 여기서 최종 목표는 SQL Server에서 부품 검색을 시작하는 데 필요한 중간 수준 코드로 전달하는 것입니다.
ru: Просто говорю,что можно использовать любой содержащий тег с идентификатором.Для DNNers это полезно знать.Конечной целью здесь является переход к коду среднего уровня,который необходим для начала поиска деталей в SQL Server.
zh_cn: 只是说凡是有ID的包含标签都可以使用。对于DNNer来说,这一点很好理解。这里的最终目标是传递给中层代码,在SQL Server中启动零件搜索所需要的东西。

source: Note the "" usaged around the input:checked and not '' like the Peter J's solution
es: Note el "" usado alrededor de la entrada:comprobado y no el "" como la solución de Peter J.
ja: input:checked の周りに "" が使われていて、ピーターJの解決策のように '' が使われていないことに注意してください。
ko: Peter J의 솔루션처럼 ''가 아닌 입력 주위에 ""를 사용하십시오.
ru: Обратите внимание на "",используемый вокруг input:check,а не '',как в решении Peter J.
zh_cn: 请注意""在 input:check 的周围使用"",而不是像 Peter J 的解决方案那样的 ''

source: Put the code anywhere to enable the addin. Then enjoy! It just overrides the default val function without breaking anything.
es: Ponga el código en cualquier lugar para activar el complemento.¡Entonces disfruta! Sólo anula la función val por defecto sin romper nada.
ja: アドインを有効にするためにコードをどこかに入れてください。それからお楽しみください。これはデフォルトのval関数を何も壊さずに上書きするだけです。
ko: 추가 기능을 사용하려면 코드를 아무 곳에 나 두십시오. 그럼 즐기세요! 아무것도 깨지 않고 기본 val 함수를 무시합니다.
ru: Положите код куда угодно,чтобы включить аддин.Тогда наслаждайтесь! Он просто переопределяет функцию val по умолчанию,ничего не нарушая.
zh_cn: 将代码放在任何地方,以启用addin。那就好好享受吧! 它只是覆盖了默认的val函数,不会破坏任何东西。

source: Show code snippet
es: Mostrar fragmento de código
ja: コードスニペットを表示
ko: 코드 스 니펫 표시
ru: Показать фрагмент кода
zh_cn: 显示代码片段

source: The <code>:checked</code> selector works for <code>checkboxes</code>, <code>radio buttons</code>, and select elements. For select elements only, use the <code>:selected</code> selector.
es: El <code>:checked</code> selector seleccionado funciona para <code>checkboxes</code> de verificaci&oacute;n , <code>radio buttons</code> opci&oacute;n y elementos seleccionados. Solo para elementos seleccionados, use el selector <code>:selected</code> .
ja: <code>:checked</code> セレクターは、 <code>checkboxes</code> 、 <code>radio buttons</code> 、選択要素に対して機能します 。 選択要素の場合のみ、 <code>:selected</code> セレクターを使用します 。
ko: <code>:checked</code> 선택기는 <code>checkboxes</code> , <code>radio buttons</code> 및 선택 요소에 작동합니다. 선택 요소의 경우에만 <code>:selected</code> 선택기를 사용하십시오.
ru: Селектор <code>:checked</code> работает для <code>checkboxes</code> , <code>radio buttons</code> и элементов выбора. Только для элементов select, используйте селектор <code>:selected</code> .
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>:checked</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择适用于</font></font> <code>checkboxes</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>radio buttons</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后选择元素。</font><font style="vertical-align: inherit;">仅对于选择元素，使用</font></font> <code>:selected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择器。</font></font>

source: Then getting the checked value becomes:
es: Entonces obtener el valor comprobado se convierte en:
ja: そうすると、チェックされた値を得ることができるようになります。
ko: 그런 다음 확인 된 값을 얻는 것은 다음과 같습니다.
ru: Тогда получение проверенного значения становится:
zh_cn: 那么得到的检查值就变成了。
