Repository: rueisnom/feedback
Catalog: xlf/18/22/87/182287.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To understand <em>why</em> binding a table (or column) name doesn't work, you have to understand how the placeholders in prepared statements work: they are not simply substituted in as (suitably escaped) strings, and the resulting SQL executed. Instead, a DBMS asked to "prepare" a statement comes up with a complete query plan for how it would execute that query, including which tables and indexes it would use, which will be the same regardless of how you fill in the placeholders.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para comprender </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">por qu&eacute; el</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> enlace de un nombre de tabla (o columna) no funciona, debe comprender c&oacute;mo funcionan los marcadores de posici&oacute;n en las declaraciones preparadas: no se sustituyen simplemente en cadenas (escaneadas adecuadamente) y se ejecuta el SQL resultante. En cambio, un DBMS al que se le pidi&oacute; que "preparara" una declaraci&oacute;n presenta un plan de consulta completo sobre c&oacute;mo ejecutar&iacute;a esa consulta, incluidas las tablas e &iacute;ndices que usar&iacute;a, que ser&aacute;n las mismas independientemente de c&oacute;mo complete los marcadores de posici&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">理解するために</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、なぜ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表（または列）を結合名前が仕事をしない、あなたは準備された文の仕事にどのようにプレースホルダを理解する必要があります：彼らは単に（適切にエスケープ）文字列としてで置換されていない、そして得られたSQLを実行します。代わりに、ステートメントを「準備する」ように要求されたDBMSは、どのテーブルとインデックスを使用するかなど、そのクエリの実行方法に関する完全なクエリプランを作成します。これは、プレースホルダーの入力方法に関係なく同じです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테이블 (또는 열) 이름 바인딩이 작동하지 않는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이유</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 이해하려면 </font><font style="vertical-align: inherit;">준비된 명령문의 플레이스 홀더가 작동하는 방식을 이해해야합니다. 즉, 적절하게 이스케이프 된 문자열로 대체되지 않고 결과 SQL이 실행됩니다. 대신, 문을 "준비"하도록 요청한 DBMS는 사용하는 테이블과 인덱스를 포함하여 해당 쿼리를 실행하는 방법에 대한 완전한 쿼리 계획을 제시하며, 이는 자리 표시자를 채우는 방법에 관계없이 동일합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы понять, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">почему не работает</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> привязка имени таблицы (или столбца), вы должны понять, как работают заполнители в подготовленных выражениях: они не просто подставляются в виде (соответствующим образом экранированных) строк, а полученный SQL выполняется. Вместо этого СУБД с просьбой &laquo;подготовить&raquo; оператор предлагает полный план запроса о том, как он будет выполнять этот запрос, включая таблицы и индексы, которые он будет использовать, которые будут одинаковыми независимо от того, как вы заполните заполнители.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要了解</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为什么</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">绑定表（或列）名称不起作用的原因，您必须了解已准备好的语句中的占位符如何工作：不能简单地将它们替换为（适当地转义的）字符串，并执行生成的SQL。取而代之的是，要求&ldquo;准​​备&rdquo;一个语句的DBMS给出了一个完整的查询计划，以说明如何执行该查询，包括它将使用哪些表和索引，无论您如何填充占位符，都将是相同的。</font></font>

source: Using the former isn't inherently more safe than the latter, you need to sanitize the input whether it's part of a parameter array or a simple variable. So I don't see anything wrong with using the latter form with <code>$table</code>, provided you make sure that the content of <code>$table</code> is safe (alphanum plus underscores?) before using it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usar el primero no es inherentemente m&aacute;s seguro que el segundo, debe desinfectar la entrada ya sea parte de una matriz de par&aacute;metros o una variable simple. </font><font style="vertical-align: inherit;">Por lo tanto, no veo nada de malo en usar el &uacute;ltimo formulario con </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , siempre que se asegure de que el contenido de </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sea ​​seguro (&iquest;alfanum m&aacute;s guiones bajos?) Antes de usarlo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前者を使用することは、後者より本質的に安全ではないため、パラメーター配列の一部であっても、単純な変数であっても、入力を無害化する必要があります。</font><font style="vertical-align: inherit;">したがって、</font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">後者のフォームを使用しても問題はありません</font><font style="vertical-align: inherit;">。使用する前に</font><font style="vertical-align: inherit;">、</font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のコンテンツ</font><font style="vertical-align: inherit;">が安全</font><font style="vertical-align: inherit;">であることを確認してください</font><font style="vertical-align: inherit;">（alphanumとアンダースコア）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전자를 사용하는 것이 전자를 사용하는 것보다 본질적으로 안전하지는 않으므로 입력이 매개 변수 배열이든 간단한 변수이든 상관없이 입력을 삭제해야합니다. </font><font style="vertical-align: inherit;">내가 함께 후자의 양식을 사용하여 아무것도 잘못 표시되지 않습니다 그래서 </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 당신의 내용에 있는지 확인 제공 </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 안전합니다 (영숫자 플러스 밑줄?)를 사용하기 전에.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование первого по своей природе не является более безопасным, чем второе, вам необходимо очистить входные данные, независимо от того, является ли это частью массива параметров или простой переменной. </font><font style="vertical-align: inherit;">Так что я не вижу ничего плохого в использовании последней формы с </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , при условии, что вы убедитесь, что содержимое </font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> безопасно (alphanum plus подчеркивания?) Перед его использованием.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用前者并不比后者本质上更安全，您需要清理输入（无论它是参数数组的一部分还是简单变量的一部分）。</font><font style="vertical-align: inherit;">因此，使用</font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用后一种形式不会出现任何问题</font><font style="vertical-align: inherit;">，前提是您在</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">$ table之前</font><font style="vertical-align: inherit;">确保</font></font> <code>$table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的内容</font><font style="vertical-align: inherit;">是安全的（字母加下划线？）。</font></font>

source: Why can't I pass the table name to a prepared PDO statement?
es: ¿Por qué no puedo pasar el nombre de la mesa a una declaración preparada de la DOP?
ja: 用意されたPDO文にテーブル名を渡すことができないのはなぜですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테이블 이름을 준비된 PDO 문에 전달할 수없는 이유는 무엇입니까?</font></font>
ru: Почему я не могу передать название таблицы в подготовленное заявление о PDO?
zh_cn: 为什么我不能将表名传递给准备好的PDO语句?

source: You cannot use a prepared statement to bind a database.
es: No se puede utilizar una declaración preparada para vincular una base de datos.
ja: 準備されたステートメントを使用してデータベースをバインドすることはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">준비된 명령문을 사용하여 데이터베이스를 바인드 할 수 없습니다.</font></font>
ru: Вы не можете использовать подготовленное заявление для привязки базы данных.
zh_cn: 你不能使用准备好的语句来绑定数据库。

source: will not work. Use a safelist instead.
es: no funcionará.Usa una lista de seguridad en su lugar.
ja: は機能しません。代わりにセーフリストを使用してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동 안 할 것이다. </font><font style="vertical-align: inherit;">대신 수신 허용 목록을 사용하십시오.</font></font>
ru: не сработает.Вместо этого воспользуйтесь страховым листом.
zh_cn: 将无法工作。请使用安全清单代替。
