Repository: rueisnom/feedback
Catalog: xlf/18/22/87/182287.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <em>(Late answer, consult my side note).</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Respuesta tard&iacute;a, consulte mi nota al margen).</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（遅い答え、私のサイドノートを参照してください）。</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(늦은 대답, 내 쪽 참고를 참조하십시오).</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Поздний ответ, обратитесь к моей записке).</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（最新答案，请参阅我的旁注）。</font></font></em>

source: <strong>Side note:</strong> I added this answer (as a community wiki) because it often used to close questions with, where some people posted questions similar to this in trying to bind a <strong>database</strong> and not a table and/or column.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota al margen:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> agregu&eacute; esta respuesta (como wiki de la comunidad) porque a menudo sol&iacute;a cerrar preguntas, donde algunas personas publicaban preguntas similares a esta al tratar de vincular una </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">base de datos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y no una tabla y / o columna.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サイドノート：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はこの回答を（コミュニティーWikiとして）追加しました。これは、質問を閉じるためによく使用されていたため</font><font style="vertical-align: inherit;">です。テーブルや列ではなく</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">データベース</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をバインドしようとして、これに似た質問を投稿した人</font><font style="vertical-align: inherit;">もいます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 사항 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 답변은 (커뮤니티 위키로) 종종 질문을 닫는 데 사용되었으므로 일부 사람들은 </font><font style="vertical-align: inherit;">테이블 및 / 또는 열이 아닌 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 바인딩하려고 할 때 이와 비슷한 질문을 게시했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> я добавил этот ответ (как вики сообщества), потому что он часто использовался для закрытия вопросов, где некоторые люди публиковали вопросы, подобные этим, пытаясь связать </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">базу данных,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а не таблицу и / или столбец.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">旁注：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我添加了此答案（作为社区Wiki），因为它通常用于结束问题，有些人在试图绑定</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数据库</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是表和/或列时</font><font style="vertical-align: inherit;">发布了与此类似的问题</font><font style="vertical-align: inherit;">。</font></font>

source: <strong>Table and Column names CANNOT be replaced by parameters in PDO.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los nombres de tabla y columna NO PUEDEN reemplazarse por par&aacute;metros en PDO.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テーブル名と列名は、PDOのパラメーターで置き換えることはできません。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테이블 및 컬럼 이름은 PDO의 매개 변수로 대체 될 수 없습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имена таблиц и столбцов НЕ МОГУТ заменяться параметрами в PDO.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表名和列名不能用PDO中的参数替换。</font></font></strong>

source: As for the main question in this thread, the other posts made it clear why we can't bind values to column names when preparing statements, so here is one solution:
es: En cuanto a la pregunta principal de este hilo,los otros mensajes dejaron claro por qué no podemos vincular los valores a los nombres de las columnas cuando se preparan las declaraciones,así que aquí hay una solución:
ja: このスレッドの本題については、他の投稿で、ステートメントを準備する際にカラム名に値をバインドできない理由が明らかになっていますので、ここでは一つの解決策を紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 스레드의 주요 질문에 대해서는 다른 게시물에서 명령문을 준비 할 때 값을 열 이름에 바인딩 할 수없는 이유를 분명히 밝혔으므로 여기에 하나의 해결책이 있습니다.</font></font>
ru: Что касается основного вопроса в этой теме,то в других сообщениях было понятно,почему при подготовке операторов нельзя привязывать значения к названиям столбцов,так что вот одно из решений:
zh_cn: 至于这条线程中的主要问题,其他帖子已经说得很清楚了,为什么我们在准备语句时不能将值与列名绑定,这里有一个解决方案。

source: By leaving no default case or using a default case that returns an error message you ensure that only values that you want used get used.
es: Al no dejar ningún caso por defecto o utilizar un caso por defecto que devuelva un mensaje de error,se asegura de que sólo se utilicen los valores que usted desea utilizar.
ja: デフォルトケースを使用しないか、エラーメッセージを返すデフォルトケースを使用することで、使用したい値だけが使用されることを保証します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 사례를 그대로 두거나 오류 메시지를 반환하는 기본 사례를 사용하면 사용하려는 값만 사용할 수 있습니다.</font></font>
ru: Не оставляя регистр по умолчанию или используя регистр по умолчанию,который возвращает сообщение об ошибке,вы гарантируете,что будут использоваться только те значения,которые вы хотите использовать.
zh_cn: 通过不留默认情况,或者使用返回错误信息的默认情况,可以确保只有你想使用的值才会被使用。

source: Can PHP PDO Statements accept the table or column name as parameter
es: ¿Pueden las declaraciones PHP PDO aceptar el nombre de la tabla o de la columna como parámetro
ja: PHP の PDO ステートメントで、パラメータとしてテーブル名やカラム名を指定することはできますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP PDO 명령문이 테이블 또는 열 이름을 매개 변수로 승인 할 수 있습니까?</font></font>
ru: Могут ли PHP PDO-операторы принять имя таблицы или столбца в качестве параметра
zh_cn: PHP PDO语句可以接受表或列名作为参数吗?

source: I have a function that receives two parameters like...
es: Tengo una función que recibe dos parámetros como...
ja: のような2つのパラメータを受け取る関数を持っています...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 두 개의 매개 변수를받는 기능이 있습니다 ...</font></font>
ru: У меня есть функция,которая получает два параметра,например...
zh_cn: 我有一个接收两个参数的函数,比如......

source: I haven't really thought through it, but it seems like removing anything except characters and underscores might work.
es: No lo he pensado mucho,pero parece que eliminar cualquier cosa excepto los personajes y los guiones bajos podría funcionar.
ja: 考え抜いたわけではありませんが、文字とアンダースコア以外は削除しても大丈夫そうですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 그것을 실제로 생각하지 않았지만 문자와 밑줄을 제외한 것을 제거하는 것이 효과가있는 것 같습니다.</font></font>
ru: На самом деле я не думал об этом,но кажется,что удаление всего,кроме символов и подчеркиваний,может сработать.
zh_cn: 我还没有真正考虑过,但似乎除了字符和下划线之外,删除任何东西都可以。

source: I see this is an old post, but I found it useful and thought I'd share a solution similar to what @kzqai suggested:
es: Veo que es un post antiguo,pero lo encontré útil y pensé en compartir una solución similar a la que @kzqai sugirió:
ja: これは古い投稿ですが、私はそれが有用であることを見つけたので、@kzqaiが提案したものと似たような解決策を共有しようと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 오래된 게시물 인 것을 보았지만 유용하다고 생각하고 @kzqai가 제안한 것과 비슷한 해결책을 공유 할 것이라고 생각했다.</font></font>
ru: Вижу,что это старая заметка,но я нашел ее полезной и решил поделиться решением,похожим на то,что предложил @kzqai:
zh_cn: 我看到这是个老帖子,但我觉得很有用,就想分享一个类似于@kzqai建议的解决方案。

source: In that case you will simply want to filter and sanitize the data manually. One way to do this is to pass in shorthand parameters to the function that will execute the query dynamically and then use a <code>switch()</code> statement to create a white list of valid values to be used for the table name or column name. That way no user input ever goes directly into the query. So for example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En ese caso, simplemente querr&aacute; filtrar y desinfectar los datos manualmente. </font><font style="vertical-align: inherit;">Una forma de hacerlo es pasar par&aacute;metros abreviados a la funci&oacute;n que ejecutar&aacute; la consulta din&aacute;micamente y luego usar una </font><font style="vertical-align: inherit;">instrucci&oacute;n </font></font> <code>switch()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para crear una lista blanca de valores v&aacute;lidos para el nombre de la tabla o el nombre de la columna. </font><font style="vertical-align: inherit;">De esa manera, ninguna entrada del usuario va directamente a la consulta. </font><font style="vertical-align: inherit;">As&iacute; por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その場合は、単にデータを手動でフィルタリングしてサニタイズする必要があります。</font><font style="vertical-align: inherit;">これを行う1つの方法は、クエリを動的に実行する関数に省略形のパラメーターを渡してから、</font></font> <code>switch()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメントを使用して、テーブル名または列名に使用する有効な値のホワイトリストを作成することです。</font><font style="vertical-align: inherit;">これにより、ユーザー入力がクエリに直接入力されることはありません。</font><font style="vertical-align: inherit;">だから例えば：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 경우 데이터를 수동으로 필터링하고 삭제하는 것이 좋습니다. </font><font style="vertical-align: inherit;">이를 수행하는 한 가지 방법은 쿼리를 동적으로 실행하는 함수에 속기 매개 변수를 전달한 다음 </font></font> <code>switch()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문을 사용하여 테이블 이름 또는 열 이름에 사용할 유효한 값의 화이트리스트를 작성하는 것입니다. </font><font style="vertical-align: inherit;">이렇게하면 사용자 입력이 쿼리로 직접 전달되지 않습니다. </font><font style="vertical-align: inherit;">예를 들어 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В этом случае вы просто захотите отфильтровать и очистить данные вручную. </font><font style="vertical-align: inherit;">Один из способов сделать это - передать сокращенные параметры в функцию, которая будет динамически выполнять запрос, а затем использовать </font><font style="vertical-align: inherit;">инструкцию </font></font> <code>switch()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для создания белого списка допустимых значений, которые будут использоваться для имени таблицы или имени столбца. </font><font style="vertical-align: inherit;">Таким образом, никакой пользовательский ввод никогда не входит непосредственно в запрос. </font><font style="vertical-align: inherit;">Так, например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这种情况下，您只需要手动过滤和清理数据。</font><font style="vertical-align: inherit;">一种实现方法是将简写参数传递给将动态执行查询的函数，然后使用</font></font> <code>switch()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句创建将用于表名或列名的有效值的白名单。</font><font style="vertical-align: inherit;">这样，就不会有用户输入直接进入查询。</font><font style="vertical-align: inherit;">因此，例如：</font></font>

source: Inside I check against arrays I've set up to make sure only tables and columns with "blessed" tables are accessible:
es: En el interior compruebo los arreglos que he hecho para asegurarme de que sólo las mesas y columnas con mesas "benditas" son accesibles:
ja: 内部では、「祝福された」テーブルと列だけがアクセスできるように設定した配列と照合しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부에서 배열을 검사하여 "축복 된"테이블이있는 테이블과 열에 만 액세스 할 수 있도록 설정했습니다.</font></font>
ru: Внутри я проверяю по массивам,которые я настроил,чтобы убедиться,что доступны только таблицы и столбцы с "благословенными" таблицами:
zh_cn: 在里面,我对照我设置的数组进行检查,确保只有 "受祝福 "的表和列才可以访问。

source: Is there another safe way to insert a table name into a SQL query? With safe, I mean that I don't want to do
es: ¿Hay otra forma segura de insertar un nombre de tabla en una consulta SQL? Con seguro,quiero decir que no quiero hacer
ja: SQLクエリにテーブル名を挿入する別の安全な方法はありますか?安全というのは、私がしたくないことは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테이블 이름을 SQL 쿼리에 삽입하는 또 다른 안전한 방법이 있습니까? </font><font style="vertical-align: inherit;">안전하고, 나는하고 싶지 않다는 것을 의미합니다</font></font>
ru: Есть ли другой безопасный способ вставить имя таблицы в SQL-запрос? С безопасным,я имею в виду,что я не хочу делать...
zh_cn: 有没有其他安全的方法可以在SQL查询中插入表名?我说的安全,是说我不想做

source: Part of me wonders if you could provide your own custom sanitizing function as simple as this:
es: Una parte de mí se pregunta si podría proporcionar su propia función de desinfección personalizada tan simple como esta:
ja: 私の一部は、このような簡単な独自のカスタムサニタイズ機能を提供することができないかと疑問に思っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 일부는 다음과 같이 간단한 사용자 정의 살균 기능을 제공 할 수 있는지 궁금합니다.</font></font>
ru: Часть меня интересуется,можете ли вы предоставить свою собственную функцию дезинфекции так же просто,как это:
zh_cn: 我的一部分想法是,如果你能不能提供自己的自定义消毒功能,就像这样简单。

source: The above is just an example, so needless to say, copy-&gt;paste won't work. Adjust for your needs. Now this may not provide 100% security, but it allows some control over the column names when they "come in" as dynamic strings and may be changed on users end. Furthermore, there is no need to build some array with your table column names and types since they are extracted from the information_schema.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo anterior es solo un ejemplo, por lo que no hace falta decir que copiar-&gt; pegar no funcionar&aacute;. </font><font style="vertical-align: inherit;">Aj&uacute;state a tus necesidades. </font><font style="vertical-align: inherit;">Ahora, esto puede no proporcionar un 100% de seguridad, pero permite cierto control sobre los nombres de las columnas cuando "entran" como cadenas din&aacute;micas y pueden modificarse en los usuarios finales. </font><font style="vertical-align: inherit;">Adem&aacute;s, no es necesario crear una matriz con los nombres y tipos de columna de la tabla, ya que se extraen del esquema de informaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記は一例ですので、言うまでもなくcopy-&gt; pasteは機能しません。</font><font style="vertical-align: inherit;">ニーズに合わせて調整します。</font><font style="vertical-align: inherit;">これで100％のセキュリティは提供されない可能性がありますが、動的文字列として「入ってくる」ときにユーザー名で変更できるように、列名をある程度制御できます。</font><font style="vertical-align: inherit;">さらに、それらはinformation_schemaから抽出されるため、テーブルの列名と型で配列を構築する必要はありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 예는 단지 예일 뿐이므로 복사-&gt; 붙여 넣기가 작동하지 않습니다. </font><font style="vertical-align: inherit;">필요에 따라 조정하십시오. </font><font style="vertical-align: inherit;">이제 이것은 100 % 보안을 제공하지는 않지만 열이 동적 문자열로 "들어올 때"열 이름을 일부 제어 할 수 있으며 사용자 측에서 변경 될 수 있습니다. </font><font style="vertical-align: inherit;">또한 information_schema에서 추출되므로 테이블 열 이름과 유형으로 배열을 만들 필요가 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Выше приведен только пример, поэтому, разумеется, copy-&gt; paste не будет работать. </font><font style="vertical-align: inherit;">Отрегулируйте под свои нужды. </font><font style="vertical-align: inherit;">Теперь это может не обеспечивать 100% -ную безопасность, но позволяет некоторый контроль над именами столбцов, когда они &laquo;входят&raquo; как динамические строки и могут быть изменены на стороне пользователя. </font><font style="vertical-align: inherit;">Кроме того, нет необходимости создавать некоторый массив с именами и типами столбцов таблицы, поскольку они извлекаются из information_schema.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上面只是一个示例，所以不用说，copy-&gt; paste将不起作用。</font><font style="vertical-align: inherit;">根据您的需求进行调整。</font><font style="vertical-align: inherit;">现在，这可能无法提供100％的安全性，但是当列名称作为动态字符串&ldquo;进入&rdquo;时，可以对列名称进行一些控制，并且可以在用户端进行更改。</font><font style="vertical-align: inherit;">此外，由于表列的名称和类型是从information_schema中提取的，因此无需使用它们的表列名称和类型来构建数组。</font></font>

source: The plan for <code>SELECT name FROM my_table WHERE id = :value</code> will be the same whatever you substitute for <code>:value</code>, but the seemingly similar <code>SELECT name FROM :table WHERE id = :value</code> cannot be planned, because the DBMS has no idea what table you're actually going to select from.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El plan para </font></font> <code>SELECT name FROM my_table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&aacute; el mismo sea cual sea el sustituto de </font></font> <code>:value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero el aparentemente similar </font></font> <code>SELECT name FROM :table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no se puede planificar, porque el DBMS no tiene idea de qu&eacute; tabla realmente va a seleccionar de.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>SELECT name FROM my_table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の計画は</font><font style="vertical-align: inherit;">、</font></font> <code>:value</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに何でも同じです</font><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">、DBMSはどのテーブルを認識していないので</font><font style="vertical-align: inherit;">、一見似た</font></font> <code>SELECT name FROM :table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は計画できません。実際に選択するつもりです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에 대한 계획 </font></font> <code>SELECT name FROM my_table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 대체 무엇이든 동일합니다 </font></font> <code>:value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하지만 겉보기에 비슷한 </font></font> <code>SELECT name FROM :table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> DBMS의 어떤 테이블을 아무 생각이 없기 때문에, 계획 할 수 없다 실제로 선택할 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">План для </font></font> <code>SELECT name FROM my_table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет одинаковым независимо от того, что вы заменяете </font></font> <code>:value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но внешне похожее </font></font> <code>SELECT name FROM :table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не может быть запланировано, потому что СУБД понятия не имеет, какую таблицу вы используете. на самом деле выберем из.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于计划</font></font> <code>SELECT name FROM my_table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会不管你替换相同</font></font> <code>:value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但表面上类似</font></font> <code>SELECT name FROM :table WHERE id = :value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不能计划的，因为DBMS不知道什么表格你实际上是要选择的。</font></font>

source: The same rule applies when trying to create a "database".
es: La misma regla se aplica cuando se intenta crear una "base de datos".
ja: データベース」を作成しようとする場合も同様のルールが適用されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"데이터베이스"를 만들려고 할 때도 같은 규칙이 적용됩니다.</font></font>
ru: То же правило применяется при попытке создать "базу данных".
zh_cn: 当试图创建一个 "数据库 "时,同样的规则也适用。

source: Then the PHP check before running PDO looks like...
es: Entonces la comprobación de PHP antes de ejecutar PDO parece...
ja: すると、PDOを実行する前のPHPのチェックは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇다면 PDO를 실행하기 전에 PHP 검사는 다음과 같습니다.</font></font>
ru: Тогда проверка PHP перед запуском PDO выглядит как...
zh_cn: 那么在运行PDO之前的PHP检查看起来像......

source: This is not something an abstraction library like PDO can or should work around, either, since it would defeat the 2 key purposes of prepared statements: 1) to allow the database to decide in advance how a query will be run, and use the same plan multiple times; and 2) to prevent security issues by separating the logic of the query from the variable input.
es: Esto no es algo que una biblioteca de abstracción como PDO pueda o deba trabajar,tampoco,ya que derrotaría los 2 propósitos clave de las declaraciones preparadas:1)permitir que la base de datos decida de antemano cómo se ejecutará una consulta,y utilizar el mismo plan varias veces;y 2)evitar problemas de seguridad separando la lógica de la consulta de la entrada variable.
ja: これはPDOのような抽象化ライブラリが回避できるものではありませんし、回避すべきものでもありません。1)クエリがどのように実行されるかをデータベースが事前に決定し、同じプランを複数回使用できるようにすること、2)クエリのロジックを変数の入力から分離することでセキュリティの問題を防ぐこと。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 PDO와 같은 추상화 라이브러리가 준비된 명령문의 두 가지 주요 목적을 무효화하기 때문에 해결할 수 있거나 해결할 수있는 것이 아닙니다 .1) 데이터베이스가 쿼리 실행 방법을 미리 결정하고 동일한 것을 사용하도록합니다. 여러 번 계획; </font><font style="vertical-align: inherit;">2) 쿼리의 논리를 변수 입력에서 분리하여 보안 문제를 방지합니다.</font></font>
ru: Такая библиотека абстракций,как PDO,тоже не может и не должна работать,так как это противоречит двум основным целям подготовленных высказываний:1)позволить БД заранее решить,как будет выполняться запрос,и использовать один и тот же план несколько раз;и 2)предотвратить проблемы безопасности,отделив логику запроса от входной переменной.
zh_cn: 这也不是像PDO这样的抽象库所能或应该绕过的,因为这将违背了准备好的语句的两个关键目的。1)允许数据库提前决定如何运行查询,并多次使用相同的计划;2)通过将查询的逻辑与变量输入分开,防止安全问题。
