Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Statement <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"><code>import</code></a> is in ECMAScript 6.
es: La <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"> <code>import</code> aci&oacute;n de la</a> declaraci&oacute;n est&aacute; en ECMAScript 6.
ja: ステートメントの<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"> <code>import</code> </a>はECMAScript 6にあります。
ko: 명령문 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"> <code>import</code> </a> 는 ECMAScript 6에 있습니다.
ru: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"> <code>import</code> </a> операторов в ECMAScript 6.
zh_cn: 语句<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/import"> <code>import</code> </a>在ECMAScript 6中。

source: The <a href="http://jquery.com/">jQuery</a> library provides loading functionality <a href="http://api.jquery.com/jQuery.getScript/">in one line</a>:
es: La biblioteca <a href="http://jquery.com/">jQuery</a> proporciona funcionalidad de carga <a href="http://api.jquery.com/jQuery.getScript/">en una l&iacute;nea</a> :
ja: <a href="http://jquery.com/">jQuery</a>ライブラリは<a href="http://api.jquery.com/jQuery.getScript/">、1行で</a>読み込み機能を提供します。
ko: <a href="http://jquery.com/">jQuery</a> 라이브러리는 <a href="http://api.jquery.com/jQuery.getScript/">한 줄에</a> 로딩 기능 을 제공합니다.
ru: Библиотека <a href="http://jquery.com/">jQuery</a> обеспечивает загрузку <a href="http://api.jquery.com/jQuery.getScript/">в одну строку</a> :
zh_cn: <a href="http://jquery.com/">jQuery</a>库<a href="http://api.jquery.com/jQuery.getScript/">在一行中</a>提供了加载功能：

source: The <code>@import</code> syntax for achieving CSS-like JavaScript importing is possible using a tool such as Mixture via their special <code>.mix</code> file type (see <a href="http://docs.mixture.io/preprocessors#mix">here</a>). I imagine the application simply uses one of the aforementioned methods interally, though I don't know.
es: La sintaxis <code>@import</code> para lograr la importaci&oacute;n de JavaScript similar a CSS es posible utilizando una herramienta como Mixture a trav&eacute;s de su tipo especial de archivo <code>.mix</code> (ver <a href="http://docs.mixture.io/preprocessors#mix">aqu&iacute;</a> ). Me imagino que la aplicaci&oacute;n simplemente usa uno de los m&eacute;todos mencionados anteriormente de forma interna, aunque no lo s&eacute;.
ja: CSSのようなJavaScriptインポートを実現するための <code>@import</code> 構文は、特別な <code>.mix</code> ファイルタイプを介してMixtureなどのツールを使用して可能です（ <a href="http://docs.mixture.io/preprocessors#mix">ここを</a>参照）。 私は知りませんが、アプリケーションは前述の方法の1つを内部的に使用するだけだと思います。
ko: CSS와 같은 JavaScript 가져 오기를 달성하기위한 <code>@import</code> 구문은 특수한 <code>.mix</code> 파일 유형 ( <a href="http://docs.mixture.io/preprocessors#mix">여기</a> 참조)을 통해 Mixture와 같은 도구를 사용하여 가능합니다. 나는 응용 프로그램이 단순히 위에서 언급 한 방법 중 하나를 내부적으로 사용한다고 생각합니다.
ru: Синтаксис <code>@import</code> для импорта CSS-подобного JavaScript возможен с помощью такого инструмента, как Mixture, через специальный <code>.mix</code> файла .mix (см. <a href="http://docs.mixture.io/preprocessors#mix">Здесь</a> ). Я предполагаю, что приложение просто использует один из вышеупомянутых методов, хотя я не знаю.
zh_cn: 使用诸如Mixture之类的工具通过其特殊的 <code>.mix</code> 文件类型，可以使用 <code>@import</code> 语法来实现类似CSS的JavaScript导入（请参见<a href="http://docs.mixture.io/preprocessors#mix">此处</a> ）。 我想该应用程序只是内部使用一种上述方法，尽管我不知道。

source: The old versions of JavaScript had no import, include, or require, so many different approaches to this problem have been developed.
es: Las viejas versiones de JavaScript no tenían importancia,incluyen o requieren,por lo que se han desarrollado muchos enfoques diferentes para este problema.
ja: 古いバージョンのJavaScriptにはインポートもインクルードも要求もなかったため、この問題に対するさまざまなアプローチが開発されてきました。
ko: 이전 버전의 JavaScript에는 가져 오기, 포함 또는 필요가 없었으므로이 문제에 대한 다양한 접근 방식이 개발되었습니다.
ru: Старые версии JavaScript не импортировали,не включали и не требовали,поэтому было разработано множество различных подходов к этой проблеме.
zh_cn: 旧版本的JavaScript没有导入、包含或要求,所以针对这个问题开发了很多不同的方法。

source: The older CJS module style, still widely used in Node.js, is the <a href="https://nodejs.org/api/modules.html"><code>module.exports</code>/<code>require</code></a> system.
es: El estilo de m&oacute;dulo CJS anterior, que todav&iacute;a se usa ampliamente en Node.js, es el sistema <a href="https://nodejs.org/api/modules.html"> <code>module.exports</code> / <code>require</code> </a> .
ja: Node.jsでまだ広く使用されている古いCJSモジュールスタイルは、 <a href="https://nodejs.org/api/modules.html"> <code>module.exports</code> / <code>require</code> </a> systemです。
ko: Node.js에서 여전히 널리 사용되는 이전 CJS 모듈 스타일은 <a href="https://nodejs.org/api/modules.html"> <code>module.exports</code> / <code>require</code> </a> 시스템입니다.
ru: Более старый стиль модуля CJS, все еще широко используемый в Node.js, это система <a href="https://nodejs.org/api/modules.html"> <code>module.exports</code> / <code>require</code> </a> .
zh_cn: 仍在Node.js中广泛使用的较旧的CJS模块样式是<a href="https://nodejs.org/api/modules.html"> <code>module.exports</code> / <code>require</code> </a>系统。

source: The problem with <code>$.getScript</code> and really any other solution that requires a callback when loading is complete is that if you have multiple files that use it and depend on each other you no longer have a way to know when all scripts have been loaded (once they are nested in multiple files).
es: El problema con <code>$.getScript</code> y realmente cualquier otra soluci&oacute;n que requiera una devoluci&oacute;n de llamada cuando se complete la carga es que si tiene varios archivos que lo usan y dependen unos de otros, ya no tiene una manera de saber cu&aacute;ndo se han cargado todos los scripts (una vez est&aacute;n anidados en m&uacute;ltiples archivos).
ja: <code>$.getScript</code> の問題、およびロードの完了時にコールバックが必要な他のすべてのソリューションの問題は、それを使用し、相互に依存する複数のファイルがある場合、すべてのスクリプトがロードされたときを知る方法がなくなったことです（一度、それらは複数のファイルにネストされています）。
ko: <code>$.getScript</code> 와로드가 완료 될 때 콜백이 필요한 다른 솔루션의 문제는 파일을 사용하고 서로 의존하는 여러 파일이 있으면 더 이상 모든 스크립트가로드 된 시점을 알 수있는 방법이 없다는 것입니다 여러 파일에 중첩되어 있습니다).
ru: Проблема с <code>$.getScript</code> и действительно любым другим решением, которое требует обратного вызова при завершении загрузки, состоит в том, что если у вас есть несколько файлов, которые используют его и зависят друг от друга, у вас больше не будет способа узнать, когда все сценарии были загружены (один раз они вложены в несколько файлов).
zh_cn: <code>$.getScript</code> 以及实际上在完成加载后需要回调的任何其他解决方案的问题是，如果您有多个使用它的文件并且彼此依赖，则您不再有办法知道何时加载所有脚本（一次它们嵌套在多个文件中）。

source: The reason why we look for the first <code>script</code> element instead of <code>head</code> or <code>body</code> is because some browsers don't create one if missing, but we're guaranteed to have a <code>script</code> element - this one. Read more at <a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/</a>.
es: La raz&oacute;n por la que buscamos el primer elemento de <code>script</code> en lugar de <code>head</code> o <code>body</code> es porque algunos navegadores no crean uno si faltan, pero estamos garantizados de tener un elemento de <code>script</code> : este. Lea m&aacute;s en <a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/</a> .
ja: <code>head</code> や <code>body</code> 代わりに最初の <code>script</code> 要素を探すのは、一部のブラウザーでは欠落しても <code>script</code> 要素が作成されないためですが、 スクリプト要素（この要素）があることが保証されています 。 詳細については、 <a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http：//www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/をご覧ください</a> 。
ko: <code>head</code> 또는 <code>body</code> 대신 첫 번째 <code>script</code> 요소를 찾는 이유는 일부 브라우저가없는 경우 브라우저를 만들지 않지만 <code>script</code> 요소가 있다는 것입니다. <a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/</a> 에서 자세히 알아보십시오.
ru: Причина, по которой мы ищем первый элемент <code>script</code> вместо <code>head</code> или <code>body</code> заключается в том, что некоторые браузеры не создают его в случае его отсутствия, но мы обязательно имеем элемент <code>script</code> - этот. Узнайте больше на <a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/</a> .
zh_cn: 我们寻找第一个 <code>script</code> 元素而不是 <code>head</code> 或 <code>body</code> 的原因是因为某些浏览器如果丢失则不会创建一个 <code>script</code> 元素，但是我们保证有一个script元素-这个。 请访问<a href="http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/">http://www.jspatterns.com/the-ridiculous-case-of-adding-a-script-element/</a>了解更多信息 。

source: The script can even reside on a different server. Furthermore, the browser evaluates the code. The <code>&lt;script&gt;</code> tag can be injected into either the web page <code>&lt;head&gt;</code>, or inserted just before the closing <code>&lt;/body&gt;</code> tag.
es: El script incluso puede residir en un servidor diferente. Adem&aacute;s, el navegador eval&uacute;a el c&oacute;digo. La etiqueta <code>&lt;script&gt;</code> puede inyectarse en la p&aacute;gina web <code>&lt;head&gt;</code> o insertarse justo antes de la etiqueta de cierre <code>&lt;/body&gt;</code> .
ja: スクリプトは別のサーバーに置くこともできます。 さらに、ブラウザはコードを評価します。 <code>&lt;script&gt;</code> タグは、Webページ <code>&lt;head&gt;</code> に挿入するか、終了 <code>&lt;/body&gt;</code> タグの直前に挿入できます。
ko: 스크립트는 다른 서버에 상주 할 수도 있습니다. 또한 브라우저는 코드를 평가합니다. <code>&lt;script&gt;</code> 태그는 웹 페이지 <code>&lt;head&gt;</code> 에 삽입하거나 닫는 <code>&lt;/body&gt;</code> 태그 바로 앞에 삽입 할 수 있습니다.
ru: Скрипт может даже находиться на другом сервере. Кроме того, браузер оценивает код. Тег <code>&lt;script&gt;</code> может быть вставлен в веб-страницу <code>&lt;head&gt;</code> или вставлен непосредственно перед закрывающим <code>&lt;/body&gt;</code> .
zh_cn: 该脚本甚至可以驻留在其他服务器上。 此外，浏览器会评估代码。 可以将 <code>&lt;script&gt;</code> 标记插入网页 <code>&lt;head&gt;</code> 中 ，也可以将其插入在结束 <code>&lt;/body&gt;</code> 标记之前。

source: Then <code>main.js</code>:
es: Entonces <code>main.js</code> :
ja: 次に <code>main.js</code> ：
ko: 그런 다음 <code>main.js</code> :
ru: Тогда <code>main.js</code> :
zh_cn: 然后 <code>main.js</code> ：

source: Then <code>main.mjs</code>:
es: Entonces <code>main.mjs</code> :
ja: 次に <code>main.mjs</code> ：
ko: 그런 다음 <code>main.mjs</code> :
ru: Тогда <code>main.mjs</code> :
zh_cn: 然后 <code>main.mjs</code> ：

source: Then <code>module.js</code>:
es: Entonces <code>module.js</code> :
ja: 次に <code>module.js</code> ：
ko: 그런 다음 <code>module.js</code> :
ru: Тогда <code>module.js</code> :
zh_cn: 然后 <code>module.js</code> ：

source: Then you reload the page hitting
es: Entonces recargas la página pulsando
ja: その後、ページをリロードして
ko: 그런 다음 페이지 히트를 다시로드하십시오.
ru: Затем вы перезагружаете страницу,нажав
zh_cn: 然后重新加载页面,点击

source: Then you run all that:
es: Entonces tú diriges todo eso:
ja: それから、すべてを実行してください。
ko: 그런 다음 모든 것을 실행하십시오.
ru: Тогда ты будешь управлять всем этим:
zh_cn: 那你就把这些都跑了。

source: Then you write the code you want to use AFTER the script is loaded in a <a href="http://en.wikipedia.org/wiki/Anonymous_function">lambda function</a>:
es: Luego escribe el c&oacute;digo que desea usar DESPU&Eacute;S de que el script se carga en una <a href="http://en.wikipedia.org/wiki/Anonymous_function">funci&oacute;n lambda</a> :
ja: 次に、スクリプトが<a href="http://en.wikipedia.org/wiki/Anonymous_function">ラムダ関数に</a>読み込まれた後で、使用するコードを記述します。
ko: 그런 다음 스크립트가 <a href="http://en.wikipedia.org/wiki/Anonymous_function">람다 함수에</a> 로드 된 후 사용하려는 코드를 작성하십시오.
ru: Затем вы пишете код, который хотите использовать ПОСЛЕ того, как скрипт загружается в <a href="http://en.wikipedia.org/wiki/Anonymous_function">лямбда-функцию</a> :
zh_cn: 然后，在脚本加载到<a href="http://en.wikipedia.org/wiki/Anonymous_function">lambda函数中</a>之后，编写要使用的代码：

source: There actually <em>is</em> a way to load a JavaScript file <em>not</em> asynchronously, so you could use the functions included in your newly loaded file right after loading it, and I think it works in all browsers.
es: En realidad, <em>hay</em> una manera de cargar un archivo JavaScript <em>no</em> asincr&oacute;nicamente, por lo que podr&iacute;a usar las funciones incluidas en su archivo reci&eacute;n cargado justo despu&eacute;s de cargarlo, y creo que funciona en todos los navegadores.
ja: 実際に<em>は</em> 、JavaScriptファイル<em>を</em>非同期で<em>はなく</em>読み込む方法<em>が</em>あるので、新しく読み込んだファイルに含まれている関数を、読み込んだ直後に使用でき、すべてのブラウザーで機能すると思います。
ko: 실제로 JavaScript 파일 <em>을</em> 비동기식으로로드 <em>하지 않는</em> 방법이 있으므로 새로로드 한 파일을로드 한 직후에 포함 된 기능을 사용할 수 있으며 모든 브라우저에서 작동한다고 생각합니다.
ru: На самом деле <em>есть</em> способ загрузить файл JavaScript <em>не</em> асинхронно, так что вы можете использовать функции, включенные в ваш недавно загруженный файл, сразу после загрузки, и я думаю, что он работает во всех браузерах.
zh_cn: 实际上， <em>有</em>一种方法可以<em>不</em>异步加载JavaScript文件，因此您可以在加载后立即使用新加载的文件中包含的功能，并且我认为它可以在所有浏览器中使用。

source: There are a lot of potential answers for this question. My answer is obviously based on a number of them. This is what I ended up with after reading through all the answers.
es: Hay muchas respuestas potenciales para esta pregunta.Mi respuesta se basa obviamente en varias de ellas.Esto es lo que terminé después de leer todas las respuestas.
ja: この質問には多くの可能性のある答えがあります。私の答えは明らかにそれらのいくつかに基づいています。すべての答えを読んだ結果、私はこうなりました。
ko: 이 질문에 대한 많은 잠재적 인 답변이 있습니다. 내 대답은 분명히 여러 가지를 기반으로합니다. 이것이 모든 답변을 읽은 후에 끝내는 것입니다.
ru: На этот вопрос есть много потенциальных ответов.Очевидно,что мой ответ основывается на ряде из них.Это то,чем я закончил после прочтения всех ответов.
zh_cn: 对于这个问题,有很多可能的答案。我的答案显然是基于其中的一些答案。这是我看完所有的答案后得出的结果。

source: There are other ways for JavaScript to include external JavaScript contents in browsers that do not require preprocessing.
es: Hay otras formas de incluir contenidos externos de JavaScript en los navegadores que no requieren preprocesamiento.
ja: 他にも、前処理を必要としないJavaScriptの外部コンテンツをブラウザに含める方法があります。
ko: JavaScript가 전처리가 필요없는 브라우저에 외부 JavaScript 컨텐츠를 포함시키는 다른 방법이 있습니다.
ru: Существуют и другие способы включения внешнего JavaScript-контента в браузеры,не требующие препроцессирования.
zh_cn: 在浏览器中,JavaScript还有其他不需要预处理的方式来包含外部JavaScript内容。

source: There are several ways to implement modules in Javascript, Here are the 2 most popular ones:
es: Hay varias maneras de implementar módulos en Javascript,aquí están las 2 más populares:
ja: Javascriptでモジュールを実装する方法はいくつかありますが、ここでは最も人気のある2つの方法を紹介します。
ko: Javascript에서 모듈을 구현하는 방법에는 여러 가지가 있습니다. 가장 인기있는 두 가지 방법은 다음과 같습니다.
ru: Существует несколько способов реализации модулей на Javascript,вот 2 самых популярных:
zh_cn: 有几种在Javascript中实现模块的方法,下面是2种最流行的方法。

source: There is a good news for you. Very soon you will be able to load JavaScript code easily. It will become a standard way of importing modules of JavaScript code and will be part of core JavaScript itself.
es: Hay una buena noticia para ti.Muy pronto podrás cargar el código JavaScript fácilmente.Se convertirá en una forma estándar de importar módulos de código JavaScript y será parte del propio núcleo de JavaScript.
ja: あなたに良いニュースがあります。まもなく、JavaScriptのコードを簡単に読み込むことができるようになります。これは、JavaScriptコードのモジュールをインポートするための標準的な方法になり、コアJavaScript自体の一部になるでしょう。
ko: 좋은 소식이 있습니다. 곧 JavaScript 코드를 쉽게로드 할 수 있습니다. JavaScript 코드 모듈을 가져 오는 표준 방법이되고 핵심 JavaScript 자체의 일부가됩니다.
ru: Есть хорошие новости для тебя.Очень скоро вы сможете легко загрузить JavaScript-код.Это станет стандартным способом импорта модулей JavaScript-кода и станет частью самого ядра JavaScript.
zh_cn: 有一个好消息要告诉你。很快,你将能够轻松加载JavaScript代码。它将成为导入JavaScript代码模块的标准方式,并将成为核心JavaScript本身的一部分。

source: There is also <a href="http://headjs.com/">Head.js</a>. It is very easy to deal with:
es: Tambi&eacute;n hay <a href="http://headjs.com/">Head.js.</a> Es muy f&aacute;cil tratar con:
ja: <a href="http://headjs.com/">Head.js</a>もあります。 対処は非常に簡単です。
ko: <a href="http://headjs.com/">Head.js</a> 도 있습니다 . 다루기가 매우 쉽습니다.
ru: Также есть <a href="http://headjs.com/">Head.js.</a> Это очень легко иметь дело с:
zh_cn: 还有<a href="http://headjs.com/">Head.js。</a> 这很容易处理：

source: This function will add a new <code>&lt;script&gt;</code> tag to the end of the head section of the page, where the <code>src</code> attribute is set to the URL which is given to the function as the first parameter.
es: Esta funci&oacute;n agregar&aacute; una nueva etiqueta <code>&lt;script&gt;</code> al final de la secci&oacute;n de encabezado de la p&aacute;gina, donde el atributo <code>src</code> se establece en la URL que se le asigna a la funci&oacute;n como primer par&aacute;metro.
ja: この関数は、新しい <code>&lt;script&gt;</code> タグをページのヘッドセクションの最後に追加します <code>src</code> 属性は、最初のパラメーターとして関数に指定されたURLに設定されます。
ko: 이 함수는 페이지의 head 섹션 끝에 새로운 <code>&lt;script&gt;</code> 태그를 추가합니다. 여기서 <code>src</code> 속성은 함수에 첫 번째 매개 변수로 제공되는 URL로 설정됩니다.
ru: Эта функция добавит новый <code>&lt;script&gt;</code> в конец раздела head страницы, где для атрибута <code>src</code> задан URL-адрес, который передается функции в качестве первого параметра.
zh_cn: 此函数将在页面头部的末尾添加一个新的 <code>&lt;script&gt;</code> 标记，其中 <code>src</code> 属性设置为该函数作为第一个参数给出的URL。

source: This moduling system is used in NodeJS. You basically add your exports to an object which is called <code>module.exports</code>. You then can access this object via a <code>require('modulePath')</code>. Important here is to realize that these modules are being cached, so if you <code>require()</code> a certain module twice it will return the already created module.
es: Este sistema de modulaci&oacute;n se usa en NodeJS. B&aacute;sicamente agrega sus exportaciones a un objeto que se llama <code>module.exports</code> . Luego puede acceder a este objeto a trav&eacute;s de un <code>require('modulePath')</code> . Lo importante aqu&iacute; es darse cuenta de que estos m&oacute;dulos se est&aacute;n almacenando en cach&eacute;, por lo que si <code>require()</code> un m&oacute;dulo determinado dos veces, devolver&aacute; el m&oacute;dulo ya creado.
ja: この変調システムはNodeJSで使用されます。 基本的には、 <code>module.exports</code> と呼ばれるオブジェクトにエクスポートを追加します。 その後、 <code>require('modulePath')</code> を介してこのオブジェクトにアクセスできます。 ここで重要なのは、これらのモジュールがキャッシュされていることを理解することです。そのため、特定のモジュールを2回 <code>require()</code> すると、作成済みのモジュールが返されます。
ko: 이 변조 시스템은 NodeJS에서 사용됩니다. 기본적으로 <code>module.exports</code> 라는 객체에 내보내기를 추가합니다. 그런 다음 <code>require('modulePath')</code> 를 통해이 객체에 액세스 할 수 있습니다. 여기서 중요한 것은 이러한 모듈이 캐시되고 있다는 것을 인식하는 것이므로 특정 모듈을 두 번 필요로하면 이미 작성된 모듈을 반환합니다.
ru: Эта система модуляции используется в NodeJS. Вы в основном добавляете свои экспорты к объекту, который называется <code>module.exports</code> . Затем вы можете получить доступ к этому объекту через <code>require('modulePath')</code> . Важно понимать, что эти модули кэшируются, поэтому, если вам <code>require()</code> определенный модуль дважды, он вернет уже созданный модуль.
zh_cn: 该调制系统用于NodeJS。 基本上，您将导出添加到名为 <code>module.exports</code> 的对象中。 然后，您可以通过 <code>require('modulePath')</code> 访问该对象。 在这里重要的是要意识到这些模块已被缓存，因此，如果对 <code>require()</code> 两次调用某个模块，它将返回已创建的模块。

source: This saved my day. I hope this helps.
es: Esto me salvó el día.Espero que esto ayude.
ja: これは私の日を救ってくれた これが役に立つことを願っています。
ko: 이것은 나의 하루를 구했다. 이게 도움이 되길 바란다.
ru: Это спасло мой день.Надеюсь,это поможет.
zh_cn: 这救了我一天。我希望这能帮到你

source: This script will add a JavaScript file to the top of any other <code>&lt;script&gt;</code> tag:
es: Este script agregar&aacute; un archivo JavaScript en la parte superior de cualquier otra etiqueta <code>&lt;script&gt;</code> :
ja: このスクリプトは、JavaScriptファイルを他の <code>&lt;script&gt;</code> タグの先頭に追加します。
ko: 이 스크립트는 다른 <code>&lt;script&gt;</code> 태그의 맨 위에 JavaScript 파일을 추가합니다.
ru: Этот скрипт добавит файл JavaScript в начало любого другого <code>&lt;script&gt;</code> :
zh_cn: 此脚本会将JavaScript文件添加到任何其他 <code>&lt;script&gt;</code> 标记的顶部：

source: This should do:
es: Esto debería servir:
ja: これでいいんじゃないかな。
ko: 이것은해야합니다 :
ru: Это должно сработать:
zh_cn: 这个应该可以了。

source: Usage (Promise):
es: Uso (Promesa):
ja: 使い方(プロミス)。
ko: 사용법 (약속) :
ru: Использование (Обещание):
zh_cn: 用法(承诺)。

source: Usage (async/await):
es: Uso (asyncawait):
ja: 使用法(asyncawait)。
ko: 사용법 (비동기 / 대기) :
ru: Использование (асинкаваит):
zh_cn: 用法(Asyncawait)。

source: Using <code>.mjs</code>, you'd have <code>module.mjs</code>:
es: Usando <code>.mjs</code> , tendr&iacute;as <code>module.mjs</code> :
ja: <code>.mjs</code> を使用すると、 module.mjsができます。
ko: <code>.mjs</code> 사용하면 <code>module.mjs</code> 가 있습니다 .
ru: Используя <code>.mjs</code> , вы получите <code>module.mjs</code> :
zh_cn: 使用 <code>.mjs</code> ，您将拥有 <code>module.mjs</code> ：

source: Using <code>package.json</code>:
es: Usando <code>package.json</code> :
ja: <code>package.json</code> の使用：
ko: <code>package.json</code> 사용 :
ru: Используя <code>package.json</code> :
zh_cn: 使用 <code>package.json</code> ：

source: Well, you can use the hack the author suggests in the link I gave you. In summary, for people in a hurry, he uses an event to run a callback function when the script is loaded. So you can put all the code using the remote library in the callback function. For example:
es: Bueno,puedes usar el hack que el autor sugiere en el enlace que te di.En resumen,para la gente con prisa,usa un evento para ejecutar una función de devolución de llamada cuando se carga el guión.Así que puedes poner todo el código usando la biblioteca remota en la función de devolución de llamada.Por ejemplo:
ja: まあ、私があげたリンク先で著者が提案しているハックを使えばいいんですけどね。要約すると、急いでいる人のために、スクリプトが読み込まれたときにイベントを使ってコールバック関数を実行するというものです。なので、コールバック関数の中にリモートライブラリを使ったコードを全て入れればいいのです。例えば、以下のように。
ko: 글쎄, 내가 준 링크에서 저자가 제안한 해킹을 사용할 수 있습니다. 요약하자면, 급한 사람들을 위해, 그는 스크립트가로드 될 때 이벤트를 사용하여 콜백 함수를 실행합니다. 따라서 콜백 함수에서 원격 라이브러리를 사용하여 모든 코드를 넣을 수 있습니다. 예를 들면 다음과 같습니다.
ru: Ну,ты можешь воспользоваться взломом,который автор предлагает в ссылке,которую я тебе дал.В общем,для людей,которые спешат,он использует событие для запуска функции обратного вызова при загрузке скрипта.Таким образом,вы можете поместить весь код,используя удаленную библиотеку,в функцию обратного вызова.Например:
zh_cn: 那么,你可以使用笔者给你的链接中的作者建议的黑客方法。综上所述,对于赶时间的人来说,他用一个事件来运行脚本加载时的回调函数。所以你可以把所有使用远程库的代码都放在回调函数中。举个例子。
