Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (This answer is in response to e-satis' comment).
es: (Esta respuesta es en respuesta al comentario de e-satis).
ja: (この回答はe-satisさんのコメントに対するものです)。
ko: (이 답변은 e-satis의 의견에 대한 답변입니다).
ru: (Этот ответ является ответом на комментарий esatis).
zh_cn: (此回答是对e-satis' 的评论的回应)。

source: . And it works! Confusing...
es: .¡Y funciona! Confuso...
ja: .うまくいった!紛らわしい...
ko: . 그리고 작동합니다! 혼란스러운 ...
ru: .И это работает! Сбивает с толку...
zh_cn: .而且它还能用!令人困惑.....

source: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">Introducing Sprockets: JavaScript dependency management and concatenation</a></em>
es: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">Presentaci&oacute;n de Sprockets: gesti&oacute;n de dependencias de JavaScript y concatenaci&oacute;n</a></em>
ja: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">Sprocketsの紹介：JavaScriptの依存関係の管理と連結</a></em>
ko: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">스프로킷 소개 : JavaScript 의존성 관리 및 연결</a></em>
ru: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">Представляем Sprockets: управление зависимостями JavaScript и конкатенация</a></em>
zh_cn: <em><a href="http://37signals.com/svn/posts/1587-introducing-sprockets-javascript-dependency-management-and-concatenation">Sprockets简介：JavaScript依赖关系管理和串联</a></em>

source: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">Static module resolution</a></em>
es: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">Resoluci&oacute;n del m&oacute;dulo est&aacute;tico</a></em>
ja: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">静的モジュールの解決</a></em>
ko: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">정적 모듈 해상도</a></em>
ru: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">Разрешение статического модуля</a></em>
zh_cn: <em><a href="http://calculist.org/blog/2012/06/29/static-module-resolution/">静态模块分辨率</a></em>

source: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">Module loaders</a></em>
es: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">Cargadores modulares</a></em>
ja: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">モジュールローダー</a></em>
ko: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">모듈 로더</a></em>
ru: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">Модульные погрузчики</a></em>
zh_cn: <em><a href="http://wiki.ecmascript.org/doku.php?id=harmony:module_loaders">模块装载机</a></em>

source: <strong>CommonJS</strong> (used in NodeJS)
es: <strong>CommonJS</strong> (utilizado en NodeJS)
ja: <strong>CommonJS</strong> （NodeJSで使用）
ko: <strong>CommonJS</strong> (NodeJS에서 사용)
ru: <strong>CommonJS</strong> (используется в NodeJS)
zh_cn: <strong>CommonJS</strong> （在NodeJS中使用）

source: <strong>ES6 Modules</strong>
es: <strong>M&oacute;dulos ES6</strong>
ja: <strong>ES6モジュール</strong>
ko: <strong>ES6 모듈</strong>
ru: <strong>ES6 Модули</strong>
zh_cn: <strong>ES6模块</strong>

source: <strong>So what to do about it ?</strong>
es: <strong>Entonces, &iquest;qu&eacute; hacer al respecto?</strong>
ja: <strong>それでそれについて何をすべきか？</strong>
ko: <strong>그래서 어떻게해야합니까?</strong>
ru: <strong>Так что с этим делать?</strong>
zh_cn: <strong>那么该怎么办呢？</strong>

source: <strong>UPDATE</strong>: Mixture is <a href="http://mixture.io/blog/free/">now free</a> (offline).
es: <strong>ACTUALIZACI&Oacute;N</strong> : La mezcla <a href="http://mixture.io/blog/free/">ahora</a> es gratuita (sin conexi&oacute;n).
ja: <strong>更新</strong> ：Mixtureは<a href="http://mixture.io/blog/free/">無料</a> （オフライン）になりました。
ko: <strong>업데이트</strong> : 혼합물은 <a href="http://mixture.io/blog/free/">이제 무료입니다</a> (오프라인).
ru: <strong>ОБНОВЛЕНИЕ</strong> : Mixture <a href="http://mixture.io/blog/free/">теперь бесплатна</a> (не в сети).
zh_cn: <strong>更新</strong> ：混合物<a href="http://mixture.io/blog/free/">现在免费</a> （脱机）。

source: <strong>UPDATE</strong>: Mixture is now discontinued. <a href="https://github.com/teammixture/mixture.io/issues/6">Old mixture releases</a> are still available
es: <strong>ACTUALIZACI&Oacute;N</strong> : La mezcla ahora se descontin&uacute;a. <a href="https://github.com/teammixture/mixture.io/issues/6">Los lanzamientos de mezclas antiguas</a> todav&iacute;a est&aacute;n disponibles
ja: <strong>更新</strong> ：Mixtureは廃止されました。 <a href="https://github.com/teammixture/mixture.io/issues/6">古い混合リリース</a>はまだ利用可能です
ko: <strong>업데이트</strong> : 혼합물이 중단되었습니다. <a href="https://github.com/teammixture/mixture.io/issues/6">오래된 혼합물 출시</a> 는 여전히 가능합니다
ru: <strong>ОБНОВЛЕНИЕ</strong> : Смесь теперь прекращена. <a href="https://github.com/teammixture/mixture.io/issues/6">Старые релизы смеси</a> все еще доступны
zh_cn: <strong>更新</strong> ：混合物现已停产。 <a href="https://github.com/teammixture/mixture.io/issues/6">旧的混合物版本</a>仍然可用

source: <strong>implementation.js</strong> is your "main" JavaScript file that depends on <strong>some-dependency.js</strong>
es: <strong>implement.js</strong> es su archivo JavaScript "principal" que depende de <strong>some-dependency.js</strong>
ja: <strong>implementation.js</strong>は、 <strong>some-dependency.jsに依存</strong>する「メイン」のJavaScriptファイルです
ko: <strong>implementation.js</strong> 는 <strong>some-dependency.js에 의존</strong> 하는 "기본"JavaScript 파일입니다.
ru: <strong>creation.js</strong> - это ваш &laquo;основной&raquo; файл JavaScript, который зависит от <strong>some-dependency.js</strong>
zh_cn: <strong>Implementation.js</strong>是您的&ldquo;主要&rdquo; JavaScript文件，它取决于<strong>some-dependency.js</strong>

source: AJAX Loading
es: Carga de AJAX
ja: AJAXの読み込み
ko: AJAX 로딩
ru: AJAX погрузка
zh_cn: AJAX加载

source: Alternatively, <a href="https://stackoverflow.com/a/10939737/1676444">as the second highest voted answer to your question highlights</a>, <a href="http://www.requirejs.org/">RequireJS</a> can also handle including scripts inside a Web Worker (likely calling <code>importScripts</code> itself, but with a few other useful features).
es: Alternativamente, <a href="https://stackoverflow.com/a/10939737/1676444">como destaca la segunda respuesta m&aacute;s votada a su pregunta</a> , <a href="http://www.requirejs.org/">RequireJS</a> tambi&eacute;n puede manejar la inclusi&oacute;n de scripts dentro de un Web Worker (probablemente llamando a <code>importScripts</code> en s&iacute;, pero con algunas otras caracter&iacute;sticas &uacute;tiles).
ja: または、 <a href="https://stackoverflow.com/a/10939737/1676444">質問に対する2番目に投票数の多い回答がハイライトされているため</a> 、 <a href="http://www.requirejs.org/">RequireJS</a>はWebワーカー内にスクリプトを含めることも処理できます （ <code>importScripts</code> 自体を呼び出す可能性がありますが、他のいくつかの便利な機能があります）。
ko: 또는 <a href="https://stackoverflow.com/a/10939737/1676444">귀하의 질문에 대한 두 번째로 높은 투표 답변으로</a> <a href="http://www.requirejs.org/">RequireJS</a> 는 웹 작업자 내부의 스크립트 포함을 가져올 수도 있습니다 ( <code>importScripts</code> 자체를 호출하지만 다른 유용한 기능이 있음).
ru: Кроме того, <a href="https://stackoverflow.com/a/10939737/1676444">в качестве второго наиболее высоко</a> <a href="http://www.requirejs.org/">оцененного</a> ответа на ваш вопрос , RequireJS может также обрабатывать включение сценариев внутри Web Worker (вероятно, вызывающего сам <code>importScripts</code> , но с несколькими другими полезными функциями).
zh_cn: 或者， <a href="https://stackoverflow.com/a/10939737/1676444">作为对您的问题的第二高投票答案</a> ， <a href="http://www.requirejs.org/">RequireJS</a>还可以处理Web Worker中包含的脚本（可能调用 <code>importScripts</code> 本身，但还具有其他一些有用的功能）。

source: Although these answers are great, there is a simple "solution" that has been around since script loading existed, and it will cover 99.999% of most people's use cases. Just include the script you need before the script that requires it. For most projects it does not take long to determine which scripts are needed and in what order.
es: Aunque estas respuestas son geniales,hay una "solución" simple que ha existido desde que se cargó el script,y que cubrirá el 99,999% de los casos de uso de la mayoría de la gente.Sólo incluye el script que necesitas antes que el que lo requiere.Para la mayoría de los proyectos no toma mucho tiempo determinar qué guiones se necesitan y en qué orden.
ja: これらの回答は素晴らしいものですが、スクリプトの読み込みが存在していた頃からあるシンプルな「解決策」があり、ほとんどの人のユースケースの99.999%をカバーします。必要なスクリプトを必要とするスクリプトの前に、必要なスクリプトを含めるだけです。ほとんどのプロジェクトでは、どのスクリプトが必要か、どの順番で必要かを判断するのに時間はかかりません。
ko: 이 답변은 훌륭하지만 스크립트로드가 존재 한 이후로 존재하는 간단한 "솔루션"이 있으며 대부분의 사람들이 사용하는 사례의 99.999 %를 차지합니다. 필요한 스크립트 앞에 필요한 스크립트를 포함시키기 만하면됩니다. 대부분의 프로젝트에서 필요한 스크립트와 순서를 결정하는 데 시간이 오래 걸리지 않습니다.
ru: Хотя эти ответы отличные,есть простое "решение",которое было вокруг с момента загрузки скриптов существовали,и оно будет охватывать 99,999% случаев использования большинства людей.Просто включите скрипт,который вам нужен перед сценарием,который требует этого.Для большинства проектов это не займет много времени,чтобы определить,какие скрипты необходимы и в каком порядке.
zh_cn: 虽然这些答案都很好,但有一个简单的 "解决方案",从脚本加载存在的时候就已经出现了,它可以覆盖大部分人的用例的99.999%。只需要在需要的脚本之前包含你需要的脚本就可以了。对于大多数项目来说,不需要花很长时间就能确定哪些脚本是需要的,按照什么顺序来做。

source: And be able to call a function from the required script in the next line:
es: Y ser capaz de llamar una función desde el guión requerido en la siguiente línea:
ja: そして、次の行で必要なスクリプトから関数を呼び出せるようにすること。
ko: 다음 줄에서 필요한 스크립트에서 함수를 호출 할 수 있습니다.
ru: И иметь возможность вызвать функцию из требуемого скрипта в следующей строке:
zh_cn: 并能够在下一行中调用所需的脚本中的函数。

source: And get the combined file
es: Y conseguir el archivo combinado
ja: そして、結合されたファイルを取得します。
ko: 그리고 결합 된 파일을 얻으십시오
ru: И получите комбинированный файл
zh_cn: 并获得合并后的文件

source: And right after including <code>included.js</code>, the <code>hello()</code> function is called, and you get the alert.
es: Y justo despu&eacute;s de incluir <code>included.js</code> , se llama a la funci&oacute;n <code>hello()</code> y obtiene la alerta.
ja: また、 <code>included.js</code> をインクルードした直後に <code>hello()</code> 関数が呼び出され、アラートが表示されます。
ko: 그리고 <code>included.js</code> 를 포함 하면 <code>hello()</code> 함수가 호출되고 경고가 표시됩니다.
ru: И сразу после включения <code>hello()</code> вызывается функция hello () , и вы получаете предупреждение.
zh_cn: 在包含 <code>included.js</code> 之后 ，立即调用 <code>hello()</code> 函数，您将收到警报。

source: Another way, that in my opinion is much cleaner, is to make a synchronous Ajax request instead of using a <code>&lt;script&gt;</code> tag. Which is also how <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> handles includes.
es: Otra forma, que en mi opini&oacute;n es mucho m&aacute;s limpia, es hacer una solicitud Ajax sincr&oacute;nica en lugar de usar una etiqueta <code>&lt;script&gt;</code> . Que tambi&eacute;n es c&oacute;mo incluye <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> maneja.
ja: もう1つの方法は、私の意見ではよりクリーンで、 <code>&lt;script&gt;</code> タグを使用する代わりに同期Ajaxリクエストを作成することです。 これは、 <a href="http://en.wikipedia.org/wiki/Node.js">Node.jsによる</a>インクルードの処理方法でもあります。
ko: 내 의견으로는 훨씬 깨끗하다는 또 다른 방법은 <code>&lt;script&gt;</code> 태그를 사용하는 대신 동기 Ajax 요청을하는 것입니다. <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> 가 include를 처리하는 방법도 있습니다.
ru: Другой способ, который, на мой взгляд, намного чище, - это сделать синхронный Ajax-запрос вместо использования <code>&lt;script&gt;</code> . К тому же, как обрабатывает <a href="http://en.wikipedia.org/wiki/Node.js">Node.js.</a>
zh_cn: 在我看来，更简洁的另一种方法是发出同步Ajax请求，而不使用 <code>&lt;script&gt;</code> 标签。 <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a>处理的内容也包括在内。

source: As mentioned at the top of this answer, many developers use build/transpilation tool(s) like Parcel, Webpack, or Babel in their projects, allowing them to use upcoming JavaScript syntax, provide backward compatibility for older browsers, combine files, minify, perform code splitting etc.
es: Como se mencionó en la parte superior de esta respuesta,muchos desarrolladores utilizan herramientas de construcción-transpilación como Parcel,Webpack o Babel en sus proyectos,lo que les permite utilizar la sintaxis del próximo JavaScript,proporcionar compatibilidad con versiones anteriores de navegadores antiguos,combinar archivos,minificar,realizar división de código,etc.
ja: この回答のトップで述べたように、多くの開発者はプロジェクトでParcel、Webpack、またはBabelのようなbuildtranspilationツールを使用しており、今後のJavaScriptの構文を使用したり、古いブラウザの下位互換性を提供したり、ファイルを結合したり、ミニ化したり、コード分割を実行したりすることができます。
ko: 이 답변의 맨 위에 언급했듯이 많은 개발자는 프로젝트에서 Parcel, Webpack 또는 Babel과 같은 빌드 / 번역 도구를 사용하여 향후 JavaScript 구문을 사용하고, 이전 브라우저에 대한 하위 호환성을 제공하고, 파일을 결합하고, 축소하고, 코드 분할 등을 수행하십시오.
ru: Как упоминалось в верхней части этого ответа,многие разработчики используют в своих проектах такие инструменты buildtranspilation,как Parcel,Webpack или Babel,что позволяет им использовать предстоящий синтаксис JavaScript,обеспечивать обратную совместимость для старых браузеров,объединять файлы,минимизировать,выполнять разбиение кода и т.д.
zh_cn: 正如本答案顶部提到的,许多开发者在他们的项目中使用了像Parcel、Webpack或Babel这样的buildtranspilation工具,允许他们使用即将到来的JavaScript语法,为旧的浏览器提供向后兼容,合并文件,最小化,执行代码拆分等。

source: As you saw, I had use a variable in one JavaScript file in another JavaScript file, but I didn't need to include one in another. I just needed to ensure that the first JavaScript file loaded before the second JavaScript file, and, the first JavaScript file's variables are accessible in the second JavaScript file, automatically.
es: Como viste,había usado una variable en un archivo de JavaScript en otro archivo de JavaScript,pero no necesitaba incluir una en otro.Sólo necesitaba asegurarme de que el primer archivo JavaScript cargado antes del segundo archivo JavaScript,y,las variables del primer archivo JavaScript son accesibles en el segundo archivo JavaScript,automáticamente.
ja: ご覧のように、ある JavaScript ファイルの変数を別の JavaScript ファイルで使用していましたが、別の JavaScript ファイルに変数を含める必要はありませんでした。最初の JavaScript ファイルが 2 番目の JavaScript ファイルよりも先に読み込まれ、最初の JavaScript ファイルの変数が 2 番目の JavaScript ファイルで自動的にアクセスできるようにする必要があっただけです。
ko: 보시다시피, 한 JavaScript 파일의 변수를 다른 JavaScript 파일의 변수를 사용했지만 다른 변수를 포함 할 필요는 없었습니다. 방금 첫 번째 JavaScript 파일이 두 번째 JavaScript 파일보다 먼저로드되고 첫 번째 JavaScript 파일의 변수에 두 번째 JavaScript 파일에서 자동으로 액세스 할 수 있는지 확인해야했습니다.
ru: Как вы видели,я использовал переменную в одном файле JavaScript в другом файле JavaScript,но мне не нужно было включать одну переменную в другой.Мне просто нужно было убедиться,что первый файл JavaScript загружается перед вторым файлом JavaScript,и переменные первого файла JavaScript автоматически становятся доступными во втором файле JavaScript.
zh_cn: 正如你所看到的,我在另一个JavaScript文件中使用了一个JavaScript文件中的变量,但我不需要在另一个JavaScript文件中包含一个变量。我只需要确保第一个JavaScript文件在第二个JavaScript文件之前加载,并且,第一个JavaScript文件的变量可以在第二个JavaScript文件中自动访问。

source: As you see, it's easier than Require.js and as convenient as jQuery's <code>$.getScript</code> method. It also has some advanced features, like conditional loading, feature detection and <a href="http://headjs.com/site/api/v1.00.html">much more</a>.
es: Como puede ver, es m&aacute;s f&aacute;cil que Require.js y tan conveniente como el m&eacute;todo <code>$.getScript</code> jQuery. Tambi&eacute;n tiene algunas funciones avanzadas, como carga condicional, detecci&oacute;n de funciones y <a href="http://headjs.com/site/api/v1.00.html">mucho m&aacute;s</a> .
ja: ご覧のとおり、これはRequire.jsよりも簡単で、jQueryの <code>$.getScript</code> メソッドと同じくらい便利です。 また、条件付き読み込み、機能検出などの高度な機能も備えて<a href="http://headjs.com/site/api/v1.00.html">います</a> 。
ko: 보시다시피 Require.js보다 쉽고 jQuery의 <code>$.getScript</code> 메소드만큼 편리합니다. 또한 조건부로드, 기능 감지 등과 같은 고급 기능도 있습니다.
ru: Как видите, это проще, чем Require.js, и так же удобно, как метод <code>$.getScript</code> jQuery. Он также имеет некоторые расширенные функции, такие как условная загрузка, обнаружение функций и <a href="http://headjs.com/site/api/v1.00.html">многое другое</a> .
zh_cn: 如您所见，它比Require.js更容易，并且与jQuery的 <code>$.getScript</code> 方法一样方便。 它还具有一些高级功能，例如条件加载，功能检测等。

source: Before calling <code>document.writeln</code>, it checks to make sure the script has not already been loading by evaluating all the script elements.
es: Antes de llamar a <code>document.writeln</code> , verifica para asegurarse de que el script no se haya cargado ya evaluando todos los elementos del script.
ja: <code>document.writeln</code> を呼び出す前に、すべてのスクリプト要素を評価して、スクリプトがまだ読み込まれていないことを確認します。
ko: <code>document.writeln</code> 을 호출하기 전에 모든 스크립트 요소를 평가하여 스크립트가 이미로드되지 않았는지 확인합니다.
ru: Перед вызовом <code>document.writeln</code> он проверяет, что скрипт еще не загружался, оценивая все элементы скрипта.
zh_cn: 在调用 <code>document.writeln</code> 之前，它将通过评估所有脚本元素来检查以确保尚未加载脚本。

source: Both of these solutions are discussed and illustrated in <a href="http://unixpapa.com/js/dyna.html">JavaScript Madness: Dynamic Script Loading</a>.
es: Ambas soluciones se analizan e ilustran en <a href="http://unixpapa.com/js/dyna.html">JavaScript Madness: Dynamic Script Loading</a> .
ja: これらのソリューションの両方については、「 <a href="http://unixpapa.com/js/dyna.html">JavaScriptマッドネス：動的スクリプト読み込み」で</a>説明されています 。
ko: 이러한 솔루션은 모두 <a href="http://unixpapa.com/js/dyna.html">JavaScript Madness : Dynamic Script Loading에 설명되어</a> 있습니다.
ru: Оба эти решения обсуждаются и иллюстрируются в <a href="http://unixpapa.com/js/dyna.html">JavaScript Madness: динамическая загрузка скриптов</a> .
zh_cn: 《 <a href="http://unixpapa.com/js/dyna.html">JavaScript Madness：动态脚本加载》</a>中讨论和说明了这两种解决方案。

source: Browsers do not support this moduling system yet so in order for you to use this syntax you must use a bundler like webpack. Using a bundler is better anyway because this can combine all of your different files into a single (or couple related) files. This will serve the files from the server to the client faster because each HTTP request has some associated overhead accompanied with it. Thus by reducing the overal HTTP request we improve the performance. Here is an example of ES6 modules:
es: Los navegadores aún no soportan este sistema de modulación,así que para poder usar esta sintaxis debes usar un paquete como el webpack.Usar un bundler es mejor de todas formas porque puede combinar todos tus diferentes archivos en uno solo (o un par de archivos relacionados).Esto servirá a los archivos del servidor al cliente más rápido porque cada petición HTTP tiene una sobrecarga asociada.Por lo tanto,al reducir la sobrecarga de las peticiones HTTP mejoramos el rendimiento.Aquí hay un ejemplo de módulos ES6:
ja: ブラウザはまだこのモジュリングシステムをサポートしていないので、この構文を使うためには webpack のようなバンドルラーを使わなければなりません。バンドルラーを使う方が良いでしょう。それぞれの HTTP リクエストはそれに付随していくつかの関連するオーバーヘッドを持っているので、これはサーバからクライアントへのファイルの配信をより速くします。このように、HTTPリクエストのオーバーヘッドを減らすことで、パフォーマンスを向上させることができます。ここにES6モジュールの例を示します。
ko: 브라우저는 아직이 변조 시스템을 지원하지 않으므로이 구문을 사용하려면 webpack과 같은 번 들러를 사용해야합니다. 번 들러를 사용하면 다른 모든 파일을 단일 (또는 커플 관련) 파일로 결합 할 수 있으므로 더 좋습니다. 각 HTTP 요청에는 이와 관련된 일부 오버 헤드가 있으므로 서버에서 클라이언트로 파일을 더 빨리 제공합니다. 따라서 전체 HTTP 요청을 줄임으로써 성능을 향상시킵니다. ES6 모듈의 예는 다음과 같습니다.
ru: Браузеры пока не поддерживают эту систему моделирования,поэтому для того,чтобы вы могли использовать этот синтаксис,вы должны использовать бундлер типа webpack.Использование связки лучше в любом случае,потому что это может объединить все ваши различные файлы в один (или пару связанных)файлы.Это позволит быстрее обслуживать файлы от сервера к клиенту,потому что каждый HTTP-запрос имеет некоторые связанные с ним накладные расходы.Таким образом,уменьшая комбинезон HTTP запрос мы улучшаем производительность.Вот пример модулей ES6:
zh_cn: 浏览器还不支持这个修改系统,所以为了让你使用这个语法,你必须使用像webpack这样的捆绑器。无论如何,使用捆绑器会更好,因为它可以将所有不同的文件组合成一个(或几个相关的)文件。这样可以更快地将文件从服务器上服务到客户端,因为每个HTTP请求都有一些相关的开销。因此,通过减少HTTP请求的开销,我们可以提高性能。下面是一个ES6模块的例子。

source: Browsers have had support for loading ECMAScript modules directly (no tools like Webpack required) <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">since</a> Safari 10.1, Chrome 61, Firefox 60, and Edge 16. Check the current support at <a href="https://caniuse.com/#feat=es6-module">caniuse</a>. There is no need to use Node.js' <code>.mjs</code> extension; browsers completely ignore file extensions on modules/scripts.
es: Los navegadores han tenido soporte para cargar m&oacute;dulos ECMAScript directamente (no se requieren herramientas como Webpack) <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">desde</a> Safari 10.1, Chrome 61, Firefox 60 y Edge 16. Verifique el soporte actual en <a href="https://caniuse.com/#feat=es6-module">caniuse</a> . No es necesario usar la extensi&oacute;n <code>.mjs</code> de Node.js; los navegadores ignoran por completo las extensiones de archivo en m&oacute;dulos / scripts.
ja: ブラウザは<a href="https://jakearchibald.com/2017/es-modules-in-browsers/">、</a> Safari 10.1、Chrome 61、Firefox 60、およびEdge 16 以降、 ECMAScriptモジュールの直接ロードをサポートしています（Webpackなどのツールは不要） <a href="https://caniuse.com/#feat=es6-module">。caniuseで</a>現在のサポートを確認してください。 Node.jsの <code>.mjs</code> 拡張子を使用する必要はありません。 ブラウザはモジュール/スクリプトのファイル拡張子を完全に無視します。
ko: 브라우저는 Safari 10.1, Chrome 61, Firefox 60 및 Edge 16 <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">이후</a> ECMAScript 모듈을 직접로드 할 수 있습니다 (웹팩과 같은 도구는 필요하지 않음). <a href="https://caniuse.com/#feat=es6-module">caniuse</a> 에서 현재 지원을 확인하십시오. Node.js의 <code>.mjs</code> 확장자를 사용할 필요는 없습니다. 브라우저는 모듈 / 스크립트의 파일 확장자를 완전히 무시합니다.
ru: Браузеры поддерживают загрузку модулей ECMAScript напрямую (не требуются такие инструменты, как Webpack), <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">начиная с</a> Safari 10.1, Chrome 61, Firefox 60 и Edge 16. Проверьте текущую поддержку в <a href="https://caniuse.com/#feat=es6-module">caniuse</a> . Нет необходимости использовать расширение Node.js <code>.mjs</code> ; браузеры полностью игнорируют расширения файлов в модулях / скриптах.
zh_cn: <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">自</a> Safari 10.1，Chrome 61，Firefox 60和Edge 16开始，浏览器已经支持直接加载ECMAScript模块（不需要像Webpack这样的工具）。请在<a href="https://caniuse.com/#feat=es6-module">caniuse上</a>查看当前支持。 无需使用Node.js的 <code>.mjs</code> 扩展名； 浏览器完全忽略模块/脚本上的文件扩展名。

source: But if that is not a problem for you, then this method should work.
es: Pero si eso no es un problema para ti,entonces este método debería funcionar.
ja: しかし、それが問題にならないのであれば、この方法はうまくいくはずです。
ko: 그러나 이것이 문제가되지 않으면이 방법이 효과적입니다.
ru: Но если для вас это не проблема,то этот метод должен сработать.
zh_cn: 但如果这对你来说不是问题,那么这个方法应该是可行的。
