Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: When the additional files are loaded the <code>document.ready</code> callbacks will get executed in the wrong order. To address this when a script is actually loaded, the script that imported it is re-imported itself and execution halted. This causes the originating file to now have its <code>document.ready</code> callback executed after any from any scripts that it imports.
es: Cuando se cargan los archivos adicionales, las devoluciones de llamada <code>document.ready</code> se ejecutar&aacute;n en el orden incorrecto. Para abordar esto cuando un script se carga realmente, el script que lo import&oacute; se vuelve a importar y la ejecuci&oacute;n se detiene. Esto hace que el archivo de origen ahora tenga su devoluci&oacute;n de llamada <code>document.ready</code> ejecutada despu&eacute;s de cualquiera de los scripts que importa.
ja: 追加のファイルがロードされると、 <code>document.ready</code> コールバックが間違った順序で実行されます。 スクリプトが実際にロードされたときにこれに対処するために、スクリプトをインポートしたスクリプト自体が再インポートされ、実行が停止します。 これにより、元のファイルは、それがインポートするスクリプトから実行された後に <code>document.ready</code> コールバックが実行されるようになります。
ko: 추가 파일이로드되면 <code>document.ready</code> 콜백이 잘못된 순서로 실행됩니다. 스크립트가 실제로로드 될 때이 문제를 해결하기 위해 스크립트를 가져온 스크립트를 다시 가져 와서 실행을 중지합니다. 이로 인해 원래 파일이 가져 오는 스크립트에서 <code>document.ready</code> 콜백을 실행합니다.
ru: Когда дополнительные файлы загружены, обратные вызовы <code>document.ready</code> будут выполняться в неправильном порядке. Чтобы решить эту проблему, когда скрипт действительно загружен, импортированный скрипт сам реимпортируется и выполнение останавливается. Это приводит к тому, что для исходного файла теперь выполняется обратный вызов <code>document.ready</code> после любого из любых сценариев, которые он импортирует.
zh_cn: 加载其他文件时， <code>document.ready</code> 回调将以错误的顺序执行。 为了在实际加载脚本时解决此问题，请重新导入导入脚本的脚本，并暂停执行。 这将导致原始文件现在从其导入的任何脚本中执行了 <code>document.ready</code> 回调。

source: You are right when you say that you could specify Ajax to run synchronously or use <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a>, but the current trend appears to be to deprecate synchronous requests, so you may not get full browser support now or in the future.
es: Tiene raz&oacute;n cuando dice que podr&iacute;a especificar que Ajax se ejecute sincr&oacute;nicamente o usar <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a> , pero parece que la tendencia actual es desaprobar las solicitudes sincr&oacute;nicas, por lo que es posible que no obtenga soporte completo del navegador ahora o en el futuro.
ja: Ajaxを同期的に実行するか<a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequestを</a>使用するように指定できると言ったのはあなたの言うとおりですが、現在の傾向は同期リクエストを非推奨にする傾向があるため、現在または将来、完全なブラウザーサポートが得られない可能性があります。
ko: Ajax를 지정하여 동기식으로 실행하거나 <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest를</a> 사용할 수 있다고 말하면 맞지만 현재 추세는 동기식 요청을 더 이상 사용하지 않는 것으로 보이므로 현재 또는 미래에 전체 브라우저를 지원하지 않을 수 있습니다.
ru: Вы правы, когда говорите, что можете указать, что Ajax будет работать синхронно или использовать <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a> , но в настоящее время наблюдается тенденция отклонять синхронные запросы, поэтому вы можете не получить полную поддержку браузера сейчас или в будущем.
zh_cn: 说对了，您可以指定Ajax同步运行或使用<a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a> ，这是对的，但是当前的趋势似乎是弃用同步请求，因此您现在或将来可能无法获得完整的浏览器支持。

source: You can also assemble your scripts using <a href="http://en.wikipedia.org/wiki/PHP">PHP</a>:
es: Tambi&eacute;n puede ensamblar sus scripts usando <a href="http://en.wikipedia.org/wiki/PHP">PHP</a> :
ja: <a href="http://en.wikipedia.org/wiki/PHP">PHP</a>を使用してスクリプトをアセンブルすることもできます。
ko: <a href="http://en.wikipedia.org/wiki/PHP">PHP</a> 를 사용하여 스크립트를 어셈블 할 수도 있습니다.
ru: Вы также можете собрать свои скрипты, используя <a href="http://en.wikipedia.org/wiki/PHP">PHP</a> :
zh_cn: 您也可以使用<a href="http://en.wikipedia.org/wiki/PHP">PHP</a>汇编脚本：

source: You can of course use $ ("body").append(), but then you can no longer debug correctly any more.
es: Por supuesto,puedes usar $ ("body").append(),pero entonces ya no podrás depurar correctamente.
ja: もちろん $ ("body").append()を使うこともできますが、そうするともう正しくデバッグできなくなってしまいます。
ko: 물론 $ ( "body"). append ()를 사용할 수 있지만 더 이상 더 이상 올바르게 디버깅 할 수 없습니다.
ru: Вы,конечно,можете использовать $ ("body").append(),но тогда вы больше не сможете корректно отлаживать.
zh_cn: 当然你可以使用$("body").append(),但这样一来,你就不能再正确地调试了。

source: You can then use it in your code as you'd usually use an include:
es: Entonces puedes usarlo en tu código como normalmente lo harías con un include:
ja: そして、通常インクルードを使用するようにコードの中でそれを使用することができます。
ko: 그런 다음 일반적으로 include를 사용할 때 코드에서 사용할 수 있습니다.
ru: Затем вы можете использовать его в своем коде,как вы обычно используете включенную версию:
zh_cn: 然后你可以在你的代码中使用它,因为你通常会使用一个include。

source: You can write your JavaScript files in "modules" and then reference them as dependencies in other scripts. Or you can use RequireJS as a simple "go get this script" solution.
es: Puedes escribir tus archivos JavaScript en "módulos" y luego referirte a ellos como dependencias en otros scripts.O puedes usar RequireJS como una simple solución "ve a buscar este script".
ja: JavaScriptファイルを「モジュール」に書き、他のスクリプトの依存関係として参照することができます。あるいは、単純な「このスクリプトを取りに行く」ソリューションとして RequireJS を使用することもできます。
ko: JavaScript 파일을 "모듈"로 작성한 다음 다른 스크립트에서 종속성으로 참조 할 수 있습니다. 또는 RequireJS를 간단한 "이 스크립트 가져 오기"솔루션으로 사용할 수 있습니다.
ru: Вы можете записывать свои JavaScript-файлы в "модули",а затем ссылаться на них как на зависимости в других скриптах.Или вы можете использовать RequireJS в качестве простого решения "go get this script".
zh_cn: 你可以把你的JavaScript文件写成 "modules",然后在其他脚本中作为依赖关系引用。或者你可以使用 RequireJS 作为一个简单的 "去获取这个脚本 "的解决方案。

source: You could add a script tag with the script URL into the HTML. To avoid the overhead of jQuery, this is an ideal solution.
es: Podrías añadir una etiqueta de guión con la URL del guión en el HTML.Para evitar la sobrecarga de jQuery,esta es una solución ideal.
ja: HTMLの中にスクリプトのURLが記載されたscriptタグを追加すればいいのです。jQueryのオーバーヘッドを避けるためには、これが理想的な解決策です。
ko: 스크립트 URL이있는 스크립트 태그를 HTML에 추가 할 수 있습니다. jQuery의 오버 헤드를 피하기 위해 이상적인 솔루션입니다.
ru: Вы можете добавить тег скрипта с URL скрипта в HTML.Чтобы избежать накладных расходов jQuery,это идеальное решение.
zh_cn: 你可以在HTML中添加一个带有脚本URL的脚本标签。为了避免jQuery的开销,这是一个理想的解决方案。

source: You could load an additional script with an AJAX call and then use <code>eval</code> to run it. This is the most straightforward way, but it is limited to your domain because of the JavaScript sandbox security model. Using <code>eval</code> also opens the door to bugs, hacks and security issues.
es: Puede cargar un script adicional con una llamada AJAX y luego usar <code>eval</code> para ejecutarlo. Esta es la forma m&aacute;s directa, pero est&aacute; limitada a su dominio debido al modelo de seguridad de sandbox de JavaScript. El uso de <code>eval</code> tambi&eacute;n abre la puerta a errores, hacks y problemas de seguridad.
ja: AJAX呼び出しで追加のスクリプトをロードし、 <code>eval</code> を使用してそれを実行できます。 これは最も簡単な方法ですが、JavaScriptサンドボックスセキュリティモデルのため、ドメインに限定されます。 <code>eval</code> を使用すると、バグ、ハッキング、セキュリティの問題への扉も開きます。
ko: AJAX 호출로 추가 스크립트를로드 한 다음 <code>eval</code> 을 사용하여 실행할 수 있습니다. 이는 가장 간단한 방법이지만 JavaScript 샌드 박스 보안 모델로 인해 도메인으로 제한됩니다. <code>eval</code> 을 사용하면 버그, 해킹 및 보안 문제가 발생할 수 있습니다.
ru: Вы можете загрузить дополнительный скрипт с помощью вызова AJAX, а затем использовать <code>eval</code> для его запуска. Это самый простой способ, но он ограничен вашим доменом из-за модели безопасности песочницы JavaScript. Использование <code>eval</code> также открывает путь к ошибкам, взломам и проблемам безопасности.
zh_cn: 您可以使用AJAX调用加载其他脚本，然后使用 <code>eval</code> 运行它。 这是最直接的方法，但是由于JavaScript沙箱安全模型，它仅限于您的域。 使用 <code>eval</code> 还打开了漏洞，黑客和安全问题的大门。

source: You could try to use <code>$.when</code> to check an array of deferred objects, but now you are doing this in every file and file2 will be considered loaded as soon as the <code>$.when</code> is executed not when the callback is executed, so file1 still continues execution before file3 is loaded. This really still has the same problem.
es: Podr&iacute;a intentar usar <code>$.when</code> para verificar una matriz de objetos diferidos, pero ahora lo est&aacute; haciendo en cada archivo y el archivo2 se considerar&aacute; cargado tan pronto como se ejecute <code>$.when</code> se ejecuta la devoluci&oacute;n de llamada, por lo que el archivo1 todav&iacute;a contin&uacute;a la ejecuci&oacute;n antes de cargar el archivo 3. Esto realmente todav&iacute;a tiene el mismo problema.
ja: <code>$.when</code> を使用して据え置きオブジェクトの配列をチェックすることもできますが、これをすべてのファイルで実行すると、コールバックが実行されたときではなく、 <code>$.when</code> が実行されるとすぐにfile2がロードされたと見なされるため、file1はまだfile3がロードされる前に実行を継続します。 これにはまだ同じ問題があります。
ko: 지연된 객체의 배열을 확인하기 위해 <code>$.when</code> 을 사용하려고 시도 할 수 있지만 이제는 모든 파일 에서이 작업을 수행하고 콜백이 실행될 때가 아니라 <code>$.when</code> 이 실행되는 즉시 file2 가로 드 된 것으로 간주되므로 file1은 여전히 file3이로드되기 전에 실행을 계속합니다. 이것은 여전히 ​​똑같은 문제가 있습니다.
ru: Вы можете попытаться использовать <code>$.when</code> для проверки массива отложенных объектов, но теперь вы делаете это в каждом файле, и file2 будет считаться загруженным, как только <code>$.when</code> будет выполнен, а не при выполнении обратного вызова, поэтому file1 по-прежнему продолжает выполнение до загрузки file3. Это действительно до сих пор та же проблема.
zh_cn: 您可以尝试使用 <code>$.when</code> 检查延迟对象的数组，但是现在您正在每个文件中执行此操作，并且 <code>$.when</code> 在执行时（而不是在执行回调时）将被视为立即加载file2 。在加载file3之前继续执行。 这确实仍然存在相同的问题。

source: You just need to be careful when you are including scripts in an HTML file. The order should be as in below:
es: Sólo tienes que tener cuidado cuando incluyas scripts en un archivo HTML.El orden debe ser el siguiente:
ja: ただ、HTMLファイルの中にスクリプトを含める場合は注意が必要です。順番は以下のようにしてください。
ko: HTML 파일에 스크립트를 포함시킬 때주의해야합니다. 순서는 다음과 같아야합니다.
ru: Вам просто нужно быть осторожным,когда вы включаете скрипты в HTML-файл.Порядок должен быть таким,как указано ниже:
zh_cn: 你只需要在HTML文件中包含脚本的时候要注意。顺序应该如下图所示。

source: You need to use <code>jQuery.append()</code> on the <code>&lt;head&gt;</code> element of your page, that is:
es: <code>jQuery.append()</code> usar jQuery.append () en el elemento <code>&lt;head&gt;</code> de su p&aacute;gina, es decir:
ja: ページの <code>&lt;head&gt;</code> 要素で <code>jQuery.append()</code> を使用する必要があります。
ko: 페이지의 <code>&lt;head&gt;</code> 요소에서 <code>jQuery.append()</code> 를 사용해야합니다.
ru: Вам необходимо использовать <code>jQuery.append()</code> в элементе <code>&lt;head&gt;</code> вашей страницы, то есть:
zh_cn: 您需要在页面的 <code>&lt;head&gt;</code> 元素上使用 <code>jQuery.append()</code> ，即：

source: You simply have to write <code>import cond from 'cond.js';</code> to load a macro named <code>cond</code> from a file <code>cond.js</code>.
es: Simplemente tiene que escribir <code>import cond from 'cond.js';</code> cargar una macro llamada <code>cond</code> desde un archivo <code>cond.js</code> .
ja: <code>import cond from 'cond.js';</code> を記述するだけです。 <code>cond</code> という名前のマクロをファイル <code>cond.js</code> からロードします。
ko: <code>import cond from 'cond.js';</code> 를 작성하면됩니다 . <code>cond.js</code> 파일에서 <code>cond</code> 라는 매크로를로드합니다.
ru: Вы просто должны написать <code>import cond from 'cond.js';</code> загрузить макрос с именем <code>cond</code> из файла <code>cond.js</code> .
zh_cn: 您只需 <code>import cond from 'cond.js';</code> 编写import cond； 从文件 <code>cond.js</code> 加载名为 <code>cond</code> 的宏。

source: jQuery Loading
ja: jQueryの読み込み
ko: jQuery 로딩
ru: запрос Загрузка
zh_cn: jQuery加载

source: plugins.js will have an array called <code>pluginNames[]</code> that we will iterate over <code>each()</code>, then append a <code>&lt;script&gt;</code> tag to the head for each plugin
es: plugins.js tendr&aacute; una matriz llamada <code>pluginNames[]</code> que iteraremos sobre <code>each()</code> , luego agregaremos una etiqueta <code>&lt;script&gt;</code> a la cabeza de cada complemento
ja: plugins.jsには、 <code>pluginNames[]</code> と呼ばれる配列があり、 <code>each()</code> を反復処理してから、各プラグインのヘッドに <code>&lt;script&gt;</code> タグを追加します
ko: plugins.js는 <code>pluginNames[]</code> 라는 배열을 가지게되는데 우리는 <code>each()</code> 반복하고 각 플러그인의 헤드에 <code>&lt;script&gt;</code> 태그를 추가합니다
ru: У plugins.js будет массив с именем <code>pluginNames[]</code> который мы будем повторять для <code>each()</code> , а затем добавляем <code>&lt;script&gt;</code> к заголовку для каждого плагина.
zh_cn: plugins.js将具有一个名为 <code>pluginNames[]</code> 的数组，我们将在 <code>each()</code> 上进行迭代，然后在每个插件的头部添加 <code>&lt;script&gt;</code> 标记
