Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I decided to go backwards instead of forwards. Thank you <code>document.writeln</code>. I know it's taboo, but as long as it is used correctly this works well. You end up with code that can be debugged easily, shows in the DOM correctly and can ensure the order the dependencies are loaded correctly.
es: Decid&iacute; ir hacia atr&aacute;s en lugar de hacia adelante. Gracias <code>document.writeln</code> . S&eacute; que es tab&uacute;, pero siempre que se use correctamente, esto funciona bien. Termina con un c&oacute;digo que se puede depurar f&aacute;cilmente, se muestra en el DOM correctamente y puede garantizar el orden en que las dependencias se cargan correctamente.
ja: 前進ではなく後退することにしました。 <code>document.writeln</code> に感謝します。 私はそれがタブーであることを知っていますが、それが正しく使用されている限り、これはうまく機能します。 簡単にデバッグできるコードができ、DOMに正しく表示され、依存関係が正しく読み込まれる順序を確認できます。
ko: 나는 앞으로가 아니라 뒤로 가기로 결정했습니다. <code>document.writeln</code> 감사합니다. 나는 그것이 금기임을 알고 있지만 올바르게 사용되는 한 잘 작동합니다. 결국 쉽게 디버깅 할 수 있고 DOM에 올바르게 표시되고 종속성이 올바르게로드되는 순서를 보장 할 수있는 코드로 끝납니다.
ru: Я решил идти назад, а не вперед. Спасибо <code>document.writeln</code> . Я знаю, что это табу, но при правильном использовании это работает хорошо. Вы получите код, который можно легко отладить, правильно отобразить в DOM и убедиться, что зависимости загружены правильно.
zh_cn: 我决定后退而不是前进。 谢谢 <code>document.writeln</code> 。 我知道这是忌讳的，但是只要正确使用它就可以了。 您最终得到的代码可以轻松调试，可以在DOM中正确显示，并且可以确保正确加载依赖项的顺序。

source: I had a simple issue, but I was baffled by responses to this question.
es: Tenía un asunto sencillo,pero me desconcertaron las respuestas a esta pregunta.
ja: 簡単な問題なのですが、この問題に対する回答に困惑してしまいました。
ko: 나는 간단한 문제가 있었지만이 질문에 대한 답변으로 당황했다.
ru: У меня был простой вопрос,но я был озадачен ответами на этот вопрос.
zh_cn: 我有一个很简单的问题,但对这个问题的回答让我百思不得其解。

source: I had to use a variable (myVar1) defined in one JavaScript file (myvariables.js) in another JavaScript file (main.js).
es: Tuve que usar una variable (miVar1)definida en un archivo JavaScript (myvariables.js)en otro archivo JavaScript (main.js).
ja: あるJavaScriptファイル(myvariables.js)で定義された変数(myVar1)を別のJavaScriptファイル(main.js)で使用しなければなりませんでした。
ko: 한 JavaScript 파일 (myvariables.js)에 정의 된 변수 (myVar1)를 다른 JavaScript 파일 (main.js)을 사용해야했습니다.
ru: Я должен был использовать переменную (myVar1),определенную в одном файле JavaScript (myvariables.js)в другом файле JavaScript (main.js).
zh_cn: 我不得不在另一个JavaScript文件(main.js)中使用一个JavaScript文件(myvariables.js)中定义的变量(myVar1)。

source: I have actually written a jQuery plugin called <em>$.import_js()</em> which uses this method:
es: De hecho, he escrito un complemento jQuery llamado <em>$ .import_js ()</em> que usa este m&eacute;todo:
ja: 私は実際に、このメソッドを使用する<em>$ .import_js（）</em>というjQueryプラグインを作成しました。
ko: 실제로이 방법을 사용하는 <em>$ .import_js ()</em> 라는 jQuery 플러그인을 작성했습니다.
ru: На самом деле я написал плагин jQuery с именем <em>$ .import_js (),</em> который использует этот метод:
zh_cn: 我实际上已经编写了一个名为<em>$ .import_js（）</em>的jQuery插件，它使用此方法：

source: I just wrote this JavaScript code (using <a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">Prototype</a> for <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> manipulation):
es: Acabo de escribir este c&oacute;digo JavaScript (usando <a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">Prototype</a> para la manipulaci&oacute;n <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> ):
ja: 私はこのJavaScriptコードを記述しました（ <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a>操作に<a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">Prototype</a>を使用）。
ko: 방금이 JavaScript 코드를 작성했습니다 ( <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> 조작에 <a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">프로토 타입</a> 사용).
ru: Я только что написал этот код JavaScript (используя <a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">Prototype</a> для манипулирования <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> ):
zh_cn: 我刚刚编写了以下JavaScript代码（使用<a href="http://en.wikipedia.org/wiki/Prototype_JavaScript_Framework">Prototype</a>进行<a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a>操作）：

source: I liked the idea of extending jQuery, but obviously you don't need to.
es: Me gustó la idea de extender jQuery,pero obviamente no es necesario.
ja: jQueryを拡張するというアイデアは好きでしたが、明らかにその必要はありません。
ko: jQuery를 확장한다는 아이디어가 마음에 들었지만 반드시 그럴 필요는 없습니다.
ru: Мне понравилась идея расширить JQuery,но,очевидно,в этом нет необходимости.
zh_cn: 我喜欢扩展jQuery的想法,但显然你不需要这样做。

source: I use <a href="https://github.com/sstephenson/sprockets">Sprockets</a> (I don't know if there are others). You build your JavaScript code in separate files and include comments that are processed by the Sprockets engine as includes. For development you can include files sequentially, then for production to merge them...
es: Yo uso <a href="https://github.com/sstephenson/sprockets">Sprockets</a> (no s&eacute; si hay otros). Construye su c&oacute;digo JavaScript en archivos separados e incluye comentarios procesados ​​por el motor Sprockets como incluye. Para el desarrollo, puede incluir archivos secuencialmente, luego, para la producci&oacute;n, fusionarlos ...
ja: 私は<a href="https://github.com/sstephenson/sprockets">スプロケット</a>を使用しています（他にあるかどうかはわかりません）。 JavaScriptコードを個別のファイルで作成し、Sprocketsエンジンで処理されるコメントをインクルードとして含めます。 開発の場合、ファイルを順番にインクルードし、本番の場合はマージすることができます...
ko: 나는 <a href="https://github.com/sstephenson/sprockets">스프로킷을</a> 사용합니다 (다른 것이 있는지 모르겠습니다). 별도의 파일로 JavaScript 코드를 작성하고 Sprockets 엔진에서 처리 한 주석을 포함으로 포함합니다. 개발을 위해 파일을 순차적으로 포함시킨 다음 프로덕션 환경에서 파일을 병합 할 수 있습니다.
ru: Я использую <a href="https://github.com/sstephenson/sprockets">Звездочки</a> (я не знаю, есть ли другие). Вы строите свой код JavaScript в отдельных файлах и включаете комментарии, которые обрабатываются механизмом Sprockets, как и включенные. Для разработки вы можете включить файлы последовательно, а затем для производства, чтобы объединить их ...
zh_cn: 我使用<a href="https://github.com/sstephenson/sprockets">链轮</a> （我不知道是否还有其他链轮 ）。 您将JavaScript代码构建在单独的文件中，并包含由Sprockets引擎处理的注释（包括）。 对于开发，您可以依次包含文件，然后在生产中将它们合并...

source: I wrote a simple module that automates the job of importing/including module scripts in JavaScript. For detailed explanation of the code, refer to the blog post <em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / include modules</a></em>.
es: Escrib&iacute; un m&oacute;dulo simple que automatiza el trabajo de importar / incluir scripts de m&oacute;dulos en JavaScript. Para obtener una explicaci&oacute;n detallada del c&oacute;digo, consulte la publicaci&oacute;n de blog <em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / include modules</a></em> .
ja: JavaScriptでモジュールスクリプトをインポート/インクルードする作業を自動化する簡単なモジュールを書きました。 コードの詳細な説明については、ブログ投稿<em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / includeモジュールを</a></em>参照してください。
ko: JavaScript로 모듈 스크립트 가져 오기 / 포함 작업을 자동화하는 간단한 모듈을 작성했습니다. 코드에 대한 자세한 설명은 블로그 게시물 <em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / include 모듈을</a></em> 참조하십시오.
ru: Я написал простой модуль, который автоматизирует работу по импорту / включению скриптов модуля в JavaScript. Для подробного объяснения кода, обратитесь к сообщению блога <em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / include modules</a></em> .
zh_cn: 我编写了一个简单的模块，该模块可以自动执行导入/包含JavaScript中的模块脚本的工作。 有关代码的详细说明，请参阅博客文章<em><a href="http://stamat.wordpress.com/2013/04/12/javascript-require-import-include-modules/">JavaScript require / import / include modules</a></em> 。

source: I've found it's more reliable to just write the script tags in a PHP include. You only have to write it once and that's just as much work as calling the plugin using JavaScript.
es: He descubierto que es más fiable escribir las etiquetas de los scripts en un include PHP.Sólo tienes que escribirlo una vez y eso es tanto trabajo como llamar al plugin usando JavaScript.
ja: PHPのインクルードでスクリプトタグを書くだけの方が信頼性が高いことがわかりました。一度だけ書く必要がありますし、JavaScriptを使ってプラグインを呼び出すのと同じくらいの作業です。
ko: PHP include에 스크립트 태그를 작성하는 것이 더 안정적이라는 것을 알았습니다. 한 번만 작성하면 JavaScript를 사용하여 플러그인을 호출하는 것만큼이나 효과적입니다.
ru: Я нашел более надежным просто написать теги скрипта в PHP include.Вы должны написать его только один раз,и это такая же работа,как вызов плагина с помощью JavaScript.
zh_cn: 我发现直接在PHP include中写脚本标记更可靠。你只需要写一次就可以了,这和用JavaScript调用插件一样多。

source: If anyone is looking for something more advanced, try out <a href="http://requirejs.org/">RequireJS</a>. You'll get added benefits such as dependency management, better concurrency, and avoid duplication (that is, retrieving a script more than once).
es: Si alguien est&aacute; buscando algo m&aacute;s avanzado, pruebe <a href="http://requirejs.org/">RequireJS</a> . Obtendr&aacute; beneficios adicionales como la administraci&oacute;n de dependencias, una mejor concurrencia y evitar&aacute; la duplicaci&oacute;n (es decir, recuperar un script m&aacute;s de una vez).
ja: 誰かがより高度なものを探している場合は、 <a href="http://requirejs.org/">RequireJSを</a>試してください 。 依存関係の管理、同時実行性の向上、重複の回避（スクリプトの複数回の取得）などの追加のメリットが得られます。
ko: 더 진보 된 것을 찾는 사람이라면 <a href="http://requirejs.org/">RequireJS를</a> 사용해보십시오. 종속성 관리, 동시성 향상 및 복제 방지 (스크립트를 두 번 이상 검색)와 같은 추가 이점을 얻을 수 있습니다.
ru: Если кто-то ищет что-то более продвинутое, попробуйте <a href="http://requirejs.org/">RequireJS</a> . Вы получите дополнительные преимущества, такие как управление зависимостями, улучшенный параллелизм и избежание дублирования (то есть получение сценария более одного раза).
zh_cn: 如果有人在寻找更高级的东西，请尝试<a href="http://requirejs.org/">RequireJS</a> 。 您将获得诸如依赖管理，更好的并发性和避免重复（即，多次检索脚本）之类的好处。

source: If it works for Facebook, it will work for you.
es: Si funciona para Facebook,funcionará para ti.
ja: Facebookで効果があれば、あなたにも効果があるでしょう。
ko: Facebook에서 작동하면 효과가 있습니다.
ru: Если это сработает на Facebook,то сработает и на вас.
zh_cn: 如果它对Facebook有效,那么它也会对你有效。

source: If script2 requires script1, this really is the absolute easiest way to do something like this. I'm very surprised no-one has brought this up, as it's the most obvious and simplest answer that will apply in nearly every single case.
es: Si el guión 2 requiere el guión 1,esta es la forma más fácil de hacer algo así.Me sorprende mucho que nadie lo haya mencionado,ya que es la respuesta más obvia y simple que se aplicará en casi todos los casos.
ja: script2 が script1 を必要とする場合、このようなことを行うには本当に最も簡単な方法です。これは、ほとんどすべての場合に適用される最も明白で最も単純な答えなので、誰もこれを持ち出さなかったことに非常に驚いています。
ko: script2에 script1이 필요한 경우 실제로 이와 같은 작업을 수행하는 가장 쉬운 방법입니다. 거의 모든 경우에 적용되는 가장 분명하고 간단한 답변이기 때문에 아무도 이것을 제기하지 않은 것에 매우 놀랐습니다.
ru: Если script2 требует script1,то это действительно самый простой способ сделать что-то подобное.Я очень удивлен,что никто не поднимал эту тему,так как это самый очевидный и простой ответ,который будет применяться почти в каждом отдельном случае.
zh_cn: 如果script2需要script1,这真的是最简单的方法。我很惊讶没有人提出这个问题,因为这是最明显、最简单的答案,几乎适用于每一种情况。

source: If you use the jQuery library, you can use the <code>$.getScript</code> method.
es: Si usa la biblioteca jQuery, puede usar el m&eacute;todo <code>$.getScript</code> .
ja: jQueryライブラリを使用する場合は、 <code>$.getScript</code> 。 getScriptメソッドを使用できます。
ko: jQuery 라이브러리를 사용하는 경우 <code>$.getScript</code> 메소드를 사용할 수 있습니다.
ru: Если вы используете библиотеку jQuery, вы можете использовать метод <code>$.getScript</code> .
zh_cn: 如果使用jQuery库，则可以使用 <code>$.getScript</code> 方法。

source: If you want in pure JavaScript, you can use <code>document.write</code>.
es: Si lo desea en JavaScript puro, puede usar <code>document.write</code> .
ja: 純粋なJavaScriptが必要な場合は、 <code>document.write</code> を使用できます。
ko: 순수한 JavaScript로 원한다면 <code>document.write</code> 를 사용할 수 있습니다.
ru: Если вы хотите в чистом JavaScript, вы можете использовать <code>document.write</code> .
zh_cn: 如果要使用纯JavaScript，则可以使用 <code>document.write</code> 。

source: If your intention to load the JavaScript file is <strong>using the functions from the imported/included file</strong>, you can also define a global object and set the functions as object items. For instance:
es: Si su intenci&oacute;n de cargar el archivo JavaScript est&aacute; <strong>utilizando las funciones del archivo importado / incluido</strong> , tambi&eacute;n puede definir un objeto global y establecer las funciones como elementos de objeto. Por ejemplo:
ja: JavaScriptファイルをロードする意図が<strong>インポート/インクルードファイルの関数を使用している</strong>場合は、グローバルオブジェクトを定義し、関数をオブジェクトアイテムとして設定することもできます。 例えば：
ko: JavaScript 파일을로드하려는 의도가 가져 오기 <strong>/ 포함 파일의 함수를 사용하는</strong> 경우 전역 오브젝트를 정의하고 함수를 오브젝트 항목으로 설정할 수도 있습니다. 예를 들어 :
ru: Если ваше намерение загрузить файл JavaScript <strong>использует функции из импортированного / включенного файла</strong> , вы также можете определить глобальный объект и установить функции в качестве элементов объекта. Например:
zh_cn: 如果要加载JavaScript文件的目的是<strong>使用导入/包含的文件中的函数</strong> ，则还可以定义一个全局对象并将这些函数设置为对象项。 例如：

source: In case you are using <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">Web Workers</a> and want to include additional scripts in the scope of the worker, the other answers provided about adding scripts to the <code>head</code> tag, etc. will not work for you.
es: En caso de que est&eacute; utilizando <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">Web Workers</a> y desee incluir scripts adicionales en el alcance del trabajador, las otras respuestas proporcionadas sobre la adici&oacute;n de scripts a la etiqueta de <code>head</code> , etc., no funcionar&aacute;n para usted.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">Webワーカー</a>を使用していて、ワーカーのスコープに追加のスクリプトを含めたい場合、ヘッドタグへのスクリプトの追加などについて提供されている他の回答は機能しません。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">웹 워커를</a> 사용 중이고 워커 범위에 추가 스크립트를 포함하려는 경우 <code>head</code> 태그에 스크립트를 추가하는 등의 다른 답변은 작동하지 않습니다.
ru: Если вы используете <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">Web Workers</a> и хотите включить в область работника дополнительные сценарии, другие ответы о добавлении сценариев в тег <code>head</code> и т. Д. Не будут работать для вас.
zh_cn: 如果您使用的是<a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">Web</a> Worker，并且希望在worker范围内包括其他脚本，则其他有关将脚本添加到 <code>head</code> 标签等的答案将对您不起作用。

source: In modern language with the check if script has already been loaded it would be:
es: En lenguaje moderno con la comprobación de si el guión ya ha sido cargado sería:
ja: スクリプトがすでに読み込まれているかどうかをチェックする現代の言語ではそうなります。
ko: 스크립트가 이미로드되어 있는지 확인하는 현대 언어에서는 다음과 같습니다.
ru: В современном языке с проверкой,загружен ли уже скрипт,это было бы:
zh_cn: 在现代语言中,如果脚本已经加载了,那么在检查脚本是否已被加载的情况下,它将是。

source: Instead of this approach you could attempt to modify the jQuery <code>readyList</code>, but this seemed like a worse solution.
es: En lugar de este enfoque, podr&iacute;a intentar modificar jQuery <code>readyList</code> , pero esto parec&iacute;a una soluci&oacute;n peor.
ja: このアプローチの代わりに、jQuery <code>readyList</code> を変更することもできますが、これはより悪い解決策のように見えました。
ko: 이 접근법 대신 jQuery <code>readyList</code> 를 수정하려고 시도 할 수는 있지만 더 나쁜 해결책 인 것 같습니다.
ru: Вместо этого вы можете попытаться изменить <code>readyList</code> список jQuery, но это выглядит как худшее решение.
zh_cn: 代替这种方法，您可以尝试修改jQuery <code>readyList</code> ，但这似乎是一个较差的解决方案。

source: Is there something in JavaScript similar to <code>@import</code> in CSS that allows you to include a JavaScript file inside another JavaScript file?
es: &iquest;Hay algo en JavaScript similar a <code>@import</code> en CSS que le permita incluir un archivo JavaScript dentro de otro archivo JavaScript?
ja: JavaScriptに、CSSの <code>@import</code> のようなもので、JavaScriptファイルを別のJavaScriptファイル内に含めることができるものはありますか？
ko: JavaScript의 <code>@import</code> 와 비슷한 JavaScript에 다른 JavaScript 파일 내에 JavaScript 파일을 포함시킬 수있는 것이 있습니까?
ru: Есть ли в JavaScript что-то похожее на <code>@import</code> в CSS, что позволяет включать файл JavaScript в другой файл JavaScript?
zh_cn: JavaScript中是否有类似于CSS中 <code>@import</code> 的内容，可让您在另一个JavaScript文件中包含一个JavaScript文件？

source: It includes a <code>main.js</code> file in the main HTML and then the script in <code>main.js</code> uses <code>$.import_js()</code> to import an additional file called <code>included.js</code>, which defines this function:
es: Incluye un archivo <code>main.js</code> en el HTML principal y luego el script en <code>main.js</code> usa <code>$.import_js()</code> para importar un archivo adicional llamado <code>included.js</code> , que define esta funci&oacute;n:
ja: メインHTMLに <code>main.js</code> ファイルが含まれていて、 main.jsのスクリプトは <code>$.import_js()</code> を使用し <code>included.js</code> 、この関数を定義するincluded.jsという追加のファイルをインポートします。
ko: 기본 HTML에 <code>main.js</code> 파일이 포함 된 다음 <code>main.js</code> 의 스크립트는 <code>$.import_js()</code> 를 사용하여 다음 함수를 정의하는 <code>included.js</code> 라는 추가 파일을 가져옵니다.
ru: Он включает файл <code>main.js</code> в основной HTML, а затем сценарий в <code>main.js</code> использует <code>$.import_js()</code> для импорта дополнительного файла с именем includes.js , который определяет эту функцию:
zh_cn: 它在主HTML中包含一个 <code>main.js</code> 文件，然后 <code>main.js</code> 中的脚本使用 <code>$.import_js()</code> 导入一个名为include.js的附加文件，该文件定义了此功能：

source: It is possible to dynamically generate a JavaScript tag and append it to HTML document from inside other JavaScript code. This will load targeted JavaScript file.
es: Es posible generar dinámicamente una etiqueta de JavaScript y añadirla a un documento HTML desde dentro de otro código JavaScript.Esto cargará un archivo JavaScript específico.
ja: 他のJavaScriptコードの中から動的にJavaScriptタグを生成してHTML文書に追加することが可能です。これにより、対象となるJavaScriptファイルが読み込まれます。
ko: JavaScript 태그를 동적으로 생성하여 다른 JavaScript 코드 내에서 HTML 문서에 추가 할 수 있습니다. 대상 JavaScript 파일이로드됩니다.
ru: Можно динамически генерировать тег JavaScript и добавлять его в HTML-документ изнутри другого JavaScript-кода.Это позволит загрузить целевой JavaScript-файл.
zh_cn: 可以动态生成一个JavaScript标签,并将其附加到HTML文档中。这将加载有针对性的JavaScript文件。

source: It means that if you use these tricks directly, <em>you won't be able to use your newly loaded code the next line after you asked it to be loaded</em>, because it will be still loading.
es: Significa que si usa estos trucos directamente, <em>no podr&aacute; usar su c&oacute;digo reci&eacute;n cargado en la siguiente l&iacute;nea despu&eacute;s de solicitar que se cargue</em> , porque todav&iacute;a se cargar&aacute;.
ja: つまり、これらのトリックを直接<em>使用する場合、ロードを要求した後、次の行で新しくロードされたコードを使用することはできません</em> 。
ko: 즉, 이러한 트릭을 직접 사용하는 경우 <em>새로로드 된 코드를로드 요청 후 다음 줄에서 사용할 수 없습니다</em> .로드가 계속 진행 중이기 때문입니다.
ru: Это означает, что если вы будете использовать эти приемы напрямую, <em>вы не сможете использовать свой недавно загруженный код на следующей строке после того, как вы попросили его загрузить</em> , потому что он все еще будет загружаться.
zh_cn: 这意味着，如果您直接使用这些技巧， <em>那么在您要求加载新代码后</em> ， <em>将无法在下一行使用新加载的代码</em> ，因为它仍将加载。

source: It works great and uses no page-reloads for me. I've tried the AJAX method (one of the other answers) but it doesn't seem to work as nicely for me.
es: Funciona muy bien y no necesita recargas de página para mí.He probado el método AJAX (una de las otras respuestas)pero no parece funcionar tan bien para mí.
ja: それは素晴らしい作品で、私のためにページのリロードを使用していません。私はAJAXメソッド(他の回答の1つ)を試してみましたが、それは私のためにうまく動作するようには見えません。
ko: 그것은 훌륭하게 작동하며 페이지 다시로드를 사용하지 않습니다. AJAX 방법 (다른 답변 중 하나)을 시도했지만 나에게 잘 작동하지 않는 것 같습니다.
ru: Он отлично работает и не перезагружает страницы для меня.Я пробовал метод AJAX (один из других ответов),но,похоже,он работает не так хорошо для меня.
zh_cn: 它的效果很好,对我来说不需要重新加载页面。我试过AJAX方法(其他答案之一),但它似乎对我来说并没有那么好用。

source: Like Dynamic Imports you can load one or many scripts with a <code>fetch</code> call using promises to control order of execution for script dependencies using the <a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a> library:
es: Al igual que las importaciones din&aacute;micas, puede cargar uno o varios scripts con una llamada de <code>fetch</code> utilizando promesas para controlar el orden de ejecuci&oacute;n de las dependencias de script utilizando la biblioteca <a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a> :
ja: 動的インポートと同様に、 <a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a>ライブラリを使用してスクリプトの依存関係の実行順序を制御するプロミスを使用して、 <code>fetch</code> 呼び出しで1つ以上のスクリプトをロードできます。
ko: 동적 가져 오기와 마찬가지로 <a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a> 라이브러리를 사용하여 스크립트 종속성에 대한 실행 순서를 제어하는 ​​약속을 사용하여 <code>fetch</code> 호출로 하나 이상의 스크립트를로드 할 수 있습니다.
ru: Как и Dynamic Imports, вы можете загружать один или несколько сценариев с помощью вызова <code>fetch</code> используя обещания для управления порядком выполнения зависимостей сценариев с помощью библиотеки <a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a> :
zh_cn: 像动态导入一样，您可以使用承诺通过<a href="https://git.habd.as/jhabdas/fetch-inject">Fetch Inject</a>库控制使用脚本来控制脚本依赖项的执行顺序，从而通过 <code>fetch</code> 调用加载一个或多个脚本：

source: Loaded the JavaScript code in the HTML file, in the correct order, myvariables.js first, then main.js:
es: Cargue el código JavaScript en el archivo HTML,en el orden correcto,myvariables.js primero,luego main.js:
ja: HTMLファイル内のJavaScriptコードを正しい順序でロードし、最初にmyvariables.js、次にmain.jsの順でロードしました。
ko: JavaScript 파일을 HTML 파일에 올바른 순서로 myvariables.js를 먼저 입력 한 다음 main.js로로드했습니다.
ru: Загрузил JavaScript-код в HTML-файл,в правильном порядке,сначала myvariables.js,затем main.js:
zh_cn: 在HTML文件中加载了JavaScript代码,按照正确的顺序,先是myvariables.js,然后是main.js。

source: Manually call just the one file in your head:
es: Llama manualmente al único archivo que tienes en la cabeza:
ja: 頭の中にある1つのファイルだけを手動で呼び出します。
ko: 머리에있는 파일 하나만 수동으로 호출하십시오.
ru: Вручную вызовите только один файл в вашей голове:
zh_cn: 手动调用你脑海中的一个文件就可以了。

source: Maybe you can use this function that I found on this page <em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">How do I include a JavaScript file in a JavaScript file?</a></em>:
es: Quiz&aacute;s pueda usar esta funci&oacute;n que encontr&eacute; en esta p&aacute;gina. <em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">&iquest;C&oacute;mo incluyo un archivo JavaScript en un archivo JavaScript?</a></em> :
ja: このページで見つけたこの関数を使用できるかもしれません<em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">。JavaScriptファイルにJavaScriptファイルを含めるにはどうすればよいですか？</a></em> ：
ko: 이 페이지에서 찾은이 기능을 사용할 수 있습니다 <em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">. JavaScript 파일에 JavaScript 파일을 어떻게 포함 시키나요?</a></em> :
ru: Может быть, вы можете использовать эту функцию, которую я нашел на этой странице <em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">Как мне включить файл JavaScript в файл JavaScript?</a></em> :
zh_cn: 也许您可以使用在此页面上找到的此功能， <em><a href="http://forums.digitalpoint.com/showthread.php?t=146094">如何在JavaScript文件中包含JavaScript文件？</a></em> ：
