Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: But since 2015 (ES6), JavaScript has had the <a href="http://exploringjs.com/es6/ch_modules.html">ES6 modules</a> standard to import modules in Node.js, which is also supported by <a href="https://caniuse.com/#feat=es6-module">most modern browsers</a>.
es: Pero desde 2015 (ES6), JavaScript ha tenido el est&aacute;ndar de <a href="http://exploringjs.com/es6/ch_modules.html">m&oacute;dulos ES6</a> para importar m&oacute;dulos en Node.js, que tambi&eacute;n es compatible con la <a href="https://caniuse.com/#feat=es6-module">mayor&iacute;a de los navegadores modernos</a> .
ja: しかし、2015年（ES6）以降、JavaScriptにはNode.jsにモジュールをインポートする<a href="http://exploringjs.com/es6/ch_modules.html">ES6モジュール</a>標準があり、 <a href="https://caniuse.com/#feat=es6-module">ほとんどの最新のブラウザーで</a>もサポートされています 。
ko: 그러나 2015 년 (ES6) 이후 JavaScript는 Node.js에서 모듈을 가져 오기위한 <a href="http://exploringjs.com/es6/ch_modules.html">ES6 모듈</a> 표준을 가지고 있으며 이는 <a href="https://caniuse.com/#feat=es6-module">대부분의 최신 브라우저</a> 에서도 지원됩니다.
ru: Но с 2015 года (ES6) в JavaScript появился <a href="http://exploringjs.com/es6/ch_modules.html">стандарт модулей ES6</a> для импорта модулей в Node.js, который также поддерживается <a href="https://caniuse.com/#feat=es6-module">большинством современных браузеров</a> .
zh_cn: 但是自2015年（ES6）起，JavaScript有了<a href="http://exploringjs.com/es6/ch_modules.html">ES6模块</a>标准即可在Node.js中导入模块， <a href="https://caniuse.com/#feat=es6-module">大多数现代浏览器</a>也支持该模块。

source: Define dependencies as modules:
es: Definir las dependencias como módulos:
ja: 依存関係をモジュールとして定義します。
ko: 종속성을 모듈로 정의하십시오.
ru: Определите зависимости как модули:
zh_cn: 将依赖项定义为模块。

source: Detecting when the script has been executed
es: Detectar cuando el guión ha sido ejecutado
ja: スクリプトが実行されたときの検出
ko: 스크립트가 언제 실행되었는지 감지
ru: Обнаружение того,когда скрипт был выполнен
zh_cn: 检测脚本何时被执行

source: Dynamic Script Loading
es: Carga de guión dinámico
ja: 動的スクリプトの読み込み
ko: 동적 스크립트 로딩
ru: Динамическая загрузка сценария
zh_cn: 动态脚本加载

source: Dynamic imports in browsers
es: Importaciones dinámicas en los navegadores
ja: ブラウザでの動的インポート
ko: 브라우저에서 동적 가져 오기
ru: Динамический импорт в браузерах
zh_cn: 浏览器中的动态导入

source: Dynamic imports let the script load other scripts as needed:
es: Las importaciones dinámicas permiten que el guión cargue otros guiones según sea necesario:
ja: 動的インポートにより、必要に応じて他のスクリプトをロードすることができます。
ko: 동적 가져 오기를 통해 스크립트가 필요에 따라 다른 스크립트를로드 할 수 있습니다.
ru: Динамический импорт позволяет скрипту загружать другие скрипты по мере необходимости:
zh_cn: 动态导入,让脚本根据需要加载其他脚本。

source: ECMAScript (ES6) modules have been <a href="https://nodejs.org/api/esm.html">supported in Node.js</a> since v8.5, with the <code>--experimental-modules</code> flag, and since at least Node.js v13.8.0 without the flag. To enable "ESM" (vs. Node.js's previous CommonJS-style module system ["CJS"]) you either use <code>"type": "module"</code> in <code>package.json</code> or give the files the extension <code>.mjs</code>. (Similarly, modules written with Node.js's previous CJS module can be named <code>.cjs</code> if your default is ESM.)
es: Los m&oacute;dulos ECMAScript (ES6) han sido <a href="https://nodejs.org/api/esm.html">soportados en Node.js</a> desde v8.5, con el <code>--experimental-modules</code> , y desde al menos Node.js v13.8.0 sin el indicador. Para habilitar "ESM" (frente al sistema de m&oacute;dulos de estilo CommonJS anterior de Node.js ["CJS"]) puede usar <code>"type": "module"</code> en <code>package.json</code> o <code>.mjs</code> los archivos la extensi&oacute;n .mjs . (Del mismo modo, los m&oacute;dulos escritos con el m&oacute;dulo CJS anterior de Node.js pueden llamarse <code>.cjs</code> si su valor predeterminado es ESM).
ja: ECMAScript（ES6）モジュールは、v.8.5以降、 <code>--experimental-modules</code> フラグを使用して、および少なくともNode.js v13.8.0以降、フラグなし<a href="https://nodejs.org/api/esm.html">でNode.jsでサポートされ</a>ています 。 "ESM"（vs. Node.jsの以前のCommonJSスタイルのモジュールシステム["CJS"]）を有効にするには、 <code>package.json</code> で <code>"type": "module"</code> を使用するか、ファイルに拡張子 <code>.mjs</code> を付けます。 （同様に、Node.jsの以前のCJSモジュールで作成されたモジュールは、デフォルトがESMの場合、 <code>.cjs</code> という名前にすることができます。）
ko: ECMAScript (ES6) 모듈은 <code>--experimental-modules</code> 플래그가있는 v8.5 이후 및 플래그가없는 Node.js v13.8.0 이상부터 <a href="https://nodejs.org/api/esm.html">Node.js</a> 에서 지원 되었습니다. "ESM"(vs. Node.js의 이전 CommonJS 스타일 모듈 시스템 [ "CJS"])을 사용하려면 <code>package.json</code> 에서 <code>"type": "module"</code> 을 사용하거나 파일 확장자를 <code>.mjs</code> 로 지정하십시오 . 비슷하게 Node.js의 이전 CJS 모듈로 작성된 모듈의 이름은 기본값이 ESM 인 경우 <code>.cjs</code> 로 지정할 수 있습니다.
ru: Модули ECMAScript (ES6) <a href="https://nodejs.org/api/esm.html">поддерживаются в Node.js</a> начиная с v8.5, с <code>--experimental-modules</code> и, как минимум, с Node.js v13.8.0 без флага. Чтобы включить &laquo;ESM&raquo; (по сравнению с предыдущей системой модулей CommonJS в стиле Node.js [&laquo;CJS&raquo;]), вы либо используете <code>"type": "module"</code> в <code>package.json</code> , либо даете файлам расширение <code>.mjs</code> . (Аналогично, модули, написанные с помощью предыдущего модуля CJS Node.js, могут называться <code>.cjs</code> , если по умолчанию используется ESM.)
zh_cn: 从v8.5开始，带有 <code>--experimental-modules</code> 标志的<a href="https://nodejs.org/api/esm.html">Node.js支持</a> ECMAScript（ES6）模块，并且至少从不带有标志的Node.js v13.8.0开始支持 ECMAScript（ES6）模块。 要启用&ldquo; ESM&rdquo;（相对于Node.js先前的CommonJS样式的模块系统[&ldquo; CJS&rdquo;]），您可以在 <code>package.json</code> 中使用 <code>"type": "module"</code> 或给文件扩展名 <code>.mjs</code> 。 （类似地，如果您的默认值为ESM，则用Node.js先前的CJS模块编写的模块可以命名为 <code>.cjs</code> 。）

source: ECMAScript modules in browsers
es: Módulos de ECMAScript en los navegadores
ja: ブラウザのECMAScriptモジュール
ko: 브라우저의 ECMAScript 모듈
ru: ECMAScript-модули в браузерах
zh_cn: 浏览器中的ECMAScript模块

source: ES6 Modules
es: Módulos ES6
ja: ES6モジュール
ko: ES6 모듈
ru: ES6 Модули
zh_cn: ES6模块

source: Even though all of the plugins get dropped into the head tag the way they ought to, they don't always get run by the browser when you click into the page or refresh.
es: Aunque todos los plugins se colocan en la etiqueta de la cabeza como deben,no siempre son ejecutados por el navegador cuando se hace clic en la página o se actualiza.
ja: すべてのプラグインがヘッドタグに落とし込まれても、ページをクリックしたり更新したりしたときにブラウザに実行されるとは限りません。
ko: 모든 플러그인이 원하는 방식으로 헤드 태그에 들어가더라도 페이지를 클릭하거나 새로 고칠 때 브라우저에서 항상 실행되는 것은 아닙니다.
ru: Несмотря на то,что все плагины попадают в тэг головы так,как и должны,они не всегда запускаются браузером при нажатии на страницу или при обновлении.
zh_cn: 尽管所有的插件都会按照它们应该的方式被放到头部标签中,但当你点击进入页面或刷新时,它们并不总是被浏览器运行。

source: Excerpt from the <a href="https://github.com/jrburke/requirejs">GitHub</a> README:
es: Extracto del <a href="https://github.com/jrburke/requirejs">archivo</a> README de GitHub :
ja: <a href="https://github.com/jrburke/requirejs">GitHub</a> READMEからの抜粋：
ko: <a href="https://github.com/jrburke/requirejs">GitHub</a> 읽어보기에서 발췌 :
ru: Выдержка из <a href="https://github.com/jrburke/requirejs">GitHub</a> README:
zh_cn: 摘自<a href="https://github.com/jrburke/requirejs">GitHub</a>自述文件：

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Fetch Loading
es: Buscar la carga
ja: フェッチ読み込み
ko: 페치 로딩
ru: Загрузка комплектующих
zh_cn: 获取加载

source: File <code>main.js.php</code>:
es: Archivo <code>main.js.php</code> :
ja: ファイル <code>main.js.php</code> ：
ko: 파일 <code>main.js.php</code> :
ru: Файл <code>main.js.php</code> :
zh_cn: 文件 <code>main.js.php</code> ：

source: File: main.js
es: Archivo:main.js
ja: ファイル:main.js
ko: 파일 : main.js
ru: Файл:main.js
zh_cn: 文件:main.js

source: File: myvariables.js
es: Archivo:myvariables.js
ja: ファイル:myvariables.js
ko: 파일 : myvariables.js
ru: Файл:myvariables.js
zh_cn: 文件:myvariables.js

source: For compatibility with older browsers, build tools like <a href="https://webpack.github.io/">Webpack</a> and <a href="https://rollupjs.org/">Rollup</a> and/or transpilation tools like <a href="https://babeljs.io/">Babel</a> can be used.
es: Para compatibilidad con navegadores antiguos, puede usar herramientas de compilaci&oacute;n como <a href="https://webpack.github.io/">Webpack</a> y <a href="https://rollupjs.org/">Rollup</a> y / o herramientas de transpilaci&oacute;n como <a href="https://babeljs.io/">Babel</a> .
ja: 古いブラウザとの互換性のために、 <a href="https://webpack.github.io/">Webpack</a>や<a href="https://rollupjs.org/">Rollup</a>などのビルドツールや<a href="https://babeljs.io/">Babel</a>などのトランスパイレーションツールを使用できます。
ko: 구형 브라우저와의 호환성을 위해 <a href="https://webpack.github.io/">Webpack</a> 및 <a href="https://rollupjs.org/">Rollup</a> 과 같은 빌드 도구 및 / 또는 <a href="https://babeljs.io/">Babel</a> 과 같은 변환 툴을 사용할 수 있습니다.
ru: Для совместимости со старыми браузерами можно использовать инструменты сборки, такие как <a href="https://webpack.github.io/">Webpack</a> и <a href="https://rollupjs.org/">Rollup,</a> и / или инструменты переноса, такие как <a href="https://babeljs.io/">Babel</a> .
zh_cn: 为了与旧版浏览器兼容，可以使用<a href="https://webpack.github.io/">Webpack</a>和<a href="https://rollupjs.org/">Rollup</a>等构建工具和/或Babel等编译工具。

source: For example: <code>my_lovely_script.js</code> contains <code>MySuperObject</code>:
es: Por ejemplo: <code>my_lovely_script.js</code> contiene <code>MySuperObject</code> :
ja: たとえば、 <code>my_lovely_script.js</code> にはMySuperObjectが含まれてい <code>MySuperObject</code> 。
ko: 예를 들어, <code>my_lovely_script.js</code> 는 <code>MySuperObject</code> 를 포함 합니다 .
ru: Например: <code>my_lovely_script.js</code> содержит <code>MySuperObject</code> :
zh_cn: 例如： <code>my_lovely_script.js</code> 包含 <code>MySuperObject</code> ：

source: For this I did as below:
es: Para esto hice lo siguiente:
ja: そのためには以下のようにしました。
ko: 이를 위해 다음과 같이했습니다.
ru: За это я сделала то,что написано ниже:
zh_cn: 对此,我的做法如下。

source: Fortunately, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">Web Workers have their own <code>importScripts</code> function</a> which is a global function in the scope of the Web Worker, native to the browser itself as it <a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">is part of the specification</a>.
es: Afortunadamente, los <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">Web Workers tienen su propia funci&oacute;n <code>importScripts</code> ,</a> que es una funci&oacute;n global en el &aacute;mbito del Web Worker, nativa del navegador en s&iacute;, ya que <a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">forma parte de la especificaci&oacute;n</a> .
ja: さいわい、 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">Webワーカーには独自の <code>importScripts</code> 関数</a>があり、これはWebワーカーのスコープ内のグローバル関数で<a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">あり、仕様の一部である</a>ため、ブラウザー自体にネイティブです。
ko: 다행스럽게도 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">웹 워커는 자신의 <code>importScripts</code> 기능을</a> 가지고 있는데, <a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">이는 스펙의 일부인</a> 브라우저 자체에 고유 한 웹 워커 범위의 글로벌 함수입니다.
ru: К счастью, у <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">Web Workers есть своя собственная функция <code>importScripts</code> ,</a> которая является глобальной функцией в области Web Worker, встроенной в сам браузер, поскольку <a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">является частью спецификации</a> .
zh_cn: 幸运的是， <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage#Importing_scripts_and_libraries">Web Workers拥有自己的 <code>importScripts</code> 函数</a> ，该函数是Web Workers范围内的全局函数，它<a href="https://html.spec.whatwg.org/multipage/workers.html#importing-scripts-and-libraries">是</a>浏览器本身的固有特性，因为它是规范的一部分 。

source: From the Mixture documentation on <code>.mix</code> files:
es: De la documentaci&oacute;n de Mixture en archivos <code>.mix</code> :
ja: <code>.mix</code> ファイルに関するMixtureドキュメントから：
ko: <code>.mix</code> 파일의 혼합물 설명서에서 :
ru: Из документации Mixture по файлам <code>.mix</code> :
zh_cn: 从 <code>.mix</code> 文件的Mixture文档中：

source: Gist: <a href="http://gist.github.com/284442">http://gist.github.com/284442</a>.
ja: 要旨： <a href="http://gist.github.com/284442">http</a> : //gist.github.com/284442 。
ko: 요점 : <a href="http://gist.github.com/284442">http://gist.github.com/284442</a>
ru: Суть: <a href="http://gist.github.com/284442">http://gist.github.com/284442</a> .
zh_cn: 要点： <a href="http://gist.github.com/284442">http</a> : //gist.github.com/284442 。

source: Here is a <strong>synchronous</strong> version <strong>without jQuery</strong>:
es: Aqu&iacute; hay una versi&oacute;n <strong>sincr&oacute;nica</strong> <strong>sin jQuery</strong> :
ja: ここに<strong>jQueryなしの</strong> <strong>同期</strong>バージョンがあります：
ko: 다음은 <strong>jQuery</strong> 가없는 <strong>동기</strong> 버전입니다.
ru: Вот <strong>синхронная</strong> версия <strong>без jQuery</strong> :
zh_cn: 这是<strong>没有jQuery</strong>的<strong>同步</strong>版本：

source: Here is an example of how this could work:
es: Aquí hay un ejemplo de cómo podría funcionar esto:
ja: これがどのように機能するかの一例をご紹介します。
ko: 이것이 어떻게 작동하는지에 대한 예는 다음과 같습니다.
ru: Вот пример того,как это может сработать:
zh_cn: 下面是一个例子。

source: Here's an example <code>.mix</code> file that combines multiple <code>.js</code> files into one:
es: Aqu&iacute; hay un ejemplo de archivo <code>.mix</code> que combina m&uacute;ltiples archivos <code>.js</code> en uno:
ja: 複数の <code>.js</code> ファイルを1つに <code>.mix</code> ファイルの例を次に示します。
ko: 다음은 여러 <code>.js</code> 파일을 하나로 결합하는 예제 <code>.mix</code> 파일입니다.
ru: Вот пример файла <code>.mix</code> , который объединяет несколько файлов <code>.js</code> в один:
zh_cn: 这是一个示例 <code>.mix</code> 文件，它将多个 <code>.js</code> 文件合并为一个：

source: Here's an example using jQuery:
es: Aquí hay un ejemplo usando jQuery:
ja: jQueryを使った例です。
ko: 다음은 jQuery를 사용하는 예입니다.
ru: Вот пример использования jQuery:
zh_cn: 下面是一个使用jQuery的例子。

source: Here's an explanation of how the code works for those that are curious: essentially, it creates a new script tag (after the first one) of the URL. It sets it to asynchronous mode so it doesn't block the rest of the code, but calls a callback when the readyState (the state of the content to be loaded) changes to 'loaded'.
es: Aquí hay una explicación de cómo funciona el código para los curiosos:esencialmente,crea una nueva etiqueta de guión (después de la primera)de la URL.La pone en modo asíncrono para que no bloquee el resto del código,pero llama a una llamada cuando el readyState (el estado del contenido a cargar)cambia a "cargado".
ja: 興味のある方のために、このコードがどのように動作するかを説明します:基本的には、URLの新しいscriptタグ(最初のタグの後)を作成します。非同期モードに設定しているので、残りのコードはブロックされませんが、READYState (読み込まれるコンテンツの状態)が 'LOADED' に変化したときにコールバックを呼び出します。
ko: 호기심이 많은 사람들의 코드 작동 방식에 대한 설명은 다음과 같습니다. 기본적으로 URL의 첫 스크립트 태그 뒤에 새 스크립트 태그를 만듭니다. 비동기 코드로 설정하여 나머지 코드를 차단하지 않지만 readyState (로드 할 내용의 상태)가 'loaded'로 변경되면 콜백을 호출합니다.
ru: Вот объяснение того,как работает код для тех,кому интересно:по сути,он создает новый тег скрипта (после первого)URL.Он переводит его в асинхронный режим,чтобы не блокировать остальную часть кода,а вызывает обратный вызов,когда состояние готовности (состояние загружаемого содержимого)меняется на "загруженный".
zh_cn: 下面是对这段代码的工作原理的解释,对于那些好奇的人来说:本质上,它创建了一个新的脚本标签(在第一个标签之后)的URL。它将其设置为异步模式,所以它不会阻止其余的代码,但当readyState(要加载的内容的状态)变为 "load "时,会调用一个回调。

source: Here's the generalized version of how Facebook does it for their ubiquitous Like button:
es: Aquí está la versión generalizada de cómo Facebook lo hace por su omnipresente botón "Me gusta":
ja: これは、Facebookがユビキタスな「いいね!」ボタンのためにどのようにそれを行うかの一般化されたバージョンです。
ko: 다음은 Facebook의 유비쿼터스 좋아요 버튼에 대해 Facebook이 수행하는 방식의 일반화 된 버전입니다.
ru: Вот обобщенная версия того,как Facebook делает это для своей вездесущей кнопки "Like":
zh_cn: 以下是Facebook对其无处不在的Like按钮的通用版本。

source: How do I include a JavaScript file in another JavaScript file
es: ¿Cómo incluyo un archivo de JavaScript en otro archivo de JavaScript
ja: JavaScriptファイルを別のJavaScriptファイルにインクルードするには?
ko: 다른 JavaScript 파일에 JavaScript 파일을 포함시키는 방법
ru: Как включить файл JavaScript в другой файл JavaScript?
zh_cn: 我如何在另一个JavaScript文件中包含一个JavaScript文件?

source: However, this method also has a problem: if an error happens in the imported JavaScript file, <a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> (and also Firefox Error Console and <a href="https://developers.google.com/chrome-developer-tools/">Chrome Developer Tools</a> as well) will report its place incorrectly, which is a big problem if you use Firebug to track JavaScript errors down a lot (I do). Firebug simply doesn't know about the newly loaded file for some reason, so if an error occurs in that file, it reports that it occurred in your main <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> file, and you will have trouble finding out the real reason for the error.
es: Sin embargo, este m&eacute;todo tambi&eacute;n tiene un problema: si ocurre un error en el archivo JavaScript importado, <a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> (y tambi&eacute;n Firefox Error Console y <a href="https://developers.google.com/chrome-developer-tools/">Chrome Developer Tools</a> tambi&eacute;n) informar&aacute;n su lugar incorrectamente, lo cual es un gran problema si usa Firebug para rastrear Los errores de JavaScript bajan mucho (lo hago). Firebug simplemente no conoce el archivo reci&eacute;n cargado por alguna raz&oacute;n, por lo que si se produce un error en ese archivo, informa que se produjo en su archivo <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> principal y tendr&aacute; problemas para descubrir el motivo real del error.
ja: ただし、この方法には問題もあります。インポートされたJavaScriptファイルでエラーが発生した場合、 <a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> （およびFirefox Error Consoleと<a href="https://developers.google.com/chrome-developer-tools/">Chromeデベロッパーツール</a>も）がその場所を誤って報告します。これは、Firebugを使用して追跡する場合は大きな問題ですJavaScriptはかなりダウンします（私はそうします）。 Firebugは、何らかの理由で新しくロードされたファイルを単に認識しないため、そのファイルでエラーが発生すると、メインの<a href="http://en.wikipedia.org/wiki/HTML">HTML</a>ファイルで発生したことが報告され、エラーの実際の理由を見つけるのが困難になります。
ko: 그러나이 방법에도 문제가 있습니다. 가져온 JavaScript 파일에서 오류가 발생하면 <a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> (및 Firefox 오류 콘솔 및 <a href="https://developers.google.com/chrome-developer-tools/">Chrome 개발자 도구</a> )도 잘못된 위치를보고하므로 Firebug를 사용하여 추적하는 경우 큰 문제입니다 JavaScript 오류가 많이 발생합니다 (그렇습니다). Firebug는 어떤 이유로 든 새로로드 된 파일에 대해 단순히 알지 못하므로 해당 파일에서 오류가 발생하면 기본 <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> 파일에서 발생한 것으로보고하여 오류의 실제 원인을 찾는 데 어려움을 겪습니다.
ru: Однако этот метод также имеет проблему: если в импортированном файле JavaScript возникает ошибка, <a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> (а также Firefox Error Console и <a href="https://developers.google.com/chrome-developer-tools/">Chrome Developer Tools</a> также сообщат о своем месте неверно, что является большой проблемой, если вы используете Firebug для отслеживания Ошибки JavaScript много (я делаю). Firebug по какой-то причине просто не знает о недавно загруженном файле, поэтому, если в этом файле происходит ошибка, он сообщает, что она произошла в вашем основном <a href="http://en.wikipedia.org/wiki/HTML">HTML-</a> файле, и у вас будут проблемы с поиском истинной причины ошибки.
zh_cn: 但是，此方法也有一个问题：如果在导入的JavaScript文件中发生错误，则<a href="http://en.wikipedia.org/wiki/Firebug_%28software%29">Firebug</a> （以及Firefox错误控制台和<a href="https://developers.google.com/chrome-developer-tools/">Chrome开发者工具</a> ）也会错误地报告其位置，如果您使用Firebug进行跟踪，这将是一个大问题JavaScript错误很多（我愿意）。 Firebug出于某种原因根本不了解新加载的文件，因此，如果该文件中发生错误，它将报告该错误是在您的主<a href="http://en.wikipedia.org/wiki/HTML">HTML</a>文件中发生的，您将很难找出错误的真正原因。

source: I also made a simple test for this at <a href="http://www.kipras.com/dev/import_js_test/">Example</a>.
es: Tambi&eacute;n hice una prueba simple para esto en <a href="http://www.kipras.com/dev/import_js_test/">Example</a> .
ja: 例でも簡単なテストを行いました。
ko: 또한 <a href="http://www.kipras.com/dev/import_js_test/">Example</a> 에서 간단한 테스트를 수행했습니다.
ru: Я также сделал простой тест для этого в <a href="http://www.kipras.com/dev/import_js_test/">Примере</a> .
zh_cn: 我还在<a href="http://www.kipras.com/dev/import_js_test/">Example上</a>对此进行了简单测试。

source: I assume that a script is not fully executed until its <code>document.ready</code> event has been executed. (I know using <code>document.ready</code> is not required, but many people use it, and handling this is a safeguard.)
es: Supongo que un script no se ejecuta completamente hasta que se haya ejecutado su evento <code>document.ready</code> . (S&eacute; que usar <code>document.ready</code> no es obligatorio, pero muchas personas lo usan, y manejar esto es una salvaguardia).
ja: <code>document.ready</code> イベントが実行されるまで、スクリプトは完全には実行されないと思います。 （私は <code>document.ready</code> を使用する必要がないことを知っていますが、多くの人がそれを使用しており、これを処理することは安全策です。）
ko: 나는 <code>document.ready</code> 이벤트가 실행될 때까지 스크립트가 완전히 실행되지 않았다고 가정합니다. (나는 <code>document.ready</code> 를 사용할 필요는 없지만 많은 사람들이 그것을 사용한다는 것을 알고 있으며 이것을 처리하는 것이 안전합니다.)
ru: Я предполагаю, что скрипт не выполняется полностью до тех пор, пока не будет выполнено событие <code>document.ready</code> . (Я знаю, что использование <code>document.ready</code> не требуется, но многие люди используют его, и обработка этого является гарантией.)
zh_cn: 我假设脚本只有在执行 <code>document.ready</code> 事件后才能完全执行。 （我知道不需要使用 <code>document.ready</code> ，但是许多人都使用它，并且处理此问题是一种保护措施。）

source: I came to this question because I was looking for a simple way to maintain a collection of useful JavaScript plugins. After seeing some of the solutions here, I came up with this:
es: Llegué a esta pregunta porque buscaba una forma sencilla de mantener una colección de plugins de JavaScript útiles.Después de ver algunas de las soluciones aquí,se me ocurrió esto:
ja: この質問に来たのは、JavaScriptの便利なプラグイン集を簡単にメンテナンスできる方法を探していたからです。ここでいくつかの解決策を見た後、私はこれにたどり着きました。
ko: 유용한 JavaScript 플러그인 모음을 유지 관리하는 간단한 방법을 찾고 있었기 때문에이 질문에 왔습니다. 여기에 몇 가지 해결책을 본 후에 나는 이것을 생각해 냈습니다.
ru: Я пришел к этому вопросу,потому что искал простой способ поддерживать коллекцию полезных JavaScript-плагинов.После того,как я увидел здесь некоторые решения,я пришел к этому:
zh_cn: 我来到这个问题,是因为我在寻找一个简单的方法来维护一个有用的JavaScript插件集合。在看到这里的一些解决方案后,我想出了这个办法。
