Repository: rueisnom/feedback
Catalog: xlf/95/00/87/950087.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Mix files are simply .js or .css files with .mix. in the file name. A mix file simply extends the functionality of a normal style or script file and allows you to import and combine.
es: Los archivos de mezcla son simplemente archivos .js o .css con .mix.en el nombre del archivo.Un archivo mixto simplemente extiende la funcionalidad de un archivo de estilo o guión normal y permite importar y combinar.
ja: ミックスファイルとは、ファイル名に.mix.を持つ.jsや.cssファイルのことです。ミックスファイルは、通常のスタイルファイルやスクリプトファイルの機能を単純に拡張したもので、インポートしたり組み合わせたりすることができます。
ko: 믹스 파일은 .mix가 포함 된 .js 또는 .css 파일입니다. 파일 이름에. 믹스 파일은 단순히 일반 스타일 또는 스크립트 파일의 기능을 확장하여 가져오고 결합 할 수있게합니다.
ru: Смешанные файлы-это просто .js или .css файлы с .mix.в имени файла.Смешанный файл просто расширяет функциональность обычного стиля или файла сценария и позволяет импортировать и комбинировать.
zh_cn: 混合文件就是文件名中带.js或.css的文件。混合文件只是扩展了普通样式或脚本文件的功能,允许你导入和组合。

source: Mixture outputs this as <code>scripts-global.js</code> and also as a minified version (<code>scripts-global.min.js</code>).
es: Mixture genera esto como <code>scripts-global.js</code> y tambi&eacute;n como una versi&oacute;n reducida ( <code>scripts-global.min.js</code> ).
ja: Mixtureは、これを <code>scripts-global.js</code> および縮小バージョン（ <code>scripts-global.min.js</code> ）として出力します。
ko: Mixture는이를 <code>scripts-global.js</code> 및 축소 버전 ( <code>scripts-global.min.js</code> )으로 출력합니다.
ru: Mixture выводит это как <code>scripts-global.js</code> , а также как уменьшенную версию ( <code>scripts-global.min.js</code> ).
zh_cn: Mixture将其输出为 <code>scripts-global.js</code> 和缩小版本（ <code>scripts-global.min.js</code> ）。

source: Most of solutions shown here imply dynamical loading. I was searching instead for a compiler which assemble all the depended files into a single output file. The same as <a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a>/<a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a> preprocessors deal with the CSS <code>@import</code> at-rule. Since I didn't find anything decent of this sort, I wrote a simple tool solving the issue.
es: La mayor&iacute;a de las soluciones que se muestran aqu&iacute; implican una carga din&aacute;mica. Estaba buscando un compilador que re&uacute;ne todos los archivos dependientes en un solo archivo de salida. Lo mismo que los preprocesadores <a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a> / <a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a> tratan con la regla CSS <code>@import</code> at-rule. Como no encontr&eacute; nada decente de este tipo, escrib&iacute; una herramienta simple para resolver el problema.
ja: ここに示されているソリューションのほとんどは、動的な負荷を意味しています。 代わりに、依存するすべてのファイルを1つの出力ファイルにアセンブルするコンパイラを探していました。 <a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a> / <a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a>プリプロセッサがCSS <code>@import</code> at-ruleを処理するのと同じです。 私はこの種のまともなものを見つけられなかったので、問題を解決する簡単なツールを書きました。
ko: 여기에 표시된 대부분의 솔루션은 동적 로딩을 의미합니다. 대신 모든 종속 파일을 단일 출력 파일로 어셈블하는 컴파일러를 찾고있었습니다. <a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a> / <a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a> 전처리 기와 동일하게 CSS <code>@import</code> at-rule을 처리합니다. 이런 종류의 점을 찾지 못했기 때문에 문제를 해결하는 간단한 도구를 작성했습니다.
ru: Большинство представленных здесь решений предполагают динамическую загрузку. Вместо этого я искал компилятор, который собирает все зависимые файлы в один выходной файл. Так же, как препроцессоры <a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a> / <a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a> <code>@import</code> с правилом CSS @import . Поскольку я не нашел ничего приличного в этом роде, я написал простой инструмент для решения проблемы.
zh_cn: 此处显示的大多数解决方案都暗含动态载荷。 我正在搜索的是一个将所有依赖文件组装成一个输出文件的编译器。 与<a href="http://en.wikipedia.org/wiki/Less_%28stylesheet_language%29">Less</a> / <a href="http://en.wikipedia.org/wiki/Sass_%28stylesheet_language%29">Sass</a>预处理程序处理CSS <code>@import</code> 规则相同。 由于我没有找到任何像样的东西，因此我编写了一个简单的工具来解决该问题。

source: My usual method is:
es: Mi método habitual es:
ja: 私のいつもの方法は
ko: 내 일반적인 방법은 다음과 같습니다
ru: Мой обычный метод:
zh_cn: 我常用的方法是:

source: NOTE: You must use this only while the page is loading, otherwise you get a blank screen. In other words, <strong>always place this before / outside of document.ready</strong>. I have not tested using this after the page is loaded in a click event or anything like that, but I am pretty sure it'll fail.
es: NOTA: debe usar esto solo mientras se carga la p&aacute;gina; de lo contrario, aparecer&aacute; una pantalla en blanco. En otras palabras, <strong>siempre coloque esto antes / fuera de document.ready</strong> . No he probado usar esto despu&eacute;s de que la p&aacute;gina se carga en un evento de clic o algo as&iacute;, pero estoy bastante seguro de que fallar&aacute;.
ja: 注：これは、ページの読み込み中にのみ使用する必要があります。そうしないと、空白の画面が表示されます。 つまり、 <strong>常にdocument.readyの前/外に配置します</strong> 。 ページがクリックイベントなどで読み込まれた後、これを使用したテストはしていませんが、失敗することはほぼ間違いありません。
ko: 참고 : 페이지를로드하는 동안에 만 사용해야하며, 그렇지 않으면 빈 화면이 나타납니다. 즉, <strong>항상 document.ready 앞 / 뒤에 배치하십시오</strong> . 페이지가 클릭 이벤트 또는 이와 유사한 것으로로드 된 후에 이것을 사용하여 테스트하지는 않았지만 실패 할 것이라고 확신합니다.
ru: ПРИМЕЧАНИЕ. Вы должны использовать это только во время загрузки страницы, иначе вы получите пустой экран. Другими словами, <strong>всегда размещайте это перед / за пределами document.ready</strong> . Я не проверял использование этого после загрузки страницы в событии щелчка или чем-то подобном, но я почти уверен, что это потерпит неудачу.
zh_cn: 注意：您只能在页面加载时使用此功能，否则会出现空白屏幕。 换句话说，请<strong>始终将其放在document.ready之前/之外</strong> 。 在将页面加载到click事件或类似事件之后，我还没有使用此工具进行过测试，但是我敢肯定它会失败。

source: Node.js require
es: Los nodos.js requieren
ko: Node.js가 필요합니다
ru: Node.js требуют
zh_cn: Node.js要求

source: Note that the script may execute after the DOM has loaded, or before, depending on the browser and whether you included the line <code>script.async = false;</code>. There's a <a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">great article on Javascript loading in general</a> which discusses this.
es: Tenga en cuenta que el script puede ejecutarse despu&eacute;s de que se haya cargado el DOM, o antes, seg&uacute;n el navegador y si incluy&oacute; la l&iacute;nea <code>script.async = false;</code> . Hay un <a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">gran art&iacute;culo sobre la carga de Javascript en general</a> que analiza esto.
ja: DOMがロードされた後、またはその前に、ブラウザと、 <code>script.async = false;</code> 行を含めたかどうかによって、スクリプトが実行される場合があることに注意してください。 。 これを説明<a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">する一般的なJavaScriptの読み込みに関する優れた記事</a>があります。
ko: 스크립트는 브라우저에 따라 DOM이로드 된 후 또는 이전에 실행될 수 있으며 스크립트를 포함했는지 여부에 따라 스크립트가 실행될 수 있습니다 <code>script.async = false;</code> . <a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">Javascript 로딩에</a> 대한 훌륭한 기사 가 있습니다.
ru: Обратите внимание, что сценарий может выполняться после загрузки DOM или раньше, в зависимости от браузера и от того, включена ли строка <code>script.async = false;</code> , В <a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">общем</a> , есть отличная статья о загрузке Javascript, которая обсуждает это.
zh_cn: 请注意，脚本可能在加载DOM之后或之前执行，具体取决于浏览器以及是否包含行脚本 <code>script.async = false;</code> 。 <a href="http://www.html5rocks.com/en/tutorials/speed/script-loading/">总的来说</a> ，有一篇很棒的关于Javascript加载的文章对此进行了讨论。

source: Note that to get this working cross-domain, the server will need to set <code>allow-origin</code> header in its response.
es: Tenga en cuenta que para que este dominio cruzado funcione, el servidor deber&aacute; establecer el encabezado <code>allow-origin</code> en su respuesta.
ja: この動作するクロスドメインを取得するには、サーバーが応答に <code>allow-origin</code> ヘッダーを設定する必要があることに注意してください。
ko: 이 작동하는 도메인 간을 가져 오려면 서버가 응답에서 <code>allow-origin</code> 헤더를 설정해야합니다.
ru: Обратите внимание, что для получения этого рабочего междомена сервер должен будет установить заголовок <code>allow-origin</code> в своем ответе.
zh_cn: 请注意，要获得此工作的跨域，服务器将需要在其响应中设置 <code>allow-origin</code> 标头。

source: Note: I'm not in any way affiliated with Mixture, other than using it as a front-end development tool. I came across this question upon seeing a <code>.mix</code> JavaScript file in action (in one of the Mixture boilerplates) and being a bit confused by it ("you can do this?" I thought to myself). Then I realized that it was an application-specific file type (somewhat disappointing, agreed). Nevertheless, figured the knowledge might be helpful for others.
es: Nota: de ninguna manera estoy afiliado a Mixture, aparte de usarlo como una herramienta de desarrollo front-end. Me encontr&eacute; con esta pregunta al ver un archivo <code>.mix</code> JavaScript en acci&oacute;n (en una de las placas repetitivas de Mixture) y estar un poco confundido ("&iquest;puedes hacer esto?", Pens&eacute; para m&iacute;). Luego me di cuenta de que era un tipo de archivo espec&iacute;fico de la aplicaci&oacute;n (algo decepcionante, de acuerdo). Sin embargo, pens&eacute; que el conocimiento podr&iacute;a ser &uacute;til para otros.
ja: 注：フロントエンド開発ツールとして使用する以外は、私はMixtureとは一切関係ありません。 <code>.mix</code> JavaScriptファイルが（Mixtureボイラープレートの1つで）動作しているのを見て、少し混乱している（「これは可能ですか？」と私は思った）ときにこの質問に出くわしました。 それから、それはアプリケーション固有のファイルタイプであることに気付きました（やや残念、同意しました）。 それにもかかわらず、知識は他の人に役立つかもしれないと考えました。
ko: 참고 : 저는 Mixture를 프론트 엔드 개발 도구로 사용하는 것 외에는 어떤 방식으로도 Mixture와 제휴하지 않습니다. 나는 <code>.mix</code> JavaScript 파일이 (Mixture 상용구 중 하나에서) 작동하고 약간 혼란스러워 보이는 것을 보았을 때이 질문에 부딪쳤다 . 그런 다음 그것이 응용 프로그램 특정 파일 형식이라는 것을 깨달았습니다 (약간 실망스럽고 동의했습니다). 그럼에도 불구하고 지식이 다른 사람들에게 도움이 될 것이라고 생각했습니다.
ru: Примечание: я никоим образом не связан с Mixture, кроме того, что использую его как интерфейсный инструмент разработки. Я столкнулся с этим вопросом, увидев <code>.mix</code> JavaScript .mix в действии (в одном из шаблонов Mixture) и будучи немного смущенным этим (&laquo;Вы можете сделать это?&raquo; - подумал я про себя). Затем я понял, что это был тип файла приложения (несколько разочаровывающий, согласился). Тем не менее, полагал, что знания могут быть полезны для других.
zh_cn: 注意：除了将它用作前端开发工具之外，我与Mixture无关。 我看到一个正在运行的 <code>.mix</code> JavaScript文件（在Mixture样板中）时遇到了这个问题，并对此感到有些困惑（&ldquo;我能做到吗？&rdquo;）。 然后我意识到这是一种特定于应用程序的文件类型（有些令人失望，同意）。 但是，认为这些知识可能对其他人有所帮助。

source: Now we can run the compiler:
es: Ahora podemos ejecutar el compilador:
ja: これでコンパイラを実行できるようになりました。
ko: 이제 컴파일러를 실행할 수 있습니다 :
ru: Теперь мы можем запустить компилятор:
zh_cn: 现在我们可以运行编译器了。

source: Now, there is a big issue you must know about. Doing that implies that <em>you remotely load the code</em>. Modern web browsers will load the file and keep executing your current script because they load everything asynchronously to improve performance. (This applies to both the jQuery method and the manual dynamic script loading method.)
es: Ahora, hay un gran problema que debes conocer. Hacer eso implica que <em>cargue el c&oacute;digo de forma remota</em> . Los navegadores web modernos cargar&aacute;n el archivo y seguir&aacute;n ejecutando su script actual porque cargan todo de forma asincr&oacute;nica para mejorar el rendimiento. (Esto se aplica tanto al m&eacute;todo jQuery como al m&eacute;todo de carga de script din&aacute;mico manual).
ja: 今、あなたが知っておくべき大きな問題があります。 これは<em>、リモートでコードをロード</em>することを意味し<em>ます</em> 。 最新のWebブラウザーはすべてを非同期でロードしてパフォーマンスを向上させるため、ファイルをロードして現在のスクリプトを実行し続けます。 （これは、jQueryメソッドと手動の動的スクリプトロードメソッドの両方に適用されます。）
ko: 이제 알아야 할 큰 문제가 있습니다. 그렇게하면 <em>원격으로 코드를로드 할 수 있습니다</em> . 최신 웹 브라우저는 파일을로드하고 성능을 향상시키기 위해 모든 것을 비동기식으로로드하기 때문에 현재 스크립트를 계속 실행합니다. (이는 jQuery 메소드와 수동 동적 스크립트로드 메소드 모두에 적용됩니다.)
ru: Теперь есть большая проблема, о которой вы должны знать. Это подразумевает, что <em>вы загружаете код удаленно</em> . Современные веб-браузеры загружают файл и продолжают выполнять ваш текущий скрипт, потому что они загружают все асинхронно для повышения производительности. (Это относится как к методу jQuery, так и к методу ручной динамической загрузки скрипта.)
zh_cn: 现在，您必须知道一个大问题。 这样做意味着<em>您需要远程加载代码</em> 。 现代的Web浏览器将加载文件并继续执行当前脚本，因为它们异步加载所有内容以提高性能。 （这适用于jQuery方法和手动动态脚本加载方法。）

source: On the jQuery master branch, they simply concatenate atomic source files into a single one starting with <code>intro.js</code> and ending with <code>outtro.js</code>. That doesn't suits me as it provides no flexibility on the source code design. Check out how it works with jsic:
es: En la rama maestra jQuery, simplemente concatenan los archivos de origen at&oacute;mico en uno solo que comienza con <code>intro.js</code> y termina con <code>outtro.js</code> . Eso no me conviene, ya que no proporciona flexibilidad en el dise&ntilde;o del c&oacute;digo fuente. Mira c&oacute;mo funciona con jsic:
ja: jQueryマスターブランチでは、アトミックソースファイルを <code>intro.js</code> で始まりoutout.jsで終わる単一のソースファイルに単純に連結します。 ソースコードの設計に柔軟性がないため、これは私には適していません。 jsicでどのように機能するかを確認してください。
ko: jQuery 마스터 브랜치에서는 원자 소스 파일을 <code>intro.js</code> 로 시작하고 outtro.js 로 끝나는 단일 소스 파일로 간단히 연결합니다. 소스 코드 디자인에 유연성이 없기 때문에 나에게 적합하지 않습니다. jsic과의 작동 방식을 확인하십시오.
ru: В основной ветке jQuery они просто объединяют атомарные исходные файлы в один, начиная с <code>intro.js</code> и заканчивая <code>outtro.js</code> . Это меня не устраивает, так как не обеспечивает гибкости при разработке исходного кода. Проверьте, как это работает с JSIC:
zh_cn: 在jQuery master分支上，它们仅将原子源文件连接到一个以 <code>intro.js</code> 开头并以 <code>outtro.js</code> 结尾的文件中 。 那不适合我，因为它在源代码设计上没有灵活性。 查看jsic的工作方式：

source: Or rather than including at run time, use a script to concatenate prior to upload.
es: O en vez de incluirlo en tiempo de ejecución,usa un guión para concatenar antes de subirlo.
ja: あるいは、実行時にインクルードするのではなく、アップロード前にスクリプトを使用して連結します。
ko: 또는 런타임에 포함하는 대신 스크립트를 사용하여 업로드하기 전에 연결하십시오.
ru: Или вместо того,чтобы включать во время выполнения,используйте скрипт для конкатенирования перед загрузкой.
zh_cn: 或者,与其在运行时包含,不如在上传前使用脚本来串联。

source: Read more at <a href="https://developers.google.com/web/updates/2017/11/dynamic-import">https://developers.google.com/web/updates/2017/11/dynamic-import</a>
es: Obtenga m&aacute;s informaci&oacute;n en <a href="https://developers.google.com/web/updates/2017/11/dynamic-import">https://developers.google.com/web/updates/2017/11/dynamic-import</a>
ja: 詳しくは<a href="https://developers.google.com/web/updates/2017/11/dynamic-import">https://developers.google.com/web/updates/2017/11/dynamic-importをご覧ください</a>
ko: <a href="https://developers.google.com/web/updates/2017/11/dynamic-import">https://developers.google.com/web/updates/2017/11/dynamic-import</a> 에서 자세히 알아 보십시오.
ru: Подробнее <a href="https://developers.google.com/web/updates/2017/11/dynamic-import">читайте</a> на странице https://developers.google.com/web/updates/2017/11/dynamic-import.
zh_cn: 请访问<a href="https://developers.google.com/web/updates/2017/11/dynamic-import">https://developers.google.com/web/updates/2017/11/dynamic-import</a>了解更多信息。

source: Read more at <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/</a>
es: Lea m&aacute;s en <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/</a>
ja: 詳しくは<a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/をご覧ください</a>
ko: <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/</a> 에서 자세한 내용을 확인하십시오.
ru: Узнайте больше на <a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/</a>
zh_cn: 在<a href="https://jakearchibald.com/2017/es-modules-in-browsers/">https://jakearchibald.com/2017/es-modules-in-browsers/</a>了解更多

source: Refer to:
es: Refiérase a:
ja: を参照してください。
ko: 인용하다:
ru: Смотри:
zh_cn: 参看:

source: RequireJS loads plain JavaScript files as well as more defined modules. It is optimized for in-browser use, including in a Web Worker, but it can be used in other JavaScript environments, like Rhino and Node. It implements the Asynchronous Module API.
es: RequireJS carga archivos JavaScript planos así como módulos más definidos.Está optimizado para su uso en el navegador,incluso en un Web Worker,pero puede ser usado en otros entornos JavaScript,como Rhino y Node.Implementa el API de módulos asíncronos.
ja: RequireJSは、より定義されたモジュールと同様に、プレーンなJavaScriptファイルをロードします。これはWeb Workerを含むブラウザ内での使用に最適化されていますが、RhinoやNodeのような他のJavaScript環境でも使用することができます。これは非同期モジュールAPIを実装しています。
ko: RequireJS는 일반 JavaScript 파일과 더 정의 된 모듈을로드합니다. 웹 워커를 포함하여 브라우저 내 사용에 최적화되어 있지만 Rhino 및 Node와 같은 다른 JavaScript 환경에서 사용할 수 있습니다. 비동기 모듈 API를 구현합니다.
ru: RequireJS загружает как простые JavaScript-файлы,так и более определенные модули.Он оптимизирован для использования в браузере,в том числе и в Web Worker,но может быть использован и в других JavaScript-средах,таких как Rhino и Node.Реализован API модуля Asynchronous.
zh_cn: RequireJS可以加载普通的JavaScript文件以及更多定义的模块。它针对浏览器内使用进行了优化,包括在Web Worker中,但也可以在其他JavaScript环境中使用,如Rhino和Node。它实现了Asynchronous Module API。

source: RequireJS uses plain script tags to load modules/files, so it should allow for easy debugging. It can be used simply to load existing JavaScript files, so <strong>you can add it to your existing project without having to re-write your JavaScript files.</strong>
es: RequireJS utiliza etiquetas de script simples para cargar m&oacute;dulos / archivos, por lo que deber&iacute;a permitir una depuraci&oacute;n f&aacute;cil. Se puede usar simplemente para cargar archivos JavaScript existentes, por lo <strong>que puede agregarlo a su proyecto existente sin tener que volver a escribir sus archivos JavaScript.</strong>
ja: RequireJSは、プレーンスクリプトタグを使用してモジュール/ファイルをロードするため、簡単にデバッグできるはずです。 これは単に既存のJavaScriptファイルをロードするため<strong>に使用できるため、JavaScriptファイルを書き直すことなく、既存のプロジェクトに追加できます。</strong>
ko: RequireJS는 일반 스크립트 태그를 사용하여 모듈 / 파일을로드하므로 쉽게 디버깅 할 수 있습니다. 기존 JavaScript 파일을로드하는 데 간단히 사용할 수 있으므로 JavaScript 파일 <strong>을 다시 쓰지 않고도 기존 프로젝트에</strong> 파일 <strong>을 추가 할 수 있습니다.</strong>
ru: RequireJS использует простые теги сценариев для загрузки модулей / файлов, поэтому он должен обеспечивать легкую отладку. Его можно использовать просто для загрузки существующих файлов JavaScript, поэтому <strong>вы можете добавить его в существующий проект без необходимости переписывать файлы JavaScript.</strong>
zh_cn: RequireJS使用简单的脚本标签来加载模块/文件，因此应便于调试。 它可以简单地用于加载现有的JavaScript文件，因此<strong>您可以将其添加到现有项目中，而无需重新编写JavaScript文件。</strong>

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: Set up a file called "plugins.js" (or extensions.js or whatever you want). Keep your plugin files together with that one master file.
es: Crea un archivo llamado "plugins.js" (o extensiones.js o lo que quieras).Mantén tus archivos de plugins junto con ese archivo maestro.
ja: plugins.js」というファイルを設定します(拡張子.jsでも何でも構いません)。プラグインファイルはこのマスターファイルにまとめておきましょう。
ko: "plugins.js"(또는 extensions.js 또는 원하는 파일)라는 파일을 설정하십시오. 하나의 마스터 파일과 함께 플러그인 파일을 유지하십시오.
ru: Установите файл под названием "plugins.js" (или extensions.js,или что угодно).Сохраняйте ваши файлы плагинов вместе с этим одним основным файлом.
zh_cn: 设置一个名为 "plugins.js "的文件(或extensions.js或任何你想要的东西)。将你的插件文件和这个主文件一起保存。

source: So all you would need to do to import JavaScript is:
es: Así que todo lo que necesitas hacer para importar JavaScript es:
ja: なので、JavaScriptをインポートするために必要なのは
ko: 따라서 JavaScript를 가져 오려면 다음을 수행하십시오.
ru: Итак,для импорта JavaScript все,что вам нужно сделать:
zh_cn: 所以,你需要做的就是导入JavaScript。

source: So here is the compiler, <a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsic</a>, which replaces <code>$import("file-path")</code> with the requested file content securely. Here is the corresponding <a href="http://gruntjs.com/">Grunt</a> plugin: <a href="https://github.com/dsheiko/grunt-jsic">https://github.com/dsheiko/grunt-jsic</a>.
es: As&iacute; que aqu&iacute; est&aacute; el compilador, <a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsic</a> , que reemplaza <code>$import("file-path")</code> con el contenido del archivo solicitado de forma segura. Aqu&iacute; est&aacute; el complemento <a href="http://gruntjs.com/">Grunt</a> correspondiente: <a href="https://github.com/dsheiko/grunt-jsic">https://github.com/dsheiko/grunt-jsic</a> .
ja: したがって、ここにコンパイラ<a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsicがあり</a> 、これは <code>$import("file-path")</code> を要求されたファイルコンテンツに安全に置き換えます。 対応する<a href="http://gruntjs.com/">Grunt</a>プラグインは次のとおりです： <a href="https://github.com/dsheiko/grunt-jsic">https</a> : //github.com/dsheiko/grunt-jsic 。
ko: 여기에 <a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsic</a> 컴파일러가 있는데, 이것은 <code>$import("file-path")</code> 를 요청 된 파일 내용으로 안전하게 대체합니다. 해당 <a href="http://gruntjs.com/">Grunt</a> 플러그인은 다음과 같습니다. <a href="https://github.com/dsheiko/grunt-jsic">https://github.com/dsheiko/grunt-jsic</a>
ru: Итак, вот компилятор <a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsic</a> , который надежно заменяет <code>$import("file-path")</code> запрашиваемым содержимым файла. Вот соответствующий плагин <a href="http://gruntjs.com/">Grunt</a> : <a href="https://github.com/dsheiko/grunt-jsic">https://github.com/dsheiko/grunt-jsic</a> .
zh_cn: 因此，这里是编译器<a href="https://github.com/dsheiko/jsic">https://github.com/dsheiko/jsic</a> ，它将安全地将 <code>$import("file-path")</code> 替换为所请求的文件内容。 这是对应的<a href="http://gruntjs.com/">Grunt</a>插件： <a href="https://github.com/dsheiko/grunt-jsic">https</a> : //github.com/dsheiko/grunt-jsic 。

source: So you don't have to rely upon any JavaScript framework nor do you have to explicitly make <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a> calls.
es: Por lo tanto, no tiene que confiar en ning&uacute;n marco de JavaScript ni tiene que hacer expl&iacute;citamente llamadas <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a> .
ja: したがって、JavaScriptフレームワークに依存する必要も、 <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a>呼び出しを明示的に行う必要もありません。
ko: 따라서 JavaScript 프레임 워크에 의존하거나 <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a> 호출을 명시 적으로 지정할 필요가 없습니다.
ru: Таким образом, вам не нужно полагаться на какую-либо инфраструктуру JavaScript и не нужно явно делать вызовы <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a> .
zh_cn: 因此，您不必依赖任何JavaScript框架，也不必显式进行<a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a>调用。

source: Source Code Merge/Preprocessing
es: Fusión del código fuentePreprocesamiento
ja: ソース コード MergePreprocessing
ko: 소스 코드 병합 / 전처리
ru: Обработка исходного кода MergePreproprocessing
zh_cn: 源代码 MergePreprocessing
