Repository: rueisnom/feedback
Catalog: xlf/58/90/58/4/5890584.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">Reference: Efficient reshaping using data.tables</a>)
es: ( <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">Referencia: remodelaci&oacute;n eficiente usando data.tables</a> )
ja: （ <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">参照：data.tablesを使用した効率的な再形成</a> ）
ko: ( <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">참조 : data.tables를 사용하여 효율적인 재 형성</a> )
ru: ( <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">Ссылка: Эффективное изменение формы с использованием data.tables</a> )
zh_cn: （ <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html">参考：使用data.tables进行有效的重塑</a> ）

source: -&gt; created another column for showing the functionality
es: -&gt; cre&oacute; otra columna para mostrar la funcionalidad
ja: -&gt;機能を示すための別の列を作成しました
ko: -&gt; 기능을 보여주기 위해 다른 열을 만들었습니다.
ru: -&gt; создал еще один столбец для отображения функциональности
zh_cn: -&gt;创建了另一列以显示功能

source: -single column long -&gt; wide
es: -una columna larga -&gt; ancha
ja: -シングルカラムロング-&gt;ワイド
ko: -단일 열-&gt; 넓음
ru: длинная колонна -&gt; широкая
zh_cn: -单列长-&gt;宽

source: <code>direction</code> specifies wide or long format
es: <code>direction</code> especifica formato ancho o largo
ja: <code>direction</code> はワイドまたはロングフォーマットを指定します
ko: <code>direction</code> 은 넓거나 긴 형식을 지정합니다
ru: <code>direction</code> указывает широкий или длинный формат
zh_cn: <code>direction</code> 指定宽或长格式

source: <code>idvar</code> is the column of classes that separates rows
es: <code>idvar</code> es la columna de clases que separa filas
ja: <code>idvar</code> は、行を区切るクラスの列です。
ko: <code>idvar</code> 은 행을 구분하는 클래스의 열입니다.
ru: <code>idvar</code> это столбец классов, который разделяет строки
zh_cn: <code>idvar</code> 是分隔行的类的列

source: <code>sqldf</code> package:
es: paquete <code>sqldf</code> :
ja: <code>sqldf</code> パッケージ：
ko: <code>sqldf</code> 패키지 :
ru: пакет <code>sqldf</code> :
zh_cn: <code>sqldf</code> 软件包：

source: <code>tidyr</code> is a reframing of <code>reshape2</code> designed to accompany the tidy data framework, and to work hand-in-hand with <code>magrittr</code> and <code>dplyr</code> to build a solid pipeline for data analysis.
es: <code>tidyr</code> es un nuevo <code>reshape2</code> de reshape2 dise&ntilde;ado para acompa&ntilde;ar el marco de datos ordenado, y para trabajar de la mano con <code>magrittr</code> y <code>dplyr</code> para construir una tuber&iacute;a s&oacute;lida para el an&aacute;lisis de datos.
ja: <code>tidyr</code> は整頓されたデータフレームワークに <code>magrittr</code> 、 <code>dplyr</code> とdplyrと連携してデータ分析用の堅牢なパイプラインを構築するために設計された <code>reshape2</code> のリフレーミングです。
ko: <code>tidyr</code> 는 깔끔한 데이터 프레임 워크와 함께 <code>magrittr</code> 되고 <code>dplyr</code> 및 dplyr 와 함께 데이터 분석을위한 견고한 파이프 라인을 구축하도록 설계된 <code>reshape2</code> 의 재구성입니다.
ru: <code>tidyr</code> - это рефрейминг <code>reshape2</code> , предназначенный для сопровождения инфраструктуры данных tidy и совместной работы с <code>magrittr</code> и <code>dplyr</code> для создания надежного конвейера для анализа данных.
zh_cn: <code>tidyr</code> 是 <code>reshape2</code> 的改版,旨在配合整洁的数据框架，并与 <code>magrittr</code> 和 <code>dplyr</code> 携手合作 ，为数据分析构建坚实的管道。

source: <code>timevar</code> is the column of classes to cast wide
es: <code>timevar</code> es la columna de clases para emitir
ja: <code>timevar</code> は、広範囲にキャストするクラスの列です。
ko: <code>timevar</code> 은 광범위하게 캐스팅 할 클래스 열입니다.
ru: <code>timevar</code> - столбец классов
zh_cn: <code>timevar</code> 是要广泛使用的类的列

source: <code>v.names</code> is the column containing numeric values
es: <code>v.names</code> es la columna que contiene valores num&eacute;ricos
ja: <code>v.names</code> は数値を含む列です
ko: <code>v.names</code> 는 숫자 값을 포함하는 열입니다.
ru: <code>v.names</code> - столбец, содержащий числовые значения
zh_cn: <code>v.names</code> 是包含数值的列

source: <strong>Edit:</strong> Now, in 2019, tidyr v 1.0 has launched and set <code>spread</code> and <code>gather</code> on a deprecation path, preferring instead <code>pivot_wider</code> and <code>pivot_longer</code>, which you can find described <a href="https://stackoverflow.com/a/57013551/903061">in this answer</a>. Read on if you want a brief glimpse into the brief life of <code>spread/gather</code>.
es: <strong>Editar:</strong> ahora, en 2019, tidyr v 1.0 se lanz&oacute; y estableci&oacute; la <code>spread</code> y la <code>gather</code> en una ruta de <code>pivot_wider</code> , prefiriendo en su lugar pivot_wider y <code>pivot_longer</code> , que puede encontrar descrito <a href="https://stackoverflow.com/a/57013551/903061">en esta respuesta</a> . Siga leyendo si desea un breve vistazo a la breve vida de <code>spread/gather</code> .
ja: <strong>編集：</strong>今、2019年にtidyr v 1.0がリリースされ、非推奨パスで <code>spread</code> と <code>gather</code> を設定しました。代わりに、 <code>pivot_wider</code> と <code>pivot_longer</code> を使用してください。 <code>spread/gather</code> 短い人生を少し垣間見たい場合は、以下をお読みください。
ko: <strong>편집 :</strong> 이제 2019 년 tidyr v 1.0이 시작 및 사용 중단 경로에서 <code>gather</code> 및 수집 을 설정하고 대신 <code>pivot_wider</code> 및 <code>pivot_longer</code> 를 선호합니다. <a href="https://stackoverflow.com/a/57013551/903061">이 답변에</a> 설명 되어 있습니다. 간단한 <code>spread/gather</code> 수명을 간략히 살펴 보려면 계속 읽으십시오.
ru: <strong>Изменить:</strong> Теперь, в 2019 году, tidyr v 1.0 запустил и установил <code>spread</code> и <code>gather</code> по пути устаревания, предпочитая вместо <code>pivot_wider</code> и <code>pivot_longer</code> , которые вы можете найти, описанные <a href="https://stackoverflow.com/a/57013551/903061">в этом ответе</a> . Продолжайте читать, если вы хотите кратко взглянуть на краткую жизнь <code>spread/gather</code> .
zh_cn: <strong>编辑：</strong>现在，在2019年，tidyr v 1.0已启动并设置了 <code>spread</code> 和 <code>gather</code> 的弃用路径，而更喜欢使用 <code>pivot_wider</code> 和 <code>pivot_longer</code> ，您可以<a href="https://stackoverflow.com/a/57013551/903061">在此答案中</a>找到它们。 如果您想简要了解一下 <code>spread/gather</code> 的短暂生活，请继续阅读。

source: And, as of data.table v1.9.6 we can cast on multiple columns
es: Y,a partir de la data.table v1.9.6 podemos proyectar en múltiples columnas
ja: また、data.table v1.9.6では、複数のカラムにキャストすることができます。
ko: 그리고 data.table v1.9.6부터 여러 열에 캐스트 할 수 있습니다
ru: И,начиная с data.table v1.9.6,мы можем отличить несколько столбцов.
zh_cn: 而且,从data.table v1.9.6版的data.table开始,我们可以在多个列上投出

source: Another option if performance is a concern is to use <code>data.table</code>'s extension of <code>reshape2</code>'s melt &amp; dcast functions
es: Otra opci&oacute;n si el rendimiento es una preocupaci&oacute;n es usar la extensi&oacute;n de <code>reshape2</code> de las funciones melt &amp; dcast de reshape2
ja: パフォーマンスが懸念される場合の別のオプションは、 <code>reshape2</code> のメルト＆キャスト関数の拡張を使用することです。
ko: 성능이 <code>data.table</code> 경우 또 다른 옵션은 <code>reshape2</code> 의 reshape2 확장 및 용융 기능 확장을 사용하는 것입니다.
ru: Другой вариант, если производительность вызывает беспокойство, - это использовать <code>data.table</code> для функций <code>reshape2</code> melt &amp; dcast.
zh_cn: 如果要考虑性能，则另一个选择是使用 <code>data.table</code> 对 <code>reshape2</code> 的melt＆dcast函数的扩展

source: Base package:
es: Paquete base:
ja: 基本パッケージ。
ko: 기본 패키지 :
ru: Базовый пакет:
zh_cn: 基础包。

source: From <a href="https://github.com/hadley/tidyr">github</a>,
es: De <a href="https://github.com/hadley/tidyr">github</a> ,
ja: <a href="https://github.com/hadley/tidyr">github</a>から、
ko: <a href="https://github.com/hadley/tidyr">github</a> 에서
ru: Из <a href="https://github.com/hadley/tidyr">GitHub</a> ,
zh_cn: 来自<a href="https://github.com/hadley/tidyr">github</a> ，

source: How to reshape data from long to wide format
es: Cómo dar nueva forma a los datos de formato largo a formato ancho
ja: ロングフォーマットからワイドフォーマットにデータをリシェイプする方法
ko: 긴 형식에서 넓은 형식으로 데이터를 재구성하는 방법
ru: Как преобразовать данные из длинного в широкий формат
zh_cn: 如何从长格式到宽格式的数据重塑数据

source: I want to reshape it so that each unique "name" variable is a rowname, with the "values" as observations along that row and the "numbers" as colnames. Sort of like this:
es: Quiero remodelarla de manera que cada variable de "nombre" única sea un nombre de fila,con los "valores" como observaciones a lo largo de esa fila y los "números" como nombres de coloquios.Algo así:
ja: それぞれのユニークな "name "変数がrownameで、"value "がその行に沿ったオブザベーション、"number "がcolnamesとなるように再構築したいと思います。このような感じです。
ko: 각 고유 한 "name"변수가 행 이름이되도록 행 이름을 바꾸고 싶습니다. "values"는 해당 행을 따라 관측 값이되고 "numbers"는 colnames입니다. 이런 종류의 :
ru: Я хочу перестроить ее так,чтобы каждая уникальная "именная" переменная была коричневой,с "значениями" в виде наблюдений вдоль этой строки и "числами" в виде колонок.Вроде того:
zh_cn: 我想重塑它,使每个唯一的 "name "变量都是一个rowname,"值 "是沿该行的观测值,"数字 "是colnames。有点像这样。

source: I'm having trouble rearranging the following data frame:
es: Tengo problemas para reorganizar el siguiente cuadro de datos:
ja: 以下のデータフレームの並び替えに困っています。
ko: 다음 데이터 프레임을 다시 정렬하는 데 문제가 있습니다.
ru: У меня проблемы с перестановкой следующего фрейма данных:
zh_cn: 我在重新整理下面的数据框时遇到了麻烦。

source: I've looked at <code>melt</code> and <code>cast</code> and a few other things, but none seem to do the job.
es: He analizado <code>melt</code> y <code>cast</code> y algunas otras cosas, pero ninguna parece hacer el trabajo.
ja: 私は <code>melt</code> や <code>cast</code> 、その他いくつかのものを見てきましたが、どれもその仕事をしていないようです。
ko: 나는 <code>melt</code> <code>cast</code> 와 다른 것들을 보았지만 아무도 그 일을하는 것처럼 보이지 않습니다.
ru: Я смотрел на <code>melt</code> и <code>cast</code> и несколько других вещей, но, похоже, ни одна из них не справилась.
zh_cn: 我已经看过 <code>melt</code> 和 <code>cast</code> 以及其他一些东西，但是似乎没有一个能做得到。

source: If no <code>idvar</code> exists, create one before using the <code>reshape()</code> function:
es: Si no existe <code>idvar</code> , cree uno antes de usar la funci&oacute;n <code>reshape()</code> :
ja: <code>idvar</code> が存在しない場合は、 reshape <code>reshape()</code> 関数を使用する前に作成します。
ko: <code>idvar</code> 이없는 경우 <code>reshape()</code> 함수를 사용하기 전에 하나를 작성하십시오.
ru: Если <code>idvar</code> не существует, создайте его перед использованием функции <code>reshape()</code> :
zh_cn: 如果不存在 <code>idvar</code> ，请在使用 <code>reshape()</code> 函数之前创建一个：

source: It is easy to write many different operations in terms of the cdata primitives. These operators can work-in memory or at big data scale (with databases and Apache Spark; for big data use the cdata::moveValuesToRowsN() and cdata::moveValuesToColumnsN() variants). The transforms are controlled by a control table that itself is a diagram of (or picture of) the transform.
es: Es fácil escribir muchas operaciones diferentes en términos de los primitivos cdatos.Estos operadores pueden trabajar en memoria o a gran escala de datos (con bases de datos y Apache Spark;para grandes datos utilice las variantes cdata::moveValuesToRowsN()y cdata::moveValuesToColumnsN()).Las transformaciones son controladas por una tabla de control que a su vez es un diagrama de (o imagen de)la transformación.
ja: cdataプリミティブを利用することで、様々な演算子を簡単に書くことができます。これらの演算子はメモリ内でもビッグデータのスケールでも動作します (データベースやApache Sparkでは cdata::moveValuesToRowsN()と cdata::moveValuesToColumnsN()のバリアントを使用します)。変換は制御テーブルによって制御され、それ自体が変換のダイアグラム (または図)になります。
ko: cdata 프리미티브 측면에서 다양한 작업을 쉽게 작성할 수 있습니다. 이러한 연산자는 메모리 및 빅 데이터 규모로 작업 할 수 있습니다 (데이터베이스 및 Apache Spark의 경우 빅 데이터의 경우 cdata :: moveValuesToRowsN () 및 cdata :: moveValuesToColumnsN () 변형 사용). 변환은 그 자체가 변환의 다이어그램 (또는 그림) 인 제어 테이블에 의해 제어됩니다.
ru: Легко написать множество различных операций с точки зрения примитивов cdata.Эти операторы могут работать как в памяти,так и на больших данных (с базами данных и Apache Spark;для больших данных используйте варианты cdata::moveValuesToRowsN()и cdata::moveValuesToColumnsN()).Трансформации управляются с помощью управляющей таблицы,которая сама по себе является диаграммой (или картинкой)трансформации.
zh_cn: 在cdata基元方面,很容易写出许多不同的操作。这些操作符可以在内存中工作,也可以在大数据规模下工作(使用数据库和Apache Spark;对于大数据,使用cdata:::moveValuesToRowsN()和cdata:::moveValuesToColumnsN()变体)。这些变换由一个控制表控制,该表本身就是一个变换的图(或图片)。

source: Just as <code>reshape2</code> did less than reshape, <code>tidyr</code> does less than <code>reshape2</code>. It's designed specifically for tidying data, not the general reshaping that <code>reshape2</code> does, or the general aggregation that reshape did. In particular, built-in methods only work for data frames, and <code>tidyr</code> provides no margins or aggregation.
es: As&iacute; como <code>reshape2</code> hizo menos que <code>tidyr</code> , tidyr hace menos que <code>reshape2</code> . Est&aacute; dise&ntilde;ado espec&iacute;ficamente para ordenar los datos, no la remodelaci&oacute;n general que <code>reshape2</code> hace, o la agregaci&oacute;n general que hizo la remodelaci&oacute;n. En particular, los m&eacute;todos integrados solo funcionan para marcos de datos, y <code>tidyr</code> no proporciona m&aacute;rgenes ni agregaci&oacute;n.
ja: <code>reshape2</code> がreshapeよりも少ないことを行ったように、 <code>tidyr</code> はreshape2よりも少ないことを <code>reshape2</code> ます。 データを整頓するために特別に設計されており、 <code>reshape2</code> が行う一般的な再形成や、 reshape2が行った一般的な集計ではありません。 特に、組み込みメソッドはデータフレームに対してのみ機能し、 <code>tidyr</code> はマージンや集約を提供しません。
ko: <code>reshape2</code> 가 reshape보다 덜한 것처럼 tidyr 은 <code>tidyr</code> 보다 <code>reshape2</code> 합니다. 이는 <code>reshape2</code> 가 수행하는 일반적인 재구성이나 reshape이 수행 한 일반적인 집계가 아닌 데이터 정리를 위해 특별히 설계되었습니다. 특히 기본 제공 방법은 데이터 프레임에만 적용되며 <code>tidyr</code> 은 여백이나 집계를 제공하지 않습니다.
ru: Так же, как <code>reshape2</code> сделал меньше, чем <code>tidyr</code> , Tidyr делает меньше, чем <code>reshape2</code> . Он разработан специально для упорядочивания данных, а не для общего изменения формы, <code>reshape2</code> делает reshape2 , или общего объединения, которое сделал изменение. В частности, встроенные методы работают только для фреймов данных, а <code>tidyr</code> не обеспечивает полей или агрегирования.
zh_cn: 就像 <code>reshape2</code> 做不到一样， <code>tidyr</code> <code>reshape2</code> 。 它是专门为整理数据而设计的，而不是 <code>reshape2</code> 进行的一般重塑或reshape2进行的一般聚合。 特别是，内置方法仅适用于数据帧， <code>tidyr</code> 不提供边距或聚合。

source: Just remember that <code>idvar</code> is required! The <code>timevar</code> and <code>v.names</code> part is easy. The output of this function is more predictable than some of the others, as everything is explicitly defined.
es: &iexcl;Solo recuerda que se requiere <code>idvar</code> ! La parte de <code>timevar</code> y <code>v.names</code> es f&aacute;cil. La salida de esta funci&oacute;n es m&aacute;s predecible que algunas de las otras, ya que todo est&aacute; expl&iacute;citamente definido.
ja: <code>idvar</code> が必要であることを覚えておいてください ！ <code>timevar</code> と <code>v.names</code> の部分は簡単です。 すべてが明示的に定義されているため、この関数の出力は他の関数よりも予測可能です。
ko: <code>idvar</code> 이 필요하다는 것을 기억하십시오! <code>timevar</code> 및 <code>v.names</code> 부분은 쉽습니다. 이 함수의 출력은 모든 것이 명시 적으로 정의되어 있기 때문에 다른 것보다 더 예측 가능합니다.
ru: Просто помните, что <code>idvar</code> необходим! Часть <code>timevar</code> и <code>v.names</code> проста. Вывод этой функции более предсказуем, чем некоторые другие, так как все явно определено.
zh_cn: 请记住， <code>idvar</code> 是必需的！ <code>timevar</code> 和 <code>v.names</code> 部分很简单。 该函数的输出比其他一些函数更可预测，因为所有内容都已明确定义。

source: Or using <code>reshape2</code>
es: O usando <code>reshape2</code>
ja: または <code>reshape2</code> を使用する
ko: 또는 <code>reshape2</code> 사용
ru: Или с помощью <code>reshape2</code>
zh_cn: 或使用 <code>reshape2</code>

source: Other two options:
es: Otras dos opciones:
ja: 他にも2つの選択肢があります。
ko: 다른 두 가지 옵션 :
ru: Два других варианта:
zh_cn: 其他两个选项:

source: The base <code>reshape</code> function works perfectly fine:
es: La funci&oacute;n de <code>reshape</code> base funciona perfectamente bien:
ja: 基本の <code>reshape</code> 機能は完全に正常に動作します。
ko: 기본 <code>reshape</code> 기능은 완벽하게 작동합니다.
ru: Функция базового <code>reshape</code> работает отлично:
zh_cn: 基本 <code>reshape</code> 功能可以正常工作：

source: The new (in 2014) <code>tidyr</code> package also does this simply, with <code>gather()</code>/<code>spread()</code> being the terms for <code>melt</code>/<code>cast</code>.
es: El nuevo paquete <code>tidyr</code> (en 2014) tambi&eacute;n lo hace de manera simple, y los t&eacute;rminos de <code>melt</code> / <code>cast</code> <code>gather()</code> / <code>spread()</code> .
ja: 新しい（2014年の） <code>tidyr</code> パッケージもこれを簡単に実行します。gather <code>gather()</code> / <code>spread()</code> は、 <code>melt</code> / <code>cast</code> の用語です。
ko: 새로운 (2014 년) <code>tidyr</code> 패키지는 간단하게 이것을 수행하며, collect <code>gather()</code> / <code>spread()</code> 가 <code>melt</code> / <code>cast</code> 의 용어입니다.
ru: Новый (в 2014 году) пакет <code>tidyr</code> также делает это просто, так как collect <code>gather()</code> / <code>spread()</code> - это термины <code>melt</code> / <code>cast</code> .
zh_cn: 新的（2014年） <code>tidyr</code> 包也可以简单地做到这一点， <code>gather()</code> / <code>spread()</code> 是 <code>melt</code> / <code>cast</code> 的术语。

source: The whole system is based on two primitives or operators cdata::moveValuesToRowsD() and cdata::moveValuesToColumnsD(). These operators have pivot, un-pivot, one-hot encode, transpose, moving multiple rows and columns, and many other transforms as simple special cases.
es: Todo el sistema se basa en dos primitivas u operadores cdata::moveValuesToRowsD()y cdata::moveValuesToColumnsD().Estos operadores tienen pivotar,despivotar,codificar en un solo punto,transponer,mover múltiples filas y columnas,y muchas otras transformaciones como simples casos especiales.
ja: システム全体は,2つのプリミティブまたは演算子 cdata::moveValuesToRowsD()と cdata::moveValuesToColumnsD()に基づいています.これらの演算子には、ピボット、アンピボット、ワンホットエンコード、転置、複数の行や列の移動、その他多くの変換が単純な特殊ケースとして用意されています。
ko: 전체 시스템은 두 개의 기본 요소 또는 연산자 cdata :: moveValuesToRowsD () 및 cdata :: moveValuesToColumnsD ()를 기반으로합니다. 이 연산자에는 피벗, 피벗 해제, 원핫 인코딩, 조옮김, 여러 행과 열 이동 및 기타 특수한 변형이 포함됩니다.
ru: Вся система основана на двух примитивах или операторах cdata::moveValuesToRowsD()и cdata::moveValuesToColumnsD().Эти операторы имеют поворот,un-pivot,одно-горячее кодирование,транспонирование,перемещение нескольких строк и столбцов,а также множество других преобразований в качестве простых частных случаев.
zh_cn: 整个系统基于两个基元或运算符cdata:::moveValuesToRowsD()和cdata:::moveValuesToColumnsD()两个基元或运算符。这些操作符有透视、非透视、单热编码、转置、移动多行和多列,以及许多其他的变换作为简单的特殊情况。

source: There's very powerful new package from genius data scientists at Win-Vector (folks that made <code>vtreat</code>, <code>seplyr</code> and <code>replyr</code>) called <code>cdata</code>. It implements "coordinated data" principles described in <a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">this document</a> and also in this <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">blog post</a>. The idea is that regardless how you organize your data, it should be possible to identify individual data points using a system of "data coordinates". Here's a excerpt from the recent blog post by John Mount:
es: Hay un nuevo paquete muy poderoso de genios cient&iacute;ficos de datos en Win-Vector (personas que hicieron <code>vtreat</code> , <code>seplyr</code> y <code>replyr</code> ) llamado <code>cdata</code> . Implementa los principios de "datos coordinados" descritos en <a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">este documento</a> y tambi&eacute;n en esta <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">publicaci&oacute;n de blog</a> . La idea es que, independientemente de c&oacute;mo organice sus datos, deber&iacute;a ser posible identificar puntos de datos individuales utilizando un sistema de "coordenadas de datos". Aqu&iacute; hay un extracto de la reciente publicaci&oacute;n de blog de John Mount:
ja: Win-Vectorの天才データサイエンティスト（ <code>vtreat</code> 、 <code>seplyr</code> 、 replyrを <code>replyr</code> ）による <code>cdata</code> と呼ばれる非常に強力な新しいパッケージがあります 。 <a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">このドキュメント</a>とこの<a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">ブログの投稿</a>で説明されている「調整データ」の原則を実装しています 。 データをどのように編成するかに関係なく、「データ座標」のシステムを使用して個々のデータポイントを識別できるはずです。 ジョンマウントによる最近のブログ投稿からの抜粋です。
ko: <code>cdata</code> 라는 Win-Vector ( <code>vtreat</code> , <code>seplyr</code> 및 <code>replyr</code> 를 만든 사람들)의 천재 데이터 과학자들이 제공하는 매우 강력한 새 패키지가 있습니다. <a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">이 문서</a> 와이 <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">블로그 게시물</a> 에 설명 된 "조정 된 데이터"원칙을 구현합니다. 아이디어는 데이터 구성 방법에 관계없이 "데이터 좌표"시스템을 사용하여 개별 데이터 요소를 식별 할 수 있어야한다는 것입니다. 다음은 John Mount의 최근 블로그 게시물에서 발췌 한 내용입니다.
ru: В Win-Vector ( <code>vtreat</code> , <code>seplyr</code> и <code>replyr</code> ) <code>cdata</code> очень мощный новый пакет данных от гениальных ученых, называемый cdata . Он реализует принципы &laquo;скоординированных данных&raquo;, описанные в <a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">этом документе,</a> а также в этом <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">блоге</a> . Идея состоит в том, что независимо от того, как вы организуете свои данные, должна быть возможность идентифицировать отдельные точки данных, используя систему &laquo;координат данных&raquo;. Вот выдержка из недавнего сообщения в блоге Джона Маунта:
zh_cn: Win-Vector的天才数据科学家提供了一个非常强大的新程序包（制作 <code>vtreat</code> ， <code>seplyr</code> 和 <code>replyr</code> ），称为 <code>cdata</code> 。 它实现了<a href="https://github.com/WinVector/cdata/blob/master/extras/RowsAndColumns.md">本文档</a>以及本<a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">博客文章中</a>描述的&ldquo;协调数据&rdquo;原则。 这个想法是，无论您如何组织数据，都应该有可能使用&ldquo;数据坐标&rdquo;系统来识别单个数据点。 这是John Mount最近的博客文章的节选：

source: Using <code>reshape</code> function:
es: Usando la funci&oacute;n de <code>reshape</code> :
ja: <code>reshape</code> 関数の使用：
ko: <code>reshape</code> 기능 사용 :
ru: Используя функцию <code>reshape</code> :
zh_cn: 使用 <code>reshape</code> 功能：

source: Using base R <code>aggregate</code> function:
es: Usando <code>aggregate</code> funci&oacute;n agregada base R:
ja: ベースR <code>aggregate</code> 関数の使用：
ko: 기본 R <code>aggregate</code> 함수 사용 :
ru: Используя базовую <code>aggregate</code> функцию R:
zh_cn: 使用基数R <code>aggregate</code> 函数：

source: Using your example dataframe, we could:
es: Usando tu marco de datos de ejemplo,podríamos:
ja: データフレームの例を使うと、次のようなことができます。
ko: 예제 데이터 프레임을 사용하여 다음을 수행 할 수 있습니다.
ru: Используя ваш образец данных,мы могли бы:
zh_cn: 使用你的示例数据框架,我们可以:
