Repository: rueisnom/feedback
Catalog: xlf/58/90/58/4/5890584.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: We will first build the control table (see <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">blog post</a> for details) and then perform the move of data from rows to columns.
es: Primero construiremos la tabla de control (vea la <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">publicaci&oacute;n del blog</a> para m&aacute;s detalles) y luego realizaremos el movimiento de datos de filas a columnas.
ja: 最初にコントロールテーブルを作成し（詳細については<a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">ブログの投稿</a>を参照）、次に行から列へのデータの移動を実行します。
ko: 먼저 제어 테이블을 작성하고 (자세한 내용은 <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">블로그 게시물</a> 참조) 데이터를 행에서 열로 이동합니다.
ru: Сначала мы создадим контрольную таблицу (подробности см. В <a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">блоге</a> ), а затем выполним перемещение данных из строк в столбцы.
zh_cn: 我们将首先构建控制表（有关详细信息，请参见<a href="http://www.win-vector.com/blog/2017/03/coordinatized-data-a-fluid-data-specification/">博客文章</a> ），然后执行数据从行到列的移动。

source: With the devel version of <code>tidyr</code><code>&lsquo;0.8.3.9000&rsquo;</code>, there is <code>pivot_wider</code> and <code>pivot_longer</code> which is generalized to do the reshaping (long -&gt; wide, wide -&gt; long, respectively) from 1 to multiple columns. Using the OP's data
es: Con la versi&oacute;n de desarrollo de <code>tidyr</code> <code>&lsquo;0.8.3.9000&rsquo;</code> , hay <code>pivot_wider</code> y <code>pivot_longer</code> que se generaliza para hacer la remodelaci&oacute;n (largo -&gt; ancho, ancho -&gt; largo, respectivamente) de 1 a varias columnas. Usando los datos del OP
ja: <code>tidyr</code> <code>&lsquo;0.8.3.9000&rsquo;</code> バージョンでは、1から複数の列への再形成（それぞれ、長い-&gt;広い、広い-&gt;長い）を行うように一般化された、 <code>pivot_wider</code> と <code>pivot_longer</code> があります。 OPのデータの使用
ko: <code>tidyr</code> <code>&lsquo;0.8.3.9000&rsquo;</code> 의 devel 버전에는 <code>pivot_wider</code> 및 <code>pivot_longer</code> 가 있으며 1에서 여러 열로 재구성 (각각 long- &gt; wide, wide- &gt; long)을 수행하도록 일반화됩니다. OP의 데이터 사용
ru: В версии <code>tidyr</code> devel <code>&lsquo;0.8.3.9000&rsquo;</code> есть <code>pivot_wider</code> и <code>pivot_longer</code> , которые обобщенно выполняют изменение формы (long -&gt; wide, wide -&gt; long соответственно) от 1 до нескольких столбцов. Использование данных ОП
zh_cn: 在 <code>tidyr</code> '0.8.3.9000 <code>&lsquo;0.8.3.9000&rsquo;</code> 的开发版本中，存在 <code>pivot_wider</code> 和 <code>pivot_longer</code> ，它们被概括为从1列更改为多列（长-&gt;宽，宽-&gt;长）。 使用OP的数据

source: You can do this with the <code>reshape()</code> function, or with the <code>melt()</code> / <code>cast()</code> functions in the reshape package. For the second option, example code is
es: Puede hacer esto con la funci&oacute;n <code>reshape()</code> , o con las funciones <code>melt()</code> / <code>cast()</code> en el paquete reshape. Para la segunda opci&oacute;n, el c&oacute;digo de ejemplo es
ja: これを行うには、 <code>reshape()</code> 関数を使用するか、reshapeパッケージ内の <code>melt()</code> / <code>cast()</code> 関数を使用します。 2番目のオプションのコード例は次のとおりです。
ko: <code>reshape()</code> 함수 또는 reshape 패키지의 <code>melt()</code> / <code>cast()</code> 함수를 사용하여이 작업을 수행 할 수 있습니다. 두 번째 옵션의 경우 예제 코드는
ru: Вы можете сделать это с помощью функции <code>reshape()</code> или с функциями <code>melt()</code> / <code>cast()</code> в пакете reshape. Для второго варианта пример кода
zh_cn: 您可以使用 <code>reshape()</code> 函数或reshape包中的 <code>melt()</code> / <code>cast()</code> 函数来完成此操作。 对于第二个选项，示例代码为

source: if you want to go back from wide to long, only change Wide to Long, and no changes in objects.
es: si quieres volver de ancho a largo,sólo cambia de ancho a largo,y no hay cambios en los objetos.
ja: ワイドからロングに戻したい場合は、ワイドをロングに変更するだけで、オブジェクトの変更はありません。
ko: 넓게에서 길게 돌아가려면 객체에서 변경하지 않고 넓게 만 변경하십시오.
ru: если вы хотите вернуться от широкого к длинному,измените только Широкий на Длинный,и никаких изменений в объектах.
zh_cn: 如果你想从宽到长,只改宽到长,不改变对象。

source: much easier way!
es: mucho más fácil!
ja: らくらく
ko: 훨씬 쉬운 방법!
ru: гораздо проще!
zh_cn: 更简单的方法!

source: the optional <code>sep</code> argument is the separator used in between <code>timevar</code> class names and <code>v.names</code> in the output <code>data.frame</code>.
es: el argumento opcional <code>sep</code> es el separador utilizado entre los nombres de clase <code>v.names</code> y v.names en el <code>data.frame</code> de salida.
ja: オプションの <code>sep</code> 引数は、 <code>timevar</code> クラス名と出力 <code>data.frame</code> の <code>v.names</code> の間で使用される区切り文字です 。
ko: 선택적 <code>sep</code> 인수는 <code>timevar</code> 클래스 이름과 출력 <code>v.names</code> 사이에 사용되는 구분 기호입니다.
ru: необязательный аргумент <code>sep</code> - это разделитель, используемый между <code>timevar</code> классов <code>v.names</code> и v.names в выходном <code>data.frame</code> .
zh_cn: 可选的 <code>sep</code> 参数是在输出 <code>data.frame</code> <code>v.names</code> 中的 <code>timevar</code> 类名称和v.name之间使用的分隔符。
