Repository: rueisnom/feedback
Catalog: xlf/10/06/72/66/10067266.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Values which are not variables basically follow the same rules, though you could then also escape any metacharacters instead of quoting them. For a common example, a URL with a <code>&amp;</code> in it will be parsed by the shell as a background command unless the metacharacter is escaped or quoted:
es: Los valores que no son variables b&aacute;sicamente siguen las mismas reglas, aunque tambi&eacute;n podr&iacute;a escapar a los metacaracteres en lugar de citarlos. Para un ejemplo com&uacute;n, una URL con un <code>&amp;</code> en ella ser&aacute; analizada por el shell como un comando de fondo a menos que se escape o se cite el metacar&aacute;cter:
ja: 変数ではない値は基本的に同じルールに従いますが、メタ文字を引用する代わりにエスケープすることもできます。 一般的な例として、メタ文字がエスケープまたは引用符で囲まれていない限り、 <code>&amp;</code> を含むURLはシェルによってバックグラウンドコマンドとして解析されます。
ko: 변수가 아닌 값은 기본적으로 동일한 규칙을 따르지만 메타 문자를 인용하는 대신 이스케이프 처리 할 수도 있습니다. 일반적인 예를 들어, 메타 문자가 이스케이프되거나 인용되지 않는 한 쉘에 <code>&amp;</code> 가 포함 된 URL은 백그라운드 명령으로 구문 분석됩니다.
ru: Значения, которые не являются переменными, в основном следуют тем же правилам, хотя вы можете также избегать любых метасимволов вместо того, чтобы заключать их в кавычки. В общем примере URL с символом <code>&amp;</code> в нем будет обрабатываться оболочкой как фоновая команда, если метасимвол не экранирован или не заключен в кавычки:
zh_cn: 不是变量的值基本上遵循相同的规则，尽管您也可以转义任何元字符而不用引用它们。 对于一个常见的示例，shell中会将带有 <code>&amp;</code> 的URL解析为背景命令，除非对元字符进行转义或引用：

source: What are the special dollar sign shell variables?
es: ¿Cuáles son las variables especiales del signo del dólar?
ja: 特殊なドル記号シェル変数とは?
ko: 특수 달러 기호 쉘 변수는 무엇입니까?
ru: Каковы специальные переменные оболочки знака доллара?
zh_cn: 有哪些特殊的元符号壳变量?

source: When is double quoting necessary?
es: ¿Cuándo es necesario citar dos veces?
ja: ダブルクォートが必要なのはいつですか?
ko: 큰 따옴표는 언제 필요합니까?
ru: Когда необходимо двойное цитирование?
zh_cn: 什么时候需要重复引用?

source: When to wrap quotes around a shell variable
es: Cuándo envolver las citas alrededor de una variable de la cáscara
ja: シェル変数を引用符で囲む場合
ko: 쉘 변수를 따옴표로 묶을 때
ru: Когда обернуть кавычки вокруг переменной оболочки.
zh_cn: 何时在shell变量周围使用引号?

source: When you know that a variable can only contain a value which contains no shell metacharacters, quoting is optional. Thus, an unquoted <code>$?</code> is basically fine, because this variable can only ever contain a single number. However, <code>"$?"</code> is also correct, and recommended for general consistency and correctness (though this is my personal recommendation, not a widely recognized policy).
es: Cuando sabe que una variable solo puede contener un valor que no contiene metacaracteres de shell, las comillas son opcionales. Por lo tanto, un <code>$?</code> comillas ? b&aacute;sicamente est&aacute; bien, porque esta variable solo puede contener un solo n&uacute;mero. Sin embargo, <code>"$?"</code> tambi&eacute;n es correcto y se recomienda por su consistencia y correcci&oacute;n general (aunque esta es mi recomendaci&oacute;n personal, no es una pol&iacute;tica ampliamente reconocida).
ja: 変数にシェルのメタ文字を含まない値のみを含めることができることがわかっている場合、引用符は省略可能です。 したがって、引用符で囲まれていない <code>$?</code> この変数は1つの数値しか含むことができないため、基本的には問題ありません。 ただし、 <code>"$?"</code> も正しく、一般的な一貫性と正確さのために推奨されています（これは私の個人的な推奨事項であり、広く認知されているポリシーではありません）。
ko: 변수에 쉘 메타 문자를 포함하지 않는 값만 포함 할 수 있다는 것을 알고 있으면 인용은 선택 사항입니다. 따라서 인용되지 않은 <code>$?</code> 이 변수는 단일 숫자 만 포함 할 수 있기 때문에 기본적으로 좋습니다. 그러나 <code>"$?"</code> 또한 정확하고 일반적인 일관성과 정확성을 위해 권장됩니다 (일반적으로 인정되는 정책이 아니라 개인적 권장 사항 임).
ru: Когда вы знаете, что переменная может содержать только значение, которое не содержит метасимволов оболочки, заключение в кавычки необязательно. Таким образом, без кавычек <code>$?</code> в принципе нормально, потому что эта переменная может содержать только одно число. Тем не менее, <code>"$?"</code> также правильно и рекомендуется для общей последовательности и правильности (хотя это моя личная рекомендация, а не общепризнанная политика).
zh_cn: 当您知道一个变量只能包含一个不包含外壳元字符的值时，引号是可选的。 因此，未 <code>$?</code> 基本上没问题，因为此变量只能包含一个数字。 但是， <code>"$?"</code> 也是正确的，因此推荐使用，以确保总体一致性和正确性（尽管这是我个人的建议，而不是公认的政策）。

source: Wildcard expansion:
es: Expansión de comodín:
ja: ワイルドカード展開。
ko: 와일드 카드 확장 :
ru: Расширение Wildcard:
zh_cn: 通行证扩展。

source: around standard numeric variables (<code>$$</code>, <code>$?</code>, <code>$#</code> etc.)
es: alrededor de variables num&eacute;ricas est&aacute;ndar ( <code>$$</code> , <code>$?</code> , <code>$#</code> etc.)
ja: 標準数値変数の周り（ <code>$$</code> 、 <code>$?</code> 、 <code>$#</code> など）
ko: 표준 숫자 변수 주위 ( <code>$$</code> , <code>$?</code> ?, <code>$#</code> 등)
ru: вокруг стандартных числовых переменных ( <code>$$</code> , <code>$?</code> , <code>$#</code> и т. д.)
zh_cn: 围绕标准数值变量（ <code>$$</code> ， <code>$?</code> ， <code>$#</code> 等）

source: can be pasted together back to back, forming a single long string after tokenization and quote removal.
es: pueden ser pegados juntos espalda con espalda,formando una sola cuerda larga después de la eliminación de las fichas y las citas.
ja: は、トークン化と引用符除去の後に、1つの長い文字列を形成するために、後ろから後ろに貼り付けることができます。
ko: 토큰 화 및 따옴표 제거 후에 하나의 긴 문자열을 형성하여 연속적으로 붙여 넣을 수 있습니다.
ru: могут быть вставлены обратно в спину,образуя единую длинную строку после токенирования и удаления кавычек.
zh_cn: 可以背对背地粘贴在一起,在去掉令牌和引号后形成一个长的字符串。

source: command names and arguments that have whitespace in them
es: comandan nombres y argumentos que tienen espacios en blanco en ellos
ja: ホワイトスペースを含むコマンド名と引数
ko: 공백이있는 명령 이름 및 인수
ru: имена команд и аргументы,в которых есть пробелы.
zh_cn: 命令名和参数中带空格的命令名称和参数

source: command substitutions (<code>"$(ls)"</code>, <code>"`ls`"</code>)
es: sustituciones de comandos ( <code>"$(ls)"</code> , <code>"`ls`"</code> )
ja: コマンド置換（ <code>"$(ls)"</code> 、 <code>"`ls`"</code> ）
ko: 명령 대체 ( <code>"$(ls)"</code> , <code>"`ls`"</code> )
ru: подстановки команд ( <code>"$(ls)"</code> , <code>"`ls`"</code> )
zh_cn: 命令替换（ <code>"$(ls)"</code> ， <code>"`ls`"</code> ）

source: echo "$url name" -- ( Cannot be used at such situations so take precaution before using it )
es: eco "$url name" --(No puede ser usado en tales situaciones,así que tome precauciones antes de usarlo )
ja: echo "$url名" --(こういう時には使えないので注意してください)
ko: echo "$ url name"-(이런 상황에서는 사용할 수 없으므로 사용하기 전에 예방 조치를 취하십시오)
ru: echo "$url name" --(Не может быть использовано в таких ситуациях,поэтому принимайте меры предосторожности перед использованием )
zh_cn: echo "$url name" --(不能在这种情况下使用,所以在使用前要谨慎使用 )

source: echo "$url name" -- ( Can be used at all times )
es: eco "$url name" --(Puede ser usado en todo momento )
ja: echo "$url名" --(いつでも使用可能)
ko: echo "$ url name"-(항상 사용 가능)
ru: echo "$url name" --(Может использоваться в любое время )
zh_cn: echo "$url name" --(可随时使用 )

source: globs where directory path or file name part includes spaces (<code>"/my dir/"*</code>)
es: globs donde la ruta del directorio o la parte del nombre del archivo incluye espacios ( <code>"/my dir/"*</code> )
ja: ディレクトリパスまたはファイル名の部分にスペースが含まれるグロブ（ <code>"/my dir/"*</code> ）
ko: 디렉토리 경로 또는 파일 이름 부분에 공백이 포함 된 곳 ( <code>"/my dir/"*</code> )
ru: globs, где путь к каталогу или часть имени файла содержит пробелы ( <code>"/my dir/"*</code> )
zh_cn: 目录路径或文件名部分包含空格（ <code>"/my dir/"*</code> ）的问题

source: in arithmetic contexts like <code>((count++))</code>, <code>"${arr[idx]}"</code>, <code>"${string:start:length}"</code>
es: en contextos aritm&eacute;ticos como <code>((count++))</code> , <code>"${arr[idx]}"</code> , <code>"${string:start:length}"</code>
ja: <code>((count++))</code> 、 <code>"${arr[idx]}"</code> 、 <code>"${string:start:length}"</code> ような算術コンテキスト
ko: <code>((count++))</code> , <code>"${arr[idx]}"</code> , <code>"${string:start:length}"</code> 와 같은 산술 컨텍스트에서
ru: в арифметических контекстах, таких как <code>((count++))</code> , <code>"${arr[idx]}"</code> , <code>"${string:start:length}"</code>
zh_cn: 在 <code>((count++))</code> ， <code>"${arr[idx]}"</code> ， <code>"${string:start:length}"</code> 等算术上下文中

source: inside <code>[[ ]]</code> expression which is free from word splitting and globbing issues (this is a matter of style and opinions can vary widely)
es: dentro de la expresi&oacute;n <code>[[ ]]</code> que est&aacute; libre de problemas de divisi&oacute;n de palabras y problemas globales (esto es una cuesti&oacute;n de estilo y las opiniones pueden variar ampliamente)
ja: 内部 <code>[[ ]]</code> 式（単語の分割やグロビングの問題がない）（これはスタイルの問題であり、意見は大きく異なる場合があります）
ko: 내부의 <code>[[ ]]</code> 표현은 단어 분리 및 글 로빙 문제가 없음 (스타일의 문제이며 의견은 다양 할 수 있음)
ru: внутри выражения <code>[[ ]]</code> котором нет проблем с разделением слов и глобализацией (это вопрос стиля и мнения могут сильно различаться)
zh_cn: 内部 <code>[[ ]]</code> 表达式中没有分词和通配问题（这是样式问题，意见可能有很大不同）

source: literal strings that need interpolation to be suppressed ( <code>'Really costs $$!'</code>, <code>'just a backslash followed by a t: \t'</code>)
es: cadenas literales que necesitan interpolaci&oacute;n para ser suprimidas ( <code>'Really costs $$!'</code> , <code>'just a backslash followed by a t: \t'</code> )
ja: 補間を抑制する必要のあるリテラル文字列（ <code>'Really costs $$!'</code> 、 <code>'just a backslash followed by a t: \t'</code> ）
ko: 보간을 억제해야하는 리터럴 문자열 ( <code>'Really costs $$!'</code> , <code>'just a backslash followed by a t: \t'</code> )
ru: литеральные строки, для подавления которых требуется интерполяция ( <code>'Really costs $$!'</code> , <code>'just a backslash followed by a t: \t'</code> )
zh_cn: 需要抑制插值的文字字符串（ <code>'Really costs $$!'</code> ， <code>'just a backslash followed by a t: \t'</code> ）

source: literal strings with whitespace (<code>"StackOverflow rocks!"</code>, <code>"Steve's Apple"</code>)
es: cadenas literales con espacios en blanco ( <code>"StackOverflow rocks!"</code> , <code>"Steve's Apple"</code> )
ja: 空白を含むリテラル文字列（ <code>"StackOverflow rocks!"</code> 、 <code>"Steve's Apple"</code> ）
ko: 공백이있는 리터럴 문자열 ( <code>"StackOverflow rocks!"</code> , <code>"Steve's Apple"</code> )
ru: буквенные строки с пробелами ( <code>"StackOverflow rocks!"</code> , <code>"Steve's Apple"</code> )
zh_cn: 带空格的文字字符串（ <code>"StackOverflow rocks!"</code> ， <code>"Steve's Apple"</code> ）

source: regex literals that need interpolation to be suppressed
es: literales regex que necesitan interpolación para ser suprimidos
ja: 抑圧するために補間を必要とする正規表現リテラル
ko: 보간을 억제해야하는 정규식 리터럴
ru: регекс-литералы,которые нуждаются в интерполяции для подавления
zh_cn: 需要插值的字库

source: to protect double quotes (<code>'The "crux"'</code>)
es: para proteger las comillas dobles ( <code>'The "crux"'</code> )
ja: 二重引用符を保護する（ <code>'The "crux"'</code> ）
ko: 큰 따옴표를 보호하기 위해 ( <code>'The "crux"'</code> )
ru: для защиты двойных кавычек ( <code>'The "crux"'</code> )
zh_cn: 保护双引号（ <code>'The "crux"'</code> ）

source: to protect single quotes (<code>"single'quote'delimited'string"</code>)
es: para proteger comillas simples ( <code>"single'quote'delimited'string"</code> )
ja: 単一引用符を保護する（ <code>"single'quote'delimited'string"</code> ）
ko: 작은 따옴표를 보호하기 위해 ( <code>"single'quote'delimited'string"</code> )
ru: для защиты одинарных кавычек ( <code>"single'quote'delimited'string"</code> )
zh_cn: 保护单引号（ <code>"single'quote'delimited'string"</code> ）

source: use shell quoting for literals involving special characters (<code>$'\n\t'</code>)
es: use comillas para los literales que involucran caracteres especiales ( <code>$'\n\t'</code> )
ja: 特殊文字を含むリテラル（ <code>$'\n\t'</code> ）にはシェル引用を使用します
ko: 특수 문자 ( <code>$'\n\t'</code> )와 관련된 리터럴에 쉘 인용 사용
ru: использовать кавычки для литералов, включающих специальные символы ( <code>$'\n\t'</code> )
zh_cn: 对包含特殊字符（ <code>$'\n\t'</code> ）的文字使用外壳引号

source: use shell quoting where we need to protect several single and double quotes (<code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code>)
es: use comillas de shell donde necesitemos proteger varias comillas simples y dobles ( <code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code> )
ja: 複数の単一引用符と二重引用符を保護する必要がある場合は、シェル引用を使用します（ <code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code> ）
ko: 여러 개의 작은 따옴표와 큰 따옴표를 보호 해야하는 곳에 셸 따옴표를 사용하십시오 ( <code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code> )
ru: использовать кавычки оболочки, где нам нужно защитить несколько одинарных и двойных кавычек ( <code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code> )
zh_cn: 在需要保护多个单引号和双引号的地方使用外壳引号（ <code>$'{"table": "users", "where": "first_name"=\'Steve\'}'</code> ）

source: variable expansions (<code>"$var"</code>, <code>"${arr[@]}"</code>)
es: expansiones variables ( <code>"$var"</code> , <code>"${arr[@]}"</code> )
ja: 変数展開（ <code>"$var"</code> 、 <code>"${arr[@]}"</code> ）
ko: 변수 확장 ( <code>"$var"</code> , <code>"${arr[@]}"</code> )
ru: раскрытие переменных ( <code>"$var"</code> , <code>"${arr[@]}"</code> )
zh_cn: 变量扩展（ <code>"$var"</code> ， <code>"${arr[@]}"</code> ）

source: where we want <code>~</code> to be interpreted as <code>$HOME</code> (<code>~/"some dir"</code> but not <code>"~/some dir"</code>)
es: donde queremos que <code>~</code> se interprete como <code>$HOME</code> ( <code>~/"some dir"</code> pero no <code>"~/some dir"</code> )
ja: <code>~</code> を <code>$HOME</code> として解釈したい場合（ <code>~/"some dir"</code> ではなく <code>"~/some dir"</code> ）
ko: 여기서 <code>~</code> 는 <code>$HOME</code> 으로 해석되기를 원합니다 ( <code>~/"some dir"</code> 이지만 <code>"~/some dir"</code> )
ru: где мы хотим, чтобы <code>~</code> интерпретировалось как <code>$HOME</code> ( <code>~/"some dir"</code> , но не <code>"~/some dir"</code> )
zh_cn: 我们希望 <code>~</code> 被解释为 <code>$HOME</code> （ <code>~/"some dir"</code> 而不是 <code>"~/some dir"</code> ）

source: where we want globbing (<code>for txtfile in *.txt; do ...</code>)
es: donde queremos globbing ( <code>for txtfile in *.txt; do ...</code> )
ja: <code>for txtfile in *.txt; do ...</code> 必要な場所（ * .txtのtxtfileの場合、実行... ）
ko: 우리가 globbing 할 곳 ( <code>for txtfile in *.txt; do ...</code> )
ru: где мы хотим, <code>for txtfile in *.txt; do ...</code> ( для txtfile в * .txt; do ... )
zh_cn: 我们想要浏览的位置（ <code>for txtfile in *.txt; do ...</code> ）

source: where we want word splitting (<code>for word in $words</code>)
es: donde queremos dividir palabras ( <code>for word in $words</code> )
ja: 単語分割が必要な場所（ <code>for word in $words</code> ）
ko: 우리는 단어 분할을 원합니다 ( <code>for word in $words</code> )
ru: где мы хотим разделить слова ( <code>for word in $words</code> )
zh_cn: 我们要分词的地方（ <code>for word in $words</code> ）
