Repository: rueisnom/feedback
Catalog: xlf/10/06/72/66/10067266.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Of course, this also happens if the URL is in an unquoted variable.) For a static string, single quotes make the most sense, although any form of quoting or escaping works here.
es: (Por supuesto,esto también sucede si el URL está en una variable no citada.)Para una cadena estática,las citas simples tienen más sentido,aunque cualquier forma de citar o escapar funciona aquí.
ja: (もちろん、これは URL が引用符で囲まれていない変数にある場合にも起こります。)静的な文字列の場合は、シングルクォートが最も意味を持ちますが、ここではどのような形式の引用符やエスケープも機能します。
ko: (물론, URL이 인용되지 않은 변수에있는 경우에도 발생합니다.) 정적 문자열의 경우 작은 따옴표가 가장 적합하지만 모든 인용 또는 이스케이프 형식이 여기에서 작동합니다.
ru: (Конечно,это также происходит,если URL находится в некотируемой переменной.)Для статической строки,одиночные кавычки имеют наибольший смысл,хотя любая форма кавычки или экранирования работает здесь.
zh_cn: (当然,如果URL是在一个无引号的变量中,也会出现这种情况。)对于静态字符串来说,单引号是最合理的,尽管任何形式的引号或转义都可以在这里使用。

source: (The loop is completely superfluous in the latter example; <code>printf</code> specifically works fine with multiple arguments. <code>stat</code> too. But looping over a wildcard match is a common problem, and frequently done incorrectly.)
es: (El bucle es completamente superfluo en el &uacute;ltimo ejemplo; <code>printf</code> funciona espec&iacute;ficamente bien con m&uacute;ltiples argumentos. <code>stat</code> tambi&eacute;n. Pero recorrer un comod&iacute;n es un problema com&uacute;n, y con frecuencia se hace incorrectamente).
ja: （後者の例ではループは完全に不要です <code>printf</code> 特に複数の引数で正常に機能します <code>stat</code> も同様です。ただし、ワイルドカードの一致でのループは一般的な問題であり、しばしば正しく行われません。）
ko: (후자는 예제에서 루프가 완전히 불필요한 것입니다. <code>printf</code> 는 특히 여러 개의 인수와 함께 잘 작동합니다.
ru: (Цикл совершенно лишний в последнем примере; <code>printf</code> определенно отлично работает с несколькими аргументами. <code>stat</code> тоже. Но зацикливание на совпадении с подстановочными знаками является распространенной проблемой и часто выполняется неправильно.)
zh_cn: （在后一个示例中，循环是完全多余的； <code>printf</code> 特别适用于多个参数 <code>stat</code> 也可以。但是循环使用通配符匹配是一个常见问题，并且经常做不正确。）

source: (The loop only runs once, over the literal single-quoted string.)
es: (El bucle sólo se ejecuta una vez,sobre la cadena literal de una sola cita.)
ja: (ループはリテラルのシングルクォート文字列に対して一度だけ実行されます)
ko: (루프는 작은 따옴표로 묶인 문자열보다 한 번만 실행됩니다.)
ru: (Цикл выполняется только один раз,через одноцитарную строку литерала).
zh_cn: (这个循环只运行一次,在单引号字符串的字面意义上的循环)。

source: (The loop only runs once, over the single, quoted string.)
es: (El bucle sólo se ejecuta una vez,sobre la única y citada cadena.)
ja: (ループは引用符で囲まれた単一の文字列に対して一度だけ実行されます)
ko: 루프는 작은 따옴표로 묶인 문자열에 대해 한 번만 실행됩니다.
ru: (Цикл выполняется только один раз,над единственной,цитируемой строкой).
zh_cn: (该循环只运行一次,在单引号字符串上运行一次)。

source: (There is no file named <code>$pattern</code>, either!)
es: (&iexcl;Tampoco hay un archivo llamado <code>$pattern</code> !)
ja: （ <code>$pattern</code> という名前のファイルもありません！）
ko: ( <code>$pattern</code> 이라는 파일도 없습니다!)
ru: (Также нет файла с именем <code>$pattern</code> !)
zh_cn: （也没有名为 <code>$pattern</code> 文件！）

source: (There is no file named literally <code>file*.txt</code>.)
es: (No hay ning&uacute;n archivo llamado literalmente <code>file*.txt</code> ).
ja: （文字通り <code>file*.txt</code> という名前のファイルはありません。）
ko: (말 그대로 <code>file*.txt</code> 라는 파일이 없습니다.)
ru: (Нет файла с буквальным именем <code>file*.txt</code> .)
zh_cn: （没有文件名叫 <code>file*.txt</code> 。）

source: <code>$?</code> doesn't need quotes since it's a numeric value. Whether <code>$URL</code> needs it depends on what you allow in there and whether you still want an argument if it's empty.
es: <code>$?</code> no necesita comillas ya que es un valor num&eacute;rico. Si <code>$URL</code> necesita depende de lo que permita all&iacute; y de si a&uacute;n desea un argumento si est&aacute; vac&iacute;o.
ja: <code>$?</code> 数値なので、引用符は必要ありません。 <code>$URL</code> がそれを必要とするかどうかは 、そこで許可するものと、空の場合でも引数が必要かどうかによって異なります。
ko: <code>$?</code> 숫자 값이므로 따옴표가 필요하지 않습니다. <code>$URL</code> 필요한지 여부는 허용 범위와 비어있는 경우 여전히 인수를 원하는지 여부에 따라 다릅니다.
ru: <code>$?</code> кавычки не нужны, так как это числовое значение. Потребность в <code>$URL</code> зависит от того, что вы там разрешаете, и хотите ли вы еще аргумент, если он пуст
zh_cn: <code>$?</code> 因为它是数字值，所以不需要引号。 <code>$URL</code> 是否需要它取决于您在其中允许的内容以及是否为空（如果为空）。

source: <strong>Double quotes</strong>
es: <strong>Doble comillas</strong>
ja: <strong>二重引用符</strong>
ko: <strong>큰 따옴표</strong>
ru: <strong>Двойные кавычки</strong>
zh_cn: <strong>双引号</strong>

source: <strong>No quotes</strong>
es: <strong>Sin comillas</strong>
ja: <strong>引用なし</strong>
ko: <strong>따옴표 없음</strong>
ru: <strong>Без кавычек</strong>
zh_cn: <strong>无引号</strong>

source: <strong>Single quotes</strong>
es: <strong>Comillas simples</strong>
ja: <strong>単一引用符</strong>
ko: <strong>작은 따옴표</strong>
ru: <strong>Одинарные кавычки</strong>
zh_cn: <strong>单引号</strong>

source: A variable containing a list of tokens to loop over or a wildcard to expand is less frequently seen, so we sometimes abbreviate to "quote everything unless you know precisely what you are doing".
es: Una variable que contiene una lista de fichas para enlazar o un comodín para expandir se ve con menos frecuencia,por lo que a veces abreviamos a "citar todo a menos que sepas exactamente lo que estás haciendo".
ja: ループオーバーするトークンのリストを含む変数や、展開するワイルドカードを含む変数はあまり見かけないので、「何をしているのか正確にわからない限り、すべてを引用する」と略すこともあります。
ko: 반복 할 토큰 목록 또는 확장 할 와일드 카드가 포함 된 변수는 자주 표시되지 않으므로 "정확히 수행중인 작업을 정확히 알지 않는 한 모든 것을 인용"하는 경우가 있습니다.
ru: Переменная,содержащая список маркеров для зацикливания или подстановочный символ для расширения,встречается реже,поэтому мы иногда сокращаем его до "цитируй все,если только ты не знаешь точно,что делаешь".
zh_cn: 含有要循环使用的令牌列表或通配符展开的变量比较少见,所以我们有时会缩写为 "除非你精确地知道你在做什么,否则就把所有的东西都引过来"。

source: And if so, why?
es: Y si es así,¿por qué?
ja: そうだとしたら、なぜ?
ko: 그렇다면 왜 그렇습니까?
ru: А если так,то почему?
zh_cn: 如果是,为什么?

source: As an aside, scripts <a href="http://mywiki.wooledge.org/ParsingLs">should usually not use <code>ls</code> for anything.</a> To expand a wildcard, just ... use it.
es: Por otro lado, los scripts <a href="http://mywiki.wooledge.org/ParsingLs">generalmente no deber&iacute;an usar <code>ls</code> para nada.</a> Para expandir un comod&iacute;n, solo ... &uacute;salo.
ja: 余談ですが、スクリプト<a href="http://mywiki.wooledge.org/ParsingLs">は通常 <code>ls</code> を使用しないでください。</a> ワイルドカードを展開するには、単に...使用します。
ko: 따로, 스크립트 <a href="http://mywiki.wooledge.org/ParsingLs">는 보통 <code>ls</code> 를 사용해서는 안됩니다.</a> 와일드 카드를 확장하려면 그냥 사용하십시오.
ru: Кроме того, сценарии <a href="http://mywiki.wooledge.org/ParsingLs">обычно не должны использовать <code>ls</code> ни для чего.</a> Чтобы расширить подстановочный знак, просто ... используйте его.
zh_cn: 顺便说一句，脚本<a href="http://mywiki.wooledge.org/ParsingLs">通常不应将 <code>ls</code> 用于任何内容。</a> 要扩展通配符，只需...使用它。

source: Bash parameter expansion (<code>"${filename##*/}"</code>)
es: Expansi&oacute;n del par&aacute;metro bash ( <code>"${filename##*/}"</code> )
ja: Bashパラメータ展開（ <code>"${filename##*/}"</code> ）
ko: 배시 매개 변수 확장 ( <code>"${filename##*/}"</code> )
ru: Расширение параметров Bash ( <code>"${filename##*/}"</code> )
zh_cn: Bash参数扩展（ <code>"${filename##*/}"</code> ）

source: By contrast:
es: Por el contrario:
ja: 対照的に
ko: 대조적으로 :
ru: Напротив:
zh_cn: 相比之下。

source: Could someone tell me whether or not I should wrap quotes around variables in a shell script?
es: ¿Podría alguien decirme si debería o no envolver las comillas alrededor de las variables en un guión de shell?
ja: 誰かシェルスクリプトで変数を引用符で囲むべきかどうか教えてください。
ko: 누군가 쉘 스크립트에서 변수 주위에 따옴표를 묶어야하는지 여부를 말해 줄 수 있습니까?
ru: Кто-нибудь может сказать мне,стоит ли мне обёртывать кавычки вокруг переменных в скрипте оболочки?
zh_cn: 谁能告诉我,我是否应该在shell脚本中用引号包住变量?

source: Difference between single and double quotes in Bash
es: Diferencia entre las comillas simples y dobles en Bash
ja: Bashでのシングルクォートとダブルクォートの違い
ko: Bash에서 작은 따옴표와 큰 따옴표의 차이점
ru: Разница между одинарными и двойными кавычками в Бэше
zh_cn: Bash中单引号和双引号的区别

source: Double quotes are suitable when variable interpolation is required. With suitable adaptations, it is also a good workaround when you need single quotes in the string. (There is no straightforward way to escape a single quote between single quotes, because there is no escape mechanism inside single quotes -- if there was, they would not quote completely verbatim.)
es: Las comillas dobles son adecuadas cuando se requiere una interpolación variable.Con las adaptaciones adecuadas,también es un buen método cuando se necesitan comillas simples en la cadena.(No hay una forma sencilla de escapar de una cita simple entre comillas simples,porque no hay un mecanismo de escape dentro de las comillas simples --si lo hubiera,no citarían completamente al pie de la letra).
ja: 二重引用符は、可変補間が必要な場合に適しています。また、文字列の中に単一引用符が必要な場合にも、適切に適応させれば良い回避策となります。(シングルクォートの間にシングルクォートをエスケープする簡単な方法はありません。シングルクォートの内部にはエスケープ機構がないからです。)
ko: 가변 보간이 필요한 경우 큰 따옴표가 적합합니다. 적절한 조정을 사용하면 문자열에 작은 따옴표가 필요할 때도 좋은 해결 방법입니다. 작은 따옴표 안에는 이스케이프 메커니즘이 없기 때문에 작은 따옴표 사이에 작은 따옴표를 이스케이프하는 간단한 방법은 없습니다.
ru: Двойные кавычки подходят,когда требуется интерполяция переменных.С подходящими адаптациями,это также хороший обходной путь,когда вам нужны одиночные кавычки в строке.(Нет простого способа экранировать одиночные кавычки между одиночными кавычками,потому что нет механизма экранирования внутри одиночных кавычек-если бы он был,то они бы не цитировались полностью дословно).
zh_cn: 双引号适用于需要变量插值时。在适当的调整下,当你需要在字符串中使用单引号时,它也是一个很好的变通方法。(没有直接的方法可以在单引号之间转义,因为单引号内部没有转义机制----如果有的话,它们就不会完全逐字逐句地引用。)

source: For example, is the following correct:
es: Por ejemplo,es lo siguiente correcto:
ja: 例えば、次のようなものが正しいでしょうか。
ko: 예를 들어 다음과 같습니다.
ru: Например,правильно следующее:
zh_cn: 例如,下列说法是否正确的是:

source: For using the variables in the shell script use " " quoted variables as the quoted one means that the variable may contain spaces or special character which won't affect the execution of your shell script. Else if you are sure of not having any spaces or special character in your variable name then you may use them without " ".
es: Para usar las variables en el script de shell use " " variables citadas ya que la cita significa que la variable puede contener espacios o caracteres especiales que no afectarán a la ejecución de su script de shell.Por otra parte,si está seguro de que no hay espacios o caracteres especiales en el nombre de la variable,puede utilizarlos sin " ".
ja: シェルスクリプトで変数を使用する場合は、" "で囲んだ変数を使用してください。引用符で囲んだ変数は、その変数にスペースや特殊文字が含まれていてもシェルスクリプトの実行に影響を及ぼさないことを意味します。もし、変数名にスペースや特殊文字が含まれていないことが確実であれば、" "を使わずに変数を使用しても構いません。
ko: 쉘 스크립트에서 변수를 사용하려면 인용 된 변수로 ""인용 된 변수를 사용하십시오. 변수에 공백 또는 특수 문자가 포함되어 쉘 스크립트의 실행에 영향을 미치지 않을 수 있음을 의미합니다. 그렇지 않으면 변수 이름에 공백이나 특수 문자가없는 경우 ""없이 사용할 수 있습니다.
ru: Для использования переменных в скрипте оболочки используйте " " переменные в кавычках,поскольку кавычки означают,что переменная может содержать пробелы или специальные символы,которые не будут влиять на выполнение вашего скрипта оболочки.В противном случае,если вы уверены,что в имени переменной нет пробелов или специальных символов,вы можете использовать их без " ".
zh_cn: 在shell脚本中使用变量时,请使用"" "引号变量,因为引号意味着变量可能包含空格或特殊字符,这不会影响到shell脚本的执行。否则,如果你确定变量名中没有空格或特殊字符,那么你可以使用没有""的变量。

source: General rule: quote it if it can either be empty or contain spaces (or any whitespace really) or special characters (wildcards). Not quoting strings with spaces often leads to the shell breaking apart a single argument into many.
es: Regla general:citarla si puede estar vacía o contener espacios (o cualquier espacio en blanco realmente)o caracteres especiales (comodines).No citar cadenas con espacios a menudo lleva a que la cáscara se rompa en muchos.
ja: 一般的なルール:空であるか、スペース(または空白)や特殊文字(ワイルドカード)が含まれている場合は引用符で囲みます。スペースを含む文字列をクォートしないと、シェルが一つの引数を多くの引数に分解してしまうことがよくあります。
ko: 일반 규칙 : 비어 있거나 공백 (또는 실제로 공백) 또는 특수 문자 (와일드 카드)를 포함 할 수 있으면 인용하십시오. 공백으로 문자열을 인용하지 않으면 쉘이 단일 인수를 여러 개로 나누는 경우가 많습니다.
ru: Общее правило:процитируйте его,если он может быть пустым или содержать пробелы (или любые пробелы на самом деле)или специальные символы (подстановочные знаки).Отсутствие кавычек в строках с пробелами часто приводит к тому,что оболочка разбивает один аргумент на множество.
zh_cn: 一般规则:如果它可以是空的,或者包含空格(或任何空格)或特殊字符(通配符),那么就引用它。不引用带空格的字符串往往会导致shell将一个参数拆成很多个参数。

source: Here is a three-point formula for quotes in general:
es: Aquí hay una fórmula de tres puntos para las citas en general:
ja: 一般的な相場の3点式をご紹介します。
ko: 일반적으로 따옴표에 대한 3 점 공식은 다음과 같습니다.
ru: Вот формула из трех пунктов для котировок в целом:
zh_cn: 下面是一般的引号的三点公式。

source: I do use <code>$var</code> as a simple way to join lines:
es: Yo uso <code>$var</code> como una forma simple de unir l&iacute;neas:
ja: 行を結合する簡単な方法として <code>$var</code> を使用します。
ko: 나는 라인을 결합하는 간단한 방법으로 <code>$var</code> 를 사용합니다.
ru: Я использую <code>$var</code> как простой способ объединения строк:
zh_cn: 我确实使用 <code>$var</code> 作为连接行的简单方法：

source: I generally use quoted like <code>"$var"</code> for safe, unless I am sure that <code>$var</code> does not contain space.
es: Por lo general, uso comillas como <code>"$var"</code> para la seguridad, a menos que est&eacute; seguro de que <code>$var</code> no contiene espacio.
ja: <code>$var</code> スペースが含まれていないことが確実でない限り、私は通常、安全のために <code>"$var"</code> ような引用符を使用します。
ko: <code>$var</code> 공백이없는 것이 확실하지 않으면 일반적으로 안전을 위해 <code>"$var"</code> 와 같이 따옴표를 사용합니다.
ru: Я обычно использую кавычки как <code>"$var"</code> для безопасного, если я не уверен, что <code>$var</code> не содержит пробела.
zh_cn: 为了安全起见，我通常使用引号，例如 <code>"$var"</code> ，除非我确定 <code>$var</code> 不包含空间。

source: I tend to always quote strings just out of habit since it's safer that way.
es: Tiendo a citar siempre cuerdas por costumbre,ya que es más seguro de esa manera.
ja: その方が安全なので、私はいつも癖で文字列を引用する傾向があります。
ko: 나는 문자열이 그렇게 안전하기 때문에 항상 습관에서 벗어나 인용하는 경향이 있습니다.
ru: Я всегда склонен цитировать строки просто по привычке,так как так безопаснее.
zh_cn: 我总是习惯性的引用字符串,因为这样比较安全。

source: In contexts where we are absolutely sure that there are no word splitting or globbing issues or we <em>do want word splitting and globbing</em>.
es: En contextos en los que estamos absolutamente seguros de que no hay problemas de divisi&oacute;n de palabras o globbing o si <em>queremos dividir palabras y globbing</em> .
ja: 単語の分割やグロビングの問題がないことが確実であるか、単語の分割やグロビングが必要な場合。
ko: 단어 분리 또는 글 로빙 문제가 전혀 없거나 단어 분리 및 글 로빙을 <em>원할 경우</em>
ru: В тех случаях, когда мы абсолютно уверены, что нет проблем с разделением слов или глобализацией, или мы <em>действительно хотим разделения и глобализации слова</em> .
zh_cn: 在我们绝对确定没有分词或通配符问题的情况下，或者我们<em>确实希望分词和通配符</em> 。

source: In contexts where we want to suppress word splitting and globbing. Also in contexts where we want the literal to be treated as a string, not a regex.
es: En contextos en los que queremos suprimir la división de palabras y el "globbing".También en contextos donde queremos que lo literal sea tratado como una cuerda,no como un regex.
ja: 単語の分割やグロブ化を抑制したい場合に使用します。また、リテラルを正規表現ではなく文字列として扱いたい場合にも使用します。
ko: 단어 분리 및 글 로빙을 억제하려는 상황에서. 또한 리터럴이 정규식이 아닌 문자열로 처리되기를 원하는 컨텍스트에서.
ru: В контекстах,где мы хотим подавить разделение слов и шарканье.Также в контекстах,где мы хотим,чтобы литерал рассматривался как строка,а не как регекс.
zh_cn: 在我们想要抑制拆分和globbing的情况下。也适用于我们希望将字面符号作为字符串,而不是regex处理的情况。

source: In more concrete terms, anything containing a filename should usually be quoted (because filenames can contain whitespace and other shell metacharacters). Anything containing a URL should usually be quoted (because many URLs contain shell metacharacters like <code>?</code> and <code>&amp;</code>). Anything containing a regex should usually be quoted (ditto ditto). Anything containing significant whitespace other than single spaces between non-whitespace characters needs to be quoted (because otherwise, the shell will munge the whitespace into, effectively, single spaces, and trim any leading or trailing whitespace).
es: En t&eacute;rminos m&aacute;s concretos, cualquier cosa que contenga un nombre de archivo generalmente debe citarse (porque los nombres de archivo pueden contener espacios en blanco y otros metacaracteres de shell). Cualquier cosa que contenga una URL generalmente debe citarse (porque muchas URL contienen metacaracteres de shell como <code>?</code> Y <code>&amp;</code> ). Cualquier cosa que contenga una expresi&oacute;n regular generalmente debe citarse (&iacute;dem &iacute;dem). Cualquier cosa que contenga espacios en blanco significativos que no sean espacios individuales entre caracteres que no sean espacios en blanco debe ser citado (porque de lo contrario, el shell combinar&aacute; el espacio en blanco, efectivamente, en espacios individuales y recortar&aacute; cualquier espacio en blanco inicial o final).
ja: 具体的には、ファイル名を含むものは通常引用符で囲む必要があります（ファイル名には空白やその他のシェルメタ文字を含めることができるため）。 通常、URLを含むものはすべて引用符で囲む必要があります（多くのURLには <code>?</code> や <code>&amp;</code> などのシェルメタ文字が含まれているため）。 正規表現を含むものは通常、引用符で囲む必要があります（同上）。 空白以外の文字間の単一の空白以外の重要な空白を含むものは引用符で囲む必要があります（そうしないと、シェルは空白を効果的に単一の空白に変換し、先頭または末尾の空白を削除します）。
ko: 좀 더 구체적으로 말하면 파일 이름을 포함하는 모든 항목은 일반적으로 인용해야합니다 (파일 이름은 공백 및 기타 셸 메타 문자를 포함 할 수 있기 때문에). URL을 포함하는 것은 일반적으로 따옴표로 묶어야합니다 (많은 URL에 <code>?</code> 및 <code>&amp;</code> 와 같은 셸 메타 문자가 포함되어 있기 때문에). 정규식을 포함하는 것은 일반적으로 인용해야합니다 (ditto ditto). 공백이 아닌 문자 사이에 단일 공백 ​​이외의 공백이 포함 된 것은 따옴표로 묶어야합니다 (그렇지 않으면 쉘은 공백을 효과적으로 단일 공백으로 축소하고 앞뒤 공백을 잘라냅니다).
ru: Говоря более конкретно, все, что содержит имя файла, обычно должно заключаться в кавычки (поскольку имена файлов могут содержать пробелы и другие метасимволы оболочки). Все, что содержит URL, обычно следует заключать в кавычки (поскольку многие URL содержат метасимволы оболочки, такие как <code>?</code> И <code>&amp;</code> ). Все, что содержит регулярное выражение, обычно должно быть заключено в кавычки (то же самое). Все, что содержит значительные пробелы, кроме одинарных пробелов между непробельными символами, должно быть заключено в кавычки (потому что в противном случае оболочка превратит пробельные символы в эффективные одиночные пробелы и обрежет любые начальные или конечные пробельные символы).
zh_cn: 用更具体的术语来说，任何包含文件名的内容通常都应加引号（因为文件名可以包含空格和其他shell元字符）。 包含URL的任何内容通常都应加引号（因为许多URL包含诸如 <code>?</code> 和 <code>&amp;</code> 之类的shell元字符）。 包含正则表达式的任何内容通常都应加引号（同上同上）。 除非空格字符之间的单个空格外，任何包含有效空格的内容都必须加引号（否则，外壳程序会将空格有效地切为单个空格，并修剪所有前导或尾随空格）。

source: In short, quote everything where you do not require the shell to perform token splitting and wildcard expansion.
es: En resumen,cita todo lo que no requiere que la cáscara realice la división de fichas y la expansión de comodines.
ja: 要するに、シェルがトークン分割やワイルドカード展開を行う必要がない場合は、すべて引用符で囲んでください。
ko: 간단히 말해, 쉘이 토큰 분할 및 와일드 카드 확장을 수행하지 않아도되는 모든 것을 인용하십시오.
ru: Короче говоря,процитируйте все,где вам не требуется оболочка для выполнения разделения токенов и расширения wildcard.
zh_cn: 简而言之,凡是不需要shell执行令牌分割和通配符扩展的地方都要引用。

source: In string literals where we want to suppress interpolation and special treatment of backslashes. In other words, situations where using double quotes would be inappropriate.
es: En los literales de cuerda donde queremos suprimir la interpolación y el tratamiento especial de las barras invertidas.En otras palabras,situaciones donde el uso de comillas dobles sería inapropiado.
ja: 文字列リテラルにおいて、補間やバックスラッシュの特別な扱いを抑制したい場合に使用します。言い換えれば、二重引用符の使用が不適切な場合です。
ko: 백 슬래시의 보간 및 특수 처리를 억제하려는 문자열 리터럴에서. 즉, 큰 따옴표를 사용하는 것이 부적절한 상황입니다.
ru: В строковых литералах,где мы хотим подавить интерполяцию и специальную обработку обратных слэшей.Другими словами,ситуации,в которых использование двойных кавычек было бы неуместно.
zh_cn: 在我们希望抑制插值和反斜线的特殊处理的字符串字库中。换句话说,使用双引号是不合适的情况。

source: No quotes are suitable when you specifically require the shell to perform token splitting and/or wildcard expansion.
es: No hay citas adecuadas cuando se requiere específicamente que la cáscara realice una división simbólica o una expansión comodín.
ja: シェルがトークン分割やワイルドカード展開を行う必要がある場合は、引用符は使用しません。
ko: 쉘이 토큰 분할 및 / 또는 와일드 카드 확장을 수행하도록 특별히 요구할 때는 따옴표가 적합하지 않습니다.
ru: Никакие кавычки не подходят,когда вам конкретно требуется оболочка для выполнения разделения символов андор или расширения подстановочного знака.
zh_cn: 当你特别要求shell执行令牌分割和通配符扩展时,不需要引号。

source: Quotes and escaping - Bash Hackers' Wiki
es: Citas y escapadas-Bash Hackers' Wiki
ja: 引用と逃避-Bash Hackers' Wiki
ko: 따옴표와 탈출-Bash Hackers 'Wiki
ru: Цитаты и бегство-Bash Hackers' Wiki
zh_cn: 报价和逃跑-Bash黑客维基

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: Single quotes protect the text between them verbatim. It is the proper tool when you need to ensure that the shell does not touch the string at all. Typically, it is the quoting mechanism of choice when you do not require variable interpolation.
es: Las comillas simples protegen el texto entre ellas de forma literal.Es la herramienta adecuada cuando necesitas asegurarte de que la cáscara no toca la cuerda en absoluto.Típicamente,es el mecanismo de citas de elección cuando no se requiere una interpolación variable.
ja: 単一引用符は、それらの間のテキストを逐語的に保護します。シェルが文字列に全く触れないようにする必要がある場合に適したツールです。一般的に、可変補間を必要としない場合には、これは引用符のメカニズムとして選択されます。
ko: 작은 따옴표는 그 사이의 텍스트를 그대로 보호합니다. 쉘이 끈에 전혀 닿지 않도록해야 할 때 적절한 도구입니다. 일반적으로 변수 보간이 필요하지 않은 경우 인용 메커니즘이 선택됩니다.
ru: Одиночные кавычки защищают текст между ними дословно.Это правильный инструмент,когда необходимо убедиться,что оболочка вообще не касается строки.Как правило,это механизм кавычек,когда не требуется интерполяция переменных.
zh_cn: 单引号可以保护它们之间的文本逐字逐句地保护。当你需要确保外壳完全不接触到字符串时,它是合适的工具。通常情况下,当你不需要变量插值时,它是首选的引号机制。

source: The last example also suggests another useful concept, which I like to call "seesaw quoting". If you need to mix single and double quotes, you can use them adjacent to each other. For example, the following quoted strings
es: El último ejemplo también sugiere otro concepto útil,que me gusta llamar "cita de subibaja".Si necesitas mezclar citas simples y dobles,puedes usarlas adyacentes entre sí.Por ejemplo,las siguientes cadenas de citas
ja: 最後の例は、私が「シーソー引用」と呼んでいるもう一つの便利な概念を示唆しています。シングルクォートとダブルクォートを混在させる必要がある場合は、隣接して使用することができます。例えば、以下の引用符で囲まれた文字列
ko: 마지막 예제는 또 다른 유용한 개념을 제안하는데, 이것을 "시소 인용"이라고 부릅니다. 작은 따옴표와 큰 따옴표를 혼합해야하는 경우 서로 인접한 따옴표를 사용할 수 있습니다. 예를 들어, 다음 인용 문자열
ru: Последний пример также предлагает еще одну полезную концепцию,которую я люблю называть "кавычки на доске".Если вам нужно смешать одинарные и двойные кавычки,вы можете использовать их рядом друг с другом.Например,следующие кавычки
zh_cn: 最后一个例子还提出了另一个有用的概念,我喜欢称之为 "跷跷板引号"。如果你需要混合单引号和双引号,你可以将它们相邻使用。例如,下面的引号字符串

source: This isn't awfully legible, but it's a common technique and thus good to know.
es: Esto no es muy legible,pero es una técnica común y por lo tanto es bueno saberlo.
ja: これはあまり読みやすくはありませんが、一般的なテクニックなので、知っておくと良いでしょう。
ko: 이것은 끔찍하게 읽을 수는 없지만 일반적인 기술이므로 알기에 좋습니다.
ru: Это не ужасно разборчиво,но это обычная техника,и поэтому приятно знать.
zh_cn: 这并不是很好辨认,但这是一种常见的技巧,因此很好理解。

source: Token splitting;
es: La ficha se divide;
ja: トークン分割。
ko: 토큰 분할;
ru: Разделение жетонов;
zh_cn: 令牌拆分。
