Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Note: 'scalar' here means values that can be compared directly using <code>===</code> . So: numbers, strings, objects by reference, functions by reference. See <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators">the MDN reference</a> for more info about the comparison operators).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Nota: 'escalar' aqu&iacute; significa valores que se pueden comparar directamente usando </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Entonces: n&uacute;meros, cadenas, objetos por referencia, funciones por referencia. Consulte </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la referencia de MDN</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener m&aacute;s informaci&oacute;n sobre los operadores de comparaci&oacute;n).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（注：ここでの「スカラー」とは、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して直接比較できる値を意味します</font><font style="vertical-align: inherit;">。したがって、数値、文字列、参照によるオブジェクト、参照による関数。</font><font style="vertical-align: inherit;">比較演算子の詳細については</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、MDNリファレンス</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">参照</font><font style="vertical-align: inherit;">してください）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(참고 : 여기서 'scalar'는 </font></font> <code>===</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 직접 비교할 수있는 값을 의미합니다 </font><font style="vertical-align: inherit;">. 따라서 숫자, 문자열, 참조 별 객체, 참조 별 함수입니다. </font><font style="vertical-align: inherit;">비교 연산자에 대한 자세한 </font><font style="vertical-align: inherit;">내용 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은 MDN 참조</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">참조</font><font style="vertical-align: inherit;"> 하십시오 </font><font style="vertical-align: inherit;">).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Примечание: здесь &laquo;скаляр&raquo; означает значения, которые можно сравнивать напрямую, используя </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Итак: числа, строки, объекты по ссылке, функции по ссылке. Для </font><font style="vertical-align: inherit;">получения дополнительной информации об операторах сравнения </font><font style="vertical-align: inherit;">см. Ссылку </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">на MDN</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（注意：&ldquo;标量&rdquo;在这里表示可以使用</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接比较的值</font><font style="vertical-align: inherit;">。因此：数字，字符串，按引用的对象，按引用的函数。有关</font><font style="vertical-align: inherit;">比较运算符的更多信息，</font><font style="vertical-align: inherit;">请参见</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MDN参考</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。）</font></font>

source: ////// OR ///////
es: ///O...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">////// 또는 ///////</font></font>
ru: ///ИЛИ //ИЛИ //

source: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974">Samy Bencherif has prepared</a> useful functions for the case you're searching for a specific object in nested arrays, which are available here: <a href="https://jsfiddle.net/SamyBencherif/8352y6yw/">https://jsfiddle.net/SamyBencherif/8352y6yw/</a>
es: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Samy Bencherif ha preparado</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funciones &uacute;tiles para el caso de que est&eacute; buscando un objeto espec&iacute;fico en matrices anidadas, que est&aacute;n disponibles aqu&iacute;: </font></font><a href="https://jsfiddle.net/SamyBencherif/8352y6yw/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://jsfiddle.net/SamyBencherif/8352y6yw/</font></font></a>
ja: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Samy Bencherifは</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ネストされた配列で特定のオブジェクトを検索する場合に便利な関数を</font><font style="vertical-align: inherit;">用意</font><font style="vertical-align: inherit;">しています。これは、</font><a href="https://jsfiddle.net/SamyBencherif/8352y6yw/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">//jsfiddle.net/SamyBencherif/8352y6yw/から</font><font style="vertical-align: inherit;">入手できます。</font></font><font style="vertical-align: inherit;"></font>
ko: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Samy Bencherif는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 중첩 배열에서 특정 객체를 검색하는 경우 유용한 기능을 </font><font style="vertical-align: inherit;">준비</font><font style="vertical-align: inherit;"> 했습니다. </font></font><a href="https://jsfiddle.net/SamyBencherif/8352y6yw/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://jsfiddle.net/SamyBencherif/8352y6yw/</font></font></a>
ru: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сэми Бенчериф подготовил</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> полезные функции для случая, когда вы ищете конкретный объект во вложенных массивах, которые доступны здесь: </font></font><a href="https://jsfiddle.net/SamyBencherif/8352y6yw/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://jsfiddle.net/SamyBencherif/8352y6yw/</font></font></a>
zh_cn: <a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascript/14853974?noredirect=1#comment59337127_14853974"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Samy Bencherif</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为您在嵌套数组中搜索特定对象的情况</font><font style="vertical-align: inherit;">准备了</font><font style="vertical-align: inherit;">有用的功能，可在以下位置找到：</font><a href="https://jsfiddle.net/SamyBencherif/8352y6yw/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/SamyBencherif/8352y6yw/</font></font>

source: <em>Unrelated note:</em> it is interesting to see people getting all trigger-happy John Waynes on the down vote button on perfectly legitimate answers to this question.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota no relacionada:</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es interesante ver a las personas obtener a John Waynes con un gatillo feliz en el bot&oacute;n de voto hacia abajo en respuestas perfectamente leg&iacute;timas a esta pregunta.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関連のないメモ：</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この質問への完全に正当な回答に対する反対投票ボタンで、すべてのトリガーハッピーなJohn Waynesを見るのは興味深いことです。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관련이없는 메모 :</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사람들이이 질문에 완벽하게 합법적 인 답변을 내리기 위해 투표 버튼을 누르면 존 웨인 즈가 모든 사람들에게 만족감을 느끼는 것이 흥미 롭습니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Несвязанное примечание:</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> интересно видеть людей, получающих всех довольных Джоном Уэйнсом нажатием кнопки &laquo;вниз&raquo; на совершенно законных ответах на этот вопрос.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无关紧要的注释：</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很有趣的是，人们在向下投票按钮上获得了所有触发人满意的约翰&middot;韦恩斯，获得了对该问题的完全合法答案。</font></font>

source: <strong><a href="https://stackoverflow.com/a/19746771/308645">every</a> (69%)</strong> by user2782196
es: <strong><a href="https://stackoverflow.com/a/19746771/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cada</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (69%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por usuario2782196</font></font>
ja: <strong><a href="https://stackoverflow.com/a/19746771/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザー</font><strong><font style="vertical-align: inherit;">ごと</font></strong><strong><font style="vertical-align: inherit;">（69％）</font></strong></font>
ko: <strong><a href="https://stackoverflow.com/a/19746771/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (69 %)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> user2782196하여</font></font>
ru: <strong><a href="https://stackoverflow.com/a/19746771/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">каждый</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (69%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> от пользователя2782196</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/19746771/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（69％）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由user2782196</font></font>

source: <strong><a href="https://stackoverflow.com/a/23555773/308645">stringify</a> (100%)</strong> by radtek
es: <strong><a href="https://stackoverflow.com/a/23555773/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">stringify</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (100%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por radtek</font></font>
ja: <strong><a href="https://stackoverflow.com/a/23555773/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">radtekによる</font><strong><font style="vertical-align: inherit;">文字</font></strong><font style="vertical-align: inherit;">列化</font><strong><font style="vertical-align: inherit;">（100％）</font></strong></font>
ko: <strong><a href="https://stackoverflow.com/a/23555773/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">radtek으로</font><strong><font style="vertical-align: inherit;"> stringify</font></strong><strong><font style="vertical-align: inherit;"> (100 %)</font></strong></font>
ru: <strong><a href="https://stackoverflow.com/a/23555773/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">stringify</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (100%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> от radtek</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/23555773/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">radtek的</font><strong><font style="vertical-align: inherit;"> stringify</font></strong><strong><font style="vertical-align: inherit;">（100％）</font></strong></font>

source: <strong><a href="https://stackoverflow.com/a/39238456/308645">half toString</a> (90%)</strong> by Victor Palomo
es: <strong><a href="https://stackoverflow.com/a/39238456/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">half toString</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (90%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por Victor Palomo</font></font>
ja: <strong><a href="https://stackoverflow.com/a/39238456/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハーフtoString</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（90％）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> by Victor Palomo</font></font>
ko: <strong><a href="https://stackoverflow.com/a/39238456/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Victor Palomo의</font><strong><font style="vertical-align: inherit;"> 반 문자열</font></strong><strong><font style="vertical-align: inherit;"> (90 %)</font></strong></font>
ru: <strong><a href="https://stackoverflow.com/a/39238456/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">половина строки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (90%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Виктора Паломо</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/39238456/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Victor Palomo的</font><strong><font style="vertical-align: inherit;">一半toString</font></strong><strong><font style="vertical-align: inherit;">（90％）</font></strong></font>

source: <strong><a href="https://stackoverflow.com/a/40496893/308645">reduce</a> (74%)</strong> by DEIs
es: <strong><a href="https://stackoverflow.com/a/40496893/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reducir</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (74%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por DEI</font></font>
ja: <strong><a href="https://stackoverflow.com/a/40496893/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DEIによる</font><strong><font style="vertical-align: inherit;">削減</font></strong><strong><font style="vertical-align: inherit;">（74％）</font></strong></font>
ko: <strong><a href="https://stackoverflow.com/a/40496893/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">감소</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (74 %)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> DEIs하여</font></font>
ru: <strong><a href="https://stackoverflow.com/a/40496893/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">уменьшить</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (74%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по DEI</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/40496893/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过DEI</font><strong><font style="vertical-align: inherit;">减少</font></strong><strong><font style="vertical-align: inherit;">（74％）</font></strong></font>

source: <strong><a href="https://stackoverflow.com/a/42143065/308645">join</a> &amp; <a href="https://stackoverflow.com/a/19001149/308645">toString</a> (78%)</strong> by Gaizka Allende &amp; vivek
es: <strong><a href="https://stackoverflow.com/a/42143065/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">unirse</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://stackoverflow.com/a/19001149/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">toString</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (78%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por Gaizka Allende y vivek</font></font>
ja: <strong><a href="https://stackoverflow.com/a/42143065/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">join</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font><a href="https://stackoverflow.com/a/19001149/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">toString</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（78％）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> by Gaizka Allende＆vivek</font></font>
ko: <strong><a href="https://stackoverflow.com/a/42143065/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/19001149/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gaizka Allende &amp; vivek의</font><strong><font style="vertical-align: inherit;"> join</font></strong><strong><font style="vertical-align: inherit;"> &amp; </font></strong><strong><font style="vertical-align: inherit;">toString</font></strong><strong><font style="vertical-align: inherit;"> (78 %)</font></strong></font>
ru: <strong><a href="https://stackoverflow.com/a/42143065/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">присоединиться</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к &amp; </font></font><a href="https://stackoverflow.com/a/19001149/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ToString</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (78%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> от Gaizka Альенде &amp; Vivek</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/42143065/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/19001149/308645"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gaizka Allende和vivek的</font><strong><font style="vertical-align: inherit;"> join</font></strong><strong><font style="vertical-align: inherit;">＆</font></strong><strong><font style="vertical-align: inherit;">toString</font></strong><strong><font style="vertical-align: inherit;">（78％）</font></strong></font>
