Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Simple as that. Here I've used vanilla JS objects, but this type of comparator could work for <em>any</em> object type; even your custom objects. Tom&aacute;&scaron;'s solution would need to be completely reworked to support this kind of equality test
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simple como eso. </font><font style="vertical-align: inherit;">Aqu&iacute; he usado objetos vanilla JS, pero este tipo de comparador podr&iacute;a funcionar para </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cualquier</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tipo de objeto; </font><font style="vertical-align: inherit;">incluso tus objetos personalizados. </font><font style="vertical-align: inherit;">La soluci&oacute;n de Tom&aacute;&scaron; necesitar&iacute;a ser completamente revisada para soportar este tipo de prueba de igualdad</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのような単純な。</font><font style="vertical-align: inherit;">ここではバニラJSオブジェクトを使用しましたが、このタイプのコンパレータは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どの</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトタイプ</font><font style="vertical-align: inherit;">で</font><em><font style="vertical-align: inherit;">も機能し</font></em><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">カスタムオブジェクトも。</font><font style="vertical-align: inherit;">このような同等性テストをサポートするには、トマシュのソリューションを完全に作り直す必要があります</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇게 간단합니다. </font><font style="vertical-align: inherit;">여기서는 바닐라 JS 객체를 사용했지만이 유형의 비교기는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체 유형에서 </font><font style="vertical-align: inherit;">작동 할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">심지어 커스텀 객체까지. </font><font style="vertical-align: inherit;">이러한 종류의 평등 테스트를 지원하기 위해 Tom&aacute;&scaron;의 솔루션을 완전히 재 작업해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто как тот. </font><font style="vertical-align: inherit;">Здесь я использовал ванильные объекты JS, но этот тип компаратора может работать для </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">любого</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> типа объекта; </font><font style="vertical-align: inherit;">даже ваши пользовательские объекты. </font><font style="vertical-align: inherit;">Решение Томаша должно быть полностью переработано для поддержки такого теста на равенство</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就那么简单。</font><font style="vertical-align: inherit;">在这里，我使用了普通的JS对象，但是这种类型的比较器可以适用于</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任何</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象类型。</font><font style="vertical-align: inherit;">甚至您的自定义对象。</font><font style="vertical-align: inherit;">托马斯（Tom&aacute;&scaron;）的解决方案需要完全重新设计以支持这种平等测试</font></font>

source: Simple as that. We build a deep comparator using <em>another</em> higher-order function. This time we're wrapping <code>arrayCompare</code> using a custom comparator that will check if <code>a</code> and <code>b</code> are arrays. If so, reapply <code>arrayDeepCompare</code> otherwise compare <code>a</code> and <code>b</code> to the user-specified comparator (<code>f</code>). This allows us to keep the deep comparison behavior separate from how we actually compare the individual elements. Ie, like the example above shows, we can deep compare using <code>equal</code>, <code>looseEqual</code>, or any other comparator we make.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simple como eso. Construimos un comparador profundo usando </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">otra</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funci&oacute;n de orden superior. Esta vez Estamos terminando </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> utilizando un comparador personalizado que comprobar&aacute; si </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son matrices. Si es as&iacute;, vuelva a aplicar </font></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lo contrario comparar </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al comparador especificado por el usuario ( </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Esto nos permite mantener el comportamiento de comparaci&oacute;n profunda separado de c&oacute;mo realmente comparamos los elementos individuales. Es decir, como muestra el ejemplo anterior, podemos comparar en profundidad usando </font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>looseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o cualquier otro comparador que hagamos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのような単純な。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高次関数</font><font style="vertical-align: inherit;">を使用してディープコンパレータを作成し</font><font style="vertical-align: inherit;">ます。今回</font> <code>a</code> <font style="vertical-align: inherit;">、</font> <code>b</code> <font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">b</font><font style="vertical-align: inherit;">が配列</font><font style="vertical-align: inherit;">かどうかをチェックするカスタムコンパ</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して</font><font style="vertical-align: inherit;">arrayCompare</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">ラップし</font><font style="vertical-align: inherit;">ています。そうであれば、</font> <code>arrayDeepCompare</code> を<font style="vertical-align: inherit;">再適用し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そうでない場合</font> <code>a</code> <font style="vertical-align: inherit;">、</font> <code>b</code> <font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">b</font><font style="vertical-align: inherit;">をユーザー指定のコンパレーター（</font> <code>f</code> <font style="vertical-align: inherit;">）と</font><font style="vertical-align: inherit;">比較し</font><font style="vertical-align: inherit;">ます。これにより、個々の要素を実際に比較する方法とは別に、深い比較動作を維持できます。つまり、上記の例のように、</font> <code>equal</code> <font style="vertical-align: inherit;">、</font> <code>looseEqual</code> <font style="vertical-align: inherit;">、またはその他のコンパレータを使用して詳細比較を行うことができます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇게 간단합니다. 우리는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 고차 함수를 </font><font style="vertical-align: inherit;">사용하여 깊은 비교기를 </font><font style="vertical-align: inherit;">만듭니다. 이번에는 </font> <code>a</code> <font style="vertical-align: inherit;"> 와 </font> <code>b</code> <font style="vertical-align: inherit;"> 가 배열 </font><font style="vertical-align: inherit;">인지 확인하는 커스텀 비교기를 사용하여 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">래핑 </font><font style="vertical-align: inherit;">합니다. 그렇다면 </font> <code>arrayDeepCompare</code> 를<font style="vertical-align: inherit;"> 다시 적용하고, </font><font style="vertical-align: inherit;">그렇지 않으면 </font> <code>a</code> <font style="vertical-align: inherit;"> 와 </font> <code>b</code> <font style="vertical-align: inherit;"> 를 사용자 지정 비교기 ( </font> <code>f</code> <font style="vertical-align: inherit;"> )와 </font><font style="vertical-align: inherit;">비교하십시오 </font><font style="vertical-align: inherit;">. 이를 통해 우리는 개별 요소를 실제로 비교하는 방법과 깊은 비교 동작을 유지할 수 있습니다. 즉, 위의 예와 같이 </font> <code>equal</code> <font style="vertical-align: inherit;"> , </font> <code>looseEqual</code> <font style="vertical-align: inherit;"> 또는 다른 비교기를 </font><font style="vertical-align: inherit;">사용하여 깊이 비교할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто как тот. Мы строим глубокий компаратор, используя </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">другую</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> функцию более высокого порядка. На этот раз мы оборачиваем </font></font> <code>arrayCompare</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используя собственный компаратор, который проверит, являются ли </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> массивами. Если это так, повторно примените </font></font> <code>arrayDeepCompare</code> ,в<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> противном случае сравните </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с указанным пользователем компаратором ( </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Это позволяет нам отделить поведение глубокого сравнения от того, как мы на самом деле сравниваем отдельные элементы. То есть, как показано в приведенном выше примере, мы можем глубоко сравнить, используя </font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>looseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или любой другой компаратор, который мы делаем.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就那么简单。我们使用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一个</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高阶函数</font><font style="vertical-align: inherit;">构建一个深度比较器</font><font style="vertical-align: inherit;">。这次，我们</font><font style="vertical-align: inherit;">使用自定义比较器</font><font style="vertical-align: inherit;">包装</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，该比较器将检查</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否为数组。如果是这样，请重新应用</font></font> <code>arrayDeepCompare</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">否则将</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与用户指定的比较器（</font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）进行</font><font style="vertical-align: inherit;">比较</font><font style="vertical-align: inherit;">。这使我们能够将深度比较行为与实际比较各个元素的方式分开。即，如上面的示例所示，我们可以使用</font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>looseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或我们创建的任何其他比较器进行</font><font style="vertical-align: inherit;">深度比较</font><font style="vertical-align: inherit;">。</font></font>

source: Some test cases for mocha:
es: Algunos casos de prueba de moca:
ja: モカのテストケースをいくつか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모카에 대한 몇 가지 테스트 사례 :</font></font>
ru: Некоторые тестовые случаи для мокко:
zh_cn: 摩卡的一些测试案例。

source: Strict comparison
es: Comparación estricta
ja: 厳密な比較
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">엄격한 비교</font></font>
ru: Строгое сравнение
zh_cn: 严格的比较

source: That's the difference, the former would give me a Set, it would work too as I could get the size of that Set, but the latter gives me the array I need, what's more direct to the resolution.
es: Esa es la diferencia,el primero me daría un Set,también funcionaría ya que podría conseguir el tamaño de ese Set,pero el segundo me da la matriz que necesito,lo que es más directo a la resolución.
ja: その違いは、前者は私にSetを与えるだろう、それは私がそのSetのサイズを得ることができるように、それはあまりにも動作しますが、後者は私が必要とする配列を与えてくれます、何がより直接的な解像度になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차이점은 전자가 나에게 세트를 제공한다는 것입니다. 세트의 크기를 얻을 수있을 때도 작동하지만 후자는 나에게 필요한 배열을 제공합니다. 해상도에 더 직접적인 것입니다.</font></font>
ru: Вот в чем разница,первый даст мне Множество,это тоже будет работать,так как я смогу получить размер этого Множества,но второй даст мне массив,который мне нужен,то,что более непосредственно влияет на разрешение.
zh_cn: 这就是区别,前者会给我一个Set,它也可以,因为我可以得到那个Set的大小,但后者给了我需要的数组,什么是更直接的分辨率。

source: The <code>length</code> check ensures that the set of elements in one array isn't just a subset of the other one.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">verificaci&oacute;n de </font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> asegura que el conjunto de elementos en una matriz no sea solo un subconjunto de la otra.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェックは、一の配列内の要素のセットが他方のサブセットだけではないことを保証します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 배열의 요소의 세트는 다른 하나의 서브 세트 만이 아니라고 확인 보장한다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> проверка гарантирует , </font><font style="vertical-align: inherit;">что множество элементов в одном массиве не является лишь подмножеством другого.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查确保该组中一个阵列元件的不只是另一个的子集。</font></font>

source: The Practical Way
es: La manera práctica
ja: 実用的な方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실용적인 방법</font></font>
ru: Практический путь
zh_cn: 实用的方法

source: The reducer is used to walk through one array and search for each item in other array. If one item isn't found the reduce function returns <code>false</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El reductor se usa para recorrer una matriz y buscar cada elemento en otra matriz. </font><font style="vertical-align: inherit;">Si no se encuentra un elemento, la funci&oacute;n de reducci&oacute;n devuelve </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">レデューサーは、1つの配列をウォークスルーし、他の配列の各項目を検索するために使用されます。</font><font style="vertical-align: inherit;">1つのアイテムが見つからない場合、reduce関数は</font></font> <code>false</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">감속기는 하나의 배열을 탐색하고 다른 배열의 각 항목을 검색하는 데 사용됩니다. </font><font style="vertical-align: inherit;">하나의 항목을 찾지 못하면 reduce 함수는 </font></font> <code>false</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반환합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Редуктор используется для обхода одного массива и поиска каждого элемента в другом массиве. </font><font style="vertical-align: inherit;">Если один элемент не найден, функция Reduce возвращает </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reducer用于遍历一个数组并搜索另一数组中的每个项目。</font><font style="vertical-align: inherit;">如果未找到任何一项，则reduce函数将返回</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The second example check for the order too
es: El segundo ejemplo comprueba también el pedido
ja: 2番目の例は、あまりにも順序のためのチェック
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 예도 주문 확인</font></font>
ru: Во втором примере тоже проверьте заказ
zh_cn: 第二个例子检查的顺序太

source: Then the above code would give <code>true</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces el c&oacute;digo anterior dar&iacute;a </font></font> <code>true</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、上記のコードは</font></font> <code>true</code> になります
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 위의 코드는 </font></font> <code>true</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тогда приведенный выше код будет давать </font></font> <code>true</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后上面的代码将为</font></font> <code>true</code>

source: This I think is the simplest way to do it using JSON stringify, and it may be the best solution in some situations:
es: Creo que es la forma más simple de hacerlo usando JSON stringify,y puede ser la mejor solución en algunas situaciones:
ja: これがJSONのstringifyを使った一番シンプルな方法だと思いますし、状況によってはこれが一番の解決策になるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 JSON stringify를 사용하여 수행하는 가장 간단한 방법이며 일부 상황에서 가장 좋은 솔루션 일 수 있습니다.</font></font>
ru: Я думаю,что это самый простой способ сделать это с помощью JSON stringify,и это может быть лучшим решением в некоторых ситуациях:
zh_cn: 我认为这是用JSON stringify最简单的方法,在某些情况下可能是最好的解决方案。
