Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: For array of numbers try
es: Para una serie de números intente
ja: 数値の配列の場合は、次のようにしてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 배열을 시도하십시오.</font></font>
ru: Для массива чисел попробуйте
zh_cn: 对于数字数组,请尝试

source: For most arrays it's still faster than most of serialization solutions. It's probably the fastest compare method for arrays of object records.
es: Para la mayoría de los conjuntos sigue siendo más rápido que la mayoría de las soluciones de serialización.Es probablemente el método de comparación más rápido para matrices de registros de objetos.
ja: ほとんどの配列では、ほとんどのシリアライズソリューションよりも高速です。オブジェクトレコードの配列の比較方法としては、おそらくこれが一番速いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 어레이는 여전히 대부분의 직렬화 솔루션보다 빠릅니다. </font><font style="vertical-align: inherit;">아마도 객체 레코드 배열에 대한 가장 빠른 비교 방법 일 것입니다.</font></font>
ru: Для большинства массивов он все еще быстрее,чем большинство решений по сериализации.Вероятно,это самый быстрый метод сравнения для массивов объектных записей.
zh_cn: 对于大多数数组来说,它仍然比大多数序列化解决方案要快。对于对象记录的数组,它可能是最快的比较方法。

source: From what I read from the comments, sorting the array and comparing may give accurate result:
es: Por lo que leí en los comentarios,clasificar el conjunto y comparar puede dar un resultado preciso:
ja: コメントを読んだ限りでは、配列を並べ替えて比較すると正確な結果が得られるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주석에서 읽은 내용에서 배열을 정렬하고 비교하면 정확한 결과를 얻을 수 있습니다.</font></font>
ru: Из того,что я прочитал из комментариев,сортировка массива и сравнение могут дать точный результат:
zh_cn: 从我读到的评论来看,对数组进行排序和比较,可能会得到准确的结果。

source: Generics offer reusability
es: Los genéricos ofrecen reutilización
ja: ジェネリックは再利用可能
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반은 재사용 성을 제공합니다</font></font>
ru: Дженерики предлагают возможность повторного использования
zh_cn: 通用型产品具有可重复使用性

source: Have a look at my code with your example which compares two arrays whose elements are numbers, you might modify or extend it for other element types (by utilising .join() instead of .toString()).
es: Echa un vistazo a mi código con tu ejemplo,que compara dos matrices cuyos elementos son números,podrías modificarlo o extenderlo para otros tipos de elementos (utilizando .join()en lugar de .toString()).
ja: 要素が数値である2つの配列を比較している例の私のコードを見てみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요소가 숫자 인 두 배열을 비교하는 예제를 사용하여 내 코드를 살펴보면 다른 요소 유형 (.toString () 대신 .join ()을 사용하여)을 수정하거나 확장 할 수 있습니다.</font></font>
ru: Взгляните на мой код с вашим примером,который сравнивает два массива,элементы которых являются числами,вы можете изменить или расширить его для других типов элементов (используя .join()вместо .toString()).
zh_cn: 看一下我用你的例子比较两个元素为数字的数组的代码,你可以修改或扩展到其他元素类型(用.join()代替.toString())。

source: Here is a Typescript version:
es: Aquí hay una versión mecanografiada:
ja: こちらはTypescript版です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 Typescript 버전입니다.</font></font>
ru: Вот версия Typescript:
zh_cn: 这里是一个Typescript版本。

source: Here is better (in my opinion) version:
es: Aquí hay una versión mejor (en mi opinión):
ja: こちらの方が良い(私の意見ですが)バージョンです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 더 나은 버전이 있습니다.</font></font>
ru: Вот лучшая (на мой взгляд)версия:
zh_cn: 这里是更好的版本(在我看来)。

source: Here's an optimized array comparison function that compares corresponding elements of each array in turn using strict equality and does not do recursive comparison of array elements that are themselves arrays, meaning that for the above example, <code>arraysIdentical(a, b)</code> would return <code>false</code>. It works in the general case, which JSON- and <code>join()</code>-based solutions will not:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay una funci&oacute;n de comparaci&oacute;n de matriz optimizada que compara los elementos correspondientes de cada matriz a su vez usando una igualdad estricta y no hace una comparaci&oacute;n recursiva de elementos de matriz que son en s&iacute; mismos matrices, lo que significa que para el ejemplo anterior, </font></font> <code>arraysIdentical(a, b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&iacute;a </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Funciona en el caso general, que las </font><font style="vertical-align: inherit;">soluciones basadas en </font><font style="vertical-align: inherit;">JSON y </font></font> <code>join()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、厳密な等価性を使用して各配列の対応する要素を比較し、それ自体が配列である配列要素の再帰的な比較を行わない最適化された配列比較関数を示します。つまり、上記の例では、</font></font> <code>arraysIdentical(a, b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を返し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは一般的なケースで機能しますが、JSON </font><font style="vertical-align: inherit;">ベース</font><font style="vertical-align: inherit;">および</font></font> <code>join()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ベースのソリューションでは機能しません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 엄격한 등식을 사용하여 각 배열의 해당 요소를 차례로 비교하고 자체 배열 인 배열 요소의 재귀 비교를 수행하지 않는 최적화 된 배열 비교 함수입니다. 즉, 위의 예에서 </font></font> <code>arraysIdentical(a, b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>false</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반환 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">JSON 및 </font></font> <code>join()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기반 솔루션은 </font><font style="vertical-align: inherit;">일반적으로 작동 </font><font style="vertical-align: inherit;">하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот оптимизированная функция сравнения массивов, которая сравнивает соответствующие элементы каждого массива по очереди, используя строгое равенство, и не выполняет рекурсивное сравнение элементов массива, которые сами являются массивами. Это означает, что для приведенного выше примера </font></font> <code>arraysIdentical(a, b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он работает в общем случае, когда </font><font style="vertical-align: inherit;">решения на основе </font><font style="vertical-align: inherit;">JSON и </font></font> <code>join()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не будут:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是一个优化的数组比较函数，该函数使用严格相等性依次比较每个数组的相应元素，并且不对本身就是数组的数组元素进行递归比较，这意味着对于上面的示例，</font></font> <code>arraysIdentical(a, b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将返回</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">它在一般情况下有效，而</font><font style="vertical-align: inherit;">基于</font><font style="vertical-align: inherit;">JSON和</font></font> <code>join()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的解决方案将不会：</font></font>

source: Herer's my solution:
es: Esta es mi solución:
ja: これが私の解決策だ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그녀의 솔루션은 다음과 같습니다.</font></font>
ru: Вот мое решение:
zh_cn: 这是我的解决方案。

source: How to compare arrays in JavaScript
es: Cómo comparar matrices en JavaScript
ja: JavaScriptで配列を比較する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript에서 배열을 비교하는 방법</font></font>
ru: Как сравнить массивы в JavaScript
zh_cn: 如何在JavaScript中比较数组

source: However, if you just use object structure to contain data, comparing is still possible:
es: Sin embargo,si sólo se utiliza la estructura del objeto para contener los datos,la comparación sigue siendo posible:
ja: しかし、オブジェクト構造を使ってデータを格納するだけであれば、比較は可能です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 객체 구조를 사용하여 데이터를 포함하는 경우 여전히 비교가 가능합니다.</font></font>
ru: Однако,если вы просто используете объектную структуру,чтобы содержать данные,сравнение все равно возможно:
zh_cn: 但是,如果只是使用对象结构来包含数据,还是可以进行比较。

source: However, remember that this one is to serve in comparing JSON like data, not class instances and other stuff. If you want to compare mor complicated objects, look at <a href="https://stackoverflow.com/a/1144249/607407">this answer and it's superlong function</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, recuerde que este es para comparar JSON como datos, no instancias de clase y otras cosas. </font><font style="vertical-align: inherit;">Si desea comparar objetos m&aacute;s complicados, mire </font></font><a href="https://stackoverflow.com/a/1144249/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta respuesta y su funci&oacute;n es muy larga</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、これはJSONなどのデータを比較するためのものであり、クラスインスタンスやその他のものではないことを覚えておいてください。</font><font style="vertical-align: inherit;">複雑なオブジェクトを比較したい場合は、</font></font><a href="https://stackoverflow.com/a/1144249/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この答えを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見てください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは超長関数</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것은 클래스 인스턴스 및 기타 항목이 아닌 데이터와 같은 JSON을 비교하는 역할을한다는 것을 기억하십시오. </font><font style="vertical-align: inherit;">mor 복잡한 객체를 비교하려면 </font></font><a href="https://stackoverflow.com/a/1144249/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 답변을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보고 </font><font style="vertical-align: inherit;">superlong 함수</font><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако помните, что этот служит для сравнения данных, подобных JSON, а не экземпляров классов и прочего. </font><font style="vertical-align: inherit;">Если вы хотите сравнить более сложные объекты, посмотрите на </font></font><a href="https://stackoverflow.com/a/1144249/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этот ответ, и это сверхдлинная функция</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，请记住，这是用于比较JSON之类的数据，而不是类实例和其他内容。</font><font style="vertical-align: inherit;">如果您想比较复杂的物体，请看</font></font><a href="https://stackoverflow.com/a/1144249/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个答案，它是超长函数</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: I believe in plain <code>JS</code> and with <code>ECMAScript 2015</code>, which is sweet and simple to understand.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo en </font></font> <code>JS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> simple </font><font style="vertical-align: inherit;">y con </font></font> <code>ECMAScript 2015</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que es dulce y simple de entender.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はプレーンな</font></font> <code>JS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>ECMAScript 2015</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を信じています</font><font style="vertical-align: inherit;">。ECMAScript2015</font><font style="vertical-align: inherit;">は、甘くて理解しやすいものです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 평범한 </font></font> <code>JS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>ECMAScript 2015</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 믿으며 </font><font style="vertical-align: inherit;">달콤하고 이해하기 쉽습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я верю в простой </font></font> <code>JS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ECMAScript 2015</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который приятен и прост для понимания.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我相信纯</font></font> <code>JS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ECMAScript 2015</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这很甜并且易于理解。</font></font>

source: I have been running performance tests on some of the more simple suggestions proposed here with the following <a href="http://jsben.ch/#/1Mq8s">results</a> (fast to slow):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He estado ejecutando pruebas de rendimiento en algunas de las sugerencias m&aacute;s simples propuestas aqu&iacute; con los siguientes </font></font><a href="http://jsben.ch/#/1Mq8s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">resultados</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (r&aacute;pido a lento):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで提案されたいくつかのより単純な提案のパフォーマンステストを実行して、次の</font></font><a href="http://jsben.ch/#/1Mq8s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">結果が得られました</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（速いから遅い）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 제안 된 더 간단한 제안 중 일부에 대해 성능 테스트를 실행하여 다음과 같은 </font></font><a href="http://jsben.ch/#/1Mq8s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과를 얻었습니다</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (빠르거나 느림).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я проводил тесты производительности на некоторых из более простых предложений, предложенных здесь, со следующими </font></font><a href="http://jsben.ch/#/1Mq8s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">результатами</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (от быстрого до медленного):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我一直在对此处提出的一些更简单的建议进行性能测试，</font></font><a href="http://jsben.ch/#/1Mq8s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结果</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如下</font><font style="vertical-align: inherit;">（快到慢）：</font></font>

source: I like to use the Underscore library for array/object heavy coding projects ... in Underscore and Lodash whether you're comparing arrays or objects it just looks like this:
es: Me gusta usar la librería de Underscore para proyectos de codificación de arrays y objetos pesados......en Underscore y Lodash,ya sea que estés comparando arrays u objetos,se ve así:
ja: 私は配列オブジェクトの重いコーディングプロジェクトにUnderscoreライブラリを使うのが好きです...UnderscoreとLodashでは、配列やオブジェクトを比較する場合はこのようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore 및 Lodash에서 배열 / 객체 무거운 코딩 프로젝트에 Underscore 라이브러리를 사용하고 싶습니다. 배열 또는 객체를 비교할 때 다음과 같습니다.</font></font>
ru: Мне нравится использовать библиотеку Underscore для массивов тяжелых проектов кодирования ...в Underscore и Lodash,независимо от того,сравниваете ли вы массивы или объекты,все выглядит именно так:
zh_cn: 在Underscore库中,我喜欢用Underscore库来做数组对象的重度编码项目...........在Underscore和Lodash中,无论你是比较数组还是对象,都是这样的。

source: I made a <a href="http://jsfiddle.net/Darker/SBtu2/">little test tool for both of the functions</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hice una </font></font><a href="http://jsfiddle.net/Darker/SBtu2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">peque&ntilde;a herramienta de prueba para ambas funciones</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/Darker/SBtu2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方の機能の小さなテストツール</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を作成しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/Darker/SBtu2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 기능 모두에 대해 작은 테스트 도구를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만들었습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я сделал </font></font><a href="http://jsfiddle.net/Darker/SBtu2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">небольшой тестовый инструмент для обеих функций</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我</font></font><a href="http://jsfiddle.net/Darker/SBtu2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为这两个功能都</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做了一个</font><font style="vertical-align: inherit;">小测试工具</font><font style="vertical-align: inherit;">。</font></font>
