Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In order to work with that value you'd need to use some Set properties (see <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set</a>). On the other hand, when you use this code:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para trabajar con ese valor, necesitar&iacute;a usar algunas propiedades de Set (consulte </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Por otro lado, cuando usa este c&oacute;digo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その値を操作するには、いくつかのSetプロパティを使用する必要があります（</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Setを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">一方、このコードを使用する場合：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 값으로 작업하려면 일부 Set 속성을 사용해야합니다 ( </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set 참조</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">반면에이 코드를 사용하면 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы работать с этим значением, вам нужно использовать некоторые свойства Set (см. </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">С другой стороны, когда вы используете этот код:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了使用该值，您需要使用一些Set属性（请参阅</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">另一方面，当您使用此代码时：</font></font>

source: In the first example it's being tested that an element is included
es: En el primer ejemplo se está probando que un elemento está incluido
ja: 最初の例では、要素が含まれているかどうかをテストしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 예에서는 요소가 포함되어 있는지 테스트되고 있습니다.</font></font>
ru: В первом примере проверяется,что в состав элемента входит
zh_cn: 在第一个例子中,它正在测试一个元素被包含在其中。

source: In the spirit of the original question:
es: En el espíritu de la pregunta original:
ja: 元の質問の精神で
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 질문의 정신에서 :</font></font>
ru: В духе исходного вопроса:
zh_cn: 根据原问题的精神。

source: Is it the fastest? Nope. But it probably doesn't need to be either. If speed is the only metric used to measure the quality of our code, a lot of really great code would get thrown away &mdash; That's why I'm calling this approach <strong>The Practical Way</strong>. Or maybe to be more fair, <em>A</em> Practical Way. This description is suitable for this answer because I'm not saying this answer is only practical in comparison to some other answer; it is objectively true. We've attained a high degree of practicality with very little code that's very easy to reason about. No other code can say we haven't earned this description.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Es el m&aacute;s r&aacute;pido? No Pero probablemente tampoco sea necesario. Si la velocidad es la &uacute;nica m&eacute;trica utilizada para medir la calidad de nuestro c&oacute;digo, se desechar&aacute; una gran cantidad de c&oacute;digo realmente excelente. Es por eso que llamo a este enfoque </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">The Practical Way</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . O tal vez para ser m&aacute;s justos, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una forma</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pr&aacute;ctica. Esta descripci&oacute;n es adecuada para esta respuesta porque no digo que esta respuesta solo sea pr&aacute;ctica en comparaci&oacute;n con alguna otra respuesta; Es objetivamente cierto. Hemos alcanzado un alto grado de practicidad con muy poco c&oacute;digo sobre el cual es muy f&aacute;cil razonar. Ning&uacute;n otro c&oacute;digo puede decir que no nos hemos ganado esta descripci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最速ですか？いいえ。しかし、おそらくどちらかである必要はありません。コードの品質を測定するために使用される唯一の測定基準が速度である場合、非常に優れたコードの多くが破棄されます。そのため、このアプローチを</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実践的な方法</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼んでい</font><font style="vertical-align: inherit;">ます。それとも、より公正であると</font><font style="vertical-align: inherit;">実用的な方法。この答えは他のいくつかの答えと比較して実用的であるとは言わないので、この説明はこの答えに適しています。それは客観的に真実です。推論が非常に簡単な非常に小さなコードで高度な実用性を達成しました。他のコードでは、この説明を得ていないと言うことはできません。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 빠릅니까? 아니. 그러나 아마도 둘 중 하나 일 필요는 없습니다. 속도가 코드의 품질을 측정하는 데 사용되는 유일한 지표 인 경우 정말 많은 훌륭한 코드가 버려 질 것입니다. 이것이 바로이 방법을 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">The Practical Way</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라고 부르는 이유 </font><font style="vertical-align: inherit;">입니다. 아니면 더 공정, 할 수 </font><font style="vertical-align: inherit;">실용적인 방법. 이 답변은 다른 답변과 비교하여 실용적이라고 말하지 않기 때문에이 답변에 적합합니다. 객관적으로 사실입니다. 우리는 추론하기 쉬운 코드가 거의 없어 높은 수준의 실용성을 달성했습니다. 다른 코드에서는이 설명을 얻지 못했다고 말할 수 없습니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это самый быстрый? Нет. Но это, вероятно, не должно быть либо. Если бы скорость была единственным показателем, используемым для измерения качества нашего кода, было бы выброшено много действительно хорошего кода - вот почему я называю этот подход </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Практическим путем</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Или , </font><font style="vertical-align: inherit;">может быть более справедливым, </font><font style="vertical-align: inherit;">Практический подход. Это описание подходит для этого ответа, потому что я не говорю, что этот ответ только практичен по сравнению с некоторым другим ответом; это объективно верно. Мы достигли высокой степени практичности с очень небольшим количеством кода, который очень легко рассуждать. Ни один другой код не может сказать, что мы не заработали это описание.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是最快的吗？不。但这可能也不需要。如果速度是用来衡量代码质量的唯一指标，那么很多非常好的代码就会被扔掉-这就是为什么我将这种方法称为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;实用方法&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。或者更公平地说，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一种</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实用的方法。此说明适用于此答案，因为我并不是说此答案仅与其他答案相比是实际的；客观上是正确的。我们已经以很少的代码（很容易推理）获得了高度的实用性。没有其他代码可以说我们还没有获得此描述。</font></font>

source: It is not stated in the question how the structure of the array is going to look like, so If you know for sure that you <strong>won't have nested arrays nor objects</strong> in you array (it happened to me, that's why I came to this answer) the above code will work.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No se indica en la pregunta c&oacute;mo se ver&aacute; la estructura de la matriz, por lo que si sabe con certeza que </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no tendr&aacute; matrices anidadas ni objetos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en su matriz (me sucedi&oacute; a m&iacute;, es por eso que llegu&eacute; a esto respuesta) el c&oacute;digo anterior funcionar&aacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列の構造がどのように見えるかという質問には記載されていないので、配列内に</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ネストされた配列もオブジェクトもない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こと</font><strong><font style="vertical-align: inherit;">が</font></strong><font style="vertical-align: inherit;">確実にわかっている場合</font><font style="vertical-align: inherit;">（それが私に起こったので、これが私がこれに至った理由です）回答）上記のコードは機能します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열의 구조가 어떻게 보일지에 대해서는 질문에 명시되어 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있지 않으므로 배열에 배열이나 객체가 중첩되어 있지 않다는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것을 알고 있다면 </font><font style="vertical-align: inherit;">(나에게 일어난 이유입니다. 답변) 위의 코드가 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В вопросе о том, как будет выглядеть структура массива, не указано, поэтому, если вы точно знаете, что </font><font style="vertical-align: inherit;">в вашем массиве </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не будет ни вложенных массивов, ни объектов</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (это случилось со мной, поэтому я пришел к этому ответьте) приведенный выше код будет работать.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个问题没有说明，所以数组的结构看起来是什么样子，所以如果您确定您</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不会有嵌套的数组或数组中的对象</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，那么这就是我的原因，这就是为什么答案）以上代码将起作用。</font></font>

source: It passes on:
es: Pasa:
ja: 受け継がれていく。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음을 통과합니다.</font></font>
ru: Он проходит:
zh_cn: 它传了下来。

source: It's unclear what you mean by "identical". For example, are the arrays <code>a</code> and <code>b</code> below identical (note the nested arrays)?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No est&aacute; claro qu&eacute; quiere decir con "id&eacute;ntico". </font><font style="vertical-align: inherit;">Por ejemplo, &iquest;son </font><font style="vertical-align: inherit;">id&eacute;nticos </font><font style="vertical-align: inherit;">los conjuntos </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siguientes (tenga en cuenta los conjuntos anidados)?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「同一」の意味がわかりません。</font><font style="vertical-align: inherit;">たとえば、配列</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は同じですか（ネストされた配列に注意してください）？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"동일한"이라는 말의 의미가 확실하지 않습니다. </font><font style="vertical-align: inherit;">예를 들어 </font><font style="vertical-align: inherit;">아래 </font><font style="vertical-align: inherit;">의 배열 </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 동일합니까 (중첩 배열에 유의)?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Непонятно, что вы подразумеваете под &laquo;тождественным&raquo;. </font><font style="vertical-align: inherit;">Например, </font><font style="vertical-align: inherit;">идентичны </font><font style="vertical-align: inherit;">ли массивы </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ниже (обратите внимание на вложенные массивы)?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不清楚&ldquo;相同&rdquo;是什么意思。</font><font style="vertical-align: inherit;">例如，下面的数组</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b</code> 是否<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相同（请注意嵌套数组）？</font></font>

source: JSON encoding each array does, but is there a faster or "better" way to simply compare arrays without having to iterate through each value?
es: La codificación JSON de cada matriz lo hace,pero ¿hay una forma más rápida o "mejor" de simplemente comparar las matrices sin tener que iterar a través de cada valor?
ja: 各配列をJSONエンコードすることはできますが、各値を繰り返し処理することなく、単純に配列を比較するためのより高速な方法や「より良い」方法はありますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 배열의 JSON 인코딩은 각 값을 반복하지 않고 배열을 간단히 비교할 수있는 더 빠르고 "더 나은"방법이 있습니까?</font></font>
ru: JSON кодировка каждого массива делает,но есть ли более быстрый или "лучший" способ просто сравнивать массивы без необходимости итерации через каждое значение?
zh_cn: JSON对每个数组进行编码,但有没有一种更快或更 "好 "的方法来简单地比较数组而不需要迭代每个值?

source: Less is More
es: Menos es más
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 적은</font></font>
ru: Меньше значит больше
zh_cn: 少即是多

source: Let's test it!
es: ¡Vamos a probarlo!
ja: テストしてみよう!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트 해보자!</font></font>
ru: Давайте проверим!
zh_cn: 我们来测试一下吧!

source: Lodash isEqual docs
es: Lodash es igual a los documentos
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lodash isEqual Docs</font></font>
ru: Lodash isEqual документы

source: Loose comparison
es: Comparación suelta...
ja: 緩やかな比較
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">느슨한 비교</font></font>
ru: Свободное сравнение
zh_cn: 松散的比较

source: My answer will approach the problem differently. I'll start with a generic <code>arrayCompare</code> procedure that is only concerned with stepping through the arrays. From there, we'll build our other basic comparison functions like <code>arrayEqual</code> and <code>arrayDeepEqual</code>, etc
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi respuesta abordar&aacute; el problema de manera diferente. </font><font style="vertical-align: inherit;">Comenzar&eacute; con un </font><font style="vertical-align: inherit;">procedimiento </font><font style="vertical-align: inherit;">gen&eacute;rico de </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que solo se ocupa de recorrer las matrices. </font><font style="vertical-align: inherit;">A partir de ah&iacute;, </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> nuestras otras funciones b&aacute;sicas de comparaci&oacute;n como </font><font style="vertical-align: inherit;">arrayEqual</font><font style="vertical-align: inherit;"> y </font></font> <code>arrayDeepEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の答えは別の方法で問題に取り組みます。</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、配列のステップ実行のみに関係</font><font style="vertical-align: inherit;">する一般的な</font><font style="vertical-align: inherit;">arrayCompare</font><font style="vertical-align: inherit;">プロシージャ</font><font style="vertical-align: inherit;">から始め</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そこから、</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font> <code>arrayDeepEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などの</font><font style="vertical-align: inherit;">他の基本的な比較関数を作成します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 대답은 문제에 다르게 접근합니다. </font><font style="vertical-align: inherit;">배열을 통한 스테핑에만 관련된 </font><font style="vertical-align: inherit;">일반적인 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로 시저로 </font><font style="vertical-align: inherit;">시작하겠습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">거기에서 </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>arrayDeepEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등과 같은 다른 기본 비교 함수 </font><font style="vertical-align: inherit;">를 </font><font style="vertical-align: inherit;">작성합니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мой ответ подойдет к проблеме по-другому. </font><font style="vertical-align: inherit;">Я начну с общей </font><font style="vertical-align: inherit;">процедуры </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которая касается только </font><font style="vertical-align: inherit;">перехода</font><font style="vertical-align: inherit;"> по массивам. </font><font style="vertical-align: inherit;">Оттуда, мы будем строить нашу другие основные функции сравнения , </font><font style="vertical-align: inherit;">как </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>arrayDeepEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и </font><font style="vertical-align: inherit;">т.д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的回答将以不同的方式处理该问题。</font><font style="vertical-align: inherit;">我将从通用的</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">过程</font><font style="vertical-align: inherit;">开始，该</font><font style="vertical-align: inherit;">过程仅涉及逐步遍历数组。</font><font style="vertical-align: inherit;">从那里，我们将构建其他基本比较函数，例如</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>arrayDeepEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等。</font></font>
