Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: We could just as easily defined <code>arrayLooseEqual</code> using a <code>==</code> instead. Now when comparing <code>1</code> (Number) to <code>'1'</code> (String), the result will be <code>true</code> &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podr&iacute;amos definir f&aacute;cilmente </font></font> <code>arrayLooseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando un </font></font> <code>==</code> en su<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar. </font><font style="vertical-align: inherit;">Ahora, al comparar </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (N&uacute;mero) con </font></font> <code>'1'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Cadena), el resultado ser&aacute; </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに</font> <code>==</code> <font style="vertical-align: inherit;">を使用して、</font><font style="vertical-align: inherit;">簡単に</font></font> <code>arrayLooseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">定義でき</font><font style="vertical-align: inherit;">ます。</font> <code>1</code> <font style="vertical-align: inherit;">（数値）を</font> <code>'1'</code> <font style="vertical-align: inherit;">（文字列）</font><font style="vertical-align: inherit;">と比較すると</font><font style="vertical-align: inherit;">、結果は</font> <code>true</code> <font style="vertical-align: inherit;">になり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;"> &hellip;</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신 </font> <code>==</code> <font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font></font> <code>arrayLooseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">쉽게 정의 할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이제 </font> <code>1</code> <font style="vertical-align: inherit;"> (숫자)과 </font> <code>'1'</code> <font style="vertical-align: inherit;"> (문자열)을 비교하면 결과는 </font> <code>true</code> <font style="vertical-align: inherit;"> &hellip;</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы могли бы так же легко определить </font></font> <code>arrayLooseEqual</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используя </font><font style="vertical-align: inherit;">вместо этого </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Теперь при сравнении </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Number) с </font></font> <code>'1'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (String) результат будет </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以</font><font style="vertical-align: inherit;">使用</font> <code>==</code> <font style="vertical-align: inherit;">来</font><font style="vertical-align: inherit;">轻松定义</font></font> <code>arrayLooseEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">现在，将</font> <code>1</code> <font style="vertical-align: inherit;">（数字）与</font> <code>'1'</code> <font style="vertical-align: inherit;">（字符串）进行比较时，结果将为</font> <code>true</code> <font style="vertical-align: inherit;"> &hellip;</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Well our <code>arrayCompare</code> procedure is versatile enough to use in a way that makes a deep equality test a breeze &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bueno, nuestro </font><font style="vertical-align: inherit;">procedimiento </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es lo suficientemente vers&aacute;til como para usarlo de una manera que hace que una prueba de igualdad profunda sea muy f&aacute;cil ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さて、私たちの</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロシージャは、深い同等性テストを簡単にする方法で使用できるほど用途が</font><font style="vertical-align: inherit;">広い</font><font style="vertical-align: inherit;">です&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리의 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로시 저는 심오한 평등 테스트를 산들 바람으로 만드는 방법으로 사용하기에 충분히 다재다능합니다&hellip;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ну, наша </font><font style="vertical-align: inherit;">процедура </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> достаточно универсальна, чтобы использовать ее так, чтобы сделать тест на глубокое равенство быстрым&hellip;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">好吧，我们的</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序具有足够的通用性，可以轻松地进行深度相等测试&hellip;&hellip;</font></font>

source: What happens is that we use spread operator ( ... ) to concat both arrays, then we use Set to eliminate any duplicates. Once you have that you can compare their sizes, if all three arrays have the same size you are good to go.
es: Lo que sucede es que usamos el operador de difusión (...)para concatenar ambas matrices,luego usamos Set para eliminar cualquier duplicado.Una vez que tienes eso,puedes comparar sus tamaños,si los tres arreglos tienen el mismo tamaño estás listo para ir.
ja: スプレッド演算子(...)を使って両方の配列を連結し、セットを使って重複を排除します。これで、3つの配列のサイズを比較することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 확산 연산자 (...)를 사용하여 두 배열을 연결 한 다음 Set을 사용하여 중복을 제거합니다. </font><font style="vertical-align: inherit;">일단 당신이 그들의 크기를 비교할 수 있다면, 세 개의 배열이 모두 같은 크기를 가지면 당신은 갈 수 있습니다.</font></font>
ru: Происходит то,что мы используем оператор спреда(...)для объединения обоих массивов,затем мы используем Set для устранения дубликатов.После этого можно сравнить их размеры,если все три массива имеют одинаковый размер,то можно начинать.
zh_cn: 我们要做的事情是,我们用spread操作符(...)将两个数组的大小合并,然后用Set来消除任何重复的数组。一旦你有了这些,你就可以比较它们的大小,如果三个数组都有相同的大小,你就可以进行比较了。

source: While this only works for scalar arrays (see note below), it is short:
es: Aunque esto sólo funciona para las matrices escalares (ver nota abajo),es corto:
ja: これはスカラ配列に対してのみ動作しますが(以下の注を参照)、短いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 스칼라 배열에서만 작동하지만 (아래 참고 참조) 짧습니다.</font></font>
ru: Хотя это работает только для скалярных массивов (см.примечание ниже),оно короткое:
zh_cn: 虽然这只适用于标量数组(见下面的注释),但它很短。

source: With ease, we can define exactly how we wish for two arrays to be compared &mdash; shallow, deep, strict, loose, some object property, or some arbitrary computation, or any combination of these &mdash; <strong>all using one procedure</strong>, <code>arrayCompare</code>. Maybe even dream up a <code>RegExp</code> comparator ! I know how kids love those regexps &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con facilidad, podemos definir exactamente c&oacute;mo deseamos que se comparen dos matrices: poco profundas, profundas, estrictas, sueltas, alguna propiedad de objeto o alg&uacute;n c&aacute;lculo arbitrario, o cualquier combinaci&oacute;n de estas, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todo utilizando un procedimiento</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iexcl;Quiz&aacute;s hasta sue&ntilde;e con un </font><font style="vertical-align: inherit;">comparador </font></font> <code>RegExp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ! </font><font style="vertical-align: inherit;">S&eacute; c&oacute;mo los ni&ntilde;os aman esas expresiones regulares ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">簡単に、我々は、2つの配列を比較することのために私たちが望む方法を正確に定義することができます-浅い、深い、厳格な、緩い、一部のオブジェクトのプロパティ、またはいくつかの任意の計算、またはこれらの任意の組み合わせ- </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべて使用して1つの手順</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">たぶん、</font></font> <code>RegExp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンパレータを</font><font style="vertical-align: inherit;">思いつくことさえあるでしょう</font><font style="vertical-align: inherit;">！</font><font style="vertical-align: inherit;">子供がこれらの正規表現をどのように愛しているか知っています&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 두 개의 배열 (얕은, 깊이, 엄격, 느슨 함, 일부 객체 속성 또는 임의의 계산 또는 이들의 조합)을 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모두 하나의 프로 시저</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font></font> <code>arrayCompare</code> 를<font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">사용하여 </font></strong><font style="vertical-align: inherit;">비교할 </font><strong><font style="vertical-align: inherit;">방법</font></strong><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">쉽게 정의 할 수</font><font style="vertical-align: inherit;"> 있습니다. 아마도 </font></font> <code>RegExp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 비교기를 </font><font style="vertical-align: inherit;">꿈꾸는 것일 수도 있습니다 </font><font style="vertical-align: inherit;">! 아이들이 어떻게 정규 표현식을 좋아하는지 알고 있습니다.&hellip;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С легкостью, мы можем точно определить , </font><font style="vertical-align: inherit;">как мы хотим , </font><font style="vertical-align: inherit;">два массива для сравнения - мелкий, глубокий, строгий, свободный, некоторые свойства объекта, или некоторые произвольные вычисления, или любая комбинация из них - </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">все это с </font><font style="vertical-align: inherit;">помощью одной процедуры</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Может быть, даже мечтать о </font></font> <code>RegExp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> компаратор! </font><font style="vertical-align: inherit;">Я знаю, как дети любят эти регулярные выражения ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">轻松，我们可以定义正是我们希望的要比较两个数组-浅，深，严，活，一些对象属性，或一些任意的计算，或者它们的任意组合- </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有使用一个程序</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">甚至可以梦想一个</font></font> <code>RegExp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比较器！</font><font style="vertical-align: inherit;">我知道孩子们如何爱那些正则表达式&hellip;&hellip;</font></font>

source: Works with <strong>MULTIPLE</strong> arguments with <strong>NESTED</strong> arrays:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Funciona con </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&Uacute;LTIPLES</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> argumentos con </font><font style="vertical-align: inherit;">matrices </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ANIDADAS</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で動作します</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MULTIPLE</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と引数</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NESTED</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列：</font></font>
ko: <font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">NESTED</font></strong><font style="vertical-align: inherit;"> 배열 </font><font style="vertical-align: inherit;">로 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MULTIPLE</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인수와 함께 </font><font style="vertical-align: inherit;">작동 </font><font style="vertical-align: inherit;">합니다.</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Работает с </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">НЕСКОЛЬКИМИ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> аргументами с </font><font style="vertical-align: inherit;">массивами </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NESTED</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font><strong><font style="vertical-align: inherit;">NESTED</font></strong><font style="vertical-align: inherit;">数组</font><font style="vertical-align: inherit;">一起使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MULTIPLE</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数</font><font style="vertical-align: inherit;">：</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>

source: Works with any nested data structure, and obviously ignores objects' methods. Don't even think of extending Object.prototype with this method, when I tried this once, jQuery broke ;)
es: Funciona con cualquier estructura de datos anidados,y obviamente ignora los métodos de los objetos.Ni siquiera pienses en extender el prototipo de Object.prototype con este método,cuando lo intenté una vez,jQuery se rompió ;)
ja: このメソッドを使ってObject.prototypeを拡張しようとは思わないでください。このメソッドを使ってObject.prototypeを拡張しようとは思わないでください。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중첩 된 데이터 구조와 함께 작동하며 객체의 메서드를 무시합니다. </font><font style="vertical-align: inherit;">이 방법으로 Object.prototype을 확장한다고 생각조차하지 않습니다.이 작업을 한 번 시도하면 jQuery가 중단되었습니다.)</font></font>
ru: Работает с любой вложенной структурой данных и,очевидно,игнорирует методы объектов.Даже не думайте расширять Object.prototype этим методом,когда я пробовал это однажды,jQuery сломался ;)
zh_cn: 可以与任何嵌套的数据结构一起使用,而且显然可以忽略对象的方法。别想用这个方法扩展Object.prototype,当我试过一次,jQuery就崩溃了;)

source: You can see we're actually doing more with less code. There's nothing complicated about <code>arrayCompare</code> itself and each of the custom comparators we've made have a very simple implementation.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puedes ver que en realidad estamos haciendo m&aacute;s con menos c&oacute;digo. </font><font style="vertical-align: inherit;">No hay nada complicado sobre </font></font> <code>arrayCompare</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s&iacute; mismo y cada uno de los comparadores personalizados que hemos creado tiene una implementaci&oacute;n muy simple.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">少ないコードで実際に多くのことを行っていることがわかります。</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自体は</font><font style="vertical-align: inherit;">複雑ではなく</font><font style="vertical-align: inherit;">、作成したカスタムコンパレータはそれぞれ非常に単純な実装です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 적은 코드로 더 많은 일을하고 있음을 알 수 있습니다. </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자체 </font><font style="vertical-align: inherit;">에 대해 복잡한 것은 없으며 </font><font style="vertical-align: inherit;">우리가 만든 각 사용자 지정 비교기는 매우 간단한 구현을 가지고 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете видеть, что мы на самом деле делаем больше с меньшим количеством кода. </font><font style="vertical-align: inherit;">В самом </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> нет ничего сложного </font><font style="vertical-align: inherit;">, и каждый из созданных нами пользовательских компараторов имеет очень простую реализацию.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以看到我们实际上在用更少的代码做更多的事情。</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本身</font><font style="vertical-align: inherit;">并不复杂</font><font style="vertical-align: inherit;">，我们制作的每个自定义比较器都有一个非常简单的实现。</font></font>
