Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You may say "<em>But it is much faster to compare strings - no loops...</em>" well, then you should note there ARE loops. First recursive loop that converts Array to string and second, that compares two strings. So this method <strong>is faster than use of string</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede decir " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero es mucho m&aacute;s r&aacute;pido comparar cadenas, sin bucles ...</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " bueno, entonces debe tener en cuenta que HAY bucles. </font><font style="vertical-align: inherit;">Primer bucle recursivo que convierte Array en cadena y segundo, que compara dos cadenas. </font><font style="vertical-align: inherit;">Entonces, este m&eacute;todo </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es m&aacute;s r&aacute;pido que el uso de cadenas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、文字列を比較する方がはるかに高速です-ループはありません...</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">と言うかもしれません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">配列を文字列に変換する最初の再帰ループと、2つの文字列を比較する2番目のループ。</font><font style="vertical-align: inherit;">したがって、この方法</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はstringを使用するよりも高速です</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">" </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하지만 문자열을 비교하는 것이 훨씬 빠릅니다. 루프가 없습니다 ...</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " </font><font style="vertical-align: inherit;">라고 말하면 </font><em><font style="vertical-align: inherit;">루프</font></em><font style="vertical-align: inherit;"> 가 있다는 것을 알아야합니다. </font><font style="vertical-align: inherit;">첫 번째 재귀 루프는 Array를 문자열로 변환하고 두 번째는 두 문자열을 비교합니다. </font><font style="vertical-align: inherit;">따라서이 방법 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은 string 사용보다 빠릅니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете сказать: &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но сравнивать строки гораздо быстрее - никаких циклов ...</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;, тогда вы должны заметить, что есть циклы ARE. </font><font style="vertical-align: inherit;">Первый рекурсивный цикл, который преобразует массив в строку, а второй, который сравнивает две строки. </font><font style="vertical-align: inherit;">Так что этот метод </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">быстрее, чем использование строки</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可能会说&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是比较字符串要快得多-没有循环...</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;，那么，您应该注意存在ARE循环。</font><font style="vertical-align: inherit;">第一个递归循环将Array转换为字符串，第二个递归循环比较两个字符串。</font><font style="vertical-align: inherit;">因此，此方法</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比使用string更快</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: You'll get
es: Tendrás
ja: あなたが得られるのは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 얻을 것이다</font></font>
ru: Ты получишь
zh_cn: 你会得到

source: You've probably noticed that this is only shallow comparison tho. Surely Tom&aacute;&scaron;'s solution is "The Right Way&trade;" because it does implicit deep comparison, right ?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Probablemente hayas notado que esto es solo una comparaci&oacute;n superficial. </font><font style="vertical-align: inherit;">Seguramente la soluci&oacute;n de Tom&aacute;&scaron; es "The Right Way &trade;" porque hace una comparaci&oacute;n profunda impl&iacute;cita, &iquest;verdad?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは浅い比較にすぎないことに気づいたでしょう。</font><font style="vertical-align: inherit;">きっとトマシュの解法は「The Right Way&trade;」です。暗黙の深い比較を行うからですよね？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 이것은 단지 얕은 비교 방법이라는 것을 알았을 것입니다. </font><font style="vertical-align: inherit;">Tom&aacute;&scaron;의 솔루션은 "The Right Way &trade;"입니다. 암묵적인 심층 비교를하기 때문입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы, наверное, заметили, что это только поверхностное сравнение. </font><font style="vertical-align: inherit;">Конечно, решение Томаша - &laquo;Правильный путь &trade;&raquo;, потому что оно подразумевает глубокое сравнение, верно?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可能已经注意到，这只是比较浅的比较。</font><font style="vertical-align: inherit;">Tom&aacute;&scaron;的解决方案肯定是&ldquo; The Right Way&trade;&rdquo;，因为它确实进行了隐式的深度比较，对吗？</font></font>

source: calling function
es: función de llamada
ja: 呼び出し機能
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호출 기능</font></font>
ru: вызывающая функция
zh_cn: 调用函数

source: hope it will help someone.
es: Espero que ayude a alguien.
ja: 誰かのお役に立てれば幸いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가에게 도움이되기를 바랍니다.</font></font>
ru: надеюсь,это кому-нибудь поможет.
zh_cn: 希望能帮到某人。
