Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This answer also <strong>ignores the order of elements</strong>, as I said, the exact situation happened to me, so maybe someone in the same situation might end up here (as I did).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta respuesta tambi&eacute;n </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ignora el orden de los elementos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , como dije, la situaci&oacute;n exacta me sucedi&oacute;, por lo que tal vez alguien en la misma situaci&oacute;n podr&iacute;a terminar aqu&iacute; (como lo hice yo).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この回答</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、要素の順序</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も</font><strong><font style="vertical-align: inherit;">無視し</font></strong><font style="vertical-align: inherit;">ます。</font><strong><font style="vertical-align: inherit;">先ほど</font></strong><font style="vertical-align: inherit;">述べたように、正確な状況が私に起こったので、同じ状況の誰かがここで（おそらく私がしたように）終わるかもしれません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 대답은 또한 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요소의 순서를 무시합니다.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내가 말했듯이 정확한 상황은 나에게 일어 났으므로 같은 상황에있는 누군가가 여기에서 끝날 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот ответ также </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">игнорирует порядок элементов</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , как я уже сказал, точная ситуация произошла со мной, так что, возможно, кто-то в такой же ситуации может оказаться здесь (как я).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如我说的那样，</font><font style="vertical-align: inherit;">这个答案也</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">忽略了元素的顺序</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，就像我说的那样，确切的情况发生在我身上，因此也许处于相同情况的某个人可能会在这里结束（就像我一样）。</font></font>

source: This compares 2 unsorted arrays:
es: Esto compara 2 matrices sin clasificar:
ja: これは,2つのソートされていない配列を比較します.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬되지 않은 2 개의 배열을 비교합니다.</font></font>
ru: Это сравнивает 2 несортированных массива:
zh_cn: 这比较了2个未排序的数组。

source: This converts the objects <code>a1</code> and <code>a2</code> into strings so they can be compared. The order is important in most cases, for that can sort the object using a sort algorithm shown in one of the above answers.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto convierte los objetos </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>a2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cadenas para que puedan ser comparados. </font><font style="vertical-align: inherit;">El orden es importante en la mayor&iacute;a de los casos, ya que puede ordenar el objeto utilizando un algoritmo de clasificaci&oacute;n que se muestra en una de las respuestas anteriores.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、オブジェクト</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>a2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が文字列に</font><font style="vertical-align: inherit;">変換され、</font><font style="vertical-align: inherit;">比較できるようになります。</font><font style="vertical-align: inherit;">上記の回答の1つに示されているソートアルゴリズムを使用してオブジェクトをソートできるため、ほとんどの場合、順序は重要です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 객체 </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>a2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 문자열 </font><font style="vertical-align: inherit;">로 변환하여 </font><font style="vertical-align: inherit;">비교할 수있게합니다. </font><font style="vertical-align: inherit;">위의 답변 중 하나에 표시된 정렬 알고리즘을 사용하여 객체를 정렬 할 수 있기 때문에 대부분의 경우 순서가 중요합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это преобразует объекты </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>a2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в строки, чтобы их можно было сравнивать. </font><font style="vertical-align: inherit;">Порядок важен в большинстве случаев, поскольку для этого можно отсортировать объект с помощью алгоритма сортировки, показанного в одном из приведенных выше ответов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这会将对象</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>a2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转换为字符串，以便可以对其进行比较。</font><font style="vertical-align: inherit;">在大多数情况下，顺序很重要，因为顺序可以使用上述答案之一所示的排序算法对对象进行排序。</font></font>

source: This function takes an additional parameter of strict that defaults to true. This strict parameter defines if the arrays need to be wholly equal in both contents and the order of those contents, or simply just contain the same contents.
es: Esta función toma un parámetro adicional de estricto que por defecto es verdadero.Este parámetro estricto define si las matrices deben ser totalmente iguales tanto en contenido como en el orden de esos contenidos,o si simplemente contienen el mismo contenido.
ja: この関数は,デフォルトでは true を指定する strict パラメータを追加します.この strict パラメータは,配列の内容と順序が完全に等しくなければならないのか,あるいは単に同じ内容を含むだけなのかを定義します.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 함수는 기본값 인 true로 추가 매개 변수를 사용합니다. </font><font style="vertical-align: inherit;">이 엄격한 매개 변수는 배열이 내용과 내용의 순서에서 모두 동일해야하는지 또는 단순히 동일한 내용을 포함해야하는지 여부를 정의합니다.</font></font>
ru: Эта функция принимает дополнительный параметр строгого значения по умолчанию true.Этот строгий параметр определяет,должны ли массивы быть полностью равны как по содержанию,так и по порядку их расположения,или просто содержать одно и то же содержимое.
zh_cn: 这个函数需要一个额外的参数 strict,默认为 true。这个 strict 参数定义了数组的内容和顺序是否需要完全相等,或者仅仅是包含相同的内容。

source: This has a reason, since there may be, for example <a href="https://stackoverflow.com/a/201471/607407">private variables within objects.</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto tiene una raz&oacute;n, ya que puede haber, por ejemplo, </font></font><a href="https://stackoverflow.com/a/201471/607407"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">variables privadas dentro de los objetos.</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font><a href="https://stackoverflow.com/a/201471/607407"><font style="vertical-align: inherit;">オブジェクト内にプライベート変数</font></a><font style="vertical-align: inherit;">がある可能性があるため、これには理由があり</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font><a href="https://stackoverflow.com/a/201471/607407"><font style="vertical-align: inherit;">객체 내에 개인 변수</font></a><font style="vertical-align: inherit;"> 가있을 수 있기 때문 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это имеет причину, поскольку, например, </font><a href="https://stackoverflow.com/a/201471/607407"><font style="vertical-align: inherit;">в объектах</font></a><font style="vertical-align: inherit;"> могут быть </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">частные переменные.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是有原因的，因为</font><a href="https://stackoverflow.com/a/201471/607407"><font style="vertical-align: inherit;">对象中</font></a><font style="vertical-align: inherit;">可能存在例如</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私有变量。</font></font>

source: This is how i did it.
es: Así es como lo hice.
ja: これが私がやった方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 내가 한 방법입니다.</font></font>
ru: Вот как я это сделал.
zh_cn: 我就是这样做的

source: This should return true only if the arrays have equal elements at corresponding indices.
es: Esto debería volver a ser cierto sólo si los conjuntos tienen elementos iguales en los índices correspondientes.
ja: これは、対応するインデックスに等しい要素を持つ配列の場合にのみ真を返すべきです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열이 해당 인덱스에서 동일한 요소를 갖는 경우에만 true를 리턴해야합니다.</font></font>
ru: Это должно возвращать true только в том случае,если массивы имеют равные элементы при соответствующих индексах.
zh_cn: 只有当数组在相应的索引处有相等的元素时,才会返回true。

source: To compare arrays, loop through them and compare every value:
es: Para comparar las matrices,haz un bucle a través de ellas y compara cada valor:
ja: 配列を比較するには、それらをループして、すべての値を比較します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 비교하려면 배열을 반복하고 모든 값을 비교하십시오.</font></font>
ru: Чтобы сравнить массивы,пройдите через них и сравните каждое значение:
zh_cn: 为了比较数组,要在数组中进行循环,比较每一个值。

source: To make this work with <code>Array.equals</code> you must edit the original function a little bit:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para que esto funcione con </font></font> <code>Array.equals</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , debe editar un poco la funci&oacute;n original:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを</font></font> <code>Array.equals</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能させるには、元の関数を少し編集する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Array.equals</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서이 작업을 수행하려면 </font><font style="vertical-align: inherit;">원래 함수를 약간 편집해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы это работало с </font></font> <code>Array.equals</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы должны немного отредактировать оригинальную функцию:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了使它与</font></font> <code>Array.equals</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一起</font><font style="vertical-align: inherit;">使用，</font><font style="vertical-align: inherit;">您必须稍微编辑一下原始函数：</font></font>

source: To me, this already a clear improvement over Tom&aacute;&scaron;'s solution because I can <em>explicitly</em> choose a shallow or deep comparison for my arrays, as needed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para m&iacute;, esto ya es una clara mejora sobre la soluci&oacute;n de Tom&aacute;&scaron; porque puedo </font><font style="vertical-align: inherit;">elegir </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">expl&iacute;citamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una comparaci&oacute;n superficial o profunda para mis matrices, seg&uacute;n sea necesario.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私にとって、これ</font><font style="vertical-align: inherit;">は、必要に応じて、配列の浅い比較または深い比較を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明示的に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">選択</font><font style="vertical-align: inherit;">できるため、トマシュのソリューションよりも明らかに明確な改善</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필자는 </font><font style="vertical-align: inherit;">필요에 따라 어레이에 대해 얕거나 깊은 비교를 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명시 적으로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 선택할 </font><font style="vertical-align: inherit;">수 있기 때문에 Tom&aacute;&scaron; 솔루션보다 이미 분명히 개선되었습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для меня это уже явное улучшение по сравнению с решением Томаша, потому что я могу </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">явно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выбирать поверхностное или глубокое сравнение для своих массивов, по мере необходимости.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对我来说，这已经是Tom&aacute;&scaron;解决方案的明显改进，因为我可以</font><font style="vertical-align: inherit;">根据需要为数组</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明确</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择浅表或深表比较。</font></font>

source: Tom&aacute;&scaron;'s could say his solution is fast but I would also say it is needlessly complicated. It tries to be an all-in-one solution that works for all arrays, nested or not. In fact, it even accepts more than just arrays as an input and still attempts to give a "valid" answer.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron; podr&iacute;a decir que su soluci&oacute;n es r&aacute;pida, pero tambi&eacute;n dir&iacute;a que es innecesariamente complicada. </font><font style="vertical-align: inherit;">Intenta ser una soluci&oacute;n todo en uno que funcione para todos los arreglos, anidados o no. </font><font style="vertical-align: inherit;">De hecho, incluso acepta algo m&aacute;s que matrices como entrada y a&uacute;n intenta dar una respuesta "v&aacute;lida".</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">トマーシュは彼の解決策は速いと言えるかもしれませんが、私はそれが不必要に複雑であるとも言います。</font><font style="vertical-align: inherit;">ネストされているかどうかにかかわらず、すべての配列で機能するオールインワンソリューションを目指しています。</font><font style="vertical-align: inherit;">実際、それは配列としてだけでなく入力としても受け入れ、「有効な」答えを出そうとします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron;는 그의 솔루션이 빠르다고 말할 수 있지만 필연적으로 복잡하다고 말합니다. </font><font style="vertical-align: inherit;">중첩 여부에 관계없이 모든 어레이에서 작동하는 올인원 솔루션이 되려고합니다. </font><font style="vertical-align: inherit;">실제로, 그것은 단지 배열 이상의 것을 입력으로 받아들이고 여전히 "유효한"대답을 시도합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Томаш мог бы сказать, что его решение быстрое, но я бы сказал, что оно слишком сложное. </font><font style="vertical-align: inherit;">Он пытается быть универсальным решением, которое работает для всех массивов, вложенных или нет. </font><font style="vertical-align: inherit;">На самом деле, он даже принимает в качестве входных данных не только массивы, но все еще пытается дать &laquo;правильный&raquo; ответ.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">汤玛斯（Tom&aacute;&scaron;）可以说他的解决方案是快速的，但我也要说它不必要地复杂。</font><font style="vertical-align: inherit;">它试图成为一种适用于所有数组（无论是否嵌套）的多合一解决方案。</font><font style="vertical-align: inherit;">实际上，它甚至接受的不仅仅是数组作为输入，而且仍然尝试给出&ldquo;有效&rdquo;答案。</font></font>

source: Underscore isEqual docs
es: Subrayar es "Igualdad de documentos".
ja: アンダースコア isEqual docs
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">밑줄은 동일한 문서입니다</font></font>
ru: Underscore isEqual документы

source: We could do this the functional way, using <code>every</code> (<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</a>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podr&iacute;amos hacer esto de manera funcional, usando </font></font> <code>every</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>every</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">て</font><font style="vertical-align: inherit;">、これを機能的な方法で行うことができます</font><font style="vertical-align: inherit;">（</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 사용이에게 기능적인 방법으로 할 수있는 </font></font> <code>every</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы могли бы сделать это функциональным способом, используя </font></font> <code>every</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以使用</font></font> <code>every</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/every</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">来通过功能性方式实现</font></font>
