Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As the type suggests, <code>arrayCompare</code> takes comparison function, <code>f</code>, and two input arrays, <code>xs</code> and <code>ys</code>. For the most part, all we do is call <code>f (x) (y)</code> for each element in the input arrays. We return an early <code>false</code> if the user-defined <code>f</code> returns <code>false</code> &ndash; thanks to <code>&amp;&amp;</code>'s short-circuit evaluation. So yes, this means the comparator can stop iteration early and prevent looping through the rest of the input array when unnecessary.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como sugiere el tipo, </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> toma la funci&oacute;n de comparaci&oacute;n, </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y dos matrices de entrada, </font></font> <code>xs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e </font></font> <code>ys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En su mayor parte, todo lo que hacemos es llamar a </font></font> <code>f (x) (y)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cada elemento en las matrices de entrada. </font><font style="vertical-align: inherit;">Devolvemos un </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> temprano </font><font style="vertical-align: inherit;">si la </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> definida por el usuario </font><font style="vertical-align: inherit;">devuelve </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , gracias a la </font><font style="vertical-align: inherit;">evaluaci&oacute;n de cortocircuito de </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Entonces, s&iacute;, esto significa que el comparador puede detener la iteraci&oacute;n temprano y evitar que se repita en el resto de la matriz de entrada cuando sea innecesario.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプが示すように、</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は比較関数</font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と2つの入力配列</font></font> <code>xs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>ys</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">取り</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ほとんどの場合、行うのは</font><font style="vertical-align: inherit;">入力配列の各要素</font></font> <code>f (x) (y)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出すことだけです</font><font style="vertical-align: inherit;">。</font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;">の短絡評価の</font><font style="vertical-align: inherit;">おかげで</font><font style="vertical-align: inherit;">、ユーザー定義の</font> <code>f</code> <font style="vertical-align: inherit;">が</font> <code>false</code> <font style="vertical-align: inherit;">を返した</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、初期の</font></font> <code>false</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">つまり、これはコンパレーターが反復を早期に停止し、不要な場合に残りの入力配列をループしないようにすることができることを意味します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유형에서 알 수 있듯이 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 비교 함수 </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 두 개의 입력 배열 </font></font> <code>xs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>ys</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 취 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">대부분의 </font><font style="vertical-align: inherit;">경우 입력 배열의 각 요소에 대해 </font></font> <code>f (x) (y)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">호출 </font><font style="vertical-align: inherit;">하면됩니다. </font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"> 의 단락 평가 </font><font style="vertical-align: inherit;">덕분에 </font><font style="vertical-align: inherit;">사용자 정의 </font> <code>f</code> <font style="vertical-align: inherit;"> 가 </font> <code>false</code> 를<font style="vertical-align: inherit;"> 반환하면 초기 </font></font> <code>false</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반환합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">따라서, 이것은 비교기가 반복을 조기에 중단하고 불필요 할 때 나머지 입력 배열을 통한 루핑을 방지 할 수 있음을 의미합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как предполагает тип, </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> принимает функцию сравнения </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и два входных массива </font></font> <code>xs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">По большей части все, что мы делаем, это вызываем </font></font> <code>f (x) (y)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для каждого элемента во входных массивах. </font><font style="vertical-align: inherit;">Мы возвращаем раннее </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если пользовательское </font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - благодаря </font><font style="vertical-align: inherit;">оценке </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> короткого замыкания. </font><font style="vertical-align: inherit;">Так что да, это означает, что компаратор может прекратить итерацию на ранней стадии и предотвратить циклическое прохождение через остальную часть входного массива, когда это не нужно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如类型所暗示的，</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接受比较函数</font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，以及两个输入数组</font></font> <code>xs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在大多数情况下，我们要做的就是</font><font style="vertical-align: inherit;">为输入数组中的每个元素</font><font style="vertical-align: inherit;">调用</font></font> <code>f (x) (y)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我们回到早期的</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，如果用户定义的</font></font> <code>f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">回报</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -由于</font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的短路计算。</font><font style="vertical-align: inherit;">所以是的，这意味着比较器可以及早停止迭代，并在不必要时防止循环遍历输入数组的其余部分。</font></font>

source: Because <code>arrayDeepCompare</code> is curried, we can partially apply it like we did in the previous examples too
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que </font></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es curry, tambi&eacute;n podemos aplicarlo parcialmente como lo hicimos en los ejemplos anteriores</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はカリー化されて</font><font style="vertical-align: inherit;">いるため</font><font style="vertical-align: inherit;">、前の例で行ったように部分的に適用することもできます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 커리 </font><font style="vertical-align: inherit;">되므로 </font><font style="vertical-align: inherit;">이전 예제에서와 마찬가지로 부분적으로 적용 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку </font></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является карри, мы можем частично применить его, как и в предыдущих примерах</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font> <code>arrayDeepCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是可</font><font style="vertical-align: inherit;">固化</font><font style="vertical-align: inherit;">的，所以我们也可以像前面的示例一样部分应用它</font></font>

source: Bonus: Nested arrays with <code>indexOf</code> and <code>contains</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bonificaci&oacute;n: matrices anidadas con </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>contains</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ボーナス：</font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font> <code>contains</code> を含む<font style="vertical-align: inherit;">ネストされた配列</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보너스 : 중첩 된 배열 </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>contains</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Бонус: вложенные массивы с </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>contains</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">奖励：具有</font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">且</font> <code>contains</code> <font style="vertical-align: inherit;">嵌套数组</font></font><font style="vertical-align: inherit;"></font>

source: Building off Tom&aacute;&scaron; Zato's answer, I agree that just iterating through the arrays is the fastest. Additionally (like others have already stated), the function should be called equals/equal, not compare. In light of this, I modified the function to handle comparing arrays for similarity - i.e. they have the same elements, but out of order - for personal use, and thought I'd throw it on here for everyone to see.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Partiendo de la respuesta de Tom&aacute;&scaron; Zato, estoy de acuerdo en que simplemente iterar a trav&eacute;s de los arreglos es lo m&aacute;s r&aacute;pido. </font><font style="vertical-align: inherit;">Adem&aacute;s (como ya han dicho otros), la funci&oacute;n debe llamarse igual / igual, no comparar. </font><font style="vertical-align: inherit;">A la luz de esto, modifiqu&eacute; la funci&oacute;n para manejar comparaciones de matrices por similitud, es decir, tienen los mismos elementos, pero fuera de servicio, para uso personal, y pens&eacute; en ponerla aqu&iacute; para que todos la vean.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron;Zatoの答えを基にして、配列を反復するだけが最速であることに同意します。</font><font style="vertical-align: inherit;">さらに（他の人がすでに述べているように）、関数は比較ではなく、等しい/等しいと呼ばれるべきです。</font><font style="vertical-align: inherit;">これを踏まえて、配列の類似性を比較するために関数を変更しました。つまり、配列は同じ要素ですが、順序が正しくありません-個人的な使用のために、ここでそれをすべての人に見せると思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron; Zato의 답변을 바탕으로 배열을 반복하는 것이 가장 빠릅니다. </font><font style="vertical-align: inherit;">또한 (다른 사람들이 이미 언급했듯이) 함수는 비교하지 않고 같음 / 같음이라고합니다. </font><font style="vertical-align: inherit;">이것에 비추어, 나는 비슷한 점에 대한 배열 비교를 처리하기 위해 함수를 수정했다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Опираясь на ответ Томаша Зато, я согласен, что итерация по массивам самая быстрая. </font><font style="vertical-align: inherit;">Кроме того (как уже говорили другие), функцию следует называть равной / равной, а не сравнивать. </font><font style="vertical-align: inherit;">В свете этого я изменил функцию для обработки сравнения массивов на предмет сходства - т.е. они имеют одинаковые элементы, но не по порядку - для личного использования, и подумал, что я добавлю это здесь для всеобщего обозрения.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基于Tom&aacute;&scaron;Zato的回答，我同意仅迭代数组是最快的。</font><font style="vertical-align: inherit;">另外（就像其他人已经说过的那样），该函数应称为等于/等于，而不是比较。</font><font style="vertical-align: inherit;">有鉴于此，我修改了该函数以处理比较数组的相似性（即它们具有相同的元素，但顺序混乱）供个人使用，并认为我会将其放在这里供大家查看。</font></font>

source: But fails on:
es: Pero falla:
ja: しかし、失敗する。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 실패합니다 :</font></font>
ru: Но терпит неудачу:
zh_cn: 但失败了就。

source: Comparing 2 arrays:
es: Comparando 2 matrices:
ja: 2つの配列を比較します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 개의 배열 비교 :</font></font>
ru: Сравниваем 2 массива:
zh_cn: 比较2个数组。

source: Comparing arrays:
es: Comparando matrices:
ja: 配列を比較します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 비교 :</font></font>
ru: Сравнивая массивы:
zh_cn: 比较数组。

source: Comparing objects:
es: Comparando objetos:
ja: オブジェクトを比較する。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 비교 :</font></font>
ru: Сравнение объектов:
zh_cn: 对比对象。

source: Consider this code:
es: Considere este código:
ja: このコードを考えてみてください。
ko: 이 코드를 고려하십시오.
ru: Рассмотрим этот код:
zh_cn: 考虑一下这个代码。

source: Deep array with objects? Not a problem. We built highly versatile, generic functions, so they'll work in a wide variety of use cases.
es: ¿Una gran variedad de objetos? No hay problema.Construimos funciones genéricas muy versátiles,para que funcionen en una amplia variedad de casos de uso.
ja: オブジェクトを使った深い配列?問題ありません。汎用性の高い汎用的な関数を構築したので、さまざまなユースケースで動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체가있는 깊은 배열? </font><font style="vertical-align: inherit;">문제가 아니다. </font><font style="vertical-align: inherit;">우리는 매우 다양한 범용 기능을 구축하여 다양한 사용 사례에서 작동합니다.</font></font>
ru: Глубокий массив с объектами? Не проблема.Мы создали очень универсальные,общие функции,поэтому они будут работать в самых разных случаях.
zh_cn: 深度数组与对象?不是问题。我们构建了高度通用的通用函数,所以它们可以在各种用例中工作。

source: Deep comparison (recursive)
es: Comparación profunda (recursiva)
ja: 深い比較(再帰的
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">깊은 비교 (재귀)</font></font>
ru: Глубокое сравнение (рекурсивный)
zh_cn: 深度比较(递归)

source: Does that make it the "right" solution for you ? That's up for <em>you</em> to decide. And no one else can do that for you; only you know what your needs are. In almost all cases, I value straightforward, practical, and versatile code over clever and fast kind. What you value might differ, so pick what works for you.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Eso lo convierte en la soluci&oacute;n "adecuada" para usted? </font><font style="vertical-align: inherit;">Eso depende de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ti</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para decidir. </font><font style="vertical-align: inherit;">Y nadie m&aacute;s puede hacer eso por ti; </font><font style="vertical-align: inherit;">solo t&uacute; sabes cu&aacute;les son tus necesidades. </font><font style="vertical-align: inherit;">En casi todos los casos, valoro el c&oacute;digo directo, pr&aacute;ctico y vers&aacute;til en vez de inteligente y r&aacute;pido. </font><font style="vertical-align: inherit;">Lo que valoras puede diferir, as&iacute; que elige lo que funcione para ti.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それはあなたにとって「正しい」解決策になりますか？</font><font style="vertical-align: inherit;">それは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなた</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が決めることです。</font><font style="vertical-align: inherit;">そして、他の誰もあなたのためにそれを行うことはできません。</font><font style="vertical-align: inherit;">あなただけがあなたのニーズが何であるかを知っています。</font><font style="vertical-align: inherit;">ほとんどすべての場合で、私は、賢くて速い種類よりも、単純で実用的で用途の広いコードを重視しています。</font><font style="vertical-align: inherit;">何を評価するかは異なる可能性があるため、自分に合ったものを選択してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 당신에게 "올바른"솔루션이됩니까? </font><font style="vertical-align: inherit;">그것은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 결정할 일입니다. </font><font style="vertical-align: inherit;">그리고 아무도 당신을 위해 그렇게 할 수 없습니다. </font><font style="vertical-align: inherit;">오직 당신 만이 당신의 요구를 알고 있습니다. </font><font style="vertical-align: inherit;">거의 모든 경우에, 나는 영리하고 빠른 종류보다 간단하고 실용적이며 다양한 코드를 소중하게 생각합니다. </font><font style="vertical-align: inherit;">당신이 중요하게 생각하는 것은 다를 수 있으므로 자신에게 맞는 것을 선택하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это делает это "правильным" решением для вас? </font><font style="vertical-align: inherit;">Это для </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вас</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , чтобы решить. </font><font style="vertical-align: inherit;">И никто другой не может сделать это для вас; </font><font style="vertical-align: inherit;">только вы знаете, каковы ваши потребности. </font><font style="vertical-align: inherit;">Почти во всех случаях я ценю простой, практичный и универсальный код перед умным и быстрым. </font><font style="vertical-align: inherit;">То, что вы цените, может отличаться, поэтому выберите то, что вам подходит.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是否使它成为您的&ldquo;正确&rdquo;解决方案？</font><font style="vertical-align: inherit;">由</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">决定。</font><font style="vertical-align: inherit;">没有人能为您做到这一点。</font><font style="vertical-align: inherit;">只有您知道您的需求是什么。</font><font style="vertical-align: inherit;">在几乎所有情况下，我都重视简单，实用和通用的代码，而不是聪明，快速的代码。</font><font style="vertical-align: inherit;">您的价值可能会有所不同，因此请选择对您有用的。</font></font>

source: Even though this has a lot of answers, one that I believe to be of help:
es: Aunque esto tiene muchas respuestas,una que creo que es de ayuda:
ja: これには多くの答えがありますが、私が参考になると信じているものがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에는 많은 답변이 있지만 도움이되는 것으로 생각됩니다.</font></font>
ru: Несмотря на то,что в этом есть много ответов,один из которых,как мне кажется,поможет:
zh_cn: 虽然这里面有很多答案,但有一个我认为是有帮助的。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Extending Tom&aacute;&scaron; Zato idea. Tomas's Array.prototype.compare should be infact called Array.prototype.compareIdentical.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ampliando la idea de Tom&aacute;&scaron; Zato. </font><font style="vertical-align: inherit;">El Array.prototype.compare de Tomas debe de hecho llamarse Array.prototype.compareIdentical.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron;Zatoのアイデアを拡張する。</font><font style="vertical-align: inherit;">TomasのArray.prototype.compareは、そのままArray.prototype.compareIdenticalと呼ばれるはずです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tom&aacute;&scaron; Zato 아이디어 확장. </font><font style="vertical-align: inherit;">Tomas의 Array.prototype.compare는 사실상 Array.prototype.compareIdentical이라고합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Расширение идеи Томаша Зато. </font><font style="vertical-align: inherit;">Array.prototype.compare Томаса должен быть на самом деле Array.prototype.compareIdentical.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">扩展Tom&aacute;&scaron;Zato的想法。</font><font style="vertical-align: inherit;">Tomas的Array.prototype.compare实际上应该称为Array.prototype.compareIdentical。</font></font>
