Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: My old answer was more focused on decomposing <code>arrayEqual</code> into tiny procedures. It's an interesting exercise, but not really the best (most practical) way to approach this problem. If you're interested, you can see this revision history.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi vieja respuesta estaba m&aacute;s centrada en descomponer </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en peque&ntilde;os procedimientos. </font><font style="vertical-align: inherit;">Es un ejercicio interesante, pero no es la mejor forma (la m&aacute;s pr&aacute;ctica) de abordar este problema. </font><font style="vertical-align: inherit;">Si est&aacute; interesado, puede ver este historial de revisiones.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の以前の答えは、</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を小さなプロシージャ</font><font style="vertical-align: inherit;">に分解することに重点を置いていました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは興味深い演習ですが、この問題に取り組むための最良の（最も実用的な）方法ではありません。</font><font style="vertical-align: inherit;">興味があれば、この変更履歴を見ることができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 오래된 대답은 </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 작은 절차로 </font><font style="vertical-align: inherit;">분해하는 데 더 집중했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것은 흥미로운 운동이지만 실제로이 문제에 접근하는 가장 (가장 실용적인) 방법은 아닙니다. </font><font style="vertical-align: inherit;">관심이 있으시면이 개정 내역을 볼 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мой старый ответ был больше сосредоточен на разложении </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на крошечные процедуры. </font><font style="vertical-align: inherit;">Это интересное упражнение, но не самый лучший (самый практичный) способ решения этой проблемы. </font><font style="vertical-align: inherit;">Если вам интересно, вы можете увидеть эту историю изменений.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我以前的答案是更专注于将</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分解</font><font style="vertical-align: inherit;">为小程序。</font><font style="vertical-align: inherit;">这是一个有趣的练习，但实际上并不是解决此问题的最佳（最实用）方法。</font><font style="vertical-align: inherit;">如果您有兴趣，可以查看此修订历史记录。</font></font>

source: Next, using our <code>arrayCompare</code> function, we can easily create other functions we might need. We'll start with the elementary <code>arrayEqual</code> &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Luego, usando nuestra </font><font style="vertical-align: inherit;">funci&oacute;n </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos crear f&aacute;cilmente otras funciones que podamos necesitar. </font><font style="vertical-align: inherit;">Comenzaremos con la </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> elemental </font><font style="vertical-align: inherit;">Equal</font><font style="vertical-align: inherit;"> ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font><font style="vertical-align: inherit;">を使用して</font><font style="vertical-align: inherit;">、必要な他の関数を簡単に作成できます。</font><font style="vertical-align: inherit;">基本的な</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip; </font><font style="vertical-align: inherit;">から始めます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음으로 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수를 </font><font style="vertical-align: inherit;">사용하여 </font><font style="vertical-align: inherit;">필요한 다른 함수를 쉽게 만들 수 있습니다. </font><font style="vertical-align: inherit;">우리는 기본 </font></font> <code>arrayEqual</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 시작할 것입니다 </font><font style="vertical-align: inherit;">&hellip;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Затем, используя нашу </font><font style="vertical-align: inherit;">функцию </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы можем легко создавать другие функции, которые могут нам понадобиться. </font><font style="vertical-align: inherit;">Начнем с элементарного </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接下来，使用</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数，我们可以轻松创建可能需要的其他函数。</font><font style="vertical-align: inherit;">我们将从基本</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开始</font><font style="vertical-align: inherit;">&hellip;&hellip;</font></font>

source: Notice that we also define <code>equal</code> as it's own function. This highlights the role of <code>arrayCompare</code> as a higher-order function to utilize our first order comparator in the context of another data type (Array).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que tambi&eacute;n definimos </font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como su propia funci&oacute;n. </font><font style="vertical-align: inherit;">Esto resalta el papel de </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como una funci&oacute;n de orden superior para utilizar nuestro comparador de primer orden en el contexto de otro tipo de datos (Array).</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は独自の関数である</font><font style="vertical-align: inherit;">ため、これも定義していることに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは、</font><font style="vertical-align: inherit;">別のデータ型（配列）のコンテキストで一次コンパレーターを利用する高次関数として</font><font style="vertical-align: inherit;">の</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の役割を強調</font><font style="vertical-align: inherit;">しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 또한 </font><font style="vertical-align: inherit;">자신의 기능 </font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정의 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">이는 </font><font style="vertical-align: inherit;">다른 데이터 유형 (배열)의 맥락에서 첫 번째 비교기를 활용하는 고차 함수로서 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 역할을 강조합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что мы также определяем </font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как его собственную функцию. </font><font style="vertical-align: inherit;">Это подчеркивает роль </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как функции более высокого порядка для использования нашего компаратора первого порядка в контексте другого типа данных (Array).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意，我们也将</font></font> <code>equal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">定义</font><font style="vertical-align: inherit;">为自己的函数。</font><font style="vertical-align: inherit;">这突出显示了</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为高阶函数</font><font style="vertical-align: inherit;">的作用，</font><font style="vertical-align: inherit;">以便在另一种数据类型（Array）的上下文中利用我们的一阶比较器。</font></font>

source: Now what if you have an array of objects or something ? Maybe you want to consider those arrays as "equal" if each object has the same <code>id</code> value &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Y qu&eacute; pasa si tienes una variedad de objetos o algo? </font><font style="vertical-align: inherit;">Tal vez desee considerar esas matrices como "iguales" si cada objeto tiene el mismo </font><font style="vertical-align: inherit;">valor de </font></font> <code>id</code> entificaci&oacute;n<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトの配列などがある場合はどうでしょうか？</font><font style="vertical-align: inherit;">各オブジェクトに同じ</font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値</font><font style="vertical-align: inherit;">がある場合、これらの配列を「等しい」と見なしたいと思うかもしれません</font><font style="vertical-align: inherit;">&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 객체 배열이나 무언가가 있다면 어떻게 될까요? </font><font style="vertical-align: inherit;">각 객체의 </font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값 </font><font style="vertical-align: inherit;">이 동일한 경우 해당 배열을 "같음"으로 간주 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">А что если у вас есть массив объектов или что-то еще? </font><font style="vertical-align: inherit;">Может быть, вы хотите считать эти массивы &laquo;равными&raquo;, если каждый объект имеет одинаковое </font><font style="vertical-align: inherit;">значение </font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，如果您有一系列对象或东西呢？</font><font style="vertical-align: inherit;">如果每个对象具有相同的</font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值，</font><font style="vertical-align: inherit;">也许您想将这些数组视为&ldquo;相等&rdquo; </font><font style="vertical-align: inherit;">&hellip;</font></font>

source: Object comparison (example)
es: Comparación de objetos (ejemplo)
ja: オブジェクトの比較(例
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 비교 (예)</font></font>
ru: Сравнение объектов (пример)
zh_cn: 物体比较(例)

source: On the same lines as JSON.encode is to use join().
es: En la misma línea que JSON.encode es usar join().
ja: JSON.encodeと同じ行にjoin()を使うことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.encode와 같은 줄에 join ()을 사용하는 것입니다.</font></font>
ru: В тех же строках,что и в JSON.encode,необходимо использовать функцию join().
zh_cn: 与JSON.encode相同的是使用join()。

source: Only problem is if you care about types which the last comparison tests. If you care about types, you will have to loop.
es: El único problema es si te preocupas por los tipos que la última comparación prueba.Si te preocupan los tipos,tendrás que hacer un bucle.
ja: 唯一の問題は、最後の比較テストでテストされる型を気にする場合です。型を気にするとループしなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막 비교 테스트 유형에 관심이있는 경우에만 문제가됩니다. </font><font style="vertical-align: inherit;">유형에 관심이 있다면 반복해야합니다.</font></font>
ru: Проблема только в том,если вас волнуют типы,которые проверяются последними сравнительными тестами.Если вас волнуют типы,вам придется зацикливаться.
zh_cn: 唯一的问题是,如果你关心的是上次比较测试的类型。如果你关心的是类型,那么你就必须要循环。

source: Or what if you wanted to do some other kind of kind of completely arbitrary comparison ? Maybe I want to know if each <code>x</code> is greater than each <code>y</code> &hellip;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;O qu&eacute; pasar&iacute;a si quisieras hacer alg&uacute;n otro tipo de comparaci&oacute;n completamente arbitraria? </font><font style="vertical-align: inherit;">Tal vez quiero saber si cada </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es mayor que cada </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、他の種類の完全に恣意的な比較を実行したい場合はどうなりますか？</font><font style="vertical-align: inherit;">多分私</font><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">各</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が各</font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも大きい</font><font style="vertical-align: inherit;">かどうか知りたいです</font><font style="vertical-align: inherit;">&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아니면 다른 종류의 완전히 임의적 인 비교를 원한다면 어떨까요? </font><font style="vertical-align: inherit;">각 </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 각 </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 큰지 </font><font style="vertical-align: inherit;">알고 싶습니다 </font><font style="vertical-align: inherit;">.&hellip;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или что, если вы хотите провести какое-то совершенно произвольное сравнение? </font><font style="vertical-align: inherit;">Может быть, я хочу знать, если каждый </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> больше, чем каждый </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，如果您想进行其他某种完全任意的比较，该怎么办？</font><font style="vertical-align: inherit;">也许我想知道每个</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否大于每个</font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;</font></font>

source: Please do note that you are no longer comparing the object but the string representation of the object. It may not be exactly what you want.
es: Tenga en cuenta que ya no está comparando el objeto sino la representación de la cadena del objeto.Puede que no sea exactamente lo que usted quiere.
ja: オブジェクトを比較しているのではなく、オブジェクトの文字列表現を比較していることに注意してください。正確にはご希望通りではないかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 이상 객체를 비교하지 않고 객체의 문자열 표현을 유의하십시오. </font><font style="vertical-align: inherit;">정확히 원하는 것이 아닐 수도 있습니다.</font></font>
ru: Обратите внимание,что вы сравниваете уже не объект,а строковое представление объекта.Это может быть не совсем то,что вы хотите.
zh_cn: 请注意,你所比较的不再是对象,而是对象的字符串表示。它可能不是你想要的那样。

source: Rr, in ECMAScript 6 / CoffeeScript / TypeScript with Arrow Functions:
es: Rr,en ECMAScript 6 CoffeeScript TypeScript con funciones de flecha:
ja: Rr,ECMAScript 6 CoffeeScript TypeScript with Arrow Functions で。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RMA, ECMAScript 6 / CoffeeScript / 화살표 기능이있는 TypeScript에서 :</font></font>
ru: Rr,в ECMAScript 6 CoffeeScript TypeScript со стрелочными функциями:
zh_cn: Rr,在ECMAScript 6 CoffeeScript TypeScript的箭头函数中。

source: Show code snippet
es: Mostrar fragmento de código
ja: コードスニペットを表示
ko: 코드 스 니펫 표시
ru: Показать фрагмент кода
zh_cn: 显示代码片段

source: Simple as that. <code>arrayEqual</code> can be defined with <code>arrayCompare</code> and a comparator function that compares <code>a</code> to <code>b</code> using <code>===</code> (for strict equality).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simple como eso. </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede definir con </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y una funci&oacute;n de comparador que compara </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (por igualdad estricta).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのような単純な。</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と、</font> <code>===</code> <font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">して</font> <code>b</code> <font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">b</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">比較</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンパレーター関数で</font><font style="vertical-align: inherit;">定義できます</font><font style="vertical-align: inherit;">（厳密に等しい場合）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇게 간단합니다. </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font> <code>===</code> <font style="vertical-align: inherit;"> (엄격한 동등성을 위해)를 </font><font style="vertical-align: inherit;">사용하여 </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">비교 </font><font style="vertical-align: inherit;">하는</font><font style="vertical-align: inherit;"> 비교기 함수 </font><font style="vertical-align: inherit;">로 정의 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто как тот. </font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно определить с помощью </font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и функции компаратора, которая сравнивает </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>b</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используя </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (для строгого равенства).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就那么简单。</font></font> <code>arrayEqual</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以与被定义</font></font> <code>arrayCompare</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和进行比较的比较功能</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">至</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（为全等）。</font></font>
