Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I think it's wrong to say a particular implementation is "The Right Way&trade;" if it's only "right" ("correct") in contrast to a "wrong" solution. Tom&aacute;&scaron;'s solution is a clear improvement over string-based array comparison, but that doesn't mean it's objectively "right". What is <em>right</em> anyway? Is it the fastest? Is it the most flexible? Is it the easiest to comprehend? Is it the quickest to debug? Does it use the least operations? Does it have any side effects? No one solution can have the best of all the things.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo que es incorrecto decir que una implementaci&oacute;n particular es "The Right Way &trade;" si solo es "correcta" ("correcta") en contraste con una soluci&oacute;n "incorrecta". La soluci&oacute;n de Tom&aacute;&scaron; es una mejora clara sobre la comparaci&oacute;n de matriz basada en cadenas, pero eso no significa que sea objetivamente "correcta". &iquest;Qu&eacute; es lo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">correcto de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> todos modos? &iquest;Es el m&aacute;s r&aacute;pido? &iquest;Es el m&aacute;s flexible? &iquest;Es lo m&aacute;s f&aacute;cil de comprender? &iquest;Es el m&aacute;s r&aacute;pido de depurar? &iquest;Utiliza las operaciones menos? &iquest;Tiene efectos secundarios? Ninguna soluci&oacute;n puede tener la mejor de todas las cosas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「間違った」ソリューションとは対照的に、「正しい」（「正しい」）だけである場合、特定の実装が「The Right Way&trade;」であると言うのは間違っていると思います。トマーシュのソリューションは、文字列ベースの配列比較よりも明らかに改善されていますが、それが客観的に「正しい」という意味ではありません。</font><font style="vertical-align: inherit;">とにかく</font><font style="vertical-align: inherit;">何が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正しい</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ですか？最速ですか？最も柔軟性がありますか？理解するのが最も簡単ですか？デバッグが最速ですか？最小限の操作を使用していますか？副作用はありますか？ 1つのソリューションがすべてのものの中で最高のものを持つことはできません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"올바르지 않은"솔루션과 달리 "올바른"( "올바른") 경우 특정 구현이 "The Right Way &trade;"라고 말하는 것이 잘못이라고 생각합니다. Tom&aacute;&scaron;의 솔루션은 문자열 기반 배열 비교에 비해 명백히 개선 된 것이지만 이것이 객관적으로 "옳다"는 것을 의미하지는 않습니다. 무엇 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">권리</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 어쨌든은? 가장 빠릅니까? 가장 유연합니까? 이해하기가 가장 쉬운가요? 디버깅하는 것이 가장 빠릅니까? 가장 적은 작업을 사용합니까? 부작용이 있습니까? 어떤 솔루션도 모든 것을 최대한 활용할 수는 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я думаю, что неправильно говорить, что конкретная реализация является &laquo;Правильным путем&raquo;, если она только &laquo;правильная&raquo; (&laquo;правильная&raquo;) в отличие от &laquo;неправильного&raquo; решения. Решение Томаша - явное улучшение по сравнению со сравнением массивов на основе строк, но это не значит, что оно объективно &laquo;правильно&raquo;. Что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">правильно в</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> любом случае? Это самый быстрый? Это самый гибкий? Это легче всего понять? Это самый быстрый для отладки? Использует ли он наименьшее количество операций? Есть ли у него побочные эффекты? Ни одно решение не может быть лучшим из всех.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为，如果某个实现只是&ldquo;正确的&rdquo;（&ldquo;正确的&rdquo;），而不是&ldquo;错误的&rdquo;解决方案，那么说一个特定的实现就是&ldquo;正确的方式&rdquo;是错误的。 Tom&aacute;&scaron;的解决方案是对基于字符串的数组比较的明显改进，但这并不意味着它客观上是&ldquo;正确的&rdquo;。</font><font style="vertical-align: inherit;">反正</font><font style="vertical-align: inherit;">什么是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的？是最快的吗？最灵活吗？这是最容易理解的吗？调试最快吗？它使用最少的操作吗？有副作用吗？没有一种解决方案可以拥有所有优点。</font></font>

source: I'd like to compare two arrays... ideally, <strong>efficiently</strong>. <strong>Nothing fancy</strong>, just true if they are identical, and false if not.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Me gustar&iacute;a comparar dos matrices ... idealmente, de manera </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">eficiente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nada elegante</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , solo cierto si son id&eacute;nticos y falso si no.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2つのアレイを比較したい...理想的には、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">効率的に</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特別なもの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><strong><font style="vertical-align: inherit;">何もありませ</font></strong><font style="vertical-align: inherit;">ん。それらが同一である場合は真、そうでない場合は偽です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 배열을 이상적으로 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">효율적</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 비교하고 싶습니다 </font><font style="vertical-align: inherit;">. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공상</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 없으며, 동일하면 사실이고 그렇지 않으면 거짓입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я хотел бы сравнить два массива ... в идеале, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эффективно</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ничего особенного</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , просто правда, если они идентичны, и ложь, если нет.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我想比较两个数组...理想地，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有效</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地比较</font><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">别无所求</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，如果相同则为true，否则为false。</font></font>

source: I'd like to compare two arrays... ideally, efficiently. Nothing fancy, just <code>true</code> if they are identical, and <code>false</code> if not. Not surprisingly, the comparison operator doesn't seem to work.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Me gustar&iacute;a comparar dos matrices ... idealmente, de manera eficiente. </font><font style="vertical-align: inherit;">Nada elegante, solo </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si son id&eacute;nticos y </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si no. </font><font style="vertical-align: inherit;">No es sorprendente que el operador de comparaci&oacute;n no parezca funcionar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2つのアレイを比較したい...理想的には、効率的に。</font><font style="vertical-align: inherit;">特別なことは何もありませ</font><font style="vertical-align: inherit;">ん。</font><font style="vertical-align: inherit;">それらが同一で</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合は</font><font style="vertical-align: inherit;">真</font><font style="vertical-align: inherit;">で、</font><font style="vertical-align: inherit;">そうでない場合は</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">当然のことながら、比較演算子は機能していないようです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 배열을 이상적으로 효율적으로 비교하고 싶습니다. </font><font style="vertical-align: inherit;">공상 </font><font style="vertical-align: inherit;">은 </font><font style="vertical-align: inherit;">없으며 </font><font style="vertical-align: inherit;">, 동일하면 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이고 </font><font style="vertical-align: inherit;">그렇지</font><font style="vertical-align: inherit;"> 않으면 </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">당연히 비교 연산자가 작동하지 않는 것 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я хотел бы сравнить два массива ... в идеале, эффективно. </font><font style="vertical-align: inherit;">Ничего особенного, просто </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если они идентичны, и </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если нет. </font><font style="vertical-align: inherit;">Не удивительно, что оператор сравнения не работает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我想比较两个数组...理想地，有效地比较。</font><font style="vertical-align: inherit;">没有幻想，</font><font style="vertical-align: inherit;">如果相同则为</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，否则为</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">毫不奇怪，比较运算符似乎不起作用。</font></font>

source: I've also written up a quick jsfiddle with the function and this example:
es: También he escrito un rápido jsfiddle con la función y este ejemplo:
ja: また、関数とこの例を使って簡単なjsfiddleを書いてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 함수 와이 예제를 사용하여 빠른 jsfiddle을 작성했습니다.</font></font>
ru: Я также написал быстрый jsfiddle с функцией и этот пример:
zh_cn: 我还写了一个快速的jsfiddle函数和这个例子。

source: I've stated above, that two object <strong>instances</strong> will never be equal, even if they contain same data at the moment:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He dicho anteriormente, que dos </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancias de</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> objetos </font><font style="vertical-align: inherit;">nunca ser&aacute;n iguales, incluso si contienen los mismos datos en este momento:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上で述べたように、2つのオブジェクト</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、たとえ現時点で同じデータが含まれていても、決して等しくなることはありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위에서 언급했듯이 두 개의 객체 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 동일한 데이터가 포함되어 있어도 동일하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я уже говорил выше, что два </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляра</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта </font><font style="vertical-align: inherit;">никогда не будут равны, даже если они на данный момент содержат одинаковые данные:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上面我已经说过，即使此时两个对象</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含相同的数据，它们也永远不会相等：</font></font>

source: If the order should remain the same, than it is just a loop, no sort is needed.
es: Si el orden debe seguir siendo el mismo,que es sólo un bucle,no se necesita ningún tipo.
ja: 順番が変わらない場合は、ただのループであり、ソートは必要ありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순서가 루프 인 것보다 동일하게 유지되어야하는 경우 정렬이 필요하지 않습니다.</font></font>
ru: Если ордер должен остаться прежним,а не просто петлей,то сортировка не нужна.
zh_cn: 如果顺序应该是不变的,那么它只是一个循环,不需要排序。

source: If they are two arrays of numbers or strings only, this is a quick one-line one
es: Si son dos matrices de números o cuerdas solamente,esta es una rápida de una línea
ja: それらが数字や文字列だけの2つの配列であれば、これは1行で簡単にできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들이 숫자 또는 문자열의 두 배열 만 있다면, 이것은 빠른 한 줄입니다</font></font>
ru: Если это два массива чисел или строк,то это быстрый однострочный.
zh_cn: 如果它们是两个数组或仅是字符串的数组,这是个快速的单行数组

source: If you are using a testing framework like <a href="http://mochajs.org/">Mocha</a> with the <a href="http://chaijs.com/">Chai</a> assertion library, you can use <a href="http://chaijs.com/api/bdd/#deep">deep</a> equality to compare arrays.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; utilizando un marco de prueba como </font></font><a href="http://mochajs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mocha</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con la </font><font style="vertical-align: inherit;">biblioteca de aserci&oacute;n </font></font><a href="http://chaijs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Chai</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede usar </font></font><a href="http://chaijs.com/api/bdd/#deep"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> igualdad </font><font style="vertical-align: inherit;">profunda</font><font style="vertical-align: inherit;"> para comparar matrices.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたのようなテストフレームワークを使用している場合は</font></font><a href="http://mochajs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モカ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="http://chaijs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チャイの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アサーション・ライブラリを、あなたは使用することができ</font></font><a href="http://chaijs.com/api/bdd/#deep"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、深い</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比較アレイへの平等を。</font></font>
ko: <font style="vertical-align: inherit;"><a href="http://chaijs.com/"><font style="vertical-align: inherit;">Chai</font></a><font style="vertical-align: inherit;"> 어설 션 라이브러리 </font><font style="vertical-align: inherit;">와 함께 </font></font><a href="http://mochajs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mocha</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font><font style="vertical-align: inherit;">같은 테스트 프레임 워크를 사용하는 경우 </font><font style="vertical-align: inherit;">배열을 비교하기 </font><font style="vertical-align: inherit;">위해 </font><a href="http://chaijs.com/api/bdd/#deep"><font style="vertical-align: inherit;">깊은</font></a><font style="vertical-align: inherit;"> 평등을 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете среду тестирования, такую ​​как </font></font><a href="http://mochajs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mocha,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font><font style="vertical-align: inherit;">библиотекой утверждений </font></font><a href="http://chaijs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Chai</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вы можете использовать </font></font><a href="http://chaijs.com/api/bdd/#deep"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">глубокое</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равенство для сравнения массивов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您正在使用</font><font style="vertical-align: inherit;">带有</font><a href="http://chaijs.com/"><font style="vertical-align: inherit;">Chai</font></a><font style="vertical-align: inherit;">断言库的</font></font><a href="http://mochajs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mocha</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样的测试框架</font><font style="vertical-align: inherit;">，则可以使用</font><a href="http://chaijs.com/api/bdd/#deep"><font style="vertical-align: inherit;">深度</font></a><font style="vertical-align: inherit;">相等来比较数组。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: If you want to compare also the equality of order:
es: Si quieres comparar también la igualdad de orden:
ja: 秩序の平等性も比較したいなら。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순서의 평등도 비교하려면 다음을 수행하십시오.</font></font>
ru: Если вы хотите сравнить также и равенство порядка:
zh_cn: 如果你想比较也是秩序的平等。

source: In my case compared arrays contain only numbers and strings. This function will show you if arrays contain same elements.
es: En mi caso,las matrices comparadas sólo contienen números y cadenas.Esta función le mostrará si los arreglos contienen los mismos elementos.
ja: 私の場合、比較された配列には数字と文字列しか含まれていません。この関数は、配列に同じ要素が含まれているかどうかを表示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필자의 경우 비교 배열에는 숫자와 문자열 만 포함됩니다. </font><font style="vertical-align: inherit;">이 함수는 배열에 동일한 요소가 포함되어 있는지 보여줍니다.</font></font>
ru: В моем случае сравниваемые массивы содержат только числа и строки.Эта функция покажет,содержат ли массивы одинаковые элементы.
zh_cn: 在我的例子中,比较数组只包含数字和字符串。这个函数将显示数组是否包含相同的元素。

source: In my opinion, the best kind of code doesn't even need comments, and this is no exception. There's so little happening here that you can understand the behaviour of this procedure with almost no effort at all. Sure, some of the ES6 syntax might seem foreign to you now, but that's only because ES6 is relatively new.
es: En mi opinión,el mejor tipo de código ni siquiera necesita comentarios,y esto no es una excepción.Hay tan poco que ocurra aquí que se puede entender el comportamiento de este procedimiento sin casi ningún esfuerzo.Claro,parte de la sintaxis del ES6 puede parecerte extraña ahora,pero eso es sólo porque el ES6 es relativamente nuevo.
ja: 私の考えでは、最高の種類のコードにはコメントすら必要ありませんし、これも例外ではありません。ここではほとんど何も起こっていないので、ほとんど何の努力もせずにこのプロシージャの振る舞いを理解することができます。確かに、ES6の構文の中には今では外国に見えるものもあるかもしれませんが、それはES6が比較的新しいからに他なりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 의견으로는, 가장 좋은 종류의 코드는 주석이 필요하지 않으며 예외는 아닙니다. 거의 아무런 노력 없이이 절차의 동작을 이해할 수 있도록 여기에는 거의 일어나지 않습니다. 물론, ES6 구문 중 일부는 현재 여러분에게 이질적으로 보이지만 ES6이 비교적 새롭기 때문입니다.</font></font>
ru: На мой взгляд,лучший вид кода даже не нуждается в комментариях,и это не исключение.Происходит так мало,что понять поведение этой процедуры можно практически без усилий.Конечно,часть синтаксиса ES6 может показаться вам сейчас чужой,но это только потому,что ES6 относительно новый.
zh_cn: 在我看来,最好的代码甚至不需要注释,这也不例外。这里发生的事情太少了,以至于你几乎不费吹灰之力就能理解这个过程的行为。当然,有些ES6的语法可能现在对你来说似乎很陌生,但这只是因为ES6是相对较新的。
