Repository: rueisnom/feedback
Catalog: xlf/78/37/45/6/7837456.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong><a href="https://stackoverflow.com/a/7837725/308645">while</a> (67%)</strong> by Tim Down
es: <strong><a href="https://stackoverflow.com/a/7837725/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mientras que</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (67%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por Tim Down</font></font>
ja: <strong><a href="https://stackoverflow.com/a/7837725/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">while</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（67％）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> by Tim Down</font></font>
ko: <strong><a href="https://stackoverflow.com/a/7837725/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (67 %)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 팀 아래로</font></font>
ru: <strong><a href="https://stackoverflow.com/a/7837725/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в то время как</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (67%)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Тимом Дауном</font></font>
zh_cn: <strong><a href="https://stackoverflow.com/a/7837725/308645"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（67％）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由Tim Down</font></font>

source: <strong>Note</strong> the examples below assumes the arrays are sorted, single-dimensional arrays. <code>.length</code> comparison has been removed for a common benchmark (add <code>a1.length === a2.length</code> to any of the suggestions and you will get a ~10% performance boost). Choose whatever solutions that works best for you knowing the speed and limitation of each.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> los ejemplos a continuaci&oacute;n asumen que las matrices son ordenadas, matrices unidimensionales. </font></font> <code>.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ha eliminado la comparaci&oacute;n de </font><font style="vertical-align: inherit;">longitud</font><font style="vertical-align: inherit;"> para un punto de referencia com&uacute;n (agregue </font></font> <code>a1.length === a2.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a cualquiera de las sugerencias y obtendr&aacute; un aumento de rendimiento de ~ 10%). </font><font style="vertical-align: inherit;">Elija las soluciones que funcionen mejor para usted conociendo la velocidad y la limitaci&oacute;n de cada una.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アレイは、単一次元アレイをソートすることを前提としてい以下の実施例を。</font></font> <code>.length</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比較が一般的なベンチマークから削除されました（</font></font> <code>a1.length === a2.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を提案に</font><font style="vertical-align: inherit;">追加すると、</font><font style="vertical-align: inherit;">パフォーマンスが最大</font><font style="vertical-align: inherit;"> 10％向上します）。</font><font style="vertical-align: inherit;">それぞれの速度と制限を把握しているため、最適なソリューションを選択してください。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열은 단일 차원 배열을 분류하는 것으로 가정 아래의 예. </font><font style="vertical-align: inherit;">공통 벤치 마크에 대한 </font></font> <code>.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 비교가 제거되었습니다 ( </font><font style="vertical-align: inherit;">모든 제안 </font><font style="vertical-align: inherit;">에 </font></font> <code>a1.length === a2.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">하면 성능이 ~ 10 % 향상됩니다). </font><font style="vertical-align: inherit;">각각의 속도와 한계를 아는 데 가장 적합한 솔루션을 선택하십시오.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в приведенных ниже примерах предполагается, что массивы - это отсортированные одномерные массивы. </font><font style="vertical-align: inherit;">Сравнение </font></font> <code>.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было удалено для общего теста (добавьте </font></font> <code>a1.length === a2.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к любому из предложений, и вы получите повышение производительности на ~ 10%). </font><font style="vertical-align: inherit;">Выберите любые решения, которые лучше всего подходят для вас, зная скорость и ограничения каждого из них.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，下面的示例假定数组是有序的一维数组。</font></font> <code>.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比较已删除为通用基准（将</font></font> <code>a1.length === a2.length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加</font><font style="vertical-align: inherit;">到任何建议中，您将获得〜10％的性能提升）。</font><font style="vertical-align: inherit;">了解每种解决方案的速度和局限性，选择最适合您的解决方案。</font></font>

source: <strong>Recursive</strong> &amp; works on <strong>NESTED</strong> arrays:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Recursivo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y funciona en </font><font style="vertical-align: inherit;">matrices </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">anidadas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">再帰的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ネストされた</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列で</font><font style="vertical-align: inherit;">動作し</font><font style="vertical-align: inherit;">ます：</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">재귀</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NESTED</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열에서 </font><font style="vertical-align: inherit;">작동 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рекурсивно</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; работает над </font><font style="vertical-align: inherit;">массивами </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NESTED</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">递归</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并适用于</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NESTED</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组：</font></font>

source: <strong>Your code will not handle the case appropriately when both arrays have same elements but not in same order.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Su c&oacute;digo no manejar&aacute; el caso adecuadamente cuando ambas matrices tengan los mismos elementos pero no en el mismo orden.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方の配列に同じ要素があるが同じ順序ではない場合、コードはケースを適切に処理しません。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 배열의 요소가 같지만 순서가 같지 않으면 코드가 대소 문자를 적절하게 처리하지 않습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ваш код не будет правильно обрабатывать случай, когда оба массива имеют одинаковые элементы, но не в одинаковом порядке.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当两个数组具有相同的元素但顺序不同时，您的代码将无法正确处理这种情况。</font></font></strong>

source: <sub>I believe that larger amounts of data should be always stored in arrays, not in objects. However if you use objects, they can be partially compared too.<br/> <strong>Here's how:</strong></sub>
es: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo que grandes cantidades de datos siempre deben almacenarse en matrices, no en objetos. </font><font style="vertical-align: inherit;">Sin embargo, si usa objetos, tambi&eacute;n se pueden comparar parcialmente. </font></font><br/> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">As&iacute; es c&oacute;mo:</font></font></strong></sub>
ja: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大量のデータは常にオブジェクトではなく配列に格納する必要があると思います。</font><font style="vertical-align: inherit;">ただし、オブジェクトを使用する場合は、部分的に比較することもできます。</font></font><br/> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法は次のとおりです。</font></font></strong></sub>
ko: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은 양의 데이터는 항상 객체가 아닌 배열에 저장해야한다고 생각합니다. </font><font style="vertical-align: inherit;">그러나 개체를 사용하면 부분적으로 비교할 수도 있습니다. </font></font><br/> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법은 다음과 같습니다.</font></font></strong></sub>
ru: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я считаю, что большие объемы данных всегда должны храниться в массивах, а не в объектах. </font><font style="vertical-align: inherit;">Однако, если вы используете объекты, их тоже можно частично сравнить. </font></font><br/> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот как:</font></font></strong></sub>
zh_cn: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为，应将大量数据始终存储在数组中，而不是对象中。</font><font style="vertical-align: inherit;">但是，如果使用对象，也可以部分比较它们。</font></font><br/> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就是这样：</font></font></strong></sub>

source: A simple approach:
es: Un enfoque simple:
ja: シンプルなアプローチ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 접근법 :</font></font>
ru: Простой подход:
zh_cn: 一个简单的方法。

source: Already some great answers.But i would like to share anther idea which has proven to be reliable in comparing arrays. We can compare two array using <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong>JSON.stringify ( )</strong></a> . It will create a string out the the array and thus compare two obtained strings from two array for equality
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ya hay algunas respuestas geniales, pero me gustar&iacute;a compartir otra idea que ha demostrado ser confiable para comparar matrices. </font><font style="vertical-align: inherit;">Podemos comparar dos matrices usando </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.stringify ()</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Crear&aacute; una cadena fuera de la matriz y, por lo tanto, comparar&aacute; dos cadenas obtenidas de dos matrices para igualdad</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すでにいくつかの素晴らしい答えがありますが、配列の比較で信頼できることが証明されている別のアイデアを共有したいと思います。</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.stringify（）</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して2つの配列を比較でき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">配列から文字列を作成するため、2つの配列から取得した2つの文字列が等しいかどうかを比較します</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 몇 가지 훌륭한 답변이 있지만 배열을 비교할 때 신뢰할 수있는 다른 아이디어를 공유하고 싶습니다. </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.stringify ()를</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 두 배열을 비교할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">배열에서 문자열을 만들고 두 배열에서 얻은 두 문자열을 동일한 지 비교합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Уже несколько хороших ответов. Но я хотел бы поделиться другой идеей, которая доказала свою надежность при сравнении массивов. </font><font style="vertical-align: inherit;">Мы можем сравнить два массива, используя </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.stringify ()</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он создаст строку из массива и, таким образом, сравнит две полученные строки из двух массивов на равенство.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已经有一些不错的答案了。但是我想分享另一种想法，该想法在比较数组中被证明是可靠的。</font><font style="vertical-align: inherit;">我们可以使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON.stringify（）</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比较两个数组</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">它将在数组中创建一个字符串，从而比较从两个数组中获得的两个字符串是否相等</font></font>

source: Another approach with very few code (using <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce">Array reduce</a> and <a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes">Array includes</a>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Otro enfoque con muy poco c&oacute;digo (usando </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array reduce</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array incluye</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードが非常に少ない別のアプローチ（</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array reduce</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font><a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array include</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드가 거의없는 또 다른 접근법 ( </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array reduce</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array contains 사용</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другой подход с очень небольшим количеством кода (используя </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array Reduce</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array включает</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很少代码的另一种方法（使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array reduce</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Global_Objects/Array/includes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array includes</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: Answering Dmitry Grinko's question: "Why did you use spread operator ( ... ) here - ...new Set ? It doesn't work"
es: Respondiendo a la pregunta de Dmitry Grinko:"¿Por qué usaste el operador de difusión(...)aquí-...nuevo Set? No funciona"
ja: Dmitry Grinkoさんの質問にお答えします。"なぜここでスプレッド演算子(...)を使用したのですか-...new Set?それは動作しません"
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dmitry Grinko의 질문에 대한 답변 : "왜 스프레드 연산자 (...)를 사용하셨습니까?-... 새 세트? 작동하지 않습니다."</font></font>
ru: Отвечая на вопрос Дмитрия Гринко:"Почему вы использовали оператор спреда(...)здесь-...новый набор ? Он не работает"
zh_cn: 回答Dmitry Grinko的问题。"为什么你在这里使用 spread operator (...)-...new Set? 它不起作用"

source: Arbitrary comparison (example)
es: Comparación arbitraria (ejemplo)
ja: 任意の比較(例
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임의 비교 (예)</font></font>
ru: Произвольное сравнение (пример)
zh_cn: 任意比较(例子)
