Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: MVP tends to be a very natural pattern for achieving separated presentation in Web Forms. The reason is that the View is always created first by the ASP.NET runtime. You can <a href="http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&amp;referringTitle=bundles">find out more about both variants</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVPは、Webフォームで個別のプレゼンテーションを実現するための非常に自然なパターンになる傾向があります。</font><font style="vertical-align: inherit;">その理由は、ASP.NETランタイムによって常に最初にビューが作成されるためです。</font></font><a href="http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&amp;referringTitle=bundles"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方の亜種について詳しく知る</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことができ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP는 Web Forms에서 분리 된 프리젠 테이션을 달성하는 데 매우 자연스러운 패턴 인 경향이 있습니다. </font><font style="vertical-align: inherit;">그 이유는 항상 ASP.NET 런타임에 의해 뷰가 먼저 생성되기 때문입니다. </font></font><a href="http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&amp;referringTitle=bundles"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 변종에 대한 자세한 내용을 확인할</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP имеет тенденцию быть очень естественной моделью для достижения отдельного представления в веб-формах. </font><font style="vertical-align: inherit;">Причина в том, что представление всегда сначала создается средой выполнения ASP.NET. </font><font style="vertical-align: inherit;">Вы можете </font></font><a href="http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&amp;referringTitle=bundles"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">узнать больше об обоих вариантах</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP往往是在Web窗体中实现独立表示的一种非常自然的模式。</font><font style="vertical-align: inherit;">原因是View总是首先由ASP.NET运行时创建。</font><font style="vertical-align: inherit;">您可以</font></font><a href="http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&amp;referringTitle=bundles"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到有关这两种变体的更多信息</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: MVP usually uses some sort of a binding framework, such as Microsoft WPF binding framework or various binding frameworks for HTML5 and Java.
ja: MVPは通常、MicrosoftのWPFバインディングフレームワークやHTML5やJavaの各種バインディングフレームワークなど、何らかのバインディングフレームワークを使用しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP는 일반적으로 Microsoft WPF 바인딩 프레임 워크 또는 HTML5 및 Java에 대한 다양한 바인딩 프레임 워크와 같은 일종의 바인딩 프레임 워크를 사용합니다.</font></font>
ru: MVP обычно использует какой-нибудь связующий фреймворк,например,Microsoft WPF связующий фреймворк или различные связующие фреймворки для HTML5 и Java.
zh_cn: MVP通常使用某种绑定框架,如Microsoft WPF绑定框架或HTML5和Java的各种绑定框架。

source: MVP: the view is in charge.
ja: MVP:ビューが担当しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP : 뷰가 담당합니다.</font></font>
ru: MVP:вид во главе.
zh_cn: MVP:景言说了算。

source: My experience tells me that moving a team from web forms to MVP and then from MVP to MVC is relatively easy; moving from web forms to MVC is more difficult.
ja: 私の経験では、チームをウェブフォームからMVPに移動し、MVPからMVCに移動するのは比較的簡単ですが、ウェブフォームからMVCに移動するのはもっと難しいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 경험에 따르면 팀을 웹 양식에서 MVP로 이동 한 다음 MVP에서 MVC로 이동하는 것은 상대적으로 쉽습니다. </font><font style="vertical-align: inherit;">웹 양식에서 MVC로 이동하는 것이 더 어렵습니다.</font></font>
ru: Мой опыт подсказывает мне,что перевести команду из веб-форм в MVP,а затем из MVP в MVC относительно просто;перейти из веб-форм в MVC сложнее.
zh_cn: 我的经验告诉我,把一个团队从web表单转到MVP,再从MVP转到MVC,相对来说比较容易;从web表单转到MVC,难度比较大。

source: My humble short view: MVP is for large scales, and MVC for tiny scales. With MVC, I sometime feel the V and the C may be seen a two sides of a single indivisible component rather directly bound to M, and one inevitably falls to this when going down‑to shorter scales, like UI controls and base widgets. At this level of granularity, MVP makes little sense. When one on the contrary go to larger scales, proper interface becomes more important, the same with unambiguous assignment of responsibilities, and here comes MVP.
ja: 謙虚な私の近景。MVP は大規模なスケールのためのものであり、MVC は微小なスケールのためのものである。MVCでは、VとCがMに直接結びついているというよりも、一つの不可分なコンポーネントの表裏一体に見えてしまうことがあり、UIコントロールやベースウィジェットのように、もっと小さなスケールに行くと、どうしてもこれに陥ってしまうのです。このレベルの粒度では、MVPはほとんど意味を持ちません。逆にスケールが大きくなると、適切なインターフェイスが重要になってきて、責任の所在を明確にすることと同じように、MVPの登場です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 소소한 짧은 견해 : MVP는 대규모 용이고 MVC는 소규모 용입니다. </font><font style="vertical-align: inherit;">MVC를 사용하면 언젠가 V와 C가 M에 직접 바인딩되지 않고 단일 불가분의 구성 요소의 양면을 볼 수 있으며 UI 컨트롤 및 기본 위젯과 같이 더 짧은 스케일로 내려갈 때 필연적 으로이 부분에 빠질 수 있습니다. </font><font style="vertical-align: inherit;">이 세분화 수준에서 MVP는 의미가 없습니다. </font><font style="vertical-align: inherit;">반대로 하나가 더 큰 규모로 갈 때, 책임을 할당하는 것과 동일하게 적절한 인터페이스가 더 중요 해지고 여기에 MVP가 있습니다.</font></font>
ru: Мой скромный короткий взгляд:MVP-для больших весов,а MVC-для крошечных.С MVC,я иногда чувствую,что V и C можно увидеть две стороны одного неделимого компонента довольно непосредственно связаны с M,и один неизбежно падает на это при переходе к более коротким масштабам,как управление пользовательским интерфейсом и базовые виджеты.На этом уровне детализации MVP имеет мало смысла.Когда один,напротив,переходит на большие масштабы,правильный интерфейс становится более важным,то же самое с однозначным распределением обязанностей,и вот приходит MVP.
zh_cn: 鄙人的短见。MVP是针对大尺度的,MVC是针对小尺度的。对于MVC,我有时会觉得V和C可能会被看作是一个不可分割的组件的两面,而不是直接和M绑定在一起,而当往下走到更小的尺度,比如UI控件和基础小部件,就不可避免地会落到这个层面。在这个级别的粒度上,MVP没有什么意义。相反,当一个人去到更大的规模时,适当的接口就会变得更加重要,同样的,不明确的责任分配也是如此,这时MVP就来了。

source: On the other hand, this scale rule of a thumb, may weight very little when the platform characteristics favours some kind of relations between the components, like with the web, where it seems to be easier to implement MVC, more than MVP.
ja: 一方で、このスケールの親指のルールは、プラットフォームの特性がコンポーネント間の関係のいくつかの種類を好む場合には、非常に小さな重みがあります、ウェブのように、MVPよりもMVCを実装する方が簡単なようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 한편으로, 엄지 손가락의이 척도 규칙은 플랫폼 특성이 웹과 같이 구성 요소들 사이에서 MVP보다 MVC를 구현하는 것이 더 쉬운 것처럼 보이는 구성 요소들간에 어떤 종류의 관계를 선호 할 때 가중치가 거의 없을 수 있습니다.</font></font>
ru: С другой стороны,это эмпирическое правило шкалы,может очень мало весить,когда характеристики платформы благоприятствуют неким отношениям между компонентами,например,с сетью,где,кажется,легче реализовать MVC,чем MVP.
zh_cn: 另一方面,这种规模化的经验法则,当平台特性偏向于组件之间的某种关系时,可能权重会非常小,就像web一样,在这里似乎更容易实现MVC,比MVP更容易。

source: One other big difference about MVC is that the View does not directly bind to the Model. The view simply renders, and is completely stateless. In implementations of MVC the View usually will not have any logic in the code behind. This is contrary to MVP where it is absolutely necessary because, if the View does not delegate to the Presenter, it will never get called.
ja: MVCのもう一つの大きな違いは、ビューがモデルに直接バインドしないことです。ビューは単にレンダリングするだけで、完全にステートレスです。MVC の実装では、通常、ビューはコードの後ろにロジックを持ちません。これは MVP とは対照的に、ビューがプレゼンターに委譲しなければ呼び出されることがないため、絶対に必要なのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC의 또 다른 큰 차이점은 뷰가 모델에 직접 바인딩되지 않는다는 것입니다. </font><font style="vertical-align: inherit;">뷰는 단순히 렌더링되며 완전히 상태 비 저장입니다. </font><font style="vertical-align: inherit;">MVC의 구현에서 View는 일반적으로 코드 뒤에 로직이 없습니다. </font><font style="vertical-align: inherit;">보기가 발표자에게 위임되지 않으면 절대로 호출되지 않기 때문에 절대적으로 필요한 MVP와 반대입니다.</font></font>
ru: Еще одно большое отличие MVC в том,что View не привязывается напрямую к Модели.Вид просто визуализирует,и является полностью апатридом.В реализациях MVC View обычно не имеет никакой логики в коде.Это противоречит MVP,где это абсолютно необходимо,потому что,если Вид не делегируется ведущему,он никогда не будет вызван.
zh_cn: 关于MVC还有一个很大的区别,就是View并不直接绑定到Model。视图只是简单地进行渲染,并且是完全无状态的。在MVC的实现中,View通常在后面的代码中不会有任何逻辑。这与MVP相反,MVP是绝对必要的,因为如果View不委托给Presenter,它永远不会被调用。

source: One other pattern to look at is the <strong>Presentation Model</strong> pattern. In this pattern there is no Presenter. Instead the View binds directly to a Presentation Model. The Presentation Model is a Model crafted specifically for the View. This means this Model can expose properties that one would never put on a domain model as it would be a violation of separation-of-concerns. In this case, the Presentation Model binds to the domain model, and may subscribe to events coming from that Model. The View then subscribes to events coming from the Presentation Model and updates itself accordingly. The Presentation Model can expose commands which the view uses for invoking actions. The advantage of this approach is that you can essentially remove the code-behind altogether as the PM completely encapsulates all of the behaviour for the view. This pattern is a very strong candidate for use in WPF applications and is also called <a href="http://msdn.microsoft.com/en-us/magazine/dd419663.aspx">Model-View-ViewModel</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もう1つの注目すべきパターンは、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンテーションモデルです。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パターン。このパターンでは、プレゼンターは存在しません。代わりに、ビューはプレゼンテーションモデルに直接バインドします。プレゼンテーションモデルは、ビュー専用に作成されたモデルです。つまり、このモデルは、関心の分離に違反することになるため、ドメインモデルに配置することのないプロパティを公開できるということです。この場合、プレゼンテーションモデルはドメインモデルにバインドし、そのモデルからのイベントにサブスクライブする場合があります。次に、ビューはプレゼンテーションモデルからのイベントをサブスクライブし、それに応じて自身を更新します。プレゼンテーションモデルは、ビューがアクションの呼び出しに使用するコマンドを公開できます。このアプローチの利点は、PMがビューのすべての動作を完全にカプセル化するため、コードビハインドを本質的に完全に削除できることです。このパターンは、WPFアプリケーションで使用する非常に強力な候補であり、</font></font><a href="http://msdn.microsoft.com/en-us/magazine/dd419663.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">살펴볼 또 다른 패턴은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프레젠테이션 모델입니다.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">무늬. 이 패턴에는 발표자가 없습니다. 대신보기가 프레젠테이션 모델에 직접 바인딩됩니다. 프레젠테이션 모델은보기 전용으로 만들어진 모델입니다. 즉,이 모델은 도메인 분리에 대한 속성을 노출 할 수 있습니다. 이는 도메인 분리를 위반할 수 있기 때문입니다. 이 경우 프레젠테이션 모델은 도메인 모델에 바인딩되며 해당 모델에서 오는 이벤트를 구독 할 수 있습니다. 그런 다음보기는 프리젠 테이션 모델에서 오는 이벤트를 구독하고 그에 따라 자체적으로 업데이트됩니다. 프리젠 테이션 모델은 뷰가 조치 호출에 사용하는 명령을 노출 할 수 있습니다. 이 접근 방식의 장점은 PM이 뷰의 모든 동작을 완전히 캡슐화하므로 코드 숨김을 근본적으로 제거 할 수 있다는 것입니다.이 패턴은 WPF 응용 프로그램에서 사용할 수있는 매우 강력한 후보이며</font></font><a href="http://msdn.microsoft.com/en-us/magazine/dd419663.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Еще один шаблон, на который стоит обратить внимание, - это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель представления.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">шаблон. В этом шаблоне нет предъявителя. Вместо этого представление напрямую связывается с моделью представления. Модель презентации - это модель, созданная специально для просмотра. Это означает, что эта Модель может раскрывать свойства, которые никогда не наденут на модель предметной области, поскольку это будет нарушением разделения интересов. В этом случае модель представления связывается с моделью предметной области и может подписываться на события, поступающие из этой модели. Затем представление подписывается на события, поступающие из модели презентации, и обновляется соответствующим образом. Модель представления может предоставлять команды, которые представление использует для вызова действий. Преимущество этого подхода состоит в том, что вы можете по существу полностью удалить выделенный код, поскольку PM полностью инкапсулирует все поведение представления.Этот шаблон является очень сильным кандидатом для использования в приложениях WPF и также называется</font></font><a href="http://msdn.microsoft.com/en-us/magazine/dd419663.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель-Вид-ВидМодель</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一个要看的模式是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示模型</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">图案。在这种模式下，没有演示者。相反，视图直接绑定到演示模型。 Presentation Model是专门为View设计的模型。这意味着该模型可以公开一个永远不会放在域模型上的属性，因为这将违反关注点分离。在这种情况下，表示模型绑定到域模型，并且可以订阅来自该模型的事件。然后，View订阅来自Presentation Model的事件并相应地更新自身。 Presentation Model可以公开视图用于调用动作的命令。这种方法的优点是，由于PM完全封装了视图的所有行为，因此您基本上可以完全删除后面的代码。此模式非常适合在WPF应用程序中使用，也称为</font></font><a href="http://msdn.microsoft.com/en-us/magazine/dd419663.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型-视图-视图模型</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Presentation Model
ja: プレゼンテーションモデル
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프리젠 테이션 모델</font></font>
ru: Презентационная модель
zh_cn: 展示模式

source: Pro: by leveraging databinding the amount of code is reduced.
ja: プロ:データバインディングを活用することで、コードの量を減らすことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">장점 : 데이터 바인딩을 활용하면 코드 양이 줄어 듭니다.</font></font>
ru: Pro:за счет использования базы данных уменьшается количество кода.
zh_cn: Pro:通过利用数据库绑定,减少了代码量。

source: Pro: maximum testability surface; clean separation of the View and Model
ja: プロ:最大のテスト可能なサーフェス、ビューとモデルのクリーンな分離
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">장점 : 최대 시험 성 표면; </font><font style="vertical-align: inherit;">뷰와 모델의 깔끔한 분리</font></font>
ru: Pro:максимальная поверхность испытания;чистое разделение вида и модели.
zh_cn: 优点:最大限度的可测试面;视图和模型的干净分离。

source: So, if for example, the model is a car, then the presenter is some sort of a car presenter, exposes the car properties (year, maker, seats, etc.) to the view. The view knows that the text field called 'car maker' needs to display the presenter Maker property.
ja: つまり、例えばモデルが車であれば、プレゼンターが車のプロパティ(年式、メーカー、シートなど)をビューに公開します。ビューは、'car maker'というテキストフィールドにプレゼンターのMakerプロパティを表示する必要があることを知っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 모델이 자동차 인 경우 발표자는 일종의 자동차 발표자이며 자동차 속성 (연도, 제작자, 좌석 등)을보기에 노출합니다. </font><font style="vertical-align: inherit;">뷰에는 'car maker'라는 텍스트 필드에 발표자 메이커 속성이 표시되어야합니다.</font></font>
ru: Так,если,к примеру,модель автомобиля,то ведущий-это некий ведущий,выставляющий на обозрение свойства автомобиля (год выпуска,производитель,сиденья и т.д.).Вид знает,что текстовое поле под названием "автопроизводитель" должно отображать свойства ведущего Maker.
zh_cn: 所以,比如说,如果模型是一辆汽车,那么presenter是某种汽车的presenter,将汽车的属性(年份、制造商、座位等)暴露给视图。视图知道,名为 "汽车制造商 "的文本字段需要显示presenter Maker属性。

source: Some people keep forgetting, that MVC <a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#History">was created in the late 70"</a>, and that the Web was only created in late 80"/early 90". MVC wasn't originally created for the Web, but for Desktop applications instead, where the Controller, Model and View would co-exist together.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一部の人々は、MVC </font></font><a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#History"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が70 "後半に作成された</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こと、およびWebが80"後半/ 90 "初めにのみ作成された</font><font style="vertical-align: inherit;">ことを忘れがち</font><font style="vertical-align: inherit;">です。MVCは元々Web用に作成されたのではなく、デスクトップアプリケーション用に作成されました。 、モデルとビューは共存します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 사람들은 MVC </font></font><a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#History"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가 70 인치 후반에 만들어졌으며</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 웹이 80 인치 후반 </font><font style="vertical-align: inherit;">에 생성 된</font><font style="vertical-align: inherit;"> 것임을 잊어 버렸 </font><font style="vertical-align: inherit;">습니다. MVC는 원래 웹용이 아니라 데스크탑 응용 프로그램 용으로 만들어졌습니다. , 모델과 뷰가 함께 공존합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Некоторые люди постоянно забывают, что MVC </font></font><a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#History"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">был создан в конце 70 "</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и что Интернет был создан только в конце 80" / начале 90 ". MVC изначально создавался не для Интернета, а для настольных приложений, где контроллер Модель и Вид будут сосуществовать вместе.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有些人忘了，MVC </font></font><a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#History"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是在70年代后期创建的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而Web只在80英寸/ 90年代初创建的。MVC最初不是为Web创建的，而是为桌面应用程序创建的，而Controller是，模型和视图将并存。</font></font>
