Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <em>Controller</em>: Thanks for waiting <em>View</em>, I have asked <em>Model</em> about your search query. It says it has found a list of matching results and stored them in a variable named "searchResultsList" inside its instance. You can get it from there. Also please hide the progress bar now [<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を待ってくれてありがとう</font><font style="vertical-align: inherit;">、私は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Modelに</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">検索クエリについて</font><font style="vertical-align: inherit;">尋ねました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">一致する結果のリストが見つかり、インスタンス内の「searchResultsList」という名前の変数に保存されたと述べています。</font><font style="vertical-align: inherit;">そこから入手できます。</font><font style="vertical-align: inherit;">また、進行状況バーを非表示にしてください[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 감사 대기에 대한 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기를</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 나는 물었다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 검색 쿼리에 대해. </font><font style="vertical-align: inherit;">일치하는 결과 목록을 찾아서 인스턴스 내부의 "searchResultsList"라는 변수에 저장했다고합니다. </font><font style="vertical-align: inherit;">거기에서 얻을 수 있습니다. </font><font style="vertical-align: inherit;">또한 진행률 표시 줄을 숨기십시오 [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Спасибо за ожидание </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">просмотра</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я спросил </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> о вашем поисковом запросе. </font><font style="vertical-align: inherit;">Он говорит, что нашел список совпадающих результатов и сохранил их в переменной с именем "searchResultsList" внутри своего экземпляра. </font><font style="vertical-align: inherit;">Вы можете получить это оттуда. </font><font style="vertical-align: inherit;">Также, пожалуйста, скройте индикатор прогресса сейчас [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：感谢您等待</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我已经询问</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关您的搜索查询。</font><font style="vertical-align: inherit;">它说已经找到了匹配结果的列表，并将它们存储在其实例内部名为&ldquo; searchResultsList&rdquo;的变量中。</font><font style="vertical-align: inherit;">您可以从那里得到它。</font><font style="vertical-align: inherit;">还请现在隐藏进度条[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Model</em>: Hey <em>Presenter</em>|<em>Controller</em>, let me check &hellip; [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：Hey </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、確認させて&hellip;[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Hey </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 점검하겠습니다&hellip; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Эй, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , дай мне проверить&hellip; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模特</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：嘿</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，让我检查一下... [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Model</em>: I found a list for you, <em>Presenter</em>, here it is in JSON &ldquo;[{"name":"Piano Teacher","year":2001},{"name":"Piano","year":1993}]&rdquo; [<strong>MVP</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：私はあなたのためのリストを見つけました。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ここではJSON "[{" name "：" Piano Teacher "、" year "：2001}、{" name "：" Piano "、" year "：1993}です。 ]」[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 목록을 찾았습니다 </font><font style="vertical-align: inherit;">. 여기는 JSON "[{"name ":"Piano Teacher ","year ": 2001}, {"name ":"Piano ","year ": 1993}에 있습니다. ]&rdquo;[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Я нашел для вас список, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вот он в формате JSON &laquo;[{" name ":" Piano Teacher "," year ": 2001}, {" name ":" Piano "," year ": 1993} ] &raquo;[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模特</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：我为您找到了一个</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示者Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列表</font><font style="vertical-align: inherit;">，它在JSON中[&ldquo; {{&rdquo; name&ldquo;：&rdquo; Piano Teacher&ldquo;，&rdquo; year&ldquo;：2001}，{&rdquo; name&ldquo;：&rdquo; Piano&ldquo;，&rdquo; year&ldquo;：1993} ]&rdquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Model</em>: There is some result available, <em>Controller</em>. I have created a field variable in my instance and filled it with the result. It's name is "searchResultsList" [<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：利用可能な結果がいくつかあります、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">インスタンスにフィールド変数を作成し、結果を入力しました。</font><font style="vertical-align: inherit;">名前は "searchResultsList" [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]です。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 사용 가능한 결과가 있습니다 ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">인스턴스에서 필드 변수를 만들고 결과로 채웠습니다. </font><font style="vertical-align: inherit;">이름은 "searchResultsList"입니다. [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : есть некоторый результат, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Я создал переменную поля в моем экземпляре и заполнил ее результатом. </font><font style="vertical-align: inherit;">Это имя "searchResultsList" [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">型号</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：有一些结果可用，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我在实例中创建了一个字段变量，并用结果填充了它。</font><font style="vertical-align: inherit;">它的名称是&ldquo; searchResultsList&rdquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Presenter</em>: Thanks <em>View</em>,&hellip; meanwhile I&rsquo;m looking up the search term on the <em>Model</em>, please show him/her a progress bar [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：おかげで</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビュー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、&hellip;その間、私は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">検索語を調べていますが</font><font style="vertical-align: inherit;">、プログレスバーを見せてください[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 감사합니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 검색어를 찾는 </font><font style="vertical-align: inherit;">중 진행률 표시 줄을 표시하십시오 [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Докладчик</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Спасибо, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ... пока я ищу поисковый запрос по </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модели</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , пожалуйста, покажите ему / ей индикатор выполнения [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：感谢</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，&hellip;同时我正在查找</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上的搜索字词</font><font style="vertical-align: inherit;">，请向他/她显示进度条[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
