Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Controller is the initiator and it decides which view to render.
ja: コントローラはイニシエータであり、どのビューをレンダリングするかを決定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller는 초 기자이며 렌더링 할보기를 결정합니다.</font></font>
ru: Контроллер является инициатором и решает,какой вид визуализировать.
zh_cn: 控制器是发起者,它决定了要呈现的视图。

source: Decision on how to choose one of them IMHO should be based on how much time one invested in ASP NET web form type of web development. If one would consider himself good in web forms, I would suggest MVP. If one would feel not so comfortable in things such as page life cycle etc MVC could be a way to go here.
ja: IMHOはそれらのいずれかを選択する方法を決定するには、ウェブ開発のASP NETウェブフォームタイプにどれだけの時間を投資したかに基づいている必要があります。もしウェブフォームが得意だと思うなら、MVPをお勧めします。ページのライフサイクルなどのようなものはあまり快適ではないと感じるのであれば、MVCはここに行くための方法かもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그들 중 하나를 선택하는 방법에 대한 결정 IMHO는 ASP NET 웹 양식 유형의 웹 개발에 얼마나 많은 시간을 투자했는지에 근거해야합니다. </font><font style="vertical-align: inherit;">웹 양식에 능숙하다고 생각되면 MVP를 추천합니다. </font><font style="vertical-align: inherit;">페이지 수명주기 등과 같은 것들에서 너무 편안하지 않다면 MVC가 여기에 갈 수있는 방법 일 수 있습니다.</font></font>
ru: Решение о выборе одного из них IMHO должно быть основано на количестве времени,вложенного в веб-форму ASP NET типа веб-разработки.Если бы человек считал себя хорошим в веб-формах,я бы предложил MVP.Если вы чувствуете себя не очень комфортно в таких вещах,как жизненный цикл страницы и т.д.,то MVC может стать для вас подходящим вариантом.
zh_cn: 如何选择其中一个,IMHO应该根据一个人在ASP.NET web form类型的web开发中投入了多少时间来决定。如果一个人认为自己在web表单方面很擅长,我会建议选择MVP。如果一个人觉得自己在页面生命周期等方面不那么自如,那么MVC可能是一个不错的选择。

source: Easier to unit test because interaction with the view is through an interface
ja: ビューとのインタラクションがインターフェイスを介して行われるため、ユニットテストが容易になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">뷰와의 상호 작용이 인터페이스를 통해 이루어지기 때문에 단위 테스트가 더 쉬움</font></font>
ru: Проще в модульном тестировании,потому что взаимодействие с видом осуществляется через интерфейс.
zh_cn: 更容易进行单元测试,因为与视图的交互是通过接口进行的。

source: For more <a href="http://geekswithblogs.net/dlussier/archive/2009/11/21/136454.aspx">Reference</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">より多くのための</font></font><a href="http://geekswithblogs.net/dlussier/archive/2009/11/21/136454.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リファレンス</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 </font></font><a href="http://geekswithblogs.net/dlussier/archive/2009/11/21/136454.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для получения дополнительной </font></font><a href="http://geekswithblogs.net/dlussier/archive/2009/11/21/136454.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ссылки</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更多</font></font><a href="http://geekswithblogs.net/dlussier/archive/2009/11/21/136454.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参考</font></font></a>

source: Having said that, ASP.NET MVC is by these definitions an MVP framework because the Controller accesses the Model to populate the View which is meant to have no logic (just displays the variables provided by the Controller).
ja: とはいえ、ASP.NET MVCはこれらの定義からするとMVPフレームワークです。なぜなら、コントローラがモデルにアクセスしてロジックを持たない(コントローラが提供する変数を表示するだけの)ビューを表示するからです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 ASP.NET MVC는 이러한 정의에 따라 컨트롤러가 모델에 액세스하여 로직을 갖지 않는 뷰를 채 웁니다 (컨트롤러가 제공 한 변수 만 표시).</font></font>
ru: Сказав это,ASP.NET MVC по этим определениям является MVP фреймворком,потому что Контроллер обращается к Модели,чтобы заполнить представление,которое не имеет логики (просто отображает переменные,предоставленные Контроллером).
zh_cn: 话虽如此,ASP.NET MVC按照这些定义是一个MVP框架,因为Controller访问Model来填充View,而View是没有逻辑的(只是显示Controller提供的变量)。

source: Here are illustrations which represent communication flow
ja: 通信の流れを表現したイラストです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 통신 흐름을 나타내는 그림입니다</font></font>
ru: Ниже приведены иллюстрации,представляющие коммуникационный поток
zh_cn: 以下是代表通信流程的插图

source: Here are the key differences between the patterns:
ja: ここでは、そのパターンの主な違いをご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패턴 간의 주요 차이점은 다음과 같습니다.</font></font>
ru: Вот основные различия между шаблонами:
zh_cn: 以下是这两种模式的主要区别。

source: Here's yet another blog post link giving a little bit more details on this topic
ja: ここでは、まだ別のブログ記事のリンクは、このトピックについてのもう少し詳細を与える
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 주제에 대해 좀 더 자세한 내용을 제공하는 또 다른 블로그 게시물 링크가 있습니다.</font></font>
ru: Вот еще одна ссылка на пост в блоге,дающая немного больше подробностей по этой теме.
zh_cn: 这里是另一篇博文的链接,给大家介绍一下这个话题的细节。

source: How are they different?
ja: どう違うの?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 어떻게 다릅니 까?</font></font>
ru: Чем они отличаются?
zh_cn: 他们有什么不同?

source: How are they similar?
ja: どうやって似てるの?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 어떻게 비슷합니까?</font></font>
ru: Как они похожи?
zh_cn: 他们有什么相似之处?

source: I blogged about this a while back, quoting on <a href="http://blogs.infragistics.com/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx">Todd Snyder's excellent post on the difference between the two</a>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はこれについてしばらく前にブログに</font></font><a href="http://blogs.infragistics.com/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">投稿し、2つの違い</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に関する</font><font style="vertical-align: inherit;">Todd Snyderの優れた投稿を</font><font style="vertical-align: inherit;">引用してい</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것에 대해 얼마 전에 블로그를 작성하여 </font></font><a href="http://blogs.infragistics.com/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Todd Snyder의 두 게시물의 차이점에 대한 훌륭한 게시물을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인용했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Некоторое время назад я писал об этом, цитируя </font></font><a href="http://blogs.infragistics.com/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">превосходный пост Тодда Снайдера о разнице между ними</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不久前，我写了一篇有关这方面的博文，并引用了</font></font><a href="http://blogs.infragistics.com/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">托德&middot;斯奈德（Todd Snyder）的出色文章，介绍了两者之间的区别</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: I find it unfortunate that people are still preaching this as a pattern (View in charge) as opposed to an anti-pattern as it contradicts "It's just a view" (Pragmatic Programmer). "It's just a view" states that the final view shown to the user is a secondary concern of the application. Microsoft's MVP pattern renders re-use of Views much more difficult and <em>conveniently</em> excuses Microsoft's designer from encouraging bad practice.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「ただの見方だ」（プラグマティック・プログラマー）と矛盾するアンチパターンとは対照的に、人々がまだこれをパターン（担当の見方）として説教しているのは残念です。 「それは単なるビューです」とは、ユーザーに表示される最後のビューがアプリケーションの二次的な問題であることを示しています。 MicrosoftのMVPパターンは、ビューの再利用をはるかに困難にし、</font><font style="vertical-align: inherit;">Microsoftのデザイナーが悪い習慣を奨励する</font><font style="vertical-align: inherit;">ことを</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都合よく</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">許します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">불행히도 사람들은 "그저보기 일뿐"(Pragmatic Programmer)과 모순되기 때문에 반 패턴과는 반대로 패턴 (담당자)으로 이것을 설교하고 있다는 것은 불행한 일입니다. "그냥보기 일뿐입니다"는 사용자에게 표시되는 최종보기가 응용 프로그램의 두 번째 관심사임을 나타냅니다. Microsoft의 MVP 패턴은 뷰 재사용을 훨씬 더 어렵게 만들고 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편리하게</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Microsoft 디자이너가 잘못된 연습을 장려하지 못하게합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я сожалею, что люди все еще проповедуют это как шаблон (&laquo;Представление во главе&raquo;) в противоположность анти-шаблону, поскольку он противоречит &laquo;Это просто представление&raquo; (Pragmatic Programmer). &laquo;Это просто представление&raquo; гласит, что окончательное представление, отображаемое для пользователя, является второстепенной задачей приложения. Шаблон MVP от Microsoft значительно затрудняет повторное использование Views и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">удобно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> освобождает дизайнера Microsoft от поощрения плохой практики.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我发现不幸的是，人们仍然将其作为一种模式（负责视图）而不是反模式来进行讲道，因为它与&ldquo;这只是一个视图&rdquo;（实用程序员）相矛盾。 &ldquo;这只是一个视图&rdquo;指出向用户显示的最终视图是该应用程序的第二要务。微软的MVP模式使视图的重用变得更加困难，并且为</font><font style="vertical-align: inherit;">微软的设计师鼓励不良做法提供了</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">便利</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: I have also blogged about the Model-View-ViewModel pattern in the context of Silverlight over at <em><a href="http://jonas.follesoe.no/2008/07/19/youcard-re-visited-implementing-the-viewmodel-pattern">YouCard Re-visited: Implementing the ViewModel pattern</a></em>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、SilverlightのコンテキストでのModel-View-ViewModelパターンについて、YouCardでブログを</font></font><em><a href="http://jonas.follesoe.no/2008/07/19/youcard-re-visited-implementing-the-viewmodel-pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">再訪しました：Implementing the ViewModel pattern</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font></font><em><a href="http://jonas.follesoe.no/2008/07/19/youcard-re-visited-implementing-the-viewmodel-pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">YouCard Re-visited : ViewModel 패턴 구현</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 Silverlight와 관련하여 Model-View-ViewModel 패턴에 대해 블로그를 작성했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я также писал в блоге о модели Model-View-ViewModel в контексте Silverlight на </font></font><em><a href="http://jonas.follesoe.no/2008/07/19/youcard-re-visited-implementing-the-viewmodel-pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">YouCard. Повторное посещение: Реализация шаблона ViewModel</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我还在</font></font><em><a href="http://jonas.follesoe.no/2008/07/19/youcard-re-visited-implementing-the-viewmodel-pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重新访问YouCard时</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在Silverlight的上下文中写了有关Model-View-ViewModel模式的博客</font><em><font style="vertical-align: inherit;">：重新实现ViewModel模式</font></em><font style="vertical-align: inherit;">。</font></font>

source: I have used both MVP and MVC and although we as developers tend to focus on the technical differences of both patterns the point for MVP in IMHO is much more related to ease of adoption than anything else.
ja: 私はMVPとMVCの両方を使ったことがありますが、開発者としては両方のパターンの技術的な違いに注目する傾向がありますが、IMHOにおけるMVPのポイントは何よりも採用のしやすさに関係しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP와 MVC를 모두 사용했지만 개발자가 두 패턴의 기술적 차이점에 중점을 두는 경향이 있지만 IMHO의 MVP의 요점은 다른 것보다 채택의 용이성과 관련이 있습니다.</font></font>
ru: Я использовал и MVP,и MVC,и хотя мы,как разработчики,склонны сосредотачиваться на технических различиях обоих паттернов,точка зрения MVP в IMHO гораздо больше связана с простотой принятия,чем с чем-либо другим.
zh_cn: 我同时使用过MVP和MVC,虽然我们作为开发者往往会关注这两种模式的技术差异,但在IMHO中,MVP的要点更多的是与采用的难易程度有关。

source: I hope this helps better.
ja: これで少しでもお役に立てれば幸いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 더 도움이되기를 바랍니다.</font></font>
ru: Надеюсь,это поможет лучше.
zh_cn: 希望对你有更好的帮助。

source: I leave here a link to a series of articles a friend of mine has published about MVP and MVC.
ja: 私の友人がMVPとMVCについて公開している一連の記事へのリンクをここに残しておきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 내 친구가 MVP 및 MVC에 대해 게시 한 일련의 기사에 대한 링크가 있습니다.</font></font>
ru: Я оставляю здесь ссылку на серию статей,опубликованных моим другом о MVP и MVC.
zh_cn: 我在这里留下了我一个朋友发表的关于MVP和MVC的系列文章的链接。

source: I personally think MVP has only been recently re-introduced as a catchy term to either reduce arguments between semantic bigots who argue whether something is truly MVC or not or to justify Microsofts Rapid Application Development tools. Neither of these reasons in my books justify its existence as a separate design pattern.
ja: 個人的には、MVPがキャッチーな言葉として再導入されたのは、何かが本当にMVCかどうかを議論するセマンティックな偏屈者の間での議論を減らすためか、あるいはMicrosoftsのラピッドアプリケーション開発ツールを正当化するためかのどちらかだと思っています。私の本では、これらの理由のどちらも、MVPが別個のデザインパターンとして存在することを正当化するものではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필자는 개인적으로 MVP가 최근 MVC인지 아닌지를 주장하는 의미 론적 비고 사이의 논쟁을 줄이거 나 Microsoft의 신속한 응용 프로그램 개발 도구를 정당화하기 위해 최근에 다시 소개 된 것이라고 생각합니다. </font><font style="vertical-align: inherit;">내 책에서 이러한 이유 중 어느 것도 별도의 디자인 패턴으로 존재한다는 것을 정당화하지 못합니다.</font></font>
ru: Лично я думаю,что MVP только недавно был вновь введен как броский термин,чтобы либо уменьшить споры между семантическими фанатиками,которые спорят,действительно ли что-то MVC или нет,либо оправдать средства быстрой разработки приложений Microsofts Rapid.Ни одна из этих причин в моих книгах не оправдывает его существование в качестве отдельного шаблона проектирования.
zh_cn: 我个人认为,MVP只是最近才被重新引入,作为一个琅琅上口的名词,要么是为了减少语义偏激者之间的争论,因为他们争论某事是否是真正的MVC,要么是为了证明Microsofts Rapid Application Development工具的合理性。在我的书中,这两个理由都不足以证明它作为一个独立的设计模式存在。

source: I think the best resource I've found to UI architecture is the series of blog posts done by Jeremy Miller over at <a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/07/25/the-build-your-own-cab-series-table-of-contents.aspx">The Build Your Own CAB Series Table of Contents</a>. He covered all the flavors of MVP and showed C# code to implement them.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UIアーキテクチャで見つけた最高のリソースは、Jeremy Millerが</font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/07/25/the-build-your-own-cab-series-table-of-contents.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">The Build Your Own CAB Series Table of Contents</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で行った一連のブログ投稿</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">彼はMVPのすべてのフレーバーをカバーし、それらを実装するためのC＃コードを示しました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 아키텍처에서 찾은 최고의 리소스는 Jeremy Miller가 </font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/07/25/the-build-your-own-cab-series-table-of-contents.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">The Your Your Own CAB Series Table of Contents</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 수행 한 일련의 블로그 게시물이라고 생각합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그는 MVP의 모든 취향을 다루고 C # 코드를 구현하여 보여주었습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я думаю, что лучший ресурс, который я нашел в архитектуре пользовательского интерфейса, - это серия постов в блоге, сделанных Джереми Миллером на </font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/07/25/the-build-your-own-cab-series-table-of-contents.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оглавлении &laquo;Построй свою собственную серию CAB&raquo;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он рассмотрел все варианты MVP и показал код C # для их реализации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为，我发现有关UI体系结构的最佳资源是Jeremy Miller在</font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/07/25/the-build-your-own-cab-series-table-of-contents.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;构建自己的CAB系列目录&rdquo;中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">撰写的一系列博客文章</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">他介绍了MVP的所有方面，并展示了实现它们的C＃代码。</font></font>
