Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: There are many answers to the question, but I felt there is a need for some really simple answer clearly comparing the two. Here's the discussion I made up when a user searches for a movie name in an MVP and MVC app:
ja: この質問に対する回答はたくさんありますが、明確に比較した本当にシンプルな回答が必要だと感じました。ここでは、MVPとMVCアプリでユーザーがムービー名を検索したときの議論をまとめてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문에 대한 많은 답변이 있지만, 두 가지를 명확하게 비교하는 정말 간단한 답변이 필요하다고 느꼈습니다. </font><font style="vertical-align: inherit;">MVP 및 MVC 앱에서 사용자가 영화 이름을 검색 할 때 구성한 내용은 다음과 같습니다.</font></font>
ru: Ответов на вопрос много,но я почувствовал,что есть необходимость в действительно простом ответе,четко сравнивающем эти два.Вот дискуссия,которую я придумал,когда пользователь ищет название фильма в приложении MVP и MVC:
zh_cn: 这个问题的答案有很多,但我觉得需要一些真正简单的答案来清楚地对比一下这两者。下面是我在用户在MVP和MVC应用中搜索电影名称时,我做的讨论。

source: There are many versions of MVC, this answer is about the original MVC in Smalltalk. In brief, it is
ja: MVCには多くのバージョンがありますが、この回答はSmalltalkのオリジナルのMVCについてのものです。簡単に言うと
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC에는 여러 버전이 있으며이 답변은 Smalltalk의 원래 MVC에 대한 것입니다. </font><font style="vertical-align: inherit;">간단히 말해</font></font>
ru: Существует множество версий MVC,этот ответ касается оригинальной MVC в Smalltalk.Вкратце,это
zh_cn: MVC有很多版本,这个答案是关于Smalltalk中的MVC原版。简单来说,就是

source: There is <a href="https://www.youtube.com/watch?v=WpkDN78P884&amp;feature=youtu.be&amp;t=29m1s">this</a> nice video from Uncle Bob where he briefly explains <strong>MVC</strong> &amp; <strong>MVP</strong> at the end.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アンクルボブからの</font></font><a href="https://www.youtube.com/watch?v=WpkDN78P884&amp;feature=youtu.be&amp;t=29m1s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">素晴らしいビデオ</font><font style="vertical-align: inherit;">があり</font><font style="vertical-align: inherit;">、最後</font><font style="vertical-align: inherit;">に彼が</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について簡単に説明</font><font style="vertical-align: inherit;">しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 </font></font><a href="https://www.youtube.com/watch?v=WpkDN78P884&amp;feature=youtu.be&amp;t=29m1s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그가 간단히 설명 삼촌 밥에서 좋은 비디오 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP를</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 말은.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть </font></font><a href="https://www.youtube.com/watch?v=WpkDN78P884&amp;feature=youtu.be&amp;t=29m1s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> хорошее видео от дяди Боба, где он кратко объясняет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в конце.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有</font></font><a href="https://www.youtube.com/watch?v=WpkDN78P884&amp;feature=youtu.be&amp;t=29m1s"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这种</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从Bob大叔不错的视频，他简要介绍了</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">底。</font></font>

source: There is a <a href="http://msdn.microsoft.com/en-us/library/ff921080.aspx">MSDN article about the Presentation Model</a> and a section in the <a href="http://msdn.microsoft.com/en-us/library/cc707819.aspx">Composite Application Guidance for WPF</a> (former Prism) about <a href="http://msdn.microsoft.com/en-us/library/cc707862.aspx">Separated Presentation Patterns</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある</font></font><a href="http://msdn.microsoft.com/en-us/library/ff921080.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンテーションモデルについてのMSDNの記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">やセクション</font></font><a href="http://msdn.microsoft.com/en-us/library/cc707819.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">WPF用コンポジットアプリケーションのガイダンス</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について（旧プリズム）</font></font><a href="http://msdn.microsoft.com/en-us/library/cc707862.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分離プレゼンテーションパターンは、</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 </font></font><a href="http://msdn.microsoft.com/en-us/library/ff921080.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프리젠 테이션 모델에 대한 MSDN 문서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와의 섹션 </font></font><a href="http://msdn.microsoft.com/en-us/library/cc707819.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">WPF에 대한 복합 응용 프로그램 지침</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 (전 프리즘) </font></font><a href="http://msdn.microsoft.com/en-us/library/cc707862.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로 구분 된 프리젠 테이션 패턴</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><a href="http://msdn.microsoft.com/en-us/library/ff921080.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MSDN есть статья о модели представления</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и раздел в </font></font><a href="http://msdn.microsoft.com/en-us/library/cc707819.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Руководстве по составным приложениям для WPF</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (прежняя призма) об </font></font><a href="http://msdn.microsoft.com/en-us/library/cc707862.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">отдельных шаблонах представления.</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="http://msdn.microsoft.com/en-us/library/ff921080.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MSDN上</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有</font><font style="vertical-align: inherit;">关于表示模型的文章，在</font></font><a href="http://msdn.microsoft.com/en-us/library/cc707819.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">WPF</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（前棱镜）</font><font style="vertical-align: inherit;">的</font><font style="vertical-align: inherit;">复合应用指南中有</font><font style="vertical-align: inherit;">关于</font></font><a href="http://msdn.microsoft.com/en-us/library/cc707862.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">单独的表示模式的部分</font></font></a>

source: There is a discussion <a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/10/31/development-trivial-pursuit-the-difference-between-mvc-and-the-different-flavors-of-mvp.aspx">here</a> regarding the differences between MVC vs MVP.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVCとMVPの違いについて</font><font style="vertical-align: inherit;">は、</font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/10/31/development-trivial-pursuit-the-difference-between-mvc-and-the-different-flavors-of-mvp.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">議論があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC와 MVP의 차이점에 대한 </font><font style="vertical-align: inherit;">논의가 </font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/10/31/development-trivial-pursuit-the-difference-between-mvc-and-the-different-flavors-of-mvp.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует дискуссия </font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/10/31/development-trivial-pursuit-the-difference-between-mvc-and-the-different-flavors-of-mvp.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> о различиях между MVC против MVP.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有一个讨论，</font></font><a href="http://codebetter.com/blogs/jeremy.miller/archive/2007/10/31/development-trivial-pursuit-the-difference-between-mvc-and-the-different-flavors-of-mvp.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就VS MVP MVC之间的差异。</font></font>

source: There is also <a href="http://gexiaoguo.github.io/MVC,-MVP-and-MVVM/">a complete comparison of MVC, MVP and MVVM here</a>
ja: <font style="vertical-align: inherit;"><a href="http://gexiaoguo.github.io/MVC,-MVP-and-MVVM/"><font style="vertical-align: inherit;">MVC、MVP、MVVMの完全な比較</font></a><font style="vertical-align: inherit;">も</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここにあります</font></font>
ko: <font style="vertical-align: inherit;"><a href="http://gexiaoguo.github.io/MVC,-MVP-and-MVVM/"><font style="vertical-align: inherit;">MVC, MVP 및 MVVM에 대한 완벽한 비교</font></a><font style="vertical-align: inherit;"> 도 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь также </font></font><a href="http://gexiaoguo.github.io/MVC,-MVP-and-MVVM/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">есть полное сравнение MVC, MVP и MVVM.</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里也</font></font><a href="http://gexiaoguo.github.io/MVC,-MVP-and-MVVM/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有MVC，MVP和MVVM的完整比较</font></font></a>

source: They are fairly similar in concept, folks initialize the Presenter/Controller differently depending on taste.
ja: 概念的にはかなり似ていますが、PresenterController の初期化は好みによって異なります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 개념 상 상당히 유사하며, 사람들은 취향에 따라 발표자 / 컨트롤러를 다르게 초기화합니다.</font></font>
ru: Они довольно похожи по концепции,люди инициализируют PresenterController по-разному в зависимости от вкуса.
zh_cn: 它们在概念上相当相似,人们初始化PresenterController的方式根据口味不同而不同。

source: They each addresses different problems and can even be combined together to have something like below
ja: それぞれが異なる問題に対応しており、組み合わせて以下のようなものを持つこともできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 각각 다른 문제를 해결하고 아래처럼 만들 수 있습니다</font></font>
ru: Каждый из них решает различные проблемы и даже может быть объединен,чтобы иметь что-то вроде ниже.
zh_cn: 它们各自解决了不同的问题,甚至可以组合在一起,有下面这样的东西。

source: This binding framework, if you strip it down, it's actually the controller :-)
ja: このバインディングのフレームワークは、それを剥ぎ取ると、実際にはコントローラになります :-)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 바인딩 프레임 워크는 스트립하면 실제로 컨트롤러입니다 :-)</font></font>
ru: Этот связующий фреймворк,если его убрать,на самом деле это контроллер :-).
zh_cn: 这个绑定框架,如果你把它剥掉,其实就是控制器:-)

source: This is an oversimplification of the many variants of these design patterns, but this is how I like to think about the differences between the two.
ja: これは、これらのデザインパターンの多くの亜種を簡略化しすぎたものですが、私はこのように2つの違いを考えるのが好きです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 이러한 디자인 패턴의 많은 변형을 지나치게 단순화 한 것이지만 이것이 두 가지 차이점에 대해 생각하는 방식입니다.</font></font>
ru: Это является чрезмерным упрощением многих вариантов этих шаблонов дизайна,но именно так мне нравится думать о различиях между ними.
zh_cn: 这是对这些设计模式的众多变体的过度简化,但我喜欢这样思考两者之间的区别。

source: This talk <a href="https://www.youtube.com/watch?v=i1-7S-RxfvQ">droidcon NYC 2017 - Clean app design with Architecture Components</a> clarifies it
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このトーク</font></font><a href="https://www.youtube.com/watch?v=i1-7S-RxfvQ"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">droidcon NYC 2017-アーキテクチャコンポーネントを使用</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">した</font><font style="vertical-align: inherit;">クリーンなアプリデザインで</font><font style="vertical-align: inherit;">明らかに</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 이야기 </font></font><a href="https://www.youtube.com/watch?v=i1-7S-RxfvQ"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NYC 2017 droidcon - 클린 응용 프로그램 설계 아키텍처 구성 요소와 함께</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그것을 명확히</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот доклад </font></font><a href="https://www.youtube.com/watch?v=i1-7S-RxfvQ"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">droidcon NYC 2017 - Чистый дизайн приложения с помощью компонентов архитектуры</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разъясняет это</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇演讲</font></font><a href="https://www.youtube.com/watch?v=i1-7S-RxfvQ"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">droidcon NYC 2017-使用Architecture Components进行的干净应用程序设计</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">澄清了它</font></font>

source: To be perfectly frank, I think the underlying concerns of MVC hold true for any MVP implementation and the differences are almost entirely semantic. As long as you are following separation of concerns between the view (that displays the data), the controller (that initialises and controls user interaction) and the model (the underlying data and/or services)) then you are achieving the benefits of MVC. If you are achieving the benefits then who really cares whether your pattern is MVC, MVP or Supervising Controller? The only <em>real</em> pattern remains as MVC, the rest are just differing flavours of it.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">率直に言って、MVCの根本的な懸念はどのMVP実装にも当てはまり、その違いはほぼ完全にセマンティックです。ビュー（データを表示する）、コントローラー（ユーザーの操作を初期化および制御する）、およびモデル（基になるデータやサービス）の間の関心の分離に従っている限り、MVCの利点を達成できます。 。あなたが利益を達成しているなら、あなたのパターンがMVC、MVP、または監督コントローラーであるかどうかを本当に気にする人は誰ですか？唯一の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本当の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パターンはMVCのままですが、残りは単に異なるフレーバーです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">완벽하게 솔직히 말해서, MVC의 근본적인 관심사는 MVP 구현에 적용되며 그 차이는 거의 의미 론적이라고 생각합니다. 뷰 (데이터를 표시하는), 컨트롤러 (사용자 상호 작용을 초기화하고 제어하는 ​​컨트롤러) 및 모델 (기본 데이터 및 / 또는 서비스)간에 우려를 분리하는 한 MVC의 이점을 얻을 수 있습니다 . 당신이 이점을 달성하고 있다면 누가 당신의 패턴이 MVC, MVP 또는 Supervising Controller인지 정말 걱정합니까? 유일한 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패턴은 MVC로 남아 있으며 나머지는 그 맛이 다릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы быть совершенно откровенным, я думаю, что основные проблемы MVC справедливы для любой реализации MVP, и различия почти полностью семантические. Пока вы следите за разделением интересов между представлением (которое отображает данные), контроллером (который инициализирует и контролирует взаимодействие с пользователем) и моделью (базовые данные и / или службы)), вы получаете преимущества MVC , Если вы добиваетесь преимуществ, то кого действительно волнует, является ли ваш паттерн MVC, MVP или Supervising Controller? Единственный </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">реальный</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> образец остается как MVC, остальные - только различные ароматы этого.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">坦率地说，我认为MVC的根本问题对于任何MVP实现都是正确的，并且差异几乎完全是语义上的。只要您遵循视图（显示数据），控制器（初始化和控制用户交互）和模型（基础数据和/或服务）之间的关注点分离，那么您就可以实现MVC的好处。如果您正在获得收益，那么谁真正在乎您的模式是MVC，MVP还是监督控制器？唯一的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真实</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模式仍然是MVC，其余的只是它的不同风格。</font></font>

source: To make this a little more clear, let's imagine a simple shopping list app. All we want is a list of the name, quantity and price of each item we need to buy this week. Below we'll describe how we could implement some of this functionality using MVC.
ja: これをもう少しわかりやすくするために、簡単な買い物リストアプリを想像してみましょう。欲しいのは、今週買わなければならない商品の名前、数量、価格のリストです。以下では、MVCを使ってこの機能の一部を実装する方法を説明します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">좀 더 명확하게하기 위해 간단한 쇼핑 목록 앱을 상상해 봅시다. </font><font style="vertical-align: inherit;">우리가 원하는 것은 이번 주에 구매해야하는 각 품목의 이름, 수량 및 가격 목록입니다. </font><font style="vertical-align: inherit;">아래에서는 MVC를 사용하여이 기능 중 일부를 구현하는 방법에 대해 설명합니다.</font></font>
ru: Чтобы все прояснить,давайте представим себе простое приложение со списком покупок.Все,что нам нужно,это список с названием,количеством и ценой каждого товара,который мы должны купить на этой неделе.Ниже мы опишем,как мы могли бы реализовать часть этой функциональности с помощью MVC.
zh_cn: 为了让大家更清楚一点,让我们想象一个简单的购物清单APP。我们想要的是一个列表,里面有我们本周需要购买的每个商品的名称、数量和价格。下面我们将描述一下我们如何使用MVC来实现其中的一些功能。

source: To perhaps get an idea of the ASP.NET MVC distinction from MVP, check out <a href="http://www.hanselman.com/blog/ASPNETMVCSessionAtMix08TDDAndMvcMockHelpers.aspx">this MIX presentation</a> by Scott Hanselman.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ASP.NET MVCとMVPの違いを理解するには、</font><font style="vertical-align: inherit;">Scott Hanselmanによる</font></font><a href="http://www.hanselman.com/blog/ASPNETMVCSessionAtMix08TDDAndMvcMockHelpers.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このMIXプレゼンテーション</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をご覧ください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP와 ASP.NET MVC의 차이점에 대한 아이디어를 얻으려면 </font><font style="vertical-align: inherit;">Scott Hanselman의 </font></font><a href="http://www.hanselman.com/blog/ASPNETMVCSessionAtMix08TDDAndMvcMockHelpers.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MIX 프레젠테이션</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">확인하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы, возможно, получить представление об отличии ASP.NET MVC от MVP, посмотрите </font></font><a href="http://www.hanselman.com/blog/ASPNETMVCSessionAtMix08TDDAndMvcMockHelpers.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту презентацию MIX</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Скотта Хансельмана.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要想了解ASP.NET MVC与MVP的区别，请查看</font><font style="vertical-align: inherit;">Scott Hanselman的</font></font><a href="http://www.hanselman.com/blog/ASPNETMVCSessionAtMix08TDDAndMvcMockHelpers.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MIX演示</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Two primary variations
ja: 2つの主要なバリエーション
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 주요 변형</font></font>
ru: Два основных варианта
zh_cn: 两种主要变化

source: User: Click click &hellip;
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザー：クリッククリック&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 : 클릭&hellip;을 클릭하십시오</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пользователь: Нажмите, нажмите ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用户：单击单击&hellip;</font></font>
