Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: In the <strong>MVC</strong>, the Controller is responsible for determining which View to display in response to any action including when the application loads. This differs from MVP where actions route through the View to the Presenter. In MVC, every action in the View correlates with a call to a Controller along with an action. In the web each action involves a call to a URL on the other side of which there is a Controller who responds. Once that Controller has completed its processing, it will return the correct View. The sequence continues in that manner throughout the life of the application:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、コントローラは、ビューは、アプリケーションの負荷を含む任意のアクションに応じて表示するかを決定する責任があります。</font><font style="vertical-align: inherit;">これは、アクションがビューを介してプレゼンターにルーティングされるMVPとは異なります。</font><font style="vertical-align: inherit;">MVCでは、ビュー内のすべてのアクションは、アクションとともにコントローラーへの呼び出しと相関します。</font><font style="vertical-align: inherit;">Webでは、各アクションには、反対側のコントローラーが応答するURLへの呼び出しが含まれます。</font><font style="vertical-align: inherit;">コントローラーが処理を完了すると、正しいビューが返されます。</font><font style="vertical-align: inherit;">シーケンスは、アプリケーションの存続期間中、そのように続きます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 컨트롤러보기 응용 프로그램이로드 될 때를 포함하여 어떤 행동에 대한 응답으로 표시 할 결정하기위한 책임이 있습니다. 동작이보기를 통해 발표자로 라우팅되는 MVP와 다릅니다. MVC에서 View의 모든 작업은 작업에 대한 컨트롤러 호출과 관련이 있습니다. 웹에서 각 작업에는 상대방이 응답하는 컨트롤러가있는 URL에 대한 호출이 포함됩니다. 해당 컨트롤러가 처리를 완료하면 올바른보기를 반환합니다. 이 순서는 응용 프로그램 수명 동안 계속 유지됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> контроллер отвечает за определение того, какое представление отображать в ответ на любое действие, в том числе при загрузке приложения. </font><font style="vertical-align: inherit;">Это отличается от MVP, где действия направляются через представление к докладчику. </font><font style="vertical-align: inherit;">В MVC каждое действие в представлении соотносится с вызовом контроллера и действием. </font><font style="vertical-align: inherit;">В сети каждое действие включает в себя вызов URL-адреса, на другой стороне которого находится контроллер, который отвечает. </font><font style="vertical-align: inherit;">Как только этот Контроллер завершит свою обработку, он вернет правильный Вид. </font><font style="vertical-align: inherit;">Последовательность продолжается таким образом на протяжении всей жизни приложения:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，控制器负责确定响应于任何操作（包括应用程序何时加载）显示哪个视图。</font><font style="vertical-align: inherit;">这与MVP不同，在MVP中，操作通过视图路由到演示者。</font><font style="vertical-align: inherit;">在MVC中，视图中的每个动作都与对Controller的调用以及一个动作相关联。</font><font style="vertical-align: inherit;">在网络中，每个动作都涉及对URL的调用，在该URL的另一侧有一个Controller响应。</font><font style="vertical-align: inherit;">该控制器完成处理后，将返回正确的视图。</font><font style="vertical-align: inherit;">该序列在应用程序的整个生命周期中都以这种方式继续：</font></font>

source: In those frameworks, the UI/HTML5/XAML, is aware of what property of the presenter each UI element displays, so when you bind a view to a presenter, the view looks for the properties and knows how to draw data from them and how to set them when a value is changed in the UI by the user.
ja: それらのフレームワークでは、UIHTML5XAMLは、各UI要素が表示するプレゼンターのどのようなプロパティを認識しているので、ビューをプレゼンターにバインドすると、ビューはプロパティを探して、そこからデータを描画する方法や、ユーザーがUI内で値を変更したときにどのように設定するかを知っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 프레임 워크에서 UI / HTML5 / XAML은 각 UI 요소가 표시하는 발표자의 속성을 알고 있으므로보기를 발표자에 바인딩 할 때보기는 속성을 찾고 해당 속성에서 데이터를 그리는 방법과 방법을 알고 있습니다. 사용자가 UI에서 값을 변경할 때 설정합니다.</font></font>
ru: В этих фреймворках UIHTML5XAML знает,какое свойство отображает каждый элемент пользовательского интерфейса,поэтому при привязке представления к ведущему,представление ищет свойства и знает,как отрисовывать данные из них и как устанавливать их,когда значение изменяется пользователем в пользовательском интерфейсе.
zh_cn: 在那些框架中,UIHTML5XAML,是知道每个UI元素显示的presenter的什么属性的,所以当你把视图绑定到presenter上时,视图就会寻找这些属性,并知道如何从这些属性中引出数据,以及当用户在UI中改变一个值时,如何设置这些属性。

source: Instead, have a look at <a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder">Action-Domain-Responder</a>. In ADR, the <strong>Controller</strong> gets an <strong>Action</strong>, which will perform an operation in the <strong>Model/Domain</strong>. So far, the same. The difference is, it then collects that operation's response/data, and pass it to a <strong>Responder</strong> (<em>eg:. <code>view()</code></em>) for rendering. When a new action is requested on the same component, the <strong>Controller</strong> is called again, and the cycle repeats itself. In ADR, there's <strong>no connection</strong> between the Model/Domain and the View (<em>Reponser's response</em>).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに、</font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responderをご覧ください</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 ADRでは、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actionを</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">取得</font><font style="vertical-align: inherit;">し、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model / Domainで</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">操作を実行します</font><font style="vertical-align: inherit;">。これまでのところ、同じです。違いは、その操作の応答/データを収集し、それを</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">レスポンダー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font></font> <code>view()</code> </em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）に</font><font style="vertical-align: inherit;">渡して</font><font style="vertical-align: inherit;">レンダリングすることです。同じコンポーネントで新しいアクションが要求されると、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が再度呼び出され、サイクルが繰り返されます。 ADRでは</font><font style="vertical-align: inherit;">、モデル/ドメインとビュー（</font><em><font style="vertical-align: inherit;">Reponserの応答</font></em><font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">間に</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はあり</font><strong><font style="vertical-align: inherit;">ません</font></strong><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신 </font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 살펴보십시오 </font><font style="vertical-align: inherit;">. ADR에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><strong><font style="vertical-align: inherit;">모델 / 도메인</font></strong><font style="vertical-align: inherit;"> 에서 작업을 수행하는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가져 </font><font style="vertical-align: inherit;">옵니다 </font><font style="vertical-align: inherit;">. 지금까지 동일합니다. 차이점은 작업의 응답 / 데이터를 수집 </font><font style="vertical-align: inherit;">하여 렌더링 </font><font style="vertical-align: inherit;">을 위해 </font><strong><font style="vertical-align: inherit;">응답자</font></strong><font style="vertical-align: inherit;"> ( </font><em><font style="vertical-align: inherit;">예 : </font></em><em> <code>view()</code> </em><font style="vertical-align: inherit;"> )에 </font><font style="vertical-align: inherit;">전달한다는 것 </font><font style="vertical-align: inherit;">입니다. 동일한 구성 요소에서 새 조치가 요청되면 </font><strong><font style="vertical-align: inherit;">Controller</font></strong><font style="vertical-align: inherit;"> 가 다시 호출되고주기 자체가 반복됩니다. ADR에서는 </font><font style="vertical-align: inherit;">모델 / 도메인과보기 ( </font><em><font style="vertical-align: inherit;">응답자 응답</font></em><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">간에 </font><strong><font style="vertical-align: inherit;">연결</font></strong><font style="vertical-align: inherit;"> 이 </font><strong><font style="vertical-align: inherit;">없습니다</font></strong><font style="vertical-align: inherit;"> .</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вместо этого взгляните на </font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . В ADR </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> получает </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">действие</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которое будет выполнять операцию в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модели / домене</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Пока что тоже самое. Разница в том, что он затем собирает ответ / данные этой операции и передает их </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответчику</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">например, </font></font> <code>view()</code> </em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) для рендеринга. Когда новое действие запрашивается в том же компоненте, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">контроллер</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывается снова, и цикл повторяется. В ADR </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нет связи</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> между моделью / доменом и представлением ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответ Reponser</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相反，请查看</font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。在ADR中，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获得一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它将在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model / Domain中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">执行操作</font><font style="vertical-align: inherit;">。到目前为止，都一样。不同之处在于，它随后收集了该操作的响应/数据，并将其传递给</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Responder</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如：。view </font></font> <code>view()</code> </em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）以进行渲染。当在同一组件上请求执行新操作时，将</font><font style="vertical-align: inherit;">再次调用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并且循环会重复进行。在ADR中，</font><font style="vertical-align: inherit;">模型/域与视图（</font><em><font style="vertical-align: inherit;">响应者的响应</font></em><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">之间</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有联系</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: It is the best explanation on the web I could find.
ja: ウェブ上で見つけた中では最高の説明だと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 찾은 웹에서 가장 좋은 설명입니다.</font></font>
ru: Это лучшее объяснение в сети,которое я смог найти.
zh_cn: 这是我在网上能找到的最好的解释。

source: MVC = Model-View-Controller
ja: MVC=モデルビューコントローラ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC = 모델 뷰 컨트롤러</font></font>
ru: MVC=Модель-Вид-контроллер
zh_cn: MVC=模型-视图-控制器

source: MVC is great, but the problem is that usually its controller per view. Controller A knows how to set fields of View A. If now, you want View A to display data of model B, you need Controller A to know model B, or you need Controller A to receive an object with an interface - which is like MVP only without the bindings, or you need to rewrite the UI set code in Controller B.
ja: MVCは素晴らしいですが、問題は通常はビューごとにコントローラがあるということです。コントローラAはビューAのフィールドを設定する方法を知っています。もし今、ビューAにモデルBのデータを表示させたい場合、コントローラAがモデルBを知っている必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC는 훌륭하지만 문제는 일반적으로 뷰 당 컨트롤러입니다. </font><font style="vertical-align: inherit;">컨트롤러 A는 뷰 A의 필드를 설정하는 방법을 알고 있습니다. 이제 뷰 A가 모델 B의 데이터를 표시하도록하려면 모델 A를 알기 위해 컨트롤러 A가 필요하거나 인터페이스가있는 객체를 수신하려면 컨트롤러 A가 필요합니다. 바인딩이없는 MVP 만 또는 컨트롤러 B에서 UI 세트 코드를 다시 작성해야합니다.</font></font>
ru: MVC это здорово,но проблема в том,что обычно его контроллер на вид.Контроллер A знает,как устанавливать поля вида A.Если теперь вы хотите,чтобы вид A отображал данные модели B,вам нужен контроллер A,чтобы знать модель B,или вам нужен контроллер A,чтобы получать объект с интерфейсом-который похож на MVP только без привязки,или вам нужно переписать код набора пользовательского интерфейса в контроллере B.
zh_cn: MVC很好,但问题是,通常它的控制器是每个视图的控制器。Controller A知道如何设置View A的字段,如果现在想让View A显示模型B的数据,需要Controller A知道模型B的数据,或者需要Controller A接收一个接口的对象--这就像MVP只是没有绑定,或者需要在Controller B中重写UI设置代码。

source: MVC stands for Model-View-Controller. Controller is responsible for creating models and rendering views with binding models.
ja: MVCとは、Model-View-Controllerの略です。コントローラはモデルを作成し、バインディングモデルでビューをレンダリングする役割を担っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC는 Model-View-Controller를 나타냅니다. </font><font style="vertical-align: inherit;">Controller는 모델을 작성하고 바인딩 모델을 사용하여 뷰를 렌더링합니다.</font></font>
ru: MVC означает Model-View-Controller (Модель-Контроллер Вида).Контроллер отвечает за создание моделей и рендеринг представлений с привязкой моделей.
zh_cn: MVC是Model-View-Controller的缩写。Controller负责创建模型,并通过绑定模型渲染视图。

source: MVC: the controller is in charge.
ja: MVC:コントローラーが担当しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC : 컨트롤러가 담당합니다.</font></font>
ru: MVC:контроллер заряжен.
zh_cn: MVC:控制者说了算。

source: MVP = Model-View-Presenter
ja: MVP=モデルビュー・プレゼンター
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP = 모델 뷰 프리젠터</font></font>
ru: MVP=ведущий просмотра модели

source: MVP designs have the Presenter access the model and interact with the view.
ja: MVPデザインでは、プレゼンターがモデルにアクセスして、ビューと対話できるようにしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP 디자인은 발표자가 모델에 액세스하고 뷰와 상호 작용하도록합니다.</font></font>
ru: Проекты MVP имеют доступ ведущего к модели и взаимодействуют с видом.
zh_cn: MVP设计让Presenter访问模型并与视图交互。

source: MVP is <em>not</em> necessarily a scenario where the View is in charge (see Taligent's MVP for example).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVPは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必ずしもビューが責任を負うシナリオで</font><font style="vertical-align: inherit;">はあり</font><em><font style="vertical-align: inherit;">ません</font></em><font style="vertical-align: inherit;">（たとえば、TaligentのMVPを参照してください）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP가 </font><font style="vertical-align: inherit;">반드시 뷰를 담당하는 시나리오 </font><font style="vertical-align: inherit;">는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아닙니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (예 : Taligent의 MVP 참조).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP - это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обязательно сценарий, когда представление является ответственным (см., Например, MVP Taligent).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不是</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一定是这样一个场景，查看负责（见Taligent公司的例如MVP）。</font></font>

source: MVP stands for Model - View- Presenter. This came to a picture in early 2007 where Microsoft introduced Smart Client windows applications.
ja: MVPはModel-View-Presenterの略です。これは2007年の初めにMicrosoftがSmart ClientのWindowsアプリケーションを導入した時の写真です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP는 Model-View- Presenter의 약자입니다. </font><font style="vertical-align: inherit;">이것은 2007 년 초에 Microsoft가 Smart Client Windows 응용 프로그램을 도입 한 그림에 대한 것입니다.</font></font>
ru: MVP означает Модель-Вид-Ведущий.Это пришло к картине в начале 2007 года,когда компания Microsoft представила оконные приложения Smart Client.
zh_cn: MVP是Model-View-Presenter的缩写。这是2007年年初微软推出智能客户端窗口应用的图片。
