Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <em>Presenter</em>: Thanks for waiting <em>View</em>, I found a list of matching results for you and arranged them in a presentable format: ["Piano Teacher 2001","Piano 1993"]. Please show it to the user in a vertical list. Also please hide the progress bar now [<strong>MVP</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を待っていただきありがとうござい</font><font style="vertical-align: inherit;">ます。一致する結果のリストを見つけて、表示可能な形式で並べました：["Piano Teacher 2001"、 "Piano 1993"]。</font><font style="vertical-align: inherit;">縦のリストでユーザーに示してください。</font><font style="vertical-align: inherit;">また、進行状況バーを非表示にしてください[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 기다려 주셔서 감사합니다. </font><font style="vertical-align: inherit;">일치하는 결과 목록을 찾아서 ""Piano Teacher 2001 ","Piano 1993 "]과 같은 형식으로 정렬했습니다. </font><font style="vertical-align: inherit;">세로 목록으로 사용자에게 보여주세요. </font><font style="vertical-align: inherit;">또한 진행률 표시 줄을 숨기십시오 [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Спасибо за ожидание </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я нашел для вас список подходящих результатов и расположил их в презентабельном формате: ["Piano Teacher 2001", "Piano 1993"]. </font><font style="vertical-align: inherit;">Пожалуйста, покажите это пользователю в вертикальном списке. </font><font style="vertical-align: inherit;">Также, пожалуйста, скройте индикатор прогресса сейчас [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：感谢</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的等待</font><font style="vertical-align: inherit;">，我为您找到了一个匹配的结果列表，并以合适的格式排列它们：[&ldquo; Piano Teacher 2001&rdquo;，&ldquo; Piano 1993&rdquo;]。</font><font style="vertical-align: inherit;">请在垂直列表中向用户显示。</font><font style="vertical-align: inherit;">另外，请立即隐藏进度栏[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Presenter</em>|<em>Controller</em>: Hey <em>Model</em>, Do you have any match for this search term?: &ldquo;piano&rdquo; [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：ねえ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、この検索キーワードに一致するものはありますか？：「ピアノ」[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Hey </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,이 검색어와 일치하는 것이 있습니까? : "piano"[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Эй, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , у тебя есть совпадение по этому поисковому запросу: &laquo;фортепиано&raquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">管理员</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：嗨，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模特儿</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您对此搜索词有任何匹配吗？：&ldquo; piano&rdquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>Presenter</em>|<em>Controller</em>: Hey <em>View</em>, is there any search term on that page? [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：ね</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Viewビュー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、そのページに検索用語はありますか？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 이봐 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 해당 페이지에 어떤 검색어가? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контролер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Привет, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , есть ли поисковый запрос на этой странице? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：嘿</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查看</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，是否有任何网页上的搜索字词？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>View</em>: Hey <em>Presenter</em>|<em>Controller</em>, a User has just clicked on the search button, what shall I do? [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：ちょっと</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ユーザーが検索ボタンをクリックしただけですが、どうすればよいですか？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Hey </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자가 방금 검색 버튼을 클릭했습니다. 어떻게해야합니까? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Эй, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , Пользователь только что нажал на кнопку поиска, что мне делать? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查看</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：嘿</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，一个用户刚刚单击搜索按钮，我该怎么办？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>View</em>: Ok, hold on a sec &hellip; . [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：わかりました、しばらくお待ちください... </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 좋아, 잠깐만&hellip; </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Хорошо, подожди секунду ... </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：好的，稍等片刻&hellip;&hellip;。</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
