Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: User: I just clicked on the search button &hellip;
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザー：検索ボタンをクリックしただけで&hellip;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 : 방금 검색 버튼을 클릭했습니다&hellip;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пользователь: Я только что нажал на кнопку поиска ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用户：我只是点击了搜索按钮...</font></font>

source: Usually view to presenter map one to one. Complex views may have multi presenters.
ja: 通常、ビューからプレゼンターへのマップは1対1になります。複雑なビューは複数のプレゼンターを持つ場合があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 발표자에게 일대일로 표시합니다. </font><font style="vertical-align: inherit;">복잡한보기에는 여러 발표자가있을 수 있습니다.</font></font>
ru: Обычно просмотр карты ведущего один на один.Сложные виды могут иметь несколько ведущих.
zh_cn: 一般视图到演示者图一对一。复杂的视图可能有多个演示者。

source: View event binding will be implemented in the Presenter from a view interface.
ja: ビューのイベントバインディングは、ビューインターフェイスからPresenterに実装されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View 이벤트 바인딩은 Presenter에서보기 인터페이스에서 구현됩니다.</font></font>
ru: Привязка событий просмотра будет реализована в Ведущем из интерфейса просмотра.
zh_cn: 视图事件绑定将在Presenter中从视图接口实现。

source: View is more loosely coupled to the model. The presenter is responsible for binding the model to the view.
ja: ビューはモデルとより緩やかに結合されています。プレゼンターはモデルをビューに結合する責任があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">뷰가 모델에 더 느슨하게 결합됩니다. </font><font style="vertical-align: inherit;">발표자는 모델을 뷰에 바인딩해야합니다.</font></font>
ru: Вид более свободно связан с моделью.Ведущий отвечает за привязку модели к виду.
zh_cn: 视图与模型的绑定比较松散。主持人负责将模型与视图进行绑定。

source: What are MVP and MVC and what is the difference
ja: MVPとMVCとは何か、何が違うのか
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP 및 MVC 란 무엇이며 차이점은 무엇입니까</font></font>
ru: Что такое MVP и MVC,и в чем разница.
zh_cn: 什么是MVP和MVC,有什么区别?

source: What is the <strong>difference</strong> between <strong>MVC</strong> and <strong>MVP</strong> patterns?
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">何が</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">違い</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">間の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パターンは？</font></font>
ko: <font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">MVC</font></strong><font style="vertical-align: inherit;"> 와 </font><strong><font style="vertical-align: inherit;">MVP</font></strong><font style="vertical-align: inherit;"> 패턴 </font><font style="vertical-align: inherit;">의 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차이점</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font><font style="vertical-align: inherit;">무엇입니까 </font><font style="vertical-align: inherit;">?</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В чем </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">разница</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> между </font><font style="vertical-align: inherit;">шаблонами </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
zh_cn: <font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">MVC</font></strong><font style="vertical-align: inherit;">和</font><strong><font style="vertical-align: inherit;">MVP</font></strong><font style="vertical-align: inherit;">模式</font><font style="vertical-align: inherit;">之间有</font><font style="vertical-align: inherit;">什么</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区别</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>

source: What issues do these patterns address?
ja: これらのパターンは、どのような問題に対処しているのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 패턴은 어떤 문제를 해결합니까?</font></font>
ru: Какие проблемы решаются этими моделями?
zh_cn: 这些模式能解决哪些问题?

source: When looking beyond the <a href="https://en.wikipedia.org/wiki/Rapid_application_development">RAD</a> (drag-drop and configure) way of building user interfaces that many tools encourage you are likely to come across three design patterns called <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">Model-View-Controller</a>, <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93presenter">Model-View-Presenter</a> and <a href="http://en.wikipedia.org/wiki/Model_View_ViewModel">Model-View-ViewModel</a>. My question has three parts to it:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザーインターフェイスを構築</font><font style="vertical-align: inherit;">する</font></font><a href="https://en.wikipedia.org/wiki/Rapid_application_development"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAD</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（ドラッグアンドドロップおよび構成）の方法</font><font style="vertical-align: inherit;">を超えて検討する場合</font><font style="vertical-align: inherit;">、多くのツールは、</font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Controller</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93presenter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Presenter</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font><a href="http://en.wikipedia.org/wiki/Model_View_ViewModel"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれる3つの設計パターンに出くわす可能性が高いと考えています</font><font style="vertical-align: inherit;">。私の質問には3つの部分があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 도구에서 권장 </font><font style="vertical-align: inherit;">하는 </font></font><a href="https://en.wikipedia.org/wiki/Rapid_application_development"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAD</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (드래그 앤 드롭) 방식의 사용자 인터페이스를 </font><font style="vertical-align: inherit;">넘어 서면 </font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Controller</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93presenter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Presenter</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="http://en.wikipedia.org/wiki/Model_View_ViewModel"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이라는 세 가지 디자인 패턴을 보게 될 것 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">내 질문에는 세 부분이 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если взглянуть за пределы </font></font><a href="https://en.wikipedia.org/wiki/Rapid_application_development"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAD</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (перетаскивания и настройки) способа создания пользовательских интерфейсов, который многие инструменты поощряют, вы, скорее всего, натолкнетесь на три модели проектирования, которые называются </font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Controller</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93presenter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Presenter</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://en.wikipedia.org/wiki/Model_View_ViewModel"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Мой вопрос состоит из трех частей:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当超越</font></font><a href="https://en.wikipedia.org/wiki/Rapid_application_development"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAD</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（拖放和配置）构建用户界面的方式时，许多工具鼓励您使用三种设计模式，分别称为</font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Controller</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font><a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93presenter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-Presenter</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="http://en.wikipedia.org/wiki/Model_View_ViewModel"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model-View-ViewModel</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。我的问题包括三个部分：</font></font>

source: When using Passive View, your View typically implement a fine-grained interface with properties mapping more or less directly to the underlaying UI widget. For instance, you might have a ICustomerView with properties like Name and Address.
ja: パッシブビューを使用する場合、ビューは通常、下にあるUIウィジェットに多かれ少なかれ直接マッピングされたプロパティを持つきめ細かなインターフェースを実装します。例えば、名前や住所のようなプロパティを持つICustomerViewがあるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수동보기를 사용하는 경우 일반적으로 View는 기본 UI 위젯에 직접 또는 거의 맵핑되는 특성으로 세분화 된 인터페이스를 구현합니다. </font><font style="vertical-align: inherit;">예를 들어 이름 및 주소와 같은 속성을 가진 ICustomerView가있을 수 있습니다.</font></font>
ru: При использовании пассивного вида,ваш вид обычно реализует мелкозернистый интерфейс с отображением свойств более или менее непосредственно в подложке виджета пользовательского интерфейса.Например,у вас может быть ICustomerView со свойствами,такими как Имя и Адрес.
zh_cn: 当使用被动视图时,你的视图通常会实现一个精细的接口,其属性或多或少直接映射到下层UI小部件。例如,你可能有一个ICustomerView,它的属性是Name和Address。

source: You can then bind to the view many different types of presenter, all must have Maker property - it can be of a plane, train or what ever , the view doesn't care. The view draws data from the presenter - no matter which - as long as it implements an agreed interface.
ja: そして、多くの異なるタイプのプレゼンターをビューにバインドすることができます。ビューは、合意されたインターフェースを実装している限り、プリゼンタからデータを描画します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 많은 다른 유형의 발표자에게 뷰에 바인딩 할 수 있으며 모두 메이커 속성이 있어야합니다. 평면, 기차 또는 뷰가 중요하지 않은 뷰일 수 있습니다. </font><font style="vertical-align: inherit;">뷰는 합의 된 인터페이스를 구현하는 한 발표자로부터 데이터를 가져옵니다.</font></font>
ru: Вы можете затем привязать к виду много различных типов ведущего,все должны иметь свойство Maker-это может быть самолет,поезд или что угодно,вид не заботит.Вид черпает данные из ведущего-независимо от того,какой-до тех пор,пока он реализует согласованный интерфейс.
zh_cn: 然后,你可以将许多不同类型的presenter绑定到视图中,所有的presenter必须具有Maker属性--可以是飞机、火车或其他什么的,视图并不关心。视图从预设器中提取数据,不管是哪种类型的,只要它实现了一个约定的接口,就可以从预设器中提取数据。

source: You forgot about <strong>Action-Domain-Responder</strong> (<a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder">ADR</a>).
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADR</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">忘れました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;">ADR</font></a><font style="vertical-align: inherit;"> ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder)을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 잊었습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы забыли про </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADR</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您忘记了</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Action-Domain-Responder</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://en.wikipedia.org/wiki/Action%E2%80%93domain%E2%80%93responder"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADR</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: Your Presenter class will talk to the model and "map" it to the view. This approach is called the "Passive View". The benefit is that the view is easy to test, and it is easier to move between UI platforms (Web, Windows/XAML, etc.). The disadvantage is that you can't leverage things like databinding (which is <em>really</em> powerful in frameworks like <a href="http://en.wikipedia.org/wiki/Windows_Presentation_Foundation">WPF</a> and <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a>).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenterクラスはモデルに話しかけ、それをビューに「マッピング」します。</font><font style="vertical-align: inherit;">このアプローチは、「パッシブビュー」と呼ばれます。</font><font style="vertical-align: inherit;">利点は、ビューのテストが容易であり、UIプラットフォーム（Web、Windows / XAMLなど）間を移動するのが簡単であることです。</font><font style="vertical-align: inherit;">欠点は、データバインディング（</font><a href="http://en.wikipedia.org/wiki/Windows_Presentation_Foundation"><font style="vertical-align: inherit;">WPF</font></a><font style="vertical-align: inherit;">や</font><a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight"><font style="vertical-align: inherit;">Silverlight</font></a><font style="vertical-align: inherit;">などのフレームワーク</font><font style="vertical-align: inherit;">では</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">強力</font><font style="vertical-align: inherit;">です）などを利用できないことです</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter 클래스는 모델과 대화하고 뷰에 "매핑"합니다. </font><font style="vertical-align: inherit;">이 접근 방식을 "패시브 뷰"라고합니다. </font><font style="vertical-align: inherit;">이점은 뷰를 테스트하기 쉽고 UI 플랫폼 (웹, Windows / XAML 등)간에 쉽게 이동할 수 있다는 것입니다. </font><font style="vertical-align: inherit;">단점은 </font><a href="http://en.wikipedia.org/wiki/Windows_Presentation_Foundation"><font style="vertical-align: inherit;">WPF</font></a><font style="vertical-align: inherit;"> 및 </font><a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight"><font style="vertical-align: inherit;">Silverlight</font></a><font style="vertical-align: inherit;"> 와 </font><font style="vertical-align: inherit;">같은 프레임 워크에서 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 강력한 </font><font style="vertical-align: inherit;">데이터 바인딩과 같은 것을 활용할 수 없다는 것 </font><font style="vertical-align: inherit;">입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ваш класс Presenter будет говорить с моделью и &laquo;сопоставлять&raquo; ее с представлением. </font><font style="vertical-align: inherit;">Этот подход называется &laquo;пассивным представлением&raquo;. </font><font style="vertical-align: inherit;">Преимущество заключается в том, что представление легко тестировать, и его легче перемещать между платформами пользовательского интерфейса (Web, Windows / XAML и т. Д.). </font><font style="vertical-align: inherit;">Недостатком является то, что вы не можете использовать такие вещи, как привязка данных (что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">действительно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> полезно в таких </font></font><a href="http://en.wikipedia.org/wiki/Windows_Presentation_Foundation"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">средах,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как </font><font style="vertical-align: inherit;">WPF</font><font style="vertical-align: inherit;"> и </font></font><a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Silverlight</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter类将与模型对话，并将其&ldquo;映射&rdquo;到视图。</font><font style="vertical-align: inherit;">这种方法称为&ldquo;被动视图&rdquo;。</font><font style="vertical-align: inherit;">好处是视图易于测试，并且更易于在UI平台（Web，Windows / XAML等）之间移动。</font><font style="vertical-align: inherit;">缺点是您不能利用数据绑定之类的东西（</font><font style="vertical-align: inherit;">在</font><a href="http://en.wikipedia.org/wiki/Windows_Presentation_Foundation"><font style="vertical-align: inherit;">WPF</font></a><font style="vertical-align: inherit;">和</font><a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight"><font style="vertical-align: inherit;">Silverlight之</font></a><font style="vertical-align: inherit;">类的框架中</font><font style="vertical-align: inherit;">它</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确实很</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">强大</font><font style="vertical-align: inherit;">）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Your implementation might look something like this:
ja: あなたの実装は以下のようになるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현은 다음과 같습니다.</font></font>
ru: Твоя имплементация может выглядеть вот так:
zh_cn: 你的实现可能看起来像这样。
