Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: I think this image by Erwin Vandervalk (and the accompanying <a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/">article</a>) is the best explanation of MVC, MVP, and MVVM, their similarities, and their differences. The <a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/">article</a> does not show up in search engine results for queries on "MVC, MVP, and MVVM" because the title of the article does not contain the words "MVC" and "MVP"; but it is the best explanation, I think.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Erwin Vandervalk（および付随する</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">によるこの画像</font><font style="vertical-align: inherit;">は、MVC、MVP、およびMVVM、それらの類似点、および相違点を最もよく説明している</font><font style="vertical-align: inherit;">と思います</font><font style="vertical-align: inherit;">。</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事は、</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事のタイトルは、言葉「MVC」と「MVP」が含まれていないため、「MVC、MVP、およびMVVM」のクエリの検索エンジンの検索結果には表示されません。</font><font style="vertical-align: inherit;">でもそれが一番いい説明だと思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Erwin Vandervalk (및 첨부 된 </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기사</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">의이 이미지 </font><font style="vertical-align: inherit;">는 MVC, MVP 및 MVVM에 대한 최고의 설명, 유사점 및 차이점에 대한 것입니다. </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기사는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기사의 제목은 단어 "MVC"와 "MVP"를 포함하지 않기 때문에 "MVC, MVP 및 MVVM"에 대한 조회 검색 엔진 결과에 표시되지 않습니다 </font><font style="vertical-align: inherit;">가장 좋은 설명이라고 생각합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я думаю, что это изображение Эрвина Вандервалька (и сопровождающая </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статья</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) является лучшим объяснением MVC, MVP и MVVM, их сходства и различий. </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Статья</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не отображается в результатах поиска по запросам на &laquo;MVC, MVP и MVVM&raquo; , </font><font style="vertical-align: inherit;">потому что название статьи не содержит слова &laquo;MVC&raquo; и &laquo;MVP&raquo;; </font><font style="vertical-align: inherit;">но это лучшее объяснение, я думаю.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为Erwin Vandervalk（及其随附的</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文章</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）提供的</font><font style="vertical-align: inherit;">这张图像</font><font style="vertical-align: inherit;">是MVC，MVP和MVVM及其相似之处和差异的最好解释。</font><font style="vertical-align: inherit;">该</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文章</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">未出现在搜索引擎结果中的&ldquo; MVC，MVP和MVVM&rdquo;查询中，因为该文章的标题不包含单词&ldquo; MVC&rdquo;和&ldquo; MVP&rdquo;。</font><font style="vertical-align: inherit;">但我认为这是最好的解释。</font></font>

source: IMO, MVP is an improved version of MVC where you basically separate the concern of what you're gonna show (the data) from how you're gonna show (the view). The presenter includes kinda the business logic of your UI, implicitly imposes what data should be presented and gives you a list of dumb view models. And when the time comes to show the data, you simply plug your view (probably includes the same id's) into your adapter and set the relevant view fields using those view models with a minimum amount of code being introduced (just using setters). Its main benefit is you can test your UI business logic against many/various views like showing items in a horizontal list or vertical list.
ja: IMO的には、MVPはMVCの改良版であり、何を表示するか(データ)とどのように表示するか(ビュー)という問題を基本的に切り離しています。プレゼンターはUIのビジネスロジックのようなものを含み、どのようなデータを表示すべきかを暗黙のうちに要求し、おぼろげなビューモデルのリストを提供します。そして、データを表示する時が来たら、アダプタにビュー (おそらく同じ ID を含む)を差し込んで、それらのビューモデルを使って関連するビューフィールドを設定するだけです。主な利点は、水平リストや垂直リストの項目を表示するなど、さまざまなビューに対して UI ビジネスロジックをテストできることです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IMO, MVP는 MVC의 개선 된 버전으로 기본적으로 표시 할 내용 (데이터)과 표시 방법 (뷰)을 구분합니다. 발표자는 UI의 비즈니스 로직을 포함하고 어떤 데이터를 표시해야하는지 암시 적으로 표시하며 바보보기 모델 목록을 제공합니다. 그리고 데이터를 보여줄 때가되면 뷰 (어쩌면 동일한 ID를 포함 할 것)를 어댑터에 꽂고 최소한의 코드 만 도입 된 뷰 모델을 사용하여 관련 뷰 필드를 설정하기 만하면됩니다 (세터 만 사용). 주요 이점은 가로 목록 또는 세로 목록에 항목을 표시하는 것과 같이 많은 / 다양한보기에 대해 UI 비즈니스 로직을 테스트 할 수 있다는 것입니다.</font></font>
ru: IMO,MVP является улучшенной версией MVC,где вы в основном отделяете заботу о том,что вы собираетесь показать (данные)от того,как вы собираетесь показать (вид).Докладчик включает в себя вроде как бизнес-логику вашего пользовательского интерфейса,неявно навязывает,какие данные должны быть представлены,и дает вам список немых моделей представления.И когда приходит время показать данные,вы просто подключаете ваше представление (вероятно,включает те же самые идентификаторы)к вашему адаптеру и устанавливаете соответствующие поля представления,используя эти модели представления с минимальным количеством вводимого кода (просто используя сеттеры).Его основное преимущество заключается в том,что вы можете протестировать вашу бизнес-логику пользовательского интерфейса против множества разнообразных представлений,таких как показ элементов в горизонтальном или вертикальном списке.
zh_cn: IMO,MVP是MVC的改进版,你基本上把你要展示什么(数据)和如何展示(视图)的问题分开了。介绍者包括了你的UI的业务逻辑,隐含了应该展示什么数据,并给你提供了一个愚蠢的视图模型列表。而当显示数据的时候,你只需将你的视图(可能包括相同的id)插入到你的适配器中,然后使用这些视图模型设置相关的视图字段,只需引入最少的代码量(只需使用设置器)。它的主要好处是,你可以用许多不同的视图来测试你的UI业务逻辑,比如在水平列表或垂直列表中显示项目。

source: If I&rsquo;m working in a team that already as a good background on web forms development style it&rsquo;s far easier to introduce MVP than MVC. I would say that MVP in this scenario is a quick win.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が既にWebフォーム開発スタイルの優れた背景を持つチームで働いている場合、MVCよりもMVPを導入する方がはるかに簡単です。</font><font style="vertical-align: inherit;">このシナリオでのMVPはすぐに勝ちます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 웹 양식 개발 스타일에 대한 좋은 배경을 가진 팀에서 일하고 있다면 MVC보다 MVP를 소개하는 것이 훨씬 쉽습니다. </font><font style="vertical-align: inherit;">이 시나리오에서 MVP는 빠른 승리라고 말할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если я работаю в команде, которая уже хорошо разбирается в стиле разработки веб-форм, гораздо проще представить MVP, чем MVC. </font><font style="vertical-align: inherit;">Я бы сказал, что MVP в этом сценарии - быстрая победа.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果我正在一个已经具有Web表单开发风格的良好背景的团队中工作，那么介绍MVP比MVC要容易得多。</font><font style="vertical-align: inherit;">我想说，在这种情况下，MVP是一个快速的胜利。</font></font>

source: If you want to see a sample with simple implementation please check <a href="https://github.com/rahulabrol/Messanger">this</a> GitHub post
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">簡単な実装のサンプルを見たい場合は、</font></font><a href="https://github.com/rahulabrol/Messanger"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> GitHubの投稿</font><font style="vertical-align: inherit;">を確認</font><font style="vertical-align: inherit;">し</font><font style="vertical-align: inherit;">て</font><font style="vertical-align: inherit;">ください </font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 구현으로 샘플을 보려면 </font></font><a href="https://github.com/rahulabrol/Messanger"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> GitHub 게시물을 </font><font style="vertical-align: inherit;">확인하십시오 </font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите увидеть пример с простой реализацией, пожалуйста, проверьте </font></font><a href="https://github.com/rahulabrol/Messanger"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этот</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пост на GitHub</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您想查看具有简单实现的示例，请查看 </font></font><a href="https://github.com/rahulabrol/Messanger"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> GitHub帖子</font></font>

source: In <strong>MVP</strong>, the Presenter contains the UI business logic for the View. All invocations from the View delegate directly to Presenter. The Presenter is also decoupled directly from the View and talks to it through an interface. This is to allow mocking of the View in a unit test. One common attribute of MVP is that there has to be a lot of two-way dispatching. For example, when someone clicks the "Save" button, the event handler delegates to the Presenter's "OnSave" method. Once the save is completed, the Presenter will then call back the View through its interface so that the View can display that the save has completed.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、プレゼンターは、表示のためのUIのビジネスロジックが含まれています。ビューからのすべての呼び出しは、プレゼンターに直接委任します。プレゼンターはビューから直接切り離され、インターフェースを介してビューと通信します。これは、単体テストでビューのモックを可能にするためです。 MVPの一般的な属性の1つは、多くの双方向ディスパッチが必要になることです。たとえば、誰かが「保存」ボタンをクリックすると、イベントハンドラーはPresenterの「OnSave」メソッドに委譲します。保存が完了すると、プレゼンターはインターフェイスを介してビューをコールバックし、ビューに保存が完了したことを表示できるようにします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 발표자보기위한 UI 비즈니스 로직이 포함되어 있습니다. View에서 모든 호출은 발표자로 직접 위임됩니다. 발표자는 또한보기에서 직접 분리되어 인터페이스를 통해 대화합니다. 단위 테스트에서 뷰를 조롱 할 수 있습니다. MVP의 일반적인 특징 중 하나는 양방향 디스패치가 많이 필요하다는 것입니다. 예를 들어, 누군가 "저장"단추를 클릭하면 이벤트 핸들러가 발표자의 "OnSave"메소드에 위임됩니다. 저장이 완료되면 발표자는 인터페이스를 통해보기를 다시 호출하여보기가 저장이 완료되었음을 표시 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Presenter содержит бизнес-логику пользовательского интерфейса для представления. Все вызовы из View делегируются непосредственно в Presenter. Ведущий также отделен непосредственно от представления и общается с ним через интерфейс. Это делается для того, чтобы разрешить насмешку над видом в модульном тесте. Одним из общих атрибутов MVP является то, что должно быть много двусторонней диспетчеризации. Например, когда кто-то нажимает кнопку &laquo;Сохранить&raquo;, обработчик события делегирует методу &laquo;OnSave&raquo; докладчика. Как только сохранение завершено, докладчик затем перезвонит представлению через его интерфейс, чтобы представление могло отобразить, что сохранение завершено.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，Presenter包含视图的UI业务逻辑。 View委托的所有调用均直接传递给Presenter。演示者也直接从视图中分离出来，并通过界面与之对话。这是为了在单元测试中模拟View。 MVP的一个共同属性是必须有很多双向分配。例如，当某人单击&ldquo;保存&rdquo;按钮时，事件处理程序将委托给演示者的&ldquo; OnSave&rdquo;方法。保存完成后，演示者将通过其界面回调视图，以便视图可以显示保存已完成。</font></font>

source: In MVC, View has the UI part, controller is the mediator between view and model &amp; model contains the business logic .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVCでは、ビューにはUIパーツがあり、コントローラーはビューとモデル間の仲介者であり、モデルにはビジネスロジックが含まれます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC에서 View에는 UI 부분이 있고 컨트롤러는 view와 model 사이의 중재자이며 비즈니스 모델은 비즈니스 로직을 포함합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В MVC View имеет часть пользовательского интерфейса, контроллер является посредником между представлением и моделью, а модель содержит бизнес-логику.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在MVC中，View具有UI部分，控制器是视图与模型之间的中介，而模型则包含业务逻辑。</font></font>

source: In MVC, we talk through interfaces (boundaries) to glue different layers. A controller is a plug-in to our architecture but it has no such a restriction to impose what to show. In that sense, MVP is kind of an MVC with a concept of views being pluggable to the controller over adapters.
ja: MVCでは、インターフェイス(境界線)を介して異なるレイヤーを接着するために話をします。コントローラは我々のアーキテクチャのプラグインですが、何を表示するかという制約はありません。その意味で、MVP は MVC の一種で、アダプタを介してコントローラにプラグイン可能なビューの概念を持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC에서는 인터페이스 (경계)를 통해 서로 다른 레이어를 접착합니다. </font><font style="vertical-align: inherit;">컨트롤러는 우리 아키텍처의 플러그인이지만 보여줄 것을 강요하는 데 제한이 없습니다. </font><font style="vertical-align: inherit;">그런 의미에서 MVP는 어댑터를 통해 컨트롤러에 뷰를 연결할 수있는 개념을 가진 일종의 MVC입니다.</font></font>
ru: В MVC мы говорим через интерфейсы (границы)для склеивания различных слоев.Контроллер-это плагин к нашей архитектуре,но у него нет такого ограничения на то,что показывать.В этом смысле MVP-это что-то вроде MVC с концепцией подключения представлений к контроллеру через адаптеры.
zh_cn: 在MVC中,我们通过接口(边界)来粘合不同的层,通过接口(边界)来说话。控制器是我们架构的一个插件,但它没有这样的限制,可以强加什么显示。从这个意义上说,MVP有点像MVC,视图是可以通过适配器对控制器进行插件的概念。

source: In MVP the view draws data from the presenter which draws and prepares/normalizes data from the model while in MVC the controller draws data from the model and set, by push in the view.
ja: MVPでは、MVPではビューがプレゼンターからデータを描画し、モデルからデータを描画して正規化準備を行うのに対し、MVCではコントローラがモデルからデータを描画して設定し、ビュー内でプッシュすることでデータを描画します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP에서보기는 프리젠터에서 데이터를 가져 오며 MVC에서는 컨트롤러가보기에서 푸시하여 모델에서 데이터를 가져와 설정하는 동안 모델에서 데이터를 가져오고 준비 / 정규화합니다.</font></font>
ru: В MVP представление черпает данные из ведущего,который черпает и подготавливаетснормализует данные из модели,в то время как в MVC контроллер черпает данные из модели и устанавливает,путем нажатия на представление.
zh_cn: 在MVP中,视图从预设者中绘制数据,预设者从模型中绘制并准备好数据,而在MVC中,控制器通过视图中的推送,从模型中绘制数据并设置。

source: In MVP you can have a single view working with multiple types of presenters and a single presenter working with different multiple views.
ja: MVPでは、1つのビューで複数のタイプのプレゼンターを操作し、1つのプレゼンターで異なる複数のビューを操作することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP에서는 여러 유형의 발표자와 작업하는 단일보기와 다른 여러 시점과 작업하는 단일 발표자를 가질 수 있습니다.</font></font>
ru: В MVP вы можете иметь один вид,работающий с несколькими типами ведущих,и один ведущий,работающий с разными множественными видами.
zh_cn: 在MVP中,你可以让一个视图与多种类型的演示者一起工作,也可以让一个演示者与不同的多视图一起工作。

source: In MVP, View contains both UI and implementation of the presenter since here the presenter is just an interface &amp; model is the same i.e contains business logic .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVPでは、ビューにはプレゼンターのUIと実装の両方が含まれます。プレゼンターは単なるインターフェイスであり、モデルは同じである、つまりビジネスロジックが含まれているためです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP에서보기에는 UI와 발표자의 구현이 모두 포함됩니다. 여기서 발표자는 인터페이스 및 모델이 동일하므로 비즈니스 논리가 포함됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В MVP View содержит как пользовательский интерфейс, так и реализацию презентатора, поскольку здесь презентатор представляет собой просто интерфейс, а модель - то же самое, то есть содержит бизнес-логику.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在MVP中，View包含演示者的UI和实现，因为在这里，演示者只是一个接口，模型是相同的，即包含业务逻辑。</font></font>

source: In case you're interested, I have been writing a series of articles dealing with app architectural patterns (MVC, MVP, MVVP, clean architecture, ...) accompanied by a Github repo <a href="http://www.digigene.com/android-architecture-wolfkcats">here</a>. Even though the sample is written for android, the underlying principles can be applied to any medium.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">興味がある方のために、私は</font></font><a href="http://www.digigene.com/android-architecture-wolfkcats"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Githubリポジトリを伴うアプリアーキテクチャパターン（MVC、MVP、MVVP、クリーンアーキテクチャなど）に関する一連の記事を書いてい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">サンプルはAndroid用に作成されていますが、基本的な原則はどのメディアにも適用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관심이 있으시다면 </font></font><a href="http://www.digigene.com/android-architecture-wolfkcats"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Github 저장소와 함께 앱 아키텍처 패턴 (MVC, MVP, MVVP, 클린 아키텍처 등)을 다루는 일련의 기사를 작성했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">샘플이 Android 용으로 작성되었지만 기본 원칙을 모든 매체에 적용 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В случае , </font><font style="vertical-align: inherit;">если вы заинтересованы, я пишу серию статей , </font><font style="vertical-align: inherit;">посвященных приложения архитектурных паттернов (MVC, MVP, MVVP, чистая архитектуру, ...) сопровождается Github репо </font></font><a href="http://www.digigene.com/android-architecture-wolfkcats"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Несмотря на то, что образец написан для Android, основные принципы могут быть применены к любому носителю.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果你有兴趣，我一直在写了一系列的处理应用架构模式的文章（MVC，MVP，MVVP，干净的架构，...）伴随着一个GitHub库</font></font><a href="http://www.digigene.com/android-architecture-wolfkcats"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">即使该示例是为android编写的，其基本原理也可以应用于任何媒介。</font></font>
