Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: ( <em>Model</em> is making a query to the movie database &hellip; ) [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は映画データベースにクエリを作成しています&hellip;）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 영화 데이터베이스에 쿼리하는 중&hellip;) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает запрос к базе данных фильмов&hellip;) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正在查询电影数据库...）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: ( <em>Presenter</em>|<em>Controller</em> is calling the <em>Model</em> &hellip; ) [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデルを</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出してい</font><font style="vertical-align: inherit;">ます&hellip;）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 부릅니다 </font><font style="vertical-align: inherit;">&hellip;) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示者</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正在调用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &hellip;）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: ( <em>View</em> calling the <em>Presenter</em>|<em>Controller</em> &hellip; ) [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><em><font style="vertical-align: inherit;">プレゼンターの</font></em><font style="vertical-align: inherit;">呼び出しを</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font><em><font style="vertical-align: inherit;">コントローラー</font></em><font style="vertical-align: inherit;"> &hellip;）[ </font><strong><font style="vertical-align: inherit;">MVP</font></strong><font style="vertical-align: inherit;"> | </font><strong><font style="vertical-align: inherit;">MVC</font></strong><font style="vertical-align: inherit;"> ]</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просмотр</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызова </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ведущего</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">контроллера</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查看</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼叫</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presenter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller的</font></font></em><font style="vertical-align: inherit;"><em><font style="vertical-align: inherit;">视图</font></em><font style="vertical-align: inherit;"> &hellip;）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: ( After a while ... )
ja: (しばらくして・・・)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( 잠시 후 ... )</font></font>
ru: (Через некоторое время...)
zh_cn: (过了一会儿......)

source: (<em>Presenter</em>|<em>Controller</em> thanks <em>Model</em> and gets back to the <em>View</em>) [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラの</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おかげで</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とに戻って取得する</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビュー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 감사 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 다시 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> благодарит </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и возвращается к </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Представлению</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示者</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控制器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">感谢</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并返回到</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: (The <a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/">article</a> also matches what Uncle Bob Martin said in his one of his talks: that MVC was originally designed for the small UI components, not for the architecture of the system)
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（この</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、ボブマーティンおじさんが彼の講演の1つで言った内容にも一致します。MVCは元々、システムのアーキテクチャー用ではなく、小さなUIコンポーネント用に設計されたものです）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(이 </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기사</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 밥 마틴 (Bob Martin) 삼촌이 말한 </font><font style="vertical-align: inherit;">내용과</font><font style="vertical-align: inherit;"> 도 일치합니다. MVC는 원래 시스템 아키텍처가 아닌 작은 UI 구성 요소를 위해 설계되었습니다)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Статья</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также соответствует тому, что дядя Боб Мартин сказал в одном из своих выступлений: что MVC изначально был разработан для небольших компонентов пользовательского интерфейса, а не для архитектуры системы)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://blogs.msdn.microsoft.com/erwinvandervalk/2009/08/14/the-difference-between-model-view-viewmodel-and-other-separated-presentation-patterns/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本文</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还与鲍勃&middot;马丁叔叔在他的一次演讲中所说的相吻合：MVC最初是为小型UI组件而不是为系统体系结构设计的）</font></font>

source: -------------- This is where MVP and MVC start to diverge ---------------
ja: --------------MVPとMVCが乖離し始めるのはここからです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-------------- MVP와 MVC가 분기되기 시작하는 곳입니다 ---------------</font></font>
