Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <strong>Note:</strong> Wikipedia states that "<em>Each ADR action, however, is represented by separate classes or closures.</em>". This is <strong>not</strong> necessarily true. Several Actions can be in the same Controller, and the pattern is still the same.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ウィキペディアでは、「</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、各ADRアクションは個別のクラスまたはクロージャーによって表されます。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」と述べています。</font><font style="vertical-align: inherit;">これは</font><font style="vertical-align: inherit;">必ずしも本当で</font><font style="vertical-align: inherit;">はあり</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">複数のアクションを同じコントローラーに含めることができ、パターンは同じです。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Wikipedia에서는 " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 ADR 작업은 별도의 클래스 또는 클로저로 표시됩니다.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "라고 말합니다. </font><font style="vertical-align: inherit;">반드시 그런 </font><font style="vertical-align: inherit;">것은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아닙니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">여러 동작이 동일한 컨트롤러에있을 수 있으며 패턴은 여전히 ​​동일합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Википедия утверждает, что &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Каждое действие ADR, однако, представлено отдельными классами или замыканиями</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;. </font><font style="vertical-align: inherit;">Это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обязательно правда. </font><font style="vertical-align: inherit;">Несколько действий могут быть в одном контроллере, и шаблон остается тем же.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Wikipedia指出&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，每个ADR操作均由单独的类或闭包表示。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;。</font><font style="vertical-align: inherit;">这是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全正确。</font><font style="vertical-align: inherit;">多个动作可以在同一Controller中，并且模式仍然相同。</font></font>

source: <strong>Passive View:</strong> The View is as dumb as possible and contains almost zero logic. The Presenter is a middle man that talks to the View and the Model. The View and Model are completely shielded from one another. The Model may raise events, but the Presenter subscribes to them for updating the View. In Passive View there is no direct data binding, instead the View exposes setter properties which the Presenter uses to set the data. All state is managed in the Presenter and not the View.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッシブビュー：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビューは可能な限り単純で、ロジックはほとんど含まれていません。</font><font style="vertical-align: inherit;">プレゼンターは、ビューとモデルに話しかける仲介者です。</font><font style="vertical-align: inherit;">ビューとモデルは互いに完全にシールドされています。</font><font style="vertical-align: inherit;">モデルはイベントを発生させる可能性がありますが、プレゼンターはビューを更新するためにそれらをサブスクライブします。</font><font style="vertical-align: inherit;">パッシブビューでは、直接のデータバインディングはありません。代わりに、ビューは、プレゼンターがデータを設定するために使用するセッタープロパティを公開します。</font><font style="vertical-align: inherit;">すべての状態はビューではなくプレゼンターで管理されます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패시브 뷰 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 뷰는 가능한 한 바보이며 거의 제로 로직을 포함합니다. </font><font style="vertical-align: inherit;">발표자는보기 및 모델과 대화하는 중간 사람입니다. </font><font style="vertical-align: inherit;">뷰와 모델은 서로 완전히 차폐되어 있습니다. </font><font style="vertical-align: inherit;">모델은 이벤트를 발생시킬 수 있지만 발표자는 뷰를 업데이트하기 위해 구독합니다. </font><font style="vertical-align: inherit;">패시브 뷰에는 직접 데이터 바인딩이 없으며, 대신보기는 발표자가 데이터를 설정하는 데 사용하는 세터 속성을 노출합니다. </font><font style="vertical-align: inherit;">모든 상태는보기가 아닌 발표자에서 관리됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пассивное представление:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> представление настолько глупо, насколько это возможно, и содержит практически нулевую логику. </font><font style="vertical-align: inherit;">Ведущий - посредник, который говорит с Видом и Моделью. </font><font style="vertical-align: inherit;">Вид и Модель полностью защищены друг от друга. </font><font style="vertical-align: inherit;">Модель может вызывать события, но докладчик подписывается на них для обновления представления. </font><font style="vertical-align: inherit;">В пассивном просмотре нет прямой привязки данных, вместо этого вид предоставляет свойства сеттера, которые Presenter использует для установки данных. </font><font style="vertical-align: inherit;">Все состояние управляется в Presenter, а не View.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被动视图：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图尽可能愚蠢，并且包含几乎为零的逻辑。</font><font style="vertical-align: inherit;">演示者是与视图和模型对话的中间人。</font><font style="vertical-align: inherit;">视图和模型完全相互屏蔽。</font><font style="vertical-align: inherit;">该模型可能引发事件，但是演示者订阅了这些事件以更新视图。</font><font style="vertical-align: inherit;">在Passive View中，没有直接的数据绑定，而是View公开了Presenter用于设置数据的setter属性。</font><font style="vertical-align: inherit;">所有状态都在Presenter中管理，而不是在View中管理。</font></font>

source: <strong>Pros:</strong> The view is having only UI not any logics High level of testability
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">長所：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ビューにはUIのみがあり、ロジックはありません。高レベルのテスト容易性</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">장점 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보기에는 로직이 아닌 UI 만 있습니다. 높은 수준의 테스트 가능성</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Плюсы: в</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> представлении есть только пользовательский интерфейс, а не логика. Высокий уровень тестируемости.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">优点：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 视图仅具有UI，没有任何逻辑高可测试性</font></font>

source: <strong>Pros:</strong> Emphasis on Single Responsibility Principle High level of testability
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">長所：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 単一の責任の原則の強調高いテスト容易性</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">장점 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 단일 책임 원칙에 대한 강조 높은 수준의 테스트 가능성</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Плюсы:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> акцент на принципе единой ответственности Высокий уровень тестируемости</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">优点：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 强调单一责任原则高水平的可测试性</font></font>

source: <strong>Supervising Controller:</strong> The Presenter handles user gestures. The View binds to the Model directly through data binding. In this case it's the Presenter's job to pass off the Model to the View so that it can bind to it. The Presenter will also contain logic for gestures like pressing a button, navigation, etc.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">監督コントローラー：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンターはユーザーのジェスチャーを処理します。ビューは、データバインディングを介してモデルに直接バインドします。この場合、モデルをバインドしてビューに渡すのはプレゼンターの仕事です。プレゼンターには、ボタンを押す、ナビゲーションなどのジェスチャーのロジックも含まれます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">감독 컨트롤러 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 발표자는 사용자 제스처를 처리합니다. </font><font style="vertical-align: inherit;">뷰는 데이터 바인딩을 통해 모델에 직접 바인딩됩니다. </font><font style="vertical-align: inherit;">이 경우 모델을 뷰에 전달하여 바인딩 할 수있는 발표자의 작업입니다. </font><font style="vertical-align: inherit;">발표자에는 버튼 누르기, 탐색 등의 제스처에 대한 논리도 포함됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контролирующий контроллер:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ведущий обрабатывает жесты пользователя. Представление привязывается к модели напрямую через привязку данных. В этом случае работа докладчика заключается в том, чтобы передать модель представлению, чтобы она могла с ней связываться. Ведущий также будет содержать логику для таких жестов, как нажатие кнопки, навигация и т. Д.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">监督控制器：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示者处理用户手势。视图通过数据绑定直接绑定到模型。在这种情况下，演示者的职责是将模型传递给视图，以便可以绑定到视图。演示者还将包含手势的逻辑，例如按下按钮，导航等。</font></font>

source: <strong>Views</strong> for handling graphical user interface objects and presentation
ja: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">グラフィカルユーザーインターフェイスオブジェクトとプレゼンテーションを処理するための</font><strong><font style="vertical-align: inherit;">ビュー</font></strong></font>
ko: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래픽 사용자 인터페이스 객체 및 프리젠 테이션 처리를위한 </font><strong><font style="vertical-align: inherit;">뷰</font></strong></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Представления</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для обработки объектов графического интерфейса пользователя и представления</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于处理图形用户界面对象和演示的</font><strong><font style="vertical-align: inherit;">视图</font></strong></font>

source: A concrete workflow of querying and displaying a list of users from a database could work like this:
ja: データベースからユーザーのリストを照会して表示する具体的なワークフローは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스에서 사용자 목록을 쿼리하고 표시하는 구체적인 워크 플로는 다음과 같이 작동 할 수 있습니다.</font></font>
ru: Конкретный рабочий процесс запроса и отображения списка пользователей из базы данных может работать подобным образом:
zh_cn: 从数据库中查询和显示用户列表的具体工作流程可以是这样的。

source: A great article on the differences is <a href="http://www.infragistics.com/community/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx">here</a>. Most notable is that MVC pattern has the Model updating the View.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">違いに関するすばらしい記事は</font></font><a href="http://www.infragistics.com/community/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こちら</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">最も注目すべきは、MVCパターンがビューを更新するモデルを持っていることです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차이점에 대한 훌륭한 기사가 </font></font><a href="http://www.infragistics.com/community/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 있습니다</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">가장 주목할만한 것은 MVC 패턴에 모델이 뷰를 업데이트한다는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Отличная статья о различиях </font></font><a href="http://www.infragistics.com/community/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Наиболее примечательным является то, что шаблон MVC имеет модель, обновляющую представление.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关于差异的一篇很棒的文章在</font></font><a href="http://www.infragistics.com/community/blogs/todd_snyder/archive/2007/10/17/mvc-or-mvp-pattern-whats-the-difference.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">最值得注意的是，MVC模式具有更新视图的模型。</font></font>

source: A presenter is acting as a supervisory role in MVP which binding View events and business logic from models.
ja: プレゼンターは、モデルからViewイベントやビジネスロジックをバインディングするMVPの中で、監督的な役割を担っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자는 모델에서 View 이벤트와 비즈니스 로직을 바인딩하는 MVP의 감독 역할을 수행합니다.</font></font>
ru: Ведущий выступает в качестве контролирующей роли в MVP,которая связывает события View и бизнес-логику из моделей.
zh_cn: 主持人在MVP中担任监督角色,从模型中绑定View事件和业务逻辑。

source: Also worth remembering is that there are different types of MVPs as well. Fowler has broken the pattern into two - Passive View and Supervising Controller.
ja: また、MVPにも種類があることも覚えておきましょう。Fowlerはそのパターンをパッシブビューとスーパーバイジングコントローラの2つに分解しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 다른 유형의 MVP도 있다는 점을 기억해야합니다. </font><font style="vertical-align: inherit;">Fowler는이 패턴을 수동보기와 감시 컨트롤러의 두 가지로 나누었습니다.</font></font>
ru: Также стоит помнить,что существуют различные типы MVP.Фаулер разбил шаблон на два-Passive View и Supervising Controller.
zh_cn: 另外值得注意的是,MVP也有不同的类型。Fowler将模式分为两种--被动视图和监督控制器。

source: And so, you can look on MVP as an evolution of MVC.
ja: そして、MVPはMVCの進化として見ることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 MVP를 MVC의 진화로 볼 수 있습니다.</font></font>
ru: Таким образом,вы можете рассматривать MVP как эволюцию MVC.
zh_cn: 所以,你可以把MVP看成是MVC的进化。

source: Architecturally, MVP is Page Controller based approach where MVC is Front Controller based approach. That means that in MVP standard web form page life cycle is just enhanced by extracting the business logic from code behind. In other words, page is the one servicing http request. In other words, MVP IMHO is web form evolutionary type of enhancement. MVC on other hand changes completely the game because the request gets intercepted by controller class before page is loaded, the business logic is executed there and then at the end result of controller processing the data just dumped to the page ("view") In that sense, MVC looks (at least to me) a lot to Supervising Controller flavor of MVP enhanced with routing engine
ja: アーキテクチャ的には、MVP がページコントローラベースのアプローチであるのに対し、MVC はフロントコントローラベースのアプローチです。つまり、MVPの標準的なWebフォームでは、ページのライフサイクルは、後ろのコードからビジネスロジックを抽出することで強化されているに過ぎません。言い換えれば、ページはhttpリクエストを処理するものです。言い換えれば、MVP IMHOはWebフォームの進化型の強化です。一方、MVCはページがロードされる前にコントローラクラスによってリクエストがインターセプトされ、ビジネスロジックがそこで実行され、コントローラの最終的な処理結果でデータがページにダンプされる(「ビュー」)ので、ゲームを完全に変えてしまいます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구조적으로 MVP는 MVC가 Front Controller 기반 접근 방식 인 Page Controller 기반 접근 방식입니다. </font><font style="vertical-align: inherit;">즉, MVP 표준 웹 양식 페이지 수명주기는 코드 뒤에서 비즈니스 로직을 추출하여 향상됩니다. </font><font style="vertical-align: inherit;">즉, page는 http 서비스를 제공하는 것입니다. </font><font style="vertical-align: inherit;">즉, MVP IMHO는 웹 양식 진화 유형의 향상입니다. </font><font style="vertical-align: inherit;">반면에 MVC는 요청이 페이지가로드되기 전에 컨트롤러 클래스에 의해 가로 채기 때문에 비즈니스 로직이 실행 된 후 컨트롤러가 페이지에 덤프 된 데이터를 처리 한 최종 결과 ( "보기") 때문에 게임을 완전히 변경합니다. MVC는 라우팅 엔진으로 강화 된 MVP의 Supervising Controller의 풍미를 많이 보여줍니다.</font></font>
ru: С архитектурной точки зрения MVP-это подход,основанный на контроллере страницы,где MVC-подход,основанный на контроллере передней панели.Это означает,что в стандартной веб-форме MVP жизненный цикл страницы просто увеличивается за счет извлечения бизнес-логики из кода позади.Другими словами,страница-это та,которая обслуживает http запрос.Другими словами,MVP IMHO-это эволюционный тип усовершенствования веб-формы.MVC,напротив,полностью меняет игру,потому что запрос перехватывается классом контроллера перед загрузкой страницы,там выполняется бизнес-логика,а затем в конечном результате обработки контроллером данных,только что выброшенных на страницу ("view").В этом смысле MVC много смотрит (по крайней мере,на меня)на аромат контроллера Supervising Controller расширенного с помощью движка маршрутизации MVP
zh_cn: 在架构上,MVP是基于页面控制器的方法,而MVC是基于前台控制器的方法。这意味着,在MVP标准的web表单中,页面的生命周期只是通过从后面的代码中提取业务逻辑来增强。换句话说,页面就是服务于http请求的那个页面。换句话说,MVP IMHO是web表单的进化型增强。另一方面,MVC完全改变了游戏,因为在页面加载之前,请求被控制器类拦截,业务逻辑在那里被执行,然后在控制器处理的最终结果是将数据转储到页面("视图")。
