Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The <strong>Presenter</strong> is the &ldquo;middle-man&rdquo; (played by the controller in MVC) and has references to both, view and model. <strong>Please note that the word &ldquo;Model&rdquo;</strong> is misleading. It should rather be <strong>business logic that retrieves or manipulates a Model</strong>. For instance: If you have a database storing User in a database table and your View wants to display a list of users, then the Presenter would have a reference to your database business logic (like a DAO) from where the Presenter will query a list of Users.
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンターは</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（MVCコントローラによって果たされる）「仲介人」であり、ビューとモデルの両方への参照を有します。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「モデル」という言葉</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は誤解を招くものである</font><strong><font style="vertical-align: inherit;">ことに注意してください</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それはむしろ</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、Modelを取得または操作するビジネスロジックである</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要</font><strong><font style="vertical-align: inherit;">があります</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例：データベーステーブルにユーザーを格納するデータベースがあり、ビューがユーザーのリストを表示したい場合、プレゼンターはリストからクエリを行うデータベースビジネスロジック（DAOなど）への参照を持ちます。ユーザーの。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (MVC에서 컨트롤러에 의해 연주)은 "중간 사람"이고, 뷰와 모델 모두에 대한 참조를 가지고있다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;모델&rdquo;이라는 단어</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 오해의 소지가 있습니다. </font><font style="vertical-align: inherit;">오히려 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델을 검색하거나 조작하는 비즈니스 로직</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이어야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">예를 들어 : 데이터베이스 테이블에 사용자를 저장하는 데이터베이스가 있고보기에서 사용자 목록을 표시하려는 경우 발표자는 발표자가 목록을 쿼리 할 데이터베이스 비즈니스 로직 (예 : DAO)에 대한 참조를 갖습니다. 사용자 수</font></font>
ru: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является &laquo;средним человеком&raquo; ( в </font><font style="vertical-align: inherit;">исполнении контроллера в MVC) и имеют ссылки на оба, вид и модель. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что слово &laquo;Модель&raquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вводит в заблуждение. </font><font style="vertical-align: inherit;">Скорее, это должна быть </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">бизнес-логика, которая извлекает или манипулирует моделью</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Например: если у вас есть база данных, хранящая пользователя в таблице базы данных, и ваше представление хочет отобразить список пользователей, тогда у докладчика будет ссылка на бизнес-логику вашей базы данных (например, DAO), откуда докладчик будет запрашивать список пользователей.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是&ldquo;中间人&rdquo;（由控制器在MVC饰演），并具有两个，视图和模型引用。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，&ldquo;模型&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一词具有误导性。</font><font style="vertical-align: inherit;">相反，应该是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检索或操作Model的业务逻辑</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例如：如果您有一个在数据库表中存储User的数据库，并且View要显示用户列表，那么Presenter将引用您的数据库业务逻辑（例如DAO），Presenter将在该数据库中查询列表的用户。</font></font>

source: The <strong>model</strong> is the data that will be displayed in the view (user interface).
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデルは、</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビュー（ユーザーインターフェース）に表示されるデータです。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 뷰 (사용자 인터페이스)에 표시되는 데이터이다.</font></font>
ru: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модель</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> представляет собой данные , </font><font style="vertical-align: inherit;">которые будут отображаться в окне просмотра (пользовательского интерфейса).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是将在视图（用户界面）显示的数据。</font></font>

source: The <strong>view</strong> is an interface that displays data (the model) and routes user commands (events) to the Presenter to act upon that data. The view usually has a reference to its Presenter.
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビューは</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンターに表示データ（モデル）とルートユーザコマンド（イベント）がそのデータに作用することのインタフェースです。</font><font style="vertical-align: inherit;">通常、ビューにはプレゼンターへの参照があります。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 발표자로 데이터를 표시 (모델) 및 경로의 사용자 명령 (이벤트) 데이터에 따라 행동 할 것을 인터페이스입니다. </font><font style="vertical-align: inherit;">보기에는 일반적으로 발표자에 대한 참조가 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> представляет собой интерфейс , </font><font style="vertical-align: inherit;">который отображает данные (модель) и команды маршрутов пользователей (события) к выступающему действовать в </font><font style="vertical-align: inherit;">соответствии с </font><font style="vertical-align: inherit;">этими данными. </font><font style="vertical-align: inherit;">Представление обычно имеет ссылку на своего докладчика.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个界面，用于显示数据（模型）并将用户命令（事件）路由到Presenter以对该数据进行操作。</font><font style="vertical-align: inherit;">该视图通常引用其Presenter。</font></font>

source: The controller is created or accessed based on some event/request. The controller then creates the appropriate view and interacts with the model to further configure the view. It boils down to: the controller creates and manages the view; the view is slave to the controller. The view does not know about the controller.
ja: コントローラは、イベントリクエストに基づいて作成またはアクセスされます。そして、コントローラは適切なビューを作成し、モデルと対話してビューをさらに設定します。要するに、コントローラがビューを作成して管理し、ビューはコントローラのスレーブとなります。ビューはコントローラのスレーブである。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러는 일부 이벤트 / 요청에 따라 작성되거나 액세스됩니다. </font><font style="vertical-align: inherit;">그런 다음 컨트롤러는 적절한 뷰를 생성하고 모델과 상호 작용하여 뷰를 추가로 구성합니다. </font><font style="vertical-align: inherit;">컨트롤러는보기를 작성하고 관리합니다. </font><font style="vertical-align: inherit;">뷰는 컨트롤러의 슬레이브입니다. </font><font style="vertical-align: inherit;">보기는 컨트롤러에 대해 알지 못합니다.</font></font>
ru: Контроллер создается или доступ к нему осуществляется на основе запроса на какое-либо событие.Затем контроллер создает соответствующий вид и взаимодействует с моделью для дальнейшей настройки вида.Все сводится к следующему:контроллер создает вид и управляет им;вид является ведомым для контроллера.Вид не знает о контроллере.
zh_cn: 控制器是根据一些 eventrequest 创建或访问控制器。然后,控制器创建相应的视图,并与模型交互以进一步配置视图。这归结为:控制器创建并管理视图;视图是控制器的从属。视图不知道控制器。

source: The distinction made is that in an MVC application traditionally has the view and the controller interact with the model, but not with each other.
ja: この区別は、MVCアプリケーションでは伝統的にビューとコントローラがモデルと相互作用していますが、お互いにそうではないということです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차이점은 MVC 애플리케이션에서 전통적으로 뷰와 컨트롤러가 모델과 상호 작용하지만 서로 상호 작용하지 않는다는 것입니다.</font></font>
ru: Различие состоит в том,что в приложении MVC традиционно есть вид и контроллер взаимодействуют с моделью,но не друг с другом.
zh_cn: 区别在于,在传统的MVC应用中,视图和控制器与模型交互,而不是相互之间。

source: The input begins with the View, not the Presenter. There is a one-to-one mapping between the View and the associated Presenter. The View holds a reference to the Presenter. The Presenter is also reacting to events being triggered from the View, so its aware of the View its associated with. The Presenter updates the View based on the requested actions it performs on the Model, but the View is not Model aware.
ja: 入力は Presenter ではなく View から始まります。ビューと関連するプレゼンターの間には、1 対 1 のマッピングがあります。ビューは Presenter への参照を保持しています。Presenter は、ビューからトリガーされたイベントにも反応するため、関連付けられたビューを認識しています。このような場合は、モデル上で実行される要求されたアクションに基づいて Presenter がビューを更新しますが、ビューはモデルを認識しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력은 발표자가 아닌보기로 시작합니다. </font><font style="vertical-align: inherit;">보기와 관련 발표자간에 일대일 매핑이 있습니다. </font><font style="vertical-align: inherit;">보기에는 발표자에 대한 참조가 있습니다. </font><font style="vertical-align: inherit;">발표자는 View에서 트리거되는 이벤트에 반응하므로 View와 관련된 View를 인식합니다. </font><font style="vertical-align: inherit;">발표자는 모델에서 수행 한 요청 된 작업에 따라보기를 업데이트하지만보기는 모델을 인식하지 못합니다.</font></font>
ru: Вход начинается с "Вид",а не с "Ведущий".Между видом и соответствующим ведущим существует сопоставление один к одному.Вид содержит ссылку на докладчика.Ведущий также реагирует на события,вызываемые видом,поэтому он знает о виде,с которым он связан.Ведущий обновляет вид,основываясь на запрошенных действиях,которые он выполняет над Моделью,но вид не знает Модель.
zh_cn: 输入从视图开始,而不是从Presenter开始。视图和相关的Presenter之间有一个一对一的映射。视图持有对Presenter的引用。Presenter也在对View触发的事件做出反应,所以它意识到与之相关联的View。Presenter根据它在模型上执行的请求操作更新视图,但视图不知道模型。

source: The input is directed at the Controller first, not the view. That input might be coming from a user interacting with a page, but it could also be from simply entering a specific url into a browser. In either case, its a Controller that is interfaced with to kick off some functionality. There is a many-to-one relationship between the Controller and the View. That&rsquo;s because a single controller may select different views to be rendered based on the operation being executed. Note the one way arrow from Controller to View. This is because the View doesn&rsquo;t have any knowledge of or reference to the controller. The Controller does pass back the Model, so there is knowledge between the View and the expected Model being passed into it, but not the Controller serving it up.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">入力は、ビューではなく、最初にコントローラーに向けられます。</font><font style="vertical-align: inherit;">その入力は、ページを操作しているユーザーからのものである可能性がありますが、特定のURLをブラウザに入力しただけの場合もあります。</font><font style="vertical-align: inherit;">どちらの場合も、一部の機能を開始するためにインターフェースされるコントローラーです。</font><font style="vertical-align: inherit;">コントローラとビューの間には多対1の関係があります。</font><font style="vertical-align: inherit;">これは、単一のコントローラーが、実行中の操作に基づいてレンダリングされる異なるビューを選択する可能性があるためです。</font><font style="vertical-align: inherit;">コントローラからビューへの一方向の矢印に注意してください。</font><font style="vertical-align: inherit;">これは、ビューがコントローラーに関する知識や参照を持たないためです。</font><font style="vertical-align: inherit;">コントローラはモデルをパスバックするので、ビューとそれに渡される予想モデルとの間には知識がありますが、それを提供するコントローラには知識がありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력은보기가 아닌 컨트롤러로 먼저 향합니다. </font><font style="vertical-align: inherit;">이 입력은 페이지와 상호 작용하는 사용자가 올 수도 있지만 브라우저에 특정 URL을 입력하는 것일 수도 있습니다. </font><font style="vertical-align: inherit;">두 경우 모두 일부 기능을 시작하기 위해 인터페이스되는 컨트롤러입니다. </font><font style="vertical-align: inherit;">Controller와 View 사이에는 다 대일 관계가 있습니다. </font><font style="vertical-align: inherit;">단일 컨트롤러가 실행중인 작업에 따라 렌더링 할 다른보기를 선택할 수 있기 때문입니다. </font><font style="vertical-align: inherit;">컨트롤러에서 보기로의 단방향 화살표를 참고하십시오. </font><font style="vertical-align: inherit;">이는 View에 컨트롤러에 대한 지식이나 참조가 없기 때문입니다. </font><font style="vertical-align: inherit;">컨트롤러는 모델을 다시 전달하므로 뷰와 모델로 전달되는 예상 모델 사이에는 지식이 있지만이를 제공하는 컨트롤러는 아닙니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сначала вход направлен на контроллер, а не на вид. </font><font style="vertical-align: inherit;">Этот ввод может исходить от пользователя, взаимодействующего со страницей, но это также может быть просто ввод определенного URL в браузер. </font><font style="vertical-align: inherit;">В любом случае, это Контроллер, который связан с некоторыми функциональными возможностями. </font><font style="vertical-align: inherit;">Между контроллером и представлением существует отношение многие-к-одному. </font><font style="vertical-align: inherit;">Это связано с тем, что один контроллер может выбирать различные представления для визуализации в зависимости от выполняемой операции. </font><font style="vertical-align: inherit;">Обратите внимание на одностороннюю стрелку от контроллера к представлению. </font><font style="vertical-align: inherit;">Это связано с тем, что представление не имеет каких-либо знаний или ссылок на контроллер. </font><font style="vertical-align: inherit;">Контроллер действительно передает Модель обратно, поэтому существует знание между Представлением и ожидаемой Моделью, передаваемой в него, но не Контроллер, подающий его.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输入首先指向控制器，而不是视图。</font><font style="vertical-align: inherit;">该输入可能来自与页面交互的用户，但也可能来自简单地在浏览器中输入特定的URL。</font><font style="vertical-align: inherit;">在任何一种情况下，它都是与Controller相连以启动某些功能的控制器。</font><font style="vertical-align: inherit;">控制器和视图之间存在多对一的关系。</font><font style="vertical-align: inherit;">这是因为单个控制器可以根据正在执行的操作选择要渲染的不同视图。</font><font style="vertical-align: inherit;">请注意从控制器到视图的单向箭头。</font><font style="vertical-align: inherit;">这是因为视图不了解控制器或对该控制器没有任何参考。</font><font style="vertical-align: inherit;">Controller确实会传回模型，因此在视图和传递给它的预期模型之间有知识，但Controller没有提供知识。</font></font>

source: The second flavor of MVP is the Supervising Controller. In that case your View might have a property called Customer, which then again is databound to the UI widgets. You don't have to think about synchronizing and micro-manage the view, and the Supervising Controller can step in and help when needed, for instance with compled interaction logic.
ja: MVP の 2 つ目のフレーバーは Supervising Controller です。この場合、ビューに Customer というプロパティがあるかもしれません。ビューの同期化やマイクロ管理について考える必要はなく、必要に応じてスーパーバイジングコントローラが介入し、例えば複雑なインタラクションロジックなどで支援することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP의 두 번째 특징은 Supervising Controller입니다. </font><font style="vertical-align: inherit;">이 경우 View에는 Customer라는 속성이있을 수 있으며이 속성은 다시 UI 위젯에 데이터 바인딩됩니다. </font><font style="vertical-align: inherit;">뷰 동기화 및 미세 관리에 대해 생각할 필요가 없으며 Supervising Controller는 필요한 경우 (예 : 복잡한 상호 작용 논리) 개입하여 도움을 줄 수 있습니다.</font></font>
ru: Вторым вкусом MVP является Контроллер управления.В этом случае у вашего View может быть свойство под названием Customer (Клиент),которое,опять же,является базой данных виджетов пользовательского интерфейса.Вам не нужно думать о синхронизации и микро-управлении видом,а контролирующий контроллер может вмешаться и помочь при необходимости,например,с помощью усложненной логики взаимодействия.
zh_cn: MVP的第二种风味是监督控制器。在这种情况下,你的View可能会有一个名为Customer的属性,而这个属性又被数据绑定到UI小部件上。你不需要考虑同步和微观管理视图,监督控制器可以在需要的时候介入并提供帮助,比如说,使用复杂的交互逻辑。

source: The simplest answer is how the view interacts with the model. In MVP the view is updated by the presenter, which acts as as intermediary between the view and the model. The presenter takes the input from the view, which retrieves the data from the model and then performs any business logic required and then updates the view. In MVC the model updates the view directly rather than going back through the controller.
ja: 最も単純な答えは、ビューがモデルとどのように相互作用するかということです。MVPでは、ビューはプレゼンターによって更新され、ビューとモデルの間の仲介者として機能します。プレゼンターはビューからの入力を受け取り、モデルからデータを取得し、必要なビジネスロジックを実行してビューを更新します。MVCでは、コントローラを経由するのではなく、モデルが直接ビューを更新します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 간단한 대답은 뷰가 모델과 상호 작용하는 방식입니다. </font><font style="vertical-align: inherit;">MVP에서 뷰는 발표자에 의해 업데이트되며 뷰와 모델 사이의 중개자 역할을합니다. </font><font style="vertical-align: inherit;">발표자는 뷰에서 입력을 가져와 모델에서 데이터를 검색 한 다음 필요한 비즈니스 로직을 수행 한 다음 뷰를 업데이트합니다. </font><font style="vertical-align: inherit;">MVC에서 모델은 컨트롤러를 거치지 않고 뷰를 직접 업데이트합니다.</font></font>
ru: Самый простой ответ-как вид взаимодействует с моделью.В MVP представление обновляется ведущим,который действует как посредник между представлением и моделью.Докладчик берет входные данные из представления,которое извлекает данные из модели,а затем выполняет любую необходимую бизнес-логику и затем обновляет представление.В MVC модель обновляет представление напрямую,а не через контроллер.
zh_cn: 最简单的答案是视图如何与模型交互。在MVP中,视图由presenter更新,presenter作为视图和模型之间的中介。预设者从视图中获取输入,视图从模型中获取数据,然后执行任何需要的业务逻辑,然后更新视图。在MVC中,模型直接更新视图,而不是通过控制器返回视图。

source: The third "flavor" of MVP (or someone would perhaps call it a separate pattern) is the Presentation Model (or sometimes referred to Model-View-ViewModel). Compared to the MVP you "merge" the M and the P into one class. You have your customer object which your UI widgets is data bound to, but you also have additional UI-spesific fields like "IsButtonEnabled", or "IsReadOnly", etc.
ja: MVPの3番目の「フレーバー」は、プレゼンテーションモデル(またはModel-View-ViewModelと呼ばれることもあります)です。MVPと比較して、MとPを1つのクラスに「マージ」します。UIウィジェットのデータがバインドされている顧客オブジェクトがありますが、"IsButtonEnabled "や "IsReadOnly "などの追加のUI-spesificフィールドも持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP의 세 번째 "맛"(또는 다른 패턴이라고도 함)은 프레젠테이션 모델 (또는 때때로 Model-View-ViewModel이라고 함)입니다. </font><font style="vertical-align: inherit;">MVP와 비교하여 M과 P를 하나의 클래스로 "병합"합니다. </font><font style="vertical-align: inherit;">UI 위젯이 데이터 바인딩 된 고객 오브젝트가 있지만 "IsButtonEnabled"또는 "IsReadOnly"등과 같은 추가 UI 관련 필드도 있습니다.</font></font>
ru: Третьим "вкусом" MVP (или,возможно,кто-то назвал бы его отдельным шаблоном)является Модель представления (или иногда упоминается как Model-View-ViewModel).По сравнению с MVP вы "объединяете" M и P в один класс.У вас есть объект клиента,к которому привязаны данные ваших виджетов пользовательского интерфейса,но у вас также есть дополнительные поля UI,такие как "IsButtonEnabled","IsReadOnly" и т.п.
zh_cn: MVP的第三种 "味道"(或许有人会称它为单独的模式)是演示模型(或有时被称为Model-View-ViewModel)。与MVP相比,你将M和P "合并 "成一个类。你有你的客户对象,你的UI widgets是数据绑定到的,但你也有额外的UI-spesific字段,如 "IsButtonEnabled",或 "IsReadOnly "等。

source: The view is the initiator for user inputs and then delegates the events to the Presenter and the presenter handles event bindings and gets data from models.
ja: ビューはユーザー入力のイニシエーターであり、イベントをプレゼンターに委譲し、プレゼンターはイベントバインディングを処理し、モデルからデータを取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기는 사용자 입력의 개시 자이며 이벤트를 발표자에게 위임하고 발표자는 이벤트 바인딩을 처리하고 모델에서 데이터를 가져옵니다.</font></font>
ru: Вид является инициатором пользовательских входов,а затем делегирует события ведущему,а ведущий обрабатывает привязки событий и получает данные из моделей.
zh_cn: 视图是用户输入的发起者,然后将事件委托给陈述者,陈述者处理事件绑定并从模型中获取数据。

source: The view, in most cases, creates its presenter. The presenter will interact with the model and manipulate the view through an interface. The view will sometimes interact with the presenter, usually through some interface. This comes down to implementation; do you want the view to call methods on the presenter or do you want the view to have events the presenter listens to? It boils down to this: The view knows about the presenter. The view delegates to the presenter.
ja: ビューは、ほとんどの場合、プレゼンターを作成します。プレゼンターはモデルと対話し、インターフェースを通じてビューを操作します。ビューは、通常は何らかのインターフェイスを介してプリメンターと対話することもあります。これは、ビューがプリメンター上でメソッドを呼び出すようにしたいのか、それともプリメンターがリッスンするイベントをビューに持たせたいのか、という実装の問題になります。要するに、次のようなことです。ビューはプレゼンターについて知っています。ビューはプレゼンターに委任します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 경우보기는 발표자를 만듭니다. </font><font style="vertical-align: inherit;">발표자는 모델과 상호 작용하고 인터페이스를 통해보기를 조작합니다. </font><font style="vertical-align: inherit;">보기는 때때로 일부 인터페이스를 통해 발표자와 상호 작용합니다. </font><font style="vertical-align: inherit;">이것은 구현으로 귀착됩니다. </font><font style="vertical-align: inherit;">보기가 발표자에서 메소드를 호출하도록 하시겠습니까, 아니면보기가 발표자가 청취하는 이벤트를 갖기를 원하십니까? </font><font style="vertical-align: inherit;">이것으로 요약됩니다.보기는 발표자에 대해 알고 있습니다. </font><font style="vertical-align: inherit;">보기는 발표자에게 위임됩니다.</font></font>
ru: Вид,в большинстве случаев,создает своего ведущего.Ведущий будет взаимодействовать с моделью и манипулировать представлением через интерфейс.Иногда представление взаимодействует с ведущим,обычно через какой-то интерфейс.Это сводится к реализации;хотите ли вы,чтобы представление вызывало методы ведущего,или вы хотите,чтобы представление имело события,которые ведущий будет слушать? Все сводится к этому:Вид знает о ведущем.Вид делегирует ведущему.
zh_cn: 视图,在大多数情况下,视图会创建它的presenter。预设者将与模型进行交互,并通过一个接口来操作视图。视图有时会与presenter进行交互,通常是通过一些接口进行交互。这归结为实现;你想让视图调用presenter上的方法,还是想让视图有事件被presenter监听?归结起来就是这样。视图知道关于presenter的事情。视图委托给presenter。
