Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: As explained in some graphics above, there's a direct relation/link between the <strong>Model</strong> and the <strong>View</strong> in MVC. An action is performed on the <strong>Controller</strong>, which will execute an action on the <strong>Model</strong>. That action in the <strong>Model</strong>, <strong>will trigger a reaction</strong> in the <strong>View</strong>. The <strong>View</strong>, is always updated when the <strong>Model</strong>'s state changes.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のいくつかのグラフィックで説明したように、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">MVC </font><font style="vertical-align: inherit;">の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビューの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">間に直接的な関係/リンクが</font><font style="vertical-align: inherit;">あり</font><strong><font style="vertical-align: inherit;">ます</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">アクションは</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントローラー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">実行され、</font><strong><font style="vertical-align: inherit;">コントローラー</font></strong><font style="vertical-align: inherit;">は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデルで</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アクションを実行し</font><font style="vertical-align: inherit;">ます。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">での</font><font style="vertical-align: inherit;">そのアクションは</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">ビューでの</font></strong></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">反応を引き起こし</font></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビューを</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する場合、常に更新され、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の状態が変化します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 일부 그래픽에서 설명했듯이 </font><font style="vertical-align: inherit;">MVC </font><font style="vertical-align: inherit;">의 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">뷰</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사이에는 직접적인 관계 / 링크가 </font><font style="vertical-align: inherit;">있습니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">작업이 수행되고 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 작업이 실행됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">에서 그 행동 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반응 트리거</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때, 항상 업데이트 된 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 상태가 변경됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как объяснено на некоторых графиках выше, существует прямая связь / связь между </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">моделью</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">представлением</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в MVC. </font><font style="vertical-align: inherit;">Действие выполняется на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">контроллере</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который будет выполнять действие на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модели</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это действие в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модели</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">будет вызывать реакцию</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , постоянно обновляется , </font><font style="vertical-align: inherit;">когда </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> изменяется состояние &laquo;s.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如上图所示，</font><font style="vertical-align: inherit;">MVC中</font><font style="vertical-align: inherit;">的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之间存在直接关系/链接</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Controller</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上执行一个动作，该</font><strong><font style="vertical-align: inherit;">Controller</font></strong><font style="vertical-align: inherit;">将在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上执行一个动作</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这一行动</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模式</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将触发反应</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">该</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的时候总是更新</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">型号</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的状态发生改变。</font></font>

source: Because we use web frameworks (<em>eg:. Laravel</em>) that still use the same naming conventions (<em>model-view-controller</em>), we tend to think that it must be MVC, but it's actually something else.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引き続き同じ命名規則（</font><em><font style="vertical-align: inherit;">model-view-controller</font></em><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">を使用するWebフレームワーク（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：Laravel</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を使用しているため、</font><font style="vertical-align: inherit;">MVCである必要があると思われがちですが、実際には別のものです。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리 </font><font style="vertical-align: inherit;">는 여전히 동일한 명명 규칙 ( </font><em><font style="vertical-align: inherit;">model-view-controller</font></em><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">을 사용하는 웹 프레임 워크 ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 : Laravel</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )를 사용하기 </font><font style="vertical-align: inherit;">때문에 MVC 여야한다고 생각하는 경향이 있지만 실제로는 다른 것입니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку мы используем веб-фреймворки ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">например, Laravel</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), которые все еще используют те же соглашения об именах ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модель-представление-контроллер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), мы склонны думать, что это должен быть MVC, но на самом деле это что-то другое.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为我们使用</font><font style="vertical-align: inherit;">仍然使用相同命名约定（</font><em><font style="vertical-align: inherit;">model-view-controller</font></em><font style="vertical-align: inherit;">）的</font><font style="vertical-align: inherit;">Web框架（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如：。Laravel</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">，所以我们倾向于认为它必须是MVC，但实际上是其他东西。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: Both are patterns trying to separate presentation and business logic, decoupling business logic from UI aspects
ja: どちらもプレゼンテーションとビジネスロジックを分離しようとするパターンで、ビジネスロジックをUI面から切り離そうとしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘 다 프리젠 테이션과 비즈니스 로직을 분리하려고하는 패턴으로, 비즈니스 로직을 UI 측면에서 분리합니다.</font></font>
ru: Обе модели пытаются отделить презентацию от бизнес-логики,отделяя бизнес-логику от аспектов пользовательского интерфейса.
zh_cn: 这两种模式都是试图将表现形式和业务逻辑分开,将业务逻辑与UI方面解耦的模式。

source: Both of them enable TDD and have downsides and upsides.
ja: どちらもTDDを有効にして、マイナス面とプラス面があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘 다 TDD를 가능하게하며 단점과 단점이 있습니다.</font></font>
ru: Оба они включают TDD и имеют отрицательные и положительные стороны.
zh_cn: 两者都能实现TDD,而且都有弊端和上风。

source: Both of these frameworks aim to seperate concerns - for instance, interaction with a data source (model), application logic (or turning this data into useful information) (Controller/Presenter) and display code (View). In some cases the model can also be used to turn a data source into a higher level abstraction as well. A good example of this is the <a href="http://blog.wekeroad.com/mvc-storefront/">MVC Storefront project</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらのフレームワークはどちらも、たとえばデータソース（モデル）、アプリケーションロジック（またはこのデータを有用な情報に変換する）（コントローラー/プレゼンター）との相互作用、および表示コード（ビュー）などの懸念を分離することを目的としています。</font><font style="vertical-align: inherit;">場合によっては、モデルを使用して、データソースをより高いレベルの抽象化に変えることもできます。</font><font style="vertical-align: inherit;">この良い例が</font></font><a href="http://blog.wekeroad.com/mvc-storefront/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVCストアフロントプロジェクト</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 두 프레임 워크는 데이터 소스 (모델), 응용 프로그램 논리 (또는이 데이터를 유용한 정보로 변환) (컨트롤러 / 발표자) 및 표시 코드 (보기)와의 상호 작용과 같은 우려를 분리하는 것을 목표로합니다. </font><font style="vertical-align: inherit;">경우에 따라 모델을 사용하여 데이터 소스를 더 높은 수준의 추상화로 변환 할 수도 있습니다. </font><font style="vertical-align: inherit;">이에 대한 좋은 예는 </font></font><a href="http://blog.wekeroad.com/mvc-storefront/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC Storefront 프로젝트</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обе эти структуры стремятся разделить проблемы - например, взаимодействие с источником данных (модель), логику приложения (или превращение этих данных в полезную информацию) (Controller / Presenter) и код отображения (View). </font><font style="vertical-align: inherit;">В некоторых случаях модель также может использоваться для превращения источника данных в абстракцию более высокого уровня. </font><font style="vertical-align: inherit;">Хорошим примером этого является проект </font></font><a href="http://blog.wekeroad.com/mvc-storefront/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC Storefront</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这两个框架的目的都是分开关注，例如，与数据源（模型）的交互，应用程序逻辑（或将这些数据转换为有用的信息）（控制器/演示器）和显示代码（视图）。</font><font style="vertical-align: inherit;">在某些情况下，该模型还可以用于将数据源转换为更高级别的抽象。</font></font><a href="http://blog.wekeroad.com/mvc-storefront/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC Storefront项目</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就是一个很好的例子</font><font style="vertical-align: inherit;">。</font></font>

source: Both presentation patterns. They separate the dependencies between a Model (think Domain objects), your screen/web page (the View), and how your UI is supposed to behave (Presenter/Controller)
ja: どちらもプレゼンテーションのパターンです。これらのパターンは、モデル(ドメインオブジェクトを考える)、スクリーンウェブページ(ビュー)、UIの動作(PresenterController)の間の依存関係を分離します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 프리젠 테이션 패턴. </font><font style="vertical-align: inherit;">모델 (도메인 객체 생각), 화면 / 웹 페이지 (보기) 및 UI 작동 방식 (발표자 / 컨트롤러) 간의 종속성을 구분합니다.</font></font>
ru: Оба шаблона презентации.Они разделяют зависимости между Моделью (думаю,объектами домена),вашей страницей скринсвеба (Вид),и тем,как должен вести себя ваш пользовательский интерфейс (PresenterController).
zh_cn: 这两种展现模式。它们分离了模型(认为域对象)、你的屏幕网页(视图)和你的UI应该如何表现(PresenterController)之间的依赖关系。

source: Can be responsible for determining which view to display
ja: どのビューを表示するかを決定することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표시 할보기를 결정할 책임이 있습니다.</font></font>
ru: Может отвечать за определение того,какой вид отображения
zh_cn: 可负责决定显示哪个视图

source: Can be responsible for determining which view to display (Front Controller Pattern)
ja: 表示するビューを決定することができます(フロントコントローラパターン
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표시 할보기 결정을 담당 할 수 있습니다 (전면 컨트롤러 패턴)</font></font>
ru: Может отвечать за определение того,какой вид отображения (схема фронтального контроллера).
zh_cn: 可负责决定显示哪个视图(前部控制器模式)。

source: Con: more work (for example all the setter properties) as you are doing all the data binding yourself.
ja: Con:すべてのデータバインディングを自分で行っているため、より多くの作業(例えば、すべてのセッターのプロパティなど)が必要になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단점 : 모든 데이터 바인딩을 직접 수행함에 따라 더 많은 작업 (예 : 모든 세터 속성)</font></font>
ru: Con:больше работы (например,все свойства сеттера)по мере того,как вы сами выполняете привязку всех данных.
zh_cn: Con:更多的工作(例如所有的setter属性),因为你要自己做所有的数据绑定。

source: Con: there's less testable surface (because of data binding), and there's less encapsulation in the View since it talks directly to the Model.
ja: 欠点:(データバインディングのため)テスト可能なサーフェスが少なく、ビューはモデルと直接対話するためカプセル化が少ない。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단점 : 데이터 바인딩으로 인해 테스트 할 수있는 표면이 적고 모델과 직접 통신하기 때문에 View에서 캡슐화가 적습니다.</font></font>
ru: Con:меньше тестируемой поверхности (из-за привязки данных),и меньше инкапсуляции во Видении,так как оно напрямую взаимодействует с Моделью.
zh_cn: Con:可测试的面较少(因为数据绑定),而且View中的封装较少,因为它直接与Model对话。

source: Conclusion - MVP and MVC are both decouple of UI patterns, but MVP usually uses a bindings framework which is MVC underneath. THUS MVP is at a higher architectural level than MVC and a wrapper pattern above of MVC.
ja: 結論-MVPとMVCはどちらもUIパターンのデカップリングですが、MVPは通常バインディングフレームワークを使用しており、その下にMVCがあります。そのため、MVPはMVCよりも高いアーキテクチャーレベルにあり、MVCの上にあるラッパーパターンである。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결론-MVP와 MVC는 모두 UI 패턴을 분리하지만 MVP는 일반적으로 아래에 MVC 인 바인딩 프레임 워크를 사용합니다. </font><font style="vertical-align: inherit;">THUS MVP는 MVC보다 아키텍처 수준이 높으며 MVC 이상의 래퍼 패턴입니다.</font></font>
ru: Вывод-MVP и MVC являются развязкой шаблонов пользовательского интерфейса,но MVP обычно использует фреймворк привязки,под которым находится MVC.Это MVP находится на более высоком архитектурном уровне,чем MVC,а оберточная структура выше MVC.
zh_cn: 总结--MVP和MVC都是UI模式的解耦,但MVP通常使用的是绑定框架,绑定框架下面是MVC。THUS MVP比MVC处于更高的架构层面,是MVC之上的一个封装模式。

source: Consider <a href="https://lostechies.com/derekgreer/2007/08/25/interactive-application-architecture/">this</a> highly exciting article that comprehensively lists a number of these differing implementations. You may note that they're all basically doing the same thing but slightly differently.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらのさまざまな実装の多くを包括的にリストしている</font></font><a href="https://lostechies.com/derekgreer/2007/08/25/interactive-application-architecture/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常にエキサイティングな記事を</font><font style="vertical-align: inherit;">検討してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それらはすべて基本的に同じことをしているが、少し異なることに注意してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 다양한 구현을 종합적으로 나열한 </font></font><a href="https://lostechies.com/derekgreer/2007/08/25/interactive-application-architecture/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 흥미로운 기사를 </font><font style="vertical-align: inherit;">고려하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것들은 모두 기본적으로 동일한 일을하지만 약간 다르게 작동한다는 것을 알 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рассмотрим </font></font><a href="https://lostechies.com/derekgreer/2007/08/25/interactive-application-architecture/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чрезвычайно захватывающую статью, в которой подробно перечислен ряд этих различных реализаций. </font><font style="vertical-align: inherit;">Вы можете заметить, что все они в основном делают одно и то же, но немного по-другому.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考虑一下</font></font><a href="https://lostechies.com/derekgreer/2007/08/25/interactive-application-architecture/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">激动人心的文章，它全面列出了许多这些不同的实现。</font><font style="vertical-align: inherit;">您可能会注意到，他们基本上都在做相同的事情，但略有不同。</font></font>

source: Controller are based on behaviors and can be shared across views
ja: コントローラはビヘイビアに基づいており、ビュー間で共有することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러는 동작을 기반으로하며 여러 뷰에서 공유 할 수 있습니다</font></font>
ru: Контроллер основан на поведении и может быть использован для обмена мнениями.
zh_cn: 控制器以行为为基础,可以跨视图共享。
