Repository: rueisnom/feedback
Catalog: xlf/20/56/2056.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <em>View</em>: Thank you "Controller" [<strong>MVC</strong>] (Now the <em>View</em> is questioning itself: How should I present the results I get from the <em>Model</em> to the user? Should the production year of the movie come first or last...? Should it be in a vertical or horizontal list? ...)
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：ありがとう「コントローラ」[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビュー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は問題を投げかけています：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モデル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">得た結果を</font><font style="vertical-align: inherit;">ユーザーに</font><font style="vertical-align: inherit;">どのように提示する必要</font><font style="vertical-align: inherit;">がありますか？映画の製作年は最初にするべきですか、それとも最後にするべきですか？縦または横のリストにありますか？...）</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 감사합니다 "컨트롤러"[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] (이제 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자체에 의문을 제기합니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모델</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 얻은 결과 </font><font style="vertical-align: inherit;">를 사용자에게 어떻게 제시해야합니까? 영화 제작 연도가 가장 먼저 또는 마지막에 있어야합니까 ...? 수직 또는 수평 목록에 있습니까? ...)</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Спасибо &laquo;Controller&raquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] (Теперь </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">View</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> спрашивает себя: Как я должен представить результаты , которые </font><font style="vertical-align: inherit;">я получаю от </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">модели</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? Чтобы пользователь должен год производства фильма пришел первый или последний ... Должен ли </font><font style="vertical-align: inherit;">это? быть в вертикальном или горизонтальном списке? ...)</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：谢谢&ldquo;控制器&rdquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]（现在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正在质疑：我应该如何</font><font style="vertical-align: inherit;">向用户展示</font><font style="vertical-align: inherit;">从</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模型</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获得的结果</font><font style="vertical-align: inherit;">？电影的制作年份是第一还是最后一年？？是垂直列表还是水平列表？...）</font></font>

source: <em>View</em>: Thank you very much <em>Presenter</em> [<strong>MVP</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：ありがとうございました</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレゼンター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 감사합니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발표자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просмотр</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Большое спасибо </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ведущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：非常感谢</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主持人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>View</em>: Who&rsquo;s that? [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：それは誰ですか？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 누구입니까? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Кто это? </font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：那是谁？</font><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <em>View</em>: Yes,&hellip; here it is &hellip; &ldquo;piano&rdquo; [<strong>MVP</strong>|<strong>MVC</strong>]
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：はい、&hellip;ここに&hellip;「ピアノ」[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보기</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 예, 여기 있습니다&hellip; "피아노"[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вид</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Да,&hellip; вот оно&hellip; &laquo;пианино&raquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">视图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：是的，这里是&hellip;&ldquo;钢琴&rdquo; [ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> | </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: <strong>Cons:</strong> Bit complex and more work when implementing event bindings
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">短所：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> イベントバインディングを実装するときに少し複雑で作業が増える</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단점 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이벤트 바인딩을 구현할 때 약간 복잡하고 더 많은 작업</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Минусы:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> немного сложнее и больше работы при реализации привязки событий</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缺点：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 实现事件绑定时有点复杂，需要更多工作</font></font>

source: <strong>Cons:</strong> Sometimes too much workload for Controllers, if try to render multiple views in same controller.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">短所：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 同じコントローラーで複数のビューをレンダリングしようとすると、コントローラーのワークロードが多すぎる場合があります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단점 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동일한 컨트롤러에서 여러보기를 렌더링하려는 경우 컨트롤러에 대한 작업량이 너무 많은 경우가 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Минусы:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> иногда слишком большая рабочая нагрузка для контроллеров, если попытаться отобразить несколько представлений в одном контроллере.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缺点：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 如果尝试在同一控制器中呈现多个视图，则有时对于Controllers来说工作量过多。</font></font>

source: <strong>Controllers</strong> for handling the user interface and application
ja: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザーインターフェイスとアプリケーションを処理するための</font><strong><font style="vertical-align: inherit;">コントローラー</font></strong></font>
ko: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 인터페이스 및 애플리케이션을 처리하기위한 </font><strong><font style="vertical-align: inherit;">컨트롤러</font></strong></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроллеры</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для обработки пользовательского интерфейса и приложения</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于处理用户界面和应用程序的</font><strong><font style="vertical-align: inherit;">控制器</font></strong></font>

source: <strong>MVC (Model View Controller)</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC（Model View Controller）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC (모델 뷰 컨트롤러)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC (модель просмотра контроллера)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC（模型视图控制器）</font></font></strong>

source: <strong>MVC Pattern</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVCパターン</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC 패턴</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC Pattern</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC模式</font></font></strong>

source: <strong>MVC</strong> is a pattern for the architecture of a software application. It separate the application logic into three separate parts, promoting modularity and ease of collaboration and reuse. It also makes applications more flexible and welcoming to iterations.It separates an application into the following components:
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、ソフトウェアアプリケーションのアーキテクチャのパターンです。</font><font style="vertical-align: inherit;">アプリケーションロジックを3つの別々の部分に分離し、モジュール性を促進し、コラボレーションと再利用の容易さを促進します。</font><font style="vertical-align: inherit;">また、アプリケーションをより柔軟にし、反復を歓迎します。アプリケーションを次のコンポーネントに分割します。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 소프트웨어 응용 프로그램 아키텍처의 패턴입니다. </font><font style="vertical-align: inherit;">애플리케이션 로직을 3 개의 개별 파트로 분리하여 모듈화 및 협업 및 재사용 용이성을 촉진합니다. </font><font style="vertical-align: inherit;">또한 응용 프로그램을보다 유연하고 반복적으로 환영하며 응용 프로그램을 다음 구성 요소로 분리합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это образец архитектуры программного приложения. </font><font style="vertical-align: inherit;">Он разделяет логику приложения на три отдельные части, способствуя модульности и простоте совместной работы и повторного использования. </font><font style="vertical-align: inherit;">Это также делает приложения более гибкими и приветливыми к итерациям. Оно разделяет приложение на следующие компоненты:</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是软件应用程序体系结构的一种模式。</font><font style="vertical-align: inherit;">它将应用程序逻辑分为三个独立的部分，从而提高了模块化，并简化了协作和重用。</font><font style="vertical-align: inherit;">它还使应用程序更加灵活并欢迎迭代，并将应用程序分为以下组件：</font></font>

source: <strong>MVP (Model View Presenter)</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP（モデルビュープレゼンター）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP (모델보기 발표자)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP (ведущий модельного представления)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP（模型视图演示者）</font></font></strong>

source: <strong>MVP Pattern</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVPパターン</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP 패턴</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP Pattern</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MVP模式</font></font></strong>

source: <strong>Models</strong> for handling data and business logic
ja: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">データとビジネスロジックを処理するための</font><strong><font style="vertical-align: inherit;">モデル</font></strong></font>
ko: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터 및 비즈니스 로직 처리를위한 </font><strong><font style="vertical-align: inherit;">모델</font></strong></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Модели</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для обработки данных и бизнес-логики</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理数据和业务逻辑的</font><strong><font style="vertical-align: inherit;">模型</font></strong></font>
