Repository: rueisnom/feedback
Catalog: xlf/62/57/99/625799.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: ...and doing the same in <code>B.h</code>
es: ... y haciendo lo mismo en <code>B.h</code>
ja: ...そして <code>B.h</code> 同じことをする
ko: ... 그리고 <code>B.h</code> 에서 같은 일을
ru: ... и делать то же самое в <code>B.h</code>
zh_cn: ...并在 <code>B.h</code> 做同样的事情

source: ...then recompilation of the code for "A" will be triggered by the changes to the included <code>b.fwd.h</code> and should complete cleanly.
es: ... luego la recompilaci&oacute;n del c&oacute;digo para "A" se activar&aacute; por los cambios en el <code>b.fwd.h</code> incluido y debe completarse limpiamente.
ja: ...「A」のコードの再コンパイルは、含まれている <code>b.fwd.h</code> への変更によってトリガーされ、 正常に完了するはずです。
ko: ... 그런 다음 포함 된 <code>b.fwd.h</code> 에 대한 변경으로 "A"에 대한 코드 재 컴파일이 트리거되며 완전히 완료되어야합니다.
ru: ... тогда перекомпиляция кода для "A" будет вызвана изменениями во включенном <code>b.fwd.h</code> и должна завершиться чисто.
zh_cn: ...然后，将对包含的 <code>b.fwd.h</code> 进行更改，从而触发&ldquo; A&rdquo;代码的重新编译，并且应该完全完成。

source: <code>#include</code>, for all extents and purposes (if you take the preprocessor out) just copies the file into the <strong>.cc</strong>. So really, the <strong>.cc</strong> looks like:
es: <code>#include</code> , para todos los fines y prop&oacute;sitos (si saca el preprocesador) simplemente copia el archivo en <strong>.cc</strong> . Entonces, realmente, el <strong>.cc se</strong> ve as&iacute;:
ja: <code>#include</code> 、すべてのエクステントと目的（プリプロセッサーを削除する場合）については、ファイルを<strong>.ccに</strong>コピーするだけです。 つまり、 <strong>.cc</strong>は次のようになります。
ko: <code>#include</code> 는 모든 범위와 목적을 위해 (전처리기를 꺼내는 경우) 파일을 <strong>.cc에</strong> 복사하기 만하면됩니다. 실제로 <strong>.cc</strong> 는 다음과 같습니다.
ru: <code>#include</code> , для всех экстентов и целей (если вы удалите препроцессор) просто копирует файл в <strong>.cc</strong> . Так что на самом деле <strong>.cc</strong> выглядит так:
zh_cn: <code>#include</code> 在所有范围和目的（如果您将预处理器取出）中，只需将文件复制到<strong>.cc中即可</strong> 。 所以实际上， <strong>.cc</strong>看起来像：

source: <em>I'm late answering this, but there's not one reasonable answer to date, despite being a popular question with highly upvoted answers....</em>
es: <em>Llego tarde a responder esto, pero no hay una respuesta razonable hasta la fecha, a pesar de ser una pregunta popular con respuestas altamente votadas ...</em>
ja: <em>私はこれに答えるのが遅いですが、非常に賛成された回答で人気のある質問であるにもかかわらず、これまでに1つの合理的な答えはありません...</em>
ko: <em>나는 이것에 늦게 대답하고 있지만, 고도로 찬성 된 답변이있는 인기있는 질문 임에도 불구하고 현재까지 합리적인 대답은 하나도 없습니다 ....</em>
ru: <em>Я опаздываю с ответом на этот вопрос, но на сегодняшний день нет ни одного разумного ответа, несмотря на то, что он является популярным вопросом с высоко голосуемыми ответами</em>
zh_cn: <em>我来晚了，但是到目前为止，还没有一个合理的答案，尽管这是一个广受好评的答案。</em>

source: And in <strong>B.h</strong>, at this point, you can just <code>#include "A.h"</code> directly.
es: Y en <strong>Bh</strong> , en este punto, puedes <code>#include "A.h"</code> directamente.
ja: そして<strong>Bh</strong>では、この時点で <code>#include "A.h"</code> 直接入力するだけです。
ko: 그리고 <strong>Bh</strong> 에서는이 시점에서 <strong>#Ah를</strong> 직접 포함시킬 수 있습니다.
ru: И в <strong>Bh</strong> , в этот момент, вы можете просто <code>#include "A.h"</code> напрямую.
zh_cn: 在<strong>Bh中</strong> ，此时，您可以直接 <code>#include "A.h"</code> 。

source: And then, A.h and B.h will contain this:
es: Y entonces,A.h y B.h contendrán esto:
ja: そして、A.hとB.hにはこれが含まれます。
ko: 그리고 Ah와 Bh는 이것을 포함 할 것입니다 :
ru: И потом,А.Х.и Б.Х.будут содержать это:
zh_cn: 然后,A.h和B.h将包含这。

source: As illustrated by the Standard library's <code>&lt;iosfwd&gt;</code> header, the proper way to provide forward declarations for others is to have a <strong><em>forward declaration header</em></strong>. For example:
es: Como se ilustra en el encabezado <code>&lt;iosfwd&gt;</code> de la biblioteca est&aacute;ndar, la forma correcta de proporcionar declaraciones de reenv&iacute;o para otros es tener un <strong><em>encabezado de declaraci&oacute;n de reenv&iacute;o</em></strong> . Por ejemplo:
ja: 標準ライブラリの <code>&lt;iosfwd&gt;</code> ヘッダーに示されているように、他の人に前方宣言を提供する適切な方法は、 <strong><em>前方宣言ヘッダー</em></strong>を用意することです。 例えば：
ko: 표준 라이브러리의 <code>&lt;iosfwd&gt;</code> 헤더에서 알 수 있듯이 다른 사람에게 전달 선언을 제공하는 올바른 방법은 <strong><em>전달 선언 헤더를 사용하는 것</em></strong> 입니다. 예를 들면 다음과 같습니다.
ru: Как показано в заголовке <code>&lt;iosfwd&gt;</code> Стандартной библиотеки, правильным способом предоставления прямых объявлений для других является наличие <strong><em>заголовка прямой декларации</em></strong> . Например:
zh_cn: 如标准库的 <code>&lt;iosfwd&gt;</code> 标头所示，为其他人提供前向声明的正确方法是拥有一个<strong><em>前向声明头</em></strong> 。 例如：

source: Best practice: forward declaration headers
es: Práctica óptima:encabezamientos de la declaración de intenciones
ja: ベストプラクティス:フォワード宣言ヘッダー
ko: 모범 사례 : 전달 선언 헤더
ru: Передовая практика:заголовки деклараций вперёд
zh_cn: 最佳做法:前言声明标题

source: But his illustration is not really good. Because both classes (A and B) only need an incomplete type of each other (pointer fields / parameters).
es: Pero su ilustración no es muy buena.Porque ambas clases (A y B)sólo necesitan un tipo incompleto de cada una (parámetros de los campos de puntero).
ja: しかし、彼のイラストは本当に良いものではありません。なぜなら、両方のクラス(AとB)は、お互いの不完全な型(ポインタ・フィールド・パラメータ)を必要としているだけだからです。
ko: 그러나 그의 예는 실제로 좋지 않습니다. 두 클래스 (A와 B)는 서로 불완전한 유형 (포인터 필드 / 매개 변수) 만 필요합니다.
ru: Но его иллюстрация не очень хороша.Потому что оба класса (A и B)нуждаются только в неполном типе друг друга (параметры полей указателей).
zh_cn: 但他的说明其实并不好。因为两个类(A和B)都只需要一个不完整的类型的对方(指针字段参数)。

source: Clearly a circular reference that you must break.
es: Claramente una referencia circular que debes romper.
ja: 明らかに折らなければならない回覧板の参照。
ko: 분명히 반드시 참조해야하는 순환 참조입니다.
ru: Очевидно,круговая ссылка,которую вы должны нарушить.
zh_cn: 很明显,这是你必须打破的一个循环参考。

source: Create two files, A_def.h, B_def.h. These will contain only <code>A</code>'s and <code>B</code>'s definition:
es: Cree dos archivos, A_def.h, B_def.h. Estos contendr&aacute;n solo las definiciones de <code>A</code> y <code>B</code> :
ja: A_def.h、B_def.hの2つのファイルを作成します。 これらには <code>A</code> と <code>B</code> の定義のみが含まれます。
ko: A_def.h, B_def.h라는 두 파일을 작성하십시오. 여기에는 <code>A</code> 와 <code>B</code> 의 정의 만 포함됩니다.
ru: Создайте два файла: A_def.h, B_def.h. Они будут содержать только определения <code>A</code> и <code>B</code> :
zh_cn: 创建两个文件，A_def.h，B_def.h。 这些将仅包含 <code>A</code> 和 <code>B</code> 的定义：

source: Doing like this makes it possible to still have a bunch of inlines in both(or multiple) header files. But it's necessary to have <em>include guards</em>.
es: Hacer esto hace posible que todav&iacute;a tenga un mont&oacute;n de l&iacute;neas en ambos (o m&uacute;ltiples) archivos de encabezado. Pero es necesario <em>incluir guardias</em> .
ja: このようにすると、両方（または複数）のヘッダーファイルに多数のインラインを含めることができます。 ただし<em>、ガード</em>を<em>含める</em>必要があり<em>ます</em> 。
ko: 이렇게하면 둘 다 (또는 여러 개의) 헤더 파일에 여전히 많은 인라인을 가질 수 있습니다. 그러나 <em>경비원</em> 을 <em>포함</em> 해야합니다.
ru: Поступая так, вы можете иметь несколько строк в обоих (или нескольких) заголовочных файлах. Но необходимо иметь <em>охранников</em> .
zh_cn: 这样可以使两个（或多个）头文件中仍然有很多内联。 但是有必要<em>包括守卫</em> 。

source: File '''a.h''':
es: Archivo ''a.h'':
ja: ファイル '''a.h''。
ko: 파일 '' 'a.h' '':
ru: Файл "а.х.":
zh_cn: 文件''''a.h''''。

source: File '''b.h''':
es: Archivo ''b.h'':
ja: ファイル '''b.h''。
ko: 파일 '' 'b.h' '':
ru: Файл ''b.h'':
zh_cn: 文件"''''b.h''''。

source: File '''main.cpp''':
es: Archivo ''main.cpp'':
ja: ファイル'''main.cpp''。
ko: 파일 '' 'main.cpp' '':
ru: Файл ''main.cpp''':
zh_cn: 文件''''''主.cpp''''''。

source: Forward declaration is way to go.
es: La declaración anticipada es el camino a seguir.
ja: 前方宣言が道しるべになっている。
ko: 앞으로 선언하는 것이 좋습니다.
ru: Форвардное заявление-это путь к успеху.
zh_cn: 转发声明是一种方式。

source: He is not just saying "put forward declarations into a separate header". He says that you have to spilt class definition headers and inline function definitions into different header files to allow "defered dependencies".
es: No sólo dice "presentar las declaraciones en un encabezado separado".Dice que hay que verter los encabezados de definición de clase y las definiciones de funciones en línea en diferentes archivos de encabezado para permitir "dependencias diferidas".
ja: 彼が言っているのは、単に「宣言を別のヘッダに入れろ」ということではありません。クラス定義ヘッダとインライン関数定義を別のヘッダファイルにスポイルして、「ディフェードされた依存関係」を可能にすると言っています。
ko: 그는 단순히 선언을 "별도의 헤더에 넣습니다"라고 말하는 것이 아닙니다. 그는 "지연된 의존성"을 허용하기 위해 클래스 정의 헤더와 인라인 함수 정의를 다른 헤더 파일에 쏟아야한다고 말했다.
ru: Он не просто говорит "выдвигать декларации в отдельный заголовок".Он говорит,что нужно проливать заголовки определений классов и встроенные определения функций в различные заголовочные файлы,чтобы разрешить "отложенные зависимости".
zh_cn: 他并不是说 "把转发声明放到一个单独的头文件中"。他说,你必须把类定义头和内联函数定义分到不同的头文件中去,这样才能实现 "递延依赖"。

source: Here is the solution for templates: <a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">How to handle circular dependencies with templates</a>
es: Aqu&iacute; est&aacute; la soluci&oacute;n para las plantillas: <a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">C&oacute;mo manejar dependencias circulares con plantillas</a>
ja: テンプレートのソリューションは次のとおりです。テンプレート<a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">を使用して循環依存関係を処理する方法</a>
ko: 템플릿 솔루션은 다음과 같습니다. 템플릿 <a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">을 사용하여 순환 종속성을 처리하는 방법</a>
ru: Вот решение для шаблонов: <a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">Как обрабатывать циклические зависимости с помощью шаблонов</a>
zh_cn: 这是模板的解决方案： <a href="https://studiofreya.com/cpp/how-to-handle-circular-dependencies-with-templates-in-c/">如何使用模板处理循环依赖关系</a>

source: Here's how you can do this, exactly retaining all the details, and usability:
es: Así es como se puede hacer esto,conservando exactamente todos los detalles,y la usabilidad:
ja: ここでは、正確にすべての詳細を保持し、使いやすさを実現する方法をご紹介します。
ko: 모든 세부 사항과 유용성을 정확하게 유지 하면서이 작업을 수행하는 방법은 다음과 같습니다.
ru: Вот как это можно сделать,точно сохранив все детали и удобство использования:
zh_cn: 下面我们来看看如何做到这一点,准确地保留了所有的细节,以及可用性。

source: How can I create two classes that both know about each other?
es: ¿Cómo puedo crear dos clases que se conozcan entre sí?
ja: お互いに知っている2つのクラスを作るにはどうしたらいいですか?
ko: 서로에 대해 알고있는 두 개의 클래스를 어떻게 만들 수 있습니까?
ru: Как создать два класса,которые оба знают друг о друге?
zh_cn: 如何才能建立两个班级都知道的班级?

source: I often find myself in a situation where I am facing multiple compilation/linker errors in a C++ project due to some bad design decisions (made by someone else :) ) which lead to circular dependencies between C++ classes in different header files <em>(can happen also in the same file)</em>. But fortunately(?) this doesn't happen often enough for me to remember the solution to this problem for the next time it happens again.
es: A menudo me encuentro en una situaci&oacute;n en la que me enfrento a m&uacute;ltiples errores de compilaci&oacute;n / enlazador en un proyecto C ++ debido a algunas malas decisiones de dise&ntilde;o (hechas por otra persona :)) que conducen a dependencias circulares entre las clases C ++ en diferentes archivos de encabezado <em>(tambi&eacute;n puede ocurrir en el mismo archivo)</em> . Pero afortunadamente (?) Esto no sucede con la frecuencia suficiente para recordar la soluci&oacute;n de este problema la pr&oacute;xima vez que vuelva a ocurrir.
ja: 異なるヘッダーファイル内のC ++クラス間の循環依存関係につながる（他の誰かが行った）いくつかの悪い設計決定が原因で、C ++プロジェクトで複数のコンパイル/リンカーエラーに直面している状況にしばしば気づきます<em>（また、発生する可能性があります）同じファイル内）</em> 。 しかし、幸いにも（？）この問題は頻繁に発生するわけではないので、次に問題が発生したときのために、この問題の解決策を思い出すことはできません。
ko: 다른 헤더 파일의 C ++ 클래스간에 순환 종속성을 유발하는 일부 잘못된 디자인 결정 (다른 사람이 만든)으로 인해 C ++ 프로젝트에서 여러 컴파일 / 링커 오류에 직면하는 상황에서 종종 나 자신을 발견합니다. <em>같은 파일에)</em> . 그러나 다행히 (?) 이것은 다음에 다시 발생할 때이 문제에 대한 해결책을 기억하기에 충분하지 않습니다.
ru: Я часто нахожусь в ситуации, когда я сталкиваюсь с множественными ошибками компиляции / компоновки в проекте C ++ из-за некоторых неудачных проектных решений (принятых кем-то другим :)), которые приводят к циклическим зависимостям между классами C ++ в различных заголовочных файлах <em>(также может произойти в том же файле)</em> . Но, к счастью (?), Это происходит не так часто, чтобы я мог вспомнить решение этой проблемы, когда в следующий раз это случится снова.
zh_cn: 我经常遇到这样的情况：由于一些错误的设计决策（由其他人做出的:)，我在C ++项目中遇到多个编译/链接器错误，这导致不同头文件中C ++类之间的循环依赖<em>（也可能发生）在同一文件中）</em> 。 但是幸运的是（？）发生的次数不够多，以至于我下次再次遇到该问题时仍记得该问题的解决方案。

source: I once solved this kind of problem by moving all <em>inlines</em> after the class definition and putting the <code>#include</code> for the other classes just before the <em>inlines</em> in the header file. This way one make sure all definitions+inlines are set prior the inlines are parsed.
es: Una vez resolv&iacute; este tipo de problema moviendo todas las <em>l&iacute;neas en l&iacute;nea</em> despu&eacute;s de la definici&oacute;n de la clase y colocando el <code>#include</code> para las otras clases justo antes de las <em>l&iacute;neas</em> en el archivo de encabezado. De esta forma, aseg&uacute;rese de que todas las definiciones + l&iacute;neas est&eacute;n establecidas antes de analizar las l&iacute;neas.
ja: 私はかつてこの種の問題を、クラス定義の後にすべての<em>インラインを</em>移動し、ヘッダーファイルの<em>インラインの</em>直前に他のクラスの <code>#include</code> を配置することで解決しました。 このようにして、インラインが解析される前に、すべての定義とインラインが設定されていることを確認します。
ko: 클래스 정의 후 모든 <em>인라인</em> 을 이동하고 헤더 파일의 <em>인라인</em> 바로 앞에 다른 클래스의 <code>#include</code> 를 넣어서 이런 종류의 문제를 해결했습니다. 이렇게하면 인라인을 구문 분석하기 전에 모든 정의 + 인라인을 설정해야합니다.
ru: Однажды я решил эту проблему, переместив все <em>строки</em> после определения класса и поместив <code>#include</code> для других классов непосредственно перед <em>строками</em> в заголовочном файле. Таким образом, убедитесь, что все определения + строки заданы до анализа строк.
zh_cn: 我曾经通过将所有内<em>联</em>移动到类定义之后并将其他类的 <code>#include</code> 放在头文件中的内<em>联</em>之前来解决这种问题。 这样一来，可以确保在解析内联之前设置所有定义+内联。

source: I've written a post about this once: <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">Resolving circular dependencies in c++</a>
es: He escrito una publicaci&oacute;n sobre esto una vez: <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">Resolver dependencias circulares en c ++</a>
ja: 私はこれについて一度投稿しました： <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">C ++での循環依存関係の解決</a>
ko: 나는 이것에 대해 한 번 글을 썼습니다 : <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">C ++에서 순환 종속성 해결</a>
ru: Я написал пост об этом однажды: <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">Разрешение циклических зависимостей в C ++</a>
zh_cn: 我曾经写过一篇关于此的文章： <a href="https://ewirch.github.io/2013/12/resolving-circular-dependencies.html">解决c ++中的循环依赖</a>

source: If A's code has template specialisations / "traits" for the old <code>B</code>, they won't take effect.
es: Si el c&oacute;digo de A tiene especializaciones de plantilla / "rasgos" para el viejo <code>B</code> , no surtir&aacute;n efecto.
ja: Aのコードに古い <code>B</code> のテンプレート特殊化/「特性」がある場合、それらは有効になりません。
ko: A의 코드에 이전 <code>B</code> 에 대한 템플릿 전문화 / "특성"이있는 경우 적용되지 않습니다.
ru: Если код А имеет шаблонные специализации / &laquo;черты&raquo; для старого <code>B</code> , они не вступят в силу.
zh_cn: 如果A的代码具有旧 <code>B</code> 的模板专业化/&ldquo;特征&rdquo;，则它们不会生效。

source: If both classes call functions of the other, you have to move the definitions out.
es: Si ambas clases llaman a las funciones de la otra,hay que sacar las definiciones.
ja: 両方のクラスが他のクラスの関数を呼び出す場合は、定義を外に移動させなければなりません。
ko: 두 클래스가 다른 클래스의 함수를 호출하면 정의를 이동해야합니다.
ru: Если оба класса вызывают функции другого класса,необходимо вывести определения.
zh_cn: 如果两个类都调用对方的函数,就要把定义移出。

source: Imagine you are writing a compiler. And you see code like this.
es: Imagina que estás escribiendo un compilador.Y ves un código como este.
ja: あなたがコンパイラを書いていると想像してください。そして、このようなコードを見たとします。
ko: 컴파일러를 작성한다고 가정하십시오. 그리고 당신은 이와 같은 코드를 볼 수 있습니다.
ru: Представьте,что вы пишете компилятор.И вы видите такой код.
zh_cn: 假设你正在编写一个编译器。而你看到的代码是这样的。

source: In some cases it is possible to <em>define</em> a method or a constructor of class B in the header file of class A to resolve circular dependencies involving definitions. In this way you can avoid having to put definitions in <code>.cc</code> files, for example if you want to implement a header only library.
es: En algunos casos, es posible <em>definir</em> un m&eacute;todo o un constructor de clase B en el archivo de encabezado de clase A para resolver dependencias circulares que impliquen definiciones. De esta forma, puede evitar tener que poner definiciones en archivos <code>.cc</code> , por ejemplo, si desea implementar una biblioteca de solo encabezado.
ja: 場合によっては、クラスAのヘッダーファイルでクラスBのメソッドまたはコンストラクターを定義して、定義に関係する循環依存関係を解決することができます。 このようにして、たとえばヘッダーのみのライブラリを実装したい場合などに、 <code>.cc</code> ファイルに定義を置く必要を回避できます。
ko: 경우에 따라 정의와 관련된 순환 종속성을 해결하기 위해 클래스 A의 헤더 파일에 클래스 B의 메소드 또는 생성자를 정의 할 수 있습니다. 이런 식으로 헤더 전용 라이브러리를 구현하려는 경우와 같이 <code>.cc</code> 파일에 정의를 넣지 않아도됩니다.
ru: В некоторых случаях можно <em>определить</em> метод или конструктор класса B в заголовочном файле класса A для разрешения циклических зависимостей, включающих определения. Таким образом, вы можете избежать необходимости помещать определения в файлы <code>.cc</code> , например, если вы хотите реализовать библиотеку только с заголовками.
zh_cn: 在某些情况下，可以在类A的头文件中<em>定义</em>类B的方法或构造函数，以解决涉及定义的循环依赖关系。 这样，您可以避免将定义放入 <code>.cc</code> 文件中，例如，如果您想实现仅标头的库。

source: It would result in the following code:
es: Resultaría en el siguiente código:
ja: その結果、以下のようなコードになります。
ko: 결과는 다음과 같습니다.
ru: Это приведет к следующему коду:
zh_cn: 这将导致以下代码:

source: Like this
es: Así.
ja: このように
ko: 이렇게
ru: Вот так
zh_cn: 像这样的

source: Note that A_def.h and B_def.h are "private" headers, users of <code>A</code> and <code>B</code> should not use them. The public header is A.h and B.h.
es: Tenga en cuenta que A_def.h y B_def.h son encabezados "privados", los usuarios de <code>A</code> y <code>B</code> no deben usarlos. El encabezado p&uacute;blico es Ah y Bh
ja: A_def.hとB_def.hは「プライベート」ヘッダーなので、 <code>A</code> と <code>B</code> のユーザーはそれらを使用しないでください。 パブリックヘッダーはAhおよびBhです。
ko: A_def.h 및 B_def.h는 "개인"헤더이므로 <code>A</code> 및 <code>B</code> 사용자는 사용하지 않아야합니다. 공개 헤더는 Ah와 Bh입니다.
ru: Обратите внимание, что A_def.h и B_def.h являются &laquo;частными&raquo; заголовками, пользователи <code>A</code> и <code>B</code> не должны их использовать. Публичный заголовок - А и Б
zh_cn: 请注意，A_def.h和B_def.h是&ldquo;专用&rdquo;头， <code>A</code> 和 <code>B</code> 的用户不应使用它们。 公开标头是Ah和Bh

source: Now things are better. Somewhat. <code>main()</code> still says:
es: Ahora las cosas est&aacute;n mejor. Algo. <code>main()</code> todav&iacute;a dice:
ja: 今、物事はより良いです。 幾分。 <code>main()</code> はまだ言います：
ko: 이제 상황이 더 좋습니다. 약간. <code>main()</code> 여전히 말한다 :
ru: Теперь все стало лучше. В некотором роде. <code>main()</code> все еще говорит:
zh_cn: 现在情况变好了。 有些。 <code>main()</code> 仍然说：

source: Order of declaration matters (which is why you are moving out the definitions).
es: El orden de la declaración es importante (por lo que se están moviendo las definiciones).
ja: 申告の順番が重要(だから定義を引っ越すのか
ko: 선언 순서가 중요합니다 (이것이 정의를 옮기는 이유입니다).
ru: Порядок декларирования имеет значение (именно поэтому вы убираете определения).
zh_cn: 申报的顺序很重要(这也是你把定义搬出来的原因)。

source: Poor but common practice: forward declare stuff in other libs
es: Pobre pero común práctica:declarar cosas en otras liberaciones.
ja: 貧しくても一般的な慣習:他の libs にあるものを前方に宣言する
ko: 열악하지만 일반적인 관행 : 다른 라이브러리에서 전달 선언
ru: Плохая,но распространенная практика:форвардные объявления в других либах.
zh_cn: 差劲但常见的做法:在其他lib中转发声明的东西

source: Read the FAQ:
es: Lea las preguntas frecuentes:
ja: よくある質問を読む。
ko: FAQ를 읽으십시오 :
ru: Читайте Часто задаваемые вопросы:
zh_cn: 阅读常见问题。

source: Resolve build errors due to circular dependency amongst classes
es: Resolver los errores de construcción debido a la dependencia circular entre las clases
ja: クラス間の循環的な依存関係によるビルドエラーの解決
ko: 클래스 간의 순환 종속성으로 인한 빌드 오류 해결
ru: Решить ошибки сборки из-за круговой зависимости между классами
zh_cn: 解决由于类之间的循环依赖导致的构建错误。

source: Say - instead of using a forward declaration header as explained above - code in <code>a.h</code> or <code>a.cc</code> instead forward-declares <code>class B;</code> itself:
es: Digamos, en lugar de usar un encabezado de declaraci&oacute;n hacia adelante como se explic&oacute; anteriormente, el c&oacute;digo en <code>a.h</code> o <code>a.cc</code> en su lugar, declara hacia adelante la <code>class B;</code> s&iacute; mismo:
ja: <code>a.cc</code> 、上記で説明したように転送宣言ヘッダーを使用する代わりに、代わりに <code>a.h</code> またはa.ccのコードで <code>class B;</code> 転送宣言します。 自体：
ko: 위에서 설명한 것처럼 순방향 선언 헤더를 사용하는 대신 <code>a.h</code> 또는 <code>a.cc</code> 의 코드는 <code>class B;</code> 대신 선언합니다 . 그 자체:
ru: Скажем - вместо использования заголовка прямого объявления, как объяснено выше - код в <code>a.h</code> или <code>a.cc</code> вместо прямого объявления <code>class B;</code> сам:
zh_cn: 说-而不是如上所述使用前向声明标头-在 <code>a.h</code> 或 <code>a.cc</code> 中的代码代替前向声明 <code>class B;</code> 本身：

source: So for the purposes of easy recall in the future I am going to post a representative problem and a solution along with it. Better solutions are of-course welcome.
es: Así que para facilitar la memoria en el futuro voy a publicar un problema representativo y una solución junto con él.Mejores soluciones son,por supuesto,bienvenidas.
ja: そこで、今後は簡単に思い出すことができるように、代表的な問題とその解決策を掲載していきたいと思います。もちろん、より良い解決策があれば歓迎します。
ko: 앞으로 쉽게 리콜 할 수 있도록 대표적인 문제와 해결 방법을 함께 게시하겠습니다. 더 나은 솔루션은 물론 환영합니다.
ru: Поэтому,чтобы в будущем легко было вспомнить,я поставлю репрезентативную проблему и решение вместе с ней.Лучшие решения,конечно же,приветствуются.
zh_cn: 所以,为了便于日后回忆,我将在此贴出一个有代表性的问题和解决方案。当然也欢迎大家提出更好的解决方案。

source: So let's tell the compiler about <code>B</code>. This is known as a <a href="http://en.cppreference.com/w/cpp/language/class">forward declaration</a>, and is discussed further in <a href="https://stackoverflow.com/a/4757718/391161">this answer</a>.
es: Entonces, hablemos al compilador sobre <code>B</code> . Esto se conoce como <a href="http://en.cppreference.com/w/cpp/language/class">declaraci&oacute;n adelantada</a> , y se trata m&aacute;s adelante en <a href="https://stackoverflow.com/a/4757718/391161">esta respuesta</a> .
ja: それでは、コンパイラーに <code>B</code> について伝えましょう。 これは<a href="http://en.cppreference.com/w/cpp/language/class">前方宣言</a>と呼ばれ、 <a href="https://stackoverflow.com/a/4757718/391161">この回答で</a>さらに説明されています 。
ko: 컴파일러에게 <code>B</code> 에 대해 이야기합시다. 이것을 <a href="http://en.cppreference.com/w/cpp/language/class">순방향 선언</a> 이라고 하며이 <a href="https://stackoverflow.com/a/4757718/391161">답변</a> 에서 자세히 설명합니다.
ru: Итак, давайте расскажем компилятору о <code>B</code> . Это известно как предварительная <a href="http://en.cppreference.com/w/cpp/language/class">декларация</a> и обсуждается далее в <a href="https://stackoverflow.com/a/4757718/391161">этом ответе</a> .
zh_cn: 因此，让我们告诉编译器有关 <code>B</code> 的信息 。 这称为<a href="http://en.cppreference.com/w/cpp/language/class">前向声明</a> ，并将在<a href="https://stackoverflow.com/a/4757718/391161">此答案中进行</a>进一步讨论。

source: The basic technique is to decouple the classes using interfaces. So in your case:
es: La técnica básica consiste en desacoplar las clases mediante interfaces.Así que en tu caso:
ja: 基本的なテクニックは、インターフェースを使ってクラスを分離することです。だから、あなたの場合は
ko: 기본 기술은 인터페이스를 사용하여 클래스를 분리하는 것입니다. 따라서 귀하의 경우 :
ru: Основная методика заключается в развязывании классов с помощью интерфейсов.Так что в вашем случае:
zh_cn: 基本的技巧是使用接口解耦类。所以在你的情况下。
