Repository: rueisnom/feedback
Catalog: xlf/62/57/99/625799.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The clue to solving this problem is to declare both classes before providing the definitions (implementations). It&rsquo;s not possible to split the declaration and definition into separate files, but you can structure them as if they were in separate files.
es: La clave para resolver este problema es declarar ambas clases antes de proporcionar las definiciones (implementaciones). No es posible dividir la declaraci&oacute;n y la definici&oacute;n en archivos separados, pero puede estructurarlos como si estuvieran en archivos separados.
ja: この問題を解決する手がかりは、定義（実装）を提供する前に両方のクラスを宣言することです。 宣言と定義を別々のファイルに分割することはできませんが、それらを別々のファイルにあるかのように構成できます。
ko: 이 문제를 해결하는 단서는 정의 (구현)를 제공하기 전에 두 클래스를 모두 선언하는 것입니다. 선언과 정의를 별도의 파일로 분할 할 수는 없지만 마치 별도의 파일에있는 것처럼 구성 할 수 있습니다.
ru: Ключом к решению этой проблемы является объявление обоих классов перед предоставлением определений (реализаций). Невозможно разделить объявление и определение на отдельные файлы, но вы можете структурировать их, как если бы они были в отдельных файлах.
zh_cn: 解决此问题的线索是在提供定义（实现）之前先声明两个类。 不可能将声明和定义拆分到单独的文件中，但是您可以像在单独的文件中一样构造它们。

source: The down side of the following solution is (assuming that you had placed the methods in the header file to inline them) that the methods are no longer inlined by the compiler and trying to use the inline keyword produces linker errors.
es: El lado negativo de la siguiente solución es (suponiendo que se hubieran colocado los métodos en el archivo de cabecera para ponerlos en línea)que los métodos ya no están alineados por el compilador y tratar de utilizar la palabra clave en línea produce errores de enlazador.
ja: 以下の解決策の欠点は、(メソッドをインライン化するためにヘッダファイルにメソッドを配置したと仮定して)コンパイラによってメソッドがインライン化されなくなり、インラインキーワードを使用しようとするとリンカエラーが発生することです。
ko: 다음 솔루션의 단점은 메소드가 더 이상 컴파일러에 의해 인라인되지 않고 인라인 키워드를 사용하려고하면 링커 오류가 발생한다는 것입니다 (헤더 파일에 메소드를 인라인하기 위해 가정 한 경우).
ru: Недостатком следующего решения является то (предполагая,что вы поместили методы в заголовочный файл для встраивания в него),что методы больше не встраиваются компилятором,и попытка использовать ключевое слово встраивания приводит к ошибкам компоновщика.
zh_cn: 下面这个解决方案的缺点是(假设你在头文件中放置了方法来内联的方法),编译器不再对这些方法进行内联,并且试图使用内联关键字会产生链接器错误。

source: The maintainers of the <code>A</code> and <code>B</code> libraries should each be responsible for keeping their forward declaration headers in sync with their headers and implementation files, so - for example - if the maintainer of "B" comes along and rewrites the code to be...
es: Los mantenedores de las bibliotecas <code>A</code> y <code>B</code> deben ser responsables de mantener sincronizados sus encabezados de declaraci&oacute;n hacia adelante con sus encabezados y archivos de implementaci&oacute;n, por lo tanto, por ejemplo, si aparece el mantenedor de "B" y reescribe el c&oacute;digo para ser ...
ja: <code>A</code> および <code>B</code> ライブラリのメンテナーは、それぞれのフォワード宣言ヘッダーをヘッダーおよび実装ファイルと同期させる責任があります。たとえば、「B」のメンテナーがやって来て、コードを次のように書き換えた場合...
ko: <code>A</code> 및 <code>B</code> 라이브러리의 관리자는 각각 자신의 전달 선언 헤더를 헤더 및 구현 파일과 동기화하는 책임을 져야합니다. 예를 들어, "B"의 관리자가 와서 코드를 다시 작성하는 경우 ...
ru: Каждый из сопровождающих библиотек <code>A</code> и <code>B</code> должен отвечать за синхронизацию заголовков прямого объявления со своими заголовками и файлами реализации, например, если сопровождающий &laquo;B&raquo; придет и переписает код, чтобы он был ...
zh_cn: <code>A</code> 和 <code>B</code> 库的维护者应各自负责使其前向声明标头与其标头和实现文件保持同步，因此-例如-如果&ldquo; B&rdquo;的维护者来了并将其重写为...

source: The reason this fix is bad is because the next person to <code>#include "A.h"</code> will have to declare <code>B</code> before they can use it and will get a terrible <code>#include</code> error. So let's move the declaration into <strong>A.h</strong> itself.
es: La raz&oacute;n por la que esta soluci&oacute;n es mala es porque la siguiente persona que <code>#include "A.h"</code> tendr&aacute; que declarar <code>B</code> antes de que pueda usarla y obtendr&aacute; un terrible <code>#include</code> error de inclusi&oacute;n . As&iacute; que pasemos la declaraci&oacute;n al <strong>Ah</strong> mismo.
ja: この修正が悪い理由は、 <code>#include "A.h"</code> 次の人が <code>B</code> を使用する前にBを宣言する必要があり、ひどい <code>#include</code> エラーが発生するためです。 それでは、宣言を<strong>Ah</strong>自体に移しましょう。
ko: 이 수정이 잘못된 이유는 다음 <code>#include "A.h"</code> 가 <code>B</code> 를 사용하기 전에 B 를 선언해야하므로 <code>#include</code> 오류가 끔찍하기 때문입니다. 선언을 <strong>Ah</strong> 자체로 옮깁니다.
ru: Причина, по которой это исправление плохое, заключается в том, что следующий человек, который <code>#include "A.h"</code> должен будет объявить <code>B</code> , прежде чем сможет его использовать, и получит ужасную ошибку <code>#include</code> . Итак, давайте перенесем декларацию в себя.
zh_cn: 此修补程序不好的原因是，下一个 <code>#include "A.h"</code> 将必须声明 <code>B</code> 才能使用它，并且会出现严重的 <code>#include</code> 错误。 因此，让我们将声明移到<strong>Ah</strong>本身。

source: The simple example presented on Wikipedia worked for me. (you can read the complete description at <a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B</a> )
es: El simple ejemplo presentado en Wikipedia funcion&oacute; para m&iacute;. (puede leer la descripci&oacute;n completa en <a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B</a> )
ja: ウィキペディアで紹介されている簡単な例は私のために働いた。 （完全な説明は<a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B</a>で読むことができます）
ko: Wikipedia에 제시된 간단한 예가 저에게 효과적이었습니다. ( <a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B</a> 에서 전체 설명을 읽을 수 있습니다)
ru: Простой пример, представленный в Википедии, работал на меня. (вы можете прочитать полное описание на <a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B</a> )
zh_cn: Wikipedia上提供的简单示例为我工作。 （您可以在<a href="http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B">http://en.wikipedia.org/wiki/Circular_dependency#Example_of_circular_dependencies_in_C.2B.2B中</a>阅读完整的说明）

source: The way to think about this is to "think like a compiler".
es: La forma de pensar en esto es "pensar como un compilador".
ja: その考え方は、「コンパイラのように考える」ということです。
ko: 이것을 생각하는 방법은 "컴파일러처럼 생각하는 것"입니다.
ru: Думать об этом нужно "думать как компилятор".
zh_cn: 思考的方法是 "像编译器一样思考"。

source: Things to remember:
es: Cosas para recordar:
ja: 覚えておくべきこと
ko: 기억해야 할 것 :
ru: Вещи,которые нужно запомнить:
zh_cn: 要记住的事情。

source: This <em>works</em>. It is not <em>great</em>. But at this point you should have an understanding of the circular reference problem and what we did to "fix" it, albeit the fix is bad.
es: Esto <em>funciona</em> No es <em>genial</em> Pero en este punto debe comprender el problema de referencia circular y lo que hicimos para "solucionarlo", aunque la soluci&oacute;n es mala.
ja: これで<em>うまくいき</em>ます。 よくないです。 しかし、この時点で、循環参照の問題と、それが「修正」されたものの、修正が悪いにもかかわらず、それを理解したはずです。
ko: 이 <em>작동합니다</em> . <em>대단</em> 하지 않습니다. 그러나이 시점에서 순환 참조 문제와 문제를 "수정"하기 위해 수행 한 조치를 이해해야합니다.
ru: Это <em>работает</em> Это не <em>здорово</em> . Но в этот момент у вас должно быть понимание проблемы циклических ссылок и того, что мы сделали, чтобы &laquo;исправить&raquo; ее, хотя это и исправление плохо.
zh_cn: 这<em>有效</em> 。 这不是<em>很好</em> 。 但是在这一点上，您应该已经了解了循环引用问题以及我们为修复此问题所做的工作，尽管修复效果很差。

source: This code does not compile because B::Do needs a complete type of A which is defined later.
es: Este código no compila porque B::Do necesita un tipo completo de A que se define más tarde.
ja: B::Do は後に定義される A の完全な型を必要とするため、このコードはコンパイルされません。
ko: 이 코드는 B :: Do에 나중에 정의 된 완전한 유형의 A가 필요하기 때문에 컴파일되지 않습니다.
ru: Этот код не компилируется,потому что B::Do нужен полный тип A,который будет определен позже.
zh_cn: 这段代码无法编译,因为B:::Do需要一个完整的A的类型,而A的类型将在后面定义。

source: This directive should defer the processing of the current file and complete all pending includes.
es: Esta directiva debería aplazar la tramitación del expediente actual y completar todos los expedientes pendientes.
ja: このディレクティブは、現在のファイルの処理を延期して、 保留中のすべてのインクルードを完了させなければなりません。
ko: 이 지시문은 현재 파일 처리를 지연시키고 보류중인 모든 포함을 완료해야합니다.
ru: Эта директива должна отложить обработку текущего файла и завершить все отложенные включения.
zh_cn: 此指令应推迟处理当前文件,并完成所有待处理的包括。

source: This is exactly possible with these two header files for each class wich needs to define inline functions. The only issue is that the circular classes can't just include the "public header".
es: Esto es exactamente posible con estos dos archivos de encabezamiento para cada clase que necesita definir funciones en línea.El único problema es que las clases circulares no pueden incluir sólo el "encabezado público".
ja: これは、インライン関数を定義する必要がある各クラスのためのこれら2つのヘッダファイルで正確に可能です。唯一の問題は、サーキュラー・クラスが単に "パブリック・ヘッダー "をインクルードできないことです。
ko: 각 클래스마다이 두 헤더 파일을 사용하면 인라인 함수를 정의해야합니다. 유일한 문제는 순환 클래스가 "공개 헤더"만 포함 할 수 없다는 것입니다.
ru: Это точно возможно с этими двумя заголовочными файлами для каждого класса,которым необходимо определить inline функции.Единственная проблема заключается в том,что циклические классы не могут просто включать "публичный заголовок".
zh_cn: 这完全可以通过每个需要定义内联函数的类的这两个头文件来实现。唯一的问题是,循环类不能只包含 "公共头文件"。

source: This simple code would not work:
es: Este simple código no funcionaría:
ja: この単純なコードではうまくいきません。
ko: 이 간단한 코드는 작동하지 않습니다.
ru: Этот простой код не сработает:
zh_cn: 这个简单的代码是不行的。

source: This won't work if <code>class A</code> has an object of <code>class B</code> as a member or vice versa.
es: Esto no funcionar&aacute; si la <code>class A</code> tiene un objeto de la <code>class B</code> como miembro o viceversa.
ja: <code>class A</code> が <code>class B</code> オブジェクトをメンバーとして持っている場合、またはその逆の場合、これは機能しません。
ko: <code>class A</code> 에 <code>class B</code> 의 개체가 멤버이거나 그 반대의 경우에는 작동하지 않습니다.
ru: Это не будет работать, если <code>class A</code> имеет объект <code>class B</code> в качестве члена или наоборот.
zh_cn: 如果 <code>class A</code> <code>class B</code> 类的对象作为成员，反之亦然。

source: To make sure that it compiles the source code should look like this:
es: Para asegurarse de que compila el código fuente debería verse así:
ja: ソースコードがコンパイルされていることを確認するには、次のようにします。
ko: 소스 코드를 컴파일했는지 확인하려면 다음과 같아야합니다.
ru: Чтобы убедиться,что он компилирует исходный код должен выглядеть так:
zh_cn: 为了确保它编译的源码应该是这样的。

source: To solve this issue I would like to suggest a preprocessor extension: <code>#pragma process_pending_includes</code>
es: Para resolver este problema, me gustar&iacute;a sugerir una extensi&oacute;n de preprocesador: <code>#pragma process_pending_includes</code>
ja: この問題を解決するために、プリプロセッサ拡張機能を提案し <code>#pragma process_pending_includes</code> 。 #pragma process_pending_includes
ko: 이 문제를 해결하려면 전 처리기 확장을 제안하고 싶습니다. <code>#pragma process_pending_includes</code>
ru: Чтобы решить эту проблему, я хотел бы предложить расширение препроцессора: <code>#pragma process_pending_includes</code>
zh_cn: 为了解决此问题，我想建议一个预处理程序扩展： <code>#pragma process_pending_includes</code>

source: To understand it better imagine that class A has a field of type B not B*. In addition class A and B want to define an inline function with parameters of the other type:
es: Para entenderlo mejor,imagina que la clase A tiene un campo de tipo B,no B*.Además la clase A y B quieren definir una función en línea con parámetros del otro tipo:
ja: これを理解するには、クラスAがB*ではなくB型のフィールドを持っていると想像してください。さらに、クラスAとBは、もう一方の型のパラメータを持つインライン関数を定義したいと考えています。
ko: 클래스 A가 B가 아닌 B 유형의 필드를 가지고 있다고 더 잘 이해하려면. 또한 클래스 A와 B는 다른 유형의 매개 변수로 인라인 함수를 정의하려고합니다.
ru: Чтобы понять это,лучше представить себе,что класс A имеет поле типа B,а не B*.Кроме того,класс A и B хотят определить inline функцию с параметрами другого типа:
zh_cn: 为了更好地理解它,想象一下,类A有一个类型为B的字段,而不是B*。此外,类A和类B想定义一个内联函数,参数为另一个类型的参数。

source: Unfortunately I can't comment the answer from geza.
es: Desafortunadamente no puedo comentar la respuesta de Geza.
ja: 残念ながらゲザからの回答はコメントできません。
ko: 불행히도 나는 geza의 답변을 말할 수 없습니다.
ru: К сожалению,я не могу прокомментировать ответ Гезы.
zh_cn: 不幸的是,我不能评论Geza的答案。

source: Unfortunately, all the previous answers are missing some details. The correct solution is a little bit cumbersome, but this is the only way to do it properly. And it scales easily, handles more complex dependencies as well.
es: Desafortunadamente,a todas las respuestas anteriores les faltan algunos detalles.La solución correcta es un poco engorrosa,pero es la única manera de hacerlo correctamente.Y se escala fácilmente,también maneja dependencias más complejas.
ja: 残念ながら、これまでの解答はどれも細かい部分が欠けています。正解は少し面倒ですが、これが唯一の正しい方法です。そして、それは簡単にスケーリングし、より複雑な依存関係も同様に処理します。
ko: 불행히도, 이전의 모든 답변에 일부 세부 정보가 누락되었습니다. 올바른 해결책은 약간 성가 시지만 이것이 제대로하는 유일한 방법입니다. 또한 쉽게 확장되고 더 복잡한 종속성도 처리합니다.
ru: К сожалению,во всех предыдущих ответах не хватает некоторых деталей.Правильное решение немного громоздко,но это единственный способ сделать это правильно.И оно легко масштабируется,справляется и с более сложными зависимостями.
zh_cn: 遗憾的是,之前的答案中都缺少了一些细节问题。正确的解决方案是有点麻烦,但只有这样做才是正确的方法。而且它很容易扩展,处理更复杂的依赖关系也很好。

source: What special considerations are needed when forward declarations are used with inline functions?
es: ¿Qué consideraciones especiales se necesitan cuando se utilizan declaraciones anticipadas con funciones en línea?
ja: インライン関数でフォワード宣言を使用する場合、どのような特別な配慮が必要ですか?
ko: 인라인 함수와 함께 전방 선언을 사용할 때 어떤 특별한 고려 사항이 필요합니까?
ru: Какие особые соображения необходимо учитывать при использовании прямых деклараций с встраиваемыми функциями?
zh_cn: 前向声明与内联函数一起使用时,有哪些特殊的注意事项?

source: What special considerations are needed when forward declarations are used with member objects?
es: ¿Qué consideraciones especiales se necesitan cuando se utilizan declaraciones anticipadas con objetos de los miembros?
ja: メンバ・オブジェクトでフォワード宣言を使用する場合、どのような特別な配慮が必要ですか?
ko: 멤버 선언에 순방향 선언을 사용할 때 어떤 특별한 고려 사항이 필요합니까?
ru: Какие особые соображения необходимо учитывать при использовании форвардных заявлений с объектами членов?
zh_cn: 前向声明与成员对象一起使用时,有哪些特殊的注意事项?

source: When you are compiling the <strong>.cc</strong> file (remember that the <strong>.cc</strong> and not the <strong>.h</strong> is the unit of compilation), you need to allocate space for object <code>A</code>. So, well, how much space then? Enough to store <code>B</code>! What's the size of <code>B</code> then? Enough to store <code>A</code>! Oops.
es: Cuando est&aacute; compilando el archivo <strong>.cc</strong> (recuerde que el <strong>.cc</strong> y no el <strong>.h</strong> es la unidad de compilaci&oacute;n), debe asignar espacio para el objeto <code>A</code> . Entonces, &iquest;cu&aacute;nto espacio entonces? Suficiente para almacenar <code>B</code> ! &iquest;Cu&aacute;l es el tama&ntilde;o de <code>B</code> entonces? Suficiente para almacenar <code>A</code> ! Ups
ja: <strong>.cc</strong>ファイルをコンパイルするとき（ <strong>.h</strong>ではなく<strong>.cc</strong>がコンパイルの単位であることを忘れないでください）、オブジェクト <code>A</code> にスペースを割り当てる必要があります。 それで、それでは、どのくらいのスペースがあるのでしょうか？ <code>B</code> を格納するのに十分です！ では、 <code>B</code> のサイズは？ <code>A</code> を保存するのに十分です！ おっとっと。
ko: <strong>.cc</strong> 파일을 컴파일 할 때 ( <strong>.h</strong> 가 아닌 <strong>.cc</strong> 는 컴파일 단위임을 기억하십시오) 오브젝트 <code>A</code> 에 공간을 할당해야합니다. 그렇다면 공간이 얼마나됩니까? <code>B</code> 를 저장하기에 충분합니다! 그렇다면 <code>B</code> 의 크기는 얼마입니까? <code>A</code> 를 저장하기에 충분합니다! 죄송합니다.
ru: Когда вы компилируете файл <strong>.cc</strong> (помните, что <strong>.cc,</strong> а не <strong>.h</strong> - это единица компиляции), вам нужно выделить место для объекта <code>A</code> . Итак, сколько же тогда места? Хватит хранить <code>B</code> ! Каков размер <code>B</code> тогда? Хватит хранить <code>A</code> ! К сожалению.
zh_cn: 在编译<strong>.cc</strong>文件时（请记住， <strong>.cc</strong>而不是<strong>.h</strong>是编译单元），需要为对象 <code>A</code> 分配空间。 那么，那么多少空间呢？ 足够存储 <code>B</code> 了 ！ 那么 <code>B</code> 的大小是多少？ 足以存储 <code>A</code> ！ 哎呀

source: You can avoid compilation errors if you remove the method definitions from the header files and let the classes contain only the method declarations and variable declarations/definitions. The method definitions should be placed in a .cpp file (just like a best practice guideline says).
es: Puede evitar errores de compilación si elimina las definiciones de los métodos de los archivos de cabecera y deja que las clases contengan sólo las declaraciones de los métodos y las definiciones de las declaraciones de las variables.Las definiciones de los métodos deben ser colocadas en un archivo .cpp (tal como dice una guía de buenas prácticas).
ja: ヘッダファイルからメソッドの定義を削除して、メソッド宣言と変数宣言の定義だけをクラスに含ませるとコンパイルエラーを避けることができます。メソッドの定義は .cpp ファイルに置くべきです (ベストプラクティスのガイドラインに書かれているように)。
ko: 헤더 파일에서 메소드 정의를 제거하고 클래스에 메소드 선언 및 변수 선언 / 정의 만 포함 시키도록하면 컴파일 오류를 피할 수 있습니다. 분석법 정의는 모범 사례 지침과 같이 .cpp 파일에 배치해야합니다.
ru: Ошибок компиляции можно избежать,если удалить определения методов из заголовочных файлов и позволить классам содержать только объявления методов и определения переменных.Определения методов должны быть помещены в .cpp-файл (так же,как сказано в руководстве по лучшей практике).
zh_cn: 如果你把方法定义从头文件中删除,让类只包含方法声明和变量声明definitions,就可以避免编译错误。方法定义应该放在一个.cpp文件中(就像最佳实践指南所说的那样)。

source: You can break it by allowing the compiler to instead reserve as much space as it knows about upfront - pointers and references, for example, will always be 32 or 64 bits (depending on the architecture) and so if you replaced (either one) by a pointer or reference, things would be great. Let's say we replace in <code>A</code>:
es: Puede romperlo permitiendo que el compilador reserve en su lugar tanto espacio como sabe sobre el principio: los punteros y las referencias, por ejemplo, siempre ser&aacute;n de 32 o 64 bits (dependiendo de la arquitectura) y, por lo tanto, si lo reemplaza (cualquiera de ellos) por un puntero o referencia, las cosas ser&iacute;an geniales. Digamos que reemplazamos en <code>A</code> :
ja: コンパイラが前もって知っている限り多くのスペースを代わりに予約することを許可することでそれを壊すことができます-たとえば、ポインタと参照は常に32または64ビット（アーキテクチャによって異なります）なので、（いずれか1つ）をポインタまたは参照、物事は素晴らしいでしょう。 <code>A</code> で置き換えるとしましょう：
ko: 예를 들어, 컴파일러는 선행 아키텍처에 대해 알고있는만큼 많은 공간을 예약하여이를 깨뜨릴 수 있습니다. 예를 들어, 아키텍처 및 아키텍처에 따라 포인터 및 참조는 항상 32 비트 또는 64 비트입니다. 포인터 나 참조, 일이 좋을 것입니다. <code>A</code> 로 대체한다고 가정 해 봅시다.
ru: Вы можете сломать его, позволив компилятору зарезервировать столько места, сколько он знает о начальном этапе - например, указатели и ссылки всегда будут 32 или 64 битами (в зависимости от архитектуры), и поэтому, если вы заменили (любой из них) на указатель или ссылка, все было бы здорово. Допустим, мы заменим в <code>A</code> :
zh_cn: 您可以通过允许编译器保留预知的最大空间来破坏它-例如，指针和引用将始终为32位或64位（取决于体系结构），因此如果您将（替换为）指针或参考，事情会很棒。 假设我们替换为 <code>A</code> ：

source: You can see why the compiler can't deal with this - it has no idea what <code>B</code> is - it has never even seen the symbol before.
es: Puede ver por qu&eacute; el compilador no puede lidiar con esto, no tiene idea de qu&eacute; es <code>B</code> , nunca antes hab&iacute;a visto el s&iacute;mbolo.
ja: コンパイラがこれを処理できない理由がわかります <code>B</code> が何であるかはわかりません。以前にシンボルを見たこともありません。
ko: 컴파일러가 이것을 처리 할 수없는 이유를 알 수 있습니다. <code>B</code> 가 무엇인지 전혀 모릅니다. 이전에는이 ​​기호를 본 적이 없습니다.
ru: Вы можете понять, почему компилятор не может справиться с этим - он понятия не имеет, что такое <code>B</code> , - он никогда даже не видел символ раньше.
zh_cn: 您可以看到为什么编译器无法处理这个问题-它不知道 <code>B</code> 是什么-之前从未见过该符号。

source: build tools relying on <code>#include</code> analysis and changed file timestamps won't rebuild <code>A</code> (and its further-dependent code) after the change to B, causing errors at link time or run time. If B is distributed as a runtime loaded DLL, code in "A" may fail to find the differently-mangled symbols at runtime, which may or may not be handled well enough to trigger orderly shutdown or acceptably reduced functionality.
es: las herramientas de compilaci&oacute;n que se basan en el an&aacute;lisis <code>#include</code> y las marcas de tiempo modificadas del archivo no reconstruir&aacute;n <code>A</code> (y su c&oacute;digo dependiente adicional) despu&eacute;s del cambio a B, causando errores en el momento del enlace o en el tiempo de ejecuci&oacute;n. Si B se distribuye como una DLL cargada en tiempo de ejecuci&oacute;n, el c&oacute;digo en "A" puede fallar al encontrar los s&iacute;mbolos de diferente manera en tiempo de ejecuci&oacute;n, que pueden o no manejarse lo suficientemente bien como para desencadenar el apagado ordenado o una funcionalidad aceptablemente reducida.
ja: <code>#include</code> 分析と変更されたファイルのタイムスタンプに依存するビルドツールは、Bへの変更後に <code>A</code> （およびその依存コード）を再ビルドしないため、リンク時または実行時にエラーが発生します。 BがランタイムロードされたDLLとして配布される場合、「A」のコードは実行時に異なるマングルされたシンボルを見つけられない可能性があります。
ko: <code>#include</code> 분석 및 변경된 파일 타임 스탬프에 의존하는 빌드 도구는 B로 변경 한 후 <code>A</code> (및 추가 종속 코드)를 다시 빌드하지 않으므로 링크 타임 또는 런타임시 오류가 발생합니다. B가 런타임로드 된 DLL로 배포 된 경우 "A"의 코드는 런타임에 다르게 얽힌 기호를 찾지 못할 수 있습니다.이 기호는 순서대로 종료되거나 기능이 상당히 저하 될 정도로 충분히 처리되지 않을 수 있습니다.
ru: Инструменты сборки, основанные на анализе <code>#include</code> и измененных временных метках файлов, не будут перестраивать <code>A</code> (и его дополнительный зависимый код) после изменения на B, вызывая ошибки во время соединения или выполнения. Если B распространяется как библиотека, загруженная во время выполнения, код в &laquo;A&raquo; может не найти символы с различными искажениями во время выполнения, что может или не может быть обработано достаточно хорошо, чтобы вызвать упорядоченное завершение работы или приемлемо сниженную функциональность.
zh_cn: 依赖 <code>#include</code> 分析和更改的文件时间戳的构建工具在将B更改为B之后，将不会重建 <code>A</code> （及其进一步相关的代码），从而在链接时或运行时导致错误。 如果将B作为运行时加载的DLL分发，则&ldquo; A&rdquo;中的代码可能无法在运行时找到不同角度的符号，这可能会或可能不会得到足够好的处理以触发有序关闭或可接受的功能降低。

source: compilation of A will terminate with an error once it gets to the conflicting declaration/definition of <code>B</code> (i.e. the above change to B broke A and any other clients abusing forward declarations, instead of working transparently).
es: la compilaci&oacute;n de A terminar&aacute; con un error una vez que llegue a la declaraci&oacute;n / definici&oacute;n conflictiva de <code>B</code> (es decir, el cambio anterior a B rompi&oacute; A y cualquier otro cliente que abusa de las declaraciones hacia adelante, en lugar de trabajar de manera transparente).
ja: Aのコンパイルは、 <code>B</code> の競合する宣言/定義に到達すると、エラーで終了します（つまり、上記のBへの変更により、透過的に動作するのではなく、Aと他のクライアントが前方宣言を悪用しました。
ko: A의 컴파일은 충돌하는 <code>B</code> 의 선언 / 정의에 도달하면 오류로 종료됩니다 (즉, 위의 B 변경으로 인해 A가 투명하게 작동하지 않고 선언을 남용하는 다른 클라이언트가 중단됨).
ru: компиляция A завершится с ошибкой, как только она попадет в конфликтующее объявление / определение <code>B</code> (то есть указанное выше изменение B сломало A и любые другие клиенты, злоупотребляющие предварительными объявлениями, вместо того, чтобы работать прозрачно).
zh_cn: 一旦到达 <code>B</code> 的声明/定义冲突，A的编译将以错误终止（即，对B的上述更改破坏了A且任何其他滥用正向声明的客户，而不是透明地工作）。

source: if <code>a.h</code> or <code>a.cc</code> did include <code>b.h</code> later:
es: si <code>a.h</code> o <code>a.cc</code> incluyeron <code>b.h</code> m&aacute;s tarde:
ja: <code>a.h</code> または <code>a.cc</code> に後で <code>b.h</code> が含まれていた場合：
ko: <code>a.h</code> 또는 <code>a.cc</code> 에 나중에 <code>b.h</code> 가 포함 된 경우 :
ru: если <code>a.h</code> или <code>a.cc</code> включили чч позже:
zh_cn: 如果 <code>a.h</code> 或 <code>a.cc</code> 之后确实包含了 <code>b.h</code> ：

source: inline functions still inline
es: funciones en línea todavía en línea
ja: インライン関数はインラインのまま
ko: 인라인 함수는 여전히 인라인
ru: встроенные функции
zh_cn: 内联功能仍为内联
