Repository: rueisnom/feedback
Catalog: xlf/62/57/99/625799.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: otherwise (if A didn't eventually include <code>b.h</code> - possible if A just stores/passes around Bs by pointer and/or reference)
es: de lo contrario (si A finalmente no incluy&oacute; <code>b.h</code> , posible si A solo almacena / pasa alrededor de Bs por puntero y / o referencia)
ja: それ以外の場合（Aが最終的に <code>b.h</code> 含まなかった場合-Aがポインタまたは参照、あるいはその両方でBsを単に格納/渡す場合に可能）
ko: 그렇지 않으면 (A가 결국 <code>b.h</code> 포함하지 않은 경우-A가 포인터 및 / 또는 참조로 B 주위에 저장 / 전달하는 경우 가능)
ru: в противном случае (если A в конечном итоге не включает <code>b.h</code> - возможно, если A просто хранит / передает Bs по указателю и / или ссылке)
zh_cn: 否则（如果A最终没有包含 <code>b.h</code> 如果A只是通过指针和/或引用在B周围存储/传递，则可能）

source: the solution is exactly the same as originally intended
es: la solución es exactamente la misma que la prevista originalmente
ja: 案の定
ko: 해결책은 원래 의도 한 것과 정확히 동일합니다.
ru: решение точно такое же,как и предполагалось изначально
zh_cn: 一模一样

source: users of <code>A</code> and <code>B</code> can include A.h and B.h in any order
es: Los usuarios de <code>A</code> y <code>B</code> pueden incluir Ah y Bh en cualquier orden
ja: <code>A</code> と <code>B</code> のユーザーは、AhとBhを任意の順序で含めることができます
ko: <code>A</code> 와 <code>B</code> 의 사용자는 순서에 상관없이 Ah와 Bh를 포함 할 수 있습니다
ru: пользователи <code>A</code> и <code>B</code> могут включать Ah и Bh в любом порядке
zh_cn: <code>A</code> 和 <code>B</code> 的用户可以任意顺序包含Ah和Bh
