Repository: rueisnom/feedback
Catalog: xlf/52/25/63/522563.*.001.xlf
Languages: es, ko, ru, zh_cn

source: Python's <a href="https://docs.python.org/2/library/functions.html#enumerate"><code>enumerate</code> function</a> reduces the visual clutter by hiding the accounting for the indexes, and encapsulating the iterable into another iterable (an <code>enumerate</code> object) that yields a two-item tuple of the index and the item that the original iterable would provide. That looks like this:
es: La <a href="https://docs.python.org/2/library/functions.html#enumerate">funci&oacute;n de <code>enumerate</code> </a> de Python reduce el desorden visual al ocultar la contabilidad de los &iacute;ndices y encapsular el iterable en otro iterable (un objeto de <code>enumerate</code> ) que produce una tupla de dos elementos del &iacute;ndice y el elemento que proporcionar&iacute;a el iterable original. Eso se ve as&iacute;:
ko: Python의 <a href="https://docs.python.org/2/library/functions.html#enumerate"> <code>enumerate</code> 함수</a> 는 인덱스에 대한 설명을 숨기고 iterable을 다른 iterable ( <code>enumerate</code> 객체)로 캡슐화하여 인덱스의 두 항목 튜플과 원래 iterable이 제공 할 항목을 생성합니다. 이것은 다음과 같습니다
ru: <a href="https://docs.python.org/2/library/functions.html#enumerate">Функция <code>enumerate</code> </a> Python уменьшает визуальный беспорядок, скрывая учет индексов и инкапсулируя итерируемое в другой итерируемый объект (объект <code>enumerate</code> ), который дает кортеж из двух элементов индекса и элемент, который будет обеспечивать исходная итерация. Это выглядит так:
zh_cn: Python的<a href="https://docs.python.org/2/library/functions.html#enumerate"> <code>enumerate</code> 函数</a>通过隐藏索引的记帐，并将可迭代项封装到另一个可迭代项（ <code>enumerate</code> 对象）中，从而减少了视觉混乱，该另一个可迭代项产生了索引和原始可迭代项将提供的项的两个项目元组。 看起来像这样：

source: See performance metrics for each method below:
es: Vea las métricas de rendimiento para cada método a continuación:
ko: 아래의 각 방법에 대한 성능 지표를 참조하십시오.
ru: См.показатели производительности для каждого метода ниже:
zh_cn: 见下面每种方法的性能指标。

source: So do this:
es: Así que haz esto:
ko: 이렇게하십시오 :
ru: Так сделай это:
zh_cn: 那就这样做吧。

source: That brings us to the <code>start=n</code> switch for <code>enumerate()</code>. This simply offsets the index, you can equivalently simply add a number to the index inside the loop.
es: Eso nos lleva al interruptor <code>start=n</code> para <code>enumerate()</code> . Esto simplemente compensa el &iacute;ndice, de manera equivalente simplemente puede agregar un n&uacute;mero al &iacute;ndice dentro del bucle.
ko: 그러면 <code>enumerate()</code> 대한 <code>start=n</code> 스위치가 나타납니다. 이것은 단순히 인덱스를 상쇄하므로 루프 내부의 인덱스에 숫자를 간단히 추가 할 수 있습니다.
ru: Это приводит нас к переключателю <code>start=n</code> для <code>enumerate()</code> . Это просто смещает индекс, вы можете эквивалентно просто добавить число к индексу внутри цикла.
zh_cn: 这使我们进入了 <code>enumerate()</code> 的 <code>start=n</code> 开关。 这只是使索引偏移，您可以等效地在循环内向索引简单地添加一个数字。

source: The better option is to use the built-in function <a href="https://docs.python.org/3/library/functions.html#enumerate"><code>enumerate()</code></a>, available in both Python 2 and 3:
es: La mejor opci&oacute;n es usar la funci&oacute;n incorporada <a href="https://docs.python.org/3/library/functions.html#enumerate"> <code>enumerate()</code> </a> , disponible en Python 2 y 3:
ko: 더 나은 옵션은 내장 함수 <a href="https://docs.python.org/3/library/functions.html#enumerate"> <code>enumerate()</code> </a> 를 사용하는 것입니다. 파이썬 2와 3에서 모두 사용할 수 있습니다.
ru: Лучшим вариантом является использование встроенной функции <a href="https://docs.python.org/3/library/functions.html#enumerate"> <code>enumerate()</code> </a> , доступной как в Python 2, так и в 3:
zh_cn: 更好的选择是使用内置函数<a href="https://docs.python.org/3/library/functions.html#enumerate"> <code>enumerate()</code> </a> ，该函数在Python 2和3中都可用：

source: The count seems to be more what you intend to ask for (as opposed to index) when you said you wanted from 1 to 5.
es: El recuento parece ser más lo que pretendes pedir (en contraposición al índice)cuando dijiste que querías del 1 al 5.
ko: 1에서 5까지를 원한다고 말했을 때 (인수가 아닌) 요청하려는 것보다 더 많은 것으로 보입니다.
ru: Счет,кажется,больше того,что вы собираетесь просить (в отличие от индекса),когда вы сказали,что вы хотите от 1 до 5.
zh_cn: 当你说要从1到5的时候,你说你要从1到5的时候,这个数似乎更多的是你的打算要求(相对于指数)。

source: The current idiom for looping over the indices makes use of the built-in <code>range</code> function:
es: El idioma actual para recorrer los &iacute;ndices hace uso de la funci&oacute;n de <code>range</code> incorporada:
ko: 인덱스를 반복하는 현재 관용구는 내장 <code>range</code> 기능을 사용합니다.
ru: Текущая идиома для зацикливания индексов использует встроенную функцию <code>range</code> :
zh_cn: 当前用于遍历索引的惯用法使用内置的 <code>range</code> 函数：

source: The fastest way to access indexes of list within loop in <strong>Python 2.7</strong> is to use the <a href="https://docs.python.org/2/library/functions.html#range">range method</a> for small lists and <a href="https://docs.python.org/2/library/functions.html#enumerate">enumerate method</a> for medium and huge size lists.
es: La forma m&aacute;s r&aacute;pida de acceder a los &iacute;ndices de la lista dentro del bucle en <strong>Python 2.7</strong> es usar el <a href="https://docs.python.org/2/library/functions.html#range">m&eacute;todo de rango</a> para listas peque&ntilde;as y el <a href="https://docs.python.org/2/library/functions.html#enumerate">m&eacute;todo de enumeraci&oacute;n</a> para listas de tama&ntilde;o medio y grande.
ko: <strong>Python 2.7</strong> 에서 루프 내의 목록 색인에 액세스하는 가장 빠른 <a href="https://docs.python.org/2/library/functions.html#range">방법</a> 은 작은 목록에 범위 방법 을 사용하고 중간 및 큰 크기 목록에 대해 <a href="https://docs.python.org/2/library/functions.html#enumerate">방법</a> 을 열거하는 것 입니다.
ru: Самый быстрый способ получить доступ к индексам списка в цикле в <strong>Python 2.7</strong> - это использовать <a href="https://docs.python.org/2/library/functions.html#range">метод range</a> для небольших списков и <a href="https://docs.python.org/2/library/functions.html#enumerate">метод перечисления</a> для списков среднего и большого размера.
zh_cn: 在<strong>Python 2.7中</strong>访问循环内列表索引的最快方法是对小列表使用<a href="https://docs.python.org/2/library/functions.html#range">range方法</a> ，对中型和大型列表使用<a href="https://docs.python.org/2/library/functions.html#enumerate">枚举方法</a> 。

source: The output for the above is then,
es: La salida para lo anterior es entonces,
ko: 위의 출력은 다음과 같습니다.
ru: Выход для вышеперечисленного,
zh_cn: 那么上述的输出是:

source: The output is
es: La salida es
ko: 출력은
ru: На выходе
zh_cn: 输出是

source: This code sample is fairly well the <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#index-item-2-enumerate">canonical</a> example of the difference between code that is idiomatic of Python and code that is not. Idiomatic code is sophisticated (but not complicated) Python, written in the way that it was intended to be used. Idiomatic code is expected by the designers of the language, which means that usually this code is not just more readable, but also more efficient.
es: Este ejemplo de c&oacute;digo es bastante bien el ejemplo <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#index-item-2-enumerate">can&oacute;nico</a> de la diferencia entre el c&oacute;digo que es idiom&aacute;tico de Python y el c&oacute;digo que no lo es. El c&oacute;digo idiom&aacute;tico es Python sofisticado (pero no complicado), escrito de la manera en que estaba destinado a ser utilizado. Los dise&ntilde;adores del lenguaje esperan un c&oacute;digo idiom&aacute;tico, lo que significa que generalmente este c&oacute;digo no solo es m&aacute;s legible, sino tambi&eacute;n m&aacute;s eficiente.
ko: 이 코드 샘플은 파이썬의 관용적 코드와 그렇지 않은 코드의 차이점에 대한 <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#index-item-2-enumerate">표준</a> 예입니다. 관용적 코드는 정교하지만 (복잡하지는 않지만) 파이썬으로, 의도 된 방식으로 작성되었습니다. 관용어는 언어 설계자에 의해 예상됩니다. 즉, 일반적으로이 코드는 더 읽기 쉽고 효율적입니다.
ru: Этот пример кода довольно хорошо является <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#index-item-2-enumerate">каноническим</a> примером различия между кодом, идиоматическим для Python, и кодом, которого нет. Идиоматический код является сложным (но не сложным) Python, написанным так, как он был предназначен для использования. Разработчики языка ожидают идиоматического кода, что означает, что обычно этот код не только более читабелен, но и более эффективен.
zh_cn: 此代码示例很好<a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#index-item-2-enumerate">地</a>说明了Python特有的代码与非Python特有的代码之间的区别的典范示例。 惯用代码是复杂的（但不复杂）Python，以预期使用的方式编写。 语言的设计者希望使用惯用代码，这意味着通常该代码不仅更具可读性，而且效率更高。

source: This is also the safest option in my opinion because the chance of going into infinite recursion has been eliminated. Both the item and its index are held in variables and there is no need to write any further code to access the item.
es: Esta es también la opción más segura en mi opinión porque la posibilidad de entrar en una recursión infinita ha sido eliminada.Tanto el artículo como su índice se mantienen en variables y no hay necesidad de escribir ningún código más para acceder al artículo.
ko: 무한 재귀로 들어갈 가능성이 없어 졌기 때문에 이것은 또한 내 의견으로는 가장 안전한 옵션입니다. 항목과 해당 색인 모두 변수로 유지되며 항목에 액세스하기 위해 추가 코드를 작성할 필요가 없습니다.
ru: Это также самый безопасный,на мой взгляд,вариант,потому что шанс попасть в бесконечную рекурсию был исключен.И элемент,и его индекс хранятся в переменных,и нет необходимости писать дополнительный код для доступа к элементу.
zh_cn: 在我看来,这也是最安全的选择,因为已经消除了进入无限递归的可能性。项目和它的索引都被保存在变量中,不需要再写任何代码来访问项目。

source: This serves the purpose well enough:
es: Esto sirve al propósito lo suficientemente bien:
ko: 이것은 목적을 충분히 제공합니다.
ru: Это достаточно хорошо служит цели:
zh_cn: 这样做的作用已经足够好了。

source: To break these examples down, say we have a list of items that we want to iterate over with an index:
es: Para desglosar estos ejemplos,digamos que tenemos una lista de elementos que queremos iterar con un índice:
ko: 이 예제들을 정리하기 위해 인덱스로 반복하고 싶은 아이템리스트가 있다고 가정 해 봅시다.
ru: Чтобы разбить эти примеры на части,скажем,что у нас есть список элементов,которые мы хотим повторить с помощью индекса:
zh_cn: 为了分解这些例子,假设我们有一个项目列表,我们想用一个索引来迭代。

source: To get the value of an index use
es: Para obtener el valor de un índice utilice
ko: 인덱스 값을 얻으려면
ru: Чтобы получить значение использования индекса
zh_cn: 要获得一个索引的值,请使用

source: To get these indexes from an iterable as you iterate over it, use the enumerate function
es: Para obtener estos índices de un iterable mientras iteras sobre él,usa la función de enumerar
ko: 반복 할 때 반복 가능한 색인에서 이러한 색인을 가져 오려면 enumerate 함수를 사용하십시오.
ru: Чтобы получить эти индексы из итерабельного файла в процессе итераций,используйте функцию перечисления
zh_cn: 要从迭代器中获取这些索引,请使用枚举函数

source: To print tuple of (index, value) in list comprehension using a <code>for</code> loop:
es: Para imprimir la tupla de (&iacute;ndice, valor) en la comprensi&oacute;n de la lista utilizando un bucle <code>for</code> :
ko: <code>for</code> 루프를 사용하여 목록 이해에서 (색인, 값) 튜플을 인쇄하려면 다음을 수행하십시오.
ru: Чтобы напечатать кортеж (index, value) в понимании списка, используя цикл <code>for</code> :
zh_cn: 要使用 <code>for</code> 循环在列表理解中打印（索引，值）的元组：

source: Unidiomatic control flow
es: Flujo de control unidiomático
ko: 단일 제어 흐름
ru: Унидиоматический поток управления
zh_cn: 统一控制流程

source: Use <code>enumerate</code> to get the index with the element as you iterate:
es: Use <code>enumerate</code> para obtener el &iacute;ndice con el elemento a medida que itera:
ko: <code>enumerate</code> 를 사용하여 반복 할 때 요소가있는 색인을 가져옵니다.
ru: Используйте <code>enumerate</code> , чтобы получить индекс с элементом во время итерации:
zh_cn: 迭代时使用 <code>enumerate</code> 获取带有元素的索引：

source: Use the Enumerate Function
es: Usar la función de Enumerar
ko: 열거 함수 사용
ru: Использовать функцию перечисления
zh_cn: 使用Enumerate函数

source: Use this code if you need to reset the index value at the end of the loop:
es: Use este código si necesita reajustar el valor del índice al final del bucle:
ko: 루프 끝에서 색인 값을 재설정해야하는 경우이 코드를 사용하십시오.
ru: Используйте этот код,если необходимо сбросить значение индекса в конце цикла:
zh_cn: 如果你需要在循环结束时重置索引值,请使用此代码。

source: Using a for loop, how do I access the loop index, from 1 to 5 in this case?
es: Usando un bucle for,¿cómo accedo al índice de bucle,de 1 a 5 en este caso?
ko: for 루프를 사용하면이 경우 1에서 5까지 루프 인덱스에 어떻게 액세스합니까?
ru: Используя a for loop,как в этом случае получить доступ к индексу цикла от 1 до 5?
zh_cn: 使用for循环,在这种情况下,如何访问循环索引,从1到5?

source: Using an additional state variable, such as an index variable (which you would normally use in languages such as C or PHP), is considered non-pythonic.
es: El uso de una variable de estado adicional,como una variable de índice (que normalmente se usaría en lenguajes como C o PHP),se considera no pitónica.
ko: 색인 변수 (예 : C 또는 PHP와 같은 언어에서 일반적으로 사용)와 같은 추가 상태 변수를 사용하는 것은 비피 토닉으로 간주됩니다.
ru: Использование дополнительной переменной состояния,такой как индексная переменная (которую вы обычно используете в таких языках,как C или PHP),считается непитоническим.
zh_cn: 使用一个额外的状态变量,如索引变量(通常在C语言或PHP等语言中会使用索引变量),被认为是非虚构的。

source: Using enumerate in the idiomatic way (along with tuple unpacking) creates code that is more readable and maintainable:
es: El uso de enumerar en la forma idiomática (junto con el desempaquetado en tupla)crea un código que es más legible y mantenible:
ko: 튜플 압축 풀기와 함께 관용적 방식으로 열거를 사용하면 더 읽기 쉽고 유지 관리가 쉬운 코드가 생성됩니다.
ru: Использование перечисления идиоматическим образом (наряду с распаковкой кортежа)создает более читабельный и удобный в обслуживании код:
zh_cn: 用成语的方式使用枚举(与tuple解包一起使用),可以创建出更易读和可维护的代码。

source: We can pull the first item out of this iterable that we would get in a loop with the <code>next</code> function:
es: Podemos extraer el primer elemento de este iterable que obtendr&iacute;amos en un bucle con la <code>next</code> funci&oacute;n:
ko: <code>next</code> 함수를 사용하여 루프에 들어갈 수 있도록 반복 가능한 첫 번째 항목을 가져올 수 있습니다.
ru: Мы можем извлечь первый элемент из этой итерации, который мы бы запустили в цикл с помощью <code>next</code> функции:
zh_cn: 我们可以从此可迭代项中拉出第一项，以便与 <code>next</code> 函数进入循环：

source: What you are asking for is the Pythonic equivalent of the following, which is the algorithm most programmers of lower-level languages would use:
es: Lo que está pidiendo es el equivalente pitónico del siguiente,que es el algoritmo que la mayoría de los programadores de lenguajes de nivel inferior utilizarían:
ko: 당신이 요구하는 것은 다음과 같은 Pythonic과 같습니다.이 언어는 대부분의 저급 언어 프로그래머가 사용할 알고리즘입니다.
ru: То,что вы просите-это питонический эквивалент следующего алгоритма,который использовал бы большинство программистов низшего уровня:
zh_cn: 你所要求的是下面的Pythonic等效的算法,这是大多数低级语言的程序员会使用的算法。

source: When I loop through it using a <code>for</code> loop, how do I access the loop index, from 1 to 5 in this case?
es: Cuando lo recorro usando un bucle <code>for</code> , &iquest;c&oacute;mo accedo al &iacute;ndice de bucle, de 1 a 5 en este caso?
ko: <code>for</code> 루프를 사용하여 루프 를 반복 할 때이 경우 1에서 5까지 루프 인덱스에 어떻게 액세스합니까?
ru: Когда я перебираю цикл с помощью цикла <code>for</code> , как мне получить доступ к индексу цикла, в данном случае от 1 до 5?
zh_cn: 当我使用 <code>for</code> 循环遍历它时，如何访问循环索引（在这种情况下为1到5）？

source: You can also try this:
es: También puedes probar esto:
ko: 당신은 또한 이것을 시도 할 수 있습니다 :
ru: Ты также можешь попробовать это:
zh_cn: 你也可以试试这个。

source: You can do it with this code:
es: Puedes hacerlo con este código:
ko: 이 코드로 할 수 있습니다 :
ru: Ты можешь сделать это с этим кодом:
zh_cn: 你可以用这个代码来做。

source: You can use the <code>index</code> method
es: Puedes usar el m&eacute;todo de <code>index</code>
ko: 당신은 <code>index</code> 방법을 사용할 수 있습니다
ru: Вы можете использовать метод <code>index</code>
zh_cn: 您可以使用 <code>index</code> 方法

source: and when we inspect <code>index</code>, we find it refers to the first index, 0, and <code>item</code> refers to the first item, <code>'a'</code>.
es: y cuando inspeccionamos el <code>index</code> , encontramos que se refiere al primer &iacute;ndice, 0, y el <code>item</code> refiere al primer elemento, <code>'a'</code> .
ko: <code>index</code> 를 검사 할 때 첫 번째 인덱스 0을 가리키고 <code>item</code> 은 첫 번째 항목 <code>'a'</code> 를 찾습니다.
ru: и когда мы проверяем <code>index</code> , мы обнаруживаем, что он ссылается на первый индекс, 0, а <code>item</code> ссылается на первый элемент, <code>'a'</code> .
zh_cn: 当我们检查 <code>index</code> ，我们发现它指的是第一个索引0，而 <code>item</code> 指的是第一个项 <code>'a'</code> 。

source: first value is <strong>index</strong>
es: primer valor es el <strong>&iacute;ndice</strong>
ko: 첫 번째 값은 <strong>인덱스입니다</strong>
ru: первое значение <strong>индекса</strong>
zh_cn: 第一个值是<strong>索引</strong>

source: for which the output is
es: para el cual la salida es
ko: 출력이있는
ru: для которого вывод
zh_cn: 产量为

source: if you want to get both the index and the value in <code>ints</code> as a list of tuples.
es: si desea obtener tanto el &iacute;ndice como el valor en <code>ints</code> como una lista de tuplas.
ko: 튜플 목록으로 인덱스와 <code>ints</code> 값을 모두 가져 오려면
ru: если вы хотите получить и индекс, и значение в <code>ints</code> в виде списка кортежей.
zh_cn: 如果要同时获取索引和 <code>ints</code> 值作为元组列表。

source: or sometimes more commonly (but unidiomatically) found in Python:
es: o a veces más comúnmente (pero unidiomáticamente)en Python:
ko: 또는 때로는 파이썬에서 더 일반적으로 (그러나 관용적으로) 발견됩니다.
ru: а иногда и более часто (но однозначно)встречается в Питоне:
zh_cn: 或有时在Python中更常见(但不分性别)。

source: second value is <strong>element</strong> of array at that index
es: el segundo valor es un <strong>elemento</strong> de la matriz en ese &iacute;ndice
ko: 두 번째 값은 해당 인덱스의 배열 <strong>요소</strong> 입니다
ru: Второе значение является <strong>элементом</strong> массива по этому индексу
zh_cn: 第二个值是该索引处数组的<strong>元素</strong>

source: via <a href="http://www.python.org/dev/peps/pep-0212/">http://www.python.org/dev/peps/pep-0212/</a>
es: a trav&eacute;s de <a href="http://www.python.org/dev/peps/pep-0212/">http://www.python.org/dev/peps/pep-0212/</a>
ko: <a href="http://www.python.org/dev/peps/pep-0212/">http://www.python.org/dev/peps/pep-0212/</a> 를 통해
ru: через <a href="http://www.python.org/dev/peps/pep-0212/">http://www.python.org/dev/peps/pep-0212/</a>
zh_cn: 通过<a href="http://www.python.org/dev/peps/pep-0212/">http://www.python.org/dev/peps/pep-0212/</a>

source: we can use what is referred to as "<a href="https://docs.python.org/2/tutorial/datastructures.html#tuples-and-sequences">sequence unpacking</a>" to extract the elements from this two-tuple:
es: podemos usar lo que se conoce como " <a href="https://docs.python.org/2/tutorial/datastructures.html#tuples-and-sequences">desempaquetado de secuencia</a> " para extraer los elementos de esta tupla doble:
ko: 이 두 튜플에서 요소를 추출하기 위해 " <a href="https://docs.python.org/2/tutorial/datastructures.html#tuples-and-sequences">시퀀스 언 패킹</a> "이라고하는 것을 사용할 수 있습니다.
ru: мы можем использовать то, что называется &laquo; <a href="https://docs.python.org/2/tutorial/datastructures.html#tuples-and-sequences">распаковка последовательности</a> &raquo;, чтобы извлечь элементы из этого двухкорпусного:
zh_cn: 我们可以使用所谓的&ldquo; <a href="https://docs.python.org/2/tutorial/datastructures.html#tuples-and-sequences">序列拆包</a> &rdquo;从这两个元组中提取元素：
