Repository: rueisnom/feedback
Catalog: xlf/52/25/63/522563.*.001.xlf
Languages: es, ko, ru, zh_cn

source: 1. Using enumerate (<em>considered most idiomatic</em>)
es: 1. Usando enumerate ( <em>considerado el m&aacute;s idiom&aacute;tico</em> )
ko: 1. 열거 사용 ( <em>가장 관용적 인 것으로 간주 됨</em> )
ru: 1. Использование перечисления ( <em>считается наиболее идиоматическим</em> )
zh_cn: 1.使用枚举（ <em>被认为是最惯用的</em> ）

source: 2. Creating a variable to hold the index (<em>using <code>for</code></em>)
es: 2. Crear una variable para contener el &iacute;ndice ( <em>usando <code>for</code> </em> )
ko: 2. 색인을 보유 할 변수 작성 ( <em> <code>for</code> 사용</em> )
ru: 2. Создание переменной для хранения индекса ( <em>используется <code>for</code> </em> )
zh_cn: 2.创建一个变量来保存索引（ <em>使用 <code>for</code> </em> ）

source: 3. Creating a variable to hold the index (<em>using <code>while</code></em>)
es: 3. Crear una variable para contener el &iacute;ndice ( <em>usando <code>while</code> </em> )
ko: 3. 색인을 보유 할 변수 작성 ( <em> <code>while</code> 사용</em> )
ru: 3. Создание переменной для хранения индекса ( <em>используя <code>while</code> </em> )
zh_cn: 3.创建一个变量来保存索引（ <em>使用 <code>while</code> </em> ）

source: 4. There is always another way
es: 4.Siempre hay otra manera
ko: 4. 항상 다른 방법이 있습니다
ru: 4.Всегда есть другой способ
zh_cn: 4.4.总会有另一种方法

source: <em><a href="https://stackoverflow.com/questions/11990105/rangelenlist-or-enumeratelist">range(len(list)) or enumerate(list)?</a></em>
es: <em><a href="https://stackoverflow.com/questions/11990105/rangelenlist-or-enumeratelist">rango (len (lista)) o enumerar (lista)?</a></em>
ko: <em><a href="https://stackoverflow.com/questions/11990105/rangelenlist-or-enumeratelist">range (len (list)) 또는 enumerate (list)?</a></em>
ru: <em><a href="https://stackoverflow.com/questions/11990105/rangelenlist-or-enumeratelist">диапазон (len (список)) или перечислить (список)?</a></em>
zh_cn: <em><a href="https://stackoverflow.com/questions/11990105/rangelenlist-or-enumeratelist">范围（len（列表））还是枚举（列表）？</a></em>

source: <em><a href="https://stackoverflow.com/questions/4852944/what-is-faster-for-loop-using-enumerate-or-for-loop-using-xrange-in-python">What is faster for loop using enumerate or for loop using xrange in Python?</a></em>
es: <em><a href="https://stackoverflow.com/questions/4852944/what-is-faster-for-loop-using-enumerate-or-for-loop-using-xrange-in-python">&iquest;Qu&eacute; es m&aacute;s r&aacute;pido para loop usando enumerate o para loop usando xrange en Python?</a></em>
ko: <em><a href="https://stackoverflow.com/questions/4852944/what-is-faster-for-loop-using-enumerate-or-for-loop-using-xrange-in-python">파이썬에서 열거 형을 사용하거나 xrange를 사용하여 for 루프를 사용하는 것이 더 빠릅니까?</a></em>
ru: <em><a href="https://stackoverflow.com/questions/4852944/what-is-faster-for-loop-using-enumerate-or-for-loop-using-xrange-in-python">Что быстрее для цикла с использованием перечисления или для цикла с использованием xrange в Python?</a></em>
zh_cn: <em><a href="https://stackoverflow.com/questions/4852944/what-is-faster-for-loop-using-enumerate-or-for-loop-using-xrange-in-python">在Python中使用枚举进行循环或使用xrange进行循环的速度更快？</a></em>

source: <em><a href="https://stackoverflow.com/questions/94935/what-is-the-difference-between-range-and-xrange-functions-in-python-2-x">What is the difference between range and xrange functions in Python 2.X?</a></em>
es: <em><a href="https://stackoverflow.com/questions/94935/what-is-the-difference-between-range-and-xrange-functions-in-python-2-x">&iquest;Cu&aacute;l es la diferencia entre las funciones de rango y xrange en Python 2.X?</a></em>
ko: <em><a href="https://stackoverflow.com/questions/94935/what-is-the-difference-between-range-and-xrange-functions-in-python-2-x">Python 2.X에서 range와 xrange 함수의 차이점은 무엇입니까?</a></em>
ru: <em><a href="https://stackoverflow.com/questions/94935/what-is-the-difference-between-range-and-xrange-functions-in-python-2-x">В чем разница между функциями range и xrange в Python 2.X?</a></em>
zh_cn: <em><a href="https://stackoverflow.com/questions/94935/what-is-the-difference-between-range-and-xrange-functions-in-python-2-x">Python 2.X中的range和xrange函数之间有什么区别？</a></em>

source: <strong>EDIT</strong> Highlighted in the comment that this method doesn&rsquo;t work if there are duplicates in <code>ints</code>, the method below should work for any values in <code>ints</code>:
es: <strong>EDITAR</strong> Destacado en el comentario de que este m&eacute;todo no funciona si hay duplicados en <code>ints</code> , el siguiente m&eacute;todo deber&iacute;a funcionar para cualquier valor en <code>ints</code> :
ko: <strong>편집</strong> <code>ints</code> 에 중복이있는 경우이 방법이 작동하지 않는다는 의견에서 강조 표시되면 아래 방법은 <code>ints</code> 값에 대해 작동해야합니다.
ru: <strong>РЕДАКТИРОВАТЬ</strong> Подчеркнуто в комментарии, что этот метод не работает, если есть дубликаты в <code>ints</code> , метод ниже должен работать для любых значений в <code>ints</code> :
zh_cn: <strong>编辑</strong>在注释中突出显示，如果 <code>ints</code> 存在重复项，则此方法不起作用，下面的方法应适用于 <code>ints</code> 中的任何值：

source: <strong>enumerate</strong> return <strong>tuple</strong>
es: <strong>enumerar la</strong> <strong>tupla de</strong> retorno
ko: 리턴 <strong>튜플</strong> <strong>열거</strong>
ru: <strong>перечислить</strong> возвращаемый <strong>кортеж</strong>
zh_cn: <strong>枚举</strong>返回<strong>元组</strong>

source: Accessing the index in 'for' loops
es: Accediendo al índice en los bucles "para"...
ko: 'for'루프에서 인덱스에 액세스
ru: Доступ к индексу в циклах 'for'
zh_cn: 在 "for "循环中访问索引

source: According to this discussion: <a href="http://bytes.com/topic/python/answers/464012-objects-list-index">http://bytes.com/topic/python/answers/464012-objects-list-index</a>
es: De acuerdo con esta discusi&oacute;n: <a href="http://bytes.com/topic/python/answers/464012-objects-list-index">http://bytes.com/topic/python/answers/464012-objects-list-index</a>
ko: 이 토론에 따르면 : <a href="http://bytes.com/topic/python/answers/464012-objects-list-index">http://bytes.com/topic/python/answers/464012-objects-list-index</a>
ru: Согласно этой дискуссии: <a href="http://bytes.com/topic/python/answers/464012-objects-list-index">http://bytes.com/topic/python/answers/464012-objects-list-index</a>
zh_cn: 根据此讨论： <a href="http://bytes.com/topic/python/answers/464012-objects-list-index">http</a> : //bytes.com/topic/python/answers/464012-objects-list-index

source: Adding some useful links below:
es: Añadiendo algunos enlaces útiles a continuación:
ko: 아래에 유용한 링크를 추가하십시오.
ru: Добавление некоторых полезных ссылок ниже:
zh_cn: 在下面添加一些有用的链接。

source: And note that Python's indexes start at zero, so you would get 0 to 4 with the above. If you want the count, 1 to 5, do this:
es: Y ten en cuenta que los índices de Python comienzan en cero,por lo que obtendrías de 0 a 4 con lo anterior.Si quieres la cuenta,de 1 a 5,haz esto:
ko: 그리고 파이썬의 인덱스는 0에서 시작하므로 위와 같이 0에서 4를 얻습니다. 1에서 5까지의 개수를 원하면 다음을 수행하십시오.
ru: И обратите внимание,что индексы Python начинаются с нуля,так что вы получите от 0 до 4 с вышеуказанным.Если хочешь посчитать от 1 до 5,сделай это:
zh_cn: 注意,Python的索引从0开始,所以用上面的方法可以得到0到4。如果你想要的计数,1到5,可以这样做。

source: And we see we get a tuple of <code>0</code>, the first index, and <code>'a'</code>, the first item:
es: Y vemos que obtenemos una tupla de <code>0</code> , el primer &iacute;ndice, y <code>'a'</code> , el primer elemento:
ko: 그리고 우리는 첫 번째 인덱스 <code>0</code> 과 첫 번째 항목 <code>'a'</code> 의 튜플을 얻습니다.
ru: И мы видим, что мы получаем кортеж <code>0</code> , первый индекс, и <code>'a'</code> , первый элемент:
zh_cn: 我们看到我们得到的元组为 <code>0</code> （第一个索引）和 <code>'a'</code> （第一项）：

source: As explained before, there are other ways to do this that have not been explained here and they may even apply more in other situations. <em>e.g</em> using <code>itertools.chain</code> with for. It handles nested loops better than the other examples.
es: Como se explic&oacute; anteriormente, hay otras formas de hacer esto que no se han explicado aqu&iacute; e incluso pueden aplicarse m&aacute;s en otras situaciones. <em>por ejemplo,</em> usando <code>itertools.chain</code> con for. Maneja los bucles anidados mejor que los otros ejemplos.
ko: 앞에서 설명한 것처럼 여기에 설명되지 않은 다른 방법이 있으며 다른 상황에서도 더 많이 적용될 수 있습니다. <em>예</em> 를 <em>들어</em> <code>itertools.chain</code> 을 for와 함께 사용하십시오. 다른 예제보다 중첩 루프를 더 잘 처리합니다.
ru: Как объяснялось ранее, есть другие способы сделать это, которые не были объяснены здесь, и они могут даже применить больше в других ситуациях. <em>например,</em> используя <code>itertools.chain</code> с for. Он обрабатывает вложенные циклы лучше, чем другие примеры.
zh_cn: 如前所述，还有其他方法尚未在此处进行说明，它们甚至可能在其他情况下更适用。 <em>例如，</em>将 <code>itertools.chain</code> 与for一起使用。 它比其他示例更好地处理嵌套循环。

source: As is the norm in Python there are several ways to do this. In all examples assume: <code>lst = [1, 2, 3, 4, 5]</code>
es: Como es la norma en Python, hay varias formas de hacerlo. En todos los ejemplos, suponga: <code>lst = [1, 2, 3, 4, 5]</code>
ko: 파이썬의 표준과 마찬가지로 이것을 수행하는 몇 가지 방법이 있습니다. 모든 예에서 다음을 가정합니다 : <code>lst = [1, 2, 3, 4, 5]</code>
ru: Как правило, в Python есть несколько способов сделать это. Во всех примерах предположим: <code>lst = [1, 2, 3, 4, 5]</code>
zh_cn: 按照Python的规范，有几种方法可以做到这一点。 在所有示例中，假设： <code>lst = [1, 2, 3, 4, 5]</code>

source: As the result, using <code>range</code> method is the fastest one up to list with 1000 items. For list with size &gt; 10 000 items <code>enumerate</code> is the winner.
es: Como resultado, el uso del m&eacute;todo de <code>range</code> es el m&aacute;s r&aacute;pido hasta la lista con 1000 elementos. Para la lista con tama&ntilde;o&gt; 10 000 art&iacute;culos <code>enumerate</code> es el ganador.
ko: 결과적으로 <code>range</code> 방법을 사용하는 것이 1000 개의 항목을 나열하는 것 중 가장 빠릅니다. 크기가 10 000보다 큰 목록의 경우 <code>enumerate</code> 가 승자입니다.
ru: В результате использование метода <code>range</code> является самым быстрым из списка с 1000 наименованиями. Для списка размером более 10 000 наименований <code>enumerate</code> победитель.
zh_cn: 结果，使用 <code>range</code> 方法是列出1000个项目中最快的方法。 对于大小大于10000的列表，请 <code>enumerate</code> 。

source: Best solution for this problem is use <strong>enumerate</strong> in-build python function.
es: La mejor soluci&oacute;n para este problema es usar la funci&oacute;n <strong>enumerar</strong> Python incorporada.
ko: 이 문제에 대한 최선의 해결책은 <strong>열거 형</strong> 파이썬 함수를 사용하는 것입니다.
ru: Лучшее решение этой проблемы - использовать встроенную функцию Python.
zh_cn: 解决此问题的最佳方法是使用<strong>枚举</strong>内置python函数。

source: Breaking it down - a step by step explanation
es: Descomponerlo-una explicación paso a paso
ko: 세분화-단계별 설명
ru: Ломать его-пошаговое объяснение
zh_cn: 逐步分解----逐步解释

source: Check out <a href="https://www.python.org/dev/peps/pep-0279/">PEP 279</a> for more.
es: Echa un vistazo a <a href="https://www.python.org/dev/peps/pep-0279/">PEP 279</a> para m&aacute;s.
ko: 자세한 내용은 <a href="https://www.python.org/dev/peps/pep-0279/">PEP 279</a> 를 확인하십시오.
ru: Проверьте <a href="https://www.python.org/dev/peps/pep-0279/">PEP 279</a> для получения дополнительной информации.
zh_cn: 进一步了解<a href="https://www.python.org/dev/peps/pep-0279/">PEP 279</a> 。

source: Even if you don't need indexes as you go, but you need a count of the iterations (sometimes desirable) you can start with <code>1</code> and the final number will be your count.
es: Incluso si no necesita &iacute;ndices a medida que avanza, pero necesita un recuento de las iteraciones (a veces deseable) puede comenzar con <code>1</code> y el n&uacute;mero final ser&aacute; su recuento.
ko: 인덱스를 필요로하지 않아도 반복 횟수가 필요하지만 (때로는 원할 경우) <code>1</code> 부터 시작할 수 있으며 최종 숫자는 카운트가됩니다.
ru: Даже если вам не нужны индексы на ходу, но вам нужно количество итераций (иногда желательно), вы можете начать с <code>1</code> , а последним числом будет ваш счет.
zh_cn: 即使您不需要索引，但是您需要一个迭代计数（有时是可取的），您也可以从 <code>1</code> 开始，最后一个数字就是您的计数。

source: First of all, the indexes will be from 0 to 4. Programming languages start counting from 0; don't forget that or you will come across an index out of bounds exception. All you need in the for loop is a variable counting from 0 to 4 like so:
es: En primer lugar,los índices serán de 0 a 4.Los lenguajes de programación empiezan a contar desde 0;no lo olvides o te encontrarás con una excepción de índice fuera de los límites.Todo lo que necesitas en el bucle de for es una variable que cuente de 0 a 4 así:
ko: 우선, 인덱스는 0부터 4까지입니다. 프로그래밍 언어는 0부터 카운트를 시작합니다. 잊지 마십시오. 또는 범위를 벗어난 색인 예외가 발생합니다. for 루프에서 필요한 것은 다음과 같이 0에서 4까지의 계수입니다.
ru: Прежде всего,индексы будут от 0 до 4.Языки программирования начинают отсчитываться от 0;не забывайте об этом,иначе вы столкнетесь с индексом вне пределов исключения.Все,что вам нужно в цикле for-это переменная,отсчитывающая от 0 до 4:
zh_cn: 首先是索引从0到4,编程语言从0开始计数,不要忘记这一点,否则你会遇到索引越界的异常。在for循环中,你所需要的就是一个从0到4的变量,就像这样,从0到4的计数。

source: First, to clarify, the <code>enumerate</code> function iteratively returns the index and corresponding item for each item in a list.
es: Primero, para aclarar, la funci&oacute;n de <code>enumerate</code> devuelve iterativamente el &iacute;ndice y el elemento correspondiente para cada elemento en una lista.
ko: 먼저 <code>enumerate</code> 함수는 목록의 각 항목에 대한 색인과 해당 항목을 반복적으로 반환합니다.
ru: Во-первых, чтобы уточнить, функция <code>enumerate</code> итеративно возвращает индекс и соответствующий элемент для каждого элемента в списке.
zh_cn: 首先，要澄清一下， <code>enumerate</code> 函数为列表中的每个项目迭代地返回索引和对应的项目。

source: Getting a count
es: Conseguir un recuento
ko: 카운트하기
ru: Получить счет
zh_cn: 掌握了一个个数字

source: Here's what you get when you're accessing index in <code>for</code> loops:
es: Esto es lo que obtienes cuando accedes al &iacute;ndice <code>for</code> bucles:
ko: <code>for</code> 루프에서 인덱스에 액세스 할 때 얻을 수있는 내용은 다음과 같습니다.
ru: Вот что вы получаете, когда получаете доступ к индексам <code>for</code> циклов:
zh_cn: 这是在 <code>for</code> 循环中访问索引时得到的结果：

source: How do I access the index in a <code>for</code> loop like the following?
es: &iquest;C&oacute;mo accedo al &iacute;ndice en un bucle <code>for</code> como el siguiente?
ko: 다음과 같은 <code>for</code> 루프에서 인덱스에 어떻게 액세스합니까?
ru: Как мне получить доступ к индексу в цикле, как показано ниже?
zh_cn: 如何在如下所示的 <code>for</code> 循环中访问索引？

source: However, the index for a list runs from zero. So, then we need to know if what you actually want is the index and item for each item in a list, or whether you really want numbers starting from 1. Fortunately, in Python, it is easy to do either or both.
es: Sin embargo,el índice de una lista va desde cero.Entonces,necesitamos saber si lo que realmente quieres es el índice y el elemento para cada elemento de una lista,o si realmente quieres números que empiecen desde el 1.Afortunadamente,en Python,es fácil hacer cualquiera de los dos o ambos.
ko: 그러나 목록의 인덱스는 0부터 실행됩니다. 따라서 실제로 원하는 것이 목록의 각 항목에 대한 인덱스 및 항목인지 또는 1부터 시작하여 숫자를 원하는지 여부를 알아야합니다. 다행히 파이썬에서는 두 가지 중 하나 또는 모두를 수행하는 것이 쉽습니다.
ru: Однако,индекс для списка начинается с нуля.Итак,тогда нам нужно знать,является ли то,что вы на самом деле хотите,индексом и элементом для каждого элемента списка,или вы действительно хотите номера,начинающиеся с 1.К счастью,на Python это легко сделать или то и другое,или и то,и другое.
zh_cn: 然而,一个列表的索引从0开始运行。所以,那么我们需要知道你真正想要的是列表中每个项的索引和项,还是你真的想要的是从1开始的数字。 幸运的是,在Python中,要做到这两点都很容易。

source: I want to get this output:
es: Quiero conseguir esta salida:
ko: 이 출력을 얻고 싶습니다 :
ru: Я хочу получить этот результат:
zh_cn: 我想得到这样的输出。

source: If I were to iterate <code>nums = [1, 2, 3, 4, 5]</code> I would do
es: Si tuviera que iterar <code>nums = [1, 2, 3, 4, 5]</code> lo har&iacute;a
ko: <code>nums = [1, 2, 3, 4, 5]</code> 를 반복한다면
ru: Если бы я <code>nums = [1, 2, 3, 4, 5]</code> я бы сделал
zh_cn: 如果我要迭代 <code>nums = [1, 2, 3, 4, 5]</code> 我会做

source: If there is no duplicate value in the list:
es: Si no hay un valor duplicado en la lista:
ko: 목록에 중복 값이없는 경우 :
ru: Если в списке нет дублирующего значения:
zh_cn: 如果列表中没有重复值。

source: If you want your loop to span a part of the list, you can use the standard Python syntax for a part of the list. For example, to loop from the second item in a list up to but not including the last item, you could use
es: Si quieres que tu bucle abarque una parte de la lista,puedes usar la sintaxis estándar de Python para una parte de la lista.Por ejemplo,para hacer un bucle desde el segundo elemento de una lista hasta el último elemento,pero sin incluirlo,podrías usar
ko: 루프를 목록의 일부로 확장하려면 목록의 일부에 표준 Python 구문을 사용할 수 있습니다. 예를 들어 목록의 두 번째 항목에서 마지막 항목까지는 반복하지 않으려면 다음을 사용할 수 있습니다.
ru: Если вы хотите,чтобы ваш цикл охватывал часть списка,вы можете использовать стандартный синтаксис Python для части списка.Например,чтобы зациклиться со второго элемента списка до последнего,но не включая его,вы можете использовать
zh_cn: 如果你想让你的循环跨越列表中的一部分,你可以使用标准的Python语法来处理列表中的一部分。例如,要从列表中的第二项循环到最后一项,但不包括最后一项,可以使用

source: Important hint, though a little misleading since <code>index</code> will be a <code>tuple</code><code>(idx, item)</code> here. Good to go.
es: Sugerencia importante, aunque un poco enga&ntilde;osa ya que el <code>index</code> ser&aacute; una <code>tuple</code> <code>(idx, item)</code> aqu&iacute;. Bueno para ir.
ko: <code>index</code> 가 <code>tuple</code> <code>(idx, item)</code> 이기 때문에 약간의 오해의 소지가 있지만 중요한 힌트입니다. 잘가요
ru: Важный совет, хотя и немного вводящий в заблуждение, так как здесь <code>index</code> будет <code>tuple</code> <code>(idx, item)</code> . Хорошо пойти.
zh_cn: 重要提示，尽管有点误导，因为这里的 <code>index</code> 将是一个 <code>tuple</code> <code>(idx, item)</code> 。 好去。

source: In your question, you write <em>"how do I access the loop index, from 1 to 5 in this case?"</em>
es: En su pregunta, escribe <em>"&iquest;c&oacute;mo accedo al &iacute;ndice de bucle, de 1 a 5 en este caso?"</em>
ko: 귀하의 질문에, <em>"이 경우 1에서 5까지 루프 인덱스에 어떻게 액세스합니까?"라고</em> 씁니다.
ru: В своем вопросе вы пишете <em>"как мне получить доступ к индексу цикла, в данном случае от 1 до 5?"</em>
zh_cn: 在您的问题中，您写道： <em>&ldquo;在这种情况下，我如何从1到5访问循环索引？&rdquo;</em>

source: It uses the method of <code>enumerate</code> in the selected answer to this question, but with list comprehension, making it faster with less code.
es: Utiliza el m&eacute;todo de <code>enumerate</code> en la respuesta seleccionada a esta pregunta, pero con comprensi&oacute;n de la lista, lo que lo hace m&aacute;s r&aacute;pido con menos c&oacute;digo.
ko: 이 질문에 대한 선택된 답변에 <code>enumerate</code> 방법을 사용하지만 목록 이해력이있어 코드가 적을수록 더 빠릅니다.
ru: Он использует метод <code>enumerate</code> в выбранном ответе на этот вопрос, но с пониманием списка, что делает его быстрее с меньшим количеством кода.
zh_cn: 它使用在此问题的选定答案中 <code>enumerate</code> 的方法，但具有列表理解功能，因此可以用较少的代码来加快速度。

source: It's pretty simple to start it from <code>1</code> other than <code>0</code>:
es: Es bastante simple iniciarlo desde <code>1</code> que no sea <code>0</code> :
ko: <code>0</code> 이외의 <code>1</code> 에서 시작하는 것은 매우 간단합니다.
ru: Начать с <code>1</code> , отличного от <code>0</code> , довольно просто:
zh_cn: 从 <code>0</code> 以外的其他 <code>1</code> 开始非常简单：

source: Keep in mind that I wrote 0 to 5 because the loop stops one number before the max. :)
es: Tengan en cuenta que escribí de 0 a 5 porque el bucle se detiene un número antes del máximo.:)
ko: 루프가 최대 값보다 한 번호 앞을 멈추기 때문에 0에서 5까지 썼음을 명심하십시오. :)
ru: Имейте в виду,что я написал от 0 до 5,потому что цикл останавливается на одну цифру раньше максимального :).
zh_cn: 请记住,我写的是0到5,因为我写的是0到5,因为循环在最大之前停止一个数字。)

source: List comprehension:
es: Comprensión de la lista:
ko: 목록 이해 :
ru: Понимание списка:
zh_cn: 列表理解。

source: Loop counter iteration
es: La iteración del contador de bucle
ko: 루프 카운터 반복
ru: Счетчик циклов итерация
zh_cn: 循环计数器迭代

source: Looping over both elements and indices can be achieved either by the old idiom or by using the new <code>zip</code> built-in function:
es: El bucle sobre los elementos e &iacute;ndices se puede lograr ya sea por el viejo idioma o mediante el uso de la nueva funci&oacute;n <code>zip</code> integrada:
ko: 구식 관용구 또는 새로운 <code>zip</code> 내장 함수를 사용하여 요소와 색인을 모두 반복 할 수 있습니다.
ru: Циклы по элементам и индексам могут быть достигнуты либо с помощью старой идиомы, либо с помощью новой встроенной функции <code>zip</code> :
zh_cn: 可以通过旧习惯用法或使用新的 <code>zip</code> 内置函数来实现元素和索引的循环：

source: Note that once again, the output index runs from 0,
es: Obsérvese que una vez más,el índice de salida va desde 0,
ko: 다시 한번, 출력 인덱스는 0부터 실행됩니다.
ru: Обратите внимание,что выходной индекс снова начинается с 0,
zh_cn: 注意,再一次,输出指数从0开始运行。

source: Notice that the index runs from 0. This kind of indexing is common among modern programming languages including Python and C.
es: Fíjese que el índice va desde 0.Este tipo de indexación es común entre los lenguajes de programación modernos,incluyendo Python y C.
ko: 인덱스는 0에서 시작합니다. 이러한 종류의 인덱싱은 Python 및 C를 포함한 최신 프로그래밍 언어에서 일반적입니다.
ru: Обратите внимание,что индекс начинается с 0.Такой вид индексирования распространен среди современных языков программирования,в том числе Python и C.
zh_cn: 注意,索引从0开始运行,这种索引在包括Python和C语言在内的现代编程语言中很常见。

source: Now we pass this iterable to enumerate, creating an enumerate object:
es: Ahora pasamos esta iterable enumeración,creando un objeto enumerado:
ko: 이제이 iterable을 전달하여 열거 객체를 생성합니다.
ru: Теперь мы передаем этот итерабельный объект для перечисления,создавая объект перечисления:
zh_cn: 现在我们把这个迭代对象传递给枚举,创建一个枚举对象。

source: Old fashioned way:
es: A la antigua usanza:
ko: 구식 방법 :
ru: Старомодный способ:
zh_cn: 老式的方式。

source: Or alternatively
es: O alternativamente
ko: 또는 대안으로
ru: Или же
zh_cn: 或者说

source: Or get the length as <code>l = len(nums)</code>
es: O obtenga la longitud como <code>l = len(nums)</code>
ko: 또는 길이를 <code>l = len(nums)</code>
ru: Или получите длину как <code>l = len(nums)</code>
zh_cn: 或获得长度为 <code>l = len(nums)</code>

source: Or in languages that do not have a for-each loop:
es: O en idiomas que no tienen un bucle de cada uno:
ko: 또는 for-each 루프가없는 언어로 :
ru: Или на языках,которые не имеют петли для каждого:
zh_cn: 或者在没有for-each循环的语言中。

source: Please see <strong>different approaches</strong> which can be used to iterate over list and access index value and <strong>their performance metrics</strong> (which I suppose would be useful for you) in code samples below:
es: Vea los <strong>diferentes enfoques</strong> que se pueden usar para iterar sobre el valor de la lista y el &iacute;ndice de acceso y <strong>sus m&eacute;tricas de rendimiento</strong> (que supongo que ser&iacute;an &uacute;tiles para usted) en los ejemplos de c&oacute;digo a continuaci&oacute;n:
ko: 아래 코드 샘플에서 목록 및 액세스 인덱스 값과 <strong>해당 성능 메트릭</strong> (여러분에게 유용 할 것으로 예상 됨)을 반복하는 데 사용할 수있는 <strong>다양한 접근 방법</strong> 을 참조하십시오.
ru: Пожалуйста, ознакомьтесь с <strong>различными подходами,</strong> которые можно использовать для перебора списка и значения индекса доступа и <strong>их метрик производительности</strong> (которые, я полагаю, будут полезны для вас) в примерах кода ниже:
zh_cn: 请在以下代码示例中查看可用于遍历列表和访问索引值<strong>及其性能指标的</strong> <strong>不同方法</strong> （我认为这对您有用）：

source: Python indexes start at zero
es: Los índices de pitón comienzan en cero
ko: 파이썬 인덱스는 0에서 시작
ru: Питоновые индексы начинаются с нуля
zh_cn: Python索引从零开始
