Repository: rueisnom/feedback
Catalog: xlf/26/39/65/263965.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This highly upvoted legacy answer is technically correct but only covers a very specific scenario, when your string value is EXACTLY <code>"true"</code> or <code>"false"</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta respuesta heredada altamente votada es t&eacute;cnicamente correcta pero solo cubre un escenario muy espec&iacute;fico, cuando el valor de su cadena es EXACTAMENTE </font></font> <code>"true"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この非常に支持されたレガシー回答は技術的には正しいですが、文字列値が正確に</font></font> <code>"true"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>"false"</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある非常に特定のシナリオのみをカバーしています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 고도로 공명 된 레거시 답변은 기술적으로 정확하지만 문자열 값이 </font></font> <code>"true"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 경우 매우 구체적인 시나리오에만 적용됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот устаревший ответ с большим количеством голосов является технически правильным, но он охватывает только очень специфический сценарий, когда ваше строковое значение ТОЧНО </font></font> <code>"true"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从技术上讲，这个高度推崇的旧式答案是正确的，但是仅在您的字符串值完全为</font></font> <code>"true"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时，才涵盖非常特殊的情况</font><font style="vertical-align: inherit;">。</font></font>

source: This returns <code>false</code> for every falsy value and <code>true</code> for every truthy value except for <code>'false'</code>, <code>'f'</code>, <code>'no'</code>, <code>'n'</code>, and <code>'0'</code> (case-insensitive).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto devuelve </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cada valor falso y </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cada valor verdadero excepto </font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'f'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'no'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>'0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (no distingue entre may&uacute;sculas y min&uacute;sculas).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font><font style="vertical-align: inherit;">、</font> <code>'false'</code> <font style="vertical-align: inherit;">、</font> <code>'f'</code> <font style="vertical-align: inherit;">、</font> <code>'no'</code> <font style="vertical-align: inherit;">、</font> <code>'n'</code> <font style="vertical-align: inherit;">、および</font> <code>'0'</code> <font style="vertical-align: inherit;">（大文字と小文字を区別しない）</font><font style="vertical-align: inherit;">を除き、すべて</font><font style="vertical-align: inherit;">の偽の</font><font style="vertical-align: inherit;">値に対して</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">返し</font><font style="vertical-align: inherit;">、すべての</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値</font><font style="vertical-align: inherit;">に対して</font><font style="vertical-align: inherit;">true</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">返します</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이렇게 </font><font style="vertical-align: inherit;">하면 모든 잘못된 값에 대해 </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">반환 </font><font style="vertical-align: inherit;">하고 </font> <code>'false'</code> <font style="vertical-align: inherit;"> , </font> <code>'f'</code> <font style="vertical-align: inherit;"> , </font> <code>'no'</code> <font style="vertical-align: inherit;"> , </font> <code>'n'</code> <font style="vertical-align: inherit;"> 및 </font> <code>'0'</code> <font style="vertical-align: inherit;"> (대소 문자 구분)을 </font><font style="vertical-align: inherit;">제외한 모든 값에 대해서는 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">반환합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это возвращает </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для каждого ложного значения и </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для каждого истинного значения, за исключением </font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'f'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'no'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>'n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>'0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (без учета регистра).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此返回</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每falsy值与</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于不同的是每truthy值</font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>'f'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>'no'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>'n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，和</font></font> <code>'0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（不区分大小写）。</font></font>

source: This solution is not concise enough:
es: Esta solución no es lo suficientemente concisa:
ja: この解答では簡潔さが足りません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 솔루션은 간결하지 않습니다.</font></font>
ru: Это решение не достаточно лаконично:
zh_cn: 这个方案不够简明扼要。

source: This tests <code>myValue</code> against a regular expression , case-insensitive, and doesn't modify the prototype.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto prueba </font></font> <code>myValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contra una expresi&oacute;n regular, sin distinci&oacute;n entre may&uacute;sculas y min&uacute;sculas, y no modifica el prototipo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font><font style="vertical-align: inherit;">、大文字と小文字を区別しない正規表現に対して</font></font> <code>myValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">テストし</font><font style="vertical-align: inherit;">、プロトタイプを変更しません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">정규 표현식에 대해 </font></font> <code>myValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">테스트 </font><font style="vertical-align: inherit;">하고 대소 문자를 구분하지 않으며 프로토 타입을 수정하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это проверяет </font></font> <code>myValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на соответствие регулярному выражению без </font><font style="vertical-align: inherit;">учета</font><font style="vertical-align: inherit;"> регистра и не модифицирует прототип.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这</font></font> <code>myValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">针对不区分大小写的正则表达式</font><font style="vertical-align: inherit;">测试</font><font style="vertical-align: inherit;">myValue</font><font style="vertical-align: inherit;">，并且不会修改原型。</font></font>

source: To convert both string("true", "false") and boolean to boolean
es: Para convertir tanto string("true","false")como boolean a boolean
ja: string("true","false")とbooleanをbooleanに変換するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">string ( "true", "false") 및 boolean을 모두 부울로 변환하려면</font></font>
ru: Чтобы преобразовать и строку("true","false"),и булевую в булевую.
zh_cn: 将string("true","false")和boolean转换为boolean

source: UPDATE (without JSON):
es: ACTUALIZACIÓN (sin JSON):
ja: UPDATE(JSONなし)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업데이트 (JSON 제외) :</font></font>
ru: UPDATE (без JSON):
zh_cn: UPDATE(无JSON)。

source: Universal solution with JSON parse:
es: Solución universal con análisis JSON:
ja: JSONをパースしたユニバーサルソリューション。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON 구문 분석을 사용한 범용 솔루션 :</font></font>
ru: Универсальное решение с разбором JSON:
zh_cn: 带有JSON解析的通用解决方案。

source: Using <code>===</code> would just be silly in this case, as the field's <code>value</code> will always be a <code>String</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usar </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&iacute;a una tonter&iacute;a en este caso, ya que el </font></font> <code>value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del campo </font><font style="vertical-align: inherit;">siempre ser&aacute; una </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">も、フィールドの</font></font> <code>value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は常に</font></font> <code>String</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なるため</font><font style="vertical-align: inherit;">、この場合はばかげています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 경우 필드의 </font> <code>value</code> <font style="vertical-align: inherit;"> 은 항상 </font> <code>String</code> <font style="vertical-align: inherit;"> 이기 때문에 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용하는 </font><font style="vertical-align: inherit;">것은 어리석은 일입니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было бы просто глупо в этом случае, как месторождения </font></font> <code>value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> всегда будет </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这种情况下，</font><font style="vertical-align: inherit;">使用</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会很愚蠢，因为该字段的</font></font> <code>value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始终是</font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Where <code>flag</code> can be
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Donde la </font></font> <code>flag</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede ser</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>flag</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がある</font><font style="vertical-align: inherit;">場所</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어디 </font></font> <code>flag</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 될 수 있습니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Где </font></font> <code>flag</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может быть</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>flag</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以在</font><font style="vertical-align: inherit;">哪里</font></font>

source: Wood-eye be careful. After seeing the consequences after applying the the top answer with 500+ upvotes, I feel obligated to post something that is actually useful:
es: Wood-eye ten cuidado.Después de ver las consecuencias tras aplicar la respuesta superior con más de 500 votos alzados,me siento obligado a publicar algo que sea realmente útil:
ja: ウッドアイは注意してください。500以上のアップビューでトップアンサーを適用した結果を見た後、私は実際に役立つものを投稿する義務を感じています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우드 아이는 조심해야합니다. </font><font style="vertical-align: inherit;">500 개 이상의 공감 율로 최고 답변을 적용한 후 결과를 확인한 후 실제로 유용한 내용을 게시해야합니다.</font></font>
ru: Вуд-глаз будь осторожен.После того,как я увидел последствия после применения верхнего ответа с 500+upvotes,я чувствую себя обязанным разместить что-то,что действительно полезно:
zh_cn: 木眼要小心了。在看到了应用500+票数的顶峰答案后的后果,我觉得有义务贴出一些实际有用的东西。

source: You can use regular expressions:
es: Puedes usar expresiones regulares:
ja: 正規表現を使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정규식을 사용할 수 있습니다.</font></font>
ru: Вы можете использовать регулярные выражения:
zh_cn: 你可以使用正则表达式。

source: You could make it stricter by using the identity operator (<code>===</code>), which doesn't make any implicit type conversions when the compared variables have different types, instead of the equality operator (<code>==</code>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede hacerlo m&aacute;s estricto utilizando el operador de identidad ( </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), que no realiza conversiones de tipo impl&iacute;citas cuando las variables comparadas tienen diferentes tipos, en lugar del operador de igualdad ( </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等価演算子（</font> <code>==</code> <font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">代わりに、比較される変数の型が異なる場合に暗黙の型変換を行わない</font><font style="vertical-align: inherit;">ID演算子（</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">を使用して、より厳密にすることができ</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항등 연산자 ( </font> <code>==</code> <font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">대신 비교 변수에 다른 유형이있는 경우 암시 적 유형 변환을 수행하지 않는 </font><font style="vertical-align: inherit;">ID 연산자 ( </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">를 사용하여 더 엄격하게 만들 수 </font><font style="vertical-align: inherit;">있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете сделать его более строгим, используя оператор идентичности ( </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), который не делает никаких неявных преобразований типов, когда сравниваемые переменные имеют разные типы, вместо оператора равенства ( </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用身份运算符（</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">来使其更严格，</font><font style="vertical-align: inherit;">当比较的变量具有不同类型时，它不会进行任何隐式类型转换，而不是等于运算符（</font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: You need to separate (in your thinking) the value of your selections and the representation of that value.
es: Necesitas separar (en tu pensamiento)el valor de tus selecciones y la representación de ese valor.
ja: 自分の選択した価値と、その価値の表現を(思考の中で)分離する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선택의 가치와 그 가치의 표현을 (생각 중에) 분리해야합니다.</font></font>
ru: Вам необходимо разделить (по вашему мнению)значение вашего выбора и представление этого значения.
zh_cn: 你需要(在你的思考中)把你选择的价值和这个价值的表现形式分开。

source: You should probably <strong>be cautious about using these two methods</strong> for your specific needs:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Probablemente deber&iacute;a </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tener cuidado al usar estos dos m&eacute;todos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para sus necesidades espec&iacute;ficas:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはおそらく必要があり</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、これらの2つのメソッドを使用について注意が</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたの特定のニーズに合わせて：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 아마한다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 두 가지 방법 사용에 대한주의</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자의 특정 요구를 들어 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы, вероятно, должны </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">быть осторожны при использовании этих двух методов</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для ваших конкретных потребностей:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可能</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应谨慎使用这两种方法</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来满足您的特定需求：</font></font>

source: Your solution is fine.
es: Tu solución está bien.
ja: あなたの解決策は問題ありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신의 솔루션은 괜찮습니다.</font></font>
ru: Ваше решение в порядке.
zh_cn: 你的解决方案很好。
