Repository: rueisnom/feedback
Catalog: xlf/26/39/65/263965.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It's not necessary to cover all the <code>false</code> cases if you already know all of the <code>true</code> cases you'd have to account for. You can pass anything into this method that could pass for a <code>true</code> value (or add others, it's pretty straightforward), and everything else would be considered <code>false</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No es necesario cubrir todos los </font><font style="vertical-align: inherit;">casos </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si ya conoce todos los </font><font style="vertical-align: inherit;">casos </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que tendr&iacute;a que explicar. </font><font style="vertical-align: inherit;">Puede pasar cualquier cosa a este m&eacute;todo que pueda pasar por un </font><font style="vertical-align: inherit;">valor </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (o agregar otros, es bastante sencillo), y todo lo dem&aacute;s se considerar&iacute;a </font></font> <code>false</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考慮し</font><font style="vertical-align: inherit;">なければならないすべての</font> <code>true</code> <font style="vertical-align: inherit;">ケースを</font><font style="vertical-align: inherit;">すでに知っている場合は、</font><font style="vertical-align: inherit;">すべての</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース</font><font style="vertical-align: inherit;">をカバーする必要はありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">あなたはこのメソッドに</font> <code>true</code> <font style="vertical-align: inherit;">値を</font><font style="vertical-align: inherit;">渡すことができるものを渡すことができ</font><font style="vertical-align: inherit;">ます（または他のものを追加すると、それはかなり簡単です）、そして他のすべては</font> <code>false</code> <font style="vertical-align: inherit;">と見なされ</font><font style="vertical-align: inherit;">ます</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명해야 할 모든 </font> <code>true</code> <font style="vertical-align: inherit;"> 사례를 </font><font style="vertical-align: inherit;">이미 알고있는 경우 </font><font style="vertical-align: inherit;">모든 </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사례 </font><font style="vertical-align: inherit;">를 다룰 필요는 없습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 방법으로 모든 것을 전달하여 </font> <code>true</code> <font style="vertical-align: inherit;"> 가치 </font><font style="vertical-align: inherit;">를 전달할 수 있습니다 </font><font style="vertical-align: inherit;">(또는 다른 것을 추가하면 매우 간단합니다). 그 외의 모든 것은 </font> <code>false</code> <font style="vertical-align: inherit;"> 으로 간주됩니다</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нет необходимости покрывать все </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> случаи, если вы уже знаете все </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> случаи, которые вам придется учитывать. </font><font style="vertical-align: inherit;">Вы можете передать в этот метод все, что угодно, для </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> значения (или добавить другие, это довольно просто), а все остальное будет считаться </font></font> <code>false</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您已经知道所有</font> <code>true</code> <font style="vertical-align: inherit;">情况</font><font style="vertical-align: inherit;">，则</font><font style="vertical-align: inherit;">不必涵盖所有</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您可以将任何可以传递为</font> <code>true</code> <font style="vertical-align: inherit;">值的</font><font style="vertical-align: inherit;">方法传递给此方法</font><font style="vertical-align: inherit;">（或添加其他方法，这非常简单），其他所有内容都将被视为</font> <code>false</code> </font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Let's start with the shortest, but very strict way:
es: Empecemos con el camino más corto,pero muy estricto:
ja: まずは最短ではありますが、非常に厳しい方法から始めてみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 짧지 만 매우 엄격한 방법으로 시작하겠습니다.</font></font>
ru: Давайте начнем с самого короткого,но очень строгого пути:
zh_cn: 我们先用最短但很严格的方法来说明。

source: Like @Shadow2531 said, you can't just convert it directly. I'd also suggest that you consider string inputs besides "true" and "false" that are 'truthy' and 'falsey' if your code is going to be reused/used by others. This is what I use:
es: Como dijo @Shadow2531,no puedes convertirlo directamente.También sugeriría que considere entradas de cadena además de "verdadero" y "falso" que son "verdadero" y "falso" si su código va a ser reutilizado por otros.Esto es lo que yo uso:
ja: @Shadow2531さんがおっしゃったように、直接変換するだけではダメですよ。また、あなたのコードが他の人に再利用される場合は、「true」と「false」の他に「truthy」と「falsey」の文字列入力を検討することをお勧めします。これは私が使っているものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ Shadow2531이 말했듯이 직접 변환 할 수는 없습니다. </font><font style="vertical-align: inherit;">또한 코드가 다른 사람에 의해 재사용 / 사용될 경우 "참"및 "거짓"인 "true"및 "false"이외의 문자열 입력을 고려하는 것이 좋습니다. </font><font style="vertical-align: inherit;">이것이 내가 사용하는 것입니다 :</font></font>
ru: Как сказал @Shadow2531,ты не можешь просто преобразовать его напрямую.Я бы также предложил рассмотреть возможность использования строковых входов помимо "true" и "false",которые являются 'truthy' и 'falsey',если ваш код будет повторно использоваться другими.Это то,что я использую:
zh_cn: 就像@Shadow2531说的那样,你不能直接转换。我还建议你考虑除了 "true "和 "false "之外,如果你的代码要被别人重用的话,还可以考虑 "truthy "和 "falsey "之外的字符串输入。我就是这样使用的。

source: My preference, which I was shocked not to see already, is:
es: Mi preferencia,que me sorprendió no ver ya,es:
ja: すでに見ていないことにショックを受けた私の好み。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 아직 보지 못했던 내 선호는 다음과 같습니다.</font></font>
ru: Мое предпочтение,которое я был шокирован,не увидев уже:
zh_cn: 我的偏向,让我震惊的是,我的偏向,没有看到已经是。

source: My take on this question is that it aims to satisfy three objectives:
es: Mi opinión sobre esta cuestión es que pretende satisfacer tres objetivos:
ja: この質問に対する私の受け止め方は、3つの目的を満たすことを目的としているということです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 질문에 대한 나의 견해는 세 가지 목표를 충족시키는 것입니다.</font></font>
ru: Моя точка зрения на этот вопрос состоит в том,что он направлен на достижение трех целей:
zh_cn: 我对这个问题的看法是,它的目的是为了满足三个目标。

source: Pick a point in the JavaScript logic where they need to transition from string sentinels to native type and do a comparison there, preferably where it only gets done once for each value that needs to be converted. Remember to address what needs to happen if the string sentinel is not one the script knows (i.e. do you default to true or to false?)
es: Elija un punto en la lógica de JavaScript donde necesiten hacer la transición de centinelas de cadena a tipo nativo y haga una comparación allí,preferiblemente donde sólo se haga una vez por cada valor que necesite ser convertido.Recuerden que deben abordar lo que debe suceder si el centinela de la cadena no es uno que el script conoce (es decir,¿se predeterminan a verdadero o a falso?)
ja: JavaScript のロジックの中で、文字列センチネルからネイティブ型に移行する必要があるポイントを選び、そこで比較を行います。文字列センチネルがスクリプトが知っているものではない場合に何が起こるかを忘れないようにします (デフォルトを true にするのか false にするのかなど)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트 로직에서 문자열 센티넬에서 기본 유형으로 전환해야하는 지점을 선택하고 비교해야합니다. 변환해야하는 각 값에 대해 한 번만 수행되는 것이 좋습니다. </font><font style="vertical-align: inherit;">문자열 센티넬이 스크립트가 아는 것이 아니라면 어떻게해야하는지 기억해야합니다 (예 : 기본값은 true 또는 false입니까?)</font></font>
ru: Выберите точку в логике JavaScript,где они должны перейти от строковых sendinels к нативному типу,и проведите там сравнение,желательно там,где это делается только один раз для каждого значения,которое нужно преобразовать.Не забудьте указать,что должно произойти в случае,если строковый sendinel не тот,который известен скрипту (т.е.по умолчанию true или false?).
zh_cn: 在JavaScript逻辑中选择一个点,在那里他们需要从字符串发送器过渡到本地类型,并在那里做一个比较,最好是每个需要转换的值只做一次比较。记住,如果字符串发送器不是脚本所知道的字符串发送器,那么需要解决的是什么问题(例如,你是默认为true还是false?

source: Remember to match case:
es: Recuerde hacer coincidir el caso:
ja: ケースを一致させることを忘れないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대소 문자를 일치시켜야합니다.</font></font>
ru: Не забудь сопоставить дело:
zh_cn: 记得要匹配的情况下。

source: Return true/false for truthy and falsey values, but also return true/false for multiple string values that would be truthy or falsey if they were Booleans instead of strings.
es: Devuelve truefalse para valores de verdad y falsedad,pero también devuelve truefalse para valores de múltiples cuerdas que serían verdad o falsedad si fueran booleanos en lugar de cuerdas.
ja: truthy値やfalsey値に対してtruefalseを返しますが、文字列ではなくブーリアンであればtruthyやfalseyになる複数の文字列値に対してもtruefalseを返します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true 및 false 값의 경우 true / false를 반환하지만 문자열 대신 부울 인 경우 true 또는 false 인 여러 문자열 값의 경우 true / false를 반환합니다.</font></font>
ru: Возвращайте правдивость для правдивых и ложных значений,но также возвращайте правдивость для множества строковых значений,которые были бы правдивыми или ложными,если бы они были Булеанами вместо строк.
zh_cn: 对于真值和假值返回trueefalse,但对于多个字符串值,如果它们是布尔函数而不是字符串,也会返回trueefalse。

source: Second, provide a resilient interface so that values other than those specified will not fail, but rather return a default value
es: En segundo lugar,proporcionar una interfaz resistente para que los valores distintos de los especificados no fallen,sino que devuelvan un valor por defecto
ja: 第二に、指定された値以外の値が失敗せずにデフォルト値を返すように、弾力性のあるインターフェイスを提供します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘째, 지정된 값 이외의 값은 실패하지 않고 오히려 기본값을 반환하도록 복원력있는 인터페이스를 제공하십시오.</font></font>
ru: Во-вторых,обеспечить устойчивость интерфейса,чтобы значения,отличные от указанных,не выходили из строя,а возвращали значение по умолчанию.
zh_cn: 第二,提供一个弹性接口,使指定值以外的值不会失效,而是返回一个默认值

source: The Boolean object doesn't have a 'parse' method. <code>Boolean('false')</code> returns true, so that won't work. <code>!!'false'</code> also returns <code>true</code>, so that won't work also.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El objeto booleano no tiene un m&eacute;todo de 'an&aacute;lisis'. </font></font> <code>Boolean('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve verdadero, por lo que no funcionar&aacute;. </font></font> <code>!!'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n devuelve </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que tampoco funcionar&aacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブールオブジェクトには「解析」メソッドがありません。</font></font> <code>Boolean('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はtrueを返すため、機能しません。</font></font> <code>!!'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も</font></font> <code>true</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返す</font><font style="vertical-align: inherit;">ため、これも機能しません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부울 객체에는 'parse'메소드가 없습니다. </font></font> <code>Boolean('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 true를 반환하므로 작동하지 않습니다. </font></font> <code>!!'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 반환 </font><font style="vertical-align: inherit;">하므로 작동하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Логический объект не имеет метода parse. </font></font> <code>Boolean('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает true, так что это не сработает. </font></font> <code>!!'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также возвращает </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , так что это тоже не сработает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">布尔对象没有'parse'方法。</font></font> <code>Boolean('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回true，因此将不起作用。</font></font> <code>!!'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也返回</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因此也将不起作用。</font></font>

source: The expression you're looking for simply is
es: La expresión que estás buscando simplemente es
ja: あなたが求めている表現は単純に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 찾고있는 표현은</font></font>
ru: Выражение,которое вы ищете,просто
zh_cn: 你要找的表达方式很简单,就是

source: The only way I could find to determine the field's boolean value, once it was converted into a string, was to depend upon the literal value of its string representation.
es: La única forma que encontré para determinar el valor booleano del campo,una vez convertido en una cadena,fue depender del valor literal de su representación de la cadena.
ja: フィールドが文字列に変換された後、フィールドのブール値を決定する唯一の方法は、その文字列表現のリテラル値に依存することでした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필드의 부울 값을 결정하는 유일한 방법은 일단 문자열로 변환되면 문자열 표현의 리터럴 값에 의존하는 것입니다.</font></font>
ru: Единственный способ,который я смог найти,чтобы определить булевое значение поля,после того,как оно было преобразовано в строку,зависел от буквального значения его строкового представления.
zh_cn: 我唯一能找到的确定字段的布尔值的方法是,一旦它被转换为字符串,就只能依靠它的字符串表示的字面值。

source: The problem with using JSON is that it fails by causing a Javascript error. This solution is not resilient (though it satisfies 1 and 3):
es: El problema de usar JSON es que falla causando un error de Javascript.Esta solución no es resistente (aunque satisface 1 y 3):
ja: JSONを使用した場合の問題点は、Javascriptのエラーを起こして失敗することです。この解決策は回復力がありません(1と3を満たしていますが)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON 사용의 문제점은 Javascript 오류로 인해 실패한다는 것입니다. </font><font style="vertical-align: inherit;">이 솔루션은 탄력적이지 않습니다 (1과 3을 만족하더라도).</font></font>
ru: Проблема с использованием JSON заключается в том,что он дает сбой,вызывая ошибку Javascript.Это решение не является устойчивым (хотя оно удовлетворяет 1 и 3):
zh_cn: 使用JSON的问题在于,它的失败在于导致Javascript错误。这个解决方案没有弹性(尽管它满足了1和3)。

source: There are a lot of answers and it's hard to pick one. In my case, I prioritise the performance when choosing, so I create <a href="https://jsperf.com/cast-booleans">this jsPerf</a> that I hope can throw some light here.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay muchas respuestas y es dif&iacute;cil elegir una. </font><font style="vertical-align: inherit;">En mi caso, </font></font><a href="https://jsperf.com/cast-booleans"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">priorizo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el rendimiento al elegir, as&iacute; que creo </font><font style="vertical-align: inherit;">este jsPerf</font><font style="vertical-align: inherit;"> que espero pueda arrojar algo de luz aqu&iacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答えはたくさんあり、どれを選ぶかは難しいです。</font><font style="vertical-align: inherit;">私の場合、選択するときにパフォーマンスを優先するので、</font></font><a href="https://jsperf.com/cast-booleans"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このjsPerf</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を作成し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 답변이 있으며 하나를 선택하기가 어렵습니다. </font><font style="vertical-align: inherit;">필자의 경우 선택할 때 성능의 우선 순위를 지정하므로 </font><font style="vertical-align: inherit;">여기에 약간의 빛을 던질 수있는 </font></font><a href="https://jsperf.com/cast-booleans"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 jsPerf</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">만듭니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть много ответов, и трудно выбрать один. </font><font style="vertical-align: inherit;">В моем случае при выборе приоритетов я выбираю производительность, поэтому я создаю </font></font><a href="https://jsperf.com/cast-booleans"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этот jsPerf,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который, я надеюсь, сможет пролить свет на этот момент.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答案很多，很难选择一个。</font><font style="vertical-align: inherit;">就我而言，我在选择时会优先考虑性能，因此我创建了</font></font><a href="https://jsperf.com/cast-booleans"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个jsPerf</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，希望可以</font><font style="vertical-align: inherit;">对此有所启发</font><font style="vertical-align: inherit;">。</font></font>

source: There are already so many answers available. But following can be useful in some scenarios.
es: Ya hay tantas respuestas disponibles.Pero las siguientes pueden ser útiles en algunos escenarios.
ja: すでに非常に多くの答えが用意されています。しかし、以下のことは、いくつかのシナリオで有用であることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 많은 답변이 있습니다. </font><font style="vertical-align: inherit;">그러나 다음 시나리오는 일부 시나리오에서 유용 할 수 있습니다.</font></font>
ru: Ответов уже так много.Но в некоторых сценариях может быть полезным следующее.
zh_cn: 已经有了这么多的答案。但下面的答案在某些情况下可以派上用场。

source: They are linked to the related answer where you can find more information (pros and cons) about each one; specially in the comments.
es: Están vinculadas a la respuesta relacionada donde se puede encontrar más información (pros y contras)sobre cada una de ellas;especialmente en los comentarios.
ja: それらは、あなたがそれぞれについてのより多くの情報(長所と短所)を見つけることができる関連する回答にリンクされています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 당신이 각각에 대한 더 많은 정보 (장단점)를 찾을 수있는 관련 답변에 연결되어 있습니다. </font><font style="vertical-align: inherit;">특별히 의견에.</font></font>
ru: Они привязаны к соответствующему ответу,где вы можете найти больше информации (за и против)о каждом из них,особенно в комментариях.
zh_cn: 它们被链接到相关的答案,在这里你可以找到更多的信息(利与弊)关于每一个;特别是在评论中。

source: Third, do all this with as little code as possible.
es: Tercero,hacer todo esto con el menor código posible.
ja: 第三に、これらのことを可能な限り少ないコードで行うことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">셋째, 가능한 적은 코드로이 모든 작업을 수행하십시오.</font></font>
ru: В-третьих,делайте все это с как можно меньшим количеством кода.
zh_cn: 第三,尽可能用最少的代码来做这一切。

source: This can be useful where one examples with non-boolean values.
es: Esto puede ser útil cuando se trata de ejemplos con valores no booleanos.
ja: これは、非ブーリアン値を持つ例がある場合に便利です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부울 값이 아닌 예제가있는 경우 유용 할 수 있습니다.</font></font>
ru: Это может быть полезно,когда один пример с небулевыми значениями.
zh_cn: 当有一个非boolean值的例子时,这可能很有用。

source: This function can handle string as well as Boolean true/false.
es: Esta función puede manejar tanto la cuerda como el truefalse booleano.
ja: この関数は、文字列だけでなく、ブール値のtruefalseも扱うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 함수는 문자열과 부울 true / false를 처리 할 수 ​​있습니다.</font></font>
ru: Эта функция может обрабатывать как строки,так и булевские трюфели.
zh_cn: 这个函数既可以处理字符串,也可以处理布尔的truefalse。

source: This function performs the usual Boolean coercion with the exception of the strings "false" (case insensitive) and "0".
es: Esta función realiza la coacción booleana habitual,con la excepción de las cadenas "falso" (insensible a las mayúsculas y minúsculas)y "0".
ja: この関数は、文字列 "false" (大文字小文字を区別しない)と "0" を除いて、通常のブール値強制を行います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 함수는 문자열 "false"(대 / 소문자 구분 안 함) 및 "0"을 제외하고 일반적인 부울 강제 변환을 수행합니다.</font></font>
ru: Эта функция выполняет обычное булевское принуждение,за исключением строк "false" (нечувствительность к регистру)и "0".
zh_cn: 该函数执行通常的布尔强制,但字符串 "false"(不区分大小写)和 "0 "除外。

source: This has been taken from the accepted answer, but really it has a very weak point, and I am shocked how it got that count of upvotes, the problem with it that you have to consider the case of the string because this is case sensitive
es: Esto ha sido tomado de la respuesta aceptada,pero en realidad tiene un punto muy débil,y me sorprende cómo llegó a ese conteo de votos altos,el problema con él es que hay que considerar el caso de la cuerda porque esto es sensible a las mayúsculas y minúsculas.
ja: これは受け入れられた答えから取られていますが、本当にそれは非常に弱いポイントを持っており、私はそれがアップビューのそのカウントを得た方法にショックを受けています、これは大文字小文字が区別されているので、文字列の大文字小文字を考慮する必要があることをそれの問題
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 받아 들인 대답에서 가져 왔지만 실제로는 매우 약한 점이 있습니다. 대소수를 구분하기 때문에 문자열의 대소 문자를 고려해야하는 문제는 얼마나 많은 공짜를 얻었는지에 놀랐습니다.</font></font>
ru: Это было взято из принятого ответа,но на самом деле у него есть очень слабое место,и я шокирован тем,как он получил этот подсчет голосов,проблема с ним в том,что вы должны рассмотреть случай строки,потому что это чувствительный к регистру
zh_cn: 这句话是从公认的答案中提取的,但它确实有一个很弱的地方,我很震惊,它怎么会有那么多的投票数,它的问题是你必须考虑到字符串的大小写,因为这是大小写的问题
