Repository: rueisnom/feedback
Catalog: xlf/26/39/65/263965.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Won't work in older browsers of course and Firefox shows false while Opera, Chrome, Safari and IE show true. <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760">Bug 720760</a>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(No funcionar&aacute; en navegadores antiguos, por supuesto, y Firefox muestra falso, mientras que Opera, Chrome, Safari e IE muestran verdadero. </font></font><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Error 720760</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（もちろん、古いブラウザでは機能せず、Firefoxはfalseを表示しますが、Opera、Chrome、Safari、IEはtrueを表示します。</font></font><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バグ720760</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(오래된 브라우저에서는 작동하지 않으며 Opera, Chrome, Safari 및 IE는 true로 표시되는 반면 Firefox는 false로 표시됩니다. </font></font><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버그 720760</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Конечно, не будет работать в старых браузерах, и Firefox показывает false, тогда как Opera, Chrome, Safari и IE показывают true. </font></font><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ошибка 720760</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（当然，这在较旧的浏览器中将无法使用，而Firefox显示为false，而Opera，Chrome，Safari和IE显示为true。</font></font><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=720760"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误720760</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>

source: <a href="https://stackoverflow.com/a/2114091/2824333"><strong>Switch case on Bool object</strong></a>: 2,825,469
es: <a href="https://stackoverflow.com/a/2114091/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cambie el caso en el objeto Bool</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2,825,469</font></font>
ja: <a href="https://stackoverflow.com/a/2114091/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Boolオブジェクトのスイッチケース</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：2,825,469</font></font>
ko: <a href="https://stackoverflow.com/a/2114091/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bool 오브젝트의 케이스 전환</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2,825,469</font></font>
ru: <a href="https://stackoverflow.com/a/2114091/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Корпус переключателя на объекте Bool</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2 825 469</font></font>
zh_cn: <a href="https://stackoverflow.com/a/2114091/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在Bool对象上切换大小写</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：2,825,469</font></font>

source: <a href="https://stackoverflow.com/a/21285901/2824333"><strong>!! conversions</strong></a>: 805,322
es: <a href="https://stackoverflow.com/a/21285901/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">!! </font><font style="vertical-align: inherit;">conversiones</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 805,322</font></font>
ja: <a href="https://stackoverflow.com/a/21285901/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">!! </font><font style="vertical-align: inherit;">変換</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：805,322</font></font>
ko: <a href="https://stackoverflow.com/a/21285901/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">!! </font><font style="vertical-align: inherit;">전환</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 805,322</font></font>
ru: <a href="https://stackoverflow.com/a/21285901/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">!! </font><font style="vertical-align: inherit;">конверсии</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 805,322</font></font>
zh_cn: <a href="https://stackoverflow.com/a/21285901/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">!! </font><font style="vertical-align: inherit;">转换次数</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：805,322</font></font>

source: <a href="https://stackoverflow.com/a/264037/2824333"><strong>Conditional statement</strong></a>: 2,826,922
es: <a href="https://stackoverflow.com/a/264037/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Declaraci&oacute;n condicional</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2.826.922</font></font>
ja: <a href="https://stackoverflow.com/a/264037/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">条件付きステートメント</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：2,826,922</font></font>
ko: <a href="https://stackoverflow.com/a/264037/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조건문</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2,826,922</font></font>
ru: <a href="https://stackoverflow.com/a/264037/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Условное заявление</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 2 826 922</font></font>
zh_cn: <a href="https://stackoverflow.com/a/264037/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有条件的陈述</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：2,826,922</font></font>

source: <a href="https://stackoverflow.com/a/264180/2824333"><strong>Prototype of String</strong></a>: 713,637
es: <a href="https://stackoverflow.com/a/264180/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prototipo de cuerda</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 713,637</font></font>
ja: <a href="https://stackoverflow.com/a/264180/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列のプロトタイプ</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：713,637</font></font>
ko: <a href="https://stackoverflow.com/a/264180/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 프로토 타입</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 713,637</font></font>
ru: <a href="https://stackoverflow.com/a/264180/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Прототип строки</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 713 637</font></font>
zh_cn: <a href="https://stackoverflow.com/a/264180/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符串原型</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：713,637</font></font>

source: <a href="https://stackoverflow.com/a/7833897/2824333"><strong>Casting to JSON</strong></a>: 1,867,774
es: <a href="https://stackoverflow.com/a/7833897/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Casting a JSON</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 1,867,774</font></font>
ja: <a href="https://stackoverflow.com/a/7833897/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSONへのキャスト</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：1,867,774</font></font>
ko: <a href="https://stackoverflow.com/a/7833897/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSON으로 전송</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 1,867,774</font></font>
ru: <a href="https://stackoverflow.com/a/7833897/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кастинг в JSON</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 1,867,774</font></font>
zh_cn: <a href="https://stackoverflow.com/a/7833897/2824333"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转换为JSON</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：1,867,774</font></font>

source: <code>if (String(a) == "true")</code> ...
es: <code>if (String(a) == "true")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ja: <code>if (String(a) == "true")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ko: <code>if (String(a) == "true")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ... 인 경우</font></font>
ru: <code>if (String(a) == "true")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
zh_cn: <code>if (String(a) == "true")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>

source: <em><strong>Always</strong></em> use the === operator instead of the == operator for these types of conversions!
es: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Utilice siempre</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el operador === en lugar del operador == para este tipo de conversiones!</font></font>
ja: <em><strong><font style="vertical-align: inherit;"></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらのタイプの変換では、==演算子の代わりに===演算子を</font><em><strong><font style="vertical-align: inherit;">常に</font></strong></em><font style="vertical-align: inherit;">使用してください！</font></font>
ko: <em><strong><font style="vertical-align: inherit;"></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 유형의 변환에는</font><em><strong><font style="vertical-align: inherit;"> 항상</font></strong></em><font style="vertical-align: inherit;"> == 연산자 대신 === 연산자를 사용하십시오!</font></font>
ru: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Всегда</font></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используйте оператор === вместо оператора == для этих типов преобразований!</font></font>
zh_cn: <em><strong><font style="vertical-align: inherit;"></font></strong></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于这些类型的转换，请</font><em><strong><font style="vertical-align: inherit;">始终</font></strong></em><font style="vertical-align: inherit;">使用===运算符而不是==运算符！</font></font>

source: <strong>Original answer:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Respuesta original:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元の答え：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 답변 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оригинальный ответ:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原始答案：</font></font></strong>

source: Also, if it's a form element checkbox, you can also detect if the checkbox is checked:
es: Además,si se trata de una casilla de verificación de un elemento de forma,también se puede detectar si la casilla está marcada:
ja: また、フォーム要素のチェックボックスであれば、チェックボックスにチェックが入っているかどうかを検出することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 양식 요소 확인란 인 경우 확인란이 선택되어 있는지 확인할 수도 있습니다.</font></font>
ru: Также,если это элемент формы,вы можете определить,установлен ли этот флажок:
zh_cn: 另外,如果是表单元素复选框,也可以检测是否勾选。

source: An invalid json string passed into these functions below <strong>WILL throw an exception</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una cadena json no v&aacute;lida pasada a estas funciones a continuaci&oacute;n </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lanzar&aacute; una excepci&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらの関数に渡された無効なjson文字列は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、例外をスローします</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유효하지 않은 json 문자열이 아래 함수에 전달 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">되면 예외가 발생</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недопустимая строка json, переданная в эти функции ниже, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вызовет исключение</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在下面的函数中传递的无效json字符串</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将引发异常</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: And end with a proper, more tolerant way:
es: Y terminar con una forma adecuada y más tolerante:
ja: そして、きちんとした、もっと寛容な方法で終わらせてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">적절하고 더 관대 한 방법으로 끝납니다.</font></font>
ru: И закончить правильным,более терпимым способом:
zh_cn: 并以适当的、更宽容的方式结束。

source: Any string which isn't the empty string will evaluate to <code>true</code> by using them. Although they're the cleanest methods I can think of concerning to boolean conversion, I think they're not what you're looking for.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cualquier cadena que no sea la cadena vac&iacute;a se evaluar&aacute; como </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al usarlas. </font><font style="vertical-align: inherit;">Aunque son los m&eacute;todos m&aacute;s limpios que se me ocurren en relaci&oacute;n con la conversi&oacute;n booleana, creo que no son lo que est&aacute;s buscando.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">空の文字列ではない文字列は、</font><font style="vertical-align: inherit;">それらを使用し</font><font style="vertical-align: inherit;">て</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と評価され</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これらはブール変換に関して考えることができる最もクリーンな方法ですが、あなたが探しているものではないと思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빈 문자열이 아닌 문자열은 </font><font style="vertical-align: inherit;">사용하여 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 </font><font style="vertical-align: inherit;">평가됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">부울 변환과 관련하여 내가 생각할 수있는 가장 깨끗한 방법이지만, 당신이 찾고있는 것이 아니라고 생각합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Любая строка, которая не является пустой строкой, будет иметь значение </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используя их. </font><font style="vertical-align: inherit;">Хотя это самые чистые методы, которые я могу придумать в отношении логического преобразования, я думаю, что это не то, что вы ищете.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任何不是空字符串的字符串都将</font><font style="vertical-align: inherit;">通过使用它们</font><font style="vertical-align: inherit;">来评估为</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">尽管它们是我可以想到的与布尔转换有关的最干净的方法，但我认为它们并不是您想要的。</font></font>

source: Assuming that if it is checked, it is "set" equal to true. This evaluates as true/false.
es: Suponiendo que si se comprueba,se "fija" igual a la verdad.Esto se evalúa como verdadero.
ja: チェックされている場合は、trueに等しい「設定」されていると仮定します。これはtruefalseとして評価されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체크되어 있다고 가정하면, "set"은 true와 같습니다. </font><font style="vertical-align: inherit;">이것은 참 / 거짓으로 평가됩니다.</font></font>
ru: Предположим,что если она отмечена,то "установлено" равно true.Это оценивается как верное.
zh_cn: 假设如果被选中,则 "设置 "等于true。这将被评价为trueefalse。

source: Brief of results (the higher the better):
es: Resumen de los resultados (cuanto más alto mejor):
ja: 結果の概要(高い方が良い)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과 요약 (높을수록 좋음) :</font></font>
ru: Краткий обзор результатов (чем выше,тем лучше):
zh_cn: 成果简介(越高越好)。

source: Can I convert a string representing a boolean value (e.g., 'true', 'false') into a intrinsic type in JavaScript?
es: ¿Puedo convertir una cadena que representa un valor booleano (por ejemplo,'true','false')en un tipo intrínseco en JavaScript?
ja: JavaScriptでブール値(例:'true','false')を表す文字列を本質的な型に変換することはできますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부울 값 (예 : 'true', 'false')을 나타내는 문자열을 JavaScript에서 내장 유형으로 변환 할 수 있습니까?</font></font>
ru: Могу ли я в JavaScript преобразовать строку,представляющую собой булевое значение (например,'true','false'),в собственный тип?
zh_cn: 我可以将代表布尔值(如'true'、'false')的字符串转换为JavaScript中的内在类型吗?

source: Demonstration below:
es: Demostración abajo:
ja: 下のデモ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 데모 :</font></font>
ru: Демонстрация ниже:
zh_cn: 以下是示范。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: For those (see the comments) that would like to extend the String object to get this but are worried about enumerability and are worried about clashing with other code that extends the String object:
es: Para aquellos (ver los comentarios)que quisieran extender el objeto String para obtener esto pero están preocupados por la enumerabilidad y están preocupados por chocar con otro código que extienda el objeto String:
ja: これを得るためにStringオブジェクトを拡張したいが、列挙性が心配で、Stringオブジェクトを拡張する他のコードとの衝突を心配している人のために(コメントを参照してください)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 얻기 위해 String 객체를 확장하고 싶지만 열거 가능성에 대해 걱정하고 String 객체를 확장하는 다른 코드와 충돌하는 것을 걱정하는 사람들 (주석 참조)의 경우 :</font></font>
ru: Для тех (см.комментарии),кто хотел бы расширить объект Строка,чтобы получить это,но беспокоится о перечисляемости и беспокоится о столкновении с другим кодом,который расширяет объект Строка:
zh_cn: 对于那些想扩展String对象来获得这个东西,但又担心枚举性,担心与其他扩展了String对象的代码发生冲突的人(见注释)。

source: Hands down the easiest way (assuming you string will be 'true' or 'false') is:
es: Sin duda,la forma más fácil (suponiendo que tu cuerda sea "verdadera" o "falsa")es:
ja: 最も簡単な方法は(文字列が 'true' または 'false' であると仮定して)、以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 쉬운 방법은 다음과 같습니다 (문자열이 'true'또는 'false'라고 가정).</font></font>
ru: Самый простой способ (предполагая,что ваша строка будет 'true' или 'false')-это опустить руки:
zh_cn: 最简单的方法(假设你的字符串是 "真 "或 "假")。

source: Holy god some of these answers are just wild. I love JS and its infinite number of ways to skin a bool.
es: Santo Dios,algunas de estas respuestas son simplemente salvajes.Me encanta JS y su infinita cantidad de formas de despellejar un bool.
ja: 何てこった、これらの答えのいくつかはまさにワイルドです。私は、JS と、bool の皮を剥ぐ方法が無限にあるのが大好きです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이런 신들 중 일부는 거칠다. </font><font style="vertical-align: inherit;">나는 JS와 부울을 스키닝하는 수많은 방법을 좋아합니다.</font></font>
ru: Святой бог,некоторые из этих ответов просто дикие.Я люблю JS и его бесконечное количество способов снять кожу с шкуры.
zh_cn: 我的天啊,有些答案简直太疯狂了。我喜欢JS和它的无限多的bool剥皮方法。

source: How about?
es: ¿Qué tal?
ja: どうですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어때요?</font></font>
ru: Как насчет?
zh_cn: 怎么样?

source: How can I convert a string to boolean in JavaScript
es: ¿Cómo puedo convertir una cadena a booleana en JavaScript
ja: JavaScriptで文字列をブール値に変換する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript에서 문자열을 부울로 변환하는 방법</font></font>
ru: Как преобразовать строку в булевую в JavaScript
zh_cn: 如何在JavaScript中将字符串转换为布尔值?
