Repository: rueisnom/feedback
Catalog: xlf/26/39/65/263965.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I also created fiddle to test it <a href="http://jsfiddle.net/remunda/2GRhG/">http://jsfiddle.net/remunda/2GRhG/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n cre&eacute; el viol&iacute;n para probarlo </font></font><a href="http://jsfiddle.net/remunda/2GRhG/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/remunda/2GRhG/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はそれをテストするためにフィドルも作成しました</font></font><a href="http://jsfiddle.net/remunda/2GRhG/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/remunda/2GRhG/</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 또한 그것을 테스트하기 위해 바이올린을 만들었습니다 </font></font><a href="http://jsfiddle.net/remunda/2GRhG/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/remunda/2GRhG/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я также создал скрипку, чтобы проверить ее </font></font><a href="http://jsfiddle.net/remunda/2GRhG/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/remunda/2GRhG/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我还创建了小提琴来对其进行测试</font></font><a href="http://jsfiddle.net/remunda/2GRhG/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/remunda/2GRhG/</font></font></a>

source: I am working on solving this exact problem for <a href="http://typecastjs.org">Typecast.js</a>. And the best solution to all three objectives is this one:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Estoy trabajando para resolver este problema exacto para </font></font><a href="http://typecastjs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typecast.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y la mejor soluci&oacute;n para los tres objetivos es esta:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://typecastjs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typecast.jsの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この正確な問題の解決に取り組んでい</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そして、3つの目的すべてに対する最良の解決策はこれです。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://typecastjs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typecast.js에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한이 정확한 문제를 해결하기 위해 노력하고 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">세 가지 목표 모두에 대한 최상의 솔루션은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я работаю над решением этой проблемы для </font></font><a href="http://typecastjs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typecast.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">И лучшее решение для всех трех целей это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我正在为</font></font><a href="http://typecastjs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typecast.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决这个确切的问题</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这三个目标的最佳解决方案是：</font></font>

source: I have a hidden form in HTML that is updated based upon a user's selection within a list. This form contains some fields which represent boolean values and are dynamically populated with an intrinsic boolean value. However, once this value is placed into the hidden input field it becomes a string.
es: Tengo un formulario oculto en HTML que se actualiza en base a la selección de un usuario dentro de una lista.Este formulario contiene algunos campos que representan valores booleanos y están poblados dinámicamente con un valor booleano intrínseco.Sin embargo,una vez que este valor se coloca en el campo de entrada oculto se convierte en una cadena.
ja: 私は、リスト内のユーザーの選択に基づいて更新されるHTMLの隠しフォームを持っています。このフォームはブール値を表すいくつかのフィールドを含んでおり、本質的なブール値で動的に入力されます。しかし、一度この値が隠された入力フィールドに置かれると、それは文字列になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">목록에서 사용자의 선택에 따라 업데이트되는 HTML의 숨겨진 양식이 있습니다. </font><font style="vertical-align: inherit;">이 형식에는 부울 값을 나타내는 일부 필드가 포함되며 고유 부울 값으로 동적으로 채워집니다. </font><font style="vertical-align: inherit;">그러나이 값이 숨겨진 입력 필드에 배치되면 문자열이됩니다.</font></font>
ru: У меня есть скрытая форма в HTML,которая обновляется на основе выбора пользователя в списке.Эта форма содержит некоторые поля,которые представляют собой булевые значения и динамически заполняются внутренним булевым значением.Однако,как только это значение помещается в скрытое поле ввода,оно становится строкой.
zh_cn: 我有一个HTML中的隐藏表单,它根据用户在列表中的选择来更新。这个表单包含了一些代表布尔值的字段,并动态地填充了一个内在的布尔值。然而,一旦这个值被放到隐藏的输入字段中,它就变成了一个字符串。

source: I prefer this method to the ones mentioned because it doesn't rely on a 3rd party to parse the code (i.e: eval/JSON.parse), which is overkill in my mind, it's short enough to not require a utility function and maintains other truthey/falsey conventions.
es: Prefiero este método a los mencionados porque no depende de un tercero para analizar el código (es decir:evalJSON.parse),lo cual es exagerado en mi mente,es lo suficientemente corto como para no requerir una función de utilidad y mantiene otras convenciones de la verdad.
ja: 私はこの方法の方が良いと思っています。これは私の中ではやり過ぎだと思っていますが(例:evalJSON.parse)、コードをパースするためにサードパーティに頼らなくても良いし、ユーティリティ関数を必要としないほど短くて済むし、他のtrutheyyfalseyの規約を維持しているからです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필자가 언급 한 것 보다이 방법을 선호합니다. 제 3자가 코드를 구문 분석하기 위해 의존하지 않기 때문에 (예 : eval / JSON.parse), 유틸리티 기능이 필요하지 않고 유지 보수가 필요하지 않습니다. 다른 진실 / 거짓말 협약.</font></font>
ru: Я предпочитаю этот метод,так как он не полагается на третье лицо при разборе кода (т.е.evalJSON.parse),что,на мой взгляд,чересчур убого,он достаточно короток,чтобы не требовать утилитарную функцию и поддерживает другие конвенции по правдоподобию.
zh_cn: 我更喜欢这个方法,因为它不依赖第三方来解析代码(即:evalJSON.parse),这在我看来是矫枉过正,它足够短,不需要一个实用程序函数,并且保持了其他的trutheyfalsey约定。

source: I think this is much universal:
es: Creo que esto es muy universal:
ja: これははるかに普遍的なことだと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 매우 보편적이라고 생각합니다.</font></font>
ru: Я думаю,это очень универсально:
zh_cn: 我想这是很有普遍性的。

source: I thought that @Steven 's answer was the best one, and took care of a lot more cases than if the incoming value was just a string. I wanted to extend it a bit and offer the following:
es: Pensé que la respuesta de @Steven era la mejor,y se ocupó de muchos más casos que si el valor entrante fuera sólo una cadena.Quería extenderlo un poco y ofrecer lo siguiente:
ja: 私は、@Steven 'sの答えが最良のものだと思っていましたし、受信値が単なる文字列である場合よりも多くのケースを考慮していました。私はそれを少し拡張して、以下を提供したいと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Steven의 대답이 가장 좋은 것이라고 생각하고 들어오는 값이 문자열 인 경우보다 훨씬 더 많은 경우를 처리했습니다. </font><font style="vertical-align: inherit;">나는 그것을 조금 확장하고 다음을 제공하고 싶었다.</font></font>
ru: Я подумал,что ответ @Steven's был лучшим,и позаботился о гораздо большем количестве случаев,чем если бы входящее значение было просто строкой.Я хотел немного расширить его и предложить следующее:
zh_cn: 我认为@Steven的答案是最好的答案,比起传入值只是一个字符串的情况,我认为他的答案是最好的,而且解决了更多的情况。我想把它扩展一下,并提供以下几点。

source: I use the following:
es: Uso lo siguiente:
ja: 私は以下のように使っています。
ko: 나는 다음을 사용한다 :
ru: Я использую следующее:
zh_cn: 我用的是:

source: I'm a little late, but I have a little snippet to do this, it essentially maintains all of JScripts truthey/falsey/<em>filthy</em>-ness but includes <code>"false"</code> as an acceptible value for false.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Llego un poco tarde, pero tengo un peque&ntilde;o fragmento para hacer esto, esencialmente mantiene todos los JScripts truthey / falsey / </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">asqueroso,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero incluye </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como un valor aceptable para falso.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は少し遅れましたが、これを実行するための小さなスニペットがあります。これは、すべてのJScriptを真実/偽/ </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不潔に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">維持しますが</font><font style="vertical-align: inherit;">、許容される偽の値として</font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">含み</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조금 늦었지만이 작업을 수행하기 위해 약간의 스 니펫이 있습니다 .JScript의 모든 진실 / 거짓 / </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더러움을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유지하지만 </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 false의 허용 가능한 값으로 포함합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я немного поздно, но у </font><font style="vertical-align: inherit;">меня есть небольшой отрывок , </font><font style="vertical-align: inherit;">чтобы сделать это, по </font><font style="vertical-align: inherit;">существу , </font><font style="vertical-align: inherit;">поддерживает все JScripts truthey / falsey / </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нечисто</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -ness , </font><font style="vertical-align: inherit;">но включает в </font><font style="vertical-align: inherit;">себя </font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как acceptible значение для ложных.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我有点晚了，但我有一个小片段来做到这一点，它本质上维护所有JScripts truthey / falsey /的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">肮脏</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -ness但包括</font></font> <code>"false"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为假的acceptible值。</font></font>

source: I'm using this one
es: Estoy usando este
ja: 私はこれを使っています
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것을 사용하고 있습니다</font></font>
ru: Я использую этот
zh_cn: 我用的是这个

source: If you like extending the String class you can do:
es: Si te gusta extender la clase de Cuerdas puedes hacerlo:
ja: Stringクラスを拡張するのが好きな人ならできると思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String 클래스를 확장하고 싶다면 다음을 수행하십시오.</font></font>
ru: Если вам нравится расширять класс "Строки",вы можете это сделать:
zh_cn: 如果你喜欢扩展String类,你可以这样做。

source: If you want string <code>'true'</code> to return boolean <code>true</code> and string <code>'false'</code> to return boolean <code>false</code>, then the simplest solution is to use <code>eval()</code>. <code>eval('true')</code> returns true and <code>eval('false')</code> returns false. Keep in mind the performance implications when using <code>eval()</code> though.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea que la cadena </font></font> <code>'true'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelva boolean </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y la cadena </font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelva boolean </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , entonces la soluci&oacute;n m&aacute;s simple es usar </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>eval('true')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve verdadero y </font></font> <code>eval('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve falso. </font><font style="vertical-align: inherit;">Sin </font><font style="vertical-align: inherit;">embargo, </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cuenta las implicaciones de rendimiento al usar </font><font style="vertical-align: inherit;">eval ()</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列</font></font> <code>'true'</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブール値</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を返し</font><font style="vertical-align: inherit;">、文字列</font></font> <code>'false'</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブール値</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を返す</font><font style="vertical-align: inherit;">場合、最も簡単な解決策は</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用すること</font><font style="vertical-align: inherit;">です。</font></font> <code>eval('true')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はtrueを返し、</font></font> <code>eval('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はfalseを返します。</font><font style="vertical-align: inherit;">ただし、</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する場合は、パフォーマンスへの影響に</font><font style="vertical-align: inherit;">注意し</font><font style="vertical-align: inherit;">てください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 </font></font> <code>'true'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 부울 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 리턴 </font><font style="vertical-align: inherit;">하고 문자열 </font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 부울 </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 리턴 </font><font style="vertical-align: inherit;">하도록하려면 가장 간단한 해결책은 </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하는 것 </font><font style="vertical-align: inherit;">입니다. </font></font> <code>eval('true')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 true를 반환하고 </font></font> <code>eval('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 false를 반환합니다. </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 때 성능에 미치는 영향을 명심하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите, чтобы строка </font></font> <code>'true'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращала логическое значение </font></font> <code>true</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а строка </font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращала логическое значение </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , самое простое решение - использовать </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>eval('true')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает true, а </font></font> <code>eval('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает false. </font><font style="vertical-align: inherit;">Помните о влиянии на производительность при использовании </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您希望字符串</font></font> <code>'true'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回布尔值</font></font> <code>true</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而字符串</font></font> <code>'false'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回布尔值</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则最简单的解决方案是使用</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font> <code>eval('true')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回true，而</font></font> <code>eval('false')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回false。</font><font style="vertical-align: inherit;">但是请记住，在使用</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时</font><font style="vertical-align: inherit;">会对</font><font style="vertical-align: inherit;">性能产生影响</font><font style="vertical-align: inherit;">。</font></font>

source: In other words, yes, you need to depend on the string's value. :-)
es: En otras palabras,sí,necesitas depender del valor de la cadena.:-)
ja: つまり、文字列の値に依存する必要があるということですね。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다시 말해, 문자열 값에 의존해야합니다. </font><font style="vertical-align: inherit;">:-)</font></font>
ru: Другими словами,да,нужно зависеть от значения строки.:-)
zh_cn: 换句话说,是的,你需要依赖字符串的值。 :-)

source: Is there a better way to accomplish this?
es: ¿Hay una mejor manera de lograr esto?
ja: もっと良い方法はないのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 달성하는 더 좋은 방법이 있습니까?</font></font>
ru: Есть ли лучший способ сделать это?
zh_cn: 有没有更好的方法来完成这个任务?

source: It goes:
es: Se va:
ja: それは行く。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간다 :</font></font>
ru: Идет:
zh_cn: 它去了。

source: It will return an error when some other text is given rather than true or false regardless of the case and it will capture the numbers also as
es: Devolverá un error cuando se dé algún otro texto en lugar de verdadero o falso,independientemente del caso,y capturará los números también como
ja: これは、大文字小文字に関わらず、trueかfalseではなく、他のテキストが与えられた場合にエラーを返します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대소 문자에 관계없이 true 또는 false가 아닌 다른 텍스트가 제공되면 오류를 반환하고 숫자를 다음과 같이 캡처합니다.</font></font>
ru: Он вернет ошибку,когда дается какой-то другой текст,а не истинный или ложный,вне зависимости от случая,и запишет числа также как
zh_cn: 当给出其他文本时,它将返回一个错误,而不是真值或假值,不管是什么情况,它都会返回一个错误,并且它也会将数字捕获为

source: It works for many cases, does not fail when values like {} are passed in, and is very concise. Also it returns false as the default value rather than undefined or throwing an Error, which is more useful in loosely-typed Javascript development. Bravo to the other answers that suggested it!
es: Funciona en muchos casos,no falla cuando se pasan valores como {}y es muy conciso.También devuelve false como valor por defecto en lugar de indefinido o lanzando un error,lo cual es más útil en el desarrollo de Javascript de tipo suelto.¡Bravo por las otras respuestas que lo sugirieron!
ja: これは多くの場合に動作し、{}のような値が渡されても失敗せず、非常に簡潔です。また、未定義やエラーを投げるのではなく、デフォルト値としてfalseを返します。それを提案してくれた他の回答者に感謝します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 경우에 작동하며 {}와 같은 값이 전달 될 때 실패하지 않으며 매우 간결합니다. </font><font style="vertical-align: inherit;">또한 정의되지 않았거나 오류를 발생시키는 것이 아니라 기본값으로 false를 반환하므로 느슨하게 형식화 된 Javascript 개발에 더 유용합니다. </font><font style="vertical-align: inherit;">그것을 제안한 다른 답변에 브라보!</font></font>
ru: Она работает во многих случаях,не подводит,когда передаются значения типа {},и очень лаконична.Также он возвращает false в качестве значения по умолчанию,а не неопределенное или выбрасывает Error,что более удобно при свободной разработке Javascript.Браво другим ответам,которые это предлагали!
zh_cn: 它在很多情况下都可以工作,在传递{}等值时不会失败,而且非常简洁。此外,它还返回false作为默认值,而不是undefined或抛出Error,这在松散类型的Javascript开发中更有用。祝贺其他提出这个问题的回答者!
