Repository: rueisnom/feedback
Catalog: xlf/26/39/65/263965.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: another solution. <a href="http://jsfiddle.net/r5p7qobn/">jsFiddle</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">otra soluci&oacute;n. </font></font><a href="http://jsfiddle.net/r5p7qobn/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別のソリューション。 </font></font><a href="http://jsfiddle.net/r5p7qobn/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 해결책. </font></font><a href="http://jsfiddle.net/r5p7qobn/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">другое решение. </font></font><a href="http://jsfiddle.net/r5p7qobn/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一个解决方案。 </font></font><a href="http://jsfiddle.net/r5p7qobn/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>

source: as in
es: como en
ja: に於いて
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서와 같이</font></font>
ru: в смысле
zh_cn: 如同

source: or with jQuery
es: o con jQuery
ja: またはjQueryを使って
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 jQuery와 함께</font></font>
ru: или с помощью jQuery
zh_cn: 或用jQuery

source: test cases run in node
es: los casos de prueba se ejecutan en el nodo
ja: ノード内で実行されるテストケース
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트 사례는 노드에서 실행</font></font>
ru: тестовые случаи в узле
zh_cn: 节点中运行的测试用例

source: why don't you try something like this
es: ¿por qué no intentas algo como esto
ja: こうしたらどうだ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 이런 식으로 시도하지 않습니까</font></font>
ru: почему бы тебе не попробовать что-нибудь подобное
zh_cn: 你为什么不试试这样的东西
