Repository: rueisnom/feedback
Catalog: xlf/11/44/78/3/1144783.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The tests were performed on Chrome 79.0, Safari 13.0.4 and Firefox 71.0 (64 bit). The tests <code>RA</code> and <code>RB</code> use recursion. Results
es: Las pruebas se realizaron en Chrome 79.0, Safari 13.0.4 y Firefox 71.0 (64 bits). Las pruebas <code>RA</code> y <code>RB</code> usan recursividad. Resultados
ja: テストはChrome 79.0、Safari 13.0.4およびFirefox 71.0（64ビット）で実行されました。 テスト <code>RA</code> および <code>RB</code> は再帰を使用します。 結果
ko: 테스트는 Chrome 79.0, Safari 13.0.4 및 Firefox 71.0 (64 비트)에서 수행되었습니다. <code>RA</code> 및 <code>RB</code> 테스트는 재귀를 사용합니다. 결과
ru: Тесты проводились на Chrome 79.0, Safari 13.0.4 и Firefox 71.0 (64 бит). Тесты <code>RA</code> и <code>RB</code> используют рекурсию. Результаты
zh_cn: 测试是在Chrome 79.0，Safari 13.0.4和Firefox 71.0（64位）上进行的。 测试 <code>RA</code> 和 <code>RB</code> 使用递归。 结果

source: There is another jsperf with variants on my recursive replace that go even faster (<a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a>)!
es: &iexcl;Hay otro jsperf con variantes en mi reemplazo recursivo que va a&uacute;n m&aacute;s r&aacute;pido ( <a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a> )!
ja: 私の再帰的置換のバリアントを持つ別のjsperfがあり、さらに速くなります（ <a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a> ）！
ko: 내 재귀 대체에 변형이있는 또 다른 jsperf가 더 빠릅니다 ( <a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a> )!
ru: На моей рекурсивной замене есть еще один jsperf с вариантами, которые идут еще быстрее ( <a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a> )!
zh_cn: 我的递归替换中还有另一个jsperf，它的变体运行得更快（ <a href="http://jsperf.com/replace-all-vs-split-join/12">http://jsperf.com/replace-all-vs-split-join/12</a> ）！

source: These are the most common and readable methods.
es: Estos son los métodos más comunes y legibles.
ja: これらは、最も一般的で読みやすい方法です。
ko: 가장 일반적이고 읽기 쉬운 방법입니다.
ru: Это наиболее распространенные и читаемые методы.
zh_cn: 这些都是最常见的、最易读的方法。

source: This can be particularly useful when looking for duplicate strings.
es: Esto puede ser particularmente útil cuando se buscan cuerdas duplicadas.
ja: 重複した文字列を探すときに特に便利です。
ko: 중복 문자열을 찾을 때 특히 유용합니다.
ru: Это может быть особенно полезно при поиске дубликатов строк.
zh_cn: 这在寻找重复的字符串时特别有用。

source: This is a simple regex that avoids replacing parts of words in most cases. However, a dash <code>-</code> is still considered a word boundary. So conditionals can be used in this case to avoid replacing strings like <code>cool-cat</code>:
es: Esta es una expresi&oacute;n regular simple que evita reemplazar partes de palabras en la mayor&iacute;a de los casos. Sin embargo, un gui&oacute;n todav&iacute;a se considera un l&iacute;mite de palabras. Por lo tanto, los condicionales se pueden usar en este caso para evitar reemplazar cadenas como <code>cool-cat</code> :
ja: これは、ほとんどの場合、単語の一部の置き換えを回避する単純な正規表現です。 ただし、ダッシュ <code>-</code> は依然として単語の境界と見なされます。 したがって、この場合は条件文を使用して、 <code>cool-cat</code> のような文字列の置換を回避できます。
ko: 이것은 대부분의 경우 단어의 일부를 대체하지 않는 간단한 정규식입니다. 그러나 대시 <code>-</code> 는 여전히 단어 경계로 간주됩니다. 따라서이 경우 조건부를 사용하여 <code>cool-cat</code> 과 같은 문자열을 교체하지 않아도됩니다.
ru: Это простое регулярное выражение, которое в большинстве случаев избегает замены частей слов. Тем не менее, тире <code>-</code> все еще считается границей слова. Таким образом, в этом случае можно использовать условные выражения, чтобы избежать замены строк, таких как <code>cool-cat</code> :
zh_cn: 这是一个简单的正则表达式，在大多数情况下避免替换部分单词。 但是，连字符 <code>-</code> 仍被视为单词边界。 因此在这种情况下可以使用条件语句来避免替换诸如 <code>cool-cat</code> 之类的字符串：

source: This is the <strong>fastest</strong> version that <em>doesn't use regular expressions</em>.
es: Esta es la versi&oacute;n <strong>m&aacute;s r&aacute;pida</strong> que <em>no usa expresiones regulares</em> .
ja: これは、 <em>正規表現を使用しない</em> <strong>最速の</strong>バージョンです。
ko: 이것은 <em>정규식을 사용하지 않는</em> <strong>가장 빠른</strong> 버전입니다.
ru: Это самая <strong>быстрая</strong> версия, <em>которая не использует регулярные выражения</em> .
zh_cn: 这是<em>不使用正则表达式</em>的<strong>最快</strong>版本。

source: This used to be faster in some cases than using <code>replaceAll</code> and a regular expression, but that doesn't seem to be the case anymore in modern browsers.
es: Esto sol&iacute;a ser m&aacute;s r&aacute;pido en algunos casos que usar <code>replaceAll</code> y una expresi&oacute;n regular, pero ese ya no parece ser el caso en los navegadores modernos.
ja: <code>replaceAll</code> 、 replaceAllや正規表現を使用するよりも高速な場合がありましたが、最近のブラウザではそうではありません。
ko: 이것은 <code>replaceAll</code> 과 정규 표현식을 사용하는 것보다 더 빠른 경우가 있었지만 현대 브라우저에서는 더 이상 그렇지 않습니다.
ru: Раньше в некоторых случаях это было быстрее, чем с использованием <code>replaceAll</code> и регулярного выражения, но в современных браузерах это больше не так.
zh_cn: 在某些情况下，这过去比使用 <code>replaceAll</code> 和正则表达式要快，但是在现代浏览器中，情况似乎不再如此。

source: Today 27.12.2019 I perform tests on <a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> (High Sierra) for the chosen solutions.
es: Hoy 27.12.2019 realizo pruebas en <a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> (High Sierra) para las soluciones elegidas.
ja: 今日27.12.2019選択したソリューションに対して<a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> （High Sierra）でテストを実行します。
ko: 오늘 27.12.2019 선택한 솔루션에 대해 <a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> (High Sierra)에서 테스트를 수행합니다.
ru: Сегодня 27.12.2019 я выполняю тесты на <a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> (High Sierra) для выбранных решений.
zh_cn: 今天27.12.2019我将在<a href="https://en.wikipedia.org/wiki/MacOS_High_Sierra">macOS v10.13.6</a> （High Sierra）上针对所选解决方案执行测试。

source: Update July 27th 2017: It looks like RegExp now has the fastest performance in the recently released Chrome 59.
es: Actualización 27 de julio de 2017:Parece que RegExp tiene ahora el rendimiento más rápido en el recientemente lanzado Chrome 59.
ja: 2017年7月27日更新。最近リリースされたChrome 59でRegExpが最速のパフォーマンスを発揮するようになったようです。
ko: 2017 년 7 월 27 일 업데이트 : RegExp가 최근에 출시 된 Chrome 59에서 가장 빠른 성능을 보이는 것 같습니다.
ru: Обновление 27 июля 2017 года:Похоже,что у RegExp теперь самая быстрая производительность в недавно выпущенном Chrome 59.
zh_cn: 2017年7月27日更新。在最近发布的Chrome 59中,RegExp现在看起来性能最快。

source: Use a regular expression:
es: Use una expresión regular:
ja: 正規表現を使用します。
ko: 정규식을 사용하십시오.
ru: Используйте регулярное выражение:
zh_cn: 使用正则表达式。

source: Using <code>RegExp</code> in <strong>JavaScript</strong> could do the job for you, just simply do something like below code, don't forget the <code>/g</code> after which standout for <strong>global</strong>:
es: El uso de <code>RegExp</code> en <strong>JavaScript</strong> podr&iacute;a hacer el trabajo por usted, simplemente haga algo como el siguiente c&oacute;digo, no olvide el <code>/g</code> , despu&eacute;s del cual se destaca para <strong>global</strong> :
ja: <strong>JavaScriptで</strong> <code>RegExp</code> を<strong>使用</strong>すると、次のようなコードを実行できます。/gを忘れないでください。
ko: <strong>JavaScript</strong> 에서 <code>RegExp</code> 를 사용하면 작업을 수행 할 수 있습니다. 아래 코드와 같은 작업을 수행하고 <strong>전역에</strong> 대한 <code>/g</code> 를 잊지 마십시오.
ru: Использование <code>RegExp</code> в <strong>JavaScript</strong> может помочь вам, просто сделайте что-то наподобие приведенного ниже кода, не забывайте <code>/g</code> , после которого выделяется <strong>глобальное</strong> :
zh_cn: 在<strong>JavaScript中</strong>使用 <code>RegExp</code> 可以为您完成这项工作，只需执行以下代码即可，不要忘记 <code>/g</code> 之后的<strong>global</strong>突出之处：

source: Using a regular expression with the <code>g</code> flag set will replace all:
es: El uso de una expresi&oacute;n regular con el conjunto de indicadores <code>g</code> reemplazar&aacute; a todos:
ja: <code>g</code> フラグを設定した正規表現を使用すると、すべてが置き換えられます。
ko: <code>g</code> 플래그가 설정된 정규식을 사용하면 다음이 모두 대체됩니다.
ru: Использование регулярного выражения с установленным флагом <code>g</code> заменит все:
zh_cn: 使用设置了 <code>g</code> 标志的正则表达式将替换所有：

source: We could call <code>escapeRegExp</code> within our <code>String.prototype.replaceAll</code> implementation, however, I'm not sure how much this will affect the performance (potentially even for strings for which the escape is not needed, like all alphanumeric strings).
es: Podr&iacute;amos llamar a <code>escapeRegExp</code> dentro de nuestra implementaci&oacute;n <code>String.prototype.replaceAll</code> , sin embargo, no estoy seguro de cu&aacute;nto afectar&aacute; esto al rendimiento (potencialmente incluso para cadenas para las que no se necesita el escape, como todas las cadenas alfanum&eacute;ricas).
ja: <code>String.prototype.replaceAll</code> 実装内で <code>escapeRegExp</code> を呼び出すこともできますが、これがパフォーマンスにどの程度影響するかはわかりません（すべての英数字文字列のように、エスケープが不要な文字列の場合でも）。
ko: <code>String.prototype.replaceAll</code> 구현 내에서 <code>escapeRegExp</code> 를 호출 할 수는 있지만 이것이 성능에 얼마나 영향을 미치는지 확실하지 않습니다 (잠재적으로 모든 영숫자 문자열과 같이 이스케이프가 필요하지 않은 문자열의 경우에도).
ru: Мы могли бы вызвать <code>escapeRegExp</code> в нашей реализации <code>String.prototype.replaceAll</code> , однако я не уверен, насколько это повлияет на производительность (потенциально даже для строк, для которых экранирование не требуется, как для всех буквенно-цифровых строк).
zh_cn: 我们可以在 <code>String.prototype.replaceAll</code> 实现中调用 <code>escapeRegExp</code> ，但是，我不确定这会对性能有多大的影响（甚至对于不需要转义的字符串（如所有字母数字字符串）也可能有影响）。

source: What are useful JavaScript methods that extends built-in objects?
es: ¿Cuáles son los métodos útiles de JavaScript que amplían los objetos incorporados?
ja: 組み込みオブジェクトを拡張するJavaScriptの便利なメソッドとは?
ko: 내장 객체를 확장하는 유용한 JavaScript 메소드는 무엇입니까?
ru: Какие полезные методы JavaScript расширяют встроенные объекты?
zh_cn: 有哪些有用的JavaScript方法可以扩展内置对象?

source: When complete, you will still have 'test abc'!
es: Cuando esté completo,todavía tendrá el "test abc"!
ja: 完成しても、「test abc」が残っています!
ko: 완료되면 여전히 'test abc'가 있습니다!
ru: Когда все будет готово,у тебя все еще будет "тест аббревиатуры"!
zh_cn: 完成后,你还会有'测试abc'!

source: You can refer the detailed example <a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">here</a>.
es: Puede consultar el ejemplo detallado <a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">aqu&iacute;</a> .
ja: 詳細な例は<a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">ここで</a>参照できます 。
ko: 자세한 예는 <a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">여기를</a> 참조 하십시오 .
ru: Вы можете сослаться на подробный пример <a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">здесь</a> .
zh_cn: 您可以在<a href="http://www.cheezycode.com/2015/08/javascript-hacks-for-html-webpage.html">此处</a>参考详细示例。

source: You can run tests on your machine <a href="https://jsperf.com/remove-substring-small/1">HERE</a>. Results for Chrome:
es: Puede ejecutar pruebas en su m&aacute;quina <a href="https://jsperf.com/remove-substring-small/1">AQU&Iacute;</a> . Resultados para Chrome:
ja: <a href="https://jsperf.com/remove-substring-small/1">ここで</a>マシン上でテストを実行できます。 Chromeの結果：
ko: <a href="https://jsperf.com/remove-substring-small/1">여기서</a> 컴퓨터에서 테스트를 실행할 수 있습니다. Chrome 결과 :
ru: Вы можете запустить тесты на своем компьютере <a href="https://jsperf.com/remove-substring-small/1">ЗДЕСЬ</a> . Результаты для Chrome:
zh_cn: 您可以在<a href="https://jsperf.com/remove-substring-small/1">此处</a>在计算机上运行测试。 Chrome的结果：

source: You can simply use below method
es: Puede utilizar simplemente el siguiente método
ja: 以下の方法を使用することができます。
ko: 아래 방법을 간단하게 사용할 수 있습니다
ru: Вы можете просто использовать нижеприведенный метод
zh_cn: 您只需使用以下方法即可

source: [In that case, one could do .replace(/,+/g,','), but at some point the regex gets complex and slow enough to loop instead.]
es: [En ese caso,se podría hacer .replace(,+g,','),pero en algún momento el regex se vuelve complejo y lo suficientemente lento como para hacer un bucle en su lugar.]
ja: この場合、.replace(,+g,',')を実行することもできますが、ある時点で正規表現が複雑になり、ループするのに十分な速度が出なくなってしまいます。
ko: [이 경우 .replace (/, + / g, ',') 할 수 있지만 어떤 시점에서 정규 표현식은 복잡하고 대신 반복하기에 충분히 느립니다.]
ru: [В этом случае можно было бы сделать .replace(,+g,','),но в какой-то момент регекс становится сложным и достаточно медленным,чтобы вместо этого зациклиться].
zh_cn: [在这种情况下,可以做.replace(,+g,',',','),但在某些时候,regex会变得复杂,而且速度很慢,需要循环。]

source: and simply use it in your code over and over like below:
es: y simplemente úsalo en tu código una y otra vez como abajo:
ja: と、以下のようにあなたのコードに使用するだけです。
ko: 아래 코드와 같이 코드에서 반복해서 사용하십시오.
ru: и просто используйте его в своем коде снова и снова,как показано ниже:
zh_cn: 并简单地在你的代码中反复使用它,就像下面这样。

source: basically, this question is the same as the question here: <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascript replace " ' " with " '' "</a>
es: B&aacute;sicamente, esta pregunta es la misma que aqu&iacute;: <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascript reemplaza "'" con "' '"</a>
ja: 基本的に、この質問はここの質問と同じです： <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascriptは「」を「」に置き換え</a>ます
ko: 기본적으로이 질문은 다음 질문과 동일합니다. <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascript replace " '" "" ""</a>
ru: в основном, этот вопрос такой же, как и здесь: <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascript заменяет &laquo;&raquo; на &laquo;&raquo;</a>
zh_cn: 基本上，此问题与此处的问题相同： <a href="https://stackoverflow.com/questions/9499075/javascript-replace-with/9499926">Javascript将&ldquo;'&rdquo;替换为&ldquo;&rdquo;</a>

source: seems to only remove the first occurrence of <code>abc</code> in the string above.
es: parece que solo elimina la primera aparici&oacute;n de <code>abc</code> en la cadena anterior.
ja: 上記の文字列で最初に出現する <code>abc</code> のみを削除するようです。
ko: 위의 문자열에서 <code>abc</code> 의 첫 번째 항목 만 제거하는 것 같습니다.
ru: кажется, только удалить первое вхождение <code>abc</code> в строке выше.
zh_cn: 似乎只删除上面字符串中的 <code>abc</code> 第一次出现。

source: worked better for me than the above answers. so <code>new RegExp("abc", 'g')</code> creates a RegExp what matches all occurence (<code>'g'</code> flag) of the text (<code>"abc"</code>). The second part is what gets replaced to, in your case empty string (<code>""</code>). <code>str</code> is the string, and we have to override it, as <code>replace(...)</code> just returns result, but not overrides. In some cases you might want to use that.
es: funcion&oacute; mejor para m&iacute; que las respuestas anteriores. as&iacute; que el <code>new RegExp("abc", 'g')</code> crea un RegExp que coincide con todas las ocurrencias ( <code>'g'</code> flag) del texto ( <code>"abc"</code> ). La segunda parte es a lo que se reemplaza, en su caso cadena vac&iacute;a ( <code>""</code> ). <code>str</code> es la cadena, y tenemos que anularla, ya que <code>replace(...)</code> solo devuelve el resultado, pero no anula. En algunos casos, es posible que desee usar eso.
ja: 上記の答えよりも私にとってはうまくいきました。 したがって、 <code>new RegExp("abc", 'g')</code> ）は、テキスト（ <code>"abc"</code> ）のすべての出現（ <code>'g'</code> フラグ）に一致するRegExpを作成します。 2番目の部分は、空の文字列（ <code>""</code> ）に置き換えられます。 <code>str</code> は文字列であり、 <code>replace(...)</code> は結果を返すだけでオーバーライドはしないため、オーバーライドする必要があります。 場合によっては、それを使用することもできます。
ko: 위의 답변보다 나를 위해 더 잘 작동했습니다. 따라서 <code>new RegExp("abc", 'g')</code> 는 텍스트 ( <code>"abc"</code> )의 모든 발생 ( <code>'g'</code> 플래그)과 일치하는 RegExp를 만듭니다. 두 번째 부분은 빈 문자열 ( <code>""</code> )로 대체됩니다. <code>str</code> 은 문자열이며, <code>replace(...)</code> 는 결과를 반환하지만 재정의는하지 않기 때문에 재정의해야합니다. 경우에 따라 사용할 수도 있습니다.
ru: работал лучше для меня, чем приведенные выше ответы. поэтому <code>new RegExp("abc", 'g')</code> создает RegExp, который соответствует всему вхождению (флаг <code>'g'</code> ) текста ( <code>"abc"</code> ). Вторая часть - это то, что заменяется, в вашем случае пустой строкой ( <code>""</code> ). <code>str</code> - строка, и мы должны переопределить ее, так как <code>replace(...)</code> просто возвращает результат, но не переопределяет. В некоторых случаях вы можете использовать это.
zh_cn: 对我来说比上述答案更好。 因此， <code>new RegExp("abc", 'g')</code> 创建了一个RegExp，该RegExp与文本（ <code>"abc"</code> ）的所有出现情况（ <code>'g'</code> 标志）匹配。 第二部分是要替换的内容，在您的情况下为空字符串（ <code>""</code> ）。 <code>str</code> 是字符串，我们必须覆盖它，因为 <code>replace(...)</code> 仅返回结果，而不是覆盖。 在某些情况下，您可能想要使用它。
