Repository: rueisnom/feedback
Catalog: xlf/11/44/78/3/1144783.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: How can I replace <strong>all</strong> occurrences of it?
es: &iquest;C&oacute;mo puedo reemplazar <strong>todas las</strong> ocurrencias?
ja: どうすればそれを<strong>すべて</strong>置き換えることができますか？
ko: <strong>모든</strong> 발생을 어떻게 교체 할 수 있습니까?
ru: Как я могу заменить <strong>все</strong> вхождения этого?
zh_cn: 如何替换<strong>所有</strong>出现的内容？

source: How to replace all occurrences of a string
es: Cómo reemplazar todas las ocurrencias de una cadena
ja: 文字列のすべての出現箇所を置換する方法
ko: 모든 문자열을 바꾸는 방법
ru: Как заменить все вхождения строки
zh_cn: 如何替换一个字符串的所有出现的次数

source: I also create my own solution. It looks like currently it is the shortest one which does the question job:
es: También creo mi propia solución.Parece que actualmente es la más corta la que hace el trabajo de la pregunta:
ja: また、私は自分のソリューションを作成します。現在は質問の仕事をしてくれる最短のもののようです。
ko: 나는 또한 내 자신의 솔루션을 만듭니다. 현재 질문 작업을 수행하는 것이 가장 짧은 것 같습니다.
ru: Я также создаю свое собственное решение.Похоже,что на данный момент это самое короткое решение,которое делает работу с вопросами:
zh_cn: 我也是自创了自己的解决方案。目前看来,它是最短的那一个做题的方案。

source: I have this string:
es: Tengo esta cuerda:
ja: この文字列を持っています。
ko: 이 문자열이 있습니다.
ru: У меня есть эта веревка:
zh_cn: 我有这一串。

source: I like this method (it looks a little cleaner):
es: Me gusta este método (se ve un poco más limpio):
ja: この方法が好きです(少しスッキリした感じがします)。
ko: 나는이 방법을 좋아한다 (약간 깨끗해 보인다) :
ru: Мне нравится этот метод (он выглядит немного чище):
zh_cn: 我喜欢这种方法(看起来比较干净)。

source: I try to perform tests for 1M characters for other solutions, but <strong>E,F,G,H</strong> takes so much time that browser ask me to break script so I shrink test string to 275K characters. You can run tests on your machine <a href="https://jsperf.com/remove-substring-big/1">HERE</a>. Results for Chrome
es: Intento realizar pruebas para 1M caracteres para otras soluciones, pero <strong>E, F, G, H</strong> toma tanto tiempo que el navegador me pide que rompa el script para reducir la cadena de prueba a 275K caracteres. Puede ejecutar pruebas en su m&aacute;quina <a href="https://jsperf.com/remove-substring-big/1">AQU&Iacute;</a> . Resultados para Chrome
ja: 他のソリューションで100万文字のテストを実行しようとしていますが、 <strong>E、F、G、Hに</strong>非常に時間がかかるため、ブラウザーがスクリプトを中断するように要求するため、テスト文字列を275K文字に縮小します。 <a href="https://jsperf.com/remove-substring-big/1">ここで</a>マシン上でテストを実行できます。 Chromeの結果
ko: 다른 솔루션에 대해 1M 문자에 대한 테스트를 시도하지만 <strong>E, F, G, H</strong> 는 브라우저가 스크립트를 중단하도록 요청하는 데 많은 시간이 걸리므로 테스트 문자열을 275K 문자로 줄입니다. <a href="https://jsperf.com/remove-substring-big/1">여기서</a> 컴퓨터에서 테스트를 실행할 수 있습니다. Chrome에 대한 결과
ru: Я пытаюсь выполнить тесты для 1M символов для других решений, но <strong>E, F, G, H</strong> отнимает столько времени, что браузер просит меня разбить скрипт, поэтому я сокращаю тестовую строку до 275K символов. Вы можете запустить тесты на своем компьютере <a href="https://jsperf.com/remove-substring-big/1">ЗДЕСЬ</a> . Результаты для Chrome
zh_cn: 我尝试对其他解决方案的1M个字符执行测试，但是<strong>E，F，G，H</strong>花费了很多时间，浏览器要求我中断脚本，因此我将测试字符串缩小为275K个字符。 您可以在<a href="https://jsperf.com/remove-substring-big/1">此处</a>在计算机上运行测试。 Chrome的搜索结果

source: I was trying to think about something more simple than modifying the string prototype.
es: Intentaba pensar en algo más simple que modificar el prototipo de la cuerda.
ja: 文字列のプロトタイプを修正するよりも、もっと簡単なことを考えようと思っていました。
ko: 문자열 프로토 타입을 수정하는 것보다 더 간단한 것을 생각하려고했습니다.
ru: Я пытался подумать о чем-то более простом,чем модификация прототипа строки.
zh_cn: 我一直在想一些比修改字符串原型更简单的东西。

source: If the string contain similar pattern like <code>abccc</code>, you can use this:
es: Si la cadena contiene un patr&oacute;n similar como <code>abccc</code> , puede usar esto:
ja: 文字列に <code>abccc</code> のような同様のパターンが含まれている場合、これを使用できます。
ko: 문자열에 <code>abccc</code> 와 유사한 패턴이 포함되어 있으면 다음을 사용할 수 있습니다.
ru: Если строка содержит аналогичный шаблон, как <code>abccc</code> , вы можете использовать это:
zh_cn: 如果字符串包含类似 <code>abccc</code> 的模式，则可以使用以下命令：

source: If what you want to find is already in a string, and you don't have a regex escaper handy, you can use join/split:
es: Si lo que quieres encontrar ya está en una cadena,y no tienes un escape regex a mano,puedes usar el joinsplit:
ja: 見つけたいものがすでに文字列に含まれていて、regex エスケーパを持っていない場合は、joinsplit を使うことができます。
ko: 찾고자하는 문자열이 이미 있고 정규 표현식 이스케이프가없는 경우 join / split을 사용할 수 있습니다.
ru: Если то,что вы хотите найти,уже есть в строке,и у вас нет под рукой регекс-эскопера,вы можете использовать joinsplit:
zh_cn: 如果你想找的东西已经在一个字符串中,而你又没有regex转义符,你可以使用joinsplit。

source: If you are trying to ensure that the string you are looking for won't exist even after the replacement, you need to use a loop.
es: Si estás intentando asegurarte de que la cuerda que buscas no existirá incluso después de la sustitución,necesitas usar un bucle.
ja: 置換してもお目当ての文字列が存在しないようにしようとする場合は、ループを使う必要があります。
ko: 교체 후에도 찾고자하는 문자열이 존재하지 않도록하려면 루프를 사용해야합니다.
ru: Если вы пытаетесь гарантировать,что искомая строка не будет существовать даже после замены,вам нужно использовать цикл.
zh_cn: 如果你想确保你要找的字符串在更换后也不会存在,那么你需要使用循环。

source: If you think of reuse, create a function to do that for you, but it's not recommended as it's only one line function, but again if you heavily use this, you can write something like this:
es: Si piensas en la reutilización,crea una función que lo haga por ti,pero no es recomendable ya que es una función de una sola línea,pero de nuevo si usas mucho esto,puedes escribir algo como esto:
ja: 再利用を考えるのであれば、そのための関数を作ればいいのですが、一行だけの関数なのでお勧めできませんが、またしても重く使うのであれば、こんな感じで書けばいいと思います。
ko: 재사용을 생각한다면, 그것을 위해 함수를 작성하십시오.하지만 한 줄 함수이므로 권장하지 않지만 다시 이것을 많이 사용하면 다음과 같이 작성할 수 있습니다.
ru: Если вы думаете о повторном использовании,создайте функцию,чтобы сделать это за вас,но это не рекомендуется,так как это только одна строчная функция,но опять же,если вы сильно используете это,вы можете написать что-нибудь подобное:
zh_cn: 如果你想到了重用,那就创建一个函数来帮你做这个,不过不推荐,因为这只是单行函数,但同样的,如果你大量使用这个,你可以写成这样的东西。

source: If your <code>find</code> will contain special characters then you need to escape them:
es: Si su <code>find</code> contendr&aacute; caracteres especiales, entonces necesita escapar de ellos:
ja: <code>find</code> に特殊文字が含まれる場合は、それらをエスケープする必要があります。
ko: <code>find</code> 특수 문자가 포함되어 있으면 해당 문자를 이스케이프해야합니다.
ru: Если ваша <code>find</code> будет содержать специальные символы, вам нужно их избежать:
zh_cn: 如果 <code>find</code> 包含特殊字符，则需要转义它们：

source: In response to <a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a>'s comment, you could simplify it even more:
es: En respuesta al comentario de <a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a> , podr&iacute;a simplificarlo a&uacute;n m&aacute;s:
ja: <a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a>のコメントに応じて、さらに簡単にすることができます。
ko: <a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a> 의 의견에 대한 답변으로 더 단순화 할 수 있습니다.
ru: В ответ на комментарий <a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a> вы можете упростить его еще больше:
zh_cn: 为了回应<a href="https://stackoverflow.com/users/49153/click-upvote">Click Upvote</a>的评论，您可以进一步简化它：

source: In response to comment:
es: En respuesta a los comentarios:
ja: コメントに反応して
ko: 의견에 대한 답변 :
ru: В ответ на комментарий:
zh_cn: 作为对评论的回应:

source: It is almost <strong>twice</strong> as fast as the split and join method.
es: Es casi el <strong>doble de</strong> r&aacute;pido que el m&eacute;todo de divisi&oacute;n y uni&oacute;n.
ja: 分割して結合する方法のほぼ<strong>2倍の</strong>速度です。
ko: split 및 join 방법 <strong>보다</strong> 거의 <strong>두 배</strong> 빠릅니다.
ru: Это почти в <strong>два раза</strong> быстрее, чем метод split и join.
zh_cn: 它的速度几乎是split and join方法的<strong>两倍</strong> 。

source: It's somewhat late for an update, but since I just stumbled on this question, and noticed that my previous answer is not one I'm happy with. Since the question involved replaceing a single word, it's incredible nobody thought of using word boundaries (<code>\b</code>)
es: Es algo tarde para una actualizaci&oacute;n, pero dado que me top&eacute; con esta pregunta y not&eacute; que mi respuesta anterior no es una con la que estoy contento. Dado que la pregunta implicaba reemplazar una sola palabra, es incre&iacute;ble que nadie haya pensado en usar l&iacute;mites de palabras ( <code>\b</code> )
ja: 更新には少し遅れますが、この質問に出くわしただけで、以前の答えが満足できるものではないことに気づきました。 質問は単一の単語の置き換えを伴うため、単語の境界（ <code>\b</code> ）を使用することを誰も考えなかったのは驚くべきことです
ko: 업데이트가 다소 늦었지만 방금이 질문에 걸려서 이전 답변이 내가 만족하지 않는 것으로 나타났습니다. 문제는 한 단어를 바꾸는 것과 관련이 있기 때문에 아무도 단어 경계를 사용한다고 생각하지 않습니다 ( <code>\b</code> )
ru: Уже несколько поздно для обновления, но так как я просто наткнулся на этот вопрос и заметил, что мой предыдущий ответ не тот, которым я доволен. Поскольку вопрос касался замены одного слова, невероятно, что никто не думал об использовании границ слова ( <code>\b</code> )
zh_cn: 更新有点晚了，但是由于我偶然发现了这个问题，并注意到我以前的回答不是我满意的答案。 由于问题涉及替换单个单词，所以没有人想到使用单词边界（ <code>\b</code> ），这真是令人难以置信

source: Just add <code>/g</code>
es: Solo agrega <code>/g</code>
ja: <code>/g</code> を追加するだけです
ko: <code>/g</code> 만 추가하면됩니다.
ru: Просто добавьте <code>/g</code>
zh_cn: 只需添加 <code>/g</code>

source: Long string: 275 000 characters
es: Larga cadena:275 000 caracteres
ja: 長い文字列:275 000文字
ko: 긴 문자열 : 275 000 자
ru: Длинная строка:275 000 символов
zh_cn: 长字符串:275 000个字符

source: MDN also provides an implementation to escape our strings. It would be nice if this was also standardized as <code>RegExp.escape(str)</code>, but alas, it does not exist:
es: MDN tambi&eacute;n proporciona una implementaci&oacute;n para escapar de nuestras cadenas. Ser&iacute;a bueno si esto tambi&eacute;n fuera estandarizado como <code>RegExp.escape(str)</code> , pero, por desgracia, no existe:
ja: MDNは、文字列をエスケープするための実装も提供します。 これも <code>RegExp.escape(str)</code> として標準化されていると便利ですが、 残念ながら存在しません。
ko: MDN은 또한 문자열을 이스케이프하기위한 구현을 제공합니다. 이것이 <code>RegExp.escape(str)</code> 로 표준화되어 있으면 좋겠지 만 아쉽지만 존재하지 않습니다.
ru: MDN также предоставляет реализацию, позволяющую избежать наших строк. Было бы хорошо, если бы это было также стандартизировано как <code>RegExp.escape(str)</code> , но, увы, его не существует:
zh_cn: MDN还提供了一种实现来转义我们的字符串。 如果也将它也标准化为 <code>RegExp.escape(str)</code> 会很好，但是，它不存在：

source: Match against a global regular expression:
es: Coincide con una expresión regular global:
ja: グローバル正規表現にマッチします。
ko: 전역 정규 표현식과 일치
ru: Матч с глобальным регулярным выражением:
zh_cn: 与全局正则表达式匹配。

source: My guess is, this meets your needs. It's not fullproof, of course, but it should be enough to get you started. I'd recommend reading some more on these pages. This'll prove useful in perfecting this expression to meet your specific needs.
es: Supongo que esto satisface sus necesidades.No es a prueba de fallos,por supuesto,pero debería ser suficiente para empezar.Le recomendaría leer un poco más en estas páginas.Esto será útil para perfeccionar esta expresión para satisfacer sus necesidades específicas.
ja: 私の推測では、これはあなたのニーズを満たしています。もちろん完全なものではありませんが、あなたが始めるのには十分なはずです。これらのページを読むことをお勧めします。これは、あなたの特定のニーズを満たすためにこの表現を完璧にするのに役立つことが証明されるでしょう。
ko: 내 생각에, 이것은 당신의 요구를 충족시킵니다. 물론 완전하지는 않지만 시작하기에 충분해야합니다. 이 페이지에서 더 많은 것을 읽는 것이 좋습니다. 이는 특정 요구를 충족하기 위해이 표현을 완성하는 데 유용합니다.
ru: Думаю,это удовлетворяет твои потребности.Это,конечно,не полная защита,но этого должно быть достаточно,чтобы вы начали.Я бы порекомендовал почитать еще немного на этих страницах.Это окажется полезным в совершенствовании этого выражения для удовлетворения ваших конкретных потребностей.
zh_cn: 我的猜测是,这个符合你的需求。当然,这并不全面,但应该足够让你入门了。我建议你多读一些这些页面上的内容。这将证明,这对完善这个表达方式,满足你的具体需求是很有帮助的。

source: Not knowing too much about how regular expressions work behind the scenes in terms of efficiency, I tended to lean toward the split and join implementation in the past without thinking about performance. When I did wonder which was more efficient, and by what margin, I used it as an excuse to find out.
es: Sin saber demasiado sobre cómo funcionan las expresiones regulares entre bastidores en términos de eficiencia,tendí a inclinarme hacia la división y a unirme a la implementación en el pasado sin pensar en la actuación.Cuando me preguntaba qué era más eficiente,y por qué margen,lo usaba como excusa para averiguarlo.
ja: 効率性の面で正規表現が舞台裏でどのように機能しているのかをあまり知らないので、過去にはパフォーマンスのことは考えずに分割と結合の実装に傾く傾向がありました。どちらがより効率的で、どの程度のマージンで効率的なのか疑問に思ったときは、それを見つけるための口実にしました。
ko: 효율성 측면에서 정규 표현식이이면에서 어떻게 작동하는지에 대해 너무 많이 알지 못했지만 성능에 대해 생각하지 않고 과거에 분할 및 구현에 의존하는 경향이있었습니다. 어느 쪽이 더 효율적이고 어떤 마진으로 궁금해했을 때 나는 그것을 핑계로 사용했습니다.
ru: Не зная слишком много о том,как регулярные выражения работают за кулисами с точки зрения эффективности,я склонялся к расколу и присоединялся к реализации в прошлом,не задумываясь о производительности.Когда я задавался вопросом,что более эффективно и с каким запасом,я использовал это как предлог,чтобы выяснить это.
zh_cn: 由于不太了解正则表达式背后的效率,我过去往往倾向于采用拆分和联接的方式来实现,而不考虑性能问题。当我想知道哪种方式更有效率时,我就把它作为一个借口来寻找答案。

source: On my Chrome Windows&nbsp;8 machine, <strong>the regular expression based implementation is the fastest</strong>, with the <strong>split and join implementation being 53% slower</strong>. Meaning the regular expressions are twice as fast for the lorem ipsum input I used.
es: En mi m&aacute;quina Chrome con Windows 8, <strong>la implementaci&oacute;n basada en expresiones regulares es la m&aacute;s r&aacute;pida</strong> , con <strong>una implementaci&oacute;n de divisi&oacute;n y uni&oacute;n un 53% m&aacute;s lenta</strong> . Lo que significa que las expresiones regulares son dos veces m&aacute;s r&aacute;pidas para la entrada lorem ipsum que utilic&eacute;.
ja: 私のChrome Windows 8マシンで<strong>は、正規表現ベースの実装が最速</strong>で、 <strong>分割と結合の実装は53％遅くなっています</strong> 。 正規表現は、私が使用したlorem ipsum入力の2倍の速さです。
ko: Chrome Windows 8 컴퓨터에서는 <strong>정규식 기반 구현이 가장 빠르며</strong> <strong>split 및 join 구현은 53 % 느립니다</strong> . 정규 표현식이 내가 사용한 lorem ipsum 입력의 두 배 빠름을 의미합니다.
ru: На моем компьютере с Chrome Windows 8 <strong>реализация на основе регулярных выражений является самой быстрой</strong> , <strong>а реализация разбиения и объединения выполняется на 53% медленнее</strong> . Это означает, что регулярные выражения в два раза быстрее для ввода lorem ipsum, который я использовал.
zh_cn: 在我的Chrome Windows 8计算机上， <strong>基于正则表达式的实现是最快的</strong> ，而<strong>split and join实现的速度要慢53％</strong> 。 这意味着正则表达式的速度是我使用的lorem ipsum输入的两倍。

source: Oops indeed, this probably isn't what you want. What is, then? IMHO, a regex that only replaces 'cat' conditionally. (ie not part of a word), like so:
es: Ups,de hecho,probablemente no es lo que quieres.¿Qué es,entonces? IMHO,un regex que sólo reemplaza a "gato" condicionalmente.(es decir,no es parte de una palabra),así:
ja: おっと、確かに、これはあなたが望むものではないかもしれません。では何なのでしょうか?IMHO では、条件付きで 'cat' を置き換えるだけの正規表現です。(つまり単語の一部ではなく)このような正規表現です。
ko: 실제로, 이것은 아마도 당신이 원하는 것이 아닐 것입니다. 그렇다면 무엇입니까? 조건부로 'cat'만 바꾸는 정규식 IMHO (즉, 단어의 일부가 아님)
ru: Упс,действительно,это,наверное,не то,чего ты хочешь.А что же тогда? IMHO,регекс,который заменяет только "кот" условно.(т.е.не часть слова),вроде того:
zh_cn: 哎呀,这可能不是你想要的。那么,是什么呢?IMHO,一个仅有条件地替换 "cat "的regex。(即不是一个词的一部分),就像这样。

source: Or try the replaceAll function from here:
es: O intente la función de reemplazar todo desde aquí:
ja: もしくは、ここからreplaceAll関数を試してみてください。
ko: 또는 여기에서 replaceAll 함수를 시도하십시오.
ru: Или попробуйте функцию replaceAll отсюда:
zh_cn: 或者试试这里的replaceAll函数。

source: RangeError: Maximum call stack size exceeded
es: RangeError:Tamaño máximo de la pila de llamadas excedido
ja: RangeError.最大コールスタックサイズを超えました
ko: RangeError : 최대 호출 스택 크기를 초과했습니다
ru: RangeError:Максимальный размер стека вызовов превышен
zh_cn: RangeError:超过最大调用堆栈大小

source: Regular Expression Based Implementation
es: Aplicación basada en la expresión regular
ja: 正規表現に基づく実装
ko: 정규식 기반 구현
ru: Регулярное осуществление на основе экспрессии
zh_cn: 基于常规表达式的实现

source: Replacing single quotes:
es: Reemplazando las citas simples:
ja: シングルクォートの置き換え。
ko: 작은 따옴표 바꾸기 :
ru: Замена одиночных кавычек:
zh_cn: 取代单引号。

source: Revised jsperf
es: Revisado jsperf
ja: jsperfを修正しました。
ko: 수정 된 jsperf
ru: Пересмотренный шрифт
zh_cn: 修订后的jsperf

source: Say you want to replace all the 'abc' with 'x':
es: Digamos que quieres reemplazar toda la "abc" por la "x":
ja: すべての'abc'を'x'に置き換えたいとします。
ko: 모든 'abc'를 'x'로 바꾸고 싶다고 가정 해보십시오.
ru: Скажи,что хочешь заменить все 'abc' на 'x':
zh_cn: 说你想用 "x "代替所有的 "abc"。

source: See here also
es: Vea aquí también
ja: こちらもご覧ください。
ko: 여기도 참조
ru: См.также здесь
zh_cn: 另见此处

source: Short string - 55 characters
es: Cadena corta-55 caracteres
ja: 短い文字列-55文字
ko: 짧은 문자열-55 자
ru: Короткая строка-55 символов
zh_cn: 短字符串-55个字符

source: Show code snippet
es: Mostrar fragmento de código
ja: コードスニペットを表示
ko: 코드 스 니펫 표시
ru: Показать фрагмент кода
zh_cn: 显示代码片段

source: So in order to make the <code>replaceAll()</code> function above safer, it could be modified to the following if you also include <code>escapeRegExp</code>:
es: Entonces, para que la funci&oacute;n <code>replaceAll()</code> anterior sea m&aacute;s segura, podr&iacute;a modificarse a lo siguiente si tambi&eacute;n incluye <code>escapeRegExp</code> :
ja: したがって、上記の <code>replaceAll()</code> 関数をより安全にするために、 escapeRegExpも含める場合は、次のように変更できます。
ko: 따라서 위의 <code>replaceAll()</code> 함수를보다 안전하게 만들려면 escapeRegExp 도 포함하면 다음과 같이 수정할 수 있습니다.
ru: Таким образом, чтобы сделать <code>replaceAll()</code> приведенную выше, более безопасной, ее можно изменить следующим образом, если вы также <code>escapeRegExp</code> :
zh_cn: 因此，为了使上面的 <code>replaceAll()</code> 函数更安全，如果还包含 <code>escapeRegExp</code> ，可以将其修改为以下内容 ：

source: Solutions based on <code>split-join</code> (<strong>A,B</strong>) or <code>replace</code> (<strong>C,D</strong>) are fast
es: Las soluciones basadas en <code>split-join</code> ( <strong>A, B</strong> ) o <code>replace</code> ( <strong>C, D</strong> ) son r&aacute;pidas
ja: <code>split-join</code> （ <strong>A、B</strong> ）または <code>replace</code> （ <strong>C、D</strong> ）に基づくソリューションは高速です
ko: <code>split-join</code> ( <strong>A, B</strong> ) 또는 <code>replace</code> ( <strong>C, D</strong> ) 기반 솔루션은 빠릅니다.
ru: Решения, основанные на <code>split-join</code> ( <strong>A, B</strong> ) или <code>replace</code> ( <strong>C, D</strong> ), являются быстрыми
zh_cn: 基于 <code>split-join</code> （ <strong>A，B</strong> ）或 <code>replace</code> （ <strong>C，D</strong> ）的解决方案很快

source: Solutions based on <code>while</code> (<strong>E,F,G,H</strong>) are slow - usually ~4 times slower for small strings and about ~3000 times (!) slower for long strings
es: Las soluciones basadas en <code>while</code> ( <strong>E, F, G, H</strong> ) son lentas, generalmente ~ 4 veces m&aacute;s lento para cadenas peque&ntilde;as y aproximadamente ~ 3000 veces (!) M&aacute;s lento para cadenas largas
ja: <code>while</code> （ <strong>E、F、G、H</strong> ）に基づくソリューションは遅い-小さな文字列では通常〜4倍遅く、長い​​文字列では約〜3000倍（！）遅い
ko: <code>while</code> ( <strong>E, F, G, H</strong> ) 기반 솔루션은 느립니다. 일반적으로 작은 줄의 경우 ~ 4 배 느리고 긴 줄의 경우 ~ 3000 배 (!) 느립니다.
ru: Решения, основанные на <code>while</code> ( <strong>E, F, G, H</strong> ), медленны - обычно в ~ 4 раза медленнее для маленьких строк и примерно в 3000 раз (!) Медленнее для длинных строк
zh_cn: 基于 <code>while</code> （ <strong>E，F，G，H</strong> ）的解决方案很慢-小字符串通常慢4倍，长字符串通常慢3000倍（！）

source: Split and Join (Functional) Implementation
es: Implementación de Split and Join (Funcional)
ja: 分割と結合(機能)の実装
ko: 분할 및 결합 (기능) 구현
ru: Раздельное и совместное (функциональное)внедрение
zh_cn: 分割和加入(功能)实现

source: The 'replaceAll' method is added to String's prototype. This means it will be available for all string objects/literals.
es: El método "reemplazar todo" se añade al prototipo de String.Esto significa que estará disponible para todos los objetos literarios de la cadena.
ja: Stringのプロトタイプに'replaceAll'メソッドが追加されました。これは、すべての文字列オブジェクトリテラルに対して利用できるようになることを意味します。
ko: 'replaceAll'메소드가 String의 프로토 타입에 추가됩니다. 이는 모든 문자열 객체 / 리터럴에 사용할 수 있음을 의미합니다.
ru: Метод 'replaceAll' добавлен в прототип String.Это означает,что он будет доступен для всех строковых объектов-литералов.
zh_cn: 在String的原型中加入了'replaceAll'方法。这意味着,它将对所有的字符串对象的文体都可以使用。

source: The <code>str.replace(/abc/g, '');</code> (<strong>C</strong>) is a good cross-browser fast solution for all strings.
es: El <code>str.replace(/abc/g, '');</code> ( <strong>C</strong> ) es una buena soluci&oacute;n r&aacute;pida entre navegadores para todas las cadenas.
ja: <code>str.replace(/abc/g, '');</code> （ <strong>C</strong> ）は、すべての文字列に対して適切なブラウザ間高速ソリューションです。
ko: <code>str.replace(/abc/g, '');</code> ( <strong>C</strong> )는 모든 문자열에 적합한 브라우저 간 빠른 솔루션입니다.
ru: <code>str.replace(/abc/g, '');</code> ( <strong>C</strong> ) - это хорошее кросс-браузерное быстрое решение для всех строк.
zh_cn: <code>str.replace(/abc/g, '');</code> （ <strong>C</strong> ）是一种适用于所有字符串的跨浏览器快速解决方案。

source: The general pattern is
es: El patrón general es
ja: 一般的なパターンは
ko: 일반적인 패턴은
ru: Общая закономерность заключается в том,что
zh_cn: 一般的模式是

source: The output is the same as the accepted answer, however, using the /cat/g expression on this string:
es: La salida es la misma que la respuesta aceptada,sin embargo,usando la expresión catg en esta cadena:
ja: ただし、この文字列にcatg式を使用することで、受理された回答と同じ出力になります。
ko: 그러나 출력은 다음 문자열에서 / cat / g 표현식을 사용하여 허용되는 답변과 동일합니다.
ru: Вывод такой же,как и принятый ответ,но с использованием выражения catg в этой строке:
zh_cn: 但是,在这个字符串上使用catg表达式,输出与接受答案相同。

source: The previous answers are way too complicated. Just use the replace function like this:
es: Las respuestas anteriores son demasiado complicadas.Sólo usa la función de reemplazo de esta manera:
ja: 前の答えは複雑すぎます。こんな感じで置換機能を使えばいいんです。
ko: 이전 답변은 너무 복잡합니다. 다음과 같이 바꾸기 기능을 사용하십시오.
ru: Предыдущие ответы слишком сложны.Просто используйте функцию замены вот так:
zh_cn: 前面的答案太复杂了。就用这样的替换功能就可以了。

source: The recurrence solutions (<strong>RA,RB</strong>) are slow and do not work for long strings
es: Las soluciones de recurrencia ( <strong>RA, RB</strong> ) son lentas y no funcionan para cadenas largas
ja: 繰り返しソリューション（ <strong>RA、RB</strong> ）は遅く、長い​​文字列では機能しません
ko: 반복 솔루션 ( <strong>RA, RB</strong> )은 느리고 긴 문자열에는 작동하지 않습니다.
ru: Рекуррентные решения ( <strong>RA, RB</strong> ) являются медленными и не работают для длинных строк
zh_cn: 递归解决方案（ <strong>RA，RB</strong> ）缓慢，不适用于长字符串

source: The recursive solutions <strong>RA</strong> and <strong>RB</strong> gives
es: Las soluciones recursivas <strong>RA</strong> y <strong>RB</strong> dan
ja: <strong>RA</strong>と<strong>RB</strong>が与える再帰的解
ko: 재귀 솔루션 <strong>RA</strong> 및 <strong>RB</strong> 는
ru: Рекурсивные решения <strong>РА</strong> и <strong>РБ</strong> дает
zh_cn: 递归解<strong>RA</strong>和<strong>RB</strong>给出

source: The simplest loop to solve this would be:
es: El bucle más simple para resolver esto sería:
ja: これを解決するための最も単純なループは、次のようなものでしょう。
ko: 이를 해결하는 가장 간단한 루프는 다음과 같습니다.
ru: Самый простой цикл для решения этой проблемы:
zh_cn: 要解决这个问题,最简单的循环是:。

source: The simplest way to this without using any regex is split and join like the code here:
es: La forma más simple de hacer esto sin usar ningún regex es dividir y unir como el código de aquí:
ja: 正規表現を使わない最も簡単な方法は、ここのコードのように分割して結合することです。
ko: 정규 표현식을 사용하지 않고이를 수행하는 가장 간단한 방법은 다음 코드와 같이 분할되고 결합됩니다.
ru: Самый простой способ сделать это без использования регекса-разделить и соединить как код здесь:
zh_cn: 最简单的方法是像这里的代码一样,在不使用任何regex的情况下,拆分和加入。
