Repository: rueisnom/feedback
Catalog: xlf/11/44/78/3/1144783.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: //loop it until number occurrences comes to 0. OR simply copy/paste
es: /...hasta que el número de ocurrencias llegue a 0.O simplemente copiando...
ja: /発生数が0になるまでループします。 または、単にコピペします。
ko: // 숫자가 0이 될 때까지 반복합니다. 또는 단순히 복사 / 붙여 넣기
ru: /закругляйтесь до тех пор,пока число происшествий не станет равным 0.Или просто скопипасти.
zh_cn: /循环,直到出现的次数为0为止。

source: <code>/g</code> means global
es: <code>/g</code> significa global
ja: <code>/g</code> はグローバルを意味します
ko: <code>/g</code> 는 전역을 의미합니다
ru: <code>/g</code> означает глобальный
zh_cn: <code>/g</code> 表示全局

source: <strong>EDIT:</strong> Clarification about replaceAll availability
es: <strong>EDITAR:</strong> Aclaraci&oacute;n sobre reemplazar Toda la disponibilidad
ja: <strong>編集：</strong> replaceAllの可用性に関する説明
ko: <strong>편집 :</strong> replaceAll 가용성에 대한 설명
ru: <strong>РЕДАКТИРОВАТЬ:</strong> разъяснения о заменеВсе наличие
zh_cn: <strong>编辑：</strong>有关replaceAll可用性的说明

source: <strong>Final addition:</strong>
es: <strong>Adici&oacute;n final:</strong>
ja: <strong>最終追加：</strong>
ko: <strong>최종 추가 :</strong>
ru: <strong>Заключительное дополнение:</strong>
zh_cn: <strong>最后添加：</strong>

source: <strong>Method 1:</strong>
es: <strong>M&eacute;todo 1:</strong>
ja: <strong>方法1：</strong>
ko: <strong>방법 1 :</strong>
ru: <strong>Способ 1:</strong>
zh_cn: <strong>方法1：</strong>

source: <strong>Method 2:</strong>
es: <strong>M&eacute;todo 2:</strong>
ja: <strong>方法2：</strong>
ko: <strong>방법 2 :</strong>
ru: <strong>Способ 2:</strong>
zh_cn: <strong>方法2：</strong>

source: <strong>Method 3:</strong>
es: <strong>M&eacute;todo 3:</strong>
ja: <strong>方法3：</strong>
ko: <strong>방법 3 :</strong>
ru: <strong>Способ 3:</strong>
zh_cn: <strong>方法3：</strong>

source: <strong>Method 4:</strong>
es: <strong>M&eacute;todo 4:</strong>
ja: <strong>方法4：</strong>
ko: <strong>방법 4 :</strong>
ru: <strong>Способ 4:</strong>
zh_cn: <strong>方法4：</strong>

source: <strong>Note: Don't use this in performance critical code.</strong>
es: <strong>Nota: No use esto en el c&oacute;digo cr&iacute;tico de rendimiento.</strong>
ja: <strong>注：パフォーマンスが重要なコードではこれを使用しないでください。</strong>
ko: <strong>참고 : 성능이 중요한 코드에는이 코드를 사용하지 마십시오.</strong>
ru: <strong>Примечание: не используйте это в коде, критичном к производительности.</strong>
zh_cn: <strong>注意：请勿在对性能有要求的代码中使用此代码。</strong>

source: <strong>Note:</strong> In general, extending the built-in prototypes in JavaScript is generally not recommended. I am providing as extensions on the String prototype simply for purposes of illustration, showing different implementations of a hypothetical standard method on the <code>String</code> built-in prototype.
es: <strong>Nota:</strong> en general, no se recomienda extender los prototipos incorporados en JavaScript. Proporciono como extensiones en el prototipo de String simplemente con fines ilustrativos, mostrando diferentes implementaciones de un m&eacute;todo est&aacute;ndar hipot&eacute;tico en el prototipo incorporado de <code>String</code> .
ja: <strong>注：</strong>一般に、JavaScriptで組み込みプロトタイプを拡張することは、一般的には推奨されません。 文字列プロトタイプの拡張として、説明のために提供しています。 <code>String</code> 組み込みプロトタイプでの仮想的な標準メソッドのさまざまな実装を示しています。
ko: <strong>참고 :</strong> 일반적으로 JavaScript에서 내장 프로토 타입을 확장하는 것은 일반적으로 권장되지 않습니다. <code>String</code> 내장 프로토 타입에 대한 가상 표준 방법의 다양한 구현을 보여주기 위해 단순히 예시 목적으로 String 프로토 타입에 대한 확장을 제공하고 있습니다.
ru: <strong>Примечание.</strong> Как правило, расширение встроенных прототипов в JavaScript обычно не рекомендуется. Я предоставляю в качестве расширений прототипа String просто в целях иллюстрации, демонстрируя различные реализации гипотетического стандартного метода на встроенном прототипе <code>String</code> .
zh_cn: <strong>注意：</strong>通常，通常不建议在JavaScript中扩展内置原型。 我仅作为说明目的在String原型上提供扩展，展示了 <code>String</code> 内置原型上假设的标准方法的不同实现。

source: <strong>Note:</strong> Regular expressions contain special (meta) characters, and as such it is dangerous to blindly pass an argument in the <code>find</code> function above without pre-processing it to escape those characters. This is covered in the <a href="https://developer.mozilla.org/en-US/">Mozilla Developer Network</a>'s <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">JavaScript Guide on Regular Expressions</a>, where they present the following utility function (which has changed at least twice since this answer was originally written, so make sure to check the MDN site for potential updates):
es: <strong>Nota:</strong> Las expresiones regulares contienen caracteres especiales (meta) y, como tal, es peligroso pasar ciegamente un argumento en la funci&oacute;n de <code>find</code> anterior sin procesarlo previamente para escapar de esos caracteres. Esto est&aacute; cubierto en la <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">Gu&iacute;a de JavaScript de la</a> <a href="https://developer.mozilla.org/en-US/">Red de desarrolladores de Mozilla</a> sobre expresiones regulares , donde presentan la siguiente funci&oacute;n de utilidad (que ha cambiado al menos dos veces desde que esta respuesta se escribi&oacute; originalmente, as&iacute; que aseg&uacute;rese de consultar el sitio de MDN para posibles actualizaciones):
ja: <strong>注：</strong>正規表現には特殊な（メタ）文字が含まれているため、これらの文字をエスケープする前処理をせずに、上記の <code>find</code> 関数で引数を盲目的に渡すことは危険です。 これは、 <a href="https://developer.mozilla.org/en-US/">Mozilla Developer Network</a>の<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">正規表現に関するJavaScriptガイドで説明され</a>ており、次のユーティリティ関数が示されています（この回答は最初に書かれてから少なくとも2回変更されているため、MDNサイトで更新の可能性を確認してください）。
ko: <strong>참고 :</strong> 정규식에는 특수 (메타) 문자가 포함되어 있으므로 위 문자를 이스케이프 처리하기 위해 사전 처리하지 않고 <code>find</code> 함수에서 인수를 맹목적으로 전달하는 것은 위험합니다. 이 내용은 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">정규 표현식</a> 에 대한 <a href="https://developer.mozilla.org/en-US/">Mozilla 개발자 네트워크</a> 의 JavaScript 안내서에서 다루며 다음과 같은 유틸리티 기능을 제공합니다 (이 답변이 처음 작성된 이후 최소한 두 번 변경되었으므로 잠재적 인 업데이트가 있는지 MDN 사이트를 확인하십시오).
ru: <strong>Примечание.</strong> Регулярные выражения содержат специальные (мета) символы, и поэтому опасно слепо передавать аргумент в функции <code>find</code> выше без предварительной обработки для экранирования этих символов. Это описано в <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">Руководстве JavaScript по регулярным выражениям</a> в <a href="https://developer.mozilla.org/en-US/">Mozilla Developer Network</a> , в котором представлена ​​следующая служебная функция (которая изменилась не менее двух раз с момента первоначального написания этого ответа, поэтому обязательно проверяйте сайт MDN на наличие потенциальных обновлений):
zh_cn: <strong>注意：</strong>正则表达式包含特殊的（元）字符，因此危险地在上面的 <code>find</code> 函数中盲目传递参数，而无需对其进行预处理以转义那些字符。 <a href="https://developer.mozilla.org/en-US/">Mozilla开发人员网络</a>的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Escaping">JavaScript正则表达式指南中</a>对此进行了介绍，该指南提供了以下实用程序功能（自最初编写此答案以来，该功能至少已更改两次，因此请确保检查MDN站点是否有潜在更新）：

source: @Mike, check the answer I gave there... regexp isn't the only way to replace multiple occurrences of a subsrting, far from it. Think flexible, think split!
es: @Mike,comprueba la respuesta que di allí...regexp no es la única forma de reemplazar las múltiples ocurrencias de una substracción,ni mucho menos.¡Piensa en flexible,piensa en split!
ja: @Mike,私の答えを確認してください...正規表現だけでは、複数の部分式を置き換えることはできません。柔軟性を考えて、分割を考えてください。
ko: @Mike, 내가 준 대답을 확인하십시오 ... regexp가 subsrting의 여러 항목을 대체하는 유일한 방법은 아닙니다. 유연하게 생각하고 분할 생각하십시오!
ru: @Mike,проверь ответ,который я там дал...регэкспресс-не единственный способ заменить несколько случаев субартинга,далеко не единственный.Думай гибко,думай раздельно!
zh_cn: @Mike,看看我的回答......regexp并不是唯一能替换多个子计算的方法,远非如此。想着灵活,想着分割!

source: Alternatively, to prevent replacing word parts -which the approved answer will do, too! You can get around this issue using regular expressions that are, I admit, somewhat more complex and as an upshot of that, a tad slower, too:
es: Alternativamente,para evitar la sustitución de partes de la palabra,lo que la respuesta aprobada hará,también! Puedes evitar este problema usando expresiones regulares que son,lo admito,algo más complejas y como resultado,un poco más lentas también:
ja: あるいは、単語の部分を置き換えないようにするために -これも承認された解答がそうします!この問題は正規表現を使って回避できます。この問題は正規表現を使用して回避することができますが、これはやや複雑で、その結果、少し遅くなります。
ko: 또는 승인 된 답변이 수행하는 단어 부분의 교체를 방지하기 위해! 좀 더 복잡하고 그 결과로 약간 더 느린 정규식을 사용 하여이 문제를 해결할 수 있습니다.
ru: В качестве альтернативы,чтобы предотвратить замену частей слова-что одобренный ответ тоже будет делать! Вы можете обойти эту проблему,используя регулярные выражения,которые,я признаю,несколько сложнее и,как результат,немного медленнее:
zh_cn: 你可以使用正则表达式来解决这个问题,我承认,这种表达式比较复杂,而且作为一个结果,它也比较慢。

source: Although people have mentioned the use of regex but there's a better approach if you want to replace the text irrespective of the case of the text. Like uppercase or lowercase. Use below syntax
es: Aunque la gente ha mencionado el uso de regex pero hay un mejor enfoque si se quiere reemplazar el texto independientemente del caso del texto.Como las mayúsculas o las minúsculas.El uso debajo de la sintaxis
ja: 正規表現の使用については言及されていますが、テキストの大文字・小文字に関係なくテキストを置換したい場合には、もっと良い方法があります。大文字か小文字かに関係なく置換したい場合には、以下のような方法があります。以下の構文を使用します。
ko: 사람들은 정규식 사용을 언급했지만 텍스트의 경우에 관계없이 텍스트를 바꾸려면 더 나은 방법이 있습니다. 대문자 또는 소문자처럼. 아래 구문 사용
ru: Хотя люди упоминали использование регекса,но есть лучший подход,если вы хотите заменить текст,независимо от случая текста.Например,заглавный или строчный.Используйте синтаксис ниже
zh_cn: 虽然大家都提到过使用regex,但是如果你想不顾文字的大小写而更换文字,还有一个更好的方法。比如说大写或小写。使用下面的语法

source: As an alternative to regular expressions for a simple literal string, you could use
es: Como alternativa a las expresiones regulares para una simple cadena literal,podrías usar
ja: 単純なリテラル文字列の正規表現の代わりに
ko: 간단한 리터럴 문자열에 대한 정규식의 대안으로 다음을 사용할 수 있습니다.
ru: В качестве альтернативы регулярным выражениям для простой литературной строки,можно использовать следующие слова
zh_cn: 作为一个简单的直译字符串的正则表达式的替代方案,你可以使用

source: As noted in the comment below by @ThomasLeduc and others, there could be an issue with the regular expression-based implementation if <code>search</code> contains certain characters which are reserved as <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">special characters in regular expressions</a>. The implementation assumes that the caller will escape the string beforehand or will only pass strings that are without the characters in the table in <em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">Regular Expressions</a></em> (MDN).
es: Como se se&ntilde;al&oacute; en el comentario a continuaci&oacute;n de @ThomasLeduc y otros, podr&iacute;a haber un problema con la implementaci&oacute;n basada en expresiones regulares si la <code>search</code> contiene ciertos caracteres que est&aacute;n reservados como <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">caracteres especiales en expresiones regulares</a> . La implementaci&oacute;n asume que la persona que llama escapar&aacute; de la cadena de antemano o solo pasar&aacute; cadenas que no tengan los caracteres en la tabla en <em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">Expresiones regulares</a></em> (MDN).
ja: 下記の@ThomasLeducなどのコメントで述べたように、正規表現で<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">特殊文字</a>として予約されている特定の文字が <code>search</code> 含まれている場合、正規表現ベースの実装で問題が発生する可能性があります 。 実装では、呼び出し元が事前に文字列をエスケープするか、 <em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">正規表現</a></em> （MDN）のテーブルに文字がない文字列のみを渡すことを前提としています。
ko: @ThomasLeduc 및 기타의 아래 주석에서 언급했듯이 <code>search</code> <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">에 정규 표현식에서 특수 문자로</a> 예약 된 특정 문자가 포함 된 경우 정규 표현식 기반 구현에 문제가있을 수 있습니다. 구현에서는 호출자가 미리 문자열을 이스케이프하거나 <em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">정규 표현식</a></em> (MDN) 테이블에 문자가없는 문자열 만 전달한다고 가정합니다.
ru: Как отмечено в комментарии ниже @ThomasLeduc и других, может быть проблема с реализацией на основе регулярных выражений, если <code>search</code> содержит определенные символы, которые зарезервированы как <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">специальные символы в регулярных выражениях</a> . Реализация предполагает, что вызывающая сторона будет избегать строки заранее или будет передавать только те строки, которые не имеют символов в таблице в <em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">регулярных выражениях</a></em> (MDN).
zh_cn: 如@ThomasLeduc和其他人在下面的注释中所指出的，如果 <code>search</code> 包含某些保留为<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">正则表达式中特殊字符的字符，则</a>基于正则表达式的实现可能会出现问题。 该实现假定调用方将预先转义字符串，或仅传递不包含<em><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions#Using_special_characters">正则表达式</a></em> （MDN）表中字符的字符串。

source: As pointed out in a comment here, this will not work if your <code>omit</code> variable contains <code>place</code>, as in: <code>replaceAll("string", "s", "ss")</code>, because it will always be able to replace another occurrence of the word.
es: Como se se&ntilde;al&oacute; en un comentario aqu&iacute;, esto no funcionar&aacute; si su variable <code>omit</code> ir contiene <code>place</code> , como en: <code>replaceAll("string", "s", "ss")</code> , porque siempre podr&aacute; reemplazar otra aparici&oacute;n de la palabra .
ja: ここのコメントで指摘されているように、 <code>replaceAll("string", "s", "ss")</code> 変数に <code>place</code> が含まれている場合、 replaceAll（ "string"、 "s"、 "ss"）のようにこれは機能しません。 。
ko: 여기 주석에서 지적했듯이 <code>omit</code> 변수에 <code>place</code> 가 포함되어 있으면 <code>replaceAll("string", "s", "ss")</code> 과 같이 작동하지 않습니다. 왜냐하면 항상 단어의 다른 항목을 바꿀 수 있기 때문입니다. .
ru: Как указано в комментарии здесь, это не будет работать, если ваша переменная <code>replaceAll("string", "s", "ss")</code> содержит <code>place</code> , как в: replaceAll ("string", "s", "ss") , потому что она всегда сможет заменить другое вхождение слова ,
zh_cn: 如此处评论中所指出的，如果您的 <code>omit</code> 变量包含 <code>place</code> ，则该方法将不起作用，例如： <code>replaceAll("string", "s", "ss")</code> ，因为它将始终能够替换该单词的另一个出现位置。

source: Benchmark: <a href="https://jsperf.com/replace-all-vs-split-join">https://jsperf.com/replace-all-vs-split-join</a>
es: Punto de referencia: <a href="https://jsperf.com/replace-all-vs-split-join">https://jsperf.com/replace-all-vs-split-join</a>
ja: ベンチマーク： <a href="https://jsperf.com/replace-all-vs-split-join">https</a> : //jsperf.com/replace-all-vs-split-join
ko: 벤치 마크 : <a href="https://jsperf.com/replace-all-vs-split-join">https://jsperf.com/replace-all-vs-split-join</a>
ru: Тест: <a href="https://jsperf.com/replace-all-vs-split-join">https://jsperf.com/replace-all-vs-split-join</a>
zh_cn: 基准测试： <a href="https://jsperf.com/replace-all-vs-split-join">https</a> ： //jsperf.com/replace-all-vs-split-join

source: But as I mention earlier, it won't make a huge difference in terms of lines to be written or performance, only caching the function may effect some faster performance on long strings and also a good practice of DRY code if you want to reuse.
es: Pero como mencioné antes,no hará una gran diferencia en términos de líneas a escribir o de rendimiento,sólo el almacenamiento en caché de la función puede afectar a un rendimiento más rápido en las cuerdas largas y también una buena práctica del código DRY si quieres reutilizarlo.
ja: しかし、先に述べたように、それは記述される行数やパフォーマンスに大きな違いをもたらすことはありません。
ko: 그러나 앞에서 언급했듯이, 작성되는 줄이나 성능 측면에서 큰 차이는 없지만 함수를 캐싱하는 것만으로 긴 문자열에서 더 빠른 성능을 발휘할 수 있으며 재사용하려는 경우 DRY 코드를 잘 활용할 수 있습니다.
ru: Но,как я упоминал ранее,это не будет иметь большого значения с точки зрения написания строк или производительности,только кэширование функции может повлиять на некоторую более быструю производительность на длинных строках,а также хорошую практику DRY кода,если вы хотите использовать его повторно.
zh_cn: 但就像我前面提到的那样,在要写的行数和性能上不会有很大的区别,只是缓存功能可能会影响一些长字符串上的性能更快,如果你想重用的话,也是DRY代码的好做法。

source: But that runs the replacement twice for each cycle. Perhaps (at risk of being voted down) that can be combined for a slightly more efficient but less readable form:
es: Pero eso hace que el reemplazo se haga dos veces por cada ciclo.Tal vez (a riesgo de ser rechazado)que puede ser combinado para una forma ligeramente más eficiente pero menos legible:
ja: しかし、それは各サイクルのために2回の置換を実行します。おそらく(投票される危険性がある)それは少しより効率的な、しかし、より読みやすい形のために組み合わせることができます。
ko: 그러나 각 사이클마다 교체가 두 번 실행됩니다. 약간 더 효율적이지만 읽기 어려운 형태로 결합 될 수있는 (투표 될 위험이 있음) :
ru: Но при этом замена производится дважды за каждый цикл.Возможно (с риском быть проголосованным вниз),что может быть объединено для немного более эффективной,но менее читабельной формы:
zh_cn: 但这样一来,每个周期都要进行两次替换。也许(有被否决的风险),可以组合成一个效率稍高但可读性较差的形式。

source: Check out this <a href="http://jsben.ch/#/LFfWA"><strong>benchmark</strong></a> running these two implementations against each other.
es: Echa un vistazo a este <a href="http://jsben.ch/#/LFfWA"><strong>punto de referencia que</strong></a> ejecuta estas dos implementaciones entre s&iacute;.
ja: これら2つの実装を相互に実行するこの<a href="http://jsben.ch/#/LFfWA"><strong>ベンチマーク</strong></a>を確認してください。
ko: 이 두 가지 구현을 서로 실행하는 <a href="http://jsben.ch/#/LFfWA"><strong>벤치 마크를</strong></a> 확인하십시오.
ru: Проверьте этот <a href="http://jsben.ch/#/LFfWA"><strong>тест,</strong></a> запустив эти две реализации друг против друга.
zh_cn: 检验此<a href="http://jsben.ch/#/LFfWA"><strong>基准测试</strong></a> ，相互<strong>对照</strong>运行这两个实现。

source: Code used in tests
es: Código utilizado en las pruebas
ja: テストで使用されるコード
ko: 테스트에 사용 된 코드
ru: Код,используемый в тестах
zh_cn: 测试中使用的代码

source: Conclusion: If you have a performance critical use case (e.g processing hundreds of strings), use the Regexp method. But for most typical use cases, this is well worth not having to worry about special characters.
es: Conclusión:Si tiene un caso de uso crítico de rendimiento (por ejemplo,el procesamiento de cientos de cadenas),utilice el método Regexp.Pero para la mayoría de los casos de uso típicos,vale la pena no tener que preocuparse por los caracteres especiales.
ja: 結論。パフォーマンスが重要なユースケース(例えば何百もの文字列を処理するなど)では、Regexpメソッドを使用してください。しかし、ほとんどの典型的なユースケースでは、これは特殊文字を気にしなくて済むだけの価値があります。
ko: 결론 : 성능이 중요한 사용 사례 (예 : 수백 개의 문자열 처리)가있는 경우 Regexp 메서드를 사용하십시오. 그러나 가장 일반적인 사용 사례의 경우 특수 문자에 대해 걱정할 필요가 없습니다.
ru: Вывод:Если у вас критический сценарий использования (например,обработка сотен строк),используйте метод Regexp.Но в большинстве типичных случаев использования этого метода не стоит беспокоиться о специальных символах.
zh_cn: 总结:如果你有一个性能关键的用例(如处理数百个字符串),请使用Regexp方法。如果你有一个性能关键的用例(如处理数百个字符串),请使用Regexp方法。但对于大多数典型的用例来说,这样做是非常值得的,不用担心特殊字符。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Fiddle: <a href="http://jsfiddle.net/cdbzL/">http://jsfiddle.net/cdbzL/</a>
es: Viol&iacute;n: <a href="http://jsfiddle.net/cdbzL/">http://jsfiddle.net/cdbzL/</a>
ja: フィドル： <a href="http://jsfiddle.net/cdbzL/">http</a> : //jsfiddle.net/cdbzL/
ko: 피들 : <a href="http://jsfiddle.net/cdbzL/">http://jsfiddle.net/cdbzL/</a>
ru: Скрипка: <a href="http://jsfiddle.net/cdbzL/">http://jsfiddle.net/cdbzL/</a>
zh_cn: 小提琴： <a href="http://jsfiddle.net/cdbzL/">http</a> : //jsfiddle.net/cdbzL/

source: For 1M characters they even break Chrome
es: Para los personajes de 1M incluso rompen el cromo
ja: 1Mの文字のために彼らはChromeさえ壊す
ko: 1M 캐릭터의 경우 Chrome을 손상시킵니다.
ru: Для 1M символов они даже ломают Chrome
zh_cn: 对于1M字符,他们甚至打破了Chrome浏览器

source: For example, if we have 'a,,,b' and we wish to remove all duplicate commas.
es: Por ejemplo,si tenemos 'a,,,b' y queremos eliminar todas las comas duplicadas.
ja: 例えば、'a,,,,b'があり、重複するカンマをすべて削除したい場合。
ko: 예를 들어 'a ,,, b'가 있고 모든 중복 쉼표를 제거하려는 경우.
ru: Например,если у нас есть 'a,,,b' и мы хотим удалить все дубликаты запятых.
zh_cn: 例如,如果我们有'a,,,,,b',我们希望删除所有重复的逗号。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For replacing a single time use:
es: Para reemplazar un uso de una sola vez:
ja: 1回分の使用量を置き換えるために。
ko: 한 번만 사용하는 경우 :
ru: Для замены одноразового использования времени:
zh_cn: 用于更换一次性使用。

source: For replacing multiple times use:
es: Para reemplazar el uso de múltiples veces:
ja: 複数回使用する場合の交換用。
ko: 여러 번 교체하려면 다음을 사용하십시오.
ru: Для многократной замены:
zh_cn: 用于多次更换使用。

source: For the sake of completeness, I got to thinking about which method I should use to do this. There are basically two ways to do this as suggested by the other answers on this page.
es: Para completar,me puse a pensar en qué método debería usar para hacerlo.Hay básicamente dos maneras de hacer esto como sugieren las otras respuestas de esta página.
ja: 完結させるためには、どの方法を使えばいいのかを考えるようになりました。このページの他の回答が示唆しているように、基本的には2つの方法があります。
ko: 완벽을 기하기 위해 어떤 방법을 사용해야하는지 생각해야했습니다. 이 페이지의 다른 답변에서 제안한대로 기본적으로 두 가지 방법이 있습니다.
ru: Для полноты,я должен подумать о том,какой метод я должен использовать для этого.В принципе,есть два способа сделать это,как предлагают другие ответы на этой странице.
zh_cn: 为了完整,我开始思考应该用什么方法来做这个问题。根据本页其他答案的建议,基本上有两种方法。

source: Given that this question still gets a lot of views, I thought I might add an example of <code>.replace</code> used with a callback function. In this case, it dramatically simplifies the expression <em>and</em> provides even more flexibility, like replacing with correct capitalisation or replacing both <code>cat</code> and <code>cats</code> in one go:
es: Dado que esta pregunta a&uacute;n tiene muchas vistas, pens&eacute; que podr&iacute;a agregar un ejemplo de <code>.replace</code> utilizado con una funci&oacute;n de devoluci&oacute;n de llamada. En este caso, simplifica dr&aacute;sticamente la expresi&oacute;n <em>y</em> proporciona a&uacute;n m&aacute;s flexibilidad, como reemplazar con may&uacute;sculas correctas o reemplazar tanto <code>cat</code> como <code>cats</code> de una vez:
ja: この質問でもまだ多くのビューが得られることを考えると、コールバック関数で使用される <code>.replace</code> の例を追加すると思います。 この場合、式が大幅に簡略化され、正しい大文字で置き換える、または <code>cat</code> と <code>cats</code> の両方を一度に置き換えるなどの柔軟性がさらに向上します。
ko: 이 질문에 여전히 많은 관점이 있으므로 콜백 함수와 함께 사용되는 <code>.replace</code> 예제를 추가 할 수 있다고 생각했습니다. 이 경우 표현을 획기적으로 단순화하고 올바른 대문자로 바꾸거나 <code>cat</code> 와 <code>cats</code> 를 한 번에 바꾸는 등의 유연성을 제공합니다.
ru: Учитывая, что этот вопрос по-прежнему получает много просмотров, я подумал, что мог бы добавить пример <code>.replace</code> , используемого с функцией обратного вызова. В этом случае это значительно упрощает выражение <em>и</em> обеспечивает еще большую гибкость, например, заменяет правильную заглавную букву или заменяет <code>cat</code> и кошку за один раз:
zh_cn: 考虑到这个问题仍然有很多观点，我想我可以添加一个与回调函数一起使用的 <code>.replace</code> 示例。 在这种情况下，它极大地简化了表达式<em>并</em>提供了更大的灵活性，例如用正确的大写字母替换或一次替换 <code>cat</code> 和 <code>cats</code> ：

source: Here's a string prototype function based on the accepted answer:
es: Aquí hay un prototipo de función de cadena basado en la respuesta aceptada:
ja: ここでは、受け入れられた答えに基づいて、文字列のプロトタイプ関数を作成します。
ko: 허용되는 답변을 기반으로 한 문자열 프로토 타입 함수는 다음과 같습니다.
ru: Вот прототип строковой функции,основанной на принятом ответе:
zh_cn: 下面是一个基于接受答案的字符串原型函数。
