Repository: rueisnom/feedback
Catalog: xlf/35/55/35/00/35553500.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: They might not support cross-origin access from client-side code at all (this might be a deliberate decision on security grounds, especially if you have to pass a personalised API Key in each request).
es: Es posible que no admitan en absoluto el acceso de origen cruzado desde el código del lado del cliente (puede tratarse de una decisión deliberada por motivos de seguridad,especialmente si tiene que pasar una clave de API personalizada en cada solicitud).
ja: クライアント側のコードからのクロスオリジンアクセスを全くサポートしていないかもしれません (これはセキュリティ上の理由で意図的に決定されたものかもしれません。特に各リクエストでパーソナライズされた API キーを渡さなければならない場合はそうです)。
ko: 클라이언트 측 코드에서 교차 출처 액세스를 전혀 지원하지 않을 수 있습니다 (특히 각 요청에서 개인화 된 API 키를 전달해야하는 경우 보안상의 이유로 결정될 수 있음).
ru: Они могут вообще не поддерживать перекрестный доступ с клиентского кода (это может быть преднамеренное решение по соображениям безопасности,особенно,если в каждом запросе необходимо передавать персонализированный API ключ).
zh_cn: 他们可能根本不支持客户端代码的跨源访问(这可能是出于安全考虑,特别是当你在每次请求中都要传递一个个性化的API Key时,这可能是一个故意的决定)。

source: They might support JSONP
es: Podrían apoyar a JSONP
ja: JSONPをサポートしているかもしれません。
ko: JSONP를 지원할 수 있습니다.
ru: Они могут поддержать JSONP
zh_cn: 他们可能支持JSONP

source: They might tell you to use specific URLs
es: Puede que te digan que uses URLs específicas
ja: 特定のURLを使用するように言われるかもしれません
ko: 특정 URL을 사용하도록 지시 할 수 있습니다.
ru: Они могут сказать вам использовать определенные URL-адреса
zh_cn: 他们可能会告诉你使用特定的URLs

source: This CORS issue wasn't further elaborated (for other causes).
es: Este número de CORS no fue elaborado más (por otras causas).
ja: このCORSの問題は、(他の原因で)さらに詳しく説明されていませんでした。
ko: 이 CORS 문제는 더 이상 설명되지 않았습니다 (다른 원인).
ru: Этот вопрос CORS не получил дальнейшего развития (по другим причинам).
zh_cn: 这个CORS问题没有进一步阐述(因为其他原因)。

source: This happens when (roughly speaking) you try to make a cross-origin request that:
es: Esto sucede cuando (a grandes rasgos)intentas hacer una petición de origen cruzado que:
ja: これは、(大雑把に言えば)クロスオリジンのリクエストをしようとしたときに起こります。
ko: 이것은 (대략 말하면) 다음과 같은 출처 간 요청을하려고 할 때 발생합니다.
ru: Это происходит,когда (грубо говоря)Вы пытаетесь сделать перекрестный запрос:
zh_cn: 当(粗略地讲)你试图提出一个跨产地的要求时,就会出现这种情况。

source: This is happening because of the CORS error. CORS stands for Cross Origin Resource Sharing. In simple words, this error occurs when we try to access a domain/resource from another domain.
es: Esto está sucediendo debido al error del CORS.CORS son las siglas de Cross Origin Resource Sharing.En palabras simples,este error ocurre cuando intentamos acceder a un recurso de dominio desde otro dominio.
ja: これはCORSのエラーが原因で発生しています。CORSとはCross Origin Resource Sharingの略です。簡単に言うと、他のドメインからドメインリソースにアクセスしようとすると、このエラーが発生します。
ko: 이것은 CORS 오류로 인해 발생합니다. CORS는 Cross Origin Resource Sharing의 약자입니다. 간단히 말해이 오류는 다른 도메인에서 도메인 / 리소스에 액세스하려고 할 때 발생합니다.
ru: Это происходит из-за ошибки CORS.CORS означает "Совместное использование ресурсов кросс-происхождения".Простыми словами,эта ошибка возникает,когда мы пытаемся получить доступ к ресурсу домена с другого домена.
zh_cn: 出现这种情况是因为CORS错误。CORS是Cross Origin Resource Sharing的缩写。简单来说,当我们尝试从另一个域访问域资源时,就会出现这个错误。

source: This is not the case for this exact question, but might help others that search for that problem
es: Este no es el caso de esta pregunta exacta,pero podría ayudar a otros que buscan ese problema
ja: これは、この正確な質問の場合ではありませんが、その問題を検索する他の人の助けになるかもしれません。
ko: 이 정확한 질문의 경우는 아니지만 해당 문제를 찾는 다른 사람들을 도울 수 있습니다.
ru: Это не относится к данному вопросу,но может помочь другим,кто ищет эту проблему.
zh_cn: 这不是这个确切的问题,但可能会帮助其他寻找这个问题的人。

source: This is something you can do in your client-code to prevent CORS errors in <em>some cases</em>.
es: Esto es algo que puede hacer en su c&oacute;digo de cliente para evitar errores de CORS en <em>algunos casos</em> .
ja: これは、場合によってはCORSエラーを防ぐためにクライアントコードで実行できることです。
ko: <em>일부 경우</em> CORS 오류를 방지하기 위해 클라이언트 코드에서 수행 할 수있는 작업입니다.
ru: Это то, что вы можете сделать в своем клиентском коде, чтобы предотвратить ошибки CORS в <em>некоторых случаях</em> .
zh_cn: 您可以在客户端代码中执行此操作，以在<em>某些情况下</em>防止CORS错误。

source: This is the <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">Same Origin Policy</a>. It is a security feature implemented by browsers.
es: Esta es la <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">misma pol&iacute;tica de origen</a> . Es una caracter&iacute;stica de seguridad implementada por los navegadores.
ja: これは<a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">同一生成元ポリシー</a>です。 これは、ブラウザによって実装されるセキュリティ機能です。
ko: 이것은 <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">동일한 원산지 정책</a> 입니다. 브라우저에 의해 구현 된 보안 기능입니다.
ru: Это та <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">же политика происхождения</a> . Это функция безопасности, реализованная в браузерах.
zh_cn: 这是&ldquo; <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">同源政策&rdquo;</a> 。 它是浏览器实现的安全功能。

source: This would be fine since that is just between Mallory and Bob. There is no way for Bob to think that Mallory is Alice and to provide Mallory with data that should be kept confidential between Alice and Bob.
es: Esto estaría bien ya que eso es sólo entre Mallory y Bob.No hay manera de que Bob piense que Mallory es Alice y le proporcione a Mallory datos que deben mantenerse confidenciales entre Alice y Bob.
ja: これはマロリーとボブの間だけの話なので問題ないでしょう。ボブがマロリーがアリスだと思って、アリスとボブの間で秘密にしておくべきデータをマロリーに提供することはあり得ない。
ko: Mallory와 Bob 사이에 있기 때문에 이것은 좋을 것입니다. Bob은 Mallory가 Alice라고 생각하고 Alice와 Bob간에 기밀로 유지해야하는 데이터를 Mallory에 제공 할 방법이 없습니다.
ru: Это было бы прекрасно,так как это только между Мэллори и Бобом.У Боба нет возможности думать,что Мэллори-это Элис,и предоставлять Мэллори данные,которые должны храниться в тайне между Элис и Бобом.
zh_cn: 这样就可以了,因为那只是马洛里和鲍勃之间的事。鲍勃不可能认为马洛里是爱丽丝,也不可能认为马洛里是爱丽丝,也不可能给马洛里提供应该在爱丽丝和鲍勃之间保密的数据。

source: To fix this, if you have access to the other domain, you will have to allow Access-Control-Allow-Origin in the server. This can be added in the headers. You can enable this for all the requests/domains or a specific domain.
es: Para arreglar esto,si tienes acceso al otro dominio,tendrás que permitir el Acceso-Control-Autorización-Origen en el servidor.Esto puede ser añadido en los encabezados.Puedes habilitarlo para todos los dominios de solicitud o para un dominio específico.
ja: これを修正するには、他のドメインにアクセスしている場合は、サーバーでAccess-Control-Allow-Originを許可する必要があります。これはヘッダに追加することができます。これをすべての requestsdomains または特定のドメインに対して有効にすることができます。
ko: 이 문제를 해결하려면 다른 도메인에 액세스 할 수있는 경우 서버에서 Access-Control-Allow-Origin을 허용해야합니다. 헤더에 추가 할 수 있습니다. 모든 요청 / 도메인 또는 특정 도메인에 대해이를 활성화 할 수 있습니다.
ru: Чтобы исправить это,если у вас есть доступ к другому домену,вы должны разрешить Access-Control-Allow-Origin на сервере.Это можно добавить в заголовки.Вы можете включить его для всех доменов запросов или для определенного домена.
zh_cn: 为了解决这个问题,如果你有访问其他域的权限,你必须在服务器中允许Access-Control-Allow-Origin。这可以在头文件中添加。你可以为所有请求域或特定域启用这个功能。

source: What is stopping me from accessing the page?
es: ¿Qué me impide acceder a la página?
ja: ページへのアクセスを止めているのは何ですか?
ko: 페이지 액세스를 방해하는 이유는 무엇입니까?
ru: Что мешает мне зайти на страницу?
zh_cn: 是什么阻碍了我访问该页面?

source: Why the Same Origin Policy applies when you don't think it should
es: ¿Por qué se aplica la Política del Mismo Origen cuando no crees que debería
ja: 同一起源政策が適用されるべきではないと思うときに、なぜ同一起源政策が適用されるのか
ko: 생각하지 않을 때 동일한 출처 정책이 적용되는 이유
ru: Почему политика одного и того же происхождения применяется,когда вы не думаете,что она должна
zh_cn: 为什么在你认为不应该适用同源政策的情况下,却适用同源政策?

source: Why the Same Origin Policy only applies to JavaScript in a web page
es: Por qué la Política del Mismo Origen sólo se aplica a JavaScript en una página web
ja: 同一オリジンポリシーがウェブページのJavaScriptにのみ適用される理由
ko: 동일한 출처 정책이 웹 페이지의 JavaScript에만 적용되는 이유
ru: Почему политика идентичного происхождения применяется только к JavaScript на веб-странице.
zh_cn: 为什么同源政策只适用于网页中的JavaScript?

source: Why you can display data in the page without reading it with JS
es: ¿Por qué puedes mostrar datos en la página sin leerlos con JS
ja: JSでデータを読まずにページ内に表示できる理由
ko: JS로 읽지 않고 페이지에 데이터를 표시 할 수있는 이유
ru: Почему вы можете отображать данные на странице,не читая их с помощью JS
zh_cn: 为什么用JS可以在页面中显示数据而不需要读取数据

source: Writing something other than a web app
es: Escribir algo que no sea una aplicación web
ja: ウェブアプリ以外のものを書く
ko: 웹앱 이외의 것을 작성
ru: Написание чего-то кроме веб-приложения
zh_cn: 编写非网络应用以外的东西

source: XMLHttpRequest cannot load <a href="https://www.example.com/">https://www.example.com/</a> No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin '<a href="http://localhost:4300">http://localhost:4300</a>' is therefore not allowed access.
es: XMLHttpRequest no puede cargar <a href="https://www.example.com/">https://www.example.com/</a> No hay encabezado 'Access-Control-Allow-Origin' en el recurso solicitado. Por lo tanto, el origen ' <a href="http://localhost:4300">http: // localhost: 4300</a> ' no tiene acceso permitido.
ja: XMLHttpRequestが<a href="https://www.example.com/">https://www.example.com/を</a>読み込めません。リクエストされたリソースに「Access-Control-Allow-Origin」ヘッダーがありません。 したがって、オリジン ' <a href="http://localhost:4300">http：// localhost：4300</a> 'はアクセスを許可されません。
ko: XMLHttpRequest가 <a href="https://www.example.com/">https://www.example.com/을 (를)</a> 로드 할 수 없습니다. 요청 된 리소스에 'Access-Control-Allow-Origin'헤더가 없습니다. 따라서 원본 ' <a href="http://localhost:4300">http : // localhost : 4300</a> '은 액세스 할 수 없습니다.
ru: XMLHttpRequest не может загрузить <a href="https://www.example.com/">https://www.example.com/</a> В запрашиваемом ресурсе отсутствует заголовок &laquo;Access-Control-Allow-Origin&raquo;. Источник ' <a href="http://localhost:4300">http: // localhost: 4300</a> ', следовательно, не имеет доступа.
zh_cn: XMLHttpRequest无法加载<a href="https://www.example.com/">https://www.example.com/</a>所请求的资源上没有'Access-Control-Allow-Origin'标头。 因此，不允许访问源' <a href="http://localhost:4300">http：// localhost：4300</a> '。

source: XMLHttpRequest cannot load XXX No 'Access-Control-Allow-Origin' header
es: XMLHttpRequest no puede cargar XXX No hay un encabezado 'Access-Control-Allow-Origin'.
ko: XMLHttpRequest가 XXX 아니요 'Access-Control-Allow-Origin'헤더를로드 할 수 없음
ru: XMLHttpRequest не может загрузить XXX Нет заголовка 'Access-Control-Alloww-Origin'.
zh_cn: XMLHttpRequest无法加载XXX 没有'Access-Control-Allow-Origin'头。

source: You can make use of <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">Simple Requests</a>.
es: Puede hacer uso de <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">solicitudes simples</a> .
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">Simple Requests</a>を利用できます。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">간단한 요청</a> 을 사용할 수 있습니다.
ru: Вы можете использовать <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">простые запросы</a> .
zh_cn: 您可以使用&ldquo; <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">简单请求&rdquo;</a> 。

source: You should enable CORS to get it working.
es: Deberías habilitar el CORS para que funcione.
ja: CORSを有効にして動作させる必要があります。
ko: CORS가 작동하도록 설정해야합니다.
ru: Ты должен включить CORS,чтобы он заработал.
zh_cn: 你应该启用CORS来让它工作。

source: Your particular case is showing how it is implemented for XMLHttpRequest (and you'll get identical results if you were to use fetch), but it also applies to other things (such as images loaded onto a <code>&lt;canvas&gt;</code> or documents loaded into an <code>&lt;iframe&gt;</code>), just with slightly different implementations.
es: Su caso particular muestra c&oacute;mo se implementa para XMLHttpRequest (y obtendr&aacute; resultados id&eacute;nticos si usa fetch), pero tambi&eacute;n se aplica a otras cosas (como im&aacute;genes cargadas en un <code>&lt;canvas&gt;</code> o documentos cargados en un <code>&lt;iframe&gt;</code> ), solo con implementaciones ligeramente diferentes.
ja: あなたの特定のケースは、それがXMLHttpRequestにどのように実装されているかを示しています（フェッチを使用すると同じ結果が得られます）が、他の事柄（ <code>&lt;canvas&gt;</code> にロードされた画像や <code>&lt;iframe&gt;</code> ロードされたドキュメントなど）にも適用されますiframe&gt; ）、わずかに異なる実装。
ko: 특정 사례는 XMLHttpRequest에 대해 구현 방법을 보여 주지만 (fetch를 사용하는 경우 동일한 결과를 얻음) 다른 것들 (예 : <code>&lt;canvas&gt;</code> 에 로드 된 이미지 또는 <code>&lt;iframe&gt;</code> 약간 다른 구현으로 iframe&gt; ).
ru: Ваш конкретный случай показывает, как он реализован для XMLHttpRequest (и вы получите идентичные результаты, если будете использовать fetch), но это также относится и к другим вещам (таким как изображения, загруженные в <code>&lt;canvas&gt;</code> или документы, загруженные в <code>&lt;iframe&gt;</code> ), только с немного другими реализациями.
zh_cn: 您的特殊情况显示了如何为XMLHttpRequest实现它（如果使用fetch，您将获得相同的结果），但是它也适用于其他情况（例如，将图像加载到 <code>&lt;canvas&gt;</code> 或文档加载到 <code>&lt;iframe&gt;</code> ），只是实现方式略有不同。

source: add CORS headers
es: añadir los encabezados CORS
ja: CORS ヘッダを追加
ko: CORS 헤더 추가
ru: добавлять заголовки CORS
zh_cn: 加CORS头

source: convert the response to JSONP
es: convertir la respuesta a JSONP
ja: レスポンスを JSONP に変換します。
ko: 응답을 JSONP로 변환
ru: преобразовать ответ в JSONP
zh_cn: 转换为JSONP

source: exist on the same origin as the HTML document
es: existen en el mismo origen que el documento HTML
ja: は HTML ドキュメントと同じオリジンに存在します。
ko: HTML 문서와 동일한 출처에 존재
ru: существуют в том же происхождении,что и HTML-документ.
zh_cn: 与HTML文档同源

source: tl;dr &mdash;&nbsp;There's a summary at the end and headings in the answer to make it easier to find the relevant parts. Reading everything is recommended though as it provides useful background for understanding the <strong>why</strong> that makes seeing how the <strong>how</strong> applies in different circumstances easier.
es: tl; dr: hay un resumen al final y encabezados en la respuesta para que sea m&aacute;s f&aacute;cil encontrar las partes relevantes. Sin embargo, se recomienda leer todo, ya que proporciona antecedentes &uacute;tiles para comprender <strong>por qu&eacute;</strong> eso hace que sea m&aacute;s f&aacute;cil ver <strong>c&oacute;mo se</strong> aplica el <strong>c&oacute;mo</strong> en diferentes circunstancias.
ja: tl; dr &mdash;関連する部分を見つけやすくするために、回答の最後に見出しと見出しがあります。 すべてを読むことをお勧めし<strong>ます</strong>が、さまざまな状況で<strong>どのように</strong>適用される<strong>かを</strong>簡単に理解できるようにする<strong>理由</strong>を理解するのに役立つ背景を提供します。
ko: tl; dr &mdash; 관련 부분을보다 쉽게 ​​찾을 수 있도록 답변 끝에 제목과 제목이 요약되어 있습니다. 다른 상황에서 <strong>어떻게</strong> 적용 <strong>되는지</strong> 쉽게 <strong>알</strong> 수있는 <strong>이유</strong> 를 이해하는 데 유용한 배경을 제공하므로 모든 것을 읽는 것이 좋습니다.
ru: tl; dr - в конце есть краткое содержание и заголовки, чтобы упростить поиск соответствующих частей. Тем не менее, рекомендуется читать все, поскольку это дает полезную информацию для понимания <strong>причин</strong> , облегчающих понимание <strong>того</strong> , как и <strong>как это</strong> применяется в различных обстоятельствах.
zh_cn: tl; dr &mdash;答案的末尾有一个摘要，以便于查找相关部分。 建议您阅读所有内容，因为它提供了有用的背景知识，可帮助您理解<strong>为什么</strong>这样做的<strong>原因</strong> ，从而使您更容易<strong>了解如何</strong>在不同情况下应用。

source: tl;dr; About the Same Origin Policy
es: tl;dr;Acerca de la Política del Mismo Origen
ja: tl;dr;同一原産主義について
ko: tl; dr; 동일한 원산지 정책 정보
ru: Доктор,насчет политики одного и того же происхождения.
zh_cn: Tl;dr;关于同源政策

source: trying to put <code>Access-Control-Allow-Origin</code> and other CORS response headers on the request. These don't belong on the request, don't do anything helpful (what would be the point of a permissions system where you could grant yourself permission?), and must appear only on the response.
es: tratando de poner <code>Access-Control-Allow-Origin</code> y otros encabezados de respuesta CORS en la solicitud. Estos no pertenecen a la solicitud, no hacen nada &uacute;til (&iquest;cu&aacute;l ser&iacute;a el objetivo de un sistema de permisos en el que podr&iacute;a concederse permiso?), Y deben aparecer solo en la respuesta.
ja: リクエストに <code>Access-Control-Allow-Origin</code> およびその他のCORS応答ヘッダーを配置しようとしています。 これらはリクエストに属しておらず、役立つことは何もせず（自分に権限を付与できる権限システムのポイントは何ですか？）、応答にのみ表示される必要があります。
ko: <code>Access-Control-Allow-Origin</code> 및 기타 CORS 응답 헤더를 요청에 넣습니다. 이것들은 요청에 속하지 않으며, 도움이되는 어떤 것도하지 않습니다 (허가를받을 수있는 권한 시스템의 요점은 무엇입니까?). 응답에만 나타나야합니다.
ru: пытается поместить <code>Access-Control-Allow-Origin</code> и другие заголовки ответа CORS на запрос. Они не относятся к запросу, не делают ничего полезного (какой смысл в системе разрешений, где вы можете предоставить себе разрешение?) И должны появляться только в ответе.
zh_cn: 尝试将 <code>Access-Control-Allow-Origin</code> 和其他CORS响应标头放在请求上。 这些不属于请求，对您没有任何帮助（在权限系统中您可以授予自己权限的意义是什么？），并且必须仅出现在响应中。

source: trying to put a <code>Content-Type: application/json</code> header on a GET request that has no request body to describe the content of (typically when the author confuses <code>Content-Type</code> and <code>Accept</code>).
es: tratando de poner un <code>Content-Type: application/json</code> encabezado de aplicaci&oacute;n / json en una solicitud GET que no tiene cuerpo de solicitud para describir el contenido (generalmente cuando el autor confunde <code>Content-Type</code> y <code>Accept</code> ).
ja: <code>Content-Type: application/json</code> を記述するリクエストボディのないGETリクエストにContent-Type：application / jsonヘッダーを配置しようとしている（通常、作成者が <code>Content-Type</code> と <code>Accept</code> を混同している場合）。
ko: <code>Content-Type: application/json</code> 를 설명 할 요청 본문이없는 GET 요청에 Content-Type : application / json 헤더를 넣으려고합니다 (일반적으로 작성자가 <code>Content-Type</code> 과 <code>Accept</code> 를 혼동 할 때).
ru: попытка поместить заголовок <code>Content-Type: application/json</code> в запрос GET, у которого нет тела запроса для описания содержимого (обычно, когда автор путает <code>Content-Type</code> и <code>Accept</code> ).
zh_cn: 尝试在没有请求正文的GET请求上放置 <code>Content-Type: application/json</code> 标头（通常在作者混淆 <code>Content-Type</code> 和 <code>Accept</code> 时 ）。
