Repository: rueisnom/feedback
Catalog: xlf/35/55/35/00/35553500.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If Bob is running a public API then there might be a mechanism to turn on CORS (perhaps by formatting the request in a certain way, or a config option after logging into a Developer Portal site for Bob's site). This will have to be a mechanism implemented by Bob though. Mallory could read the documentation on Bob's site to see if something is available, or she could talk to Bob and ask him to implement CORS.
es: Si Bob está ejecutando una API pública,entonces podría haber un mecanismo para activar el CORS (tal vez formateando la solicitud de una cierta manera,o una opción de configuración después de iniciar sesión en un sitio de Portal del Desarrollador para el sitio de Bob).Sin embargo,este tendrá que ser un mecanismo implementado por Bob.Mallory podría leer la documentación del sitio de Bob para ver si hay algo disponible,o podría hablar con Bob y pedirle que implemente el CORS.
ja: Bob が public API を実行している場合、CORS を有効にする仕組みがあるかもしれません (おそらくリクエストを特定の方法でフォーマットするか、Bob のサイトの開発者ポータルサイトにログインした後に設定オプションを設定する)。しかし、これはBobが実装したメカニズムでなければなりません。Mallory は Bob のサイトのドキュメントを読んで何か利用可能なものがあるかどうかを確認するか、あるいは Bob に相談して CORS の実装を依頼することができます。
ko: Bob이 공개 API를 실행중인 경우 CORS를 설정하는 메커니즘이있을 수 있습니다 (아마도 특정 방식으로 요청을 형식화하거나 Bob의 사이트에 대한 개발자 포털 사이트에 로그인 한 후 구성 옵션을 사용하여). 이것은 Bob이 구현 한 메커니즘이어야합니다. Mallory는 Bob의 사이트에있는 설명서를 읽고 사용 가능한 것이 있는지 확인하거나 Bob과 대화하여 CORS를 구현하도록 요청할 수 있습니다.
ru: Если Боб работает с публичным API,то может существовать механизм включения CORS (возможно,путем форматирования запроса определенным образом,или с помощью опции конфигурации после входа на сайт портала разработчика для сайта Боба).Однако это должен быть механизм,реализованный Бобом.Мэллори могла бы прочитать документацию на сайте Боба,чтобы узнать,есть ли что-то доступное,или она могла бы поговорить с Бобом и попросить его внедрить CORS.
zh_cn: 如果Bob正在运行一个公共API,那么可能会有一个机制来打开CORS(也许是通过特定的方式格式化请求,或者在登录到Bob的网站的开发者门户站点后的配置选项)。但这必须由Bob实现的机制。Mallory可以阅读Bob的网站上的文档,看看是否有可用的东西,或者她可以和Bob谈谈,请他实现CORS。

source: If it is a public service:
es: Si es un servicio público:
ja: 公共サービスであれば
ko: 공공 서비스 인 경우 :
ru: Если это общественная служба:
zh_cn: 如果是公共服务的话。

source: If none of the above apply: Get the browser to talk to <em>your</em> server instead, and then have your server fetch the data from the other server and pass it on. (There are also third-party hosted services which attach CORS headers to publically accessible resources that you could use).
es: Si no se aplica nada de lo anterior: haga que el navegador hable con <em>su</em> servidor, y luego haga que su servidor obtenga los datos del otro servidor y los pase. (Tambi&eacute;n hay servicios alojados de terceros que adjuntan encabezados CORS a recursos de acceso p&uacute;blico que puede utilizar).
ja: 上記のいずれにも当てはまらない場合：代わりにブラウザーにサーバーと通信さ<em>せ、</em>サーバーに他のサーバーからデータをフェッチして渡します。 （CORSヘッダーを公的にアクセス可能なリソースに添付して使用できるサードパーティのホスティングサービスもあります）。
ko: 위의 어느 것도 해당되지 않는 경우 : 브라우저가 대신 서버와 통신하도록 한 <em>다음</em> 서버가 다른 서버에서 데이터를 가져 와서 전달하도록하십시오. CORS 헤더를 공개적으로 액세스 할 수있는 리소스에 연결하는 타사 호스팅 서비스도 있습니다.
ru: Если ничего из вышеперечисленного не применимо: попросите браузер подключиться к <em>вашему</em> серверу, а затем попросите сервер получить данные с другого сервера и передать их. (Существуют также сторонние размещенные сервисы, которые прикрепляют заголовки CORS к общедоступным ресурсам, которые вы можете использовать).
zh_cn: 如果上述方法均不适用：请让浏览器与<em>您的</em>服务器通信，然后让您的服务器从另一台服务器获取数据并继续传递。 （还有一些第三方托管服务，它们将CORS标头附加到您可以使用的可公开访问的资源上）。

source: If the HTML document the JS runs in and the URL being requested are on the same origin (sharing the same scheme, hostname, and port) then they Same Origin Policy grants permission by default. CORS is not needed.
es: Si el documento HTML en el que se ejecuta el JS y el URL que se solicita están en el mismo origen (compartiendo el mismo esquema,nombre de host y puerto),entonces la Política del Mismo Origen otorga permiso por defecto.El CORS no es necesario.
ja: JS が実行する HTML ドキュメントと要求される URL が同じオリジンにある場合 (同じスキーム、ホスト名、ポートを共有している場合)、同じオリジンポリシーがデフォルトで許可を与えます。CORSは必要ありません。
ko: JS가 실행되는 HTML 문서와 요청중인 URL이 동일한 출처 (같은 체계, 호스트 이름 및 포트를 공유)에있는 경우, 동일한 출처 정책은 기본적으로 권한을 부여합니다. CORS는 필요하지 않습니다.
ru: Если HTML документ,в котором запущен JS,и запрашиваемый URL-адрес находится в том же происхождении (по той же схеме,с тем же именем хоста и портом),то по умолчанию они имеют то же самое Origin Policy предоставляет разрешение.CORS не требуется.
zh_cn: 如果JS运行的HTML文档和被请求的URL是在同一个原点上(共享相同的方案、主机名和端口),那么它们的同一原点策略默认授予权限。CORS是不需要的。

source: If you are correctly doing something that needs a preflight
es: Si estás haciendo correctamente algo que necesita un pre-vuelo
ja: プリフライトが必要なことを正しく行っている場合
ko: 프리 플라이트가 필요한 작업을 올바르게 수행하는 경우
ru: Если вы правильно делаете что-то,что нуждается в предполетном полете.
zh_cn: 如果你所做的事情是正确的,需要进行飞行前的检查

source: If you are friendly with the person who controls it: Get them to add CORS permissions to it.
es: Si eres amigo de la persona que lo controla:Haz que le agreguen permisos de CORS.
ja: あなたがそれを制御する人と友好的である場合。それにCORSの権限を追加するためにそれらを取得します。
ko: 제어하는 사람과 친숙한 경우 : CORS 권한을 추가하도록하십시오.
ru: Если ты дружишь с человеком,который его контролирует:Заставьте их добавить к нему разрешения CORS.
zh_cn: 如果你和控制它的人很友好。让他们给它添加CORS权限。

source: If you are triggering a preflight by mistake
es: Si está activando un pre-vuelo por error...
ja: 間違ってプリフライトを発動してしまった場合
ko: 실수로 프리 플라이트를 트리거하는 경우
ru: Если вы по ошибке запускаете предполет.
zh_cn: 如果你错误地触发了预飞行

source: If you are using <a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch">the <code>fetch</code> API</a> (rather than <code>XMLHttpRequest</code>), then you can configure it to not try to use CORS.
es: Si est&aacute; utilizando <a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch">la API de <code>fetch</code> </a> (en lugar de <code>XMLHttpRequest</code> ), puede configurarla para que no intente utilizar CORS.
ja: （ <code>XMLHttpRequest</code> ではなく） <a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch"> <code>fetch</code> API</a>を使用している場合は、 CORSを使用しないように構成できます。
ko: <code>XMLHttpRequest</code> 대신 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch"> <code>fetch</code> API</a> 를 사용하는 경우 CORS를 사용하지 않도록 API 를 구성 할 수 있습니다.
ru: Если вы используете <a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch">API <code>fetch</code> </a> (а не <code>XMLHttpRequest</code> ), вы можете настроить его так, чтобы он не пытался использовать CORS.
zh_cn: 如果使用的<a href="https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch">是 <code>fetch</code> API</a> （而不是 <code>XMLHttpRequest</code> ），则可以将其配置为不尝试使用CORS。

source: If you control the server the request is being made to: Add CORS permissions to it.
es: Si controla el servidor al que se le hace la solicitud:Añade los permisos del CORS.
ja: リクエストが行われるサーバーを制御している場合。CORS パーミッションを追加します。
ko: 서버를 제어하는 ​​경우 요청이 수행됩니다. CORS 권한을 추가하십시오.
ru: Если вы контролируете сервер,на который делается запрос:Добавьте к нему разрешения CORS.
zh_cn: 如果你控制了请求的服务器。给它添加CORS权限。

source: If your client code does not explicit set affected Headers (e.g. "Accept") with a fix value in the request it <em>might</em> occur that some clients do set these Headers automatically with some "non-standard" values causing the server to not accept it as Simple Request - which will give you a CORS error.
es: Si su c&oacute;digo de cliente no establece expl&iacute;citamente los encabezados afectados (por ejemplo, "Aceptar") con un valor fijo en la solicitud, <em>puede</em> ocurrir que algunos clientes establezcan estos encabezados autom&aacute;ticamente con algunos valores "no est&aacute;ndar", lo que hace que el servidor no los acepte como Solicitud simple: que le dar&aacute; un error CORS.
ja: クライアントコードが影響を受けるヘッダー（例： "Accept"）をリクエストの修正値で明示的に設定し<em>ない</em>場合、一部のクライアントがこれらのヘッダーをいくつかの "非標準"値で自動的に設定し、サーバーがそれを受け入れないようにする<em>可能</em>性があります。単純なリクエスト-CORSエラーが発生します。
ko: 클라이언트 코드가 요청에서 수정 된 값으로 영향을받는 헤더 (예 : "수락")를 명시 적으로 설정하지 않은 경우 일부 클라이언트는 "비표준"값으로 이러한 헤더를 자동으로 설정하여 서버가이를 수락하지 않을 수 있습니다. 간단한 요청-CORS 오류가 발생합니다.
ru: Если ваш клиентский код не устанавливает явные заголовки (например, &laquo;Принять&raquo;) с фиксированным значением в запросе, <em>может</em> случиться так, что некоторые клиенты автоматически устанавливают эти заголовки с некоторыми &laquo;нестандартными&raquo; значениями, в результате чего сервер не принимает его как Простой запрос - который даст вам ошибку CORS.
zh_cn: 如果您的客户端代码未在请求中使用固定值显式设置受影响的标头（例如&ldquo; Accept&rdquo;），则<em>可能会</em>发生某些客户端确实使用某些&ldquo;非标准&rdquo;值自动设置这些标头，导致服务器不接受该标头的情况。简单请求-这会给您一个CORS错误。

source: In either of these cases, removing the extra request header will often be enough to avoid the need for a preflight (which will solve the problem when communicating with APIs that support simple requests but not preflighted requests).
es: En cualquiera de estos casos,la eliminación del encabezamiento de solicitud adicional a menudo bastará para evitar la necesidad de una comprobación previa (lo que resolverá el problema cuando se comunique con las API que admiten solicitudes simples pero no solicitudes comprobadas previamente).
ja: これらのいずれの場合も、余分なリクエストヘッダを削除するだけでプリフライトの必要性を回避できることが多いです (これは単純なリクエストをサポートしているがプリフライトされていないリクエストをサポートしている API と通信する際の問題を解決してくれます)。
ko: 두 경우 모두 추가 요청 헤더를 제거하면 프리 플라이트가 필요하지 않을 수 있습니다 (단순 요청은 지원하지만 프리 플라이트 요청은 지원하지 않는 API와 통신 할 때 문제가 해결됨).
ru: В любом из этих случаев удаления лишнего заголовка запроса часто будет достаточно для того,чтобы избежать необходимости в префлете (который решит проблему при общении с API,поддерживающими простые запросы,но не префлетом).
zh_cn: 在上述任何一种情况下,删除额外的请求头通常就可以避免预检(当与支持简单请求但不支持预检请求的API进行通信时,这将解决这个问题)。

source: In order to perform a 'Simple Requests' the request needs to meet several conditions. E.g. only allowing <code>POST</code>, <code>GET</code> and <code>HEAD</code> method, as well as only allowing some given Headers (you can find all conditions <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">here</a>).
es: Para realizar una 'Solicitud simple', la solicitud debe cumplir varias condiciones. Por ejemplo, solo permite el m&eacute;todo <code>POST</code> , <code>GET</code> y <code>HEAD</code> , as&iacute; como solo permite algunos encabezados (puede encontrar todas las condiciones <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">aqu&iacute;</a> ).
ja: 「単純なリクエスト」を実行するには、リクエストがいくつかの条件を満たす必要があります。 たとえば、 <code>POST</code> 、 <code>GET</code> および <code>HEAD</code> メソッドのみを許可し、特定のヘッダーのみを許可します（ <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">ここで</a>すべての条件を見つけることができます）。
ko: '간단한 요청'을 수행하려면 요청이 여러 조건을 충족해야합니다. 예를 들어 <code>POST</code> , <code>GET</code> 및 <code>HEAD</code> 메소드 만 허용하고 일부 지정된 헤더 만 허용합니다 ( <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">여기에서</a> 모든 조건을 찾을 수 있음).
ru: Для выполнения &laquo;простых запросов&raquo; запрос должен соответствовать нескольким условиям. Например, разрешить только метод <code>POST</code> , <code>GET</code> и <code>HEAD</code> , а также разрешить только некоторые заданные заголовки (вы можете найти все условия <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">здесь</a> ).
zh_cn: 为了执行&ldquo;简单请求&rdquo;，请求需要满足几个条件。 例如，仅允许 <code>POST</code> ， <code>GET</code> 和 <code>HEAD</code> 方法，以及仅允许某些给定的Header（您可以<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests">在此处</a>找到所有条件）。

source: In these cases then <strong>the rest of this answer still applies</strong> but you also need to make sure that the server can listen for the preflight request (which will be <code>OPTIONS</code> (and not <code>GET</code>, <code>POST</code> or whatever you were trying to send) and respond to it with the right <code>Access-Control-Allow-Origin</code> header but also <code>Access-Control-Allow-Methods</code> and <code>Access-Control-Allow-Headers</code> to allow your specific HTTP methods or headers.
es: En estos casos, <strong>el resto de esta respuesta a&uacute;n se aplica,</strong> pero tambi&eacute;n debe asegurarse de que el servidor pueda escuchar la solicitud de verificaci&oacute;n previa (que ser&aacute;n <code>OPTIONS</code> (y no <code>GET</code> , <code>POST</code> o lo que sea que est&eacute; tratando de enviar) y responder a ella con el encabezado derecho <code>Access-Control-Allow-Origin</code> pero tambi&eacute;n <code>Access-Control-Allow-Methods</code> y <code>Access-Control-Allow-Headers</code> para permitir sus m&eacute;todos o encabezados HTTP espec&iacute;ficos.
ja: これらの場合<strong>でも、この回答の残りの部分は引き続き適用されます</strong>が、サーバーがプリフライトリクエスト（ <code>OPTIONS</code> （および <code>GET</code> 、 <code>POST</code> または送信しようとしていたものではない））をリッスンし<strong>、それに応答</strong>できることを確認する必要もあります。適切な <code>Access-Control-Allow-Origin</code> ヘッダーだけでなく、 <code>Access-Control-Allow-Methods</code> および <code>Access-Control-Allow-Headers</code> を使用して、特定のHTTPメソッドまたはヘッダーを許可します。
ko: 이 경우 <strong>에도이 답변의 나머지 부분이 여전히 적용</strong> 되지만 서버가 프리 플라이트 요청 ( <code>OPTIONS</code> (및 <code>GET</code> , <code>POST</code> 또는 보내려는 것이 아닌))을 수신하고 응답 할 수 있는지 확인해야합니다. 올바른 <code>Access-Control-Allow-Origin</code> 헤더와 함께 <code>Access-Control-Allow-Methods</code> 및 <code>Access-Control-Allow-Headers</code> 를 사용하여 특정 HTTP 메소드 또는 헤더를 허용하십시오.
ru: В этих случаях <strong>остальная часть этого ответа по-прежнему применима,</strong> но вам также необходимо убедиться, что сервер может прослушать запрос предварительной проверки (это будут <code>OPTIONS</code> (а не <code>GET</code> , <code>POST</code> или все, что вы пытались отправить) и ответить на него. с правильным заголовком <code>Access-Control-Allow-Origin</code> , а также с <code>Access-Control-Allow-Methods</code> и <code>Access-Control-Allow-Headers</code> , чтобы разрешить ваши конкретные методы HTTP или заголовки.
zh_cn: 在这种情况下<strong>，此答案的其余部分仍然适用，</strong>但是您还需要确保服务器可以侦听预检请求（将是 <code>OPTIONS</code> （而不是 <code>GET</code> ， <code>POST</code> 或您尝试发送的任何内容）并对其进行响应使用正确的 <code>Access-Control-Allow-Origin</code> 标头，以及 <code>Access-Control-Allow-Methods</code> 和 <code>Access-Control-Allow-Headers</code> 以允许您的特定HTTP方法或标头。

source: Includes credentials like cookies
es: Incluye credenciales como galletas
ja: クッキーのような資格情報を含む
ko: 쿠키와 같은 자격 증명 포함
ru: Включает в себя учетные данные,например,cookie-файлы
zh_cn: 包括cookies等凭证

source: It is possible for a browser extension to inject the CORS headers in the response before the Same Origin Policy is applied.
es: Es posible que una extensión del navegador inyecte los encabezados CORS en la respuesta antes de que se aplique la Política del Mismo Origen.
ja: ブラウザの拡張機能が、同一オリジンポリシーが適用される前に、レスポンスにCORSヘッダーを注入することが可能です。
ko: 동일한 오리진 정책이 적용되기 전에 브라우저 확장이 응답에 CORS 헤더를 삽입 할 수 있습니다.
ru: Возможно расширение браузера для впрыскивания заголовков CORS в ответ перед применением политики идентичного происхождения.
zh_cn: 在应用同一来源策略之前,浏览器扩展可以在响应中注入CORS标题。

source: It requires that Mallory trust Bob not to provide malicious code.
es: Requiere que Mallory confíe en Bob para no proporcionar código malicioso.
ja: マロリーが悪意のあるコードを提供しないようにボブを信頼する必要があります。
ko: Mallory가 Bob에게 악성 코드를 제공하지 않도록 신뢰해야합니다.
ru: Она требует,чтобы Мэллори доверила Бобу не предоставлять вредоносный код.
zh_cn: 它要求Mallory信任Bob不提供恶意代码。

source: It will either:
es: Lo hará también:
ja: それはどちらかになります。
ko: 다음 중 하나입니다.
ru: Это тоже будет:
zh_cn: 它要么会。

source: It will let you make a simple request, not see the response, and not fill the Developer Console with error messages.
es: Le permitirá hacer una simple solicitud,no ver la respuesta,y no llenar la Consola de Desarrollo con mensajes de error.
ja: 簡単なリクエストをして、レスポンスを見ず、Developer Consoleにエラーメッセージを記入しないようにしてくれます。
ko: 간단한 요청을하고 응답을 보지 않으며 개발자 콘솔에 오류 메시지를 표시하지 않습니다.
ru: Это позволит вам сделать простой запрос,не видеть ответа и не заполнять консоль разработчика сообщениями об ошибках.
zh_cn: 它可以让你做一个简单的请求,看不到响应,也不会让开发者控制台中充满错误信息。

source: It works by presenting the data in the form of a JavaScript program which injects the data into Mallory's page.
es: Funciona presentando los datos en forma de un programa JavaScript que inyecta los datos en la página de Mallory.
ja: マロリーのページにデータを注入するJavaScriptプログラムの形でデータを提示することで動作します。
ko: Mallory의 페이지에 데이터를 주입하는 JavaScript 프로그램 형식으로 데이터를 표시하여 작동합니다.
ru: Она работает,представляя данные в виде программы JavaScript,которая инжектирует их на страницу Мэллори.
zh_cn: 它的工作原理是将数据以JavaScript程序的形式呈现,并将数据注入到Mallory的页面中。

source: Just that I've pointed the wrong URL so this header wasn't reflected properly (in which i kept presume it did). localhost (front end) -&gt; call to non secured http (supposed to be https), make sure the API end point from front end is pointing to the correct protocol.
es: Solo que se&ntilde;al&eacute; la URL incorrecta para que este encabezado no se refleje correctamente (en el que segu&iacute; suponiendo que s&iacute;). localhost (front end) -&gt; llamada a http no seguro (se supone que es https), aseg&uacute;rese de que el punto final de la API desde el front end est&eacute; apuntando al protocolo correcto.
ja: 間違ったURLをポイントしただけで、このヘッダーは正しく反映されませんでした（私はそれがそうだったと思い込んでいました）。 localhost（フロントエンド）-&gt;セキュアでないhttp（httpsと想定される）の呼び出し。フロントエンドからのAPIエンドポイントが正しいプロトコルを指していることを確認します。
ko: 내가 잘못된 URL을 지적했기 때문에이 헤더가 제대로 반영되지 않았습니다 (내가 계속 추측했습니다). localhost (프론트 엔드)-&gt; 보안되지 않은 http에 대한 호출 (https 인 경우), 프론트 엔드의 API 엔드 포인트가 올바른 프로토콜을 가리키는 지 확인하십시오.
ru: Просто я указал неправильный URL, поэтому этот заголовок не был отражен должным образом (в котором я предположил, что он это сделал). localhost (внешний интерфейс) -&gt; вызов незащищенного http (должен быть https), убедитесь, что конечная точка API от внешнего интерфейса указывает на правильный протокол.
zh_cn: 只是我指出了错误的URL，所以未正确反映此标头（我一直认为其中确实如此）。 本地主机（前端）-&gt;调用非安全的http（假定为https），请确保前端的API端点指向正确的协议。

source: Make sure you aren't triggering a preflight request you don't need. The API might grant permission for simple requests but not preflighted requests.
es: Asegúrate de no activar una solicitud de pre-vuelo que no necesites.La API puede conceder permiso para solicitudes simples pero no para solicitudes de verificación previa.
ja: 必要のないプリフライトリクエストをトリガーしていないことを確認してください。API は単純なリクエストに対しては許可を与えるかもしれませんが、プリフライトされたリクエストに対しては許可を与えないかもしれません。
ko: 필요없는 프리 플라이트 요청을 트리거하지 않아야합니다. API는 간단한 요청에 대한 권한을 부여하지만 사전 비행 요청은 허용하지 않을 수 있습니다.
ru: Убедитесь,что вы не запускаете предрейсовый запрос,который вам не нужен.API может дать разрешение на простые запросы,но не на префлайтовые.
zh_cn: 确保你没有触发一个你不需要的预检请求。API可能会对简单的请求授予权限,但不是预亮请求。

source: Mallory <em>could</em> use server-side code to fetch the data (which she could then pass from her server to Alice's browser through HTTP as usual).
es: Mallory <em>podr&iacute;a</em> usar el c&oacute;digo del lado del servidor para obtener los datos (que luego podr&iacute;a pasar de su servidor al navegador de Alice a trav&eacute;s de HTTP como de costumbre).
ja: マロリー<em>は</em> 、サーバー側のコードを使用してデータをフェッチすることができます（データは、通常どおり、サーバーからHTTP経由でアリスのブラウザに渡すことができます）。
ko: Mallory <em>는</em> 서버 측 코드를 사용하여 데이터를 가져올 수 있습니다 (그런 다음 평소와 같이 HTTP를 통해 서버에서 Alice의 브라우저로 전달할 수 있음).
ru: Мэллори <em>могла</em> использовать серверный код для извлечения данных (которые она могла затем передать со своего сервера в браузер Алисы через HTTP, как обычно).
zh_cn: Mallory <em>可以</em>使用服务器端代码来获取数据（然后可以照常通过HTTP将其从服务器传递到Alice的浏览器）。

source: Mallory runs a website (<code>http://localhost:4300</code> in your example)
es: Mallory ejecuta un sitio web ( <code>http://localhost:4300</code> en su ejemplo)
ja: マロリーはウェブサイトを実行します（例では <code>http://localhost:4300</code> ）
ko: Mallory는 웹 사이트를 실행합니다 (예 <code>http://localhost:4300</code> )
ru: Мэллори управляет веб-сайтом ( <code>http://localhost:4300</code> в вашем примере)
zh_cn: Mallory运行一个网站（在您的示例中为 <code>http://localhost:4300</code> ）

source: Mallory was trusted
es: Mallory era de confianza
ja: マロリーは信頼されていた
ko: 말로리는 신뢰했다
ru: Мэллори доверяли
zh_cn: 马洛里是值得信赖的

source: Move the two resources to a single Origin
es: Mover los dos recursos a un solo Origen
ja: 2つのリソースを1つのOriginに移動
ko: 두 자원을 단일 원점으로 이동
ru: Переместить два ресурса в один Происхождение
zh_cn: 将两个资源转移到一个单一的Origin

source: My problem was, I was trying to go to the site using <code>http://</code> instead of <code>https://</code>. So there was nothing to fix, just had to go to the same site using <code>https</code>.
es: Mi problema era que intentaba ir al sitio usando <code>http://</code> en lugar de <code>https://</code> . As&iacute; que no hab&iacute;a nada que arreglar, solo ten&iacute;a que ir al mismo sitio usando <code>https</code> .
ja: 私の問題は、 <code>https://</code> ではなく <code>http://</code> を使用してサイトにアクセスしようとしたことでした。 したがって、修正する必要はなく、 <code>https</code> を使用して同じサイトにアクセスする必要がありました。
ko: 내 문제는 <code>https://</code> 대신 <code>http://</code> 를 사용하여 사이트로 이동하려고했습니다. 그래서 고칠 것이 없었습니다. <code>https</code> 를 사용하여 같은 사이트로 가야했습니다.
ru: Моя проблема заключалась в том, что я пытался перейти на сайт, используя <code>http://</code> вместо <code>https://</code> . Так что нечего было исправлять, просто нужно было зайти на тот же сайт с помощью <code>https</code> .
zh_cn: 我的问题是，我试图使用 <code>http://</code> 而不是 <code>https://</code> 转到该站点。 因此，没有什么可修复的，只需要使用 <code>https</code> 转到同一站点即可。

source: NB: Some requests are complex and send a <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">preflight</a> OPTIONS request that the server will have to respond to before the browser will send the GET/POST/PUT/Whatever request that the JS wants to make. Implementations of CORS that only add <code>Access-Control-Allow-Origin</code> to specific URLs often get tripped up by this.
es: NB: Algunas solicitudes son complejas y env&iacute;an una solicitud OPTIONS de <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">verificaci&oacute;n</a> previa a la que el servidor tendr&aacute; que responder antes de que el navegador env&iacute;e GET / POST / PUT / Cualquier solicitud que el JS quiera hacer. Las implementaciones de CORS que solo agregan <code>Access-Control-Allow-Origin</code> a URL espec&iacute;ficas a menudo se tropiezan con esto.
ja: 注意：一部のリクエストは複雑で、ブラウザがJSの要求するGET / POST / PUT / Whateverリクエストを送信する<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">前</a>にサーバーが応答する必要があるプリフライト OPTIONSリクエストを送信します。 特定のURLに <code>Access-Control-Allow-Origin</code> を追加するだけのCORSの実装は、多くの場合、これによって作動します。
ko: NB : 일부 요청은 복잡하며 브라우저가 JS가 원하는 GET / POST / PUT / 무엇을 보내기 전에 서버가 응답해야하는 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">프리 플라이트</a> OPTIONS 요청을 보냅니다. 특정 URL에 <code>Access-Control-Allow-Origin</code> 만 추가하는 CORS 구현은 종종 이것에 의해 트립됩니다.
ru: NB. Некоторые запросы являются сложными и отправляют предварительный запрос OPTIONS, на который сервер должен будет ответить, прежде чем браузер отправит запрос GET / POST / PUT / независимо от того, что JS хочет сделать. Реализации CORS, которые только добавляют <code>Access-Control-Allow-Origin</code> к определенным URL-адресам, часто запутываются этим.
zh_cn: 注意：有些请求很复杂，并且会发送一个服务器必须响应的<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">预检</a> OPTIONS请求，然后浏览器才发送JS想要发出的GET / POST / PUT /任何请求。 仅将 <code>Access-Control-Allow-Origin</code> 添加到特定URL的CORS实现经常会因此而被绊倒。
