Repository: rueisnom/feedback
Catalog: xlf/35/55/35/00/35553500.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Get" request with appending headers transform to "Options" request. So Cors policy problems occur. You have to implement "Options" request to your server.
es: La solicitud de "Obtener" con los encabezados adjuntos se transforma en una solicitud de "Opciones".Así que se producen problemas de política de Cors.Tiene que implementar la solicitud "Opciones" en su servidor.
ja: "Get "リクエストにヘッダを追加して "Options "リクエストに変換します。そのため、Corsのポリシーに問題が発生します。オプション "リクエストをサーバに実装する必要があります。
ko: 헤더를 추가 한 "Get"요청은 "Options"요청으로 변환됩니다. 따라서 Cors 정책 문제가 발생합니다. 서버에 "옵션"요청을 구현해야합니다.
ru: "Получить" запрос с добавлением заголовков трансформировать в "Опции" запрос.Таким образом,возникают проблемы с политикой корса.Вы должны реализовать запрос "Options" к вашему серверу.
zh_cn: "Get "请求与附加头的 "获取 "请求转化为 "选项 "请求。所以Cors策略的问题就出现了。你必须在你的服务器上实现 "Options "请求。

source: &hellip; but the browser has no way of knowing if either of the above are true, so trust is not automatic and the SOP is applied. Permission has to be granted explicitly before the browser will give the data it was given to a different website.
es: ... pero el navegador no tiene forma de saber si alguna de las anteriores es verdadera, por lo que la confianza no es autom&aacute;tica y se aplica el SOP. El permiso debe otorgarse expl&iacute;citamente antes de que el navegador entregue los datos que se le dieron a un sitio web diferente.
ja: &hellip;しかし、ブラウザは上記のいずれかが真であるかどうかを知る方法がないため、信頼は自動的ではなく、SOPが適用されます。 ブラウザーが別のWebサイトに与えられたデータを提供する前に、明示的に許可を与える必要があります。
ko: &hellip; 그러나 브라우저는 위의 내용 중 하나에 해당하는지 알 수 없으므로 신뢰가 자동이 아니며 SOP가 적용됩니다. 브라우저가 다른 웹 사이트에 제공 한 데이터를 제공하기 전에 권한이 명시 적으로 부여되어야합니다.
ru: ... но браузер не может узнать, верно ли любое из вышеперечисленного, поэтому доверие не является автоматическим и применяется SOP. Разрешение должно быть предоставлено явно, прежде чем браузер предоставит данные, которые были переданы другому веб-сайту.
zh_cn: &hellip;但是浏览器无法知道以上两个条件是否成立，因此信任不是自动的，因此会应用SOP。 在浏览器将数据提供给其他网站之前，必须明确授予权限。

source: &hellip; in the response headers to permit any website to read the data.
es: ... en los encabezados de respuesta para permitir que cualquier sitio web lea los datos.
ja: &hellip;応答ヘッダーで、任意のWebサイトがデータを読み取ることを許可します。
ko: &hellip; 응답 헤더에서 모든 웹 사이트가 데이터를 읽을 수 있도록합니다.
ru: &hellip; В заголовках ответов, чтобы разрешить любому веб-сайту читать данные.
zh_cn: &hellip;在响应标题中，以允许任何网站读取数据。

source: &hellip; would allow only a specific site to access it, and Bob can dynamically generate that based on the <code>Origin</code><em>request</em> header to permit multiple, but not all, sites to access it.
es: ... permitir&iacute;a que solo un sitio espec&iacute;fico acceda a &eacute;l, y Bob puede generarlo din&aacute;micamente en funci&oacute;n del encabezado de <em>solicitud de</em> <code>Origin</code> para permitir que m&uacute;ltiples, pero no todos, los sitios accedan a &eacute;l.
ja: &hellip;特定のサイトのみにアクセスを許可し、Bobは <code>Origin</code> <em>リクエスト</em>ヘッダーに基づいて動的に生成して、すべてではなく複数のサイトにアクセスを許可できます。
ko: &hellip; 특정 사이트 만 액세스 할 수 있으며 Bob은 <code>Origin</code> <em>요청</em> 헤더를 기반으로 해당 사이트를 동적으로 생성하여 모든 사이트가 아닌 여러 사이트에서 액세스 할 수 있도록합니다.
ru: &hellip; Разрешит доступ к нему только определенному сайту, и Боб может динамически сгенерировать его на основе заголовка <em>запроса</em> <code>Origin</code> , чтобы разрешить доступ к нему нескольким, но не всем сайтам.
zh_cn: &hellip;将仅允许特定站点访问它，而Bob可以基于 <code>Origin</code> <em>请求</em>标头动态生成该<em>消息，</em>以允许多个但不是全部站点访问它。

source: (Weirdly, it also applies to CSS fonts, but that is because found foundries insisted on DRM and not for the security issues that the Same Origin Policy usually covers).
es: (Extrañamente,también se aplica a las fuentes CSS,pero eso se debe a que las fundiciones insistieron en el DRM y no por los problemas de seguridad que la Política del Mismo Origen suele cubrir).
ja: (不思議なことに、これは CSS フォントにも適用されますが、これはファウンドリが DRM を主張したためであり、同一起源規則が通常カバーしているセキュリティの問題ではないからです)。
ko: 일반적으로 CSS 글꼴에도 적용되지만 파운드리가 DRM을 주장하기 때문에 동일한 출처 정책에서 일반적으로 다루는 보안 문제가 아닙니다.
ru: (Странно,но это относится и к шрифтам CSS,но это потому,что литейные цеха настаивали на DRM,а не на вопросах безопасности,на которые обычно распространяется политика одного и того же происхождения).
zh_cn: 奇怪的是,这也适用于CSS字体,但这是因为代工厂商坚持使用DRM,而不是因为同源政策通常涵盖的安全问题)。

source: <code>*</code> Browser extensions do need to be written carefully to avoid cross-origin issues. <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">See the Chrome documentation for example</a>.
es: <code>*</code> Las extensiones del navegador deben escribirse cuidadosamente para evitar problemas de origen cruzado. <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">Consulte la documentaci&oacute;n de Chrome, por ejemplo</a> .
ja: <code>*</code> クロスオリジンの問題を回避するために、ブラウザ拡張機能は慎重に記述する必要があります。 <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">例については、Chromeのドキュメントを参照してください</a> 。
ko: 교차 출처 문제를 피하려면 브라우저 확장 프로그램을 신중하게 작성해야합니다. <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">예를 들어 Chrome 설명서를 참조하십시오</a> .
ru: <code>*</code> Расширения браузера должны быть написаны тщательно, чтобы избежать проблем с несколькими источниками. <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">См. Документацию Chrome, например</a> .
zh_cn: <code>*</code> 浏览器扩展确实需要仔细编写，以避免跨域问题。 <a href="https://www.chromium.org/Home/chromium-security/extension-content-script-fetches">例如，请参阅Chrome文档</a> 。

source: A Proxy
es: Un apoderado
ja: 代理人
ko: 프록시
ru: Доверенное лицо
zh_cn: 代理人

source: A basic implementation would just include:
es: Una aplicación básica sólo incluiría:
ja: 基本的な実装であれば、単に含まれているだけでしょう。
ko: 기본 구현에는 다음이 포함됩니다.
ru: Базовая реализация будет только включать в себя:
zh_cn: 一个基本的实施方案只需包括:

source: About the Same Origin Policy
es: Sobre la política del mismo origen
ja: 同一起源規定について
ko: 동일한 원산지 정책 정보
ru: О политике одного и того же происхождения
zh_cn: 关于同源政策

source: Access to fetch at '<code>https://example.com/</code>' from origin '<code>https://example.net</code>' has been blocked by CORS policy: No '<code>Access-Control-Allow-Origin</code>' header is present on the requested resource. If an opaque response serves your needs, set the request's mode to 'no-cors' to fetch the resource with CORS disabled.
es: El acceso a la b&uacute;squeda en ' <code>https://example.com/</code> ' desde el origen ' <code>https://example.net</code> ' ha sido bloqueado por la pol&iacute;tica de CORS: No hay encabezado ' <code>Access-Control-Allow-Origin</code> ' en el recurso solicitado. Si una respuesta opaca satisface sus necesidades, configure el modo de la solicitud en 'no-cors' para recuperar el recurso con CORS deshabilitado.
ja: 「 <code>https://example.com/</code> 」での起点「 https://example.net 」からのフェッチへのアクセスがCORSポリシーによってブロックされました：要求されたリソースに「 <code>Access-Control-Allow-Origin</code> 」ヘッダーが存在しません。 不透明な応答でニーズが満たされる場合は、リクエストのモードを「no-cors」に設定して、CORSを無効にしてリソースをフェッチします。
ko: CORS 정책에 의해 ' <code>https://example.net</code> '출처에서 가져 오기 ' <code>https://example.com/</code> '에 대한 <code>Access-Control-Allow-Origin</code> 가 CORS 정책에 의해 차단되었습니다. 요청 된 자원에 ' Access-Control-Allow-Origin '헤더가 없습니다. 불투명 한 응답이 사용자의 요구에 부응하는 경우 CORS가 비활성화 된 상태에서 리소스를 가져 오려면 요청 모드를 'no-cors'로 설정하십시오.
ru: Доступ к выборке по адресу <code>https://example.com/</code> из источника &laquo; <code>https://example.net</code> &raquo; был заблокирован политикой CORS: в запрошенном ресурсе отсутствует заголовок &laquo; <code>Access-Control-Allow-Origin</code> &raquo;. Если непрозрачный ответ отвечает вашим потребностям, установите режим запроса &laquo;no-cors&raquo;, чтобы получить ресурс с отключенным CORS.
zh_cn: 从源&ldquo; <code>https://example.net</code> &rdquo;访问&ldquo; <code>https://example.com/</code> &rdquo;处的访存已被CORS策略阻止：请求的资源上不存在&ldquo; <code>Access-Control-Allow-Origin</code> &rdquo;标头。 如果不透明的响应满足您的需求，请将请求的模式设置为&ldquo; no-cors&rdquo;，以在禁用CORS的情况下获取资源。

source: Alice is a person with a web browser
es: Alice es una persona con un navegador web
ja: アリスはWebブラウザを使っている人
ko: 앨리스는 웹 브라우저를 가진 사람입니다
ru: Элис-это человек с веб-браузером.
zh_cn: 爱丽丝是一个拥有网络浏览器的人

source: Alice is logged into Bob's site and has some confidential data there. Perhaps it is a company intranet (accessible only to browsers on the LAN), or her online banking (accessible only with a cookie you get after entering a username and password).
es: Alice está conectada al sitio de Bob y tiene algunos datos confidenciales allí.Tal vez sea una intranet de la empresa (accesible sólo para navegadores en la LAN),o su banca en línea (accesible sólo con una cookie que se obtiene después de introducir un nombre de usuario y una contraseña).
ja: アリスはボブのサイトにログインしていて、そこに機密データを持っています。おそらくそれは社内のイントラネット(LAN上のブラウザからのみアクセス可能)か、彼女のオンラインバンキング(ユーザー名とパスワードを入力した後に得られるクッキーでのみアクセス可能)だと思われます。
ko: Alice는 Bob의 사이트에 로그인하여 기밀 데이터를 가지고 있습니다. 회사 인트라넷 (LAN의 브라우저에서만 액세스 가능) 또는 온라인 뱅킹 (사용자 이름 및 비밀번호를 입력 한 후 쿠키로만 액세스 가능) 일 수 있습니다.
ru: Элис входит на сайт Боба и имеет там некоторые конфиденциальные данные.Возможно,это корпоративный интранет (доступен только браузерам в локальной сети)или ее интернет-банкинг (доступен только с помощью куки-файла,который вы получаете после ввода имени пользователя и пароля).
zh_cn: Alice登录了Bob的网站,在那里有一些机密数据。也许是公司内部网(只有局域网上的浏览器才能访问),或者是她的网上银行(只有在输入用户名和密码后,才能通过cookie访问)。

source: Alice visits Mallory's website which has some JavaScript that causes Alice's browser to make an HTTP request to Bob's website (from her IP address with her cookies, etc). This could be as simple as using <code>XMLHttpRequest</code> and reading the <code>responseText</code>.
es: Alice visita el sitio web de Mallory que tiene JavaScript que hace que el navegador de Alice haga una solicitud HTTP al sitio web de Bob (desde su direcci&oacute;n IP con sus cookies, etc.). Esto podr&iacute;a ser tan simple como usar <code>XMLHttpRequest</code> y leer el texto de <code>responseText</code> .
ja: アリスは、アリスのブラウザにボブのウェブサイトへのHTTPリクエスト（彼女のIPアドレスからのCookieなど）を実行させるJavaScriptが含まれているマロリーのウェブサイトにアクセスします。 これは、 <code>XMLHttpRequest</code> を使用して <code>responseText</code> を読み取るのと同じくらい簡単です。
ko: Alice는 Mallory의 웹 사이트를 방문합니다. 여기에는 Alice의 브라우저가 쿠키를 사용하여 IP 주소에서 Bob의 웹 사이트로 HTTP 요청을하는 JavaScript가 포함되어 있습니다. <code>XMLHttpRequest</code> 를 사용하고 <code>responseText</code> 를 읽는 것만 큼 간단 할 수 있습니다.
ru: Алиса посещает веб-сайт Мэллори, на котором есть некоторый JavaScript, который заставляет браузер Алисы отправлять HTTP-запрос на веб-сайт Боба (с ее IP-адреса с помощью файлов cookie и т. Д.). Это может быть так же просто, как использование <code>XMLHttpRequest</code> и чтение <code>responseText</code> .
zh_cn: 爱丽丝访问Mallory的网站，该网站具有一些JavaScript，这些JavaScript导致爱丽丝的浏览器向鲍勃的网站发出HTTP请求（从她的IP地址，她的cookie等）。 这可以像使用 <code>XMLHttpRequest</code> 并读取 <code>responseText</code> 一样简单。

source: Alice, Bob and Mallory are the same person.
es: Alice,Bob y Mallory son la misma persona.
ja: アリスとボブとマロリーは同一人物。
ko: 앨리스, 밥, 말로리는 같은 사람입니다.
ru: Элис,Боб и Мэллори-один и тот же человек.
zh_cn: 爱丽丝、鲍勃和马洛里是同一个人。

source: Alternatives to CORS
es: Alternativas al CORS
ja: CORSの代替品
ko: CORS의 대안
ru: Альтернативы CORS
zh_cn: CORS的替代品

source: As noted in the section "Why the Same Origin Policy only applies to JavaScript in a web page", you can avoid the SOP by not writing JavaScript in a webpage.
es: Como se ha señalado en la sección "Por qué la Política del Mismo Origen sólo se aplica a JavaScript en una página web",se puede evitar la PNO no escribiendo JavaScript en una página web.
ja: 同一オリジンポリシーがWebページのJavaScriptにのみ適用される理由」で述べたように、WebページにJavaScriptを記述しないことでSOPを回避することができます。
ko: "동일한 원본 정책이 웹 페이지의 JavaScript에만 적용되는 이유"섹션에서 언급 한 것처럼 웹 페이지에서 JavaScript를 작성하지 않으면 SOP를 피할 수 있습니다.
ru: Как отмечено в разделе "Почему политика одинакового происхождения применяется только к JavaScript на веб-странице",вы можете избежать SOP,не написав JavaScript на веб-странице.
zh_cn: 正如在 "为什么同源政策只适用于网页中的JavaScript "一节中提到的,你可以通过不在网页中编写JavaScript来避免SOP。

source: As this isn't mentioned in the accepted answer.
es: Como esto no se menciona en la respuesta aceptada.
ja: 受理された回答には記載されていないので
ko: 이것은 받아 들여진 대답에 언급되어 있지 않습니다.
ru: Как это не упоминается в принятом ответе.
zh_cn: 由于这一点在接受的答案中没有提到。

source: Bob could also provide the data using a hack like <a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONP</a> which is how people did cross-origin Ajax before CORS came along.
es: Bob tambi&eacute;n podr&iacute;a proporcionar los datos utilizando un truco como <a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONP,</a> que es como la gente cruz&oacute; el Ajax antes de que apareciera CORS.
ja: ボブは、 <a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONPの</a>ようなハックを使用してデータを提供することもできます。これは、CORSが登場する前に人々がAjaxをクロスオリジンで作成した方法です。
ko: Bob은 <a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONP</a> 와 같은 핵을 사용하여 데이터를 제공 할 수 있는데, 이는 CORS가 등장하기 전에 사람들이 Ajax를 교차 출처로 사용한 방식입니다.
ru: Боб мог также предоставить данные, используя хак, такой как <a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONP. Именно так</a> люди делали Ajax с несколькими источниками до появления CORS.
zh_cn: 鲍勃还可以使用<a href="https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about">JSONP之</a>类的黑客提供数据，这是人们在CORS出现之前对Ajax进行跨源编程的方式。

source: Bob is providing entirely public information
es: Bob está proporcionando información totalmente pública
ja: ボブは完全に公開情報を提供している
ko: 밥은 전적으로 공개 정보를 제공하고 있습니다
ru: Боб предоставляет полностью общественную информацию
zh_cn: 鲍勃提供的完全是公共信息

source: Bob runs a website (<code>https://www.[website].com/</code> in your example)
es: Bob ejecuta un sitio web ( <code>https://www.[website].com/</code> en su ejemplo)
ja: BobはWebサイト（例では <code>https://www.[website].com/</code> しています
ko: Bob은 웹 사이트를 실행합니다 (예 <code>https://www.[website].com/</code> )
ru: Боб руководит сайтом ( <code>https://www.[website].com/</code> в вашем примере)
zh_cn: 鲍勃经营一个网站（在您的示例中为 <code>https://www.[website].com/</code> ）

source: Bob wouldn't need to grant any permissions for that to happen.
es: Bob no necesitaría conceder ningún permiso para que eso ocurra.
ja: ボブはそのために許可を与える必要はないでしょう。
ko: Bob은이를 위해 권한을 부여 할 필요가 없습니다.
ru: Бобу не понадобилось бы давать никаких разрешений,чтобы это произошло.
zh_cn: 鲍勃不需要授予任何权限就能做到这一点。

source: Browser extensions
es: Extensiones del navegador
ja: ブラウザの拡張機能
ko: 브라우저 확장
ru: Расширения браузера
zh_cn: 浏览器扩展

source: Browser extensions<code>*</code>, the Network tab in browser developer tools and applications like Postman are installed software. They aren't passing data from one website to the JavaScript belonging to a different website <em>just because you visited that different website</em>. Installing software usually takes a more conscious choice.
es: Las extensiones del navegador <code>*</code> , la pesta&ntilde;a Red en las herramientas y aplicaciones de desarrollo del navegador como Postman son software instalado. No pasan datos de un sitio web al JavaScript que pertenece a un sitio web diferente <em>solo porque usted visit&oacute; ese sitio web diferente</em> . La instalaci&oacute;n del software generalmente requiere una elecci&oacute;n m&aacute;s consciente.
ja: ブラウザー拡張機能 <code>*</code> 、ブラウザー開発者ツールの[ネットワーク]タブ、およびPostmanなどのアプリケーションは、インストールされたソフトウェアです。 あるWebサイトから別のWebサイトにアクセス<em>したからといっ</em>て、別のWebサイトに属しているJavaScriptにデータを渡していないの<em>です</em> 。 ソフトウェアのインストールは通常、より意識的な選択を行います。
ko: 브라우저 확장 프로그램 <code>*</code> , 브라우저 개발자 도구의 네트워크 탭 및 Postman과 같은 응용 프로그램이 소프트웨어로 설치됩니다. 그들은 다른 웹 사이트 <em>를 방문했기 때문에 한</em> 웹 사이트에서 다른 웹 사이트에 속하는 JavaScript로 데이터를 전달하지 않습니다. 소프트웨어를 설치하려면 일반적으로보다 의식적인 선택이 필요합니다.
ru: Расширения браузера <code>*</code> , вкладка Сеть в инструментах разработчика браузера и приложения, такие как Postman, являются установленным программным обеспечением. Они не передают данные с одного веб-сайта в JavaScript, принадлежащий другому веб-сайту, <em>только потому, что вы посетили этот другой веб-сайт</em> . Установка программного обеспечения обычно требует более осознанного выбора.
zh_cn: 浏览器扩展程序 <code>*</code> ，浏览器开发人员工具和Postman等应用程序中的网络选项卡是已安装的软件。 他们不会<em>因为您访问另一个网站</em>而将数据从一个网站传递到属于不同网站的JavaScript中。 安装软件通常需要更明智的选择。

source: But I'm not Bob!
es: ¡Pero yo no soy Bob!
ja: でも私はボブじゃない!
ko: 그러나 나는 밥이 아니다!
ru: Но я не Боб!
zh_cn: 但我不是鲍勃!

source: Common mistakes that trigger this include:
es: Los errores comunes que desencadenan esto incluyen:
ja: そのきっかけとなるよくある間違いには、以下のようなものがあります。
ko: 이를 유발하는 일반적인 실수는 다음과 같습니다.
ru: Обычные ошибки,которые приводят к этому,включают в себя:
zh_cn: 触发这种情况的常见错误包括:

source: Consequently, Mallory can only use this technique to read <em>public</em> data.
es: En consecuencia, Mallory solo puede usar esta t&eacute;cnica para leer datos <em>p&uacute;blicos</em> .
ja: したがって、マロリーはこの手法を使用して<em>公開</em>データを読み取ることしかできません。
ko: 결과적으로 Mallory는이 기술을 사용하여 <em>공개</em> 데이터를 읽을 수 있습니다.
ru: Следовательно, Мэллори может использовать эту технику только для чтения <em>общедоступных</em> данных.
zh_cn: 因此，Mallory只能使用此技术读取<em>公共</em>数据。

source: Couldn't be generated with a regular HTML form (e.g. has custom headers or a Content-Type that you couldn't use in a form's <code>enctype</code>).
es: No se pudo generar con un formulario HTML normal (p. Ej., Tiene encabezados personalizados o un tipo de contenido que no puede usar en el tipo de <code>enctype</code> ).
ja: 通常のHTMLフォームでは生成できませんでした（例：フォームの <code>enctype</code> で使用できないカスタムヘッダーまたはContent-Typeがあります）。
ko: 일반 HTML 양식으로 생성 할 수 없습니다 (예 : 사용자 정의 헤더 또는 양식의 <code>enctype</code> 에서 사용할 수없는 Content-Type이 있음).
ru: Не может быть сгенерировано с помощью обычной HTML-формы (например, имеет пользовательские заголовки или Content-Type, которые вы не можете использовать в <code>enctype</code> формы).
zh_cn: 无法使用常规HTML表单生成（例如，具有自定义标头或无法在表单的 <code>enctype</code> 中使用的Content-Type）。

source: Error messages which mention "Response for preflight"
es: Mensajes de error que mencionan "Respuesta para pre-vuelo"
ja: プリフライトの応答」について言及したエラーメッセージ
ko: "프리 플라이트에 대한 응답"이라는 오류 메시지
ru: Сообщения об ошибках,в которых упоминается "Ответ для предполетного полета".
zh_cn: 提到 "飞行前反应 "的错误信息

source: For any given URL it is possible that the SOP is not needed. A couple of common scenarios where this is the case are:
es: Para cualquier URL dada es posible que el SOP no sea necesario.Un par de escenarios comunes en los que este es el caso son:
ja: 任意の URL については、SOP が必要ない可能性があります。このような場合には、いくつかの一般的なシナリオがあります。
ko: 주어진 URL에 대해 SOP가 필요하지 않을 수 있습니다. 이 경우에 일반적인 몇 가지 시나리오는 다음과 같습니다.
ru: Для любого заданного URL возможно,что SOP не нужен.Пара распространенных сценариев,где это возможно:
zh_cn: 对于任何给定的URL,有可能不需要SOP。在这种情况下,常见的几种情况是:。

source: Having a proper development environment with a local development <em>server</em> is usually a better approach.
es: Tener un entorno de desarrollo adecuado con un <em>servidor de</em> desarrollo local suele ser un mejor enfoque.
ja: 通常、ローカル開発<em>サーバー</em>で適切な開発環境を用意することをお勧めします。
ko: 로컬 개발 <em>서버</em> 와 함께 적절한 개발 환경을 갖는 것이 일반적으로 더 나은 방법입니다.
ru: Наличие подходящей среды разработки с локальным <em>сервером</em> разработки обычно является лучшим подходом.
zh_cn: 通常，使用本地开发<em>服务器</em>使用适当的开发环境是一种更好的方法。

source: How to do it is explained by the Chrome error message given when you make a request using <code>fetch</code> and don't get permission to view the response with CORS:
es: La forma de hacerlo se explica en el mensaje de error de Chrome que aparece cuando realiza una solicitud utilizando <code>fetch</code> y no obtiene permiso para ver la respuesta con CORS:
ja: これを行う方法は、 <code>fetch</code> を使用してリクエストを作成し、CORSでレスポンスを表示する権限を取得していないときに表示されるChromeエラーメッセージで説明されています。
ko: 이를 수행하는 방법은 <code>fetch</code> 사용하여 요청하고 CORS로 응답을 볼 수있는 권한이없는 경우 제공되는 Chrome 오류 메시지로 설명됩니다.
ru: Как это сделать, объясняется сообщением об ошибке Chrome, которое выдается, когда вы делаете запрос, используя <code>fetch</code> , и не получаете разрешения на просмотр ответа с помощью CORS:
zh_cn: 当您使用 <code>fetch</code> 进行请求且没有获得使用CORS查看响应的权限时，Chrome给出了Chrome错误消息，说明了操作方法：

source: How to get a cross-origin resource sharing (CORS) post request working
es: Cómo hacer que funcione una solicitud de intercambio de recursos de origen cruzado (CORS)
ja: クロスオリジンリソース共有(CORS)のポストリクエストを機能させる方法
ko: CORS (Cross-Origin Resource Sharing) 사후 요청 작업 방법
ru: Как заставить работать пост-запрос на совместное использование ресурсов (CORS)с перекрестным происхождением
zh_cn: 如何实现跨源资源共享(CORS)岗位请求的工作方式

source: I got the same error in Chrome console.
es: Tengo el mismo error en la consola Chrome.
ja: Chromeコンソールでも同じエラーが出ました。
ko: Chrome 콘솔에서 동일한 오류가 발생했습니다.
ru: У меня та же ошибка в консоли Chrome.
zh_cn: 我在Chrome游戏机中也出现了同样的错误。

source: I have a Grunt process which initiates an instance of express.js server. This was working absolutely fine up until just now when it started serving a blank page with the following appearing in the error log in the developer's console in Chrome (latest version):
es: Tengo un proceso Grunt que inicia una instancia del servidor express.js.Esto funcionaba absolutamente bien hasta ahora,cuando empezó a servir una página en blanco con lo siguiente apareciendo en el registro de errores de la consola del desarrollador en Chrome (última versión):
ja: 私は、express.jsサーバーのインスタンスを起動するGruntプロセスを持っています。これは今まで全く問題なく動作していましたが、先ほどまでは空白のページが表示され、Chrome(最新版)の開発者コンソールのエラーログに以下のように表示されていました。
ko: express.js 서버의 인스턴스를 시작하는 Grunt 프로세스가 있습니다. Chrome의 개발자 콘솔 (최신 버전)에서 오류 로그에 다음과 같이 빈 페이지가 게재되기 시작한 지금까지는 제대로 작동했습니다.
ru: У меня есть процесс Grunt,который инициирует экземпляр сервера express.js.Он работал абсолютно нормально до тех пор,пока не начал обслуживать пустую страницу с последующим появлением в лог-журнале ошибок в консоли разработчика в Chrome (последняя версия):
zh_cn: 我有一个 Grunt 进程,它启动了一个 express.js 服务器的实例。直到刚才,它的工作非常顺利,但在Chrome浏览器(最新版本)的开发者控制台中,它开始为一个空白页面提供服务,并在错误日志中出现以下内容。

source: I'm having this issue currently under different reason. My front end is returning 'Access-Control-Allow-Origin' header error as well.
es: Estoy teniendo este asunto actualmente bajo una razón diferente.Mi frontal también devuelve el error de cabecera "Acceso-Control-Autorización-Origen".
ja: 私は現在、別の理由でこの問題を抱えています。私のフロントエンドも同様に 'Access-Control-Allow-Origin' ヘッダーエラーを返しています。
ko: 현재 다른 이유로이 문제가 있습니다. 내 프론트 엔드도 'Access-Control-Allow-Origin'헤더 오류를 반환합니다.
ru: У меня сейчас этот вопрос по другой причине.Моя передняя часть также возвращает ошибку заголовка 'Access-Control-Alloww-Origin'.
zh_cn: 我目前在不同的原因下遇到了这个问题。我的前端也返回'Access-Control-Allow-Origin'的标题错误。
