Repository: rueisnom/feedback
Catalog: xlf/35/55/35/00/35553500.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that SOP / CORS do not mitigate <a href="https://en.wikipedia.org/wiki/Cross-site_scripting">XSS</a>, <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a>, or <a href="https://en.wikipedia.org/wiki/SQL_injection">SQL Injection</a> attacks which need to be handled independently.
es: Tenga en cuenta que SOP / CORS no mitiga <a href="https://en.wikipedia.org/wiki/Cross-site_scripting">los</a> ataques de <a href="https://en.wikipedia.org/wiki/SQL_injection">inyecci&oacute;n</a> XSS , <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a> o SQL que deben manejarse de forma independiente.
ja: SOP / CORSは、個別に処理する必要がある<a href="https://en.wikipedia.org/wiki/Cross-site_scripting">XSS</a> 、 <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a> 、または<a href="https://en.wikipedia.org/wiki/SQL_injection">SQLインジェクション</a>攻撃を軽減しないことに注意してください。
ko: SOP / CORS는 독립적으로 처리해야하는 <a href="https://en.wikipedia.org/wiki/Cross-site_scripting">XSS</a> , <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a> 또는 <a href="https://en.wikipedia.org/wiki/SQL_injection">SQL 주입</a> 공격을 완화하지 않습니다.
ru: Обратите внимание, что SOP / CORS не смягчают атаки <a href="https://en.wikipedia.org/wiki/Cross-site_scripting">XSS</a> , <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a> или <a href="https://en.wikipedia.org/wiki/SQL_injection">SQL-инъекций,</a> которые необходимо обрабатывать независимо.
zh_cn: 请注意，SOP / CORS不会缓解需要独立处理的<a href="https://en.wikipedia.org/wiki/Cross-site_scripting">XSS</a> ， <a href="https://en.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a>或<a href="https://en.wikipedia.org/wiki/SQL_injection">SQL注入</a>攻击。

source: Note that this won't let you do anything that you require CORS to do. You will not be able to read the response. You will not be able to make a request that requires a preflight.
es: Tenga en cuenta que esto no le permitirá hacer nada que requiera que el CORS haga.No podrás leer la respuesta.No podrá hacer una solicitud que requiera un vuelo previo.
ja: これではCORSに要求するようなことはできないので注意してください。応答を読むことができなくなります。プリフライトを必要とするリクエストはできません。
ko: 이렇게하면 CORS에 필요한 작업을 수행 할 수 없습니다. 응답을 읽을 수 없습니다. 프리 플라이트가 필요한 요청을 할 수 없습니다.
ru: Обратите внимание,что это не позволит вам сделать то,что вы требуете от CORS.Вы не сможете прочитать ответ.Вы не сможете сделать запрос,требующий совершения предполетного полета.
zh_cn: 注意,这不会让你做任何你要求CORS做的事情。您将无法读取响应。您将无法提出需要预检的请求。

source: Note the common theme: The site providing the data has to tell the browser that it is OK for a third party site to access the data it is sending to the browser.
es: Fíjese en el tema común:El sitio que proporciona los datos tiene que decirle al navegador que está bien que un sitio de terceros acceda a los datos que está enviando al navegador.
ja: 共通のテーマに注意してください。データを提供するサイトは、ブラウザに送信しているデータに第三者のサイトがアクセスしても問題ないことをブラウザに伝えなければなりません。
ko: 공통 주제를 참고하십시오. 데이터를 제공하는 사이트는 브라우저가 타사 사이트가 브라우저로 보내는 데이터에 액세스하는 것이 좋다고 브라우저에 알려야합니다.
ru: Обратите внимание на общую тему:Сайт,предоставляющий данные,должен сообщить браузеру,что третьим лицам разрешен доступ к данным,которые он отправляет в браузер.
zh_cn: 注意共同的主题。提供数据的网站必须告诉浏览器,第三方网站可以访问它向浏览器发送的数据。

source: Obviously granting permission via CORS is something Bob would only do only if either:
es: Obviamente conceder el permiso a través del CORS es algo que Bob sólo haría si lo hiciera:
ja: 明らかにCORSを介して許可を与えることは、ボブがどちらか一方の場合にのみ行うものです。
ko: 분명히 CORS를 통해 권한을 부여하는 것은 Bob이 다음 중 하나의 경우에만 수행하는 것입니다.
ru: Очевидно,что выдача разрешения через CORS-это то,что Боб мог бы сделать только если бы и то,и другое:
zh_cn: 显然,通过CORS授予许可是鲍勃只有在以下两种情况下才会做的事情。

source: Opaque responses
ja: 不透明な反応
ko: 불투명 한 반응
ru: непрозрачные ответы
zh_cn: 不透明的反应

source: Other security risks
es: Otros riesgos de seguridad
ja: その他のセキュリティリスク
ko: 다른 보안 위험
ru: Другие риски безопасности
zh_cn: 其他安全风险

source: Read More about it here: <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">CORS error with jquery</a>
es: Lea m&aacute;s sobre esto aqu&iacute;: <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">error de CORS con jquery</a>
ja: 詳細はこちら： <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">jqueryでのCORSエラー</a>
ko: 여기에 대해 더 읽어보십시오 : <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">jquery의 CORS 오류</a>
ru: Подробнее об этом читайте здесь: <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">ошибка CORS с jquery</a>
zh_cn: 在这里阅读有关它的更多信息： <a href="https://stackoverflow.com/questions/25923796/cors-error-with-jquery">jQuery的CORS错误</a>

source: Read their API documentation to see what they say about accessing it with client-side JavaScript:
es: Lea la documentación de la API para ver lo que dicen sobre el acceso con JavaScript del lado del cliente:
ja: API のドキュメントを読んで、クライアントサイド JavaScript でのアクセスについての説明を確認してください。
ko: API 문서를 읽고 클라이언트 측 JavaScript로 액세스하는 것에 대한 의견을 확인하십시오.
ru: Ознакомьтесь с их API документацией,чтобы узнать,что они говорят о доступе к нему с помощью клиентского JavaScript:
zh_cn: 阅读他们的API文档,看看他们是怎么说用客户端JavaScript访问的。

source: Since JSONP works by appending a <code>&lt;script&gt;</code> element to load the data in the form of a JavaScript program which calls a function already in the page, attempting to use the JSONP technique on a URL which returns JSON will fail &mdash; typically with a CORB error &mdash; because JSON is not JavaScript.
es: Dado que JSONP funciona agregando un elemento <code>&lt;script&gt;</code> para cargar los datos en forma de un programa JavaScript que llama a una funci&oacute;n que ya est&aacute; en la p&aacute;gina, el intento de utilizar la t&eacute;cnica JSONP en una URL que devuelve JSON fallar&aacute;, generalmente con un error CORB - porque JSON no es JavaScript.
ja: JSONPは、 <code>&lt;script&gt;</code> 要素を追加して、ページ内の既存の関数を呼び出すJavaScriptプログラムの形式でデータをロードすることで機能するため、JSONを返すURLでJSONP手法を使用しようとすると、通常はCORBエラーで失敗します&mdash; JSONはJavaScriptではないためです。
ko: JSONP는 <code>&lt;script&gt;</code> 요소를 추가하여 페이지에 이미있는 함수를 호출하는 JavaScript 프로그램 형식으로 데이터를로드하는 방식으로 작동하므로 JSON을 반환하는 URL에서 JSONP 기술을 사용하려고 시도하면 일반적으로 CORB 오류가 발생합니다. &mdash; JSON은 JavaScript가 아니기 때문입니다.
ru: Поскольку JSONP работает путем добавления элемента <code>&lt;script&gt;</code> для загрузки данных в форме программы JavaScript, которая вызывает функцию, уже находящуюся на странице, попытка использовать технику JSONP для URL-адреса, который возвращает JSON, завершится неудачно - обычно с ошибкой CORB - потому что JSON - это не JavaScript.
zh_cn: 由于JSONP通过添加 <code>&lt;script&gt;</code> 元素以JavaScript程序的形式加载数据而工作，该JavaScript程序调用了页面中已存在的函数，因此尝试在返回JSON的URL上使用JSONP技术将失败&mdash;通常会出现CORB错误&mdash;因为JSON不是JavaScript。

source: Some cross origin requests are <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">preflighted</a>.
es: Algunas solicitudes de origen cruzado se <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">verifican previamente</a> .
ja: 一部のクロスオリジン要求は<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">プリフライトされてい</a>ます。
ko: 일부 교차 출발 요청은 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">프리 플라이트</a> 됩니다.
ru: Некоторые перекрестные запросы отправляются <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">заранее</a> .
zh_cn: 一些跨源请求已经<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests">过时</a> 。

source: Sometimes people make mistakes when trying to construct Ajax requests, and sometimes these trigger the need for a preflight. If the API is designed to allow cross-origin requests, but doesn't require anything that would need a preflight, then this can break access.
es: A veces la gente comete errores al tratar de construir las peticiones de Ajax,y a veces estos desencadenan la necesidad de un pre-vuelo.Si el API está diseñado para permitir solicitudes de origen cruzado,pero no requiere nada que requiera una verificación previa,entonces esto puede interrumpir el acceso.
ja: Ajax リクエストを構築しようとするときに間違いを犯すことがありますが、それがプリフライトの必要性を誘発することもあります。API がクロスオリジンリクエストを許可するように設計されていても、プリフライトを必要とするようなものは何も必要としない場合は、アクセスが途切れる可能性があります。
ko: 때때로 사람들은 Ajax 요청을 구성하려고 할 때 실수를 저지르고 때로는 프리 플라이트가 필요합니다. API가 교차 출처 요청을 허용하도록 설계되었지만 프리 플라이트가 필요한 항목이 필요하지 않으면 액세스가 중단 될 수 있습니다.
ru: Иногда люди совершают ошибки,пытаясь построить запросы Ajax,а иногда это вызывает необходимость в предполетном перелете.Если API разработано для разрешения перекрестных запросов,но не требует ничего,что потребовало бы совершения предполетного полета,то это может нарушить доступ.
zh_cn: 有时,人们在尝试构造Ajax请求时,会犯一些错误,有时这些错误会触发需要预检。如果API被设计成允许跨源请求,但不需要任何需要预检的东西,那么这可能会破坏访问。

source: Sometimes you need to make an HTTP request, but you don't need to read the response. e.g. if you are posting a log message to the server for recording.
es: A veces es necesario hacer una solicitud HTTP,pero no es necesario leer la respuesta.Por ejemplo,si está publicando un mensaje de registro en el servidor para su grabación.
ja: HTTP リクエストが必要な場合もありますが、レスポンスを読む必要はありません。
ko: 때로는 HTTP 요청을해야하지만 응답을 읽을 필요는 없습니다. 예를 들어 기록을 위해 로그 메시지를 서버에 게시하는 경우.
ru: Иногда вам нужно сделать HTTP-запрос,но вам не нужно читать ответ.Например,если вы размещаете лог-сообщение на сервере для записи.
zh_cn: 有时你需要做一个HTTP请求,但你不需要读取响应,例如,如果你要发布日志消息到服务器上进行记录。

source: Target server must allowed cross-origin request. In order to allow it through express, simply handle http options request :
es: El servidor de destino debe permitir la solicitud de origen cruzado.Para permitirlo a través de expreso,simplemente maneja la solicitud de opciones http:
ja: ターゲットサーバがクロスオリジンリクエストを許可する必要があります。express で許可するためには、単に http オプションのリクエストを処理するだけです。
ko: 대상 서버는 출처 간 요청을 허용해야합니다. Express를 통해 허용하려면 간단히 http 옵션 요청을 처리하십시오.
ru: Целевой сервер должен разрешить кросс-оригинальный запрос.Для того,чтобы разрешить его через экспресс,просто обработайте http запрос опций :
zh_cn: 目标服务器必须允许跨源请求。为了允许通过expert,只需处理http选项请求。

source: That doesn't mean you can't continue to use JavaScript and HTML, but you could distribute it using some other mechanism, such as Node-WebKit or PhoneGap.
es: Eso no significa que no puedas seguir usando JavaScript y HTML,pero podrías distribuirlo usando algún otro mecanismo,como Node-WebKit o PhoneGap.
ja: だからと言って、JavaScriptやHTMLを使い続けられないわけではなく、Node-WebKitやPhoneGapのような別の仕組みを使って配布してもいいのではないでしょうか。
ko: 그렇다고 JavaScript와 HTML을 계속 사용할 수는 없지만 Node-WebKit 또는 PhoneGap과 같은 다른 메커니즘을 사용하여 배포 할 수 있습니다.
ru: Это не означает,что вы не можете продолжать использовать JavaScript и HTML,но вы можете распространять его,используя какой-нибудь другой механизм,такой как Node-WebKit или PhoneGap.
zh_cn: 这并不意味着你不能继续使用JavaScript和HTML,但你可以使用其他一些机制来发布,比如Node-WebKit或PhoneGap。

source: That server-side code could be written &amp; hosted by a third party (such as CORS Anywhere). Note the privacy implications of this: The third party can monitor who proxies what across their servers.
es: Ese c&oacute;digo del lado del servidor podr&iacute;a ser escrito y alojado por un tercero (como CORS Anywhere). Tenga en cuenta las implicaciones de privacidad de esto: el tercero puede monitorear qui&eacute;n representa qu&eacute; a trav&eacute;s de sus servidores.
ja: そのサーバー側コードは、サードパーティ（CORS Anywhereなど）によって記述およびホストされる可能性があります。 これのプライバシーへの影響に注意してください。サードパーティは、サーバー全体で誰が何をプロキシするかを監視できます。
ko: 해당 서버 측 코드는 CORS Anywhere와 같은 타사에서 작성하고 호스팅 할 수 있습니다. 개인 정보 보호에 미치는 영향에 유의하십시오. 타사는 서버에서 무엇을 프록시하는지 모니터링 할 수 있습니다.
ru: Этот код на стороне сервера может быть написан и размещен третьей стороной (например, CORS Anywhere). Обратите внимание на последствия этого для конфиденциальности: третья сторона может отслеживать, кто что прокси на своих серверах.
zh_cn: 该服务器端代码可以由第三方（例如CORS Anywhere）编写和托管。 请注意以下方面的隐私含义：第三方可以监视谁代理其服务器上的内容。

source: The <code>Access-Control-Allow-Origin</code> HTTP <strong>response</strong> header referred to in the error message is part of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS</a> standard which allows Bob to explicitly grant permission to Mallory's site to access the data via Alice's browser.
es: El encabezado de <strong>respuesta</strong> HTTP <code>Access-Control-Allow-Origin</code> mencionado en el mensaje de error es parte del est&aacute;ndar <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS</a> que permite a Bob otorgar expl&iacute;citamente permiso al sitio de Mallory para acceder a los datos a trav&eacute;s del navegador de Alice.
ja: エラーメッセージで参照されている <code>Access-Control-Allow-Origin</code> HTTP <strong>応答</strong>ヘッダーは<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS</a>標準の一部であり、ボブがアリスのブラウザを介してデータにアクセスするための許可をマロリーのサイトに明示的に許可することができます。
ko: 오류 메시지에 언급 된 <code>Access-Control-Allow-Origin</code> HTTP <strong>응답</strong> 헤더는 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS</a> 표준의 일부로 Bob이 Mallory의 사이트에 Alice의 브라우저를 통해 데이터에 액세스 할 수있는 권한을 명시 적으로 부여 할 수 있습니다.
ru: HTTP-заголовок <strong>ответа</strong> <code>Access-Control-Allow-Origin</code> , упомянутый в сообщении об ошибке, является частью стандарта <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS,</a> который позволяет Бобу явно предоставлять разрешение сайту Мэллори на доступ к данным через браузер Алисы.
zh_cn: 错误消息中引用的 <code>Access-Control-Allow-Origin</code> HTTP <strong>响应</strong>标头是<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS">CORS</a>标准的一部分，该标准允许Bob明确授予Mallory站点访问权限，以通过Alice的浏览器访问数据。

source: The browser's Same Origin Policy prevents that JavaScript from reading the data returned by Bob's website (which Bob and Alice don't want Mallory to access). (Note that you can, for example, display an image using an <code>&lt;img&gt;</code> element across origins because the content of the image is not exposed to JavaScript (or Mallory) &hellip; unless you throw canvas into the mix in which case you <em>will</em> generate a same-origin violation error).
es: La Pol&iacute;tica del mismo origen del navegador evita que JavaScript lea los datos devueltos por el sitio web de Bob (a los que Bob y Alice no quieren que acceda Mallory). (Tenga en cuenta que puede, por ejemplo, mostrar una imagen usando un elemento <code>&lt;img&gt;</code> en todos los or&iacute;genes porque el contenido de la imagen no est&aacute; expuesto a JavaScript (o Mallory) ... a menos que arroje un lienzo a la mezcla, en cuyo caso generar&aacute; un error de violaci&oacute;n del mismo origen).
ja: ブラウザーの同一生成元ポリシーにより、JavaScriptはボブのWebサイトから返されたデータを読み取ることができません（ボブとアリスはマロリーにアクセスを望まない）。 （たとえば、画像のコンテンツはJavaScript（またはマロリー）に公開されていないため、 <code>&lt;img&gt;</code> 要素を使用して画像を表示できることに注意してください。この場合、キャンバスをミックスにスローしない限り、同一起源違反エラー）。
ko: 브라우저의 동일한 출처 정책은 JavaScript가 Bob의 웹 사이트 (Bob 및 Alice가 Mallory에 액세스하기를 원하지 않음)에서 반환 한 데이터를 읽지 못하게합니다. (예를 들어 이미지의 내용이 JavaScript (또는 Mallory)에 노출되지 않기 때문에 원점에서 <code>&lt;img&gt;</code> 요소를 사용하여 이미지를 표시 할 수 있습니다. 동일 출처 위반 오류).
ru: Политика одинакового происхождения в браузере запрещает JavaScript читать данные, возвращаемые веб-сайтом Боба (к которым Боб и Алиса не хотят, чтобы Мэллори имела доступ). (Обратите внимание, что вы можете, например, отображать изображение с использованием элемента <code>&lt;img&gt;</code> в разных источниках, потому что содержимое изображения не подвергается JavaScript (или Мэллори)&hellip; если вы не добавите canvas в смесь, в этом случае вы создадите ошибка нарушения того же происхождения).
zh_cn: 浏览器的同源策略禁止JavaScript读取Bob网站返回的数据（Bob和Alice不想让Mallory访问）。 （请注意，例如，您可以使用 <code>&lt;img&gt;</code> 元素在各个原点之间显示图像，因为图像的内容不会暴露在JavaScript（或Mallory）中&hellip;&hellip;除非您将画布放入混合中，否则<em>会</em>生成一个同源冲突错误）。

source: The data was not private <em>or</em>
es: Los datos no eran privados <em>o</em>
ja: データは非公開ではありませんでした
ko: 개인 정보가 아니 <em>거나</em>
ru: Данные не были частными <em>или</em>
zh_cn: 数据不是私人的<em>或</em>

source: The specifics of how Bob sets that response header depend on Bob's HTTP server and/or server-side programming language. There is <a href="https://enable-cors.org/server.html">a collection of guides for various common configurations</a> that might help.
es: Los detalles de c&oacute;mo Bob establece ese encabezado de respuesta dependen del servidor HTTP de Bob y / o del lenguaje de programaci&oacute;n del lado del servidor. Hay <a href="https://enable-cors.org/server.html">una colecci&oacute;n de gu&iacute;as para varias configuraciones comunes</a> que pueden ayudar.
ja: Bobがその応答ヘッダーを設定する方法の詳細は、BobのHTTPサーバーまたはサーバー側プログラミング言語、あるいはその両方によって異なります。 役立つ可能性のある<a href="https://enable-cors.org/server.html">さまざまな一般的な構成のガイドのコレクションが</a>あります。
ko: Bob이 응답 헤더를 설정하는 방법에 대한 구체적인 내용은 Bob의 HTTP 서버 및 / 또는 서버 측 프로그래밍 언어에 따라 다릅니다. 도움이 될 수있는 <a href="https://enable-cors.org/server.html">다양한 공통 구성에 대한 안내서 모음</a> 이 있습니다.
ru: Особенности того, как Боб устанавливает этот заголовок ответа, зависят от HTTP-сервера Боба и / или языка программирования на стороне сервера. Существует <a href="https://enable-cors.org/server.html">набор руководств для различных общих конфигураций,</a> которые могут помочь.
zh_cn: Bob如何设置响应头的具体细节取决于Bob的HTTP服务器和/或服务器端编程语言。 提供<a href="https://enable-cors.org/server.html">了</a>一些可能有用的各种常见配置的指南 。

source: The standard scenario that demonstrates the need for the SOP can be demonstrated with <a href="https://en.wikipedia.org/wiki/Alice_and_Bob">three characters</a>:
es: El escenario est&aacute;ndar que demuestra la necesidad del SOP se puede demostrar con <a href="https://en.wikipedia.org/wiki/Alice_and_Bob">tres caracteres</a> :
ja: SOPの必要性を示す標準的なシナリオは、 <a href="https://en.wikipedia.org/wiki/Alice_and_Bob">3つのキャラクター</a>で示すことができます。
ko: SOP의 필요성을 보여주는 표준 시나리오는 다음 <a href="https://en.wikipedia.org/wiki/Alice_and_Bob">세 문자</a> 로 설명 할 수 있습니다.
ru: Стандартный сценарий, который демонстрирует необходимость SOP, может быть продемонстрирован <a href="https://en.wikipedia.org/wiki/Alice_and_Bob">тремя символами</a> :
zh_cn: 证明需要SOP的标准方案可以用<a href="https://en.wikipedia.org/wiki/Alice_and_Bob">三个字符</a>来证明：

source: There are a number of circumstances where Mallory's site can cause a browser to fetch data from a third party and display it (e.g. by adding an <code>&lt;img&gt;</code> element to display an image). It isn't possible for Mallory's JavaScript to read the data in that resource though, only Alice's browser and Bob's server can do that, so it is still secure.
es: Hay una serie de circunstancias en las que el sitio de Mallory puede hacer que un navegador obtenga datos de un tercero y los muestre (por ejemplo, agregando un elemento <code>&lt;img&gt;</code> para mostrar una imagen). Sin embargo, no es posible que el JavaScript de Mallory lea los datos en ese recurso, solo el navegador de Alice y el servidor de Bob pueden hacerlo, por lo que a&uacute;n es seguro.
ja: マロリーのサイトがブラウザにサードパーティからデータをフェッチして表示させる状況は数多くあります（たとえば、 <code>&lt;img&gt;</code> 要素を追加して画像を表示することにより）。 ただし、MalloryのJavaScriptがそのリソースのデータを読み取ることはできません。これを行うことができるのは、AliceのブラウザーとBobのサーバーだけなので、依然として安全です。
ko: Mallory의 사이트에서 브라우저가 제 3 자로부터 데이터를 가져 와서 표시하도록하는 여러 가지 상황이 있습니다 (예 : <code>&lt;img&gt;</code> 요소를 추가하여 이미지 표시). Mallory의 JavaScript가 해당 리소스의 데이터를 읽을 수는 없지만 Alice의 브라우저와 Bob의 서버만이 그렇게 할 수 있으므로 여전히 안전합니다.
ru: Существует ряд обстоятельств, когда сайт Мэллори может заставить браузер получать данные от третьей стороны и отображать их (например, добавляя элемент <code>&lt;img&gt;</code> для отображения изображения). JavaScript Мэллори не может прочитать данные на этом ресурсе, хотя это может сделать только браузер Алисы и сервер Боба, поэтому он по-прежнему безопасен.
zh_cn: 在许多情况下，Mallory的网站可能会导致浏览器从第三方获取数据并显示（例如，通过添加 <code>&lt;img&gt;</code> 元素以显示图像）。 不过，Mallory的JavaScript不可能读取该资源中的数据，只有Alice的浏览器和Bob的服务器可以做到这一点，因此它仍然是安全的。

source: There is no standard mechanism for <em>Mallory</em> to add this header because it has to come from Bob's website, which she does not control.
es: No hay un mecanismo est&aacute;ndar para que <em>Mallory</em> agregue este encabezado porque tiene que venir del sitio web de Bob, que ella no controla.
ja: <em>マロリー</em>がこのヘッダーを追加するための標準的なメカニズムはありません。これは、ボブが管理していないボブのWebサイトからのものであるためです。
ko: <em>Mallory</em> 가이 헤더를 추가하는 표준 메커니즘은 Bob의 웹 사이트에서 가져와야하므로 제어하지 않습니다.
ru: У <em>Мэллори</em> нет стандартного механизма добавления этого заголовка, потому что он должен прийти с сайта Боба, который она не контролирует.
zh_cn: <em>Mallory</em>没有添加此标头的标准机制，因为它必须来自Bob不能控制的Bob的网站。

source: There is nothing you can do in <em>your</em> client-side code that will enable CORS access to someone <em>else's</em> server.
es: No hay nada que pueda hacer en <em>su</em> c&oacute;digo del lado del cliente que permita el acceso de CORS al servidor de otra <em>persona</em> .
ja: <em>他の</em>誰か<em>の</em>サーバーへのCORSアクセスを可能に<em>する</em>クライアント側のコードでできることは何もありません。
ko: CORS가 다른 <em>사람의</em> 서버에 액세스 할 수 있도록 클라이언트 측 코드에서 수행 할 수있는 작업은 없습니다.
ru: В коде на стороне клиента вы ничего не можете сделать, что позволит CORS получить доступ к <em>чужому</em> серверу.
zh_cn: 您无法在客户端代码中执行任何操作来使CORS访问其他<em>人的</em>服务器。

source: There isn't a third party (Mallory) who is considered a risk.
es: No hay un tercero (Mallory)que se considere un riesgo.
ja: リスクとされる第三者(マロリー)がいない。
ko: 위험으로 간주되는 제 3 자 (Mallory)는 없습니다.
ru: Не существует третьей стороны (Мэллори),которая считается рискованной.
zh_cn: 没有一个第三方(Mallory)被认为是有风险的。

source: These can be useful for development, but are not practical for a production site (asking every user of your site to install a browser extension that disables a security feature of their browser is unreasonable).
es: Éstas pueden ser útiles para el desarrollo,pero no son prácticas para un sitio de producción (pedir a cada usuario de su sitio que instale una extensión del navegador que deshabilite una función de seguridad de su navegador no es razonable).
ja: これらは開発には便利ですが、本番サイトでは実用的ではありません(サイトのすべてのユーザーにブラウザのセキュリティ機能を無効にするブラウザ拡張機能のインストールを求めるのは不合理です)。
ko: 이것들은 개발에 유용하지만 프로덕션 사이트에는 실용적이지 않습니다 (사이트의 모든 사용자에게 브라우저의 보안 기능을 비활성화하는 브라우저 확장 프로그램을 설치하도록 요구하는 것은 합리적이지 않습니다).
ru: Они могут быть полезны для разработки,но непрактичны для производственного сайта (просить каждого пользователя вашего сайта установить расширение браузера,которое отключает функцию безопасности своего браузера нецелесообразно).
zh_cn: 这些对开发来说可能很有用,但对生产型网站来说并不实用(要求你的网站的每个用户安装一个浏览器扩展,禁用浏览器的安全功能是不合理的)。

source: These links may help
es: Estos enlaces pueden ayudar
ja: これらのリンクが役に立つかもしれません。
ko: 이 링크는 도움이 될 수 있습니다
ru: Эти ссылки могут помочь
zh_cn: 这些链接可能有帮助

source: They also tend to work only with simple requests (failing when handling preflight OPTIONS requests).
es: También tienden a trabajar sólo con solicitudes simples (fallando al manejar las solicitudes de OPCIONES de pre-vuelo).
ja: また、単純なリクエストのみで動作する傾向があります(プリフライトのOPTIONSリクエストを扱う際に失敗します)。
ko: 또한 간단한 요청으로 만 작동하는 경향이 있습니다 (사전 비행 옵션 요청을 처리 할 때 실패).
ru: Кроме того,они,как правило,работают только с простыми запросами (сбой при работе с предрейсовыми запросами OPTIONS).
zh_cn: 它们也往往只对简单的请求起作用(在处理OPTIONS请求时失败)。
