Repository: rueisnom/feedback
Catalog: xlf/24/50/95/4/2450954.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: From a theoretical point of view, the most elegant way of doing it, in my humble opinion, is to get a <em>single</em> random number between <em>0</em> and <em>n!-1</em> and to compute a one to one mapping from <code>{0, 1, &hellip;, n!-1}</code> to all permutations of <code>(0, 1, 2, &hellip;, n-1)</code>. As long as you can use a (pseudo-)random generator reliable enough for getting such a number without any significant bias, you have enough information in it for achieving what you want without needing several other random numbers.
es: Desde un punto de vista te&oacute;rico, la forma m&aacute;s elegante de hacerlo, en mi humilde opini&oacute;n, es obtener un <em>&uacute;nico</em> n&uacute;mero aleatorio entre <em>0</em> y <em>n! -1</em> y calcular un mapeo uno a uno desde <code>{0, 1, &hellip;, n!-1}</code> a todas las permutaciones de <code>(0, 1, 2, &hellip;, n-1)</code> . Siempre que pueda usar un generador (pseudo-) aleatorio lo suficientemente confiable como para obtener dicho n&uacute;mero sin ning&uacute;n sesgo significativo, tendr&aacute; suficiente informaci&oacute;n para lograr lo que desea sin necesidad de varios otros n&uacute;meros aleatorios.
ja: 理論的な観点から見ると、私の考えでは、最もエレガントな方法は、 <em>0</em>と<em>n！-1の</em>間の<em>単一の</em>乱数を取得し、 <code>{0, 1, &hellip;, n!-1}</code> から1対1のマッピングを計算することです。 n！-1}を <code>(0, 1, 2, &hellip;, n-1)</code> すべての順列に。 （疑似）乱数発生器を使用して、大きなバイアスなしにそのような数値を取得するのに十分な信頼性がある限り、他のいくつかの乱数を必要とせずに目的を達成するための十分な情報があります。
ko: 이론적으로 볼 때, 가장 겸손한 견해로는 <em>0</em> 과 <em>n</em> 사이의 <em>단일</em> 난수를 가져 와서 <code>{0, 1, &hellip;, n!-1}</code> 에서 일대일 매핑을 계산하는 것이 가장 우아한 방법입니다 <em>.</em> n! -1} 을 <code>(0, 1, 2, &hellip;, n-1)</code> 모든 순열에 적용합니다. 큰 편견없이 그러한 숫자를 얻을 수있을만큼 신뢰할 수있는 (의사) 난수 생성기를 사용할 수 있다면, 다른 임의의 숫자 없이도 원하는 것을 달성 할 수있는 충분한 정보가 있습니다.
ru: С теоретической точки зрения самый элегантный способ сделать это, по моему скромному мнению, это получить <em>одно</em> случайное число от <em>0</em> до <em>n! -1</em> и вычислить отображение один в один из <code>{0, 1, &hellip;, n!-1}</code> для всех перестановок <code>(0, 1, 2, &hellip;, n-1)</code> . Пока вы можете использовать (псевдо) генератор случайных чисел, достаточно надежный для получения такого числа без какого-либо существенного смещения, у вас будет достаточно информации для достижения того, что вы хотите, без необходимости использования нескольких других случайных чисел.
zh_cn: 从理论的角度来看，我拙见认为，最优雅的方法是获取<em>0</em>到<em>n！-1</em>之间的<em>单个</em>随机数，并根据 <code>{0, 1, &hellip;, n!-1}</code> 计算一对一的映射， n！-1}到 <code>(0, 1, 2, &hellip;, n-1)</code> 所有排列。 只要您可以使用足够可靠的（伪）随机生成器来获得这样一个数字而没有任何明显的偏差，您就可以在其中获得足够的信息来实现所需的信息，而无需其他几个随机数。

source: Funny enough there was no non mutating recursive answer:
es: Es curioso que no haya habido una respuesta recursiva no mutante:
ja: おかしなことに、非変異再帰的な答えはありませんでした。
ko: 재밌지 않은 재귀 응답이 없었습니다.
ru: Забавно,что не было не мутирующего рекурсивного ответа:
zh_cn: 有意思的是,没有非突变递归的答案。

source: Here's a JavaScript implementation of the <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffle</a>, an optimized version of Fisher-Yates:
es: Aqu&iacute; hay una implementaci&oacute;n de JavaScript del <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffle</a> , una versi&oacute;n optimizada de Fisher-Yates:
ja: 以下は、Fisher-Yatesの最適化バージョンである<a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffleの</a> JavaScript実装です。
ko: Fisher-Yates의 최적화 된 버전 인 <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffle</a> 의 JavaScript 구현은 다음과 같습니다.
ru: Вот реализация JavaScript <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffle</a> , оптимизированной версии Fisher-Yates:
zh_cn: 这是<a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#The_modern_algorithm">Durstenfeld shuffle</a>的JavaScript实现，它是Fisher-Yates的优化版本：

source: How can I randomize / shuffle it?
es: ¿Cómo puedo aleatorizarlo?
ja: ランダムにシャッフルするにはどうしたらいいですか?
ko: 어떻게 무작위 / 셔플 할 수 있습니까?
ru: Как я могу перетасовать его в случайном порядке?
zh_cn: 怎样才能随机洗牌?

source: How to randomize (shuffle) a JavaScript array
es: Cómo aleatorizar (barajar)un arreglo de JavaScript
ja: JavaScriptの配列をランダム化(シャッフル)する方法
ko: JavaScript 배열을 무작위 화 (셔플)하는 방법
ru: Как рандомизировать (тасовать)массив JavaScript
zh_cn: 如何随机化(洗牌)一个JavaScript数组

source: I found this variant hanging out in the "deleted by author" answers on a duplicate of this question. Unlike some of the other answers that have many upvotes already, this is:
es: Encontré esta variante colgando en las respuestas "borradas por el autor" en un duplicado de esta pregunta.A diferencia de algunas de las otras respuestas que ya tienen muchos votos a favor,esta es:
ja: 私はこの質問の重複で「著者によって削除された」回答の中にこの変種がぶら下がっているのを見つけました。すでに多くのアップボイスを持っている他の回答のいくつかとは異なり、これは
ko: 이 질문의 복제본에 대한 "저자에 의해 삭제됨"답변에서이 변형이 발견되었습니다. 이미 많은 의견을 가진 다른 답변들과 달리, 이것은 다음과 같습니다 :
ru: Я нашел этот вариант в ответах "удалено автором" на дубликат этого вопроса.В отличие от некоторых других ответов,которые уже имеют много upvotes,это так:
zh_cn: 我发现这个变体挂在 "作者删除 "这个问题的重复回答中。不同于其他一些已经有很多人点赞的答案,这个是。

source: I have an array like this:
es: Tengo un arreglo como este:
ja: こんな感じの配列を持っています。
ko: 다음과 같은 배열이 있습니다.
ru: У меня есть такой массив:
zh_cn: 我有一个这样的数组。

source: If you <em>don't wish</em> your shuffle function to mutate the <strong>source array</strong>, you can copy it to a local variable, then do the rest with a simple <em>shuffling logic</em>.
es: Si <em>no desea que</em> su funci&oacute;n aleatoria mute la <strong>matriz fuente</strong> , puede copiarla en una variable local y luego hacer el resto con una simple <em>l&oacute;gica aleatoria</em> .
ja: シャッフル関数で<strong>ソース配列</strong>を変更<em>したくない</em>場合は、それをローカル変数にコピーしてから、残りを単純な<em>シャッフルロジック</em>で実行できます。
ko: 셔플 기능으로 <strong>소스 배열</strong> 을 변경 <em>하지 않으</em> 려면 로컬 <strong>배열</strong> 에 복사 한 다음 간단한 <em>셔플 링 논리를 사용</em> 하여 나머지를 수행 할 수 있습니다.
ru: Если вы <em>не хотите, чтобы</em> функция shuffle изменяла <strong>исходный массив</strong> , вы можете скопировать его в локальную переменную, а затем сделать все остальное с помощью простой <em>логики перемешивания</em> .
zh_cn: 如果您<em>不希望</em> shuffle函数更改<strong>源数组</strong> ，则可以将其复制到局部变量，然后使用简单的<em>shuffling逻辑</em>进行其余操作。

source: If you have any questions just ask.
es: Si tienes alguna pregunta,sólo hazla.
ja: 何か質問があれば聞いてみてください。
ko: 궁금한 점이 있으면 물어보십시오.
ru: Если у вас есть вопросы,просто задайте их.
zh_cn: 如果您有任何问题,请直接询问。

source: It picks a random element for each original array element, and excludes it from the next draw, like picking randomly from a deck of cards.
es: Elige un elemento al azar para cada elemento de la matriz original,y lo excluye del próximo sorteo,como si lo eligiera al azar de una baraja de cartas.
ja: 元の配列要素ごとにランダムな要素をピックし、カードの山札からランダムにピックするように、次のドローから除外します。
ko: 각 원본 배열 요소에 대해 임의의 요소를 선택하고 카드 덱에서 무작위로 선택하는 것처럼 다음 추첨에서 제외합니다.
ru: Он выбирает случайный элемент для каждого исходного элемента массива и исключает его из следующей ничьи,как и случайный выбор из колоды карт.
zh_cn: 它为每一个原始数组元素选取一个随机元素,并将其排除在下一次抽签中,就像从一副扑克牌中随机抽取。

source: It should work for up to 16 elements with a little theoretical bias (though unnoticeable from a practical point of view); it can be seen as fully usable for 15 elements; with arrays containing less than 14 elements, you can safely consider there will be absolutely no bias.
es: Debería funcionar para hasta 16 elementos con un poco de sesgo teórico (aunque imperceptible desde el punto de vista práctico);se puede considerar totalmente utilizable para 15 elementos;con matrices que contengan menos de 14 elementos,se puede considerar con seguridad que no habrá absolutamente ningún sesgo.
ja: 理論的には多少の偏りはありますが(実用的な観点からは気付かれませんが)、16要素までは動作するはずです;15要素では完全に使用可能と見ることができます;14要素以下の配列では、偏りは全くないと考えることができます。
ko: 이론적 인 편견이 거의없는 최대 16 개의 요소에 대해 작동해야합니다 (실제적인 관점에서는 눈에 띄지 않지만). 15 개의 요소에 대해 완전히 사용 가능한 것으로 볼 수 있습니다. 14 개 미만의 요소를 포함하는 배열을 사용하면 치우침이 없을 것입니다.
ru: Он должен работать до 16 элементов с небольшим теоретическим смещением (хотя и незаметным с практической точки зрения);его можно рассматривать как полностью используемый для 15 элементов;в массивах,содержащих менее 14 элементов,можно смело считать,что никакого смещения не будет.
zh_cn: 它应该对16个元素有一点理论上的偏差(虽然从实践的角度看是不明显的);对于15个元素,可以认为完全可以使用;对于包含不到14个元素的数组,可以放心地认为绝对不会有偏差。

source: It's probably not very efficient, but for small arrays this works just fine. Here's an example so you can see how random (or not) it is, and whether it fits your usecase or not.
es: Probablemente no sea muy eficiente,pero para conjuntos pequeños esto funciona muy bien.Aquí hay un ejemplo para que puedas ver lo aleatorio (o no)que es,y si se ajusta a tu caso de uso o no.
ja: おそらくあまり効率的ではないでしょうが、小さな配列の場合はこれで十分です。ここに例を示しますので、どの程度のランダム性があるのか(あるいはないのか)、あなたの用途に合っているのかどうかを確認することができます。
ko: 아마 효율적이지 않을 수도 있지만 작은 배열의 경우에는 잘 작동합니다. 다음은 그 예가 임의적이든 아니든, 사용 사례에 맞는지 여부를 확인할 수 있습니다.
ru: Вероятно,это не очень эффективно,но для маленьких массивов это работает просто отлично.Вот пример,чтобы вы могли увидеть,насколько это случайно (или нет),и подходит ли это к вашему случаю или нет.
zh_cn: 这可能不是很有效,但对于小数组来说,这个方法很好用。这里有一个例子,你可以看到它的随机性(或不随机),以及它是否适合你的使用情况。

source: Just to have a finger in the pie. Here i present a recursive implementation of Fisher Yates shuffle (i think). It gives uniform randomness.
es: Sólo para tener un dedo en el pastel.Aquí presento una implementación recursiva del barajado de Fisher Yates (creo).Da una aleatoriedad uniforme.
ja: パイの中に指を入れるだけです。ここでは、フィッシャー・イェーツ・シャッフルの再帰的な実装を紹介する(と思う)。これは一様なランダム性を与える。
ko: 파이에 손가락을 넣는 것만으로 여기에 Fisher Yates shuffle의 재귀 구현을 제시합니다 (생각합니다). 균일 한 무작위성을 제공합니다.
ru: Просто чтобы палец был в пироге.Здесь я представляю рекурсивное воплощение тасовки Фишера Йейтса (я думаю).Это дает равномерную случайность.
zh_cn: 只是想在这块蛋糕上沾点光。我在这里介绍一个递归实现的Fisher Yates洗牌(我想)。它给出了统一的随机性。

source: Not already present here with multiple variants
es: No está ya presente aquí con múltiples variantes
ja: 複数のバリエーションでここには存在しない
ko: 여기에 여러 변형이 존재하지 않습니다
ru: Здесь уже нет нескольких вариантов
zh_cn: 这里还没有出现多个变体

source: Not in-place (hence the <code>shuffled</code> name rather than <code>shuffle</code>)
es: No en el lugar (de ah&iacute; el nombre <code>shuffle</code> lugar de aleatorio )
ja: インプレースではない（したがって、 <code>shuffled</code> ではなくシャッフルされた名前）
ko: 제자리에 있지 않음 (따라서 <code>shuffled</code> 대신 셔플 이름)
ru: Не на месте (следовательно, <code>shuffled</code> имя, а не <code>shuffle</code> )
zh_cn: 不在原位（因此， <code>shuffled</code> 名称而不是改组名称）

source: Note: The <code>~~</code> (double tilde operator) is in fact behaves like <code>Math.floor()</code> for positive real numbers. Just a short cut it is.
es: Nota: El <code>~~</code> (operador de doble tilde) de hecho se comporta como <code>Math.floor()</code> para n&uacute;meros reales positivos. Solo un atajo es.
ja: 注： <code>~~</code> （二重チルド演算子）は、実際には正の実数に対して <code>Math.floor()</code> のように動作します。 ちょうどそれがショートカットです。
ko: 참고 : <code>~~</code> (이중 물결표 연산자)는 실제로 양의 실수 인 경우 <code>Math.floor()</code> 와 같이 동작합니다. 바로 가기입니다.
ru: Примечание: <code>~~</code> (оператор двойной тильды) на самом деле ведет себя как <code>Math.floor()</code> для положительных действительных чисел. Это просто короткий путь.
zh_cn: 注意：对于正实数， <code>~~</code> （双波浪号运算符）实际上的行为类似于 <code>Math.floor()</code> 。 只是一个捷径。

source: Now, what you want merely is:
es: Ahora,lo que quieres simplemente es:
ja: さて、あなたが望むものは、単にそれだけです。
ko: 이제 원하는 것은 다음과 같습니다.
ru: Теперь ты просто хочешь:
zh_cn: 现在,你想要的仅仅是:

source: One could (or should) use it as a protoype from Array:
es: Se podría (o debería)usar como un prototipo de Array:
ja: これをArrayのプロトタイプとして使用することができる(あるいは使用すべき)。
ko: Array의 protoype로 사용할 수 있거나 사용해야합니다.
ru: Его можно (или следует)использовать в качестве прототипа из массива:
zh_cn: 人们可以(或应该)用它作为Array的原生类型。

source: Other Solutions
es: Otras soluciones
ja: その他のソリューション
ko: 다른 솔루션
ru: Другие решения
zh_cn: 其他解决方案

source: Other solutions just for fun.
es: Otras soluciones sólo por diversión.
ja: その他の解決策は遊びのためだけに。
ko: 재미를위한 다른 솔루션.
ru: Другие решения просто для удовольствия.
zh_cn: 其他的解决方案,只是为了好玩。

source: Please reference at <a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript Sorting Arrays</a>
es: Por favor, consulte en <a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript ordenando matrices</a>
ja: <a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript Sorting Arraysで</a>参照してください
ko: <a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript 정렬 배열을</a> 참조하십시오
ru: Пожалуйста, ссылки на <a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript Сортировка массивов</a>
zh_cn: 请参考<a href="https://www.w3schools.com/js/js_array_sort.asp">JavaScript排序数组</a>

source: Reliability and Performance Test
es: Prueba de fiabilidad y rendimiento
ja: 信頼性・性能試験
ko: 신뢰성 및 성능 테스트
ru: Тест на надежность и производительность
zh_cn: 可靠性和性能测试

source: Reliable, Effecient, Short
es: Confiable,eficiente,corto
ja: 信頼性の高い、便利な、短い
ko: 안정적이고 효율적이며 짧음
ru: Надежный,эффективный,короткий
zh_cn: 可靠、方便、快捷

source: Secondly, if you have a quick look at the link above you'll find that the <code>random order</code> sort seems to perform relatively well compared to the other methods, while being extremely easy and fast to implement as shown below:
es: En segundo lugar, si echas un vistazo r&aacute;pido al enlace de arriba, ver&aacute;s que el <code>random order</code> parece funcionar relativamente bien en comparaci&oacute;n con los otros m&eacute;todos, mientras que es extremadamente f&aacute;cil y r&aacute;pido de implementar como se muestra a continuaci&oacute;n:
ja: 次に、上のリンクをざっと見てみると、 <code>random order</code> 並べ替えは他のメソッドと比べて比較的うまく機能しているように見えますが、以下に示すように実装は非常に簡単で高速です。
ko: 둘째, 위의 링크를 빠르게 살펴보면 <code>random order</code> 정렬이 다른 방법에 비해 상대적으로 잘 수행되는 것처럼 보이지만 아래 그림과 같이 구현하기가 매우 쉽고 빠릅니다.
ru: Во-вторых, если вы быстро посмотрите на приведенную выше ссылку, вы обнаружите, что сортировка по <code>random order</code> видимому, работает относительно хорошо по сравнению с другими методами, и при этом чрезвычайно проста и быстра для реализации, как показано ниже:
zh_cn: 其次，如果您快速浏览了上面的链接，您会发现 <code>random order</code> 排序似乎比其他方法表现更好，并且实现起来非常容易和快捷，如下所示：

source: See <a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffle</a>
es: Ver <a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffle</a>
ja: <a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffleを</a>参照してください
ko: <a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffle 참조</a>
ru: Смотрите <a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffle</a>
zh_cn: 参见<a href="https://github.com/coolaj86/knuth-shuffle">https://github.com/coolaj86/knuth-shuffle</a>

source: See <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a>. It is being left here for reference because the idea isn't rare.
es: Ver <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a> . Se deja aqu&iacute; como referencia porque la idea no es rara.
ja: <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234を</a>参照してください 。 このアイデアは珍しいものではないので、参照用にここに残しています。
ko: <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234를</a> 참조 하십시오 . 아이디어가 드물지 않기 때문에 참조를 위해 여기에 남아 있습니다.
ru: См. <a href="https://stackoverflow.com/a/18650169/28234">Https://stackoverflow.com/a/18650169/28234</a> . Это оставлено здесь для справки, потому что идея не редка.
zh_cn: 参见<a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a> 。 它被留在这里作为参考，因为这个想法并不罕见。

source: See comments and <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a>. It is being left here for reference because the idea isn't rare.
es: Ver comentarios y <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a> . Se deja aqu&iacute; como referencia porque la idea no es rara.
ja: コメントと<a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234を</a>参照してください 。 このアイデアは珍しいものではないので、参照用にここに残しています。
ko: 의견 및 <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234를 참조하십시오</a> . 아이디어가 드물지 않기 때문에 참조를 위해 여기에 남아 있습니다.
ru: Смотрите комментарии и <a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a> . Это оставлено здесь для справки, потому что идея не редка.
zh_cn: 请参阅评论和<a href="https://stackoverflow.com/a/18650169/28234">https://stackoverflow.com/a/18650169/28234</a> 。 它被留在这里作为参考，因为这个想法并不罕见。

source: Since the elements are sorted against consistent keys that are not regenerated each iteration, and each comparison pulls from the same distribution, any non-randomness in the distribution of Math.random is canceled out.
es: Dado que los elementos se clasifican con claves consistentes que no se regeneran en cada iteración,y que cada comparación procede de la misma distribución,cualquier falta de aleatoriedad en la distribución de Math.random queda anulada.
ja: 要素は、各反復ごとに再生成されない一貫したキーに対してソートされ、各比較は同じ分布から引き出されるので、Math.random の分布における非ランダム性はすべて打ち消されます。
ko: 요소는 각 반복을 재생성하지 않는 일관된 키에 대해 정렬되고 각 비교는 동일한 분포에서 가져 오기 때문에 Math.random 분포의 비 랜덤 성은 취소됩니다.
ru: Поскольку элементы отсортированы по последовательным ключам,которые не регенерируются в каждой итерации,и каждое сравнение извлекается из одного и того же распределения,любая неслучайность в распределении Math.random отменяется.
zh_cn: 因为每次迭代时,元素都是对照着不再生的一致键进行排序,而且每次比较都是从相同的分布中抽取,所以Math.random分布中的任何非随机性都会被取消。

source: Some more info <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">about the algorithm</a> used.
es: M&aacute;s informaci&oacute;n <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">sobre el algoritmo</a> utilizado.
ja: 使用され<a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">ているアルゴリズムについての</a>詳細。
ko: 사용 <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">된 알고리즘에 대한</a> 추가 정보
ru: Еще немного информации <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">об используемом алгоритме</a> .
zh_cn: <a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle">有关使用的算法的</a>更多信息。

source: Some solutions on this page aren't reliable (they only partially randomise the array). Other solutions are significantly less effecient. With <code>testShuffleArrayFun</code> (see below) we can test array shuffling functions for reliability and performance. The following solutions are: reliable, effecient and short (using ES6 syntax)
es: Algunas soluciones en esta p&aacute;gina no son confiables (solo aleatorizan parcialmente la matriz). Otras soluciones son significativamente menos eficientes. Con <code>testShuffleArrayFun</code> (ver m&aacute;s abajo) podemos probar las funciones de combinaci&oacute;n aleatoria de la matriz para garantizar la fiabilidad y el rendimiento. Las siguientes soluciones son: confiables, eficientes y cortas (usando la sintaxis ES6)
ja: このページの一部のソリューションは信頼できません（アレイを部分的にランダム化するだけです）。 その他のソリューションは、効率が大幅に低下します。 <code>testShuffleArrayFun</code> （下記参照）を使用して、配列シャッフル関数の信頼性とパフォーマンスをテストできます。 次のソリューションは、信頼性が高く、効率的で、短いものです（ES6構文を使用）。
ko: 이 페이지의 일부 솔루션은 신뢰할 수 없습니다 (어레이의 일부만 무작위 화). 다른 솔루션은 효율성이 크게 떨어집니다. <code>testShuffleArrayFun</code> (아래 참조)을 통해 어레이 셔플 기능을 테스트하여 안정성과 성능을 확인할 수 있습니다. 신뢰할 수 있고 효율적이며 짧은 솔루션 (ES6 구문 사용)
ru: Некоторые решения на этой странице не являются надежными (они только частично рандомизируют массив). Другие решения значительно менее эффективны. С помощью <code>testShuffleArrayFun</code> (см. Ниже) мы можем проверить функции перемешивания массива на надежность и производительность. Следующие решения: надежные, эффективные и короткие (с использованием синтаксиса ES6)
zh_cn: 此页面上的某些解决方案不可靠（它们只能部分随机化阵列）。 其他解决方案的效率大大降低。 使用 <code>testShuffleArrayFun</code> （请参见下文），我们可以测试数组改组函数的可靠性和性能。 以下解决方案是：可靠，高效和简短（使用ES6语法）

source: The below code is using the well known <code>Fisher-Yates</code> algorithm while utilizing <code>Web Cryptography API</code> for <strong>cryptographic level of randomization</strong>.
es: El siguiente c&oacute;digo utiliza el conocido algoritmo <code>Fisher-Yates</code> mientras utiliza la <code>Web Cryptography API</code> de <strong>criptograf&iacute;a</strong> web para el <strong>nivel criptogr&aacute;fico de aleatorizaci&oacute;n</strong> .
ja: 以下のコードは、 <strong>暗号化レベルのランダム化に</strong> <code>Web Cryptography API</code> を利用しながら、よく知られている <code>Fisher-Yates</code> アルゴリズムを使用しています 。
ko: 아래 코드는 잘 알려진 <code>Fisher-Yates</code> 알고리즘을 사용하면서 <strong>암호화 수준의 무작위 화를</strong> 위해 <code>Web Cryptography API</code> 를 <strong>사용합니다</strong> .
ru: Приведенный ниже код использует хорошо известный алгоритм <code>Fisher-Yates</code> , в то же время используя <code>Web Cryptography API</code> <strong>криптографии</strong> для <strong>криптографического уровня рандомизации</strong> .
zh_cn: 以下代码使用了众所周知的 <code>Fisher-Yates</code> 算法，同时利用 <code>Web Cryptography API</code> 进行了<strong>加密级别的随机化</strong> 。

source: The de-facto unbiased shuffle algorithm is the Fisher-Yates (aka Knuth) Shuffle.
es: El algoritmo de barajar sin prejuicios es el barajado Fisher-Yates (alias Knuth).
ja: 非事実上の不偏不党のシャッフルアルゴリズムは、Fisher-Yates (別名 Knuth)Shuffleです。
ko: 사실상의 비 편향 셔플 알고리즘은 Fisher-Yates (일명 Knuth) 셔플입니다.
ru: Де-факто беспристрастным алгоритмом шарканья является шарканье Фишера-Йатса (он же Кнут).
zh_cn: 事实上,无偏见的洗牌算法是Fisher-Yates(又名Knuth)洗牌算法。

source: The following function will not be used, but I give it anyway; it returns the index of a given permutation of <code>(0, 1, 2, &hellip;, n-1)</code> according to the one to one mapping used in this message (the most natural one when enumerating permuations); it is intended to work with up to 16 elements:
es: La siguiente funci&oacute;n no se utilizar&aacute;, pero la doy de todos modos; devuelve el &iacute;ndice de una permutaci&oacute;n dada de <code>(0, 1, 2, &hellip;, n-1)</code> acuerdo con el mapeo uno a uno utilizado en este mensaje (el m&aacute;s natural al enumerar permutaciones); Est&aacute; dise&ntilde;ado para trabajar con hasta 16 elementos:
ja: 次の関数は使用しませんが、とにかく与えます。 このメッセージで使用されている1対1のマッピング（順列を列挙するときに最も自然なもの <code>(0, 1, 2, &hellip;, n-1)</code> に従って、（0、1、2、&hellip;、n-1）の所定の順列のインデックスを返します。 最大16個の要素を処理することを目的としています。
ko: 다음 함수는 사용되지 않지만 어쨌든 제공합니다. 이 메시지에 사용 된 일대일 매핑에 따라 <code>(0, 1, 2, &hellip;, n-1)</code> 의 주어진 순열 인덱스를 반환합니다 (퍼머 레이션을 열거 할 때 가장 자연스러운 것). 최대 16 개의 요소로 작동하도록 설계되었습니다.
ru: Следующая функция не будет использоваться, но я все равно дам ее; он возвращает индекс заданной перестановки <code>(0, 1, 2, &hellip;, n-1)</code> соответствии с отображением &laquo;один к одному&raquo;, используемым в этом сообщении (наиболее естественным при перечислении перестановок); он предназначен для работы с 16 элементами:
zh_cn: 以下功能将不会使用，但是我还是给了它； 它根据此消息中使用的一对一映射（枚举置换时最自然的映射 <code>(0, 1, 2, &hellip;, n-1)</code> 返回给定置换（0，1，2，&hellip;，n-1）的索引； 它旨在与多达16个元素一起使用：
