Repository: rueisnom/feedback
Catalog: xlf/24/50/95/4/2450954.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The new ES6 allows us to assign two variables at once. This is especially handy when we want to swap the values of two variables, as we can do it in one line of code. Here is a shorter form of the same function, using this feature.
es: El nuevo ES6 nos permite asignar dos variables a la vez.Esto es especialmente útil cuando queremos intercambiar los valores de dos variables,ya que podemos hacerlo en una línea de código.Aquí hay una forma más corta de la misma función,usando esta característica.
ja: 新しいES6では、2つの変数を一度に代入できるようになりました。これは特に、2つの変数の値を入れ替えたいときに便利です。以下に、この機能を使った同じ関数の短い形式を示します。
ko: 새로운 ES6을 사용하면 두 개의 변수를 한 번에 할당 할 수 있습니다. 이것은 한 줄의 코드로 할 수 있기 때문에 두 변수의 값을 바꾸고 싶을 때 특히 유용합니다. 이 기능을 사용하는 동일한 기능의 짧은 형식은 다음과 같습니다.
ru: Новая ES6 позволяет присваивать две переменные одновременно.Это особенно удобно,когда мы хотим поменять значения двух переменных,так как мы можем сделать это в одной строке кода.Вот более короткая форма одной и той же функции,использующей эту возможность.
zh_cn: 新的ES6允许我们同时分配两个变量。当我们想交换两个变量的值时,这一点特别方便,因为我们可以在一行代码中完成。下面是一个较短的形式,使用了这个功能的相同函数。

source: The problem is, JS can not coop on with big recursions. In this particular case you array size is limited with like 3000~7000 depending on your browser engine and some unknown facts.
es: El problema es que JS no puede cooperar con grandes recurrencias.En este caso en particular el tamaño de la matriz está limitado con unos 3000~7000 dependiendo del motor de tu navegador y algunos datos desconocidos.
ja: 問題は、JS は大きな再帰との連携ができないことです。この場合、ブラウザのエンジンや未知の事実にもよりますが、配列のサイズは3000~7000程度に制限されています。
ko: 문제는 JS가 큰 재귀를 처리 할 수 ​​없다는 것입니다. 이 특정 경우 배열 크기는 브라우저 엔진 및 일부 알 수없는 사실에 따라 3000 ~ 7000과 같이 제한됩니다.
ru: Проблема в том,что JS не может сотрудничать с большими рецидивами.В данном конкретном случае размер массива ограничен 3000~7000 в зависимости от движка вашего браузера и некоторых неизвестных фактов.
zh_cn: 问题是,JS不能与大的递归合作。在这种特殊情况下,你的数组的大小是有限的,比如3000~7000,这取决于你的浏览器引擎和一些未知的事实。

source: The reciprocal of the previous function (required for your own question) is below; it is intended to work with up to 16 elements; it returns the permutation of order <em>n</em> of <code>(0, 1, 2, &hellip;, s-1)</code>:
es: El rec&iacute;proco de la funci&oacute;n anterior (requerido para su propia pregunta) est&aacute; abajo; est&aacute; dise&ntilde;ado para trabajar con hasta 16 elementos; devuelve la permutaci&oacute;n de orden <em>n</em> de <code>(0, 1, 2, &hellip;, s-1)</code> :
ja: 前の関数の逆数（独自の質問に必要）は以下のとおりです。 最大16個の要素を処理することを目的としています。 <code>(0, 1, 2, &hellip;, s-1)</code> の次数<em>n</em>の順列を返します。
ko: 이전 함수의 역수 (자신의 질문에 필요함)는 다음과 같습니다. 최대 16 개의 요소로 작업하도록되어 있습니다. <code>(0, 1, 2, &hellip;, s-1)</code> 의 차수 <em>n</em> 의 순열을 반환합니다.
ru: Обратная функция предыдущей функции (требуется для вашего собственного вопроса) приведена ниже; он предназначен для работы до 16 элементов; он возвращает перестановку порядка <em>n</em> из <code>(0, 1, 2, &hellip;, s-1)</code> :
zh_cn: 前一个功能的倒数（您自己的问题要求）如下： 它旨在使用最多16个元素； 它返回 <code>(0, 1, 2, &hellip;, s-1)</code> <em>n</em>阶排列：

source: The use of this algorithm is <strong>not recommended</strong>, because it is <strong>inefficient</strong> and <strong>strongly biased</strong>; see comments. It is being left here for future reference, because the idea is not that rare.
es: No se recomienda el uso de este algoritmo, ya que es <strong>ineficiente</strong> y <strong>muy sesgado</strong> ; ver comentarios. Se deja aqu&iacute; para referencia futura, porque la idea no es tan rara.
ja: このアルゴリズムの使用は<strong>非効率</strong>で<strong>強くバイアスされる</strong>ため、 <strong>お勧めできません</strong> 。 コメントを参照してください。 このアイデアはそれほど珍しいものではないので、今後の参考のためにここに残しています。
ko: 이 알고리즘은 <strong>비효율적</strong> 이고 <strong>강력하게 편향되어</strong> 있으므로 사용 <strong>하지 않는 것이 좋습니다</strong> . 의견을 참조하십시오. 아이디어가 그렇게 드물지 않기 때문에 나중에 참조하기 위해 여기에 남겨두고 있습니다.
ru: Использование этого алгоритма <strong>не рекомендуется</strong> , потому что он <strong>неэффективен</strong> и <strong>сильно смещен</strong> ; смотрите комментарии. Он оставлен здесь для дальнейшего использования, потому что идея не такая уж редкая.
zh_cn: <strong>不建议</strong>使用此算法，因为它<strong>效率低下</strong>并且存在<strong>严重偏差</strong> ； 看评论。 它被留在这里以备将来参考，因为这种想法并不罕见。

source: This clever exclusion swaps the picked element with the current one, then picks the next random element from the remainder, looping backwards for optimal efficiency, ensuring the random pick is simplified (it can always start at 0), and thereby skipping the final element.
es: Esta inteligente exclusión intercambia el elemento elegido con el actual,y luego elige el siguiente elemento aleatorio del resto,haciendo un bucle hacia atrás para una eficiencia óptima,asegurando que la elección aleatoria se simplifique (siempre puede comenzar en 0),y por lo tanto saltándose el elemento final.
ja: この巧妙な除外は、ピックされた要素を現在のものと入れ替え、残りの要素から次のランダムな要素をピックし、最適な効率を得るために逆方向にループします。
ko: 이 영리한 제외는 선택한 요소를 현재 요소와 교체 한 다음 나머지 요소에서 다음 임의 요소를 선택하여 최적의 효율성을 위해 뒤로 반복하여 임의 선택을 단순화하고 (항상 0에서 시작할 수 있음) 최종 요소를 건너 뜁니다.
ru: Это умное исключение заменяет пикируемый элемент на текущий,затем пикирует следующий случайный элемент из оставшегося,петляя назад для оптимальной эффективности,обеспечивая упрощение пикировки случайных элементов (она всегда может начинаться с 0),и таким образом пропуская конечный элемент.
zh_cn: 这种巧妙的排除法将选中的元素与当前的元素交换,然后从剩余的元素中挑选下一个随机元素,向后循环,以达到最佳的效率,确保随机抽取的元素被简化(它可以一直从0开始),从而跳过最后一个元素。

source: Though there are a number of implementations already advised but I feel we can make it shorter and easier using forEach loop, so we don't need to worry about calculating array length and also we can safely avoid using a temporary variable.
es: Aunque ya se han aconsejado varias implementaciones pero creo que podemos hacerlo más corto y fácil usando para cada bucle,así que no tenemos que preocuparnos de calcular la longitud de la matriz y también podemos evitar con seguridad el uso de una variable temporal.
ja: すでにいくつかの実装がアドバイスされていますが、forEachループを使うことで、配列の長さを計算する必要がなくなり、一時変数を使わずに済むようになりました。
ko: 이미 많은 구현이 권장되었지만 forEach 루프를 사용하면 더 짧고 쉽게 만들 수 있다고 생각하므로 배열 길이 계산에 대해 걱정할 필요가 없으며 임시 변수 사용을 안전하게 피할 수 있습니다.
ru: Хотя есть несколько реализаций,которые уже были рекомендованы,но я считаю,что мы можем сделать цикл forEach более коротким и легким,так что нам не нужно беспокоиться о вычислении длины массива,а также мы можем безопасно избежать использования временной переменной.
zh_cn: 虽然已经有很多实现的建议,但我觉得我们可以用forEach循环让它变得更短更简单,这样我们就不需要担心计算数组长度,也可以安全地避免使用临时变量。

source: Time complexity is O(N log N), same as quick sort. Space complexity is O(N). This is not as efficient as a Fischer Yates shuffle but, in my opinion, the code is significantly shorter and more functional. If you have a large array you should certainly use Fischer Yates. If you have a small array with a few hundred items, you might do this.
es: La complejidad del tiempo es O(N log N),igual que la clasificación rápida.La complejidad espacial es O(N).Esto no es tan eficiente como una barajadura de Fischer Yates pero,en mi opinión,el código es significativamente más corto y más funcional.Si tienes un gran conjunto,ciertamente deberías usar Fischer Yates.Si tienes una pequeña matriz con unos pocos cientos de elementos,podrías hacer esto.
ja: 時間的な複雑さはクイックソートと同じO(N log N)です。空間の複雑さはO(N)です。これはFischer Yatesシャッフルほど効率的ではありませんが、私の考えでは、コードはかなり短く、より機能的です。大きな配列を持つ場合は、Fischer Yatesを使うべきです。数百項目の小さな配列であれば、これを使うとよいでしょう。
ko: 시간 복잡도는 빠른 정렬과 마찬가지로 O (N log N)입니다. 공간 복잡도는 O (N)입니다. 이것은 Fischer Yates shuffle만큼 효율적이지 않지만 제 의견으로는 코드가 훨씬 짧고 기능적입니다. 배열이 큰 경우에는 Fischer Yates를 사용해야합니다. 수백 개의 항목이있는 작은 배열이있는 경우이 작업을 수행 할 수 있습니다.
ru: Сложность во времени-O(N лог N),как и быстрая сортировка.Пространственная сложность-O(N).Это не так эффективно,как тасование Фишера Йейтса,но,на мой взгляд,код значительно короче и функциональнее.Если у вас большой массив,то обязательно используйте Фишера Йейтса.Если у вас маленький массив с несколькими сотнями элементов,то вы можете это сделать.
zh_cn: 时间复杂度为O(N log N),与快速排序相同。空间复杂度为O(N)。这样的效率不如Fischer Yates洗牌,但在我看来,代码明显更短,功能更多。如果你有一个大数组,你当然应该使用Fischer Yates。如果你有一个几百个项目的小数组,你可以这样做。

source: Use the underscore.js library. The method <code>_.shuffle()</code> is nice for this case. Here is an example with the method:
es: Use la biblioteca underscore.js. El m&eacute;todo <code>_.shuffle()</code> es bueno para este caso. Aqu&iacute; hay un ejemplo con el m&eacute;todo:
ja: underscore.jsライブラリーを使用します。 この場合、メソッド <code>_.shuffle()</code> が適しています。 メソッドの例を次に示します。
ko: underscore.js 라이브러리를 사용하십시오. 이 경우 <code>_.shuffle()</code> 메소드가 좋습니다. 다음은 그 방법에 대한 예입니다.
ru: Используйте библиотеку underscore.js. Метод <code>_.shuffle()</code> хорош для этого случая. Вот пример с методом:
zh_cn: 使用underscore.js库。 在这种情况下，方法 <code>_.shuffle()</code> 很合适。 这是该方法的示例：

source: We put each element in the array in an object, and give it a random sort key
es: Ponemos cada elemento de la matriz en un objeto,y le damos una clave de clasificación aleatoria
ja: 配列の各要素をオブジェクトに入れ、ランダムなソートキーを与えます。
ko: 배열의 각 요소를 객체에 넣고 임의 정렬 키를 제공합니다.
ru: Мы помещаем каждый элемент массива в объект и присваиваем ему ключ случайной сортировки
zh_cn: 我们把数组中的每个元素放在一个对象中,并给它一个随机的排序键

source: We sort using the random key
es: Clasificamos usando la clave aleatoria
ja: ランダムキーを使ってソートします
ko: 우리는 임의의 키를 사용하여 정렬
ru: Мы сортируем с помощью случайного ключа
zh_cn: 我们使用随机密钥进行排序

source: We unmap to get the original objects
es: Descartamos el mapa para obtener los objetos originales
ja: 元のオブジェクトを取得するためにマップを解除します。
ko: 원래 객체를 얻기 위해 매핑을 해제합니다
ru: Мы разворачиваем карту,чтобы получить оригинальные объекты
zh_cn: 我们取消映射以获得原始对象

source: When computing with IEEE754 double precision floating numbers, you can expect your random generator to provide about 15 decimals. Since you have <em>15!=1,307,674,368,000</em> (with 13 digits), you can use the following functions with arrays containing up to 15 elements and assume there will be no significant bias with arrays containing up to 14 elements. If you work on a fixed-size problem requiring to compute many times this shuffle operation, you may want to try the following code which <em>may</em> be faster than other codes since it uses <code>Math.random</code> only once (it involves several copy operations however).
es: Al calcular con n&uacute;meros flotantes de precisi&oacute;n doble IEEE754, puede esperar que su generador aleatorio proporcione aproximadamente 15 decimales. Como tiene <em>15! = 1,307,674,368,000</em> (con 13 d&iacute;gitos), puede usar las siguientes funciones con matrices que contienen hasta 15 elementos y asumir que no habr&aacute; sesgo significativo con matrices que contengan hasta 14 elementos. Si trabaja en un problema de tama&ntilde;o fijo que requiere calcular muchas veces esta operaci&oacute;n aleatoria, es posible que desee probar el siguiente c&oacute;digo, que <em>puede</em> ser m&aacute;s r&aacute;pido que otros c&oacute;digos ya que usa <code>Math.random</code> solo una vez (sin embargo, implica varias operaciones de copia).
ja: IEEE754倍精度浮動小数点数で計算する場合、ランダムジェネレーターが約15の10進数を提供することを期待できます。 <em>15！= 1,307,674,368,000</em> （13桁）があるので、最大15の要素を含む配列で次の関数を使用でき、最大14の要素を含む配列で大きなバイアスがないと想定できます。 このシャッフル操作を何度も計算する必要がある固定サイズの問題に取り組む場合、 <code>Math.random</code> を 1回しか使用しないため、他のコードよりも高速な次のコードを試す<em>こと</em>が<em>でき</em>ます（ただし、いくつかのコピー操作が含まれます）。
ko: IEEE754 배정 밀도 부동 숫자로 계산할 때 임의 생성기가 약 15 진수를 제공 할 것으로 예상 할 수 있습니다. <em>15! = 1,307,674,368,000</em> (13 자리 숫자)이 있으므로 최대 15 개의 요소를 포함하는 배열에 다음 함수를 사용할 수 있으며 최대 14 개의 요소를 포함하는 배열에는 큰 편향이 없다고 가정합니다. 이 셔플 연산을 여러 번 계산해야하는 고정 크기 문제에 대해 작업하는 <em>경우</em> <code>Math.random</code> 을 한 번만 사용하기 때문에 다른 코드보다 더 빠를 <em>수</em> 있는 다음 코드를 시도 할 <em>수</em> 있습니다 (여러 복사 작업이 포함됨).
ru: При вычислении с плавающими числами двойной точности IEEE754 вы можете ожидать, что ваш генератор случайных чисел предоставит около 15 десятичных знаков. Поскольку у вас <em>15! = 1 307 674 368 000</em> (с 13 цифрами), вы можете использовать следующие функции с массивами, содержащими до 15 элементов, и предполагать, что не будет существенного смещения с массивами, содержащими до 14 элементов. Если вы работаете с проблемой фиксированного размера, требующей многократного вычисления этой операции тасования, вы можете попробовать следующий код, который <em>может</em> быть быстрее других кодов, поскольку он использует <code>Math.random</code> только один раз (однако он включает несколько операций копирования).
zh_cn: 使用IEEE754双精度浮点数进行计算时，可以期望随机生成器提供约15个小数。 由于您有<em>15！= 1,307,674,368,000</em> （13位数字），因此可以对包含最多15个元素的数组使用以下函数，并假设包含最多14个元素的数组不会有明显的偏差。 如果您处理一个固定大小的问题，需要多次计算此随机操作，则可能需要尝试以下代码，该代码<em>可能</em>比其他代码更快，因为它仅使用 <code>Math.random</code> 一次（但是它涉及多个复制操作）。

source: With ES2015 you can use this one:
es: Con ES2015 puedes usar este:
ja: ES2015があればこれを使えます。
ko: ES2015를 사용하면 다음 중 하나를 사용할 수 있습니다.
ru: С ES2015 вы можете использовать эту:
zh_cn: 有了ES2015,你可以用这个。

source: You can do it easily with map and sort:
es: Puedes hacerlo fácilmente con el mapa y la clasificación:
ja: 地図とソートで簡単にできます。
ko: 맵과 정렬로 쉽게 할 수 있습니다.
ru: Это легко сделать с помощью карты и сортировки:
zh_cn: 你可以通过地图和排序来轻松完成。

source: You can do it easily with:
es: Puedes hacerlo fácilmente con:
ja: で簡単にできます。
ko: 당신은 쉽게 할 수 있습니다 :
ru: С этим легко справиться:
zh_cn: 你可以轻松做到与。

source: You can see a <a href="http://bost.ocks.org/mike/shuffle/">great visualization here</a> (and the original post <a href="http://sedition.com/perl/javascript-fy.html">linked to this</a>)
es: Puedes ver una <a href="http://bost.ocks.org/mike/shuffle/">gran visualizaci&oacute;n aqu&iacute;</a> (y la publicaci&oacute;n original <a href="http://sedition.com/perl/javascript-fy.html">vinculada a esto</a> )
ja: あなたは<a href="http://bost.ocks.org/mike/shuffle/">ここで素晴らしい視覚化</a>を見ることができます （そして<a href="http://sedition.com/perl/javascript-fy.html">これにリンクされ</a>た元の投稿）
ko: <a href="http://bost.ocks.org/mike/shuffle/">여기</a> 에서 훌륭한 시각화를 볼 수 있습니다.
ru: Вы можете увидеть <a href="http://bost.ocks.org/mike/shuffle/">отличную визуализацию здесь</a> (и оригинальный пост, <a href="http://sedition.com/perl/javascript-fy.html">связанный с этим</a> )
zh_cn: 您可以<a href="http://bost.ocks.org/mike/shuffle/">在此处</a>看到出色的可视化效果 （以及<a href="http://sedition.com/perl/javascript-fy.html">与此链接相关</a>的原始文章）

source: You can shuffle polymorphic arrays, and the sort is as random as Math.random, which is good enough for most purposes.
es: Puedes mezclar matrices polimórficas,y el tipo es tan aleatorio como las matemáticas,lo que es suficiente para la mayoría de los propósitos.
ja: 多相配列をシャッフルすることができ、ソートはMath.randomと同じようにランダムで、ほとんどの目的にはこれで十分です。
ko: 다형성 배열을 섞을 수 있으며 정렬은 Math.random만큼 임의적이며 대부분의 목적에 충분합니다.
ru: Можно перетасовывать полиморфные массивы,а сорт случайный,как и Math.random,что достаточно хорошо для большинства целей.
zh_cn: 你可以对多态数组进行洗牌,排序就像Math.random一样随机,这对于大多数目的来说已经足够好了。

source: [Comparison tests were done using <code>testShuffleArrayFun</code> against other solutions, in Google Chrome]
es: [Las pruebas de comparaci&oacute;n se realizaron usando <code>testShuffleArrayFun</code> contra otras soluciones, en Google Chrome]
ja: [Google Chromeで他のソリューションに対して <code>testShuffleArrayFun</code> を使用して比較テストが行​​われました]
ko: [Google 크롬의 다른 솔루션에 대해 <code>testShuffleArrayFun</code> 을 사용하여 비교 테스트를 수행함 ]
ru: [Сравнительные тесты проводились с использованием <code>testShuffleArrayFun</code> с другими решениями в Google Chrome]
zh_cn: [比较测试是使用 <code>testShuffleArrayFun</code> 与其他解决方案在Google Chrome中进行的]

source: a shuffle function that doesn't change the source array
es: una función de barajado que no cambia el conjunto de la fuente
ja: ソース配列を変更しないシャッフル関数
ko: 소스 배열을 바꾸지 않는 셔플 기능
ru: тасовка функции,которая не изменяет исходный массив
zh_cn: 不改变源数组的洗牌函数

source: bitwise to floor (numbers up to 10 decimal digits (32bit))
es: bitwise al suelo (números de hasta 10 dígitos decimales (32bit))
ja: ビットからフロアへ(10進数10桁までの数値(32ビット
ko: 비트 단위부터 바닥까지 (십진수 10 자리 (32 비트)까지)
ru: от битовой до напольной (числа до 10 десятичных цифр (32 бит)).
zh_cn: 从位到底层(小数点后十位以内的数字(32位))

source: it uses while---
es: que usa mientras...
ja: 使っているうちに
ko: 그것은 동안 사용합니다 ---
ru: он использует в то время как...
zh_cn: 它在使用的同时

source: removed unecessary closures &amp; other stuff
es: se eliminaron cierres innecesarios y otras cosas
ja: 不要な閉鎖やその他のものを削除
ko: 불필요한 폐쇄 및 기타 물건 제거
ru: удалены ненужные затворы и прочее
zh_cn: 删除了不必要的关闭和其他内容

source: script size (with fy as function name): 90bytes
es: Tamaño del guión (con fy como nombre de la función):90 bytes
ja: スクリプトサイズ(関数名にfyを使用):90バイト
ko: 스크립트 크기 (함수 이름으로 fy) : 90 바이트
ru: размер скрипта (с именем функции fy):90байт
zh_cn: 脚本大小(以fy为函数名):90bytes

source: shorter(4bytes)&amp;faster(test it!).
es: m&aacute;s corto (4bytes) y m&aacute;s r&aacute;pido (&iexcl;pru&eacute;balo!).
ja: 短い（4バイト）＆速い（それをテストしてください！）。
ko: 더 짧고 (4 바이트) 더 빠릅니다 (테스트 해보세요!).
ru: короче (4 байта) и быстрее (протестируйте!).
zh_cn: 更短（4字节）和更快（测试！）。

source: the shortest <code>arrayShuffle</code> function
es: la funci&oacute;n <code>arrayShuffle</code> m&aacute;s corta
ja: 最短の <code>arrayShuffle</code> 関数
ko: 가장 짧은 <code>arrayShuffle</code>
ru: самая короткая функция <code>arrayShuffle</code>
zh_cn: 最短的 <code>arrayShuffle</code> 函数

source: using the top voted functions.
es: usando las funciones más votadas.
ja: 上位投票で選ばれた機能を使って
ko: 최고 투표 기능 사용.
ru: с использованием функций,проголосовавших сверху.
zh_cn: 使用顶部投票的功能。

source: yes it is faster
es: Sí,es más rápido.
ja: それはそうとして
ko: 네 빠릅니다
ru: да,быстрее
zh_cn: 是的,比较快

source: yet another implementation of Fisher-Yates, using strict mode:
es: otra implementación de Fisher-Yates,usando el modo estricto:
ja: 厳密なモードを使用したフィッシャー・イェーツのもう一つの実装です。
ko: 엄격 모드를 사용하는 Fisher-Yates의 또 다른 구현 :
ru: еще одна реализация Фишера-Йейтса,использующая строгий режим:
zh_cn: Fisher-Yates的另一个实现,使用严格模式。
