Repository: rueisnom/feedback
Catalog: xlf/24/50/95/4/2450954.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">Fisher-Yates</a> shuffle in javascript. I'm posting this here because the use of two utility functions (swap and randInt) clarifies the algorithm compared to the other answers here.
es: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">Fisher-Yates</a> baraja en javascript. Estoy publicando esto aqu&iacute; porque el uso de dos funciones de utilidad (swap y randInt) aclara el algoritmo en comparaci&oacute;n con las otras respuestas aqu&iacute;.
ja: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">フィッシャーイェーツ</a>がJavaScriptでシャッフルします。 2つのユーティリティ関数（swapとrandInt）を使用すると、ここで他の回答と比較してアルゴリズムが明確になるため、これをここに投稿します。
ko: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">Fisher-Yates</a> 는 자바 스크립트에서 섞습니다. 두 개의 유틸리티 함수 (swap 및 randInt)를 사용하면 다른 답변과 비교하여 알고리즘이 명확 해지기 때문에 여기에 게시하고 있습니다.
ru: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">Фишер-Йейтс</a> перемешивает в javascript. Я публикую это здесь, потому что использование двух служебных функций (swap и randInt) проясняет алгоритм по сравнению с другими ответами здесь.
zh_cn: <a href="https://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle">Fisher-Yates</a>在javascript中随机播放。 我将其发布在这里是因为与此处的其他答案相比，使用两个实用程序功能（交换和randInt）使算法更清晰。

source: <a href="https://jsfiddle.net/fmjL1eyL/">Here's a jsfiddle showing it in use</a>.
es: <a href="https://jsfiddle.net/fmjL1eyL/">Aqu&iacute; hay un jsfiddle que lo muestra en uso</a> .
ja: <a href="https://jsfiddle.net/fmjL1eyL/">これが使用中のjsfiddle</a>です。
ko: <a href="https://jsfiddle.net/fmjL1eyL/">여기에 사용중인 jsfiddle이 있습니다</a> .
ru: <a href="https://jsfiddle.net/fmjL1eyL/">Вот jsfiddle, показывающий это в использовании</a> .
zh_cn: <a href="https://jsfiddle.net/fmjL1eyL/">这是一个使用中的jsfiddle</a> 。

source: <code>Math.random() - 0.5</code> is a random number that may be positive or negative, so the sorting function reorders elements randomly.
es: <code>Math.random() - 0.5</code> es un n&uacute;mero aleatorio que puede ser positivo o negativo, por lo que la funci&oacute;n de clasificaci&oacute;n reordena los elementos al azar.
ja: <code>Math.random() - 0.5</code> は正または負の乱数なので、並べ替え関数は要素をランダムに並べ替えます。
ko: <code>Math.random() - 0.5</code> 는 양수이거나 음수 일 수있는 난수이므로 정렬 함수는 요소를 무작위로 재정렬합니다.
ru: <code>Math.random() - 0.5</code> - это случайное число, которое может быть положительным или отрицательным, поэтому функция сортировки переупорядочивает элементы случайным образом.
zh_cn: <code>Math.random() - 0.5</code> 是一个随机数，可以是正数或负数，因此排序功能会随机对元素进行重新排序。

source: <em>(for educational purposes)</em>
es: <em>(con fines educativos)</em>
ja: <em>（教育目的のため）</em>
ko: <em>(교육 목적으로)</em>
ru: <em>(для образовательных целей)</em>
zh_cn: <em>（出于教育目的）</em>

source: <em>*faster probably on all browsers except chrome.</em>
es: <em>* probablemente m&aacute;s r&aacute;pido en todos los navegadores, excepto Chrome.</em>
ja: <em>*おそらくクロムを除くすべてのブラウザでより高速です。</em>
ko: <em>* 크롬을 제외한 모든 브라우저에서 더 빠를 것입니다.</em>
ru: <em>* быстрее, вероятно, во всех браузерах, кроме Chrome.</em>
zh_cn: <em>*在chrome以外的所有浏览器上可能更快。</em>

source: <em>EDIT:</em> Updating to ES6 / ECMAScript 2015
es: <em>EDITAR:</em> Actualizaci&oacute;n a ES6 / ECMAScript 2015
ja: <em>編集：</em> ES6 / ECMAScript 2015への更新
ko: <em>편집 :</em> ES6 / ECMAScript 2015로 업데이트
ru: <em>РЕДАКТИРОВАТЬ:</em> Обновление до ES6 / ECMAScript 2015
zh_cn: <em>编辑：</em>更新到ES6 / ECMAScript 2015

source: <em>Original answer:</em>
es: <em>Respuesta original:</em>
ja: <em>元の答え：</em>
ko: <em>원래 답변 :</em>
ru: <em>Оригинальный ответ:</em>
zh_cn: <em>原始答案：</em>

source: <em>Shuffling logic</em>: pick up a random index, then add the corresponding element to the <em>result array</em> and delete it from the <em>source array copy</em>. Repeat this action until the source array gets <em>empty</em>.
es: <em>L&oacute;gica aleatoria</em> : seleccione un &iacute;ndice aleatorio, luego agregue el elemento correspondiente a la <em>matriz de resultados</em> y elim&iacute;nelo de la <em>copia de la matriz de origen</em> . Repita esta acci&oacute;n hasta que la matriz de origen se <em>vac&iacute;e</em> .
ja: <em>シャッフルロジック</em> ：ランダムなインデックスを<em>取得し</em> 、対応する要素を<em>結果の配列に</em>追加して、 <em>ソース配列のコピー</em>から削除し<em>ます</em> 。 ソースアレイが<em>空に</em>なるまで、このアクションを繰り返し<em>ます</em> 。
ko: <em>셔플 링 로직</em> : 랜덤 인덱스를 선택한 다음 해당하는 요소를 <em>결과 배열에</em> 추가하고 <em>소스 배열 복사본</em> 에서 삭제합니다. 소스 배열이 <em>비워</em> 질 때까지이 동작을 반복하십시오.
ru: <em>Логика перемешивания</em> : выберите случайный индекс, затем добавьте соответствующий элемент в <em>массив результатов</em> и удалите его из <em>копии исходного массива</em> . Повторяйте это действие, пока исходный массив не станет <em>пустым</em> .
zh_cn: <em>改组逻辑</em> ：选择一个随机索引，然后将相应的元素添加到<em>结果数组中，</em>并将其从<em>源数组副本中</em>删除。 重复此操作，直到源数组变<em>空</em> 。

source: <em>Update</em>: Here I'm suggesting a relatively <strong>simple</strong> (not from <em>complexity</em> perspective) and <strong>short</strong> algorithm that will do just fine with small sized arrays, but it's definitely going to cost a lot more than the classic <em>Durstenfeld</em> algorithm when you deal with huge arrays. You can find the <em>Durstenfeld</em> in one of the top replies to this question.
es: <em>Actualizaci&oacute;n</em> : Aqu&iacute; estoy sugiriendo un algoritmo relativamente <strong>simple</strong> (no desde una perspectiva de <em>complejidad</em> ) y <strong>corto</strong> que funcionar&aacute; bien con matrices de peque&ntilde;o tama&ntilde;o, pero definitivamente va a costar mucho m&aacute;s que el algoritmo cl&aacute;sico de <em>Durstenfeld</em> cuando se trata de matrices enormes. Puede encontrar el <em>Durstenfeld</em> en una de las principales respuestas a esta pregunta.
ja: <em>更新</em> ：ここでは、比較的<strong>単純な</strong> （ <em>複雑さの</em>観点からではなく） <strong>短い</strong>アルゴリズムを提案し<em>ます</em> 。このアルゴリズムは、サイズの小さい配列で<em>うまく</em>機能しますが、巨大な配列を扱う場合は、従来の<em>Durstenfeld</em>アルゴリズムよりも<em>明らか</em>にコストが高くなります。 <em>Durstenfeld</em>は、この質問に対する上位の回答の1つにあります。
ko: <em>업데이트</em> : 여기에서는 작은 크기의 배열에서 잘 작동하는 비교적 <strong>간단한</strong> ( <em>복잡성</em> 관점이 아닌) <strong>짧은</strong> 알고리즘을 제안하지만 거대한 배열을 처리 할 때 고전적인 <em>Durstenfeld</em> 알고리즘보다 훨씬 많은 비용이 <em>듭니다</em> . <em>Durstenfeld</em> 는이 질문에 대한 최고의 답변 중 하나에서 찾을 수 있습니다.
ru: <em>Обновление</em> : здесь я предлагаю относительно <strong>простой</strong> (не с точки зрения <em>сложности</em> ) и <strong>короткий</strong> алгоритм, который отлично подойдет для небольших массивов, но он определенно будет стоить намного дороже, чем классический алгоритм <em>Дюрстенфельда</em> , когда вы имеете дело с огромными массивами. Вы можете найти <em>Дурстенфельд</em> в одном из лучших ответов на этот вопрос.
zh_cn: <em>更新</em> ：在这里，我建议一个相对<strong>简单的</strong>算法（不是从<em>复杂性的</em>角度来看），并且<strong>简短的</strong>算法对小型数组也可以，但是在处理大型数组时，它的成本肯定比经典的<em>Durstenfeld</em>算法高得多。 您可以在对此问题的最高答复之一中找到<em>Durstenfeld</em> 。

source: <strong>EDIT</strong> There was a calculation in excess (don't need --c+1) <em>and noone noticed</em>
es: <strong>EDITAR</strong> Hubo un c&aacute;lculo en exceso (no necesita --c + 1) <em>y nadie se dio cuenta</em>
ja: <strong>編集</strong>過剰な計算があり（--c + 1は必要ありません） <em>、</em>誰も気づきませんでし<em>た</em>
ko: <strong>편집</strong> 초과 계산이 있었으며 (-c + 1 필요 없음) <em>아무도 눈치 채지</em> 못했습니다.
ru: <strong>РЕДАКТИРОВАТЬ</strong> Был расчет в избытке (не нужно --c + 1), <em>и никто не заметил</em>
zh_cn: <strong>编辑</strong>有一个多余的计算（不需要--c + 1） <em>，没有人注意到</em>

source: <strong>ES6 Pure using array.map</strong>
es: <strong>ES6 Pure usando array.map</strong>
ja: <strong>array.mapを使用したES6 Pure</strong>
ko: <strong>array.map을 사용하는 ES6 Pure</strong>
ru: <strong>ES6 Pure с использованием array.map</strong>
zh_cn: <strong>ES6 Pure使用array.map</strong>

source: <strong>ES6 Pure using array.reduce</strong>
es: <strong>ES6 Pure usando array.reduce</strong>
ja: <strong>array.reduceを使用したES6 Pure</strong>
ko: <strong>array.reduce를 사용하는 ES6 Pure</strong>
ru: <strong>ES6 Pure с использованием array.reduce</strong>
zh_cn: <strong>ES6 Pure使用array.reduce</strong>

source: <strong>ES6 Pure, Iterative</strong>
es: <strong>ES6 puro, iterativo</strong>
ja: <strong>ES6純粋、反復</strong>
ko: <strong>ES6 순수 반복</strong>
ru: <strong>ES6 Чистый, итеративный</strong>
zh_cn: <strong>ES6 Pure，迭代式</strong>

source: <strong>ES6 Pure, Recursive</strong>
es: <strong>ES6 puro, recursivo</strong>
ja: <strong>ES6純粋、再帰的</strong>
ko: <strong>ES6 순수 재귀</strong>
ru: <strong>ES6 Чистый, Рекурсивный</strong>
zh_cn: <strong>ES6纯递归</strong>

source: <strong>Edit: This answer is incorrect</strong>
es: <strong>Editar: esta respuesta es incorrecta</strong>
ja: <strong>編集：この答えは正しくありません</strong>
ko: <strong>편집 :이 답변이 잘못되었습니다</strong>
ru: <strong>Редактировать: этот ответ неверный</strong>
zh_cn: <strong>编辑：此答案不正确</strong>

source: <strong>Edit:</strong> The above code is O(n^2) due to the employment of <code>.splice()</code> but we can eliminate splice and shuffle in O(n) by the swap trick.
es: <strong>Editar:</strong> El c&oacute;digo anterior es O (n ^ 2) debido al empleo de <code>.splice()</code> pero podemos eliminar el empalme y la mezcla en O (n) mediante el truco de intercambio.
ja: <strong>編集：</strong> <code>.splice()</code> を使用しているため、上記のコードはO（n ^ 2 ）ですが、スワップトリックによってO（n）のスプライスとシャッフルを排除できます。
ko: <strong>편집 :</strong> 위의 코드는 <code>.splice()</code> 를 사용하여 O (n ^ 2 ) 이지만 스왑 트릭으로 O (n)에서 스플 라이스와 셔플을 제거 할 수 있습니다.
ru: <strong>Изменить:</strong> приведенный выше код O (n ^ 2) из-за использования <code>.splice()</code> но мы можем устранить сплайс и тасование в O (n) с помощью трюка подкачки.
zh_cn: <strong>编辑：</strong>由于使用了 <code>.splice()</code> ，以上代码为O（n ^ 2），但我们可以通过交换技巧消除O（n）中的拼接和混洗。

source: <strong>Edit</strong>: as pointed out by @gregers, the compare function is called with values rather than indices, which is why you need to use <code>indexOf</code>. Note that this change makes the code less suitable for larger arrays as <code>indexOf</code> runs in O(n) time.
es: <strong>Editar</strong> : como se&ntilde;al&oacute; @gregers, la funci&oacute;n de comparaci&oacute;n se llama con valores en lugar de &iacute;ndices, por lo que debe usar <code>indexOf</code> . Tenga en cuenta que este cambio hace que el c&oacute;digo sea menos adecuado para matrices m&aacute;s grandes, ya que <code>indexOf</code> se ejecuta en tiempo O (n).
ja: <strong>編集</strong> ：@gregersで指摘されているように、compare関数はインデックスではなく値で呼び出されます。そのため、 <code>indexOf</code> を使用する必要があります。 この変更により、 <code>indexOf</code> がO（n）時間で実行されるため、コードが大きな配列に適さなくなることに注意してください。
ko: <strong>편집</strong> : @gregers가 지적한 것처럼 비교 함수는 인덱스가 아닌 값으로 호출되므로 <code>indexOf</code> 를 사용해야합니다. 이 변경으로 <code>indexOf</code> 가 O (n) 시간에 실행되므로 더 큰 배열에는 코드가 적합하지 않습니다.
ru: <strong>Редактировать</strong> : как указано @gregers, функция сравнения вызывается со значениями, а не с индексами, поэтому вам нужно использовать <code>indexOf</code> . Обратите внимание, что это изменение делает код менее подходящим для больших массивов, так как <code>indexOf</code> выполняется за O (n).
zh_cn: <strong>编辑</strong> ：正如@gregers所指出的，compare函数是使用值而不是索引来调用的，这就是为什么需要使用 <code>indexOf</code> 的原因 。 注意，由于 <code>indexOf</code> 以O（n）时间运行，因此此更改使代码不太适合较大的数组。

source: <strong>Modern short inline solution using ES6 features:</strong>
es: <strong>Soluci&oacute;n moderna en l&iacute;nea corta que utiliza las funciones de ES6:</strong>
ja: <strong>ES6機能を使用した最新の短いインラインソリューション：</strong>
ko: <strong>ES6 기능을 사용하는 최신 짧은 인라인 솔루션 :</strong>
ru: <strong>Современное короткое встроенное решение с использованием функций ES6:</strong>
zh_cn: <strong>使用ES6功能的现代短内联解决方案：</strong>

source: <strong>Readable version</strong> (use the original version. this is slower, vars are useless, like the closures &amp; ";", the code itself is also shorter ... maybe read this <a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">How to 'minify' Javascript code</a> , btw you are not able to compress the following code in a javascript minifiers like the above one.)
es: <strong>Versi&oacute;n legible</strong> (use la versi&oacute;n original. Esto es m&aacute;s lento, los vars son in&uacute;tiles, como los cierres &amp; ";", el c&oacute;digo en s&iacute; tambi&eacute;n es m&aacute;s corto ... tal vez lea esto <a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">C&oacute;mo 'minificar' el c&oacute;digo Javascript</a> , por cierto no puede comprima el siguiente c&oacute;digo en un minifier javascript como el anterior).
ja: <strong>読み取り可能なバージョン</strong> （元のバージョンを使用してください。これは遅く、varsは役に立たないので、クロージャ＆ ";"のように、コード自体も短くなっています...多分これを読んでください<a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">Javascriptコードを「縮小」する方法</a>次のコードを上記のようなJavaScriptミニファイアで圧縮します。）
ko: <strong>읽을 수있는 버전</strong> (원래 버전을 사용하십시오. 이것은 느리고, vars는 클로저 &amp; ";"와 같이 쓸모가 없습니다. 코드 자체도 짧습니다 ... <a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">어떻게</a> 읽을 수 있습니까? 위의 코드와 같은 자바 스크립트 축소 기에서 다음 코드를 압축하십시오.)
ru: <strong>Читаемая версия</strong> (используйте оригинальную версию. Это медленнее, переменные бесполезны, как замыкания &amp; ";", сам код также короче ... возможно, прочитайте это <a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">Как "минимизировать" код Javascript</a> , кстати, вы не можете сжать следующий код в миниатюрах javascript, как указано выше.)
zh_cn: <strong>可读的版本</strong> （使用原始版本。速度较慢，vars没用，就像闭包＆&ldquo;;&rdquo;一样，代码本身也更短...也许阅读此方法<a href="https://stackoverflow.com/questions/1737388/how-to-minify-javascript-code/21353032#21353032">如何&ldquo;最小化&rdquo; Javascript代码</a> ，顺便说一下在类似上面的JavaScript缩小器中压缩以下代码。）

source: <strong>Shorter &amp; probably *faster Fisher-Yates shuffle algorithm</strong>
es: <strong>Algoritmo aleatorio Fisher-Yates m&aacute;s corto y probablemente * m&aacute;s r&aacute;pido</strong>
ja: <strong>より短く、おそらく*より速いフィッシャーイェイツのシャッフルアルゴリズム</strong>
ko: <strong>더 짧고 아마도 더 빠른 Fisher-Yates shuffle 알고리즘</strong>
ru: <strong>Короче и, вероятно, * быстрее алгоритм Фишера-Йейтса</strong>
zh_cn: <strong>更短或更快速的Fisher-Yates随机算法</strong>

source: <strong>Shuffle Array In place</strong>
es: <strong>Mezclar matriz en su lugar</strong>
ja: <strong>配列をシャッフルする</strong>
ko: <strong>배열 셔플</strong>
ru: <strong>Перестановка массива на месте</strong>
zh_cn: <strong>随机排列</strong>

source: A recursive solution:
es: Una solución recursiva:
ja: 再帰的な解決策。
ko: 재귀 솔루션 :
ru: Рекурсивное решение:
zh_cn: 递归式的解决方案。

source: A simple modification of CoolAJ86's <a href="https://stackoverflow.com/a/2450976/1673761">answer</a> that does not modify the original array:
es: Una modificaci&oacute;n simple de la <a href="https://stackoverflow.com/a/2450976/1673761">respuesta</a> de CoolAJ86 que no modifica la matriz original:
ja: 元の配列を変更しないCoolAJ86の<a href="https://stackoverflow.com/a/2450976/1673761">回答の</a>簡単な変更：
ko: 원래 배열을 수정하지 않는 CoolAJ86의 간단한 <a href="https://stackoverflow.com/a/2450976/1673761">대답</a> 수정 :
ru: Простая модификация <a href="https://stackoverflow.com/a/2450976/1673761">ответа</a> CoolAJ86, которая не изменяет исходный массив:
zh_cn: 对CoolAJ86 <a href="https://stackoverflow.com/a/2450976/1673761">答案的</a>简单修改，不会修改原始数组：

source: A very simple way for small arrays is simply this:
es: Una forma muy simple para los conjuntos pequeños es simplemente esto:
ja: 小さな配列のための非常にシンプルな方法は、これだけです。
ko: 작은 배열을위한 매우 간단한 방법은 다음과 같습니다.
ru: Очень простой способ для маленьких массивов-это просто так:
zh_cn: 对于小数组来说,一个非常简单的方法就是这样。

source: Actually random
es: En realidad,al azar
ja: 実際にはランダム
ko: 실제로 무작위
ru: На самом деле случайный
zh_cn: 其实是随机的

source: Adding to @Laurens Holsts answer. This is 50% compressed.
es: Añadiendo a la respuesta de @Laurens Holsts.Esto está comprimido al 50%.
ja: @Laurens Holstsの回答に追加します。これは50%圧縮されています。
ko: @Laurens Holsts에 추가하십시오. 이 압축률은 50 %입니다.
ru: Добавление в @Laurens Holsts ответ.Это 50% сжато.
zh_cn: 补充到@Laurens Holsts的回答。这是被压缩了50%。

source: Algorithm runtime is <code>O(n)</code>. <strong>Note</strong> that the shuffle is done in-place so if you don't want to modify the original array, first make a copy of it with <a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"><code>.slice(0)</code></a>.
es: El tiempo de ejecuci&oacute;n del algoritmo es <code>O(n)</code> . <strong>Tenga en cuenta</strong> que la combinaci&oacute;n aleatoria se realiza in situ, por lo que si no desea modificar la matriz original, primero haga una copia con <a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"> <code>.slice(0)</code> </a> .
ja: アルゴリズムのランタイムは <code>O(n)</code> です。 シャッフルはインプレースで行われるため、元の配列を変更したくない場合は、最初に<a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"> <code>.slice(0)</code> </a>を使用してその配列をコピーしてください 。
ko: 알고리즘 런타임은 <code>O(n)</code> 입니다. 셔플은 제자리에서 수행되므로 원래 배열을 수정하지 않으려면 먼저 <a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"> <code>.slice(0)</code> </a> 으로 복사본을 만드십시오.
ru: Время выполнения алгоритма - <code>O(n)</code> . <strong>Обратите внимание,</strong> что перемешивание выполняется на месте, поэтому, если вы не хотите изменять исходный массив, сначала сделайте его копию с помощью <a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"> <code>.slice(0)</code> </a> .
zh_cn: 算法运行时间为 <code>O(n)</code> 。 <strong>请注意</strong> ，随机播放是就地完成的，因此，如果您不想修改原始数组，请首先使用<a href="https://developer.mozilla.org/docs/Web/JavaScript/Reference/Global_Objects/Array/slice"> <code>.slice(0)</code> </a>对其进行复制。

source: All the other answers are based on Math.random() which is fast but not suitable for cryptgraphic level randomization.
es: Todas las demás respuestas se basan en Math.random()que es rápido pero no adecuado para la aleatorización a nivel criptográfico.
ja: 他の回答はすべてMath.random()に基づいていますが、これは高速ですが、暗号レベルのランダム化には適していません。
ko: 다른 모든 답변은 Math.random () 기반으로 빠르지 만 암호화 수준 무작위 화에는 적합하지 않습니다.
ru: Все остальные ответы основаны на методе Math.random(),который является быстрым,но не подходит для криптографической рандомизации уровня.
zh_cn: 其他的答案都是基于Math.random(),虽然速度很快,但不适合密码级随机化。

source: And if you really want it short, here's how far I could get:
es: Y si realmente lo quieres corto,esto es lo más lejos que puedo llegar:
ja: どうしても短くしたいならここまでにしてくれ
ko: 그리고 당신이 정말로 그것을 짧게 원한다면, 내가 얻을 수있는 거리는 다음과 같습니다.
ru: И если ты действительно хочешь,чтобы это было коротко,вот как далеко я могу зайти:
zh_cn: 如果你真的想要短一点,这就是我能走多远。

source: As you can see in this page, there have been incorrect solutions offered here in the past. I wrote and have used the following function to test any pure (no side effects) array randomizing functions.
es: Como pueden ver en esta página,ha habido soluciones incorrectas ofrecidas aquí en el pasado.Escribí y he usado la siguiente función para probar cualquier función de aleatorización de matriz pura (sin efectos secundarios).
ja: このページにあるように、過去にここで提供された不正確な解答がありました。私は以下の関数を書いて、純粋な(副作用のない)配列ランダム化関数をテストするために使用したことがあります。
ko: 이 페이지에서 볼 수 있듯이 과거에 잘못된 솔루션이 제공되었습니다. 순수하고 부작용이없는 배열 임의 화 함수를 테스트하기 위해 다음 함수를 작성하고 사용했습니다.
ru: Как видно на этой странице,в прошлом здесь предлагались неверные решения.Я написал и использовал следующую функцию для проверки любых чистых (без побочных эффектов)функций рандомизации массивов.
zh_cn: 在这个页面中你可以看到,过去在这里提供了不正确的解决方案。我编写并使用了以下函数来测试任何纯粹(无副作用)的数组随机化函数。

source: Caching somewhere else <code>var rnd=Math.random</code> and then use <code>rnd()</code> would also increase slightly the performance on big arrays.
es: El almacenamiento en cach&eacute; en otro lugar <code>var rnd=Math.random</code> y luego usar <code>rnd()</code> tambi&eacute;n aumentar&iacute;a ligeramente el rendimiento en grandes matrices.
ja: <code>var rnd=Math.random</code> を他の場所にキャッシュしてから <code>rnd()</code> を使用すると、大きな配列のパフォーマンスがわずかに向上します。
ko: 다른 곳에서 <code>var rnd=Math.random</code> 을 캐싱 한 다음 <code>rnd()</code> 를 사용하면 큰 배열의 성능이 약간 향상됩니다.
ru: Кэширование в другом месте <code>var rnd=Math.random</code> , а затем использование <code>rnd()</code> также немного увеличит производительность больших массивов.
zh_cn: 缓存其他地方的 <code>var rnd=Math.random</code> ，然后使用 <code>rnd()</code> 也会稍微提高大数组的性能。

source: Edit: This answer is incorrect
es: Editar:Esta respuesta es incorrecta
ja: 編集:この答えは間違っています
ko: 편집 :이 답변이 잘못되었습니다
ru: Редактирование:Этот ответ неверен
zh_cn: 编辑:这个答案是错误的

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: First of all, have a look <a href="http://bost.ocks.org/mike/shuffle/compare.html">here</a> for a great visual comparison of different sorting methods in javascript.
es: En primer lugar, eche un vistazo <a href="http://bost.ocks.org/mike/shuffle/compare.html">aqu&iacute;</a> para ver una excelente comparaci&oacute;n visual de diferentes m&eacute;todos de clasificaci&oacute;n en javascript.
ja: まず、JavaScriptでのさまざまな並べ替え方法の視覚的な比較について、 <a href="http://bost.ocks.org/mike/shuffle/compare.html">こちら</a>をご覧ください 。
ko: 우선, 자바 스크립트에서 다른 정렬 방법을 시각적으로 비교하는 방법을 살펴보십시오.
ru: Прежде всего, обратите внимание на отличное визуальное сравнение различных методов сортировки в javascript.
zh_cn: 首先， <a href="http://bost.ocks.org/mike/shuffle/compare.html">在这里</a>查看一下javascript中不同排序方法的视觉效果。

source: From ChristopheD:
es: De ChristopheD:
ja: ChristopheDさんより
ko: ChristopheD에서 :
ru: От Кристофа Ди:
zh_cn: 来自ChristopheD:
