Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The top answers have complexity of <code>O(n&sup2;)</code>, but this can be done with just <code>O(n)</code> by using an object as a hash:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las respuestas principales tienen una complejidad de </font></font> <code>O(n&sup2;)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero esto se puede hacer solo con </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando un objeto como hash:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上位の回答は</font></font> <code>O(n&sup2;)</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複雑さを持っています</font><font style="vertical-align: inherit;">が、これは</font><font style="vertical-align: inherit;">オブジェクトをハッシュとして使用することで</font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">だけで実行できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최고 답변은 </font></font> <code>O(n&sup2;)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 복잡성을 </font><font style="vertical-align: inherit;">갖지만 </font><font style="vertical-align: inherit;">해시로 객체를 사용하여 </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 수행 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Лучшие ответы имеют сложность </font></font> <code>O(n&sup2;)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но это можно сделать только </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используя объект в качестве хеша:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最高答案的复杂度为</font></font> <code>O(n&sup2;)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但这可以</font><font style="vertical-align: inherit;">通过将对象用作哈希来</font><font style="vertical-align: inherit;">仅用</font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来完成</font><font style="vertical-align: inherit;">：</font></font>

source: There are probably faster ways but this one is pretty decent.
es: Probablemente hay formas más rápidas pero esta es bastante decente.
ja: もっと早い方法もあるだろうが、これはかなりまともだ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 더 빠른 방법이 있지만 이것은 꽤 괜찮습니다.</font></font>
ru: Есть,наверное,более быстрые способы,но этот довольно приличный.
zh_cn: 可能有更快的方法,但这个方法还是很不错的。

source: This chunk of ugly code does the same as the snippet #3 above, <s>but an order of magnitude faster</s> (as of 2017 it's only twice as fast - JS core folks are doing a great job!)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Este trozo de c&oacute;digo feo hace lo mismo que el fragmento n. &deg; 3 anterior, </font></font><s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pero un orden de magnitud m&aacute;s r&aacute;pido</font></font></s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (a partir de 2017 es solo el doble de r&aacute;pido, &iexcl;la gente principal de JS est&aacute; haciendo un gran trabajo!)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この醜いコードのチャンクは、上記のスニペット＃3と同じですが、</font></font><s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">桁違いに高速です</font></font></s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2017年の時点で、2倍の速度しかありません-JSコアの人々は素晴らしい仕事をしています！）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 추악한 코드 덩어리는 위의 스 니펫 # 3과 동일 </font></font><s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하지만 크기가 훨씬 빠릅니다</font></font></s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (2017 년 현재 두 배 빠릅니다-JS 핵심 사람들이 훌륭한 일을하고 있습니다!)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот кусок уродливого кода делает то же самое, что и фрагмент № 3 выше, </font></font><s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">но на порядок быстрее</font></font></s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (с 2017 года он только вдвое быстрее - основные сотрудники JS отлично справляются с работой!)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这段丑陋的代码与上面的代码段＃3一样，</font></font><s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是速度提高了一个数量级</font></font></s><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（截至2017年，它的速度仅是后者的两倍-JS核心人员做得很好！）</font></font>

source: This is how it's usually done. The idea is to place each element in a hashtable and then check for its presence instantly. This gives us linear time, but has at least two drawbacks:
es: Así es como se hace normalmente.La idea es colocar cada elemento en un hachero y luego comprobar su presencia al instante.Esto nos da un tiempo lineal,pero tiene al menos dos inconvenientes:
ja: 通常はこのような方法で行われます。このアイデアは、各要素をハッシュテーブルに配置して、その存在を即座にチェックするというものです。これは直線的な時間が得られますが、少なくとも2つの欠点があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 일반적으로 수행되는 방법입니다. </font><font style="vertical-align: inherit;">아이디어는 각 요소를 해시 테이블에 배치 한 다음 그 존재를 즉시 확인하는 것입니다. </font><font style="vertical-align: inherit;">이것은 우리에게 선형 시간을 제공하지만 적어도 두 가지 단점이 있습니다.</font></font>
ru: Вот как это обычно делается.Идея состоит в том,чтобы поместить каждый элемент в хэш-таблетку,а затем мгновенно проверить его наличие.Это дает нам линейное время,но имеет как минимум два недостатка:
zh_cn: 通常是这样做的。其想法是将每个元素放在hashtable中,然后立即检查它的存在。这给了我们线性时间,但至少有两个缺点。

source: This is quadratic, but there are nice additional goodies, like wrapping native <code>indexOf</code>, ability to uniqify by a key (<code>iteratee</code> in their parlance), and optimizations for already sorted arrays.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto es cuadr&aacute;tico, pero hay buenos </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> adicionales, como envolver </font><font style="vertical-align: inherit;">indexOf</font><font style="vertical-align: inherit;"> nativo </font><font style="vertical-align: inherit;">, la capacidad de unificar por una clave ( </font></font> <code>iteratee</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en su lenguaje) y optimizaciones para arreglos ya ordenados.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは二次式ですが、ネイティブの</font></font> <code>indexOf</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ラップ</font><font style="vertical-align: inherit;">、キーで一意化する機能（</font></font> <code>iteratee</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font><font style="vertical-align: inherit;">iteratee</font><font style="vertical-align: inherit;">）、既に並べ替えられた配列の最適化</font><font style="vertical-align: inherit;">など、優れた追加機能があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 이차적이지만 네이티브 </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 감싸기 </font><font style="vertical-align: inherit;">, 키 ( </font></font> <code>iteratee</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 uniqify하는 기능 </font><font style="vertical-align: inherit;">및 이미 정렬 된 배열에 대한 최적화와 </font><font style="vertical-align: inherit;">같은 멋진 추가 </font><font style="vertical-align: inherit;">기능이 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это квадратично, но есть и хорошие </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , такие как перенос нативного </font><font style="vertical-align: inherit;">indexOf</font><font style="vertical-align: inherit;"> , возможность uniqify по ключу ( </font></font> <code>iteratee</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на их языке) и оптимизации для уже отсортированных массивов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是二次方的，但是还有很多不错的东西，例如包装本机</font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，按键进行唯一化的能力（</font><font style="vertical-align: inherit;">用术语</font></font> <code>iteratee</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示）以及对已排序数组的优化。</font></font>

source: This will work for strings, numbers, and dates. If your array contains objects, the above solution won't work because when coerced to a string, they will all have a value of <code>"[object Object]"</code> (or something similar) and that isn't suitable as a lookup value. You can get an <code>O(n)</code> implementation for objects by setting a flag on the object itself:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto funcionar&aacute; para cadenas, n&uacute;meros y fechas. </font><font style="vertical-align: inherit;">Si su matriz contiene objetos, la soluci&oacute;n anterior no funcionar&aacute; porque cuando se los coaccione a una cadena, todos tendr&aacute;n un valor de </font></font> <code>"[object Object]"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (o algo similar) y eso no es adecuado como valor de b&uacute;squeda. </font><font style="vertical-align: inherit;">Puede obtener una </font><font style="vertical-align: inherit;">implementaci&oacute;n </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para los objetos estableciendo un indicador en el objeto mismo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、文字列、数値、日付に対して機能します。</font><font style="vertical-align: inherit;">配列にオブジェクトが含まれている場合、上記のソリューションは機能しません。文字列に強制変換されると、すべての</font></font> <code>"[object Object]"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">「[オブジェクトオブジェクト]」</font><font style="vertical-align: inherit;">（または同様の値）の値が含まれ、ルックアップ値として適切ではないためです。</font><font style="vertical-align: inherit;">オブジェクト自体にフラグを設定することで、オブジェクトの</font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装を</font><font style="vertical-align: inherit;">取得できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열, 숫자 및 날짜에 적용됩니다. </font><font style="vertical-align: inherit;">배열에 객체가 포함 된 경우 문자열로 강제 변환 될 때 </font></font> <code>"[object Object]"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (또는 이와 유사한 값) 값을 가지며 조회 값으로 적합하지 </font><font style="vertical-align: inherit;">않기 때문에 위의 솔루션이 작동 </font><font style="vertical-align: inherit;">하지 않습니다. </font><font style="vertical-align: inherit;">객체 자체에 플래그를 설정하여 객체에 대한 </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구현을 </font><font style="vertical-align: inherit;">얻을 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это будет работать для строк, чисел и дат. </font><font style="vertical-align: inherit;">Если ваш массив содержит объекты, приведенное выше решение не будет работать, поскольку при приведении к строке все они будут иметь значение </font></font> <code>"[object Object]"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (или что-то подобное), и это не подходит в качестве значения для поиска. </font><font style="vertical-align: inherit;">Вы можете получить реализацию </font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для объектов, установив флаг для самого объекта:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这将适用于字符串，数字和日期。</font><font style="vertical-align: inherit;">如果您的数组包含对象，则上述解决方案将不起作用，因为当强制使用字符串时，它们都将具有</font></font> <code>"[object Object]"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（或类似名称）的值，并且不适合作为查找值。</font><font style="vertical-align: inherit;">您可以</font><font style="vertical-align: inherit;">通过在对象本身上设置标志来获得对象</font><font style="vertical-align: inherit;">的</font></font> <code>O(n)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实现：</font></font>

source: Uniq reduce while keeping existing order
es: Uniq reducir mientras se mantiene el orden existente
ja: 既存のオーダーを維持したままユニックリデュース
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기존 주문을 유지하면서 Uniq 감소</font></font>
ru: Сокращение Uniq при сохранении существующего порядка
zh_cn: 在保持现有订单的同时,统一减少

source: Unique by...
es: Único por...
ja: ユニークな...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에 의해 고유 한 ...</font></font>
ru: Уникально...
zh_cn: 独特的由.....

source: Update 2015: ES6 version:
es: Actualización 2015:Versión ES6:
ja: 2015年にアップデートしました。ES6版です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2015 업데이트 : ES6 버전 :</font></font>
ru: Обновление 2015 года:версия ES6:
zh_cn: 2015年的更新。ES6版本。

source: Use <a href="http://underscorejs.org/">Underscore.js</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://underscorejs.org/"><font style="vertical-align: inherit;">Underscore.jsを</font></a><font style="vertical-align: inherit;">使用する</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://underscorejs.org/"><font style="vertical-align: inherit;">Underscore.js</font></a><font style="vertical-align: inherit;"> 사용</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a>

source: Use the <code>Set</code> variant above to keep the first, and the <code>Map</code> to keep the last:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use la </font><font style="vertical-align: inherit;">variante </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> anterior para conservar el primero y el </font></font> <code>Map</code> a<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para conservar el &uacute;ltimo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記</font><font style="vertical-align: inherit;">の</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バリアントを</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">て最初を保持し、</font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して最後を保持します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 변형 </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 </font><font style="vertical-align: inherit;">첫 번째 </font><font style="vertical-align: inherit;">를 유지하고 </font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하여 마지막을 유지하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font><font style="vertical-align: inherit;">вариант </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выше, чтобы сохранить первое, и </font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы сохранить последнее:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">上面</font><font style="vertical-align: inherit;">的</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量保留第一个变量，</font><font style="vertical-align: inherit;">使用</font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">保留最后一个</font><font style="vertical-align: inherit;">变量</font><font style="vertical-align: inherit;">：</font></font>

source: Using the 3rd ("this array") parameter of the filter callback we can avoid a closure of the array variable:
es: Usando el tercer parámetro ("este arreglo")de la retrollamada del filtro podemos evitar un cierre de la variable del arreglo:
ja: フィルタコールバックの 3 番目のパラメータ ("this array")を使用すると、配列変数のクロージャを回避することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필터 콜백의 3 번째 ( "this array") 매개 변수를 사용하면 배열 변수가 닫히는 것을 피할 수 있습니다.</font></font>
ru: Используя 3-й ("этот массив")параметр обратного вызова фильтра можно избежать закрытия переменной массива:
zh_cn: 使用过滤器回调的第3个参数("this array"),我们可以避免数组变量的关闭。

source: Using the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set">Set</a> constructor and the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax">spread syntax</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando el </font><font style="vertical-align: inherit;">constructor </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y la </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sintaxis de propagaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンストラクターと</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スプレッド構文</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은 Using </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설정</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 생성자와 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">확산 구문</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя </font><font style="vertical-align: inherit;">конструктор </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">синтаксис распространения</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">构造函数和</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">spread语法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
