Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: if you can't read the code above ask, read a javascript book or here are some explainations about shorter code. <a href="https://stackoverflow.com/a/21353032/2450730">https://stackoverflow.com/a/21353032/2450730</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">si no puede leer el c&oacute;digo anterior, pregunte, lea un libro de JavaScript o aqu&iacute; hay algunas explicaciones sobre el c&oacute;digo m&aacute;s corto. </font></font><a href="https://stackoverflow.com/a/21353032/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/21353032/2450730</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のコードが読めない場合は、JavaScriptの本を読んでください。</font></font><a href="https://stackoverflow.com/a/21353032/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/21353032/2450730</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 코드를 읽을 수 없다면 Javascript 책을 읽거나 짧은 코드에 대한 설명을 참조하십시오. </font></font><a href="https://stackoverflow.com/a/21353032/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/21353032/2450730</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы не можете прочитать приведенный выше код, спросите, прочитайте книгу по javascript или вот несколько объяснений более короткого кода. </font></font><a href="https://stackoverflow.com/a/21353032/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/21353032/2450730</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您看不懂上面的代码，请阅读一本javascript书籍，或以下有关较短代码的说明。</font></font><a href="https://stackoverflow.com/a/21353032/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/21353032/2450730</font></font></a>

source: or a <code>Map</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o un </font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или </font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>Map</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: or even using the <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator">spread operator</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o incluso usando el </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">operador de propagaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">spread演算子</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">こともできます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 심지어 </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스프레드 연산자를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или даже используя </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оператор распространения</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">甚至使用</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">价差运算符</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: or in short hand
es: o en mano corta
ja: 或いは手短に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 짧은 손에</font></font>
ru: или вкратце
zh_cn: 或简称

source: otherwise, yield it and add it to the set of already seen values
es: de lo contrario,cédalo y añádalo al conjunto de valores ya vistos
ja: そうでなければ、それを降伏させて、すでに表示されている値のセットに追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇지 않으면 양보하고 이미 본 값 세트에 추가하십시오.</font></font>
ru: в противном случае,отдайте его и добавьте к набору уже видимых значений.
zh_cn: 否则,放弃它,并将其添加到已经看到的值集合中。

source: reuse of other small, generic functions
es: reutilización de otras funciones pequeñas y genéricas
ja: 他の小さな汎用機能の再利用
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 작고 일반적인 기능의 재사용</font></font>
ru: повторное использование других небольших,общих функций
zh_cn: 重用其他小的通用功能

source: since hash keys can only be strings or symbols in JavaScript, this code doesn't distinguish numbers and "numeric strings". That is, <code>uniq([1,"1"])</code> will return just <code>[1]</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como las claves hash solo pueden ser cadenas o s&iacute;mbolos en JavaScript, este c&oacute;digo no distingue n&uacute;meros y "cadenas num&eacute;ricas". </font><font style="vertical-align: inherit;">Es decir, </font></font> <code>uniq([1,"1"])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&aacute; solo </font></font> <code>[1]</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハッシュキーはJavaScriptでは文字列または記号のみであるため、このコードは数値と「数値文字列」を区別しません。</font><font style="vertical-align: inherit;">つまり、</font></font> <code>uniq([1,"1"])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font> <code>[1]</code> <font style="vertical-align: inherit;">だけを返し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시 키는 JavaScript에서 문자열 또는 기호 만 될 수 있으므로이 코드는 숫자와 "숫자 문자열"을 구별하지 않습니다. </font><font style="vertical-align: inherit;">즉, </font></font> <code>uniq([1,"1"])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font> <code>[1]</code> <font style="vertical-align: inherit;"> 만 반환합니다 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">поскольку ключи хеша могут быть только строками или символами в JavaScript, этот код не различает числа и &laquo;числовые строки&raquo;. </font><font style="vertical-align: inherit;">То есть </font></font> <code>uniq([1,"1"])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет просто </font></font> <code>[1]</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于哈希键只能是JavaScript中的字符串或符号，因此此代码无法区分数字和&ldquo;数字字符串&rdquo;。</font><font style="vertical-align: inherit;">也就是说，</font></font> <code>uniq([1,"1"])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将只返回</font></font> <code>[1]</code>

source: sort | uniq
es: uniq
ja: uniq
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬 | </font><font style="vertical-align: inherit;">유니크</font></font>
ru: uniq
zh_cn: uniq

source: take the next value from the argument
es: tomar el siguiente valor del argumento
ja: 引数の次の値を取る
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">논쟁에서 다음 가치를 취하다</font></font>
ru: брать следующее значение из аргумента
zh_cn: 取下一个值

source: there's no need for <code>slice</code> nor <code>indexOf</code> within the reduce function, like i've seen in other examples! it makes sense to use it along with a filter function though:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No hay necesidad de </font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ni </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de la funci&oacute;n de reducci&oacute;n, como he visto en otros ejemplos. </font><font style="vertical-align: inherit;">Sin embargo, tiene sentido usarlo junto con una funci&oacute;n de filtro:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の例で見たように、reduce関数内</font><font style="vertical-align: inherit;">で</font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も</font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も</font><font style="vertical-align: inherit;">必要あり</font><font style="vertical-align: inherit;">ません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、フィルター関数と一緒に使用するのは理にかなっています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 예제에서 본 것처럼 reduce 함수 내에서 </font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 필요하지 않습니다 </font><font style="vertical-align: inherit;">! </font><font style="vertical-align: inherit;">그러나 필터 기능과 함께 사용하는 것이 좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нет необходимости </font><font style="vertical-align: inherit;">ни </font><font style="vertical-align: inherit;">в </font></font> <code>slice</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ни в </font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри функции </font><font style="vertical-align: inherit;">Reduce</font><font style="vertical-align: inherit;"> , как я видел в других примерах! </font><font style="vertical-align: inherit;">имеет смысл использовать его вместе с функцией фильтра, хотя:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就像我在其他示例中看到的那样，在reduce函数中</font><font style="vertical-align: inherit;">不需要</font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>indexOf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">！</font><font style="vertical-align: inherit;">不过，将其与过滤器函数一起使用是有意义的：</font></font>

source: this can be made shorter in ES6 to
es: esto puede hacerse más corto en ES6 para
ja: これはES6ではもっと短くして
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 ES6에서 더 짧아 질 수 있습니다.</font></font>
ru: это может быть сокращено в ES6 до
zh_cn: 这在ES6中可以缩短到

source: use <code>Array.filter()</code> like this
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">use </font></font> <code>Array.filter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como este</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このように</font></font> <code>Array.filter()</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">ください</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이와 같이 </font></font> <code>Array.filter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">используйте </font></font> <code>Array.filter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вот так</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">像这样</font><font style="vertical-align: inherit;">使用</font></font> <code>Array.filter()</code> <font style="vertical-align: inherit;"></font>

source: which both also work with non-primitive keys.
es: que también funcionan con claves no primitivas.
ja: これはどちらも非原始的なキーでも動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본이 아닌 키에서도 작동합니다.</font></font>
ru: которые также работают с непримитивными ключами.
zh_cn: 这两个键也可以使用非原始键。

source: which is, again, a variation of the first snippet.
es: que es,de nuevo,una variación del primer fragmento.
ja: これはまた、最初のスニペットのバリエーションです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이는 다시 첫 번째 스 니펫의 변형입니다.</font></font>
ru: что,опять же,вариация первого фрагмента.
zh_cn: 这又是第一个片段的变体。
