Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In ECMAScript 6 (aka ECMAScript 2015), <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><code>Set</code></a> can be used to filter out duplicates. Then it can be converted back to an array using the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator">spread operator</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En ECMAScript 6 (tambi&eacute;n conocido como ECMAScript 2015), </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"> <code>Set</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar para filtrar duplicados. </font><font style="vertical-align: inherit;">Luego se puede convertir de nuevo a una matriz utilizando el </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">operador de propagaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6（別名ECMAScript 2015）では、</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"> <code>Set</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して重複を除外で​​きます。</font><font style="vertical-align: inherit;">次に、</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">spread演算子</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して配列に変換し直すことができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 (일명 ECMAScript 2015)에서는 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"> <code>Set</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하여 중복을 필터링 할 수 있습니다. </font><font style="vertical-align: inherit;">그런 다음 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">spread 연산자를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 배열로 다시 변환 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В ECMAScript 6 (он же ECMAScript 2015) </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"> <code>Set</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно использовать для фильтрации дубликатов. </font><font style="vertical-align: inherit;">Затем он может быть преобразован обратно в массив с помощью </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оператора распространения</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在ECMAScript 6（又名ECMAScript 2015）中，</font><font style="vertical-align: inherit;">可以使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"> <code>Set</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">过滤出重复项。</font><font style="vertical-align: inherit;">然后可以使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">散布运算符</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将其转换回数组</font><font style="vertical-align: inherit;">。</font></font>

source: In ES6 you can use a <code>Set</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En ES6 puedes usar un </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6では</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6에서는 </font></font> <code>Set</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В ES6 вы можете использовать </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在ES6中，您可以使用</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: In ES6 you have Sets and Spread which makes it very easy and performant to remove all duplicates:
es: En el ES6 tienes Sets y Spread que hace que sea muy fácil y eficaz eliminar todos los duplicados:
ja: ES6には、セットとスプレッドがあり、これを使えば、重複しているものを簡単に取り除くことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6에는 Sets and Spread가있어 모든 복제본을 제거하는 것이 매우 쉽고 성능이 뛰어납니다.</font></font>
ru: В ES6 у вас есть Sets and Spread,что позволяет очень легко и эффективно удалять все дубликаты:
zh_cn: 在ES6中,你有了Sets和Spread,这使得删除所有重复的内容变得非常容易和有效。

source: In chrome v51 reduce &amp; lut : 23.90ms vs filter &amp; indexOf : 1066ms
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En chrome v51 reduce y lut: 23.90ms vs filtro e &iacute;ndice De: 1066ms</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Chrome V51では、reduce＆lut：23.90ms vs filter＆indexOf：1066ms</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">크롬 v51에서 감소 및 lut : 23.90ms vs 필터 및 색인의 : 1066ms</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В Chrome v51 уменьшение &amp; lut: 23,90 мс против фильтра и indexOf: 1066 мс</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在chrome v51中reduce＆lut：23.90ms vs filter＆indexOf：1066ms</font></font>

source: In firefox v47 reduce &amp; lut : 14.85ms vs filter &amp; indexOf : 2836ms
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En firefox v47 reduce y lut: 14.85 ms vs filtro e &iacute;ndice De: 2836 ms</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">firefox v47では、reduce＆lut：14.85ms vs filter＆indexOf：2836ms</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파이어 폭스 v47에서 감소 및 lut : 14.85ms vs 필터 및 색인</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В Firefox v47 уменьшить &amp; lut: 14,85 мс против фильтра и indexOf: 2836 мс</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在firefox v47中reduce＆lut：14.85ms vs filter＆indexOf：2836ms</font></font>

source: It's a library with a host of functions for manipulating arrays.
es: Es una biblioteca con muchas funciones para manipular matrices.
ja: 配列を操作するための関数のホストを持つライブラリです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 조작하기위한 많은 함수가있는 라이브러리입니다.</font></font>
ru: Это библиотека с множеством функций для управления массивами.
zh_cn: 它是一个拥有大量操作数组的函数的库。

source: It's the tie to go along with jQuery's tux, and Backbone.js's suspenders.
es: Es la corbata que va junto con el esmoquin de jQuery,y los tirantes de Backbone.js.
ja: jQueryのタキシードとBackbone.jsのサスペンダーに合わせたネクタイです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery의 tux 및 Backbone.js의 멜빵 자와 함께 가기위한 넥타이입니다.</font></font>
ru: Это галстук вместе со смокингом Джей Кюри и подтяжками Backbone.js.
zh_cn: 这是jQuery的礼服和Backbone.js的吊带搭配的领带。

source: Memory Consumption and Garbage Collection
es: Consumo de memoria y recogida de basura
ja: メモリ消費とゴミの収集
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메모리 소비 및 가비지 콜렉션</font></font>
ru: Потребление памяти и сбор мусора
zh_cn: 内存消耗和垃圾回收

source: More: <a href="https://stackoverflow.com/a/25082874/2450730">https://stackoverflow.com/a/25082874/2450730</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&aacute;s: </font></font><a href="https://stackoverflow.com/a/25082874/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/25082874/2450730</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細：</font><a href="https://stackoverflow.com/a/25082874/2450730"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//stackoverflow.com/a/25082874/2450730</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 : </font><a href="https://stackoverflow.com/a/25082874/2450730"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//.com/a/25082874/2450730</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подробнее: </font></font><a href="https://stackoverflow.com/a/25082874/2450730"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/25082874/2450730</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更多：</font><a href="https://stackoverflow.com/a/25082874/2450730"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//stackoverflow.com/a/25082874/2450730</font></font>

source: My test case comparison: <a href="http://jsperf.com/remove-duplicate-array-tests">http://jsperf.com/remove-duplicate-array-tests</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi comparaci&oacute;n de casos de prueba: </font></font><a href="http://jsperf.com/remove-duplicate-array-tests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/remove-duplicate-array-tests</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テストケースの比較：</font><a href="http://jsperf.com/remove-duplicate-array-tests"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsperf.com/remove-duplicate-array-tests</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 테스트 사례 비교 : </font></font><a href="http://jsperf.com/remove-duplicate-array-tests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/remove-duplicate-array-tests</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мое сравнение тестовых случаев: </font></font><a href="http://jsperf.com/remove-duplicate-array-tests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/remove-duplicate-array-tests</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的测试案例比较：</font><a href="http://jsperf.com/remove-duplicate-array-tests"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsperf.com/remove-duplicate-array-tests</font></font>

source: Note that, unlike in python, ES6 sets are iterated in insertion order, so this code preserves the order of the original array.
es: Obsérvese que,a diferencia de la pitón,los conjuntos ES6 se iteran en orden de inserción,por lo que este código conserva el orden de la matriz original.
ja: python とは異なり、ES6 のセットは挿入順にイテートされるので、このコードは元の配列の順番を保持することに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파이썬과 달리 ES6 세트는 삽입 순서대로 반복 되므로이 코드는 원래 배열의 순서를 유지합니다.</font></font>
ru: Обратите внимание,что в отличие от питона,наборы ES6 итерируются в порядке вставки,поэтому данный код сохраняет порядок исходного массива.
zh_cn: 请注意,与python中不同,ES6集是按插入顺序迭代的,所以这段代码保留了原始数组的顺序。

source: Now this is the spectacular comeback of Map()..! May be now you can make a better decision when you want to remove the dupes.
es: ¡Este es el espectacular regreso de Map()...! Puede ser que ahora puedas tomar una mejor decisión cuando quieras eliminar a los incautos.
ja: これがMap()の華麗なるカムバックです。これで、ダブりを削除したいときに、より良い判断ができるようになるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 이것은 Map ()의 환상적인 복귀입니다 ..! </font><font style="vertical-align: inherit;">이제 듀피를 제거 할 때 더 나은 결정을 내릴 수 있습니다.</font></font>
ru: Теперь это захватывающее возвращение Map()...! Возможно,теперь вы сможете принять лучшее решение,когда захотите удалить дубликаты.
zh_cn: 现在,这就是Map()的壮观复出.....! 也许现在你可以在你想删除掉upes的时候做出更好的决定了。

source: Now uniqueArray contains no duplicates.
es: Ahora uniqueArray no contiene duplicados.
ja: これで、uniqueArrayには重複したものが含まれなくなりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 uniqueArray에 중복이 없습니다.</font></font>
ru: Теперь uniqueArray не содержит дубликатов.
zh_cn: 现在 uniqueArray不包含重复的内容。

source: OK .. even though this one is O(n) and the others are O(n^2) i was curious to see benchmark comparison between this reduce / look up table and filter/indexOf combo (I choose Jeetendras very nice implementation <a href="https://stackoverflow.com/a/37441144/4543207">https://stackoverflow.com/a/37441144/4543207</a>). I prepare a 100K item array filled with random positive integers in range 0-9999 and and it removes the duplicates. I repeat the test for 10 times and the average of the results show that they are no match in performance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OK ... a pesar de que este es O (n) y los otros son O (n ^ 2), ten&iacute;a curiosidad por ver una comparaci&oacute;n de referencia entre esta tabla de reducci&oacute;n / b&uacute;squeda y filtro / indexOf combo (elijo la muy buena implementaci&oacute;n de Jeetendras </font></font><a href="https://stackoverflow.com/a/37441144/4543207"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https: //stackoverflow.com/a/37441144/4543207</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Preparo una matriz de elementos de 100K llena de enteros positivos aleatorios en el rango 0-9999 y elimina los duplicados. </font><font style="vertical-align: inherit;">Repito la prueba 10 veces y el promedio de los resultados muestra que no coinciden en rendimiento.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これはO（n）で他はO（n ^ 2）ですが、この削減/ルックアップテーブルとフィルター/ indexOfコンボのベンチマーク比較を知りたいと思っていました（私はJeetendrasの非常に優れた実装</font></font><a href="https://stackoverflow.com/a/37441144/4543207"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を選択してい</font><font style="vertical-align: inherit;">ます： //stackoverflow.com/a/37441144/4543207</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">範囲0〜9999のランダムな正の整数で満たされた100Kの項目配列を準備し、重複を削除します。</font><font style="vertical-align: inherit;">テストを10回繰り返しましたが、結果の平均から、パフォーマンスが一致していないことがわかります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OK .. 비록 이것이 O (n)이고 다른 것들은 O (n ^ 2) 임에도 불구 하고이 축소 / 조회 테이블과 filter / indexOf 콤보 간의 벤치 마크 비교를보고 싶어했습니다 (Jetendras는 매우 훌륭한 구현을 선택합니다 </font></font><a href="https://stackoverflow.com/a/37441144/4543207"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https : //stackoverflow.com/a/37441144/4543207</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">0-9999 범위의 임의의 양의 정수로 채워진 100K 항목 배열을 준비하고 중복을 제거합니다. </font><font style="vertical-align: inherit;">테스트를 10 회 반복했으며 평균 결과는 성능이 일치하지 않음을 보여줍니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ОК ... хотя это O (n), а остальные O (n ^ 2), мне было любопытно увидеть сравнение эталонных тестов между этой таблицей уменьшения / поиска и комбинацией filter / indexOf (я выбрал очень хорошую реализацию Jeetendras </font></font><a href="https://stackoverflow.com/a/37441144/4543207"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https: //stackoverflow.com/a/37441144/4543207</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Я готовлю массив из 100 КБ, заполненный случайными положительными целыми числами в диапазоне 0-9999, и он удаляет дубликаты. </font><font style="vertical-align: inherit;">Я повторяю тест 10 раз, и средние результаты показывают, что они не соответствуют производительности.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">好吧..即使这个是O（n）而其他是O（n ^ 2）我也很好奇看到这个reduce / lookup table和filter / indexOf组合之间的基准比较（我选择Jeetendras非常好的实现</font></font><a href="https://stackoverflow.com/a/37441144/4543207"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https： //stackoverflow.com/a/37441144/4543207</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">我准备了一个100K项数组，其中填充了0-9999范围内的随机正整数，并且删除了重复项。</font><font style="vertical-align: inherit;">我重复测试10次，结果的平均值表明它们的性能不匹配。</font></font>

source: One caveat: Array.lastIndexOf() was added in IE9, so if you need to go lower than that, you'll need to look elsewhere.
es: Una advertencia:Array.lastIndexOf()fue agregado en IE9,así que si necesitas ir más bajo que eso,tendrás que buscar en otra parte.
ja: ひとつ注意点があります:Array.lastIndexOf()は IE9 で追加されたので、それよりも低い値にする必要がある場合は、他の場所を探す必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 경고 : Array.lastIndexOf ()가 IE9에 추가되었으므로 그보다 낮아야하는 경우 다른 곳을 봐야합니다.</font></font>
ru: Одно предостережение:Array.lastIndexOf()был добавлен в IE9,так что если вам нужно опуститься ниже,вам нужно искать в другом месте.
zh_cn: 注意事项:Array.lastIndexOf()是在IE9中添加的,所以如果你需要低于这个值,你需要到其他地方去找。

source: One line:
es: Una línea:
ja: 一行。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">한 줄:</font></font>
ru: Одна линия:
zh_cn: 一句话。

source: Or, for an order-safe version, use an object to store all previously seen values, and check values against it before before adding to an array.
es: O,para una versión de orden seguro,usar un objeto para almacenar todos los valores vistos anteriormente,y comprobar los valores contra él antes de añadirlos a una matriz.
ja: あるいは、オーダーセーフのバージョンでは、オブジェクトを使用して、以前に見たすべての値を保存し、配列に追加する前に値をチェックします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 주문 안전 버전의 경우 객체를 사용하여 이전에 본 모든 값을 저장하고 배열에 추가하기 전에 값을 확인하십시오.</font></font>
ru: Или же,в случае с версией,защищенной от ошибок,используйте объект для хранения всех ранее просмотренных значений и сверяйте их с ними перед добавлением в массив.
zh_cn: 或者,对于订单安全的版本,使用一个对象来存储所有之前看到的值,并在添加到数组之前,对照它检查值。

source: Performance Considerations
es: Consideraciones sobre el rendimiento
ja: パフォーマンスに関する考察
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">성능 고려 사항</font></font>
ru: Показатели эффективности
zh_cn: 性能方面的考虑因素
