Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Produces a duplicate-free version of the <strong>array</strong>, using === to test object equality. If you know in advance that the <strong>array</strong> is sorted, passing <em>true</em> for <strong>isSorted</strong> will run a much faster algorithm. If you want to compute unique items based on a transformation, pass an <strong>iterator</strong> function.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Produce una versi&oacute;n libre de duplicados de la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , usando === para probar la igualdad de objetos. </font><font style="vertical-align: inherit;">Si sabe de antemano que la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; ordenada, pasar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">isSorted</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ejecutar&aacute; un algoritmo mucho m&aacute;s r&aacute;pido. </font><font style="vertical-align: inherit;">Si desea calcular elementos &uacute;nicos basados ​​en una transformaci&oacute;n, pase una </font><font style="vertical-align: inherit;"> funci&oacute;n </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">iteradora</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">===を使用してオブジェクトの等価性をテストし</font><font style="vertical-align: inherit;">、重複のないバージョンの</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を生成します。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がソートさ </font><font style="vertical-align: inherit;">れていることが事前にわかっている場合</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">isSortedに</font></strong></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">渡す</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と、はるかに高速なアルゴリズムが実行されます。</font><font style="vertical-align: inherit;">変換に基づいて一意のアイテムを計算する場合は、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">反復</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 関数を</font><font style="vertical-align: inherit;">渡し</font><strong><font style="vertical-align: inherit;">ます</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">===를 사용하여 객체 동일성을 테스트 </font><font style="vertical-align: inherit;">하는 무 복제 버전의 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 생성합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 정렬되어 </font><font style="vertical-align: inherit;">있음을 미리 알고 있다면 </font><strong><font style="vertical-align: inherit;">isSorted에 </font></strong></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">전달 </font><font style="vertical-align: inherit;">하면 훨씬 빠른 알고리즘이 실행됩니다. </font><font style="vertical-align: inherit;">변환을 기반으로 고유 항목을 계산하려면 </font><strong><font style="vertical-align: inherit;">반복자</font></strong><font style="vertical-align: inherit;"> 함수를 </font><font style="vertical-align: inherit;">전달하십시오 </font><font style="vertical-align: inherit;">.</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Создает версию </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массива</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> без дубликатов </font><font style="vertical-align: inherit;">, используя === для проверки равенства объектов. </font><font style="vertical-align: inherit;">Если вы заранее знаете, что </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массив</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отсортирован, передача </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">isSorted</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выполнит гораздо более быстрый алгоритм. </font><font style="vertical-align: inherit;">Если вы хотите вычислить уникальные элементы на основе преобразования, передайте функцию </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">итератора</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">产生</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的无重复版本</font><font style="vertical-align: inherit;">，使用===来测试对象的相等性。</font><font style="vertical-align: inherit;">如果您事先知道该</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已排序，</font><font style="vertical-align: inherit;">则为</font><strong><font style="vertical-align: inherit;">isSorted</font></strong><font style="vertical-align: inherit;">传递 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将运行更快的算法。</font><font style="vertical-align: inherit;">如果要基于转换计算唯一项，请传递</font><strong><font style="vertical-align: inherit;">迭代器</font></strong><font style="vertical-align: inherit;"> 函数。</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>

source: Quick and dirty using jQuery:
es: Rápido y sucio usando jQuery:
ja: jQueryを使った手っ取り早くて汚い。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery를 사용하여 빠르고 더러운 :</font></font>
ru: Быстро и грязно с помощью jQuery:
zh_cn: 使用jQuery的快速和肮脏。

source: Remove duplicate values from JS array
es: Eliminar los valores duplicados de la matriz JS
ja: JS配列から重複した値を削除する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JS 배열에서 중복 값 제거</font></font>
ru: Удалить дубликаты значений из массива JS
zh_cn: 删除JS数组中的重复值

source: See also <a href="https://jsfiddle.net/s6skxLtz/4/"><strong>this Fiddle</strong></a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ver tambi&eacute;n </font></font><a href="https://jsfiddle.net/s6skxLtz/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este viol&iacute;n</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://jsfiddle.net/s6skxLtz/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このフィドル</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://jsfiddle.net/s6skxLtz/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 바이올린을</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите также </font></font><a href="https://jsfiddle.net/s6skxLtz/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту скрипку</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另请参阅</font></font><a href="https://jsfiddle.net/s6skxLtz/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此小提琴</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Show code snippet
es: Mostrar fragmento de código
ja: コードスニペットを表示
ko: 코드 스 니펫 표시
ru: Показать фрагмент кода
zh_cn: 显示代码片段

source: Similar question:
es: Pregunta similar:
ja: 似たような質問。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비슷한 질문 :</font></font>
ru: Похожий вопрос:
zh_cn: 类似的问题。

source: Simplest One I've run into so far. In es6.
es: El más simple con el que me he encontrado hasta ahora.En es6.
ja: これまでに出会った中で 最も単純なものだ es6では
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 지금까지 가장 간단한 것. </font><font style="vertical-align: inherit;">es6에서.</font></font>
ru: Самый простой из тех,с кем я сталкивался до сих пор.В 6-ом.
zh_cn: 迄今为止我遇到的最简单的一个。在ES6中。

source: So the options is:
es: Así que las opciones son:
ja: 選択肢があるんですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">옵션은 다음과 같습니다.</font></font>
ru: Значит,есть варианты:
zh_cn: 所以,选项是。

source: Someone asked about ordering the results based on how many unique names there are:
es: Alguien preguntó acerca de ordenar los resultados en base a cuántos nombres únicos hay:
ja: ユニークな名前が何個あるかで結果の順番を決めることについて質問した人がいました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가 고유 한 이름이 몇 개인 지에 따라 결과를 주문하는 것에 대해 물었습니다.</font></font>
ru: Кто-то спросил о том,как заказать результаты,исходя из количества уникальных имен:
zh_cn: 有人问到根据有多少个唯一的名字来排序结果。

source: Sometimes it's desired to uniquify a list based on some criteria other than just equality, for example, to filter out objects that are different, but share some property. This can be done elegantly by passing a callback. This "key" callback is applied to each element, and elements with equal "keys" are removed. Since <code>key</code> is expected to return a primitive, hash table will work fine here:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A veces se desea uniquificar una lista basada en algunos criterios distintos de la igualdad, por ejemplo, para filtrar objetos que son diferentes, pero que comparten alguna propiedad. </font><font style="vertical-align: inherit;">Esto se puede hacer con elegancia pasando una devoluci&oacute;n de llamada. </font><font style="vertical-align: inherit;">Esta devoluci&oacute;n de llamada "clave" se aplica a cada elemento, y los elementos con "claves" iguales se eliminan. </font><font style="vertical-align: inherit;">Dado que </font><font style="vertical-align: inherit;">se espera que la </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelva una primitiva, la tabla hash funcionar&aacute; bien aqu&iacute;:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、異なるが、いくつかのプロパティを共有するオブジェクトをフィルターで除外するために、単なる等号以外の基準に基づいてリストを一意化することが必要な場合があります。</font><font style="vertical-align: inherit;">これは、コールバックを渡すことによってエレガントに行うことができます。</font><font style="vertical-align: inherit;">この「キー」コールバックは各要素に適用され、等しい「キー」を持つ要素は削除されます。</font><font style="vertical-align: inherit;">以来</font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プリミティブを返すことが期待されている、ハッシュテーブルは、ここでは正常に動作します：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, 다른 객체를 걸러 내지 만 일부 속성을 공유하는 등 평등 이외의 다른 기준에 따라 목록을 고유 화해야하는 경우가 있습니다. </font><font style="vertical-align: inherit;">콜백을 전달하여 우아하게 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">이 "키"콜백은 각 요소에 적용되며 동일한 "키"를 가진 요소는 제거됩니다. </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 프리미티브를 리턴 할 것으로 예상 </font><font style="vertical-align: inherit;">되므로 </font><font style="vertical-align: inherit;">해시 테이블은 다음과 같이 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иногда желательно унифицировать список на основе некоторых критериев, отличных от равенства, например, чтобы отфильтровать объекты, которые отличаются, но имеют какое-то свойство. </font><font style="vertical-align: inherit;">Это можно сделать элегантно, передав обратный вызов. </font><font style="vertical-align: inherit;">Этот обратный вызов &laquo;ключа&raquo; применяется к каждому элементу, а элементы с одинаковыми &laquo;ключами&raquo; удаляются. </font><font style="vertical-align: inherit;">Поскольку </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как ожидается, вернет примитив, хеш-таблица будет работать нормально:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有时，我们希望根据某些条件（不仅仅是相等性）来对列表进行唯一化，例如，过滤出不同但共享某些属性的对象。</font><font style="vertical-align: inherit;">可以通过传递回调来优雅地完成此操作。</font><font style="vertical-align: inherit;">此&ldquo;键&rdquo;回调将应用于每个元素，并且删除具有相等&ldquo;键&rdquo;的元素。</font><font style="vertical-align: inherit;">由于</font><font style="vertical-align: inherit;">预计</font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将返回原语，因此哈希表在这里可以正常工作：</font></font>

source: Sort based on occurrence:
es: Clasificar en base a la ocurrencia:
ja: 発生状況に応じてソートします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">발생을 기준으로 정렬 :</font></font>
ru: Сортировка по происхождению:
zh_cn: 根据发生情况进行排序。

source: Test: <a href="http://jsperf.com/wgu">http://jsperf.com/wgu</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prueba: </font></font><a href="http://jsperf.com/wgu"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/wgu</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テスト：</font><a href="http://jsperf.com/wgu"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsperf.com/wgu</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트 : </font></font><a href="http://jsperf.com/wgu"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/wgu</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тест: </font></font><a href="http://jsperf.com/wgu"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsperf.com/wgu</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">测试：</font><a href="http://jsperf.com/wgu"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsperf.com/wgu</font></font>

source: That said, if your arrays contain only primitives and you don't care about types (e.g. it's always numbers), this solution is optimal.
es: Dicho esto,si tus matrices contienen sólo primitivas y no te importan los tipos (por ejemplo,siempre son números),esta solución es óptima.
ja: つまり、あなたの配列がプリミティブだけを含み、型を気にしない場合(例:常に数値である)、この解決策が最適です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, 배열에 프리미티브 만 포함되어 있고 유형에 신경 쓰지 않으면 (예 : 항상 숫자)이 솔루션이 최적입니다.</font></font>
ru: Тем не менее,если ваши массивы содержат только примитивы и вас не волнуют типы (например,это всегда числа),то такое решение является оптимальным.
zh_cn: 也就是说,如果你的数组只包含基元,而且你不关心类型(例如总是数字),那么这个解决方案是最优的。

source: The best from two worlds
es: Lo mejor de dos mundos
ja: 二つの世界から最高のものを
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 세계에서 최고</font></font>
ru: Лучшие из двух миров
zh_cn: 两个世界中的佼佼者

source: The following is more than 80% faster than the jQuery method listed (see tests below). It is an answer from a similar question a few years ago. If I come across the person who originally proposed it I will post credit. Pure JS.
es: Lo siguiente es más de un 80% más rápido que el método jQuery listado (ver pruebas más abajo).Es una respuesta de una pregunta similar de hace unos años.Si me encuentro con la persona que lo propuso originalmente,le daré crédito.Puro JS.
ja: 以下は、記載されているjQueryメソッド(以下のテストを参照)よりも80%以上高速です。これは数年前の似たような質問からの回答です。もともと提案した人に出くわしたらクレジットを載せておきます。Pure JSです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 나열된 jQuery 메소드보다 80 % 이상 빠릅니다 (아래 테스트 참조). </font><font style="vertical-align: inherit;">몇 년 전 비슷한 질문에 대한 답변입니다. </font><font style="vertical-align: inherit;">원래 제안한 사람을 만나면 크레딧을 게시합니다. </font><font style="vertical-align: inherit;">순수한 JS.</font></font>
ru: Следующее более чем на 80% быстрее,чем перечисленный метод jQuery (см.тесты ниже).Это ответ на аналогичный вопрос несколько лет назад.Если я наткнусь на человека,который изначально предложил его,я поставлю оценку.Чистый JS.
zh_cn: 下面这道题比列出的jQuery方法快80%以上(见下面的测试)。这是几年前一个类似问题的答案。如果我遇到了最初提出这个问题的人,我会贴出功劳。纯粹的JS。

source: The implementation is so simple, defining a function is no longer warranted.
es: La implementación es tan simple,que ya no se justifica la definición de una función.
ja: 実装がとてもシンプルなので、関数を定義することはもはやワーチャリングされていません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현이 너무 간단하여 함수 정의가 더 이상 보증되지 않습니다.</font></font>
ru: Реализация настолько проста,что определение функции больше не требуется.
zh_cn: 实现方式如此简单,定义一个功能已经没有必要了。

source: The most concise way to remove duplicates from an array using native javascript functions is to use a sequence like below:
es: La forma más concisa de eliminar duplicados de una matriz usando funciones nativas de javascript es usar una secuencia como la siguiente:
ja: javascriptのネイティブ関数を使って配列から重複を削除する最も簡潔な方法は、以下のようなシーケンスを使うことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 자바 스크립트 함수를 사용하여 배열에서 중복을 제거하는 가장 간결한 방법은 다음과 같은 순서를 사용하는 것입니다.</font></font>
ru: Самый простой способ удалить дубликаты из массива с помощью родных функций javascript-это использовать последовательность,как показано ниже:
zh_cn: 使用本机javascript函数从数组中删除重复数组的最简洁的方法是使用像下面这样的序列。

source: The thing to remember here is that objects MUST have unique keys. We are exploiting this to remove all the duplicates. I would have thought this would be the fastest solution (before ES6).
es: Lo que hay que recordar aquí es que los objetos DEBEN tener claves únicas.Estamos explotando esto para eliminar todos los duplicados.Hubiera pensado que esta sería la solución más rápida (antes del ES6).
ja: ここで覚えておくべきことは、オブジェクトは一意のキーを持たなければならない(MUST)ということです。これを悪用して重複したものをすべて削除しています。これが(ES6以前の)最速の解決策だと思っていました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 기억해야 할 것은 객체는 반드시 고유 키를 가져야한다는 것입니다. </font><font style="vertical-align: inherit;">우리는 모든 복제본을 제거하기 위해 이것을 활용하고 있습니다. </font><font style="vertical-align: inherit;">나는 이것이 가장 빠른 해결책이라고 생각했을 것입니다 (ES6 이전).</font></font>
ru: Здесь нужно помнить,что объекты ДОЛЖНЫ иметь уникальные ключи.Мы используем это,чтобы удалить все дубликаты.Я бы подумал,что это будет самым быстрым решением (до ES6).
zh_cn: 这里要记住的是,对象必须有唯一的密钥。我们正在利用这一点来消除所有的重复。我会认为这将是最快的解决方案(在ES6之前)。
