Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: ECMAScript 6 adds the new <code>Set</code> Data-Structure, which lets you store values of any type. <code>Set.values</code> returns elements in insertion order.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 agrega la nueva </font><font style="vertical-align: inherit;">Estructura de datos de </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que le permite almacenar valores de cualquier tipo. </font></font> <code>Set.values</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve elementos en orden de inserci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6は新しい</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Data-Structureを</font><font style="vertical-align: inherit;">追加し</font><font style="vertical-align: inherit;">ます。これにより、任意のタイプの値を保存できます。 </font></font> <code>Set.values</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、挿入順に要素を返します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript를 6은 새로운 추가 </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신은 어떤 유형의 값을 저장할 수 있습니다 데이터 구조. </font></font> <code>Set.values</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 삽입 순서로 요소를 반환합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 добавляет новую </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Data-Structure, которая позволяет вам хранить значения любого типа. </font></font> <code>Set.values</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает элементы в порядке вставки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6添加了新的</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Data-Structure，它使您可以存储任何类型的值。 </font></font> <code>Set.values</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">按插入顺序返回元素。</font></font>

source: ES6 provides the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set">Set</a> object, which makes things a whole lot easier:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 proporciona el </font><font style="vertical-align: inherit;">objeto </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que hace las cosas mucho m&aacute;s f&aacute;ciles:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6には</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトが</font><font style="vertical-align: inherit;">用意されており、</font><font style="vertical-align: inherit;">物事が非常に簡単になります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6는 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체를 </font><font style="vertical-align: inherit;">제공하여 </font><font style="vertical-align: inherit;">훨씬 쉽게 작업 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 предоставляет </font><font style="vertical-align: inherit;">объект </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который делает вещи намного проще:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6提供了</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Set</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象，这使事情变得容易得多：</font></font>

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Faster uniq with sorting
es: Uniq más rápido con la clasificación
ja: ソートでより高速なユニック
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정렬로 더 빠른 유니크</font></font>
ru: Быстрый уник с сортировкой
zh_cn: 更快的分拣

source: First or last?
es: ¿Primera o última?
ja: 最初か最後か?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">처음 또는 마지막?</font></font>
ru: Первый или последний?
zh_cn: 第一个还是最后一个?

source: Function calls are expensive in JavaScript, therefore the above solutions, as concise as they are, are not particularly efficient. For maximal performance, replace <code>filter</code> with a loop and get rid of other function calls:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las llamadas a funciones son caras en JavaScript, por lo tanto, las soluciones anteriores, por concisas que sean, no son particularmente eficientes. </font><font style="vertical-align: inherit;">Para un rendimiento m&aacute;ximo, reemplace el </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con un bucle y desh&aacute;gase de otras llamadas a funciones:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptでは関数呼び出しはコストがかかるため、上記のソリューションは、簡潔であるほど、特に効率的ではありません。</font><font style="vertical-align: inherit;">最大限のパフォーマンス</font><font style="vertical-align: inherit;">を得るには、</font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をループに</font><font style="vertical-align: inherit;">置き換え</font><font style="vertical-align: inherit;">、他の関数呼び出しを削除します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수 호출은 JavaScript에서 비싸므로 위의 솔루션은 간결하게 효율적이지 않습니다. </font><font style="vertical-align: inherit;">최대 성능을 </font><font style="vertical-align: inherit;">얻으려면 </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 루프로 </font><font style="vertical-align: inherit;">바꾸고 </font><font style="vertical-align: inherit;">다른 함수 호출을 제거하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вызовы функций в JavaScript дороги, поэтому приведенные выше решения, какими бы краткими они ни были, не особенно эффективны. </font><font style="vertical-align: inherit;">Для максимальной производительности замените </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на цикл и избавьтесь от других вызовов функций:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数调用在JavaScript中非常昂贵，因此，上述解决方案虽然非常简洁，但并不是特别有效。</font><font style="vertical-align: inherit;">为了获得最佳性能，请用</font><font style="vertical-align: inherit;">循环</font><font style="vertical-align: inherit;">替换</font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并摆脱其他函数调用：</font></font>

source: Generic Functional Approach
es: Enfoque funcional genérico
ja: 一般的な機能的アプローチ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 기능적 접근</font></font>
ru: Общий функциональный подход
zh_cn: 通用功能方法

source: Get all non-unique values (i.e.: duplicate/more than one occurrence) in an array
es: Obtener todos los valores no únicos (es decir:duplicatemás de una ocurrencia)en un conjunto
ja: 配列内の一意ではないすべての値 (すなわち、重複している複数の値)を取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열에서 고유하지 않은 모든 값 (예 : 중복 / 둘 이상의 발생)을 가져옵니다.</font></font>
ru: Получить в массиве все неуникальные значения (т.е.:дубликат,чем одно событие).
zh_cn: 获取数组中的所有非唯一值(即:重复出现的次数超过一次)。

source: Go for this one:
es: Ve a por este:
ja: これにしてくれ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 위해 가십시오 :</font></font>
ru: Вперед:
zh_cn: 去买这个吧。

source: Got tired of seeing all bad examples with for-loops or jQuery. Javascript has the perfect tools for this nowadays: sort, map and reduce.
es: Me cansé de ver todos los malos ejemplos con for-loops o jQuery.Javascript tiene las herramientas perfectas para esto hoy en día:ordenar,mapear y reducir.
ja: フォアループやjQueryを使った悪い例を見るのに疲れました。最近のJavascriptには、ソート、マップ、リデュースなどの完璧なツールがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">for-loops 또는 jQuery를 사용하여 모든 나쁜 예제를 보는 데 지쳤습니다. </font><font style="vertical-align: inherit;">Javascript는 오늘날 정렬, 매핑 및 축소와 같은 완벽한 도구를 제공합니다.</font></font>
ru: Устала видеть все плохие примеры с for-loops или jQuery.В настоящее время у Javascript есть отличные инструменты для этого:сортировка,карта и уменьшение.
zh_cn: 看腻了所有使用for-loops或jQuery的坏例子。现在的Javascript有完美的工具:排序、映射和减少。

source: Hashtables to the rescue
es: Hashtables al rescate
ja: ハッシュテーブルの救済
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구조에 대한 해시 테이블</font></font>
ru: Хэштейблы на помощь
zh_cn: 救援哈士奇表

source: Here is a generic and strictly functional approach with ES2015:
es: Aquí hay un enfoque genérico y estrictamente funcional con ES2015:
ja: ここでは、ES2015を使った汎用的で厳密な機能的なアプローチをご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 ES2015의 포괄적이고 기능적인 접근 방식입니다.</font></font>
ru: Вот общий и строго функциональный подход с ES2015:
zh_cn: 下面就以ES2015为例,严格意义上的通用性和功能性。

source: Here is a simple answer to the question.
es: Aquí hay una respuesta simple a la pregunta.
ja: ここで簡単にお答えします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 질문에 대한 간단한 답변입니다.</font></font>
ru: Вот простой ответ на вопрос.
zh_cn: 下面是一个简单的答案。

source: Here is very simple for understanding and working anywhere (even in PhotoshopScript) code. Check it!
es: Aquí es muy simple para entender y trabajar en cualquier lugar (incluso en PhotoshopScript)el código.Compruébalo!
ja: どこでも(PhotoshopScriptでも)コードを理解して作業するための非常に簡単な方法をご紹介します。ぜひチェックしてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PhotoshopScript에서도 코드를 이해하고 작업하기에 매우 간단합니다. </font><font style="vertical-align: inherit;">확인해 봐!</font></font>
ru: Здесь очень просто понимать и работать где угодно (даже в PhotoshopScript)код.Проверьте его!
zh_cn: 这里是非常简单的理解和工作在任何地方(甚至在PhotoshopScript中)的代码。检查它!

source: However, if you need an array with unique elements, why not use sets right from the beginning?
es: Sin embargo,si necesitas un conjunto con elementos únicos,¿por qué no usar conjuntos desde el principio?
ja: しかし、ユニークな要素を持つ配列が必要な場合は、最初からセットを使うのはどうでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 고유 한 요소가있는 배열이 필요한 경우 처음부터 바로 세트를 사용하지 않는 이유는 무엇입니까?</font></font>
ru: Однако,если вам нужен массив с уникальными элементами,почему бы не использовать наборы с самого начала?
zh_cn: 但是,如果你需要一个具有唯一元素的数组,为什么不一开始就使用集呢?

source: I believe this is the best way to do this
es: Creo que esta es la mejor manera de hacer esto
ja: と思っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 가장 좋은 방법이라고 생각합니다.</font></font>
ru: Я считаю,что это лучший способ сделать это.
zh_cn: 我相信这是最好的办法。

source: I could point to all the codes that I've tried but I think it's useless because they don't work. I accept jQuery solutions too.
es: Podría señalar todos los códigos que he probado pero creo que es inútil porque no funcionan.Yo también acepto las soluciones de jQuery.
ja: 試したコードを全部指してもいいのですが、うまくいかないので無駄だと思います。jQueryでの解決策も受け付けています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시도한 모든 코드를 가리킬 수는 있지만 작동하지 않기 때문에 쓸모가 없다고 생각합니다. </font><font style="vertical-align: inherit;">나는 jQuery 솔루션도 받아들입니다.</font></font>
ru: Я мог бы указать на все коды,которые я пробовал,но я думаю,что это бесполезно,потому что они не работают.Я тоже принимаю решения JQuery.
zh_cn: 我可以指出我试过的所有代码,但我认为没有用,因为它们不起作用。我也接受jQuery的解决方案。

source: I had done a detailed comparison of dupes removal at some other question but having noticed that this is the real place i just wanted to share it here as well.
es: Había hecho una comparación detallada de la eliminación de los duplicados en alguna otra pregunta,pero habiendo notado que este es el lugar real,sólo quería compartirlo aquí también.
ja: 私はいくつかの他の質問でダブりの除去の詳細な比較を行っていたが、ここが本当の場所であることに気づいたことで、私はちょうどここでもそれを共有したいと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 질문에서 듀피 제거에 대한 자세한 비교를 수행했지만 여기에서 공유하고 싶은 실제 장소라는 것을 알았습니다.</font></font>
ru: Я провел подробное сравнение удаления дубликатов на каком-то другом вопросе,но,заметив,что это реальное место,я просто хотел поделиться им и здесь.
zh_cn: 我曾在其他一些问题上做了一个详细的比较,但注意到这里是真正的地方,我只想在这里分享。

source: I have a very simple JavaScript array that may or may not contain duplicates.
es: Tengo un arreglo de JavaScript muy simple que puede o no contener duplicados.
ja: 私は非常にシンプルなJavaScriptの配列を持っていますが、それは重複を含んでいるかもしれませんし、含まれていないかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중복을 포함하거나 포함하지 않을 수있는 매우 간단한 JavaScript 배열이 있습니다.</font></font>
ru: У меня очень простой массив JavaScript,который может содержать или не содержать дубликаты.
zh_cn: 我有一个非常简单的JavaScript数组,可能包含或不包含重复的内容。

source: I need to remove the duplicates and put the unique values in a new array.
es: Necesito eliminar los duplicados y poner los valores únicos en un nuevo arreglo.
ja: 重複を削除して、ユニークな値を新しい配列に入れたいのですが、どうすればいいでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중복을 제거하고 고유 한 값을 새 배열에 넣어야합니다.</font></font>
ru: Мне нужно удалить дубликаты и поместить уникальные значения в новый массив.
zh_cn: 我需要删除重复的值,并将唯一的值放到一个新的数组中。

source: If by any chance you were using
es: Si por casualidad estabas usando
ja: もしもあなたが
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">만일 당신이 우연히 사용했다면</font></font>
ru: Если,случайно,вы использовали
zh_cn: 如果你在使用

source: If the <code>key</code> is not primitive, you have to resort to the linear search:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si la </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no es primitiva, debe recurrir a la b&uacute;squeda lineal:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がプリミティブでない</font><font style="vertical-align: inherit;">場合は</font><font style="vertical-align: inherit;">、線形検索に頼る必要があります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 기본이 아닌 </font><font style="vertical-align: inherit;">경우 </font><font style="vertical-align: inherit;">선형 검색을 사용해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не является примитивным, вам придется прибегнуть к линейному поиску:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不是原始</font><font style="vertical-align: inherit;">键，</font><font style="vertical-align: inherit;">则必须诉诸线性搜索：</font></font>

source: If you identify <code>uniqueBy</code> as the cause of a concrete performance penalty in your app, replace it with optimized code. That is, write your code first in an functional, declarative way. Afterwards, provided that you encounter performance issues, try to optimize the code at the locations, which are the cause of the problem.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si identifica </font></font> <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como la causa de una penalizaci&oacute;n de rendimiento concreta en su aplicaci&oacute;n, reempl&aacute;cela con un c&oacute;digo optimizado. </font><font style="vertical-align: inherit;">Es decir, escriba su c&oacute;digo primero de manera funcional y declarativa. </font><font style="vertical-align: inherit;">Despu&eacute;s, siempre que encuentre problemas de rendimiento, intente optimizar el c&oacute;digo en las ubicaciones, que son la causa del problema.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプリの具体的なパフォーマンスペナルティの原因として</font></font> <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を特定</font><font style="vertical-align: inherit;">した場合は、最適化されたコードに置き換えます。</font><font style="vertical-align: inherit;">つまり、最初に機能的で宣言的な方法でコードを記述します。</font><font style="vertical-align: inherit;">その後、パフォーマンスの問題が発生した場合は、問題の原因となっている場所でコードを最適化してみてください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">앱에서 </font></font> <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 구체적인 성능 저하 원인으로 </font><font style="vertical-align: inherit;">식별 </font><font style="vertical-align: inherit;">하면 최적화 된 코드로 바꾸십시오. </font><font style="vertical-align: inherit;">즉, 기능적이고 선언적인 방식으로 코드를 먼저 작성하십시오. </font><font style="vertical-align: inherit;">나중에 성능 문제가 발생하면 문제의 원인이되는 위치에서 코드를 최적화하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы определили </font></font> <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как причину конкретного </font><font style="vertical-align: inherit;">снижения</font><font style="vertical-align: inherit;"> производительности в вашем приложении, замените его оптимизированным кодом. </font><font style="vertical-align: inherit;">То есть сначала напишите свой код функциональным, декларативным способом. </font><font style="vertical-align: inherit;">Впоследствии, при условии, что у вас возникли проблемы с производительностью, попробуйте оптимизировать код в местах, которые являются причиной проблемы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您将</font></font> <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确定</font><font style="vertical-align: inherit;">为导致应用程序具体性能</font><font style="vertical-align: inherit;">下降</font><font style="vertical-align: inherit;">的原因，请用优化的代码代替。</font><font style="vertical-align: inherit;">也就是说，首先以功能性的声明方式编写代码。</font><font style="vertical-align: inherit;">此后，如果遇到性能问题，请尝试在引起问题的位置优化代码。</font></font>

source: If you're using jQuery and can't stand anything without a dollar before it, it goes like this:
es: Si estás usando jQuery y no puedes soportar nada sin un dólar antes de él,es así:
ja: jQueryを使っていて、その前にドルがないと何も我慢できないという人は、こんな感じになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery를 사용하고 있으며 달러가 없으면 아무것도 견딜 수 없다면 다음과 같습니다.</font></font>
ru: Если вы используете jQuery и ничего не можете выдержать без доллара до этого,все пойдет так:
zh_cn: 如果你在使用jQuery,而且前面没有一元钱的东西是受不了的,那么它是这样的。
