Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: We can easily derive <code>unique</code> from <code>unqiueBy</code> or use the faster implementation utilizing <code>Set</code>s:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podemos f&aacute;cilmente derivar </font></font> <code>unique</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>unqiueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o utilizar la aplicaci&oacute;n m&aacute;s r&aacute;pida utilizando </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s:</font></font>
ja: <font style="vertical-align: inherit;"> <code>unqiueBy</code> <font style="vertical-align: inherit;">から</font></font> <code>unique</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を簡単に派生</font><font style="vertical-align: inherit;">さ</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">せる</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">か、</font></font> <code>Set</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">利用してより高速な実装を使用</font><font style="vertical-align: inherit;">できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"> <code>unqiueBy</code> <font style="vertical-align: inherit;"> 에서 </font></font> <code>unique</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하게 쉽게 파생 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시키</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 거나 </font></font> <code>Set</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 더 빠른 구현을 사용할 </font><font style="vertical-align: inherit;">수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы можем легко получить </font></font> <code>unique</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font> <code>unqiueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или использовать более быструю реализацию, используя </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以轻松地</font><font style="vertical-align: inherit;">从</font> <code>unqiueBy</code> <font style="vertical-align: inherit;">派生</font></font> <code>unique</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">或者使用通过</font> <code>Set</code> <font style="vertical-align: inherit;">更快的实现</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Well ok so far so good. But let's do it properly this time in the ES6 style. It looks so cool..! But as of now how it will perform against the powerful lut solution is a mystery to me. Lets first see the code and then benchmark it.
es: Bueno,hasta ahora todo bien.Pero hagámoslo bien esta vez en el estilo ES6.¡Se ve tan bien...! Pero a partir de ahora,la forma en que se comportará contra la poderosa solución de lut es un misterio para mí.Primero veamos el código y luego hagamos un análisis comparativo.
ja: うーん.........ここまではいいですね。でも今回はちゃんとES6風にやってみましょう。かっこいいですね...。しかし、今のところ、強力なLutソリューションに対してどのようなパフォーマンスを発揮するのかは謎です。まずはコードを見てからベンチマークしてみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래 지금까지 좋아. </font><font style="vertical-align: inherit;">그러나 이번에는 ES6 스타일로 올바르게 해봅시다. </font><font style="vertical-align: inherit;">너무 멋져요 ..! </font><font style="vertical-align: inherit;">그러나 현재 강력한 lut 솔루션에 대해 어떻게 수행되는지는 미스터리입니다. </font><font style="vertical-align: inherit;">먼저 코드를 확인한 다음 벤치마킹하십시오.</font></font>
ru: Пока все в порядке.Но давайте на этот раз сделаем это как следует в стиле ES6.Выглядит так круто! Но на данный момент то,как он будет работать против мощного раствора люта,для меня загадка.Давайте сначала посмотрим на код,а затем проверим его.
zh_cn: 好了,好了,到目前为止还不错。但是,让我们这次用ES6的风格,好好地做吧。它看起来真酷.....! 但到现在为止,它将如何与强大的lut解决方案对抗,对我来说是个谜。让我们先看一下代码,然后再做个基准测试。

source: Well ok we are all happy now. But the lead role always comes last with some applause. I am sure some of you wonder what Set object would do. Now that since we are open to ES6 and we know Map is the winner of the previous games let us compare Map with Set as a final. A typical Real Madrid vs Barcelona game this time... or is it? Let's see who will win the el classico :)
es: Bien,bien,ahora estamos todos contentos.Pero el papel principal siempre llega al final con algunos aplausos.Estoy seguro de que algunos de ustedes se preguntan qué es lo que haría el Set object.Ahora que estamos abiertos al ES6 y sabemos que Map es el ganador de los juegos anteriores,comparemos Map con Set como una final.Un típico partido del Real Madrid contra el Barcelona esta vez...¿o no? Veamos quién ganará el clásico :)
ja: さて.........これで私たちは幸せになった。しかし、主役はいつも拍手喝采を受けて最後に来ます。あなたの中には、Set オブジェクトが何をするのか疑問に思っている人もいると思います。ES6に対応していて、Mapが以前のゲームの勝者であることがわかっているので、最終的にMapとSetを比較してみましょう。今回は典型的なレアルマドリード対バルセロナの試合です。エル・クラシコに勝つのは誰か見てみましょう :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자 이제 우리는 모두 행복합니다. </font><font style="vertical-align: inherit;">그러나 리드 역할은 항상 박수 갈채와 함께 끝납니다. </font><font style="vertical-align: inherit;">Set 객체가 무엇을하는지 궁금해 할 것입니다. </font><font style="vertical-align: inherit;">이제 ES6에 개방되어 있고 Map이 이전 게임의 승자라는 것을 알았으므로 Map을 Set과 최종 비교합니다. </font><font style="vertical-align: inherit;">이번에는 전형적인 레알 마드리드 vs 바르셀로나 경기입니다. </font><font style="vertical-align: inherit;">누가 엘 classico를 이길 지 보자 :)</font></font>
ru: Ну ладно,теперь мы все счастливы.Но главная роль всегда заканчивается аплодисментами.Уверен,некоторые из вас задаются вопросом,что бы сделал "Сет-объект".Теперь,когда мы открыты для ES6 и знаем,что Map-победитель предыдущих игр,давайте сравним Map с Set как финальный.Типичная игра "Реал Мадрид"-"Барселона" на этот раз...или это так? Давайте посмотрим,кто выиграет Эль Классико :)
zh_cn: 好了好了,大家都很高兴了。但主角总是最后才有一些掌声。我相信你们中一定有人想知道Set对象会做什么。既然我们现在开放到了ES6,而且我们知道Map是前几场比赛的赢家,那么就让我们把Map和Set作为决赛来比较一下。这次是一场典型的皇马对阵巴萨的比赛...........还是这样?让我们来看看谁会赢el classico :)

source: When I tested both implementation (with and without Set) for performance in chrome, I found that the one with Set is much much faster!
es: Cuando probé ambas implementaciones (con y sin Set)para el rendimiento en cromo,encontré que la que tiene Set es mucho más rápida!
ja: 両方の実装(Setのあるものとないもの)でクロームでのパフォーマンスをテストしてみたところ、Setのあるものの方がずっと速いことがわかりました!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">크롬의 성능에 대해 두 가지 구현 (Set 유무)을 테스트했을 때 Set이있는 것이 훨씬 빠릅니다.</font></font>
ru: Когда я тестировал обе реализации (с и без Set)для производительности в chrome,я обнаружил,что та,что с Set,намного быстрее!
zh_cn: 当我在chrome中测试这两种实现(有Set和没有Set)的性能时,我发现有Set的那一个要快得多!而有Set的那一个要快得多!我发现有Set的那一个要快得多。

source: When removing objects by a key, you might to want to keep the first of "equal" objects or the last one.
es: Al quitar los objetos con una llave,puede que quieras conservar el primero de los objetos "iguales" o el último.
ja: キーでオブジェクトを削除する場合、"イコール "オブジェクトの最初のものか、最後のものを残しておきたい場合があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">키로 객체를 제거 할 때 첫 번째 "동일한"객체 또는 마지막 객체를 유지하려고 할 수 있습니다.</font></font>
ru: При удалении объектов с помощью ключа,возможно,вам захочется сохранить первый из "равных" объектов или последний.
zh_cn: 当通过一个键删除对象时,你可能会想保留 "相等 "对象中的第一个或最后一个。

source: Which one would you use..? Well not so fast...! Don't be deceived. Map is at displacement. Now look... in all of the above cases we fill an array of size n with numbers of range &lt; n. I mean we have an array of size 100 and we fill with random numbers 0..9 so there are definite duplicates and "almost" definitely each number has a duplicate. How about if we fill the array in size 100 with random numbers 0..9999. Let's now see Map playing at home. This time an Array of 100K items but random number range is 0..100M. We will do 100 consecutive tests to average the results. OK let's see the bets..! &lt;- no typo
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Cu&aacute;l usar&iacute;as? </font><font style="vertical-align: inherit;">Pues no tan r&aacute;pido ...! </font><font style="vertical-align: inherit;">No te dejes enga&ntilde;ar. </font><font style="vertical-align: inherit;">El mapa est&aacute; en desplazamiento. </font><font style="vertical-align: inherit;">Ahora mire ... en todos los casos anteriores, llenamos una matriz de tama&ntilde;o n con n&uacute;meros de rango &lt;n. </font><font style="vertical-align: inherit;">Quiero decir que tenemos una matriz de tama&ntilde;o 100 y la llenamos con n&uacute;meros aleatorios 0..9, por lo que hay duplicados definidos y "casi" definitivamente cada n&uacute;mero tiene un duplicado. </font><font style="vertical-align: inherit;">&iquest;Qu&eacute; tal si llenamos la matriz en tama&ntilde;o 100 con n&uacute;meros aleatorios 0..9999. </font><font style="vertical-align: inherit;">Ahora veamos el mapa jugando en casa. </font><font style="vertical-align: inherit;">Esta vez, una matriz de 100K elementos pero el rango de n&uacute;meros aleatorios es 0..100M. </font><font style="vertical-align: inherit;">Haremos 100 pruebas consecutivas para promediar los resultados. </font><font style="vertical-align: inherit;">OK, veamos las apuestas ...! </font><font style="vertical-align: inherit;">&lt;- sin error tipogr&aacute;fico</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どちらを使いますか？</font><font style="vertical-align: inherit;">まあそれほど速くない...！</font><font style="vertical-align: inherit;">だまされてはいけません。</font><font style="vertical-align: inherit;">地図がずれています。</font><font style="vertical-align: inherit;">ここで見てください...上記のすべてのケースで、サイズnの配列に範囲&lt;nの数を入力します。</font><font style="vertical-align: inherit;">つまり、サイズ100の配列があり、乱数0..9で満たされているため、明確な重複があり、「ほぼ」確実に各数に重複があります。</font><font style="vertical-align: inherit;">サイズ100の配列に乱数0..9999を入力するとどうでしょうか。</font><font style="vertical-align: inherit;">家で遊んでいるマップを見てみましょう。</font><font style="vertical-align: inherit;">今回は100Kアイテムの配列ですが、乱数の範囲は0..100Mです。</font><font style="vertical-align: inherit;">結果を平均するために、100回連続してテストを行います。</font><font style="vertical-align: inherit;">OK賭けを見てみましょう。</font><font style="vertical-align: inherit;">&lt;-タイプミスなし</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어느 쪽을 사용 하시겠습니까?.? </font><font style="vertical-align: inherit;">너무 빠르지 않다 ...! </font><font style="vertical-align: inherit;">속지 마십시오. </font><font style="vertical-align: inherit;">지도가 변위되었습니다. </font><font style="vertical-align: inherit;">위의 모든 경우에서 우리는 범위 n의 숫자로 크기 n의 배열을 채 웁니다. </font><font style="vertical-align: inherit;">크기가 100 인 배열이 있고 임의의 숫자 0..9로 채워 지므로 명확한 중복이 있고 "거의"확실히 각 숫자에 중복이 있습니다. </font><font style="vertical-align: inherit;">크기가 100 인 배열을 난수 0..9999로 채우면 어떨까요? </font><font style="vertical-align: inherit;">이제 집에서지도 재생을 봅시다. </font><font style="vertical-align: inherit;">이번에는 100K 항목의 배열이지만 임의의 숫자 범위는 0..100M입니다. </font><font style="vertical-align: inherit;">결과를 평균화하기 위해 100 회 연속 테스트를 수행합니다. </font><font style="vertical-align: inherit;">좋아, 내기를 보자 ..! </font><font style="vertical-align: inherit;">&lt;-오타 없음</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Какой бы вы использовали ..? </font><font style="vertical-align: inherit;">Ну, не так быстро ...! </font><font style="vertical-align: inherit;">Не обманывайтесь. </font><font style="vertical-align: inherit;">Карта находится в смещении. </font><font style="vertical-align: inherit;">Теперь посмотрите ... во всех вышеупомянутых случаях мы заполняем массив размером n числами диапазона &lt;n. </font><font style="vertical-align: inherit;">Я имею в виду, что у нас есть массив размером 100, и мы заполняем случайными числами 0..9, так что есть определенные дубликаты, и &laquo;почти&raquo; определенно каждый номер имеет дубликат. </font><font style="vertical-align: inherit;">Как насчет того, чтобы заполнить массив размером 100 случайными числами 0 ... 9999. </font><font style="vertical-align: inherit;">Давайте теперь посмотрим, как карта играет дома. </font><font style="vertical-align: inherit;">На этот раз массив из 100 тысяч элементов, но диапазон случайных чисел равен 0..100M. </font><font style="vertical-align: inherit;">Мы сделаем 100 последовательных тестов, чтобы усреднить результаты. </font><font style="vertical-align: inherit;">Хорошо, давайте посмотрим ставки ..! </font><font style="vertical-align: inherit;">&lt;- без опечаток</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您将使用哪一个？</font><font style="vertical-align: inherit;">嗯，不是那么快...！</font><font style="vertical-align: inherit;">不要被欺骗。</font><font style="vertical-align: inherit;">地图处于位移状态。</font><font style="vertical-align: inherit;">现在看...在上述所有情况下，我们用范围&lt;n的数字填充大小为n的数组。</font><font style="vertical-align: inherit;">我的意思是我们有一个大小为100的数组，并且我们填充了随机数0..9，因此存在一定的重复项，并且&ldquo;几乎&rdquo;肯定每个数字都有重复项。</font><font style="vertical-align: inherit;">如果我们用随机数0..9999填充大小为100的数组，该怎么办。</font><font style="vertical-align: inherit;">现在让我们看看地图在家里玩。</font><font style="vertical-align: inherit;">这次是一个100K项的数组，但随机数范围是0..100M。</font><font style="vertical-align: inherit;">我们将进行100次连续测试以平均结果。</font><font style="vertical-align: inherit;">好，让我们看看下注吧！</font><font style="vertical-align: inherit;">&lt;-没有错字</font></font>

source: Wow that was short..! But how about the performance..? It's beautiful... Since the heavy weight of the filter / indexOf lifted over our shoulders now i can test an array 1M random items of positive integers in range 0..99999 to get an average from 10 consecutive tests. I can say this time it's a real match. See the result for yourself :)
es: ¡Wow,eso fue corto...! Pero,¿qué hay de la actuación ..? Es hermosa...Desde que el peso pesado del índice de filtro se levantó sobre nuestros hombros ahora puedo probar una serie de 1M de elementos aleatorios de números enteros positivos en el rango 0..99999 para obtener un promedio de 10 pruebas consecutivas.Puedo decir que esta vez es una coincidencia real.Vea el resultado por usted mismo :)
ja: うわぁ...短かった...!(吉森)でも演奏はどうなんだよ...美しい...フィルタ indexOf の重荷が肩の荷を降ろしてくれたので、範囲 0 ~ 99999 の正の整数の配列 100 万個のランダムな項目をテストして、10 回の連続テストから平均値を得ることができます。今回は本当に一致しました。自分のために結果を見てください :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">와아, 짧았 어 ..! </font><font style="vertical-align: inherit;">그러나 성능은 어떻습니까? </font><font style="vertical-align: inherit;">그것은 아름답습니다 ... 필터 / indexOf의 무거운 무게가 어깨 너머로 들어 올려 졌으므로 이제 0..99999 범위의 양의 정수로 구성된 1M 임의의 항목을 10 연속 테스트에서 평균을 얻기 위해 테스트 할 수 있습니다. </font><font style="vertical-align: inherit;">이번에는 실제 경기라고 말할 수 있습니다. </font><font style="vertical-align: inherit;">자신에 대한 결과를 참조하십시오 :)</font></font>
ru: Вау,это было коротко...! Но как насчет представления...? Оно прекрасно...Так как большой вес фильтра indexOf поднялся над нашими плечами,то теперь я могу протестировать массив 1M случайных элементов из положительных целых чисел в диапазоне 0...99999,чтобы получить среднее из 10 последовательных тестов.Могу сказать,что на этот раз это реальное совпадение.Посмотрите на результат :)
zh_cn: 哇,好短啊!但是表演怎么样......?真漂亮.....自从滤波器indexOf的重担被卸下后,现在我可以测试一个范围为0...9999999的100万个正整数的随机数组,从连续10次测试中得到一个平均值。我可以说这一次是真正的匹配。自己看结果吧 :)

source: Wow.. man..! Well unexpectedly it didn't turn out to be an el classico at all. More like Barcelona FC against CA Osasuna :))
es: Wow ..hombre ..! Bueno,inesperadamente no resultó ser un "El Clásico" en absoluto.Más bien el Barcelona FC contra el CA Osasuna :))
ja: うわぁ......男.....! 意外とエル・クラシコにはならなかったな。バルセロナFC対CAオサスナのような試合になってしまった。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">와우 .. 남자!.! </font><font style="vertical-align: inherit;">예기치 않게 그것은 엘 클래식으로 밝혀지지 않았습니다. </font><font style="vertical-align: inherit;">CA Osasuna에 대한 바르셀로나 FC처럼 더 :))</font></font>
ru: Ух ты...мужик! Ну,неожиданно оказалось,что это вовсе не Эль Классико.Больше похоже на ФК "Барселона" против КА Осасуна :)))
zh_cn: 哇........天啊!没想到的是,这根本就不是一场el classico的比赛。更像是巴萨FC对阵CA奥萨苏纳的比赛。)

source: Yet another ES6(2015) way of doing this that already works on a few browsers is:
es: Otra forma de hacer esto que ya funciona en algunos navegadores es:
ja: すでにいくつかのブラウザで動作しているES6(2015)の別の方法があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 몇 가지 브라우저에서 이미 작동하는 또 다른 ES6 (2015) 방법은 다음과 같습니다.</font></font>
ru: Еще один способ ES6(2015),который уже работает на нескольких браузерах:
zh_cn: 然而,ES6(2015)的另一种方法已经在一些浏览器上实现了,那就是。

source: You can always try putting it into an object, and then iterating through its keys:
es: Siempre puedes intentar ponerlo en un objeto,y luego iterar a través de sus teclas:
ja: これをオブジェクトに入れて、そのキーを反復してみるのもいいでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상 객체에 객체를 넣고 키를 반복하여 시도 할 수 있습니다.</font></font>
ru: Вы всегда можете попробовать поместить его в объект,а затем выполнить итерацию с помощью его клавиш:
zh_cn: 你总是可以尝试把它放到一个对象中,然后通过它的键进行迭代。

source: You can simply do it in JavaScript, with the help of the second - index - parameter of the <code>filter</code> method:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simplemente puede hacerlo en JavaScript, con la ayuda del segundo par&aacute;metro - &iacute;ndice - del </font><font style="vertical-align: inherit;">m&eacute;todo de </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドの</font><font style="vertical-align: inherit;">2番目の-index-パラメータを使用して、JavaScriptで簡単に実行できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">의 두 번째-인덱스-매개 변수를 사용하여 JavaScript로 간단하게 수행 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете просто сделать это в JavaScript, с помощью второго - index - параметра </font><font style="vertical-align: inherit;">метода </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以借助</font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">的第二个参数-index-轻松地在JavaScript中完成此操作</font><font style="vertical-align: inherit;">：</font></font>

source: You could do
es: Podrías hacer
ja: あなたならできる
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">넌 할 수있어</font></font>
ru: Ты можешь сделать
zh_cn: 你可以做的

source: declarative and succinct implementation
es: aplicación declarativa y sucinta
ja: 宣言的簡潔実装
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선언적이고 간결한 구현</font></font>
ru: декларативное и краткое осуществление
zh_cn: 言简意赅

source: for the same reason, all objects will be considered equal: <code>uniq([{foo:1},{foo:2}])</code> will return just <code>[{foo:1}]</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">por la misma raz&oacute;n, todos los objetos se considerar&aacute;n iguales: </font></font> <code>uniq([{foo:1},{foo:2}])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&aacute; solo </font></font> <code>[{foo:1}]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じ理由で、すべてのオブジェクトは等しいと見なされます</font></font> <code>uniq([{foo:1},{foo:2}])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>[{foo:1}]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみを返し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은 이유로 모든 객체는 동일한 것으로 간주됩니다 : </font></font> <code>uniq([{foo:1},{foo:2}])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>[{foo:1}]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 반환 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">по той же причине все объекты будут считаться равными: </font></font> <code>uniq([{foo:1},{foo:2}])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет просто </font></font> <code>[{foo:1}]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出于相同的原因，所有对象都将被视为相等：</font></font> <code>uniq([{foo:1},{foo:2}])</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅返回</font></font> <code>[{foo:1}]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: generic solution by using a separate comparator function
es: solución genérica mediante el uso de una función de comparación separada
ja: 別のコンパレータ関数を使用した汎用的なソリューション
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">별도의 비교기 기능을 사용하는 일반적인 솔루션</font></font>
ru: общее решение с использованием отдельной функции компаратора
zh_cn: 通过使用一个单独的比较器函数来实现通用的解决方案

source: if it's been seen already, skip it
es: si ya ha sido visto,sáltatelo
ja: 見たことあるなら飛ばせばいい
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 보이면 건너 뛰십시오</font></font>
ru: если его уже видели,пропустите его.
zh_cn: 既然已经看过了,那就不看了
