Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>here is the simple method without any special libraries are special function,</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; est&aacute; el m&eacute;todo simple sin ninguna biblioteca especial son funciones especiales,</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここに、特別なライブラリなしの簡単な方法があります特別な関数です、</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">특별한 라이브러리가없는 간단한 방법은 특별한 기능입니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вот простой метод без каких-либо специальных библиотек, специальные функции,</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是简单的方法，没有任何特殊的库是特殊的功能，</font></font></strong>

source: A "lazy", generator-based version of <code>uniq</code> can be built on the same basis:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una versi&oacute;n "unzy", basada en generador de </font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede construir sobre la misma base:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「怠惰な」ジェネレータベースのバージョンの</font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も同じように構築できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"게으른"발전기 기반 버전의 </font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 같은 기준으로 구축 될 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&laquo;Ленивая&raquo; версия </font></font> <code>uniq</code> для<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> генератора </font><font style="vertical-align: inherit;">может быть построена на той же основе:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A&ldquo;懒&rdquo;，基于生成器的版本</font></font> <code>uniq</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可建在同一基础上：</font></font>

source: A particularly useful <code>key()</code> is <code>JSON.stringify</code> which will remove objects that are physically different, but "look" the same:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una </font></font> <code>key()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> particularmente &uacute;til </font><font style="vertical-align: inherit;">()</font><font style="vertical-align: inherit;"> es </font></font> <code>JSON.stringify</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que eliminar&aacute; los objetos que son f&iacute;sicamente diferentes, pero "se ven" igual:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特に有用な</font></font> <code>key()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>JSON.stringify</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で、物理的には異なるが同じように見えるオブジェクトを削除します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">특히 유용한 </font></font> <code>key()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>JSON.stringify</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로, 물리적으로 다른 객체를 제거하지만 "같은"객체를 제거합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Особенно полезным </font></font> <code>key()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font> <code>JSON.stringify</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который удаляет объекты, которые физически отличаются, но &laquo;выглядят&raquo; одинаково:</font></font>
zh_cn: <font style="vertical-align: inherit;"> <code>JSON.stringify</code> <font style="vertical-align: inherit;">是</font><font style="vertical-align: inherit;">一个特别有用的</font></font> <code>key()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它将删除物理上不同但&ldquo;看起来&rdquo;相同的对象：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: A simple but effective technique, is to use the <code>filter</code> method in combination with the filter <code>function(value, index){ return this.indexOf(value) == index }</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una t&eacute;cnica simple pero efectiva es utilizar el </font><font style="vertical-align: inherit;">m&eacute;todo de </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en combinaci&oacute;n con la </font></font> <code>function(value, index){ return this.indexOf(value) == index }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> filtro </font><font style="vertical-align: inherit;">(valor, &iacute;ndice) {return this.indexOf (value) == index}</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シンプルですが効果的な手法は、</font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドをfilter </font></font> <code>function(value, index){ return this.indexOf(value) == index }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と組み合わせ</font><font style="vertical-align: inherit;">て使用すること</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단하지만 효과적인 방법, 사용하는 </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 필터와 조합 방법 </font></font> <code>function(value, index){ return this.indexOf(value) == index }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Простой, но эффективный метод заключается в использовании </font><font style="vertical-align: inherit;">метода </font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в сочетании с </font></font> <code>function(value, index){ return this.indexOf(value) == index }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> фильтра </font><font style="vertical-align: inherit;">(значение, индекс) {return this.indexOf (значение) == индекс}</font><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一种简单但有效的技术是将</font></font> <code>filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法与filter </font></font> <code>function(value, index){ return this.indexOf(value) == index }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: A single line version using array filter and indexOf functions:
es: Una versión de una sola línea que utiliza funciones de filtro de matriz e índice:
ja: 配列フィルタとindexOf関数を使った一行バージョン。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 필터 및 indexOf 함수를 사용하는 단일 라인 버전 :</font></font>
ru: Однострочная версия с использованием массивного фильтра и функций indexOf:
zh_cn: 一个使用数组过滤器和indexOf函数的单行版本。

source: A slight modification of thg435's excellent answer to use a custom comparator:
es: Una ligera modificación de la excelente respuesta de thg435 para usar un comparador personalizado:
ja: カスタムコンパレータを使用するために、thg435さんの素晴らしい回答を少し修正しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커스텀 비교기를 사용하는 thg435의 탁월한 답변의 약간 수정 :</font></font>
ru: Небольшая модификация отличного ответа thg435 на использование пользовательского компаратора:
zh_cn: 略微修改一下THG435的优秀答案,使用自定义比较器。

source: A universal solution combines both approaches: it uses hash lookups for primitives and linear search for objects.
es: Una solución universal combina ambos enfoques:utiliza búsquedas de hachís para los primitivos y la búsqueda lineal de objetos.
ja: ユニバーサルソリューションは、プリミティブのハッシュ検索とオブジェクトの線形検索の両方のアプローチを組み合わせたものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">범용 솔루션은 두 가지 접근 방식을 결합합니다. 프리미티브에 해시 조회를 사용하고 객체에 대한 선형 검색을 사용합니다.</font></font>
ru: Универсальное решение сочетает в себе оба подхода:в нем используются хэш-поиски примитивов и линейный поиск объектов.
zh_cn: 一个通用的解决方案结合了这两种方法:它使用哈希查找基元和线性搜索对象的方法。

source: Again, this doesn't work with objects (because all objects are equal for <code>sort</code>). Additionally, we silently change the original array as a side effect - not good! However, if your input is already sorted, this is the way to go (just remove <code>sort</code> from the above).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nuevamente, esto no funciona con objetos (porque todos los objetos son iguales para la </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Adem&aacute;s, cambiamos silenciosamente la matriz original como efecto secundario, &iexcl;no es bueno! </font><font style="vertical-align: inherit;">Sin embargo, si su entrada ya est&aacute; ordenada, este es el camino a seguir (simplemente elimine la </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de lo anterior).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">繰り返しますが、これはオブジェクトでは機能しません（すべてのオブジェクトが</font></font> <code>sort</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等しいため</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">さらに、副作用として元の配列を黙って変更します-良くありません！</font><font style="vertical-align: inherit;">ただし、入力がすでに並べ替えられている場合は、これが方法です（</font><font style="vertical-align: inherit;">上記の</font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">削除するだけ</font><font style="vertical-align: inherit;">です）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다시 말하지만 객체와는 작동하지 않습니다 (모든 객체가 </font></font> <code>sort</code> 와<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동일하기 때문에 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">또한 원래 배열을 부작용으로 자동 변경합니다. 좋지 않습니다! </font><font style="vertical-align: inherit;">그러나 입력이 이미 정렬 된 경우이 방법입니다 ( </font><font style="vertical-align: inherit;">위에서 </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">제거하십시오 </font><font style="vertical-align: inherit;">).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Опять же, это не работает с объектами (потому что все объекты равны для </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Кроме того, мы молча меняем исходный массив как побочный эффект - не хорошо! </font><font style="vertical-align: inherit;">Однако, если ваш ввод уже отсортирован, это путь (просто удалите </font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из вышеупомянутого).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同样，这不适用于对象（因为所有对象的</font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相等</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">此外，我们无声地更改了原始数组，这是一个副作用-不好！</font><font style="vertical-align: inherit;">但是，如果您的输入已经排序，这就是方法（只需</font><font style="vertical-align: inherit;">从上面</font><font style="vertical-align: inherit;">删除</font></font> <code>sort</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: Although ES6 Solution is the best, I'm baffled as to how nobody has shown the following solution:
es: Aunque la solución ES6 es la mejor,estoy desconcertado de cómo nadie ha mostrado la siguiente solución:
ja: ES6ソリューションは最高なのですが、以下のようなソリューションを誰も示していないことに困惑しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 솔루션이 최고이지만, 아무도 다음 솔루션을 보여주지 못한 것에 대해 당황합니다.</font></font>
ru: Несмотря на то,что решение ES6-лучшее,я озадачен тем,что никто не показал следующее решение:
zh_cn: 虽然ES6的解决方案是最好的,但我很困惑的是,为什么没有人提出以下解决方案。

source: Although concise, this algorithm is not particularly efficient for large arrays (quadratic time).
es: Aunque es conciso,este algoritmo no es particularmente eficiente para las grandes matrices (tiempo cuadrático).
ja: 簡潔ではありますが、このアルゴリズムは大規模な配列(二次時間)に対しては特に効率的ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간결하지만이 알고리즘은 특히 큰 배열 (2 차 시간)에는 효율적이지 않습니다.</font></font>
ru: Несмотря на лаконичность,этот алгоритм не особенно эффективен для больших массивов (квадратичное время).
zh_cn: 这种算法虽然简洁,但对于大数组(二次元时间)来说,效率并不是特别高。

source: Another option is to sort the array first, and then remove each element equal to the preceding one:
es: Otra opción es ordenar primero la matriz y luego eliminar cada elemento igual al anterior:
ja: もう一つの方法は、最初に配列をソートしてから、その前の要素と同じ要素を削除することです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 옵션은 배열을 먼저 정렬 한 다음 이전 요소와 동일한 각 요소를 제거하는 것입니다.</font></font>
ru: Другой вариант-сначала отсортировать массив,а затем удалить каждый элемент,равный предыдущему:
zh_cn: 另一种方法是先对数组进行排序,然后将每一个与前面的元素相等的元素删除。

source: Apart from being a simpler, more terse solution than the current answers (minus the future-looking ES6 ones), I perf tested this and it was much faster as well:
es: Aparte de ser una solución más simple y concisa que las respuestas actuales (menos las del futuro ES6),la probé y fue mucho más rápida también:
ja: 現在の解答よりもシンプルで簡潔な解答であることは別にして、(将来的なES6の解答を除いて)、私はこれをPerfテストして、それは同様にはるかに速かったです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 답변 (미래의 ES6 답변을 뺀 것)보다 간단하고 간결한 솔루션 외에도이 성능을 테스트했으며 훨씬 빨랐습니다.</font></font>
ru: Помимо того,что я был более простым и лаконичным решением,чем текущие ответы (минус будущие ответы ES6),я проверил это,и это было намного быстрее:
zh_cn: 除了比现在的答案更简单,更简洁的解决方案(减去了未来的ES6的答案),我敷衍了事,而且速度也快了很多。

source: Basically, we iterate over the array and, for each element, check if the first position of this element in the array is equal to the current position. Obviously, these two positions are different for duplicate elements.
es: Básicamente,iteramos sobre la matriz y,para cada elemento,comprobamos si la primera posición de este elemento en la matriz es igual a la posición actual.Obviamente,estas dos posiciones son diferentes para los elementos duplicados.
ja: 基本的には,配列を反復処理し,各要素について,配列内のこの要素の最初の位置が現在の位置と等しいかどうかをチェックします.明らかに、これら2つの位置は重複した要素については異なります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 배열을 반복하고 각 요소에 대해 배열에서이 요소의 첫 번째 위치가 현재 위치와 같은지 확인합니다. </font><font style="vertical-align: inherit;">분명히이 두 위치는 중복 요소에 대해 다릅니다.</font></font>
ru: В основном,мы делаем итерации по массиву и для каждого элемента проверяем,совпадает ли первая позиция этого элемента в массиве с текущей позицией.Очевидно,что эти две позиции различны для дублирующих элементов.
zh_cn: 基本上,我们对数组进行迭代,对于每个元素,检查这个元素在数组中的第一个位置是否等于当前位置。很明显,这两个位置对于重复的元素是不同的。

source: Bear in mind though that this also sorts the array.
es: Tengan en cuenta,sin embargo,que esto también clasifica el conjunto.
ja: しかし、これも配列をソートすることに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 또한 배열을 정렬한다는 것을 명심하십시오.</font></font>
ru: Имейте в виду,что это также сортирует массив.
zh_cn: 但请记住,这也是对阵列进行分类。

source: Benefits of this approach:
es: Beneficios de este enfoque:
ja: この方法のメリット。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법의 장점 :</font></font>
ru: Преимущества такого подхода:
zh_cn: 这种方法的好处:

source: Both <a href="http://underscorejs.org/#uniq">underscore</a> and <a href="https://lodash.com/docs#uniq">Lo-Dash</a> provide <code>uniq</code> methods. Their algorithms are basically similar to the first snippet above and boil down to this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tanto el </font></font><a href="http://underscorejs.org/#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subrayado</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como </font></font><a href="https://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> proporcionan </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Sus algoritmos son b&aacute;sicamente similares al primer fragmento de arriba y se reducen a esto:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://underscorejs.org/#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アンダースコア</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">どちらも</font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">提供し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">それらのアルゴリズムは基本的に上記の最初のスニペットに似ており、要約すると次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모두 </font></font><a href="http://underscorejs.org/#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">밑줄</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소호 - 대시</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 제공 </font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법. </font><font style="vertical-align: inherit;">그들의 알고리즘은 기본적으로 위의 첫 번째 스 니펫과 비슷하며 다음과 같이 요약됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И </font></font><a href="http://underscorejs.org/#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подчеркивание,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предоставляют </font></font> <code>uniq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> методы. </font><font style="vertical-align: inherit;">Их алгоритмы в основном аналогичны первому фрагменту выше и сводятся к следующему:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无论</font></font><a href="http://underscorejs.org/#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下划线</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">罗短跑</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提供</font></font> <code>uniq</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">他们的算法基本上类似于上面的第一个代码片段，归结为：</font></font>

source: Code example :
es: Ejemplo de código :
ja: コード例 .
ko: 코드 예 :
ru: Пример кода :
zh_cn: 代码示例。

source: Demo: <a href="http://jsfiddle.net/46S7g/">http://jsfiddle.net/46S7g/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Demostraci&oacute;n: </font></font><a href="http://jsfiddle.net/46S7g/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/46S7g/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デモ：</font><a href="http://jsfiddle.net/46S7g/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/46S7g/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데모 : </font></font><a href="http://jsfiddle.net/46S7g/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/46S7g/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Демо: </font></font><a href="http://jsfiddle.net/46S7g/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/46S7g/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示：</font><a href="http://jsfiddle.net/46S7g/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//jsfiddle.net/46S7g/</font></font>
