Repository: rueisnom/feedback
Catalog: xlf/92/29/64/5/9229645.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Smart" but na&iuml;ve way
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Forma "inteligente" pero ingenua</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「スマート」だが素朴な方法</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"스마트"하지만 순진한 방법</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&laquo;Умный&raquo;, но наивный способ</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;聪明&rdquo;但幼稚的方式</font></font>

source: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter">Here</a> is nice explanation of <code>Array.filter()</code>
es: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay una buena explicaci&oacute;n de </font></font> <code>Array.filter()</code>
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font> <code>Array.filter()</code> の<font style="vertical-align: inherit;">良い説明があり</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font>
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font> <code>Array.filter()</code> <font style="vertical-align: inherit;"> 대한 좋은 설명입니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> хорошее объяснение </font></font> <code>Array.filter()</code>
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font> <code>Array.filter()</code> 的<font style="vertical-align: inherit;">很好的解释</font></font><font style="vertical-align: inherit;"></font>

source: <code>_.uniq(array, [isSorted], [iterator])</code><em>Alias:</em><strong>unique</strong>
es: <code>_.uniq(array, [isSorted], [iterator])</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Alias: </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&uacute;nico</font></font></strong>
ja: <code>_.uniq(array, [isSorted], [iterator])</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エイリアス：</font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一意</font></font></strong>
ko: <code>_.uniq(array, [isSorted], [iterator])</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">별칭 : </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고유</font></font></strong>
ru: <code>_.uniq(array, [isSorted], [iterator])</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Псевдоним: </font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">уникальный</font></font></strong>
zh_cn: <code>_.uniq(array, [isSorted], [iterator])</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">别名：</font></font></em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">唯一</font></font></strong>

source: <code>uniqueBy</code> isn't as fast as an imperative implementation with loops, but it is way more expressive due to its genericity.
es: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no es tan r&aacute;pido como una implementaci&oacute;n imperativa con bucles, pero es mucho m&aacute;s expresivo debido a su car&aacute;cter gen&eacute;rico.</font></font>
ja: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、ループを使用した命令型の実装ほど高速ではありませんが、その汎用性により、より表現力があります。</font></font>
ko: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 루프를 사용하여 명령형 구현만큼 빠르지는 않지만 </font><font style="vertical-align: inherit;">일반적으로 표현력</font><font style="vertical-align: inherit;"> 이 </font><font style="vertical-align: inherit;">뛰어납니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не так быстр, как императивная реализация с циклами, но он более выразителен благодаря своей универсальности.</font></font>
zh_cn: <code>uniqueBy</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">速度不如带有循环的命令式实现快，但由于其通用性，它的表达方式更加出色。</font></font>

source: <code>uniqueBy</code> utilizes mutations (<code>push(x) (acc)</code>) hidden inside its body. It reuses the accumulator instead of throwing it away after each iteration. This reduces memory consumption and GC pressure. Since this side effect is wrapped inside the function, everything outside remains pure.
es: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> utiliza mutaciones ( </font></font> <code>push(x) (acc)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) ocultas dentro de su cuerpo. </font><font style="vertical-align: inherit;">Reutiliza el acumulador en lugar de tirarlo despu&eacute;s de cada iteraci&oacute;n. </font><font style="vertical-align: inherit;">Esto reduce el consumo de memoria y la presi&oacute;n del GC. </font><font style="vertical-align: inherit;">Dado que este efecto secundario est&aacute; envuelto dentro de la funci&oacute;n, todo lo que queda afuera permanece puro.</font></font>
ja: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">、その本体内に隠された</font><font style="vertical-align: inherit;">突然変異（</font></font> <code>push(x) (acc)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">利用し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">アキュムレータは、繰り返しごとに捨てるのではなく、再利用します。</font><font style="vertical-align: inherit;">これにより、メモリの消費とGCの負荷が軽減されます。</font><font style="vertical-align: inherit;">この副作用は関数の内側にラップされているため、外側はすべて純粋なままです。</font></font>
ko: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><font style="vertical-align: inherit;">몸 안에 숨겨진 </font><font style="vertical-align: inherit;">돌연변이 ( </font></font> <code>push(x) (acc)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )를 사용합니다. </font><font style="vertical-align: inherit;">각 반복 후에 누적기를 버리지 않고 누적기를 재사용합니다. </font><font style="vertical-align: inherit;">이것은 메모리 소비와 GC 압력을 줄입니다. </font><font style="vertical-align: inherit;">이 부작용은 함수 안에 싸여 있기 때문에 외부의 모든 것은 순수하게 유지됩니다.</font></font>
ru: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использует мутации ( </font></font> <code>push(x) (acc)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), скрытые внутри его тела. </font><font style="vertical-align: inherit;">Он использует аккумулятор вместо того, чтобы выбрасывать его после каждой итерации. </font><font style="vertical-align: inherit;">Это уменьшает потребление памяти и давление ГХ. </font><font style="vertical-align: inherit;">Поскольку этот побочный эффект находится внутри функции, все снаружи остается чистым.</font></font>
zh_cn: <code>uniqueBy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">利用</font><font style="vertical-align: inherit;">隐藏在其体内的</font><font style="vertical-align: inherit;">变异（</font></font> <code>push(x) (acc)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">它重复使用累加器，而不是在每次迭代后将其丢弃。</font><font style="vertical-align: inherit;">这样可以减少内存消耗和GC压力。</font><font style="vertical-align: inherit;">由于此副作用包含在函数内部，因此外部的所有内容都保持纯净。</font></font>

source: <em>Note: <a href="http://lodash.com">Lo-Dash</a> (an <a href="http://underscorejs.org/">underscore</a> competitor) also offers a comparable <a href="http://lodash.com/docs#uniq">.uniq</a> implementation.</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota: </font></font><a href="http://lodash.com"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (un </font><font style="vertical-align: inherit;">competidor de </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subrayado</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) tambi&eacute;n ofrece una </font><font style="vertical-align: inherit;">implementaci&oacute;n </font><font style="vertical-align: inherit;">comparable </font></font><a href="http://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.uniq</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：</font></font><a href="http://lodash.com"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アンダースコアの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">競合）も、同等の</font></font><a href="http://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.uniq</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装を</font><font style="vertical-align: inherit;">提供しています</font><font style="vertical-align: inherit;">。</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : </font></font><a href="http://lodash.com"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">밑줄</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경쟁 업체)도 비슷한 </font></font><a href="http://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.uniq</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구현을 </font><font style="vertical-align: inherit;">제공합니다 </font><font style="vertical-align: inherit;">.</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание: </font></font><a href="http://lodash.com"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font><font style="vertical-align: inherit;">конкурент </font><font style="vertical-align: inherit;">с </font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подчеркиванием</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) также предлагает сопоставимую </font><font style="vertical-align: inherit;">реализацию </font></font><a href="http://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.uniq</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：</font></font><a href="http://lodash.com"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo-Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="http://underscorejs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下划线</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">竞争对手）还提供了类似的</font></font><a href="http://lodash.com/docs#uniq"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.uniq</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实现。</font></font></em>

source: <strong>2019 edit:</strong> Modern versions of JavaScript make this a much easier problem to solve. Using <code>Set</code> will work, regardless of whether your array contains objects, strings, numbers, or any other type.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Edici&oacute;n de 2019: las</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> versiones modernas de JavaScript hacen que este sea un problema mucho m&aacute;s f&aacute;cil de resolver. </font><font style="vertical-align: inherit;">El uso de </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funcionar&aacute;, independientemente de si su matriz contiene objetos, cadenas, n&uacute;meros o cualquier otro tipo.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2019編集：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScriptの最新バージョンでは、これを解決するのがはるかに簡単な問題になっています。</font><font style="vertical-align: inherit;">配列にオブジェクト、文字列、数値、その他の型が含まれているかどうかに関係なく、</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">できます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2019 년 편집 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 최신 버전의 JavaScript를 사용하면이 문제를 훨씬 쉽게 해결할 수 있습니다. </font><font style="vertical-align: inherit;">배열에 객체, 문자열, 숫자 또는 다른 유형이 포함되어 있는지 여부에 관계없이 </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하면 작동합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Редактирование 2019 года:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> современные версии JavaScript значительно облегчают решение этой проблемы. </font><font style="vertical-align: inherit;">Использование </font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет работать независимо от того, содержит ли ваш массив объекты, строки, числа или любой другой тип.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2019编辑：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现代版本的JavaScript使这个问题更容易解决。</font><font style="vertical-align: inherit;">无论您的数组包含对象，字符串，数字还是任何其他类型，都可以</font><font style="vertical-align: inherit;">使用</font></font> <code>Set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行工作。</font></font>

source: <strong>ECMAScript 6: Use the new Set data structure (order-safe)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6: Use la nueva estructura de datos Set (orden segura)</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6：新しいSetデータ構造を使用する（注文セーフ）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 : 새로운 Set 데이터 구조 사용 (주문 안전)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6: Использовать новую структуру данных Set (в порядке заказа)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6：使用新的Set数据结构（顺序安全）</font></font></strong>

source: <strong>Example usage:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo de uso:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用例：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용법 예 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример использования:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用法示例：</font></font></strong>

source: <strong>Solution 1</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n 1</font></font></strong>
ja: <strong>解決策1</strong>
ko: <strong>해결책 1</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение 1</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案1</font></font></strong>

source: <strong>Solution 2 (using Set)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n 2 (usando Set)</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション2（セットを使用）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">솔루션 2 (세트 사용)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение 2 (используя Set)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案2（使用设置）</font></font></strong>

source: <strong>This is probably one of the fastest way to remove permanently the duplicates from an array</strong> 10x times faster than the most functions here.&amp; 78x faster in safari
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta es probablemente una de las formas m&aacute;s r&aacute;pidas de eliminar permanentemente los duplicados de una matriz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 10 veces m&aacute;s r&aacute;pido que la mayor&iacute;a de las funciones aqu&iacute;. Y 78 veces m&aacute;s r&aacute;pido en safari</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これはおそらく</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 、ここにあるほとんどの関数よりも10倍高速に</font><strong><font style="vertical-align: inherit;">配列から重複を永久に削除する最も速い方法の1つ</font></strong><font style="vertical-align: inherit;">です。＆サファリでは78倍高速</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 아마도</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가장 많은 기능보다 10 배나 빠른 </font><strong><font style="vertical-align: inherit;">배열에서 복제본을 영구적으로 제거하는 가장 빠른 방법 중 하나 일 것입니다</font></strong><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это, вероятно, один из самых быстрых способов постоянного удаления дубликатов из массива в</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 10 раз быстрее, чем большинство функций здесь. И в 78 раз быстрее в сафари.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这可能是从阵列中永久删除重复项的最快方法之一，</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 比此处的大多数功能快10倍。在Safari中快78倍。</font></font>

source: <strong>Vanilla JS: Remove duplicates by tracking already seen values (order-safe)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS: elimine los duplicados siguiendo los valores ya vistos (orden segura)</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS：すでに見られた値を追跡することで重複を削除します（注文セーフ）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바닐라 JS : 이미 본 값을 추적하여 중복 제거 (주문 안전)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS: удаление дубликатов путем отслеживания уже увиденных значений (в порядке заказа)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS：通过跟踪已经看到的值来删除重复项（顺序安全）</font></font></strong>

source: <strong>Vanilla JS: Remove duplicates using an Object like a Set</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS: eliminar duplicados utilizando un objeto como un conjunto</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バニラJS：セットのようなオブジェクトを使用して重複を削除する</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바닐라 JS : 세트와 같은 객체를 사용하여 중복 제거</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS: удаляйте дубликаты, используя объект типа Set</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vanilla JS：使用类似Set的对象删除重复项</font></font></strong>
