Repository: rueisnom/feedback
Catalog: xlf/16/28/08/8/1628088.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: * assumes your .git files aren't corrupt
es: *asume que tus archivos .git no están corruptos
ja: *.git ファイルが壊れていないことを前提にしています。
ko: * .git 파일이 손상되지 않은 것으로 가정
ru: *предполагает,что ваши git-файлы не повреждены *
zh_cn: *假设你的.git文件没有损坏。

source: <code>git clean -d --force</code><sub><sup>Removes untracked files and directories which hinder git to say &ldquo;working directory clean&rdquo;.</sup></sub>
es: <code>git clean -d --force</code> <sub><sup>Elimina archivos y directorios no rastreados que dificultan que git diga "limpieza de directorio de trabajo".</sup></sub>
ja: <code>git clean -d --force</code> <sub><sup>gitが「working directory clean」と言うのを妨げている追跡されていないファイルとディレクトリを削除します。</sup></sub>
ko: <code>git clean -d --force</code> <sub><sup>추적 할 수없는 파일과 디렉토리를 제거하여 git이&ldquo;작업 디렉토리 정리&rdquo;라고 말하지 못하게합니다.</sup></sub>
ru: <code>git clean -d --force</code> <sub><sup>--force Удаляет неотслеживаемые файлы и каталоги, которые мешают git сказать &laquo;очистить рабочий каталог&raquo;.</sup></sub>
zh_cn: <code>git clean -d --force</code> <sub><sup>删除妨碍git说&ldquo;工作目录干净&rdquo;的未跟踪文件和目录。</sup></sub>

source: <code>git fetch --prune</code><sub><sup>(optional) Updates the local snapshot of the remote repo. Further commands are local only.</sup></sub>
es: <code>git fetch --prune</code> <sub><sup>(opcional) Actualiza la instant&aacute;nea local del repositorio remoto.</sup></sub> <sub><sup>Otros comandos son solo locales.</sup></sub>
ja: <code>git fetch --prune</code> <sub><sup>（オプション）リモートリポジトリのローカルスナップショットを更新します。</sup></sub> <sub><sup>その他のコマンドはローカルのみです。</sup></sub>
ko: <code>git fetch --prune</code> <sub><sup>(선택 사항) 원격 저장소의 로컬 스냅 샷을 업데이트합니다.</sup></sub> <sub><sup>추가 명령은 로컬 전용입니다.</sup></sub>
ru: <code>git fetch --prune</code> <sub><sup>(необязательно)</sup></sub> Обновляет <sub><sup>локальный снимок удаленного репо.</sup></sub> <sub><sup>Дальнейшие команды только локальные.</sup></sub>
zh_cn: <code>git fetch --prune</code> <sub><sup>（可选）更新远程存储库的本地快照。</sup></sub> <sub><sup>其他命令仅在本地。</sup></sub>

source: <code>git fetch origin</code> downloads the latest from remote without trying to merge or rebase anything.
es: <code>git fetch origin</code> descarga lo &uacute;ltimo desde el control remoto sin intentar fusionar o volver a crear nada.
ja: <code>git fetch origin</code> は、何もマージしたりリベースしたりすることなく、リモートから最新のものをダウンロードします。
ko: <code>git fetch origin</code> 은 아무것도 병합하거나 리베이스하지 않고 원격에서 최신 버전을 다운로드합니다.
ru: <code>git fetch origin</code> загружает последние с удаленного, не пытаясь объединить или перебазировать что-либо.
zh_cn: <code>git fetch origin</code> 可以从远程下载最新版本，而无需尝试合并或重新设置任何内容。

source: <code>git reset --hard @{upstream}</code><sub><sup>Puts the local branch pointer to where the snapshot of the remote is, as well as set the index and the working directory to the files of that commit.</sup></sub>
es: <code>git reset --hard @{upstream}</code> <sub><sup>Coloca el puntero de la rama local donde se encuentra la instant&aacute;nea del control remoto, as&iacute; como establece el &iacute;ndice y el directorio de trabajo en los archivos de esa confirmaci&oacute;n.</sup></sub>
ja: <code>git reset --hard @{upstream}</code> <sub><sup>ローカルブランチポインターをリモートのスナップショットの場所に</sup></sub> 置き <sub><sup>、インデックスと作業ディレクトリをそのコミットのファイルに設定します。</sup></sub>
ko: <code>git reset --hard @{upstream}</code> <sub><sup>로컬 브랜치 포인터를 리모트의 스냅 샷이있는 위치에두고 인덱스 및 작업 디렉토리를 해당 커밋 파일로 설정합니다.</sup></sub>
ru: <code>git reset --hard @{upstream}</code> <sub><sup>Переносит локальный указатель ветки туда, где находится снимок удаленного компьютера, а также устанавливает индекс и рабочий каталог для файлов этого коммита.</sup></sub>
zh_cn: <code>git reset --hard @{upstream}</code> <sub><sup>将本地分支指针放置到远程快照的位置，并将索引和工作目录设置为该提交的文件。</sup></sub>

source: <code>git reset --hard HEAD</code> actually only resets to the last committed state. In this case HEAD refers to the HEAD of your branch.
es: <code>git reset --hard HEAD</code> en realidad solo se restablece al &uacute;ltimo estado comprometido. En este caso, HEAD se refiere a la HEAD de su rama.
ja: <code>git reset --hard HEAD</code> は、実際には最後にコミットされた状態にのみリセットされます。 この場合、HEADはブランチのHEADを指します。
ko: <code>git reset --hard HEAD</code> 는 실제로 마지막 커밋 된 상태로만 재설정합니다. 이 경우 HEAD는 지점의 HEAD를 나타냅니다.
ru: <code>git reset --hard HEAD</code> фактически сбрасывает только до последнего зафиксированного состояния. В этом случае HEAD относится к HEAD вашей ветки.
zh_cn: <code>git reset --hard HEAD</code> 实际上仅重置为最后的提交状态。 在这种情况下，HEAD是指分支的HEAD。

source: <strong>How it works:</strong>
es: <strong>C&oacute;mo funciona:</strong>
ja: <strong>使い方：</strong>
ko: <strong>작동 방식 :</strong>
ru: <strong>Как это работает:</strong>
zh_cn: <strong>怎么运行的：</strong>

source: <strong>The one-stop-answer is:</strong>
es: <strong>La respuesta &uacute;nica es:</strong>
ja: <strong>ワンストップ答えは：</strong>
ko: <strong>원 스톱 답변은 다음과 같습니다.</strong>
ru: <strong>Единый ответ:</strong>
zh_cn: <strong>一站式答案是：</strong>

source: <strong>The question mixes two issues here:</strong>
es: <strong>La pregunta mezcla dos cuestiones aqu&iacute;:</strong>
ja: <strong>質問はここで2つの問題を混ぜ合わせます：</strong>
ko: <strong>질문은 두 가지 문제를 혼합합니다.</strong>
ru: <strong>Вопрос смешивает два вопроса здесь:</strong>
zh_cn: <strong>这个问题在这里混合了两个问题：</strong>

source: <strong>Warning</strong>: <code>git clean -x -d -f</code> is <em>irreversible</em> and you may lose files and data (e.g. things you have ignored using <code>.gitignore</code>).
es: <strong>Advertencia</strong> : <code>git clean -x -d -f</code> es <em>irreversible</em> y puede perder archivos y datos (por ejemplo, cosas que ha ignorado usando <code>.gitignore</code> ).
ja: <strong>警告</strong> ： <code>git clean -x -d -f</code> は <code>.gitignore</code> ことができず、ファイルやデータが失われる可能性があります（例： .gitignoreを使用して無視したもの ）。
ko: <strong>경고</strong> : <code>git clean -x -d -f</code> 는 <em>되돌릴 수 없으며</em> 파일과 데이터를 잃을 수 있습니다 (예 : <code>.gitignore</code> 사용하여 무시한 것).
ru: <strong>Предупреждение</strong> : <code>git clean -x -d -f</code> <em>необратима,</em> и вы можете потерять файлы и данные (например, вещи, которые вы проигнорировали, используя <code>.gitignore</code> ).
zh_cn: <strong>警告</strong> ： <code>git clean -x -d -f</code> 是<em>不可逆的</em> ，您可能会丢失文件和数据（例如，使用 <code>.gitignore</code> 忽略的内容 ）。

source: All of the above suggests are right, but often to <em>really</em> reset your project, you also need to remove even files that are in your <code>.gitignore</code>.
es: Todas las sugerencias anteriores son correctas, pero a menudo para <em>realmente</em> restablecer su proyecto, tambi&eacute;n necesita eliminar incluso los archivos que est&aacute;n en su <code>.gitignore</code> .
ja: 上記のすべてが適切ですが、 <em>実際に</em>プロジェクトをリセットするには、 <code>.gitignore</code> にあるファイルも削除する必要があります。
ko: 위의 모든 제안은 옳지 만 종종 프로젝트를 <em>실제로</em> 재설정하려면 <code>.gitignore</code> 에 있는 파일조차 제거해야합니다.
ru: Все вышеперечисленные предложения <code>.gitignore</code> , но часто, чтобы <em>действительно</em> сбросить ваш проект, вам также необходимо удалить даже файлы, которые находятся в вашем .gitignore .
zh_cn: 以上所有建议均是正确的，但是通常要<em>真正</em>重置项目，甚至还需要删除 <code>.gitignore</code> 中的文件。

source: Also, you go for reset the current branch of <code>origin</code> to <code>HEAD</code>.
es: Adem&aacute;s, debe restablecer la rama de <code>origin</code> actual a <code>HEAD</code> .
ja: また、現在の <code>origin</code> ブランチを <code>HEAD</code> にリセットします。
ko: 또한 현재 <code>origin</code> 을 <code>HEAD</code> 로 재설정합니다.
ru: Кроме того, вы идете для сброса текущей ветви <code>origin</code> в <code>HEAD</code> .
zh_cn: 此外，您还需要将当前的 <code>origin</code> 分支重置为 <code>HEAD</code> 。

source: As for your specific question as to why those files appear in the status as modified, it looks like perhaps you did a soft reset instead of a hard reset. This will cause the files that were changed in the <code>HEAD</code> commit to appear as if they were staged, which is likely what you are seeing here.
es: En cuanto a su pregunta espec&iacute;fica de por qu&eacute; esos archivos aparecen en el estado modificado, parece que quiz&aacute;s hizo un restablecimiento parcial en lugar de un restablecimiento completo. Esto har&aacute; que los archivos que se modificaron en la confirmaci&oacute;n <code>HEAD</code> aparezcan como si estuvieran en escena, lo que probablemente es lo que est&aacute; viendo aqu&iacute;.
ja: これらのファイルが変更された状態で表示される理由に関する特定の質問については、ハードリセットではなくソフトリセットを行ったようです。 これにより、 <code>HEAD</code> コミットで変更されたファイルがステージングされたかのように表示されます。これは、ここに表示されているものと思われます。
ko: 해당 파일이 수정 된 상태로 나타나는 이유에 대한 특정 질문에 대해서는 하드 재설정 대신 소프트 재설정을 수행 한 것으로 보입니다. 그러면 <code>HEAD</code> 커밋에서 변경된 파일이 마치 마치 마치 마치 마치 마치 보이는 것처럼 보일 수 있습니다.
ru: Что касается вашего конкретного вопроса относительно того, почему эти файлы появляются в статусе как измененные, похоже, что вы сделали программный сброс вместо аппаратного сброса. Это приведет к тому, что файлы, которые были изменены в <code>HEAD</code> будут выглядеть так, как если бы они были размещены, что, вероятно, то, что вы видите здесь.
zh_cn: 至于关于这些文件为何以修改后的状态显示的特定问题，似乎您进行了软重置而不是硬重置。 这将导致在 <code>HEAD</code> 提交中更改的文件看起来像是已暂存的，这很可能是您在此处看到的。

source: BTW, this situation that you're in looks an awful lot like a common case where a push has been done into the currently checked out branch of a non-bare repository. Did you recently push into your local repo? If not, then no worries -- something else must have caused these files to unexpectedly end up modified. Otherwise, you should be aware that it's not recommended to push into a non-bare repository (and not into the currently checked-out branch, in particular).
es: Por cierto,esta situación en la que estás se parece mucho a un caso común en el que se ha hecho un empuje en la rama actualmente comprobada de un repositorio no descubierto.¿Recientemente empujaste en tu repositorio local? Si no,no te preocupes,algo más debe haber causado que estos archivos terminen modificados inesperadamente.De lo contrario,debe tener en cuenta que no se recomienda hacer un push en un repositorio no desnudo (y no en la rama actualmente revisada,en particular).
ja: ところで、あなたが置かれているこの状況は、非ベアリポジトリの現在チェックアウトされているブランチへのプッシュが行われている、よくあるケースに酷似しています。最近ローカルリポジトリにプッシュしましたか?もしそうでなければ、心配ありません --何か他の原因でこれらのファイルが予期せず変更されてしまったに違いありません。そうでなければ、非ベアリポジトリへのプッシュは推奨されていないことに注意してください (特に現在チェックアウトされているブランチへのプッシュは推奨されていません)。
ko: BTW, 당신이 처한 상황은 현재 비 베어 리포지토리의 체크 아웃 된 분기로 푸시가 수행되는 일반적인 경우와 끔찍한 것처럼 보입니다. 최근에 지역 리포지토리로 밀었습니까? 그렇지 않은 경우 걱정할 필요가 없습니다. 다른 원인으로 인해 이러한 파일이 예기치 않게 수정되었습니다. 그렇지 않으면, 비베 어리 저장소 (특히 현재 체크 아웃 된 분기가 아닌)로 푸시하지 않는 것이 좋습니다.
ru: Кстати,эта ситуация,в которой вы находитесь,очень похожа на обычный случай,когда был сделан толчок в текущую извлеченную ветку неосновного репозитория.Вы недавно ввели в ваше локальное репо? Если нет,то не беспокойтесь-что-то другое,должно быть,вызвало непредвиденное изменение этих файлов.В противном случае,вы должны знать,что не рекомендуется делать это в неборевом репозитории (и не в текущей извлечённой ветке,в частности).
zh_cn: BTW,你现在的这种情况看起来很像一个常见的情况,即推送到一个非独立仓库的分支中。你最近有没有推送到你的本地版本库?如果没有,那么不用担心--一定是有其他原因导致这些文件意外地被修改了。否则,你应该知道,不建议推送到非裸仓库(尤其是当前已签出的分支)。

source: Be careful though. Hard resets cannot easily be undone. It is better to do as Dan suggests, and branch off a copy of your changes before resetting.
es: Pero ten cuidado.Los reinicios no se pueden deshacer fácilmente.Es mejor hacer lo que Dan sugiere,y hacer una copia de los cambios antes de reiniciar.
ja: しかし、注意してください。ハードリセットは簡単には元に戻せません。ダンが提案しているように、リセットする前に変更内容のコピーを分岐させておくのが良いでしょう。
ko: 그래도 조심하십시오. 하드 리셋은 쉽게 취소 할 수 없습니다. Dan이 제안한대로 수행하고 재설정하기 전에 변경 사항 사본을 분기하는 것이 좋습니다.
ru: Будь осторожен.Жесткий сброс не может быть легко отменен.Лучше делать,как предлагает Дэн,и разветвлять копии ваших изменений перед перезагрузкой.
zh_cn: 虽然要小心翼翼。硬重置不能轻易被撤销。最好按照Dan的建议,在重置之前,先把你的更改的副本分支下来,然后再重置。

source: But when I run a <code>git status</code>,
es: Pero cuando ejecuto un <code>git status</code> ,
ja: しかし、 <code>git status</code> を実行すると、
ko: 하지만 <code>git status</code> 를 실행하면
ru: Но когда я запускаю <code>git status</code> ,
zh_cn: 但是当我运行 <code>git status</code> 时 ，

source: Can you please tell me why I have these 'modified'? I haven't touched these files? If I did, I want to remove those.
es: ¿Puedes decirme por qué tengo estos "modificados"? ¿No he tocado estos archivos? Si lo hice,quiero eliminarlos.
ja: なぜこれらの「修正」があるのか、教えていただけますか?私はこれらのファイルに触れていないのですか?もし触っていたら、それらを削除したいのですが。
ko: 내가 왜 '수정 된'이유를 말씀해 주시겠습니까? 이 파일들을 건드리지 않았습니까? 내가 그랬다면, 그것들을 제거하고 싶다.
ru: Скажите,пожалуйста,почему у меня есть эти "модифицированные"? Я не трогал эти файлы? Если трогал,я хочу их удалить.
zh_cn: 能否请你告诉我,我为什么会有这些'修改'?我没有碰过这些文件?如果有,我想删除这些文件。

source: Check your remotes, make sure your upstream and origin are what you expect, if not as expected then use <code>git remote add upstream &lt;insert URL&gt;</code>, e.g. of the original GitHub repo that you forked from, and/or <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code>.
es: Verifique sus controles remotos, aseg&uacute;rese de que su origen y origen sean los que espera, si no es como se esperaba, use <code>git remote add upstream &lt;insert URL&gt;</code> , por ejemplo, del repositorio original de GitHub del que bifurc&oacute;, y / o <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code> .
ja: <code>git remote add upstream &lt;insert URL&gt;</code> を確認し、アップストリームとオリジンが期待どおりであることを確認します。期待どおりでない場合は、 git remote addアップストリーム&lt;挿入URL&gt;を使用してください 。たとえば、元のGitHubリポジトリから分岐したものや、 <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code> 。
ko: 리모컨을 확인하고 업스트림 및 오리진이 예상 한 것인지 확인하십시오. 예상하지 않은 경우 <code>git remote add upstream &lt;insert URL&gt;</code> 을 사용하십시오 (예 : 포크 한 원래 GitHub 저장소 및 <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code> .
ru: Проверьте свои пульты, убедитесь, что ваш исходящий и исходный код соответствуют вашим ожиданиям, если не так, как ожидалось, используйте <code>git remote add upstream &lt;insert URL&gt;</code> , например, исходный репозиторий GitHub, с которого вы ответили, и / или <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code> .
zh_cn: 检查您的远程服务器，确保您的上游和原始服务器符合您的期望，如果不符合预期，则使用 <code>git remote add upstream &lt;insert URL&gt;</code> ，例如您从其分叉的原始GitHub存储库，和/或 <code>git remote add origin &lt;insert URL of the forked GitHub repo&gt;</code> 。

source: Finally, as needed, get the latest changes:
es: Por último,según sea necesario,obtener los últimos cambios:
ja: 最後に、必要に応じて、最新の変更点を取得します。
ko: 마지막으로 필요에 따라 최신 변경 사항을 가져 오십시오.
ru: Наконец,по мере необходимости,получайте последние изменения:
zh_cn: 最后,根据需要,获取最新变化。

source: First, reset to the previously fetched <code>HEAD</code> of the corresponding upstream branch:
es: Primero, restablezca el <code>HEAD</code> obtenido previamente de la rama ascendente correspondiente:
ja: まず、対応する上流ブランチの以前にフェッチされた <code>HEAD</code> にリセットします。
ko: 먼저 해당 업스트림 분기의 이전에 가져온 <code>HEAD</code> 로 재설정하십시오.
ru: Сначала вернемся к ранее выбранному <code>HEAD</code> соответствующей ветви восходящего направления:
zh_cn: 首先，将其重置为相应上游分支的先前获取的 <code>HEAD</code> ：

source: Followed by:
es: Seguido de:
ja: フォローされました。
ko: 뒤에 :
ru: За ним:
zh_cn: 随后是:

source: Fortunately I didn't have any other branches I cared about.
es: Afortunadamente no tenía otras ramas que me importaran.
ja: 幸いなことに、他に気になる枝はありませんでした。
ko: 다행스럽게도 제가 관심을 갖고있는 다른 지점은 없었습니다.
ru: К счастью,у меня не было других ветвей,о которых я заботился.
zh_cn: 幸运的是,我没有任何其他我关心的分支。

source: Have you forgotten to create a feature-branch and have committed directly on master by mistake?
es: ¿Ha olvidado crear una rama de características y ha cometido directamente sobre el maestro por error?
ja: フィーチャーブランチの作成を忘れてしまい、誤ってマスターに直接コミットしてしまったことはありませんか?
ko: 기능 분기를 작성하지 않고 실수로 마스터에 직접 커미트 한 적이 있습니까?
ru: Вы забыли создать функциональный блок и по ошибке совершили ошибку непосредственно на мастере?
zh_cn: 你是否忘记了创建一个功能分支,误打误撞直接在主站上提交了?

source: Here is a script that automates what the most popular answer suggests ... See <a href="https://stackoverflow.com/a/13308579/1497139">https://stackoverflow.com/a/13308579/1497139</a> for an improved version that supports branches
es: Aqu&iacute; hay un script que automatiza lo que sugiere la respuesta m&aacute;s popular ... Consulte <a href="https://stackoverflow.com/a/13308579/1497139">https://stackoverflow.com/a/13308579/1497139</a> para obtener una versi&oacute;n mejorada que admite sucursales
ja: 以下は、最も一般的な回答が示唆することを自動化するスクリプトです...ブランチをサポートする改良されたバージョンについては、 <a href="https://stackoverflow.com/a/13308579/1497139">https：//stackoverflow.com/a/13308579/1497139</a>を参照してください
ko: 다음은 가장 인기있는 답변이 제안하는 것을 자동화하는 스크립트입니다 ... 분기를 지원하는 개선 된 버전은 <a href="https://stackoverflow.com/a/13308579/1497139">https://stackoverflow.com/a/13308579/1497139</a> 를 참조 하십시오
ru: Вот скрипт, который автоматизирует то, что предлагает самый популярный ответ ... См. <a href="https://stackoverflow.com/a/13308579/1497139">Https://stackoverflow.com/a/13308579/1497139</a> для улучшенной версии, которая поддерживает ветви
zh_cn: 这是一个脚本，可自动执行最流行的答案所建议的内容...有关支持分支的改进版本，请参见<a href="https://stackoverflow.com/a/13308579/1497139">https://stackoverflow.com/a/13308579/1497139</a>

source: How do I reset my local branch to be just like the branch on the remote repository?
es: ¿Cómo puedo restablecer mi sucursal local para que sea igual a la sucursal del repositorio remoto?
ja: ローカルブランチをリモートリポジトリ上のブランチと同じようにリセットするには?
ko: 로컬 저장소를 원격 저장소의 분기와 동일하게 재설정하려면 어떻게합니까?
ru: Как перезагрузить мою локальную ветку,чтобы она была точно такой же,как ветка в удалённом репозитории?
zh_cn: 如何重置我的本地分支,使其与远程仓库上的分支一样?

source: I also added an "are you sure" prompt, &amp; some feedback output
es: Tambi&eacute;n agregu&eacute; un mensaje "&iquest;est&aacute;s seguro?" Y algunos resultados
ja: 「よろしいですか」というプロンプトとフィードバック出力も追加しました
ko: 또한 "확인 하시겠습니까?"프롬프트와 일부 피드백 출력을 추가했습니다.
ru: Я также добавил приглашение &laquo;Вы уверены&raquo; и некоторые отзывы
zh_cn: 我还添加了&ldquo;您确定&rdquo;提示，以及一些反馈输出

source: I did:
es: Yo lo hice:
ja: 私がやったんだ
ko: 나는했다 :
ru: Я так и сделал:
zh_cn: 是的

source: I had 2 not needed commits, hence the number 2. You can change it to your own number of commits to reset.
es: Tenía 2 no necesitaban compromisos,de ahí el número 2.Puedes cambiarlo a tu propio número de confirmaciones para reiniciar.
ja: 私は不要なコミットが2つあったので、2という数字にしました。自分のコミット数に変更してリセットすることができます。
ko: 커밋이 필요하지 않은 2 개가 있으므로 2 번 커밋을 커밋 수로 변경하여 재설정 할 수 있습니다.
ru: У меня было 2 не нужных коммита,отсюда и номер 2.Вы можете изменить его на ваше собственное количество коммитов для сброса.
zh_cn: 我有2个不需要提交,因此数字2。你可以改成自己的提交数来重置。

source: I needed to do (the solution in the accepted answer):
es: que necesitaba hacer (la solución en la respuesta aceptada):
ja: 必要があった(受け入れた答えの中の解答)。
ko: 나는해야했다 (허용 된 답변의 해결책) :
ru: Мне нужно было это сделать (решение в принятом ответе):
zh_cn: 我需要做(接受答案中的解决方案)。

source: If branch "mybranch" is <strong>not</strong> currently checked out, to reset it to remote branch "myremote/mybranch"'s head, you can use this <a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">low-level</a> command:
es: Si la rama "mybranch" <strong>no</strong> est&aacute; desprotegida actualmente, para restablecerla a la cabeza de la rama remota "myremote / mybranch", puede usar este comando de <a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">bajo nivel</a> :
ja: ブランチ「mybranch」が現在チェックアウトされて<strong>いない</strong>場合、リモートブランチ「myremote / mybranch」のヘッドにリセットするには、次の<a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">低レベル</a>コマンドを使用できます。
ko: 분기 "mybranch"가 현재 체크 아웃 <strong>되지 않은</strong> 경우 원격 분기 "myremote / mybranch"의 헤드로 재설정하려면 다음 <a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">하위 레벨</a> 명령을 사용할 수 있습니다.
ru: Если ветвь "mybranch" в настоящее время <strong>не</strong> извлечена, чтобы сбросить ее до заголовка удаленной ветки "myremote / mybranch", вы можете использовать эту команду <a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">низкого уровня</a> :
zh_cn: 如果当前<strong>未</strong>检出分支&ldquo; mybranch&rdquo;，则要将其重置为远程分支&ldquo; myremote / mybranch&rdquo;的头，可以使用以下<a href="http://schacon.github.io/git/git.html#_low_level_commands_plumbing">底层</a>命令：

source: If you don't mind saving your local changes, yet still want to update your repository to match origin/HEAD, you can simply stash your local changes and then pull:
es: Si no te importa guardar tus cambios locales,pero aún así quieres actualizar tu repositorio para que coincida con originHEAD,puedes simplemente guardar tus cambios locales y luego tirar:
ja: もし、ローカルの変更を保存しても構わないが、まだ originHEAD に合わせてリポジトリを更新したい場合は、ローカルの変更を保存してから pull してください。
ko: 로컬 변경 사항을 저장하지 않아도 원본 / HEAD와 일치하도록 리포지토리를 업데이트하려면 로컬 변경 사항을 숨기고 다음을 수행하면됩니다.
ru: Если вы не возражаете против сохранения ваших локальных изменений,но всё же хотите обновить ваш репозиторий,чтобы он соответствовал originHEAD,вы можете просто спрятать ваши локальные изменения и затем вытащить их:
zh_cn: 如果你不介意保存你的本地修改,但仍想更新你的版本库以匹配 originHEAD,你可以简单地存储你的本地修改,然后拉。

source: If you had a problem as me, that you have already committed some changes, but now, for any reason you want to get rid of it, the quickest way is to use <code>git reset</code> like this:
es: Si tuvo un problema como yo, que ya ha cometido algunos cambios, pero ahora, por cualquier motivo, desea deshacerse de &eacute;l, la forma m&aacute;s r&aacute;pida es usar <code>git reset</code> de esta manera:
ja: 私のように問題があり、既にいくつかの変更をコミットしているが、何らかの理由でそれを取り除きたい場合、最も簡単な方法は次のように <code>git reset</code> を使用することです。
ko: 나와 같은 문제가 있었지만 이미 일부 변경 사항을 커밋했지만 지금은 어떤 이유로 든 제거하려는 경우 가장 빠른 방법은 다음과 같이 <code>git reset</code> 을 사용하는 것입니다.
ru: Если у вас была проблема со мной, что вы уже совершили некоторые изменения, но теперь, по любой причине, вы хотите от нее избавиться, самый быстрый способ - использовать <code>git reset</code> следующим образом:
zh_cn: 如果您遇到我的问题，那么您已经进行了一些更改，但是现在，出于任何原因想要摆脱它，最快的方法是使用 <code>git reset</code> ,如下所示：

source: If you have several commits, this won't work..
es: Si tienes varios compromisos,esto no funcionará...
ja: 複数のコミットがある場合は、これではうまくいきません。
ko: 커밋이 여러 개인 경우 작동하지 않습니다.
ru: Если у вас есть несколько коммитов,это не сработает...
zh_cn: 如果你有好几个承诺,这个是不行的。

source: If you want to go back to the <code>HEAD</code> state for both the working directory and the index, then you should <code>git reset --hard HEAD</code>, rather than to <code>HEAD^</code>. (This may have been a typo, just like the single versus double dash for <code>--hard</code>.)
es: Si desea volver al estado <code>HEAD</code> tanto para el directorio de trabajo como para el &iacute;ndice, debe <code>git reset --hard HEAD</code> , en lugar de <code>HEAD^</code> . (Esto puede haber sido un error tipogr&aacute;fico, al igual que el gui&oacute;n simple versus doble para <code>--hard</code> ).
ja: 作業ディレクトリとインデックスの両方を <code>HEAD</code> 状態に戻したい場合は、 <code>HEAD^</code> ではなく <code>git reset --hard HEAD</code> を実行する必要があります。 （これは、-- <code>--hard</code> シングルダッシュとダブルダッシュのようにタイプミスだった可能性があります。）
ko: 작업 디렉토리와 인덱스 모두에 대해 <code>HEAD</code> 상태로 돌아가려면 <code>HEAD^</code> 대신 <code>git reset --hard HEAD</code> 를 사용해야합니다. <code>--hard</code> 에 대한 단일 대 이중 대시와 마찬가지로 오타 일 수 있습니다.
ru: Если вы хотите вернуться в состояние <code>HEAD</code> как для рабочего каталога, так и для индекса, то вам нужно <code>git reset --hard HEAD</code> , а не <code>HEAD^</code> . (Это может быть опечатка, точно так же как одиночный или двойной тире для <code>--hard</code> .)
zh_cn: 如果要同时返回工作目录和索引的 <code>HEAD</code> 状态，则应 <code>git reset --hard HEAD</code> ，而不是 <code>HEAD^</code> 。 （这可能是一个错字，就像 <code>--hard</code> 的单破折号和双破折号一样。）
