Repository: rueisnom/feedback
Catalog: xlf/16/28/08/8/1628088.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you want to reset your local branch to the latest commit in the upstream branch, what works for me so far is:
es: Si quieres reajustar tu rama local al último compromiso de la rama de arriba,lo que me funciona hasta ahora es:
ja: ローカルブランチを上流ブランチの最新のコミットにリセットしたい場合、これまでのところ私には何が効くかというと、これです。
ko: 로컬 브랜치를 업스트림 브랜치의 최신 커밋으로 재설정하려는 경우 지금까지 효과적인 것은 다음과 같습니다.
ru: Если вы хотите сбросить ваше локальное ответвление на последний коммит в вышестоящей ветке,то пока что мне это работает:
zh_cn: 如果你想将你的本地分支重置为上游分支中的最新提交,目前对我有效的方法是:

source: If you want to save your current branch's state before doing this (just in case), you can do:
es: Si quieres salvar el estado de tu sucursal actual antes de hacer esto (por si acaso),puedes hacerlo:
ja: これをする前に現在のブランチの状態を保存しておきたい場合は(念のため)。
ko: 이 작업을 수행하기 전에 현재 브랜치의 상태를 저장하려는 경우 (만약의 경우)
ru: Если вы хотите сохранить состояние вашей текущей ветки перед этим (на всякий случай),вы можете это сделать:
zh_cn: 如果你想在做这件事之前保存当前分支的状态(以防万一),你可以这样做。

source: Next, as needed, remove untracked files, optionally also with <code>-x</code>:
es: A continuaci&oacute;n, seg&uacute;n sea necesario, elimine los archivos no rastreados, opcionalmente tambi&eacute;n con <code>-x</code> :
ja: 次に、必要に応じて、追跡されていないファイルを削除します。オプションで <code>-x</code> も使用します。
ko: 그런 다음 필요에 따라 추적되지 않은 파일을 제거하고 선택적으로 <code>-x</code> 를 사용 하여 제거하십시오.
ru: Затем, при необходимости, удалите неотслеживаемые файлы, при необходимости также с <code>-x</code> :
zh_cn: 接下来，根据需要，删除未跟踪的文件，也可以使用 <code>-x</code> 删除：

source: No amount of reset and cleaning seemed to have any effect on untracked and modified files in my local git repo (I tried all the options above). My only solution to this was to rm the local repo and re-clone it from the remote.
es: Ninguna cantidad de reinicio y limpieza parecía tener efecto alguno en los archivos no rastreados y modificados en mi repositorio local de git (intenté todas las opciones anteriores).Mi única solución a esto fue resetear el repositorio local y volver a clonarlo desde el remoto.
ja: いくらリセットしても、ローカルの git レポの未追跡ファイルや変更されたファイルには何の影響もないように思えました (上記のオプションをすべて試してみました)。私の唯一の解決策は、ローカルのレポを rm してリモートからクローンし直すことでした。
ko: 로컬 git repo의 추적되지 않은 파일과 수정 된 파일에는 많은 양의 재설정 및 정리가 영향을 미치지 않는 것 같습니다 (위의 모든 옵션을 시도했습니다). 이것에 대한 유일한 해결책은 로컬 저장소를 rm하고 원격에서 복제하는 것입니다.
ru: Никакое количество сброса и очистки,похоже,не повлияло на неотслеживаемые и изменённые файлы в моём локальном git-репо (я перепробовал все опции,описанные выше).Моим единственным решением было выполнить rm локальное repo и переклинировать его с удалённого компьютера.
zh_cn: 重置和清理似乎对我的本地git repo中未被跟踪和修改的文件没有任何影响(我试过上面所有的选项)。我唯一的解决方法是将本地的repo重置并从远程重新克隆。

source: Note that instead of upstream/develop you could use a commit hash, other branch name, etc. Use a CLI tool such as Oh My Zsh to check that your branch is green indicating that there is nothing to commit and the working directory is clean (which is confirmed or also verifiable by <code>git status</code>). Note that this may actually add commits compared to upstream develop if there is anything automatically added by a commit, e.g. UML diagrams, license headers, etc., so in that case, you could then pull the changes on <code>origin develop</code> to <code>upstream develop</code>, if needed.
es: Tenga en cuenta que en lugar de upstream / desarrollo, podr&iacute;a usar un hash de confirmaci&oacute;n, otro nombre de rama, etc. Use una herramienta CLI como Oh My Zsh para verificar que su rama sea verde, lo que indica que no hay nada que confirmar y que el directorio de trabajo est&aacute; limpio ( que se confirma o tambi&eacute;n es verificable por el <code>git status</code> ). Tenga en cuenta que esto en realidad puede agregar confirmaciones en comparaci&oacute;n con el desarrollo ascendente si hay algo agregado autom&aacute;ticamente por una confirmaci&oacute;n, por ejemplo, diagramas UML, encabezados de licencia, etc., por lo que en ese caso, podr&iacute;a extraer los cambios en el <code>origin develop</code> para el <code>upstream develop</code> , si necesario.
ja: アップストリーム/開発の代わりに、コミットハッシュや他のブランチ名などを使用できることに注意してください。OhMy ZshなどのCLIツールを使用して、ブランチが緑色で、コミットするものがなく、作業ディレクトリがクリーンであることを確認します（ <code>git status</code> によって確認または検証可能です）。 UMLダイアグラム、ライセンスヘッダーなど、コミットによって自動的に追加されるものがある場合、これは上流の開発と比較して実際にコミットを追加する可能性があることに注意してください。その場合、その後、 <code>origin develop</code> の変更を <code>upstream develop</code> にプルできます。必要。
ko: 업스트림 / 개발 대신 커밋 해시, 다른 분기 이름 등을 사용할 수 있습니다. Oh My Zsh와 같은 CLI 도구를 사용하여 분기가 녹색인지 확인하여 커밋 할 것이 없으며 작업 디렉토리가 깨끗하다는 것을 확인하십시오 ( <code>git status</code> 로 확인하거나 확인할 수 있습니다). UML 다이어그램, 라이센스 헤더 등과 같이 커밋에 의해 자동으로 추가되는 것이 있으면 업스트림 개발에 비해 커밋을 실제로 추가 할 수 있으므로이 경우 <code>origin develop</code> 의 변경 사항을 <code>upstream develop</code> 로 끌어 올 수 있습니다. 필요합니다.
ru: Обратите внимание, что вместо upstream / development вы могли бы использовать хеш коммита, другое имя ветки и т. Д. Используйте инструмент CLI, такой как Oh My Zsh, чтобы проверить, что ваша ветвь имеет зеленый цвет, указывая, что нечего коммитить, а рабочий каталог чистый ( что подтверждается или также подтверждается <code>git status</code> ). Обратите внимание, что это может фактически добавить коммиты по сравнению с разработкой в ​​восходящем потоке, если что-то автоматически добавляется коммитом, например, диаграммы UML, заголовки лицензий и т. Д., Так что в этом случае вы могли бы затем вытащить изменения в <code>origin develop</code> для последующей <code>upstream develop</code> , если необходимо.
zh_cn: 请注意，您可以使用提交哈希，其他分支名称等代替上游/开发。使用CLI工具（例如Oh My Zsh）检查您的分支是否为绿色，指示没有要提交的内容并且工作目录是干净的（可以通过 <code>git status</code> 确认或验证）。 请注意，如果提交自动添加了任何内容（例如，UML图，许可证标头等），那么与上游开发相比，这实际上可能会添加提交，因此在这种情况下，您可以将 <code>origin develop</code> 的更改拉到 <code>upstream develop</code> ，如果需要。

source: Note that it is good practice not to make changes to your local master/develop branch, but instead checkout to another branch for any change, with the branch name prepended by the type of change, e.g. <code>feat/</code>, <code>chore/</code>, <code>fix/</code>, etc. Thus you only need to pull changes, not push any changes from master. Same thing for other branches that others contribute to. So the above should only be used if you have happened to commit changes to a branch that others have committed to, and need to reset. Otherwise in future avoid pushing to a branch that others push to, instead checkout and push to the said branch via the checked out branch.
es: Tenga en cuenta que es una buena pr&aacute;ctica no realizar cambios en su rama local de desarrollo / maestro, sino que en su lugar realice el pago en otra rama para cualquier cambio, con el nombre de la rama precedido por el tipo de cambio, por ejemplo, <code>feat/</code> , <code>chore/</code> , <code>fix/</code> , etc. Por lo tanto, solo necesita realizar cambios, no impulsar ning&uacute;n cambio desde el maestro. Lo mismo para otras ramas a las que otros contribuyen. Por lo tanto, lo anterior solo debe usarse si ha cometido cambios en una rama a la que otros se han comprometido y necesita restablecerse. De lo contrario, en el futuro, evite presionar a una rama a la que otros presionan, en lugar de pagar y enviar a dicha rama a trav&eacute;s de la rama retirada.
ja: ローカルのmaster / developブランチに変更を加えないことをお勧めします。代わりに、変更のために別のブランチにチェックアウトし、ブランチの名前の前に変更のタイプを付加します（例： <code>feat/</code> 、 <code>chore/</code> 、 <code>fix/</code> など）。 。したがって、変更をプルするだけでよく、マスターから変更をプッシュする必要はありません。 他のブランチが貢献している他のブランチも同じです。 したがって、上記の方法は、他のユーザーがコミットしたブランチへの変更をたまたまコミットしてリセットする必要がある場合にのみ使用してください。 それ以外の場合は、将来、他の人がプッシュするブランチにプッシュすることを避け、代わりにチェックアウトして、チェックアウトされたブランチを介してそのブランチにプッシュします。
ko: <code>feat/</code> , <code>chore/</code> , <code>fix/</code> 등과 같이 변경 유형 앞에 붙은 브랜치 이름을 사용하여 로컬 마스터 / 개발 브랜치를 변경하지 말고 변경을 위해 다른 브랜치를 체크 아웃하는 것이 좋습니다. 따라서 마스터에서 변경 사항을 푸시하지 않고 변경 사항 만 가져와야합니다. 다른 사람들이 기여하는 다른 지점들도 마찬가지입니다. 따라서 위의 내용은 다른 사람이 커밋 한 분기에 변경 사항을 커밋하고 재설정해야하는 경우에만 사용해야합니다. 그렇지 않으면 나중에 다른 사람들이 푸시하는 브랜치로 푸시하지 말고 체크 아웃하고 체크 아웃 된 브랜치를 통해 해당 브랜치를 푸시하십시오.
ru: Обратите внимание, что хорошей практикой является не вносить изменения в вашу локальную ветку master / development, а вместо этого извлекать изменения в другую ветку с именем ветки, к которому добавляется тип изменения, например, <code>feat/</code> , <code>chore/</code> , <code>fix/</code> и т. Д. Таким образом, вам нужно только извлечь изменения, а не выдвинуть изменения из мастера. То же самое и для других отраслей, которым способствуют другие. Таким образом, вышеприведенное следует использовать только в том случае, если вы зафиксировали изменения в ветке, в которую были внесены другие, и вам необходимо выполнить сброс. В противном случае в будущем избегайте нажатия на ветку, к которой другие подталкивают, вместо этого извлекайте и проталкивайте к указанной ветке через извлеченную ветку.
zh_cn: 请注意，最好不要对本地master / develop分支进行更改，而应签到其他分支以进行任何更改，分支名称以更改类型开头，例如 <code>feat/</code> ， <code>chore/</code> ， <code>fix/</code> 等。因此，您只需要拉出更改，而无需从master推送任何更改。 对于其他人贡献的其他分支机构也是如此。 因此，仅当您碰巧将更改提交给其他人已提交并需要重置的分支时，才应使用以上内容。 否则，将来避免推到其他人推到的分支，而是签出并通过签出的分支推到所述分支。

source: Note that the first example assumes that the remote repo's name is "origin" and that the branch named "master" in the remote repo matches the currently checked-out branch in your local repo.
es: Obsérvese que el primer ejemplo supone que el nombre del repo remoto es "origen" y que la rama denominada "maestro" en el repo remoto coincide con la rama actualmente comprobada en su repo local.
ja: 最初の例では、リモートレポの名前が "origin" で、リモートレポの "master" という名前のブランチがローカルレポの現在チェックアウトされているブランチと一致していると仮定していることに注意してください。
ko: 첫 번째 예에서는 원격 리포지토리 이름이 "origin"이고 원격 리포지토리에서 "master"라는 분기가 로컬 리포지토리에서 현재 체크 아웃 된 분기와 일치한다고 가정합니다.
ru: Обратите внимание,что в первом примере предполагается,что имя удалённого репо "origin" и что ветка с именем "master" в удалённом репо совпадает с текущей извлечённой веткой в вашем локальном репо.
zh_cn: 请注意,第一个例子假设远程repo的名字是 "origin",并且远程repo中名为 "master "的分支与本地repo中的当前已签出的分支一致。

source: Notice that you will lose the changes you've made, so be careful!
es: Fíjese que perderá los cambios que ha hecho,¡así que tenga cuidado!
ja: 変更したものが消えてしまうので注意しましょう
ko: 변경 한 내용이 손실되므로주의하십시오!
ru: Обратите внимание,что вы потеряете сделанные изменения,так что будьте осторожны!
zh_cn: 注意,你会失去你所做的改变,所以要小心翼翼!

source: Now your work is saved on the branch "my-saved-work" in case you decide you want it back (or want to look at it later or diff it against your updated branch).
es: Ahora tu trabajo está guardado en la rama "mi-trabajo guardado" en caso de que decidas que lo quieres de vuelta (o quieras mirarlo más tarde o diferenciarlo de tu rama actualizada).
ja: これであなたの作品は "my-saved-work" ブランチに保存されます。
ko: 이제 작업을 다시 원할 경우 (또는 나중에 보거나 업데이트 된 지점과 비교하기를 원할 경우) "my-saved-work"분기에 작업이 저장됩니다.
ru: Теперь ваша работа сохраняется в ветке "моя сохранённая работа" на тот случай,если вы решите,что хотите её вернуть (или хотите посмотреть на неё позже,или отличить от вашей обновлённой ветки).
zh_cn: 现在,你的工作被保存在分支 "my-saved-work "中,以备你决定要回它(或者以后再看它,或者与你更新的分支对比)。

source: On GitHub, you can also checkout the branch with the same name as the local one, in order to save the work there, although this isn't necessary if origin develop has the same changes as the local saved-work branch. I'm using the develop branch as an example, but it can be any existing branch name.
es: En GitHub,también puedes comprobar la rama con el mismo nombre que la local,para guardar el trabajo allí,aunque esto no es necesario si el desarrollo del origen tiene los mismos cambios que la rama de trabajo guardada local.Estoy usando la rama de desarrollo como ejemplo,pero puede ser cualquier nombre de rama existente.
ja: GitHub では、ローカルのブランチと同じ名前のブランチをチェックアウトして、そこで作業を保存することもできます。ここでは develop ブランチを例に挙げていますが、既存のブランチ名でも構いません。
ko: GitHub에서 작업을 저장하기 위해 로컬 이름과 동일한 이름으로 지점을 체크 아웃 할 수도 있습니다. 그러나 원산지 개발이 로컬 저장된 작업 브랜치와 동일한 변경 사항이있는 경우 필요하지 않지만. 개발 브랜치를 예로 사용하고 있지만 기존 브랜치 이름이 될 수 있습니다.
ru: На GitHub вы также можете проверить ветку с тем же именем,что и локальная,чтобы сохранить там работу,хотя в этом нет необходимости,если исходная разработка имеет те же изменения,что и локальная сохранённая ветка.В качестве примера я использую ветку разработки,но это может быть любое существующее имя ветки.
zh_cn: 在 GitHub 上,你也可以查看与本地分支名称相同的分支,以便将工作保存在那里,不过如果 origin develop 与本地保存的工作分支有相同的改动,则不需要这样做。我以开发分支为例,但它可以是任何现有的分支名称。

source: Only 3 commands will make it work
es: Sólo 3 comandos harán que funcione
ja: 3つのコマンドだけで動作させることができます
ko: 3 개의 명령 만 작동합니다
ru: Только 3 команды заставят его работать
zh_cn: 只有3个命令就能让它工作

source: Previous answers assume that the branch to be reset is the current branch (checked out). In comments, OP <em>hap497</em> clarified that the branch is indeed checked out, but this is not explicitly required by the original question. Since there is at least one "duplicate" question, <a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">Reset branch completely to repository state</a>, which does not assume that the branch is checked out, here's an alternative:
es: Las respuestas anteriores suponen que la rama a restablecer es la rama actual (desprotegida). En los comentarios, OP <em>hap497</em> aclar&oacute; que la rama est&aacute; desprotegida, pero la pregunta original no lo requiere expl&iacute;citamente. Como hay al menos una pregunta "duplicada", <a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">restablezca la rama completamente al estado del repositorio</a> , lo que no supone que la rama est&eacute; desprotegida, aqu&iacute; hay una alternativa:
ja: 以前の回答では、リセットするブランチが現在のブランチ（チェックアウト済み）であると想定しています。 コメントの中で、OP <em>hap497</em>はブランチが実際にチェックアウトされていることを明確にしましたが、これは元の質問では明示的に要求されていません。 少なくとも1つの「重複する」質問があるので、 <a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">ブランチを完全にリポジトリ状態にリセットします</a> 。これは、ブランチがチェックアウトされていることを想定していません。代わりの方法を次に示します。
ko: 이전 답변에서는 재설정 할 분기가 현재 분기 (체크 아웃 됨)라고 가정합니다. 의견에서 OP <em>hap497</em> 은 브랜치가 실제로 체크 아웃되어 있지만 명확하게 요구하지는 않습니다. 최소한 하나의 "중복"질문이 있기 때문에 <a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">분기를 완전히 저장소 상태로 재설정</a> 합니다. 분기는 체크 아웃되었다고 가정하지 않습니다. 다음은 대안입니다.
ru: Предыдущие ответы предполагают, что ветвь, которая будет сброшена, является текущей веткой (проверено). В комментариях OP <em>hap497</em> пояснил, что ветка действительно проверена, но это не требуется явно в исходном вопросе. Поскольку существует хотя бы один &laquo;повторяющийся&raquo; вопрос, <a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">полностью сбросьте ветвь в состояние хранилища</a> , что не предполагает, что ветвь извлечена, вот альтернатива:
zh_cn: 先前的答案假定要重置的分支是当前分支（已签出）。 在评论中，OP <em>hap497</em>阐明了确实已检出该分支，但这不是原始问题明确要求的。 由于存在至少一个&ldquo;重复&rdquo;问题，因此将<a href="https://stackoverflow.com/questions/27385949/reset-branch-completely-to-repository-state">分支完全重置为存储库状态</a> ，而不假定分支已签出，这里是一种替代方法：

source: Provided that the remote repository is <code>origin</code>, and that you're interested in <code>branch_name</code>:
es: Siempre que el repositorio remoto sea de <code>origin</code> y que est&eacute; interesado en <code>branch_name</code> :
ja: リモートリポジトリが <code>origin</code> であり、 <code>branch_name</code> に興味がある場合 ：
ko: 원격 저장소가 <code>origin</code> 이고 <code>branch_name</code> 에 관심이있는 경우 :
ru: При условии, что удаленный репозиторий является <code>branch_name</code> , и что вы заинтересованы в имени_в ветви :
zh_cn: 假设远程存储库是 <code>origin</code> ，并且您对 <code>branch_name</code> 感兴趣：

source: Reset local repository branch to be just like remote repository HEAD
es: Reiniciar la rama del repositorio local para que sea como el repositorio remoto CABEZA
ja: ローカルリポジトリのブランチをリモートリポジトリのようにリセットする HEAD
ko: 로컬 저장소 분기를 원격 저장소 HEAD와 동일하게 재설정
ru: Сбросить локальную ветку репозитория,чтобы она была похожа на удаленный репозиторий HEAD
zh_cn: 重置本地存储库分支,使其与远程存储库的HEAD一样。

source: Setting your branch to exactly match the remote branch can be done in two steps:
es: La configuración de la rama para que coincida exactamente con la rama remota se puede hacer en dos pasos:
ja: リモートブランチと正確に一致するようにブランチを設定するには、2つのステップがあります。
ko: 원격 지사와 정확히 일치하도록 지사를 설정하려면 다음 두 단계를 수행하십시오.
ru: Настройка вашего ответвления на точное совпадение с удалённым ответвлением может быть выполнена в два этапа:
zh_cn: 将你的分支设置为完全匹配的远程分支,可以分两步完成。

source: So answering your question - if you're 5 commits ahead of remote repository HEAD, you should run this command:
es: Así que respondiendo a tu pregunta-si tienes 5 confirmaciones antes que el repositorio remoto HEAD,deberías ejecutar este comando:
ja: 質問の答え-もしあなたがリモートリポジトリの HEAD より 5 コミット先にコミットしている場合、このコマンドを実行する必要があります。
ko: 따라서 귀하의 질문에 대답하십시오-원격 저장소 HEAD보다 5 커밋 한 경우 다음 명령을 실행해야합니다.
ru: Итак,ответ на ваш вопрос-если у вас 5 коммитов впереди удаленного репозитория HEAD,вы должны выполнить эту команду:
zh_cn: 所以回答你的问题--如果你比远程版本库head提前5个提交,你应该运行这个命令。

source: The advantage of specifying <code>@{u}</code> or its verbose form <code>@{upstream}</code> is that the name of the remote repo and branch don't have to be explicitly specified.
es: La ventaja de especificar <code>@{u}</code> o su forma detallada <code>@{upstream}</code> es que el nombre del repositorio remoto y la rama no tienen que especificarse expl&iacute;citamente.
ja: <code>@{u}</code> またはその詳細形式 <code>@{upstream}</code> を指定する利点は、リモートリポジトリとブランチの名前を明示的に指定する必要がないことです。
ko: <code>@{u}</code> 또는 자세한 형태 인 <code>@{upstream}</code> 을 지정하면 원격 저장소 및 분기 이름을 명시 적으로 지정할 필요가 없다는 장점이 있습니다.
ru: Преимущество указания <code>@{u}</code> или его подробной формы <code>@{upstream}</code> заключается в том, что имя удаленного репо и филиала не нужно указывать явно.
zh_cn: 指定 <code>@{u}</code> 或其详细形式 <code>@{upstream}</code> 的优点是不必明确指定远程仓库和分支的名称。

source: The answer
es: La respuesta
ja: 答えは
ko: 대답
ru: Ответ
zh_cn: 答案是

source: The only solution that works in all cases that I've seen is to delete and reclone. Maybe there's another way, but obviously this way leaves no chance of old state being left there, so I prefer it. Bash one-liner you can set as a macro if you often mess things up in git:
es: La única solución que funciona en todos los casos que he visto es borrar y volver a poner en marcha.Tal vez haya otra manera,pero obviamente esta manera no deja ninguna posibilidad de que el viejo estado se quede allí,así que lo prefiero.La línea de guión que se puede establecer como macro si a menudo se estropean las cosas en el git:
ja: 私が見てきたすべてのケースで有効な唯一の解決策は、削除して再クローンすることです。他にも方法があるのかもしれませんが、明らかにこの方法では古い状態が残る可能性がないので、私はそれを好みます。よくgitでいじっている場合にマクロとして設定できるBashのワンライナー。
ko: 내가 본 모든 경우에 작동하는 유일한 솔루션은 삭제하고 복제하는 것입니다. 어쩌면 다른 방법이있을 수도 있지만 분명히이 방법은 오래된 상태가 남아있을 가능성이 없으므로 선호합니다. git에서 일을 망치면 매크로로 설정할 수 있습니다.
ru: Единственное решение,которое работает во всех случаях,которое я видел,это удаление и восстановление.Может быть,есть другой способ,но очевидно,что этот способ не оставляет шансов на то,что там останется старое состояние,поэтому я предпочитаю его.Бэш-один лайнер можно настроить как макрос,если вы часто путаете вещи в git'е:
zh_cn: 在我所见过的所有情况下,唯一可行的解决方案是删除并重新定位。也许还有其他的方法,但显然这种方法不会让旧状态留在那里,所以我更喜欢这种方法。Bash单行本,如果你经常在git中搞乱,可以设置为宏。

source: Then if you need to merge these changes with another branch while where there are any conflicts, preserving the changes in develop, use:
es: Entonces si necesitas fusionar estos cambios con otra rama mientras haya conflictos,preservando los cambios en el desarrollo,usa:
ja: そして、これらの変更を別のブランチにマージする必要がある場合は、コンフリクトが発生している間に、開発中の変更を保存するために使用します。
ko: 그런 다음 개발의 변경 사항을 유지하면서 충돌이있는 동안 이러한 변경 사항을 다른 지점과 병합 해야하는 경우 다음을 사용하십시오.
ru: Тогда,если вам нужно слить эти изменения с другой веткой,в то время как там,где есть какие-либо конфликты,сохраняя изменения в разработке,используйте:
zh_cn: 然后,如果你需要将这些变化与另一个分支合并,而哪里有任何冲突,保留在开发中的变化,使用。

source: Then the <code>git reset</code> resets the <code>&lt;branch_name&gt;</code> branch to what you just fetched. The <code>--hard</code> option changes all the files in your working tree to match the files in <code>origin/branch_name</code>.
es: Luego, el <code>git reset</code> restablece la rama <code>&lt;branch_name&gt;</code> a lo que acaba de obtener. La opci&oacute;n <code>--hard</code> cambia todos los archivos en su &aacute;rbol de trabajo para que coincidan con los archivos en <code>origin/branch_name</code> .
ja: 次に <code>git reset</code> を実行すると、 <code>&lt;branch_name&gt;</code> ブランチがフェッチしたものにリセットされます。 <code>--hard</code> オプションは、作業ツリー内のすべてのファイルを、 <code>origin/branch_name</code> 内のファイルと一致するように変更します。
ko: 그런 다음 <code>git reset</code> 은 <code>&lt;branch_name&gt;</code> 분기를 방금 가져온 항목으로 재설정 합니다. <code>--hard</code> 옵션은 작업 트리의 모든 파일을 <code>origin/branch_name</code> 의 파일과 일치하도록 변경합니다.
ru: Затем <code>git reset</code> сбрасывает <code>&lt;branch_name&gt;</code> к тому, что вы только что получили . Опция <code>--hard</code> изменяет все файлы в вашем рабочем дереве в соответствии с файлами в <code>origin/branch_name</code> .
zh_cn: 然后 <code>git reset</code> 将 <code>&lt;branch_name&gt;</code> 分支重置为您刚获取的分支。 <code>--hard</code> 选项更改工作树中的所有文件，以匹配 <code>origin/branch_name</code> 中的文件。

source: This is something I face regularly, &amp; I've generalised the script Wolfgang provided above to work with any branch
es: Esto es algo a lo que me enfrento regularmente, y he generalizado el script que Wolfgang proporcion&oacute; anteriormente para trabajar con cualquier rama
ja: これは私が定期的に直面していることであり、私は任意のブランチで動作するように上記で提供されたスクリプトWolfgangを一般化しました
ko: 이것은 내가 정기적으로 직면하는 것입니다. 그리고 나는 모든 지점과 함께 작업하기 위해 위에 제공된 Wolfgang 스크립트를 일반화했습니다.
ru: С этим я регулярно сталкиваюсь, и я обобщил приведенный выше скрипт Вольфганга для работы с любой веткой.
zh_cn: 这是我经常要面对的事情，并且我已经概括了上面提供的与任何分支一起使用的Wolfgang脚本

source: This is what I use often:
es: Esto es lo que uso a menudo:
ja: これは私がよく使うものです。
ko: 이것이 내가 자주 사용하는 것입니다.
ru: Это то,чем я часто пользуюсь:
zh_cn: 这是我经常使用的方法。

source: This method leaves the checked out branch as it is, and the working tree untouched. It simply moves mybranch's head to another commit, whatever is given as the second argument. This is especially helpful if multiple branches need to be updated to new remote heads.
es: Este método deja la rama en bruto tal como está,y el árbol de trabajo intacto.Simplemente mueve la cabeza de mi rama a otro compromiso,lo que se da como segundo argumento.Esto es especialmente útil si varias ramas necesitan ser actualizadas a nuevas cabezas remotas.
ja: このメソッドはチェックアウトされたブランチをそのまま残し、作業ツリーはそのままにします。このメソッドは、単に mybranch の先頭を別のコミットに移動させます。これは、複数のブランチを新しいリモートヘッドに更新する必要がある場合に特に便利です。
ko: 이 방법은 체크 아웃 된 분기를 그대로두고 작업 트리를 건드리지 않습니다. 그것은 단지 mybranch의 머리를 다른 커밋으로 이동시킵니다. 여러 분기를 새 원격 헤드로 업데이트해야하는 경우 특히 유용합니다.
ru: Этот метод оставляет проверенную ветку такой,какая она есть,и рабочее дерево нетронутым.Он просто перемещает голову мибраны на другой коммит,что бы ни было дано в качестве второго аргумента.Это особенно полезно,если необходимо обновить несколько ветвей до новых удалённых головок.
zh_cn: 这个方法可以让已勾选的分支保持原样,工作树不被触动。它只需将mybranch的分支头移动到另一个提交中,无论第二个参数是什么。如果多个分支需要更新到新的远程头,这个方法特别有用。

source: To get the moral equivalent of <strong>erasing your project directory and re-cloning</strong> from the remote is:
es: Para obtener el equivalente moral de <strong>borrar el directorio de su proyecto y volver a clonar</strong> desde el control remoto es:
ja: <strong>プロジェクトディレクトリ</strong>を<strong>消去</strong>し、リモートから<strong>再クローンすることと</strong>同等の道徳的な結果を得るためには、次のようにし<strong>ます</strong> 。
ko: <strong>프로젝트 디렉토리</strong> 를 <strong>지우고</strong> 원격에서 <strong>다시 복제</strong> 하는 것과 같은 도덕적 가치를 얻으려면 다음을 수행 <strong>하십시오</strong> .
ru: Чтобы получить моральный эквивалент <strong>удаления каталога проекта и повторного клонирования</strong> с удаленного компьютера, выполните следующие действия.
zh_cn: 从道德上讲， <strong>擦除项目目录并</strong>从远程<strong>重新克隆</strong>是：
