Repository: rueisnom/feedback
Catalog: xlf/16/28/08/8/1628088.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To see what files will be removed (without actually removing them):
es: Para ver qué archivos se eliminarán (sin eliminarlos realmente):
ja: どのようなファイルが削除されるかを確認するには(実際には削除せずに)。
ko: 실제로 제거하지 않고 제거 할 파일을 보려면 :
ru: Посмотреть,какие файлы будут удалены (без фактического удаления):
zh_cn: 要查看将删除哪些文件(没有实际删除)。

source: Use caution when doing this, though, and use <code>gitk</code> or a similar tool to double check source and destination. If you accidentally do this on the current branch (and git will not keep you from this), you may become confused, because the new branch content does not match the working tree, which did not change (to fix, update the branch again, to where it was before).
es: Sin embargo, <code>gitk</code> cuidado al hacer esto, y use gitk o una herramienta similar para verificar el origen y el destino. Si accidentalmente hace esto en la rama actual (y git no lo mantendr&aacute; alejado de esto), puede confundirse, porque el contenido de la nueva rama no coincide con el &aacute;rbol de trabajo, que no cambi&oacute; (para corregir, actualizar la rama nuevamente, a donde estaba antes).
ja: ただし、これを行う場合は注意してください。ソースと宛先を再確認するには、 <code>gitk</code> または同様のツールを使用してください。 現在のブランチで誤ってこれを行った場合（そしてgitがこれを妨げない）、新しいブランチのコンテンツが変更されていない作業ツリーと一致しないため、混乱する可能性があります（修正するには、ブランチを再度更新し、それが以前あった場所に）。
ko: <code>gitk</code> 작업을 수행 할 때는주의를 기울이고 gitk 또는 이와 유사한 도구를 사용하여 소스 및 대상을 다시 확인하십시오. 실수로 현재 브랜치 에서이 작업을 수행하고 git 이이 작업을 방해하지 않으면 새 브랜치 내용이 변경되지 않은 작업 트리와 일치하지 않기 때문에 혼란 스러울 수 있습니다 (수정, 다시 업데이트하기 위해, 이전의 위치로).
ru: При этом соблюдайте осторожность и используйте <code>gitk</code> или аналогичный инструмент для двойной проверки источника и назначения. Если вы случайно сделаете это в текущей ветке (и git не помешает вам), вы можете запутаться, потому что новое содержимое ветки не соответствует рабочему дереву, которое не изменилось (чтобы исправить, снова обновите ветку, туда, где это было раньше).
zh_cn: 但是，在执行此操作时请小心，并使用 <code>gitk</code> 或类似工具仔细检查源和目标。 如果您不小心在当前分支上执行此操作（并且git不会阻止您这样做），您可能会感到困惑，因为新分支内容与未更改的工作树不匹配（要修复，请再次更新分支，到之前的位置）。

source: Use the commands below. These commands will remove all untracked files from local git too
es: Use los comandos de abajo.Estos comandos también eliminarán todos los archivos no rastreados del git local
ja: 以下のコマンドを使用します。これらのコマンドは、ローカルの git からトラックされていないすべてのファイルを削除します。
ko: 아래 명령을 사용하십시오. 이 명령은 로컬 git에서도 추적되지 않은 모든 파일을 제거합니다.
ru: Используйте команды ниже.Эти команды также удалят все неотслеживаемые файлы из локального git'а.
zh_cn: 使用下面的命令。这些命令也将从本地git中删除所有未被跟踪的文件。

source: What you probably want to do, is reset to the head of origin or whatever you remote repository is called. I'd probably just do something like
es: Lo que probablemente quieras hacer,es reiniciar la cabeza de origen o como sea que se llame tu repositorio remoto.Probablemente haría algo como
ja: おそらくあなたがしたいことは、リモートリポジトリの名前が何であれ、オリジンのヘッドにリセットすることです。のようなことをします。
ko: 아마도 원한다면 헤드 오브 오리진 또는 원격 리포지토리가 무엇이든 재설정됩니다. 아마 그냥 뭔가를 할 것입니다
ru: Что вы,вероятно,захотите сделать,так это перезагрузить в заголовок исходного кода или как там вы называете удаленный репозиторий.Я бы,наверное,сделал что-нибудь вроде
zh_cn: 你可能要做的,就是重置到源头或者是你的远程存储库的名称。我可能只是做一些像

source: While use
es: Mientras que el uso
ja: 使用中
ko: 사용하는 동안
ru: В процессе использования
zh_cn: 在使用过程中

source: With all the changes together:
es: Con todos los cambios juntos:
ja: すべての変化を一緒にして
ko: 모든 변경 사항이 함께 :
ru: Со всеми изменениями вместе:
zh_cn: 随着所有的变化一起。

source: You can create the feature branch now and set master back without affecting the <em>worktree</em> (local filesystem) to avoid triggering builds, tests and trouble with file-locks:
es: Puede crear la rama de caracter&iacute;sticas ahora y volver a configurar el maestro sin afectar el <em>&aacute;rbol de trabajo</em> (sistema de archivos local) para evitar generar compilaciones, pruebas y problemas con los bloqueos de archivos:
ja: ここで機能ブランチを作成し、 <em>ワークツリー</em> （ローカルファイルシステム）に影響を与えずにマスターを元に戻し、ビルド、テスト、およびファイルロックのトラブルのトリガーを回避できます。
ko: 이제 기능 분기를 작성하고 작업 트리 (로컬 파일 시스템)에 영향을주지 않고 마스터를 설정하여 빌드, 테스트 및 파일 잠금 문제 발생을 방지 할 수 있습니다.
ru: Теперь вы можете создать ветку <em>компонентов</em> и вернуть master обратно, не затрагивая <em>рабочее дерево</em> (локальную файловую систему), чтобы избежать запуска сборок, тестов и проблем с блокировками файлов:
zh_cn: 您现在可以创建功能分支并重新设置master而不影响工作<em>树</em> （本地文件系统），以避免触发构建，测试和文件锁定问题：

source: how to clear your staging area (and possibly the working directory), so that <code>git status</code> says <code>nothing to commit, working directory clean.</code>
es: c&oacute;mo borrar su &aacute;rea de preparaci&oacute;n (y posiblemente el directorio de trabajo), para que el <code>git status</code> <code>nothing to commit, working directory clean.</code> diga nada que comprometer, limpiar el directorio de trabajo.
ja: ステージング領域（および場合によっては作業ディレクトリ）をクリアして、 <code>git status</code> <code>nothing to commit, working directory clean.</code> 示さ ないようにして、作業ディレクトリをクリーンにする方法。
ko: 준비 영역 (및 작업 디렉토리)을 지우는 방법으로 <code>git status</code> <code>nothing to commit, working directory clean.</code>
ru: как очистить вашу промежуточную область (и, возможно, рабочий каталог), чтобы <code>git status</code> <code>nothing to commit, working directory clean.</code> говорил о фиксации, рабочий каталог очищался.
zh_cn: 如何清除暂存区（可能还有工作目录），以便 <code>git status</code> <code>nothing to commit, working directory clean.</code>

source: how to reset a local branch to the point where the remote is
es: cómo reiniciar una sucursal local en el punto donde está el mando a distancia
ja: ローカルブランチをリモートにリセットする方法
ko: 원격 지점이있는 지점으로 로컬 지점을 재설정하는 방법
ru: как сбросить локальное ответвление до точки,где находится удаленный.
zh_cn: 如何将本地分支重置到远程的位置上

source: note, you should checkout to another branch to be able to delete required branch
es: nota,usted debe pagar a otra sucursal para poder borrar la sucursal requerida
ja: 注意:必要なブランチを削除するには、別のブランチにチェックアウトする必要があります。
ko: 필요한 지점을 삭제할 수 있도록 다른 지점에 체크 아웃해야합니다.
ru: обратите внимание,что для того,чтобы иметь возможность удалить нужное ответвление,вам необходимо обратиться в другое ответвление.
zh_cn: 注意,你应该结账到另一个分支,以便能够删除所需的分支。

source: to preserve branch_name's conflicting changes. Otherwise use a mergetool with <code>git mergetool</code>.
es: para preservar los cambios conflictivos de branch_name. De lo contrario, use mergetool con <code>git mergetool</code> .
ja: branch_nameの競合する変更を保持します。 それ以外の場合は、 <code>git mergetool</code> で mergetoolを使用します。
ko: branch_name의 충돌하는 변경 사항을 보존합니다. 그렇지 않으면 <code>git mergetool</code> 과 함께 mergetool을 사용하십시오.
ru: чтобы сохранить конфликтующие изменения branch_name. В противном случае используйте mergetool с <code>git mergetool</code> .
zh_cn: 保留branch_name冲突的更改。 否则，请使用带有 <code>git mergetool</code> 的mergetool 。

source: to remove local files
es: para eliminar los archivos locales
ja: ローカルファイルを削除する
ko: 로컬 파일을 제거하려면
ru: для удаления локальных файлов
zh_cn: 移除本地文件

source: to totally reset branch
es: para reiniciar totalmente la rama
ja: ブランチを完全にリセットする
ko: 지점을 완전히 재설정
ru: полностью сбросить ветку
zh_cn: 重设分支

source: was underrated (<strong>-d</strong> to remove directories). Thanks!
es: fue subestimado ( <strong>-d</strong> para eliminar directorios). &iexcl;Gracias!
ja: 過小評価されました（ディレクトリを削除するには<strong>-d</strong> ）。 ありがとう！
ko: 과소 평가되었습니다 (디렉토리를 제거하려면 <strong>-d</strong> ). 감사!
ru: был недооценен ( <strong>-d</strong> для удаления каталогов). Спасибо!
zh_cn: 被低估了（ <strong>-d</strong>删除目录）。 谢谢！

source: xkcd: Git
ko: xkcd : 힘내
ru: xkcd:Гит
