Repository: rueisnom/feedback
Catalog: xlf/40/92/86/409286.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note: default connection timezone is the server timezone, but this can (should) be changed per session (see <code>SET time_zone = ...</code>).
es: Nota: la zona horaria de conexi&oacute;n predeterminada es la zona horaria del servidor, pero esto puede (deber&iacute;a) cambiarse por sesi&oacute;n (consulte <code>SET time_zone = ...</code> ).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：デフォルトの接続タイムゾーンはサーバーのタイムゾーンですが、これはセッションごとに変更できます（設定する必要があります）（</font></font> <code>SET time_zone = ...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照</font><font style="vertical-align: inherit;">）。</font></font>
ko: 참고 : 기본 연결 시간대는 서버 시간대이지만 세션마다 변경할 수 있습니다 ( <code>SET time_zone = ...</code> 참조).
ru: Примечание: часовой пояс соединения по умолчанию - часовой пояс сервера, но его можно (нужно) изменить за сеанс (см. <code>SET time_zone = ...</code> ).
zh_cn: 注意：默认连接时区是服务器时区，但是可以（应该）在每个会话中更改它（请参阅 <code>SET time_zone = ...</code> ）。

source: On the other hand, for values that represent system time like payment transactions, table modifications or logging, always use timestamps. The system will not be affected by moving the server to another time zone, or when comparing between servers in different timezones.
es: Por otra parte,para los valores que representan la hora del sistema,como las transacciones de pago,las modificaciones de tablas o el registro,utilice siempre marcas de tiempo.El sistema no se verá afectado por el traslado del servidor a otra zona horaria,o cuando se comparen servidores en diferentes zonas horarias.
ja: 一方、支払いトランザクションやテーブルの変更、ロギングのようにシステムの時間を表す値には、常にタイムスタンプを使用します。サーバを別のタイムゾーンに移動しても、異なるタイムゾーンのサーバ間で比較しても、システムに影響はありません。
ko: 반면 지불 트랜잭션, 테이블 수정 또는 로깅과 같은 시스템 시간을 나타내는 값에는 항상 타임 스탬프를 사용하십시오. 서버를 다른 시간대로 이동하거나 다른 시간대의 서버를 비교해도 시스템에는 영향을 미치지 않습니다.
ru: С другой стороны,для значений,представляющих системное время,таких как платежные транзакции,изменение таблиц или протоколирование,всегда используйте временные метки.Перемещение сервера в другой часовой пояс или сравнение между серверами в разных часовых поясах не повлияет на работу системы.
zh_cn: 另一方面,对于代表系统时间的值,如支付事务、表修改或日志记录等,一定要使用时间戳。将服务器移到其他时区,或者在不同时区的服务器之间进行比较时,系统不会受到影响。

source: Reference taken from this Article:
es: Referencia tomada de este artículo:
ja: 参考文献はこの記事から引用しています。
ko: 이 기사에서 가져온 참조 :
ru: Ссылка взята из этой статьи:
zh_cn: 参考文献摘自本条。

source: Should I use the datetime or timestamp data type in MySQL
es: ¿Debería usar el tipo de datos de fecha y hora en MySQL
ja: MySQL で datetime と timestamp のどちらのデータ型を使用するか?
ko: MySQL에서 datetime 또는 timestamp 데이터 형식을 사용해야합니까?
ru: Должен ли я использовать тип данных "дата" или "время" в MySQL.
zh_cn: 我应该在MySQL中使用日期时间戳数据类型还是时间戳数据类型?

source: So for values that represent user time like an appointment or a schedule, datetime is better. It allows the user to control the exact date and time desired, regardless of the server settings. The set time is the set time, not affected by the server's time zone, the user's time zone, or by changes in the way daylight savings time is calculated (yes it does change).
es: Así que para los valores que representan el tiempo del usuario como una cita o un horario,la hora de la fecha es mejor.Permite al usuario controlar la fecha y hora exacta deseada,independientemente de la configuración del servidor.La hora establecida es la hora fijada,no se ve afectada por la zona horaria del servidor,la zona horaria del usuario o por los cambios en la forma de calcular el horario de verano (sí que cambia).
ja: そのため、予定やスケジュールのようにユーザーの時間を表す値にはdatetimeが適しています。これにより、サーバーの設定に関係なく、ユーザーが希望する正確な日時を制御することができます。設定された時間は設定された時間であり、サーバのタイムゾーン、ユーザのタイムゾーン、サマータイムの計算方法の変更には影響されません(はい、変更されます)。
ko: 따라서 약속 또는 일정과 같은 사용자 시간을 나타내는 값의 경우 날짜 시간이 더 좋습니다. 사용자는 서버 설정에 관계없이 원하는 정확한 날짜와 시간을 제어 할 수 있습니다. 설정 시간은 서버 시간대, 사용자 시간대 또는 일광 절약 시간 계산 방식의 변경 (예 : 변경)의 영향을받지 않는 설정 시간입니다.
ru: Поэтому для значений,которые представляют время пользователя,таких как встреча или расписание,дата лучше.Это позволяет пользователю контролировать точную дату и время,независимо от настроек сервера.Установленное время-это установленное время,на которое не влияют часовой пояс сервера,часовой пояс пользователя или изменения в способе расчета летнего времени (да,оно меняется).
zh_cn: 所以,对于代表用户时间的值,比如约会或日程表,datetime比较好。它可以让用户控制所需的准确日期和时间,不受服务器设置的影响。设定的时间就是设定好的时间,不受服务器的时区、用户的时区、或夏令时的计算方式的变化影响(没错,它确实会变化)。

source: So it only matters when you have &mdash; or may in the future have &mdash; synchronized clusters across time zones.
es: Por lo tanto, solo es importante cuando tiene, o puede tener en el futuro tener, cl&uacute;steres sincronizados en todas las zonas horarias.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、タイムゾーン間でクラスターを同期している場合、または将来的には同期している場合にのみ問題になります。</font></font>
ko: 따라서 시간대에 따라 클러스터를 동기화했거나 향후 동기화해야 할 때만 중요합니다.
ru: Так что это имеет значение, только если у вас есть - или, возможно, в будущем - синхронизированные кластеры по часовым поясам.
zh_cn: 因此，只有在跨时区拥有或将来有同步集群时，才有意义。

source: So suppose you are in USA and getting data from a server which has a time zone of USA. Then you will get the date and time according to the USA time zone. The timestamp data type column always get updated automatically when its row gets updated. So it can be useful to track when a particular row was updated last time.
es: Así que supongamos que estás en EE.UU.y obtienes datos de un servidor que tiene una zona horaria de EE.UU.Entonces obtendrás la fecha y la hora según la zona horaria de EE.UU.La columna del tipo de datos de la marca de tiempo siempre se actualiza automáticamente cuando su fila se actualiza.Por lo tanto,puede ser útil para rastrear cuándo se actualizó una fila en particular la última vez.
ja: あなたがアメリカにいて、アメリカのタイムゾーンを持つサーバーからデータを取得しているとします。そうすると、アメリカのタイムゾーンに応じた日付と時刻を取得することができます。タイムスタンプデータ型のカラムは、その行が更新されると常に自動的に更新されます。そのため、特定の行がいつ最後に更新されたかを追跡するのに便利です。
ko: 따라서 미국에 있고 시간대가 미국인 서버에서 데이터를 얻는다고 가정하십시오. 그러면 미국 시간대에 따라 날짜와 시간이 표시됩니다. 타임 스탬프 데이터 형식 열은 행이 업데이트 될 때 항상 자동으로 업데이트됩니다. 따라서 마지막에 특정 행이 업데이트 된시기를 추적하는 것이 유용 할 수 있습니다.
ru: Так что предположим,что вы находитесь в США и получаете данные с сервера,который имеет часовой пояс США.Затем вы получите дату и время в соответствии с часовым поясом США.Столбец типа данных временных меток всегда обновляется автоматически при обновлении его строки.Поэтому может быть полезно отследить,когда определенный ряд был обновлен в прошлый раз.
zh_cn: 所以,假设你在美国,从一个美国时区的服务器上获取数据。那么你将根据美国时区得到日期和时间。时间戳数据类型的列总是在其行被更新时自动更新。因此,它可以用来追踪某一行最后一次更新的时间。

source: So, to summarize, I value this advantages of timestamp:
es: Así que,para resumir,valoro las ventajas de la marca de tiempo:
ja: というわけで、要約すると、私はこのtimestampのメリットを大切にしています。
ko: 요약하면 타임 스탬프의 장점을 다음과 같이 평가합니다.
ru: Итак,подытоживая,я ценю это преимущество временной метки:
zh_cn: 所以,总结一下,我看重的是时间戳的这个优点。

source: TIMESTAMP also affected by different TIME ZONE related setting. DATETIME is constant.
es: El TIMESTAMP también se ve afectado por diferentes ajustes relacionados con la ZONA HORARIA.La HORA es constante.
ja: TIMESTAMPは、異なるTIME ZONE関連の設定にも影響されます。DATETIMEは一定です。
ko: TIMESTAMP는 또한 다른 TIME ZONE 관련 설정의 영향을받습니다. DATETIME은 일정합니다.
ru: ВРЕМЕННАЯ УСТАНОВКА также зависит от различных настроек,связанных с зоной времени.ДАТЕТИКА является постоянной.
zh_cn: TIMESTAMP也会受到不同时区相关设置的影响。DATETIME是常数。

source: TIMESTAMP internally converted current time zone to UTC for storage, and during retrieval converted back to the current time zone. DATETIME can not do this.
es: TIMESTAMP convirtió internamente la zona horaria actual a UTC para el almacenamiento,y durante la recuperación se convirtió de nuevo a la zona horaria actual.DATETIME no puede hacer esto.
ja: TIMESTAMPは内部的に現在のタイムゾーンをUTCに変換して保存し、検索中に現在のタイムゾーンに戻しています。DATETIMEではこれができません。
ko: TIMESTAMP는 저장을 위해 내부적으로 현재 시간대를 UTC로 변환하고 검색하는 동안 현재 시간대로 다시 변환합니다. DATETIME은이 작업을 수행 할 수 없습니다.
ru: TIMESTAMP внутренне преобразовывает текущий часовой пояс в UTC для хранения,а во время извлечения преобразует обратно в текущий часовой пояс.DATETIME не может этого сделать.
zh_cn: TIMESTAMP内部将当前时区转换为UTC存储,并在检索时转换回当前时区。DATETIME不能这样做。

source: TIMESTAMP is 4 bytes Vs 8 bytes for DATETIME.
es: TIMESTAMP es 4 bytes contra 8 bytes para DATETIME.
ja: TIMESTAMPは4バイト、DATETIMEは8バイトです。
ko: TIMESTAMP는 DATETIME 동안 4 바이트 대 8 바이트입니다.
ru: TIMESTAMP-это 4 байта Vs 8 байт для DATETIME.
zh_cn: TIMESTAMP为4个字节,而DATETIME为8个字节。

source: TIMESTAMP is always in UTC (that is, elapsed seconds since 1970-01-01, in UTC), and your MySQL server auto-converts it to the date/time for the connection timezone. In the long-term, TIMESTAMP is the way to go because you know your temporal data will always be in UTC. For example, you won't screw your dates up if you migrate to a different server or if you change the timezone settings on your server.
es: TIMESTAMP está siempre en UTC (es decir,los segundos transcurridos desde 1970-01-01,en UTC),y su servidor MySQL lo convierte automáticamente a la fecha y hora de la zona horaria de conexión.A largo plazo,TIMESTAMP es el camino a seguir porque sabes que tus datos temporales siempre estarán en UTC.Por ejemplo,no arruinarás tus fechas si migras a un servidor diferente o si cambias la configuración de la zona horaria en tu servidor.
ja: TIMESTAMPは常にUTC(1970-01-01-01からの経過秒、UTC)であり、MySQLサーバはこれを接続タイムゾーンの日時に自動変換します。長期的には、時間データは常にUTCであることがわかっているため、TIMESTAMPを使用することをお勧めします。例えば、別のサーバに移行したり、サーバのタイムゾーン設定を変更したりしても、日付がおかしくなることはありません。
ko: TIMESTAMP는 항상 UTC이며 (즉, 1970-01-01 이후 UTC로 경과 한 초), MySQL 서버는이를 연결 시간대의 날짜 / 시간으로 자동 변환합니다. 장기적으로 TIMESTAMP는 시간 데이터가 항상 UTC로 표시되기 때문에 갈 길입니다. 예를 들어, 다른 서버로 마이그레이션하거나 서버의 시간대 설정을 변경해도 날짜가 정해지지 않습니다.
ru: TIMESTAMP всегда находится в UTC (т.е.истекшие секунды с 1970-01-01,в UTC),и твой MySQL-сервер автоматически преобразует его в дату часового пояса подключения.В долгосрочной перспективе TIMESTAMP-это путь,потому что ты знаешь,что твои временные данные всегда будут в UTC.Например,вы не испортите свои даты,если перейдете на другой сервер или измените настройки часового пояса на вашем сервере.
zh_cn: TIMESTAMP始终是以UTC为单位(即从1970-01-01-01起,以UTC为单位),你的MySQL服务器会自动将其转换为连接时间区的日期时间。从长远来看,TIMESTAMP是最佳选择,因为你知道你的时间数据永远是UTC。例如,如果你迁移到不同的服务器,或者改变服务器上的时区设置,你就不会把你的日期搞砸了。

source: TIMESTAMP is four bytes vs eight bytes for DATETIME.
es: TIMESTAMP es cuatro bytes contra ocho bytes para DATETIME.
ja: TIMESTAMPは4バイトで、DATETIMEは8バイトです。
ko: TIMESTAMP는 DATETIME의 경우 4 바이트 대 8 바이트입니다.
ru: TIMESTAMP-это четыре байта против восьми байтов для DATETIME.
zh_cn: TIMESTAMP为4个字节,而DATETIME为8个字节。

source: TIMESTAMP is still limited to 1970-2038
es: TIMESTAMP está todavía limitado a 1970-2038
ja: TIMESTAMPはまだ1970年から2038年までに限定されています。
ko: TIMESTAMP는 여전히 1970-2038로 제한됩니다
ru: ТИМЕСТАМП по-прежнему ограничен 1970-2038 гг.
zh_cn: TIMESTAMP仍然限于1970年至2038年。

source: TIMESTAMP supported range: &lsquo;1970-01-01 00:00:01&prime; UTC to &lsquo;2038-01-19 03:14:07&prime; UTC DATETIME supported range: &lsquo;1000-01-01 00:00:00&prime; to &lsquo;9999-12-31 23:59:59&prime;
es: Rango admitido por TIMESTAMP: '1970-01-01 00:00:01' UTC a '2038-01-19 03:14:07' UTC DATETIME rango admitido: '1000-01-01 00:00:00' a '9999 -12-31 23:59:59 &prime;
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TIMESTAMPがサポートする範囲： '1970-01-01 00:00:01' UTCから '2038-01-19 03:14:07' UTC DATETIMEがサポートする範囲： '1000-01-01 00:00:00'から '9999 -12-31 23:59:59 &prime;</font></font>
ko: TIMESTAMP 지원 범위 : '1970-01-01 00:00:01'UTC ~ '2038-01-19 03:14:07'UTC DATETIME 지원 범위 : '1000-01-01 00:00:00'~ '9999 -12-31 23:59:59 &prime;
ru: Диапазон поддерживаемых TIMESTAMP: '1970-01-01 00:00:01' UTC до '2038-01-19 03:14:07' DTC СРОК ПОСТАВКИ UTC: '1000-01-01 00:00:00' до '9999 -12-31 23:59:59 &prime;
zh_cn: 支持的TIMESTAMP范围：'1970-01-01 00:00:01'UTC至'2038-01-19 03:14:07'UTC DATETIME支持的范围：'1000-01-01 00:00:00'至'9999 -12-31 23:59:59&prime;

source: TIMESTAMP used to track changes to records, and update every time when the record is changed. DATETIME used to store specific and static value which is not affected by any changes in records.
es: TIMESTAMP se utiliza para rastrear los cambios en los registros,y actualizar cada vez que se cambia el registro.DATETIME utilizado para almacenar un valor específico y estático que no se ve afectado por ningún cambio en los registros.
ja: TIMESTAMP は、レコードの変更を追跡するために使用され、レコードが変更されるたびに更新されます。DATETIMEは、レコードの変更に影響されない特定の静的な値を格納するために使用されます。
ko: TIMESTAMP는 레코드 변경 사항을 추적하고 레코드가 변경 될 때마다 업데이트하는 데 사용됩니다. DATETIME은 레코드 변경에 영향을받지 않는 특정 정적 값을 저장하는 데 사용됩니다.
ru: TIMESTAMP используется для отслеживания изменений в записях,и обновляется каждый раз при изменении записи.DATETIME используется для хранения специфического и статического значения,на которое не влияют никакие изменения в записях.
zh_cn: TIMESTAMP用于跟踪记录的变化,并在每次记录变化时更新。DATETIME用于存储特定的静态值,不受记录变化的影响。

source: The DATETIME type is used when you need values that contain both date and time information. MySQL retrieves and displays DATETIME values in &lsquo;YYYY-MM-DD HH:MM:SS&rsquo; format. The supported range is &rsquo;1000-01-01 00:00:00&prime; to &rsquo;9999-12-31 23:59:59&prime;.
es: El tipo DATETIME se usa cuando necesita valores que contienen informaci&oacute;n de fecha y hora. MySQL recupera y muestra los valores DATETIME en formato 'AAAA-MM-DD HH: MM: SS'. El rango admitido es '1000-01-01 00:00:00' a '9999-12-31 23:59:59'.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DATETIMEタイプは、日付と時刻の両方の情報を含む値が必要な場合に使用されます。</font><font style="vertical-align: inherit;">MySQLは 'YYYY-MM-DD HH：MM：SS'形式でDATETIME値を取得して表示します。</font><font style="vertical-align: inherit;">サポートされる範囲は「1000-01-01 00:00:00」から「9999-12-31 23:59:59」です。</font></font>
ko: DATETIME 유형은 날짜 및 시간 정보가 모두 포함 된 값이 필요할 때 사용됩니다. MySQL은 'YYYY-MM-DD HH : MM : SS'형식으로 DATETIME 값을 검색하고 표시합니다. 지원되는 범위는 '1000-01-01 00:00:00'~ '9999-12-31 23:59:59'입니다.
ru: Тип DATETIME используется, когда вам нужны значения, которые содержат как дату, так и время. MySQL извлекает и отображает значения DATETIME в формате &laquo;ГГГГ-ММ-ДД ЧЧ: ММ: СС&raquo;. Поддерживаемый диапазон: от 1000-01-01 от 00:00:00 до 9999-12-31 23:59:59.
zh_cn: 当您需要同时包含日期和时间信息的值时，将使用DATETIME类型。 MySQL检索并以'YYYY-MM-DD HH：MM：SS'格式显示DATETIME值。 支持的范围是'1000-01-01 00:00:00'至'9999-12-31 23:59:59'。

source: The DATETIME type is used when you need values that contain both date and time information. MySQL retrieves and displays DATETIME values in 'YYYY-MM-DD HH:MM:SS' format. The supported range is '1000-01-01 00:00:00' to '9999-12-31 23:59:59'.
es: El tipo DATETIME se utiliza cuando se necesitan valores que contengan información tanto de fecha como de hora.MySQL recupera y muestra los valores de DATETIME en formato 'YYYY-MM-DD HH:MM:SS'.El rango soportado es de '1000-01-01 00:00:00' a '9999-12-31 23:59:59'.
ja: DATETIME タイプは、日付と時刻の両方の情報を含む値が必要な場合に使用されます。MySQLは、「YYYY-MM-DD HH:MM:SS」形式のDATETIME値を取得して表示します。サポートされている範囲は、「1000-01-01 00:00:00」から「9999-12-31 23:59:59」です。
ko: DATETIME 유형은 날짜 및 시간 정보가 모두 포함 된 값이 필요할 때 사용됩니다. MySQL은 'YYYY-MM-DD HH : MM : SS'형식으로 DATETIME 값을 검색하고 표시합니다. 지원되는 범위는 '1000-01-01 00:00:00'~ '9999-12-31 23:59:59'입니다.
ru: Тип DATETIME используется,когда вам нужны значения,содержащие информацию как о дате,так и о времени.MySQL извлекает и отображает значения DATETIME в формате 'YYYY-MM-DD HH:MM:SS'.Поддерживается диапазон от '1000-01-01 00:00:00' до '9999-12-31 23:59:59'.
zh_cn: DATETIME类型用于需要同时包含日期和时间信息的值时。MySQL以'YYY-MM-DD HH:MM:SS'格式检索和显示DATETIME值。支持的范围是'1000-01-01-01 00:00:00:00'到'9999-12-31 23:59:59:59'。

source: The TIMESTAMP data type has a range of &rsquo;1970-01-01 00:00:01&prime; UTC to &rsquo;2038-01-09 03:14:07&prime; UTC. It has varying properties, depending on the MySQL version and the SQL mode the server is running in.
es: El tipo de datos TIMESTAMP tiene un rango de '1970-01-01 00:00:01' UTC a '2038-01-09 03:14:07' UTC. Tiene diferentes propiedades, seg&uacute;n la versi&oacute;n de MySQL y el modo SQL en el que se ejecuta el servidor.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TIMESTAMPデータ型の範囲は、 '1970-01-01 00:00:01' UTCから '2038-01-09 03:14:07' UTCです。</font><font style="vertical-align: inherit;">MySQLのバージョンとサーバーが実行されているSQLモードに応じて、さまざまなプロパティがあります。</font></font>
ko: TIMESTAMP 데이터 유형의 UTC 범위는 '1970-01-01 00:00:01'UTC에서 '2038-01-09 03:14:07'UTC입니다. MySQL 버전과 서버가 실행중인 SQL 모드에 따라 다양한 속성이 있습니다.
ru: Тип данных TIMESTAMP имеет диапазон от '1970-01-01 00:00:01' UTC до '2038-01-09 03:14:07' UTC. Он имеет различные свойства в зависимости от версии MySQL и режима SQL, в котором работает сервер.
zh_cn: TIMESTAMP数据类型的UTC范围为'1970-01-01 00:00:01'UTC至'2038-01-09 03:14:07'UTC。 它具有不同的属性，具体取决于运行服务器的MySQL版本和SQL模式。

source: The TIMESTAMP data type has a range of '1970-01-01 00:00:01' UTC to '2038-01-09 03:14:07' UTC. It has varying properties, depending on the MySQL version and the SQL mode the server is running in.
es: El tipo de datos de TIMESTAMP tiene un rango de '1970-01-01 00:00:01' UTC a '2038-01-09 03:14:07' UTC.Tiene varias propiedades,dependiendo de la versión de MySQL y el modo SQL en el que se ejecuta el servidor.
ja: TIMESTAMP データ型は、'1970-01-01 00:00:00:01' UTC から '2038-01-09 03:14:07' UTC までの範囲を持ちます。これは、MySQL のバージョンとサーバが実行している SQL モードによってプロパティが異なります。
ko: TIMESTAMP 데이터 유형의 범위는 '1970-01-01 00:00:01'UTC에서 '2038-01-09 03:14:07'UTC입니다. MySQL 버전과 서버가 실행중인 SQL 모드에 따라 다양한 속성이 있습니다.
ru: Тип данных TIMESTAMP имеет диапазон от '1970-01-01 00:00:01' UTC до '2038-01-09 03:14:07' UTC.Он имеет различные свойства,в зависимости от версии MySQL и режима SQL,в котором работает сервер.
zh_cn: TIMESTAMP数据类型的范围是'1970-01-01-01 00:00:00:01'UTC到'2038-01-09 03:14:07'UTC。它有不同的属性,取决于服务器运行的MySQL版本和SQL模式。

source: The below examples show how the <code>TIMESTAMP</code> date type changed the values after changing the <code>time-zone to 'america/new_york'</code> where <code>DATETIME</code>is unchanged.
es: Los siguientes ejemplos muestran c&oacute;mo el tipo de fecha <code>TIMESTAMP</code> cambi&oacute; los valores despu&eacute;s de cambiar la <code>time-zone to 'america/new_york'</code> donde <code>DATETIME</code> no cambia.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下の例は</font><font style="vertical-align: inherit;">、</font> <code>time-zone to 'america/new_york'</code> <font style="vertical-align: inherit;">に変更した後に</font><font style="vertical-align: inherit;">、</font></font> <code>TIMESTAMP</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">日付タイプが値を</font><font style="vertical-align: inherit;">どのように</font><font style="vertical-align: inherit;">変更した</font><font style="vertical-align: inherit;">かを示してい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ここで、</font> <code>DATETIME</code> <font style="vertical-align: inherit;">は変更されていません。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: 아래 예제는 <code>time-zone to 'america/new_york'</code> 변경 한 후 <code>TIMESTAMP</code> 날짜 유형이 값을 어떻게 변경했는지 보여줍니다. 여기서 <code>DATETIME</code> 은 변경되지 않습니다.
ru: Приведенные ниже примеры показывают, как тип даты <code>TIMESTAMP</code> изменил значения после изменения <code>time-zone to 'america/new_york'</code> где <code>DATETIME</code> не изменяется.
zh_cn: 下面的示例显示在将 <code>DATETIME</code> 保持不变的 <code>time-zone to 'america/new_york'</code> 更改为&ldquo; america / new_york&rdquo;后， <code>TIMESTAMP</code> 日期类型如何更改值。

source: The main difference is that DATETIME is constant while TIMESTAMP is affected by the <code>time_zone</code> setting.
es: La principal diferencia es que DATETIME es constante mientras que TIMESTAMP se ve afectado por la configuraci&oacute;n de <code>time_zone</code> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主な違いは、TIMESTAMPが</font></font> <code>time_zone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設定の</font><font style="vertical-align: inherit;">影響を受ける一方で、DATETIMEは定数であること</font><font style="vertical-align: inherit;">です。</font></font>
ko: 주요 차이점은 DATETIME은 일정하고 TIMESTAMP는 <code>time_zone</code> 설정의 영향을받는 것입니다.
ru: Основным отличием является то, что DATETIME является постоянным, в то время как TIMESTAMP зависит от настройки <code>time_zone</code> .
zh_cn: 主要区别在于DATETIME是常数，而TIMESTAMP受 <code>time_zone</code> 设置影响。

source: The major difference is
es: La mayor diferencia es
ja: 大きな違いは
ko: 가장 큰 차이점은
ru: Главное отличие состоит в том,что
zh_cn: 主要的区别在于

source: The timestamp data type stores date and time, but in UTC format, not in the current timezone format as datetime does. And when you fetch data, timestamp again converts that into the current timezone time.
es: El tipo de datos de marca de tiempo almacena la fecha y la hora,pero en formato UTC,no en el formato de zona horaria actual como lo hace la fecha y la hora.Y cuando buscas datos,el sello de tiempo vuelve a convertirlo en la hora de la zona horaria actual.
ja: timestampデータ型は日付と時刻を保存しますが、datetimeのように現在のタイムゾーンのフォーマットではなく、UTCフォーマットで保存されます。そして、データを取得するときには、Timestampはそれを現在のタイムゾーンの時間に変換します。
ko: 타임 스탬프 데이터 형식은 날짜 및 시간을 저장하지만 datetime처럼 현재 시간대 형식이 아닌 UTC 형식으로 저장합니다. 그리고 데이터를 가져올 때 타임 스탬프는 다시 현재 시간대 시간으로 변환합니다.
ru: Тип данных метки времени хранит дату и время,но в формате UTC,а не в текущем формате часового пояса,как это делает дата.И когда вы получаете данные,метка времени снова преобразует их в текущее время часового пояса.
zh_cn: 时间戳数据类型存储日期和时间,但以UTC格式存储,而不是像datetime那样以当前时区格式存储。而当你获取数据时,timestamp会再次将其转换为当前时区时间。
