Repository: rueisnom/feedback
Catalog: xlf/40/92/86/409286.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: DATETIME can now be <strong>automatically</strong> set to the current time value <a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198">How do you set a default value for a MySQL Datetime column?</a>
es: DATETIME ahora se puede configurar <strong>autom&aacute;ticamente</strong> en el valor de hora actual <a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198">&iquest;C&oacute;mo se configura un valor predeterminado para una columna MySQL Datetime?</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DATETIMEに</font><font style="vertical-align: inherit;">現在の時刻値を</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自動的に</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設定</font><font style="vertical-align: inherit;">できるようになり</font></font><a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ましたMySQLの日時列のデフォルト値をどのように設定しますか？</font></font></a>
ko: DATETIME을 현재 시간 값 <strong>으로 자동</strong> 설정할 수 있습니다 <a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198">. MySQL Datetime 열의 기본값을 어떻게 설정합니까?</a>
ru: DATETIME теперь можно <strong>автоматически</strong> установить на текущее значение времени. <a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198">Как установить значение по умолчанию для столбца MySQL Datetime?</a>
zh_cn: 现在可以将DATETIME <strong>自动</strong>设置为当前时间值。 <a href="https://stackoverflow.com/questions/168736/how-do-you-set-a-default-value-for-a-mysql-datetime-column/10603198#10603198">如何为MySQL Datetime列设置默认值？</a>

source: DATETIME is constant while TIMESTAMP is effected by the time_zone setting.
es: DATETIME es constante mientras que TIMESTAMP es afectado por el ajuste de la zona horaria.
ja: DATETIMEは一定ですが、TIMESTAMPはtime_zone設定の影響を受けます。
ko: DATETIME은 일정하며 TIMESTAMP는 time_zone 설정에 영향을받습니다.
ru: ДАТЕТИКА является постоянной,в то время как ВРЕМЕННАЯ УСТАНОВКА производится установкой time_zone.
zh_cn: DATETIME是常数,而TIMESTAMP受时区设置的影响。

source: Depends on application, really.
es: Depende de la aplicación,en realidad.
ja: 用途によりますね、本当に。
ko: 실제로 응용 프로그램에 따라 다릅니다.
ru: Зависит от приложения,правда.
zh_cn: 要看应用,真的。

source: Example with AngularJs
es: Ejemplo con AngularJs
ja: AngularJsでの例
ko: AngularJs 예제
ru: Пример с угловыми Js
zh_cn: 使用AngularJs的例子

source: For all this reasons, I choose UTC &amp; timestamp fields where posible. And I avoid headaches ;)
es: Por todas estas razones, elijo los campos UTC y marca de tiempo cuando sea posible. Y evito dolores de cabeza;)
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このすべての理由から、可能な場合はUTCおよびタイムスタンプフィールドを選択します。</font><font style="vertical-align: inherit;">そして私は頭痛を避けます;）</font></font>
ko: 이 모든 이유로, 가능한 UTC 및 타임 스탬프 필드를 선택합니다. 그리고 나는 두통을 피한다.)
ru: По всем этим причинам я выбираю поля UTC и отметки времени, где это возможно. И я избегаю головных болей;)
zh_cn: 由于所有这些原因，我在可能的地方选择UTC和时间戳字段。 而且我避免头痛;）

source: For example, consider a <code>user</code> table with a <strong>REGISTRATION DATE</strong> field. In that <code>user</code> table, if you want to know the last logged in time of a particular user, go with a field of <strong>timestamp</strong> type so that the field gets updated.
es: Por ejemplo, considere una tabla de <code>user</code> con un campo <strong>FECHA DE REGISTRO</strong> . En esa tabla de <code>user</code> , si desea conocer la &uacute;ltima hora de inicio de sesi&oacute;n de un usuario en particular, vaya con un campo de tipo de <strong>marca</strong> de <strong>tiempo</strong> para que el campo se actualice.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">REGISTRATION DATE</font></strong><font style="vertical-align: inherit;">フィールドを</font><font style="vertical-align: inherit;">持つ</font></font> <code>user</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テーブルを</font><font style="vertical-align: inherit;">考えてみ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">その</font> <code>user</code> <font style="vertical-align: inherit;">テーブルで、特定のユーザーが最後にログインした時刻を知りたい場合は、</font><strong><font style="vertical-align: inherit;">タイムスタンプ</font></strong><font style="vertical-align: inherit;">タイプの</font><font style="vertical-align: inherit;">フィールドを</font><font style="vertical-align: inherit;">使用して、フィールドが更新されるようにします。</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ko: 예를 들어, <strong>REGISTRATION DATE</strong> 필드가있는 <code>user</code> 테이블을 고려하십시오. 해당 <code>user</code> 테이블에서 특정 사용자의 마지막 로그인 시간을 알고 싶다면 필드가 업데이트되도록 <strong>타임 스탬프</strong> 유형 필드로 이동하십시오.
ru: Например, рассмотрим <code>user</code> таблицу с полем <strong>ДАТА РЕГИСТРАЦИИ</strong> . В этой <code>user</code> таблице, если вы хотите узнать время последнего входа определенного пользователя, укажите поле типа <strong>отметки времени,</strong> чтобы оно обновлялось.
zh_cn: 例如，考虑一个带有<strong>REGISTRATION DATE</strong>字段的 <code>user</code> 表。 在该 <code>user</code> 表中，如果您想知道特定用户的上次登录时间，请使用<strong>时间戳</strong>类型的字段，以便该字段得到更新。

source: For more details you can read the blog post <em><a href="http://codebucket.co.in/timestamp-vs-datetime/">Timestamp Vs Datetime </a></em>.
es: Para obtener m&aacute;s detalles, puede leer la publicaci&oacute;n del blog <em><a href="http://codebucket.co.in/timestamp-vs-datetime/">Timestamp Vs Datetime</a></em> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細については、ブログ投稿</font></font><em><a href="http://codebucket.co.in/timestamp-vs-datetime/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Timestamp Vs Datetimeを</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧</font><em><font style="vertical-align: inherit;">ください</font></em><font style="vertical-align: inherit;">。</font></font>
ko: 자세한 내용은 블로그 게시물 <em><a href="http://codebucket.co.in/timestamp-vs-datetime/">Timestamp Vs Datetime을 참조하십시오</a></em> .
ru: Для более подробной информации вы можете прочитать в блоге <em><a href="http://codebucket.co.in/timestamp-vs-datetime/">Timestamp Vs Datetime</a></em> .
zh_cn: 有关更多详细信息，请阅读博客文章<em><a href="http://codebucket.co.in/timestamp-vs-datetime/">Timestamp Vs Datetime</a></em> 。

source: For your clients comfort you want to show them the times based on their preferred time zones without making them doing the math and convert the time to their meaningful timezone. all you need is to change the timezone and all your application code will be the same.<em>(Actually you should always define the timezone at the start of the application, or request processing in case of PHP applications)</em>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para la comodidad de sus clientes, desea mostrarles las horas en funci&oacute;n de sus zonas horarias preferidas sin hacer que hagan los c&aacute;lculos y convertir la hora a su zona horaria significativa. </font><font style="vertical-align: inherit;">todo lo que necesita es cambiar la zona horaria y todo el c&oacute;digo de su aplicaci&oacute;n ser&aacute; el mismo. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(En realidad, siempre debe definir la zona horaria al inicio de la aplicaci&oacute;n, o solicitar el procesamiento en caso de aplicaciones PHP)</font></font></em>
ja: クライアントが快適に過ごせるように、計算を行わずに時間を意味のあるタイムゾーンに変換せずに、希望するタイムゾーンに基づいて時間を表示したいとします。 タイムゾーンを変更するだけで、すべてのアプリケーションコードが同じになります。 <em>（実際には、アプリケーションの開始時に常にタイムゾーンを定義するか、PHPアプリケーションの場合はリクエスト処理を行う必要があります）</em>
ko: 고객의 편의를 위해 수학을 수행하지 않고 원하는 시간대를 기준으로 시간을 표시하고 시간을 의미있는 시간대로 변환하려고합니다. 시간대를 변경하기 만하면 모든 응용 프로그램 코드가 동일합니다. <em>(실제로 응용 프로그램을 시작할 때 시간대를 정의하거나 PHP 응용 프로그램의 경우 처리를 요청해야합니다)</em>
ru: Для удобства ваших клиентов вы хотите показать им время в зависимости от предпочитаемых часовых поясов, не заставляя их делать математику, и переводить время в значимый часовой пояс. все, что вам нужно, это изменить часовой пояс, и все ваши коды приложений будут одинаковыми. <em>(На самом деле вы всегда должны определять часовой пояс в начале приложения или обработку запросов в случае PHP-приложений)</em>
zh_cn: 为了让您的客户感到舒适，您想根据他们的首选时区向他们显示时间，而无需让他们进行数学运算并将时间转换为有意义的时区。 您所需要做的就是更改时区，所有应用程序代码都将相同。 <em>（实际上，您应该始终在应用程序启动时定义时区，或者在PHP应用程序的情况下请求处理）</em>

source: From my experiences, if you want a date field in which insertion happens only once and you don't want to have any update or any other action on that particular field, go with <strong>date time</strong>.
es: Seg&uacute;n mi experiencia, si desea un campo de fecha en el que la inserci&oacute;n se realice solo una vez y no desea tener ninguna actualizaci&oacute;n u otra acci&oacute;n en ese campo en particular, vaya con la <strong>fecha y hora</strong> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の経験から、挿入が1回だけ行われる日付フィールドが必要で、その特定のフィールドで更新やその他のアクションを実行したくない場合は、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">日付時刻を使用し</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: 내 경험에 따르면 삽입이 한 번만 발생하는 날짜 필드를 원하고 특정 필드에 대한 업데이트 또는 다른 작업을 원하지 않는 경우 <strong>date time으로</strong> 이동하십시오.
ru: Исходя из моего опыта, если вам нужно поле даты, в которое вставка происходит только один раз, и вы не хотите обновлять или выполнять какие-либо другие действия в этом конкретном поле, выберите <strong>дату и время</strong> .
zh_cn: 根据我的经验，如果您希望只在其中插入一次的日期字段，并且不想对该特定字段进行任何更新或任何其他操作，请选择<strong>date time</strong> 。

source: Here are some cases that will make you regret using <code>datetime</code> and wish that you stored your data in timestamps.
es: Estos son algunos casos que har&aacute;n que te arrepientas de usar <code>datetime</code> y deseen almacenar tus datos en marcas de tiempo.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは、</font></font> <code>datetime</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して後悔し</font><font style="vertical-align: inherit;">、データをタイムスタンプに格納したい場合があります。</font></font>
ko: 다음은 <code>datetime</code> 을 사용하여 후회하고 데이터를 타임 스탬프에 저장하기를 원하는 경우입니다.
ru: Вот несколько случаев, которые заставят вас сожалеть об использовании <code>datetime</code> и времени и пожелать, чтобы вы сохранили свои данные в метках времени.
zh_cn: 在某些情况下，您可能会后悔使用 <code>datetime</code> 并希望将数据存储在时间戳中。

source: I almost always prefer timestamps rather than datetime fields, because timestamps include the timezone implicitly. So, since the moment that the app will be accessed from users from different time zones and you want them to see dates and times in their local timezone, this field type makes it pretty easy to do it than if the data were saved in datetime fields.
es: Casi siempre prefiero los sellos de tiempo en lugar de los campos de fecha y hora,porque los sellos de tiempo incluyen la zona horaria implícitamente.Por lo tanto,desde el momento en que la aplicación será accedida por usuarios de diferentes zonas horarias y quieres que vean las fechas y horas en su zona horaria local,este tipo de campo hace que sea bastante fácil hacerlo que si los datos se guardaran en campos de fecha y hora.
ja: 私はほとんどの場合、datetimeフィールドよりもtimestampsフィールドの方が好きです。そのため、アプリが異なるタイムゾーンのユーザーからアクセスされ、ローカルタイムゾーンの日付と時刻を表示したい瞬間に、このフィールドタイプは、データがdatetimeフィールドに保存されている場合よりも、かなり簡単にそれを行うことができます。
ko: 타임 스탬프에는 표준 시간대가 암시 적으로 포함되므로 날짜 / 시간 필드보다는 타임 스탬프를 항상 선호합니다. 따라서 다른 시간대의 사용자가 앱을 액세스하고 현지 시간대로 날짜와 시간을 보려는 순간이 필드 유형을 사용하면 데이터가 날짜 시간 필드에 저장된 경우보다 쉽게 ​​수행 할 수 있습니다 .
ru: Я почти всегда предпочитаю метки времени,а не поля даты,потому что метки времени неявно включают часовой пояс.Итак,с того момента,как к приложению будут обращаться пользователи из разных часовых поясов,и вы хотите,чтобы они видели даты и время в своем локальном часовом поясе,этот тип поля делает это довольно простым,чем если бы данные были сохранены в полях даты.
zh_cn: 我几乎总是喜欢时间戳而不是日期时间字段,因为时间戳隐含了时区。因此,因为当用户从不同的时区访问应用程序的时候,你希望他们看到的日期和时间是在当地的时区,这种字段类型比起保存在日期时间字段中的数据更容易做到。

source: I always use DATETIME fields for anything other than row metadata (date created or modified).
es: Siempre utilizo los campos DATETIME para cualquier cosa que no sean metadatos de filas (fecha de creación o modificación).
ja: 私は、行のメタデータ(作成日や変更日)以外には、常にDATETIMEフィールドを使用しています。
ko: 항상 행 메타 데이터 (생성 또는 수정 된 날짜) 이외의 다른 용도로 DATETIME 필드를 사용합니다.
ru: Я всегда использую поля DATETIME для чего-либо,кроме метаданных строк (дата создания или изменения).
zh_cn: 除了行元数据(创建或修改日期)之外,我总是使用DATETIME字段。

source: I always use a Unix timestamp, simply to maintain sanity when dealing with a lot of datetime information, especially when performing adjustments for timezones, adding/subtracting dates, and the like. When comparing timestamps, this excludes the complicating factors of timezone and allows you to spare resources in your server side processing (Whether it be application code or database queries) in that you make use of light weight arithmetic rather then heavier date-time add/subtract functions.
es: Siempre utilizo una marca de tiempo Unix,simplemente para mantener la cordura cuando se trata de una gran cantidad de información de fecha y hora,especialmente cuando se realizan ajustes de zonas horarias,sumas y restas de fechas,y similares.Cuando se comparan las marcas de tiempo,esto excluye los factores complicados de la zona horaria y permite ahorrar recursos en el procesamiento del lado del servidor (ya sea código de aplicación o consultas a bases de datos),ya que se utiliza una aritmética ligera en lugar de las funciones de suma y resta de fecha y hora más pesadas.
ja: 私はいつもUnixのタイムスタンプを使っていますが、これは多くの日付情報を扱う時、特にタイムゾーンの調整や日付の追加・削除などを行う時に、正気を保つためです。タイムスタンプを比較する時に、タイムゾーンの複雑な要素を排除して、重い日付時間の加算減算関数ではなく、軽い演算を使うことで、サーバー側の処理(アプリケーションコードでもデータベースクエリでも)にリソースを割くことができます。
ko: 나는 항상 시간대를 조정하거나 날짜를 더하거나 뺄 때 등 많은 날짜 시간 정보를 다룰 때 정신을 유지하기 위해 항상 유닉스 타임 스탬프를 사용합니다. 타임 스탬프를 비교할 때, 이는 시간대의 복잡한 요소를 배제하고 서버 측 처리 (응용 프로그램 코드 또는 데이터베이스 쿼리 여부)에서 리소스를 여분으로 사용하는 것이 아니라 날짜-시간 더하기 / 빼기보다 가벼운 산술을 사용할 수 있도록합니다. 기능.
ru: Я всегда использую временную метку Unix,просто для поддержания здравого смысла при работе с большим количеством информации о дате,особенно при выполнении корректировок для часовых поясов,суммировании дат и т.п.При сравнении меток времени это исключает усложняющие факторы часового пояса и позволяет вам экономить ресурсы при обработке серверной стороны (будь то код приложения или запросы к базе данных)в том,что вы используете легкую арифметику,а не более тяжелые функции вычитания даты и времени.
zh_cn: 我总是使用Unix时间戳,只是为了在处理大量的日期时间信息时保持理智,特别是在执行时区调整、加减日期等操作时。当比较时间戳的时候,这排除了时间区的复杂因素,让你可以在服务器端处理时(不管是应用程序代码还是数据库查询)节省资源,因为你可以使用轻量级的算术,而不是使用较重的日期时间加减函数。

source: I found unsurpassed usefulness in TIMESTAMP's ability to auto update itself based on the current time without the use of unnecessary triggers. That's just me though, although TIMESTAMP is UTC like it was said.
es: Encontré una utilidad insuperable en la capacidad de TIMESTAMP de auto-actualizarse en base a la hora actual sin el uso de disparadores innecesarios.Pero eso es sólo para mí,aunque TIMESTAMP es UTC como se dijo.
ja: 余計なトリガーを使わずに、現在の時刻を元に自動更新してくれるTIMESTAMPの機能には、他に類を見ない便利さを感じました。とはいえ、TIMESTAMPは言われているようにUTCなのですが、それは私だけでしょうか。
ko: 불필요한 트리거를 사용하지 않고 현재 시간을 기반으로 자동 업데이트하는 TIMESTAMP 기능에서 탁월한 유용성을 발견했습니다. 비록 TIMESTAMP가 UTC처럼 말했지만 그것은 단지 나입니다.
ru: Я нашел непревзойденную полезность в возможности TIMESTAMP автоматически обновлять себя на основе текущего времени без использования ненужных триггеров.Однако,это только я,хотя TIMESTAMP-это UTC,как и было сказано.
zh_cn: 我发现TIMESTAMP的功能是无与伦比的,它可以根据当前时间自动更新,无需使用不必要的触发器。不过这只是我的看法,虽然TIMESTAMP是UTC,但就像上面说的那样。

source: I like a Unix timestamp, because you can convert to numbers and just worry about the number. Plus you add/subtract and get durations, etc. Then convert the result to Date in whatever format. This code finds out how much time in minutes passed between a timestamp from a document, and the current time.
es: Me gusta la marca de tiempo de Unix,porque puedes convertir a números y preocuparte por el número.Además,sumas,restas y obtienes duraciones,etc.Luego conviertes el resultado a Date en cualquier formato.Este código averigua cuánto tiempo en minutos pasó entre una marca de tiempo de un documento y la hora actual.
ja: Unixのタイムスタンプが好きなのは、数字に変換できて、数字だけを気にすることができるからです。さらに、減算して持続時間などを得ることができます。そして、その結果を任意の形式でDateに変換します。このコードは、ドキュメントからのタイムスタンプと現在の時刻との間にどれだけの時間が経過したかを分単位で調べます。
ko: 나는 숫자로 변환하고 숫자에 대해 걱정할 수 있기 때문에 유닉스 타임 스탬프를 좋아합니다. 또한 추가 / 빼기 및 지속 시간 등을 얻은 다음 결과를 형식에 관계없이 Date로 변환하십시오. 이 코드는 문서의 타임 스탬프와 현재 시간 사이의 시간 (분)을 확인합니다.
ru: Мне нравится Unix-тампа времени,потому что вы можете преобразовывать в числа и просто беспокоиться о номере.Плюс к этому,вы можете производить сложение,получать длительность и т.д.Затем конвертируете результат в Date в любом формате.Этот код узнает,сколько времени в минутах прошло между отметкой времени из документа и текущим временем.
zh_cn: 我喜欢Unix的时间戳,因为你可以转换为数字,只需要担心数字就可以了。再加上你可以加减法,得到持续时间等。然后将结果转换为Date,不管是什么格式,都可以。这段代码可以找出文档中的时间戳和当前时间之间的时间间隔,以分钟为单位。

source: I make this decision on a semantic base.
es: Tomo esta decisión sobre una base semántica.
ja: 私はこの判断をセマンティックベースで行っています。
ko: 나는이 결정을 시맨틱 기반으로한다.
ru: Я принимаю это решение на семантической основе.
zh_cn: 我做这个决定是有语义基础的。

source: I prefer using timestamp so to keep everything in one common raw format and format the data in PHP code or in your SQL query. There are instances where it comes in handy in your code to keep everything in plain seconds.
es: Prefiero usar la marca de tiempo para mantener todo en un formato común en bruto y formatear los datos en código PHP o en su consulta SQL.Hay casos en los que es útil en su código para mantener todo en segundos.
ja: 私はタイムスタンプを使用して、すべてのものを共通の生のフォーマットに保ち、PHPコードやSQLクエリでデータをフォーマットすることを好みます。あなたのコードの中で、すべてのものを平易な秒数で保持するのに便利な例があります。
ko: 타임 스탬프를 사용하여 모든 것을 하나의 공통 원시 형식으로 유지하고 데이터를 PHP 코드 또는 SQL 쿼리로 형식화합니다. 모든 것을 평범한 초 안에 유지하기 위해 코드에서 편리한 경우가 있습니다.
ru: Я предпочитаю использовать метку времени,чтобы сохранить все в одном общем необработанном формате и отформатировать данные в PHP-коде или в вашем SQL-запросе.Есть случаи,когда пригодится в вашем коде,чтобы все хранить в считанные секунды.
zh_cn: 我更喜欢使用时间戳,这样可以把所有的东西都保持在一个通用的原始格式中,并在PHP代码或SQL查询中格式化数据。在某些情况下,在你的代码中,它在你的代码中很有用,可以把所有的东西都保留在普通的秒数中。

source: I recommend using <strong>neither</strong> a DATETIME or a TIMESTAMP field. If you want to represent a specific day as a whole (like a birthday), then use a DATE type, but if you're being more specific than that, you're probably interested in recording an actual moment as opposed to a unit of time (day,week,month,year). Instead of using a DATETIME or TIMESTAMP, use a BIGINT, and simply store the number of milliseconds since the epoch (System.currentTimeMillis() if you're using Java). This has several advantages:
es: Recomiendo <strong>no</strong> usar un campo DATETIME o TIMESTAMP. Si desea representar un d&iacute;a espec&iacute;fico como un todo (como un cumplea&ntilde;os), use un tipo de FECHA, pero si est&aacute; siendo m&aacute;s espec&iacute;fico que eso, probablemente est&eacute; interesado en registrar un momento real en lugar de una unidad de tiempo (d&iacute;a, semana, mes, a&ntilde;o). En lugar de usar un DATETIME o TIMESTAMP, use un BIGINT y simplemente almacene el n&uacute;mero de milisegundos desde la &eacute;poca (System.currentTimeMillis () si est&aacute; usando Java). Esto tiene varias ventajas:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DATETIMEフィールドもTIMESTAMPフィールド</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><strong><font style="vertical-align: inherit;">ない</font></strong><font style="vertical-align: inherit;">ことをお勧めし</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">特定の日全体（誕生日など）を表す場合は、DATE型を使用しますが、それよりも具体的である場合は、単位の単位ではなく実際の瞬間を記録することにおそらく興味があります。時間（日、週、月、年）。</font><font style="vertical-align: inherit;">DATETIMEまたはTIMESTAMPを使用する代わりに、BIGINTを使用し、エポック（Javaを使用している場合はSystem.currentTimeMillis（））からのミリ秒数を格納します。</font><font style="vertical-align: inherit;">これにはいくつかの利点があります。</font></font>
ko: DATETIME 또는 TIMESTAMP 필드를 사용 <strong>하지 않는</strong> 것이 좋습니다. 특정 날짜를 전체 생일 (예 : 생일)로 나타내려면 DATE 유형을 사용하십시오. 그러나 그보다 더 구체적인 경우에는 단위가 아닌 실제 순간을 기록하는 데 관심이있을 것입니다. 시간 (일, 주, 월, 년). DATETIME 또는 TIMESTAMP를 사용하는 대신 BIGINT를 사용하고 신기원 이후의 시간 (밀리 초)을 저장하십시오 (Java를 사용하는 경우 System.currentTimeMillis ()). 여기에는 몇 가지 장점이 있습니다.
ru: Я рекомендую использовать <strong>ни</strong> поле DATETIME, ни поле TIMESTAMP. Если вы хотите представить конкретный день в целом (например, день рождения), тогда используйте тип DATE, но если вы более конкретны, вам, вероятно, будет интересно записать фактический момент, а не единицу измерения. время (день, неделя, месяц, год). Вместо использования DATETIME или TIMESTAMP, используйте BIGINT и просто сохраняйте количество миллисекунд с начала эпохи (System.currentTimeMillis (), если вы используете Java). Это имеет несколько преимуществ:
zh_cn: 我建议不要使用DATETIME或TIMESTAMP字段。 如果要表示一个特定的一天（例如生日），请使用DATE类型，但是如果要更具体一些，则可能有兴趣记录实际时刻而不是单位时间（天，周，月，年）。 而不是使用DATETIME或TIMESTAMP，而使用BIGINT，只需存储自历元以来的毫秒数（如果使用Java，则为System.currentTimeMillis（））。 这有几个优点：
