Repository: rueisnom/feedback
Catalog: xlf/40/92/86/409286.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I stopped using <code>datetime</code> in my applications after facing many problems and bugs related to time zones. <strong>IMHO using <code>timestamp</code> is better than <code>datetime</code> in most of the cases</strong>.
es: Dej&eacute; de usar <code>datetime</code> en mis aplicaciones despu&eacute;s de enfrentar muchos problemas y errores relacionados con las zonas horarias. <strong>En mi humilde opini&oacute;n, el uso de la <code>timestamp</code> es mejor que la <code>datetime</code> y hora en la mayor&iacute;a de los casos</strong> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイムゾーンに関連する多くの問題やバグに直面した後、アプリケーションで</font></font> <code>datetime</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用をやめました</font><font style="vertical-align: inherit;">。</font><strong><font style="vertical-align: inherit;">ほとんどの場合、</font></strong><strong> <code>timestamp</code> </strong></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用した私見</font><font style="vertical-align: inherit;">は</font> <code>datetime</code> <font style="vertical-align: inherit;">より優れてい</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: 표준 시간대와 관련된 많은 문제와 버그에 직면 한 후 응용 프로그램에서 <code>datetime</code> 사용을 중단했습니다. <strong>대부분의 경우 <code>timestamp</code> 사용하는 IMHO가 <code>datetime</code> 보다 낫습니다</strong> .
ru: Я перестал использовать <code>datetime</code> в своих приложениях после того, как столкнулся со многими проблемами и ошибками, связанными с часовыми поясами. <strong>ИМХО в большинстве случаев использовать <code>timestamp</code> лучше, чем <code>datetime</code> время</strong> .
zh_cn: 在遇到许多与时区有关的问题和错误之后，我停止在应用程序中使用 <code>datetime</code> 。 <strong>在大多数情况下，使用 <code>timestamp</code> IMHO优于 <code>datetime</code> 时间</strong> 。

source: I use a datetime field when the date/time can be set and changed arbitrarily. For example when a user can save later change appointments.
es: Utilizo un campo de fecha y hora cuando la fecha y hora puede ser fijada y cambiada arbitrariamente.Por ejemplo,cuando un usuario puede guardar más tarde las citas de cambio.
ja: 私はdatetimeフィールドを使用しています。例えば、ユーザーが後から変更した予定を保存することができる場合などです。
ko: 날짜 / 시간을 임의로 설정하고 변경할 수있는 날짜 / 시간 필드를 사용합니다. 예를 들어, 사용자가 나중에 변경 약속을 저장할 수있는 경우.
ru: Я использую поле даты,когда дата может быть установлена и изменена произвольно.Например,когда пользователь может сохранить позднее измененное время.
zh_cn: 当日期时间可以被设置和任意更改时,我使用了一个日期时间字段。例如,当用户可以保存以后更改预约时。

source: I use a timestamp when I need to record a (more or less) fixed point in time. For example when a record was inserted into the database or when some user action took place.
es: Utilizo una marca de tiempo cuando necesito registrar un punto (más o menos)fijo en el tiempo.Por ejemplo,cuando se inserta un registro en la base de datos o cuando se produce alguna acción del usuario.
ja: 私は、(多かれ少なかれ)一定の時点を記録する必要がある場合にタイムスタンプを使用します。例えば、レコードがデータベースに挿入された時や、ユーザーのアクションが行われた時などです。
ko: 고정 된 특정 시점을 기록해야 할 때 타임 스탬프를 사용합니다. 예를 들어 레코드가 데이터베이스에 삽입되었거나 일부 사용자 작업이 발생한 경우입니다.
ru: Я использую временную метку,когда мне нужно записать (более или менее)фиксированную точку во времени.Например,когда запись была вставлена в БД или когда произошло какое-либо действие пользователя.
zh_cn: 当我需要记录一个(或多或少)固定时间点时,我使用时间戳。例如,当一条记录被插入到数据库中时,或者是用户的某个动作发生时。

source: I would always use a Unix timestamp when working with MySQL and PHP. The main reason for this being the the default <a href="http://uk3.php.net/manual/en/function.date.php">date</a> method in PHP uses a timestamp as the parameter, so there would be no parsing needed.
es: Siempre usar&iacute;a una marca de tiempo Unix cuando trabaje con MySQL y PHP. La raz&oacute;n principal de esto es que el m&eacute;todo de <a href="http://uk3.php.net/manual/en/function.date.php">fecha</a> predeterminado en PHP usa una marca de tiempo como par&aacute;metro, por lo que no ser&iacute;a necesario analizar.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLとPHPを使用する場合は、常にUnixタイムスタンプを使用します。</font><font style="vertical-align: inherit;">これの主な理由は</font><font style="vertical-align: inherit;">、PHPの</font><font style="vertical-align: inherit;">デフォルトの</font></font><a href="http://uk3.php.net/manual/en/function.date.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">日付</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドがタイムスタンプをパラメーターとして使用するため、解析は必要ありません。</font></font>
ko: MySQL과 PHP로 작업 할 때는 항상 Unix 타임 스탬프를 사용합니다. PHP에서 기본 <a href="http://uk3.php.net/manual/en/function.date.php">날짜</a> 메소드가되는 주요 이유는 타임 스탬프를 매개 변수로 사용하므로 구문 분석이 필요하지 않습니다.
ru: Я всегда использовал бы метку времени Unix при работе с MySQL и PHP. Основной причиной этого является то, что метод <a href="http://uk3.php.net/manual/en/function.date.php">даты</a> по умолчанию в PHP использует метку времени в качестве параметра, поэтому анализ не требуется.
zh_cn: 在使用MySQL和PHP时，我总是会使用Unix时间戳。 这样做的主要原因是PHP中默认的<a href="http://uk3.php.net/manual/en/function.date.php">date</a>方法使用时间戳作为参数，因此不需要解析。

source: I'm working with PHP on the server side.
es: Estoy trabajando con PHP en el lado del servidor.
ja: サーバー側でPHPを使って仕事をしています。
ko: 서버 측에서 PHP로 작업하고 있습니다.
ru: Я работаю с PHP на стороне сервера.
zh_cn: 我在服务器端使用的是PHP。

source: I've converted my answer into article so more people can find this useful, <em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/">MySQL: Datetime Versus Timestamp Data Types</a></em>.
es: He convertido mi respuesta en un art&iacute;culo para que m&aacute;s personas puedan encontrar esto &uacute;til, <em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/">MySQL: Tipos de datos de fecha y hora y fecha y hora</a></em> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は私の回答を記事に変換したので、より多くの人がこの便利な</font></font><em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLを</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つけることができ</font><em><font style="vertical-align: inherit;">ます：MySQL：日時とタイムスタンプのデータ型</font></em><font style="vertical-align: inherit;">。</font></font>
ko: 더 많은 사람들이이 유용한 <em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/">MySQL을</a></em> 찾을 수 있도록 내 답변을 기사로 변환했습니다 <em>. Datetime vs. Timestamp Data Types</em> .
ru: Я преобразовал свой ответ в статью, чтобы больше людей могли найти это полезным, <em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/">MySQL: типы данных Datetime и Timestamp</a></em> .
zh_cn: 我已经将答案转换成文章，以便更多人可以找到有用的<em><a href="http://www.tech-recipes.com/rx/22599/mysql-datetime-vs-timestamp-data-type/">MySQL：Datetime与Timestamp数据类型</a></em> 。

source: If you are creating the table from <a href="http://en.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin</a> the default setting will update the <strong>timestamp</strong> field when a row update happens. If your timestamp filed is not updating with row update, you can use the following query to make a <strong>timestamp</strong> field get auto updated.
es: Si est&aacute; creando la tabla desde <a href="http://en.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin,</a> la configuraci&oacute;n predeterminada actualizar&aacute; el campo de <strong>marca de tiempo</strong> cuando se <strong>realice</strong> una actualizaci&oacute;n de fila. Si su marca de tiempo archivada no se actualiza con la actualizaci&oacute;n de fila, puede usar la siguiente consulta para hacer que un campo de <strong>marca de tiempo</strong> se actualice autom&aacute;ticamente.
ja: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/PhpMyAdmin"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">phpMyAdmin</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">からテーブルを作成している場合</font><font style="vertical-align: inherit;">、デフォルト設定では</font><font style="vertical-align: inherit;">、行の更新が発生したときに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイムスタンプ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールド</font><font style="vertical-align: inherit;">が更新されます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ファイルされたタイムスタンプが行更新で更新されない場合は、次のクエリを使用して、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイムスタンプ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールドを自動更新できます。</font></font>
ko: <a href="http://en.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin</a> 에서 테이블을 생성하는 경우 기본 설정은 행 업데이트가 발생할 때 <strong>타임 스탬프</strong> 필드를 업데이트합니다. 제출 된 타임 스탬프가 행 업데이트로 업데이트되지 않는 경우 다음 쿼리를 사용하여 <strong>타임 스탬프</strong> 필드가 자동 업데이트되도록 할 수 있습니다.
ru: Если вы создаете таблицу из <a href="http://en.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin,</a> настройка по умолчанию обновит поле <strong>метки времени,</strong> когда произойдет обновление строки. Если ваше поле с <strong>отметкой</strong> времени не обновляется с обновлением строки, вы можете использовать следующий запрос, чтобы поле <strong>отметки времени</strong> автоматически обновлялось.
zh_cn: 如果要通过<a href="http://en.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin</a>创建表，则默认设置将在发生行更新时更新<strong>时间戳</strong>字段。 如果您的<strong>时间戳</strong>字段未使用行更新进行更新，则可以使用以下查询使<strong>时间戳</strong>字段自动更新。

source: If you meant that you want to decide between using a UNIX timestamp or a native MySQL datetime field, go with the native format. You can do calculations within MySQL that way <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> and it is simple to change the format of the value to a UNIX timestamp <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> when you query the record if you want to operate on it with PHP.
es: Si quer&iacute;a decir que desea decidir entre usar una marca de tiempo UNIX o un campo de fecha y hora nativo de MySQL, vaya con el formato nativo. Puede hacer c&aacute;lculos dentro de MySQL de esa manera <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> y es simple cambiar el formato del valor a una marca de tiempo UNIX <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> cuando consulta el registro si quieres operarlo con PHP.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UNIXタイムスタンプを使用するかネイティブMySQL日時フィールドを使用するかを決定したい場合は、ネイティブ形式を使用してください。</font><font style="vertical-align: inherit;">MySQL内でそのように計算することができ </font></font> <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、レコードをクエリするときに</font><font style="vertical-align: inherit;">値の形式をUNIXタイムスタンプに変更する</font></font> <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は簡単</font><font style="vertical-align: inherit;">ですPHPで操作したい場合。</font></font>
ko: UNIX 타임 스탬프 또는 기본 MySQL 날짜 / 시간 필드를 사용하려는 경우 기본 형식을 사용하십시오. MySQL 내에서 그런 식으로 계산을 수행 할 수 있으며 <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> 레코드를 쿼리 할 때 값 형식을 UNIX 타임 스탬프 <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> 로 변경하는 것이 간단합니다. PHP로 작업하고 싶다면.
ru: Если вы имели в виду, что хотите выбрать между использованием метки времени UNIX или собственного поля даты и времени MySQL, перейдите к собственному формату. Вы можете выполнять вычисления в MySQL таким образом <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> и просто изменить формат значения на метку времени UNIX <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> когда вы запрашиваете запись если вы хотите работать с ним с помощью PHP.
zh_cn: 如果您想在使用UNIX时间戳还是使用本机MySQL日期时间字段之间做出选择，请使用本机格式。 您可以通过这种方式在MySQL中进行计算 <code>("SELECT DATE_ADD(my_datetime, INTERVAL 1 DAY)")</code> 并且在查询记录时将值的格式更改为UNIX时间戳 <code>("SELECT UNIX_TIMESTAMP(my_datetime)")</code> 。如果要使用PHP对其进行操作。

source: If you're building an application, you never know how your data might have to be used down the line. If you wind up having to, say, compare a bunch of records in your data set, with, say, a bunch of items from a third-party API, and say, put them in chronological order, you'll be happy to have Unix timestamps for your rows. Even if you decide to use MySQL timestamps, store a Unix timestamp as insurance.
es: Si estás construyendo una aplicación,nunca sabes cómo tus datos podrían tener que ser utilizados en el futuro.Si terminas teniendo que,por ejemplo,comparar un montón de registros en tu conjunto de datos,con,por ejemplo,un montón de elementos de una API de terceros,y,por ejemplo,ponerlos en orden cronológico,estarás contento de tener marcas de tiempo Unix para tus filas.Incluso si decides usar marcas de tiempo de MySQL,guarda una marca de tiempo de Unix como seguro.
ja: アプリケーションを構築している場合、自分のデータがどのように使用されなければならないかは決してわかりません。例えば、データセット内のレコードの束を、サードパーティのAPIからのアイテムの束と比較し、時系列に並べる必要がある場合、Unixのタイムスタンプがあると嬉しいでしょう。MySQLのタイムスタンプを使うことにしたとしても、保険としてUnixのタイムスタンプを保存しておきましょう。
ko: 응용 프로그램을 구축하는 경우 데이터를 어떻게 사용해야하는지 전혀 모릅니다. 예를 들어 데이터 세트의 여러 레코드를 타사 API의 여러 항목과 비교하고 시간순으로 정렬 해야하는 경우 기꺼이해야합니다. 행에 대한 유닉스 타임 스탬프. MySQL 타임 스탬프를 사용하기로 결정하더라도 Unix 타임 스탬프를 보험으로 저장하십시오.
ru: Если вы создаете приложение,никогда не знаешь,как ваши данные могут быть использованы в дальнейшем.Если вам,скажем,придется сравнить кучу записей в вашем наборе данных с,скажем,кучей элементов из стороннего API,и,скажем,расположить их в хронологическом порядке,то вы будете рады иметь метки времени Unix для ваших строк.Даже если вы решите использовать метки времени MySQL,храните их Unix как страховку.
zh_cn: 如果你正在构建一个应用程序,你永远不知道你的数据可能要如何使用。如果你最终不得不将数据集中的一堆记录与第三方API中的一堆项目进行比较,比如说,将它们按时间顺序排列,你会很乐意为你的行存储Unix时间戳。即使你决定使用MySQL时间戳,也要存储一个Unix时间戳作为保险。

source: In "bigger" database terms, <code>timestamp</code> has a couple of special-case triggers on it.
es: En t&eacute;rminos de base de datos "m&aacute;s grandes", la <code>timestamp</code> tiene un par de disparadores de casos especiales.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「より大きな」データベース用語では、</font></font> <code>timestamp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">には2つの特殊なケースのトリガーがあります。</font></font>
ko: "더 큰"데이터베이스 용어에서 <code>timestamp</code> 에는 몇 가지 특수한 경우에 대한 트리거가 있습니다.
ru: В &laquo;больших&raquo; терминах базы данных <code>timestamp</code> содержит пару триггеров особого случая.
zh_cn: 用&ldquo;更大&rdquo;的数据库术语来说， <code>timestamp</code> 有几个特殊情况的触发器。

source: In MySQL 5 and above, <strong>TIMESTAMP</strong> values are converted from the current time zone to UTC for storage, and converted back from UTC to the current time zone for retrieval. (This occurs only for the TIMESTAMP data type, and <em>not</em> for other types such as DATETIME.)
es: En MySQL 5 y superior, los valores <strong>TIMESTAMP</strong> se convierten de la zona horaria actual a UTC para el almacenamiento, y se vuelven a convertir de UTC a la zona horaria actual para su recuperaci&oacute;n. (Esto ocurre solo para el tipo de datos TIMESTAMP, y <em>no</em> para otros tipos como DATETIME).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL 5以降では、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TIMESTAMP</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値は現在のタイムゾーンからUTCに変換されて格納され、取得のためにUTCから現在のタイムゾーンに変換されます。</font><font style="vertical-align: inherit;">（これは、TIMESTAMPデータ型でのみ発生し、</font><font style="vertical-align: inherit;">DATETIMEなどの他の</font><font style="vertical-align: inherit;">型では発生し</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。）</font></font>
ko: MySQL 5 이상에서 <strong>TIMESTAMP</strong> 값은 저장을 위해 현재 시간대에서 UTC로 변환되고 검색을 위해 UTC에서 현재 시간대로 다시 변환됩니다. (이는 TIMESTAMP 데이터 유형에만 발생하며 DATETIME과 같은 다른 유형에는 발생 <em>하지 않습니다</em> .)
ru: В MySQL 5 и выше значения <strong>TIMESTAMP</strong> преобразуются из текущего часового пояса в UTC для хранения и преобразуются обратно из UTC в текущий часовой пояс для извлечения. (Это происходит только для типа данных TIMESTAMP, а <em>не</em> для других типов, таких как DATETIME.)
zh_cn: 在MySQL 5及更高版本中， <strong>TIMESTAMP</strong>值从当前时区转换为UTC以进行存储，并从UTC转换回当前时区以进行检索。 （这仅发生在TIMESTAMP数据类型上， <em>而不发生</em>在其他类型上，例如DATETIME。）

source: In my case, I set UTC as a time zone for everything: the system, the database server, etc. every time that I can. If my customer requires another time zone, then I configure it on the app.
es: En mi caso,establecí la UTC como zona horaria para todo:el sistema,el servidor de la base de datos,etc.cada vez que puedo.Si mi cliente requiere otra zona horaria,entonces la configuro en la aplicación.
ja: 私の場合、システム、データベースサーバーなど、すべてのタイムゾーンにUTCを設定しています。顧客が別のタイムゾーンを必要とする場合は、アプリ上で設定します。
ko: 필자의 경우 UTC는 가능한 한 시스템, 데이터베이스 서버 등 모든 시간대를 UTC로 설정했습니다. 고객에게 다른 시간대가 필요한 경우 앱에서 시간대를 구성합니다.
ru: В моем случае я устанавливаю UTC в качестве часового пояса для всего:системы,сервера базы данных и т.д.каждый раз,когда могу.Если моему клиенту требуется другой часовой пояс,то я настраиваю его в приложении.
zh_cn: 在我的情况下,我每次都会把UTC设置为时区:系统、数据库服务器等。如果我的客户需要另一个时区,我就会在应用程序中配置它。

source: In short
es: En resumen...
ja: 要するに
ko: 한마디로
ru: Короче говоря
zh_cn: 简而言之

source: In simpler words: <strong>If I have a database in Australia, and take a dump of that database to synchronize/populate a database in America, then the TIMESTAMP would update to reflect the real time of the event in the new time zone, while DATETIME would still reflect the time of the event in the au time zone</strong>.
es: En palabras m&aacute;s simples: <strong>si tengo una base de datos en Australia y tomo un volcado de esa base de datos para sincronizar / llenar una base de datos en Estados Unidos, entonces TIMESTAMP se actualizar&aacute; para reflejar el tiempo real del evento en la nueva zona horaria, mientras que DATETIME todav&iacute;a reflejan la hora del evento en la zona horaria au</strong> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">簡単</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に言うと、オーストラリアにデータベースがあり、そのデータベースのダンプを取得してアメリカのデータベースと同期/設定する場合、TIMESTAMPは新しいタイムゾーンでのイベントのリアルタイムを反映するように更新され、DATETIMEはまだauタイムゾーンのイベントの時刻を反映しています</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: 간단히 말해서 : <strong>호주에 데이터베이스가 있고 미국에서 데이터베이스를 동기화 / 채우기 위해 해당 데이터베이스를 덤프하면 TIMESTAMP는 새 시간대의 이벤트 실시간을 반영하도록 업데이트되지만 DATETIME은 여전히 au 시간대의 이벤트 시간을 반영합니다</strong> .
ru: Проще говоря: <strong>если у меня есть база данных в Австралии, и я сделаю дамп этой базы данных для синхронизации / заполнения базы данных в Америке, TIMESTAMP обновится, чтобы отразить реальное время события в новом часовом поясе, в то время как DATETIME будет по-прежнему отражать время события в часовом поясе au</strong> .
zh_cn: 用简单的话来说： <strong>如果我在澳大利亚有一个数据库，并转储该数据库以在美国同步/填充数据库，则TIMESTAMP将更新以反映新时区的事件实时，而DATETIME会仍然反映事件在时区的时间</strong> 。

source: It can keep track across different timezones, so if you need to display a relative time for instance, UTC time is what you would want.
es: Puede hacer un seguimiento a través de diferentes zonas horarias,así que si necesitas mostrar una hora relativa,por ejemplo,la hora UTC es lo que querrías.
ja: 異なるタイムゾーンにまたがって追跡することができるので、例えば相対的な時間を表示する必要がある場合は、UTC時間が必要になります。
ko: 다른 시간대를 추적 할 수 있으므로 예를 들어 상대 시간을 표시 해야하는 경우 UTC 시간이 필요합니다.
ru: Он может отслеживать различные часовые пояса,так что если вам нужно отобразить относительное время,например,UTC время-это то,что вы хотели бы.
zh_cn: 它可以追踪不同的时区,所以如果你需要显示相对时间,比如说UTC时间就是你想要的。

source: It is worth noting in MySQL you can use something along the lines of the below when creating your table columns:
es: Vale la pena señalar que en MySQL se puede utilizar algo parecido a lo siguiente al crear las columnas de la tabla:
ja: MySQLでは、テーブルのカラムを作成する際に以下のようなラインに沿ったものを使用することができます。
ko: MySQL에서는 테이블 열을 만들 때 아래 줄을 따라 무언가를 사용할 수 있습니다.
ru: Стоит отметить,что в MySQL при создании столбцов таблицы вы можете использовать что-нибудь из ряда вон выходящее:
zh_cn: 值得注意的是,在MySQL中,在创建表列的时候,你可以使用下面这样的方法。

source: MySQL Date/Time data types reference
es: Referencia a los tipos de datos de MySQL DateTime
ja: MySQL の DateTime データ型は
ko: MySQL 날짜 / 시간 데이터 형식 참조
ru: Ссылка на типы данных MySQL DateTime
zh_cn: MySQL DateTime数据类型参考

source: MySQL Storage Requirements reference
es: Referencia de los requisitos de almacenamiento de MySQL
ja: MySQLのストレージ要件リファレンス
ko: MySQL 스토리지 요구 사항 참조
ru: Ссылка на требования к хранилищу MySQL
zh_cn: MySQL存储需求参考

source: No timezone issues. There's been some insightful comments on here on what happens with timezones with the different data types. But is this common knowledge, and will your co-workers all take the time to learn it? On the other hand, it's pretty hard to mess up changing a BigINT into a java.util.Date. Using a BIGINT causes a lot of issues with timezones to fall by the wayside.
es: No hay problemas de zona horaria.Ha habido algunos comentarios perspicaces sobre lo que pasa con las zonas horarias con los diferentes tipos de datos.Pero,¿es esto de conocimiento común,y sus compañeros de trabajo se tomarán el tiempo para aprenderlo? Por otra parte,es bastante difícil de estropear el cambio de un BigINT en un java.util.Date.Usar un BIGINT causa muchos problemas con las zonas horarias.
ja: タイムゾーンの問題はありません。ここでは、異なるデータタイプのタイムゾーンで何が起こるかについて、洞察に富んだコメントがいくつかありました。しかし、これは一般的な知識であり、あなたの同僚はみんな時間をかけてそれを学ぶことができるのでしょうか?一方で、BIGINTをjava.util.Dateに変更するのはかなり難しいです。BIGINTを使用すると、タイムゾーンに関する多くの問題が脇道にそれてしまいます。
ko: 시간대 문제가 없습니다. 데이터 유형이 다른 시간대에서 발생하는 일에 대한 통찰력있는 의견이 있습니다. 그러나이 상식은 무엇입니까? 동료가 배우는 데 시간이 걸리나요? 반면에 BigINT를 java.util.Date로 변경하는 것은 엉망입니다. BIGINT를 사용하면 시간대와 관련된 많은 문제가 발생합니다.
ru: Никаких проблем с часовым поясом.Здесь были некоторые проницательные комментарии о том,что происходит с таймзонами с различными типами данных.Но является ли это общеизвестным знанием,и все ли ваши коллеги найдут время,чтобы узнать это? С другой стороны,довольно трудно испортить изменение BigINT в java.util.Date.Использование BIGINT приводит к тому,что многие проблемы с таймзонами выпадают на обочину.
zh_cn: 不存在时区问题。这里有一些关于不同数据类型的时区问题的精辟评论。但是这些常识,你的同事们都会花时间去学习吗?另一方面,把BIGINT改成java.utilite.Date是相当难的。使用BIGINT会导致很多关于时序的问题落下帷幕。

source: No worries about ranges or precision. You don't have to worry about what being cut short by future date ranges (TIMESTAMP only goes to 2038).
es: No hay que preocuparse por los rangos o la precisión.No tienes que preocuparte por lo que se acorte por rangos de fechas futuras (TIMESTAMP sólo va hasta el 2038).
ja: 範囲や精度の心配はありません。未来の日付の範囲(TIMESTAMPは2038年までしか行かない)で何が削られているのかを気にする必要はありません。
ko: 범위 나 정밀도에 대해 걱정할 필요가 없습니다. 미래의 날짜 범위로 인해 시간이 단축되는 것에 대해 걱정할 필요가 없습니다 (TIMESTAMP는 2038로만 진행됨).
ru: Не беспокойтесь о диапазонах или точности.Вам не нужно беспокоиться о том,что будет сокращено к будущим диапазонам дат (ВРЕМЕННАЯ СТЕПЕНЬ идет только на 2038 год).
zh_cn: 无需担心范围或精度问题。您不必担心未来的日期范围会被缩短(TIMESTAMP只到2038年)。
