Repository: rueisnom/feedback
Catalog: xlf/40/92/86/409286.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Unless you are likely to change the timezone of your servers)
es: (A menos que sea probable que cambie la zona horaria de sus servidores)
ja: (サーバーのタイムゾーンを変更する可能性がある場合を除く)
ko: (서버 시간대를 변경할 가능성이 없다면)
ru: (Если только вы,скорее всего,не измените часовой пояс ваших серверов).
zh_cn: 除非你有可能改变你的服务器的时间区)。

source: <code>datetime</code> = application supports 1 timezone (for both inserting and selecting)
es: <code>datetime</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = la aplicaci&oacute;n admite 1 zona horaria (tanto para insertar como para seleccionar)</font></font>
ja: <code>datetime</code> =アプリケーションは1つのタイムゾーンをサポートします（挿入と選択の両方）
ko: <code>datetime</code> = 응용 프로그램은 1 개의 시간대를 지원합니다 (삽입 및 선택 모두)
ru: <code>datetime</code> = приложение поддерживает 1 часовой пояс (как для вставки, так и для выбора)
zh_cn: <code>datetime</code> =应用程序支持1个时区（用于插入和选择）

source: <code>timestamp</code> = application supports any timezone (for both inserting and selecting)
es: <code>timestamp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = la aplicaci&oacute;n admite cualquier zona horaria (tanto para insertar como para seleccionar)</font></font>
ja: <code>timestamp</code> =アプリケーションは任意のタイムゾーンをサポートします（挿入と選択の両方）
ko: <code>timestamp</code> = 응용 프로그램은 모든 시간대를 지원합니다 (삽입 및 선택 모두)
ru: <code>timestamp</code> = приложение поддерживает любой часовой пояс (как для вставки, так и для выбора)
zh_cn: <code>timestamp</code> =应用程序支持任何时区（用于插入和选择）

source: <em>2016 +</em>: what I advise is to set your Mysql timezone to UTC and use DATETIME:
es: <em>2016 +</em> : lo que aconsejo es configurar su zona horaria Mysql en UTC y usar DATETIME:
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2016 +</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：私のアドバイスは、MysqlタイムゾーンをUTCに設定し、DATETIMEを使用することです。</font></font>
ko: <em>2016 +</em> : MySQL 시간대를 UTC로 설정하고 DATETIME을 사용하는 것이 좋습니다.
ru: <em>2016 +</em> : я советую установить часовой пояс Mysql на UTC и использовать DATETIME:
zh_cn: <em>2016 +</em> ：我建议您将Mysql时区设置为UTC并使用DATETIME：

source: <em>This answer is only for putting some highlight on the flexibility and ease of timestamps when it comes to time zones , it is not covering any other differences like the <a href="https://stackoverflow.com/a/45632196/5407848">column size or range or fraction</a>.</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta respuesta es solo para resaltar la flexibilidad y la facilidad de las marcas de tiempo cuando se trata de zonas horarias, no cubre ninguna otra diferencia como el </font></font><a href="https://stackoverflow.com/a/45632196/5407848"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tama&ntilde;o de</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la </font><font style="vertical-align: inherit;">columna, el rango o la fracci&oacute;n</font><font style="vertical-align: inherit;"> .</font></font></em>
ja: <em>この回答は、タイムゾーンに関してタイムスタンプの柔軟性と使いやすさを強調するためのものであり、 <a href="https://stackoverflow.com/a/45632196/5407848">列のサイズや範囲、割合</a>などの他の違いについては説明していません。</em>
ko: <em>이 답변은 시간대와 관련하여 타임 스탬프의 유연성과 용이성에 중점을두기위한 것이며 <a href="https://stackoverflow.com/a/45632196/5407848">열 크기, 범위 또는 분수</a> 와 같은 다른 차이점은 다루지 않습니다.</em>
ru: <em>Этот ответ только для того, чтобы подчеркнуть гибкость и простоту временных отметок, когда речь идет о часовых поясах, он не охватывает никаких других различий, таких как <a href="https://stackoverflow.com/a/45632196/5407848">размер столбца, диапазон или дробь</a> .</em>
zh_cn: <em>该答案仅是为了突出时区的灵活性和时间戳的易用性，而没有涵盖<a href="https://stackoverflow.com/a/45632196/5407848">列大小，范围或分数之</a>类的任何其他差异。</em>

source: <strong>The main differences:</strong>
es: <strong>Las principales diferencias:</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主な違い：</font></font></strong>
ko: <strong>주요 차이점 :</strong>
ru: <strong>Основные отличия:</strong>
zh_cn: <strong>主要区别：</strong>

source: <strong>What is that [.fraction]?</strong>
es: <strong>&iquest;Qu&eacute; es esa [.fracci&oacute;n]?</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[.fraction]とは何ですか？</font></font></strong>
ko: <strong>[.fraction]은 무엇입니까?</strong>
ru: <strong>Что это [.fraction]?</strong>
zh_cn: <strong>那是什么[.fraction]？</strong>

source: A <code>TIMESTAMP</code> requires 4 bytes, whereas a <code>DATETIME</code> requires 8 bytes.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un </font></font> <code>TIMESTAMP</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> requiere 4 bytes, mientras que un </font></font> <code>DATETIME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> requiere 8 bytes.</font></font>
ja: <code>TIMESTAMP</code> には4バイトが必要ですが、 <code>DATETIME</code> には8バイトが必要です。
ko: <code>TIMESTAMP</code> 에는 4 바이트가 필요하지만 <code>DATETIME</code> 에는 8 바이트가 필요합니다.
ru: <code>TIMESTAMP</code> требует 4 байта, тогда как <code>DATETIME</code> требует 8 байтов.
zh_cn: <code>TIMESTAMP</code> 需要4个字节，而 <code>DATETIME</code> 需要8个字节。

source: A <code>timestamp</code> field is a special case of the <code>datetime</code> field. You can create <code>timestamp</code> columns to have special properties; it can be set to update itself on either create and/or update.
es: Un campo de <code>timestamp</code> es un caso especial del campo de <code>datetime</code> . Puede crear columnas de <code>timestamp</code> para tener propiedades especiales; se puede configurar para actualizarse en crear y / o actualizar.
ja: <font style="vertical-align: inherit;"></font> <code>timestamp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールドは、特殊なケースである</font></font> <code>datetime</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールド。</font></font> <code>timestamp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列を</font><font style="vertical-align: inherit;">作成</font><font style="vertical-align: inherit;">して、特別なプロパティを持つ</font><font style="vertical-align: inherit;">ことができます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">作成時または更新時に自身を更新するように設定できます。</font></font>
ko: <code>timestamp</code> 필드는 <code>datetime</code> 필드의 특수한 경우입니다. <code>timestamp</code> 열을 만들어 특별한 속성을 가질 수 있습니다. 작성 및 / 또는 업데이트시 자체적으로 업데이트되도록 설정할 수 있습니다.
ru: Поле <code>timestamp</code> является частным случаем поля <code>datetime</code> . Вы можете создавать столбцы <code>timestamp</code> чтобы иметь специальные свойства; это может быть установлено, чтобы обновить себя или создать и / или обновить.
zh_cn: <code>timestamp</code> 字段是 <code>datetime</code> 时间字段的特例。 您可以创建 <code>timestamp</code> 列以具有特殊属性。 可以将其设置为在创建和/或更新时自行更新。

source: A DATETIME or TIMESTAMP value can include a trailing fractional seconds part in up to microseconds (6 digits) precision. In particular, any fractional part in a value inserted into a DATETIME or TIMESTAMP column is stored rather than discarded. This is of course optional.
es: Un valor de DATETIME o TIMESTAMP puede incluir una parte de segundos fraccionarios de arrastre con una precisión de hasta microsegundos (6 dígitos).En particular,cualquier parte fraccionaria de un valor insertado en una columna de HORA DE LA CITA o HORA DEL MOMENTO se almacena en lugar de ser descartada.Esto es,por supuesto,opcional.
ja: DATETIMEまたはTIMESTAMP値は、最大マイクロ秒(6桁)の精度で、末尾の端数秒の部分を含むことができます。特に、DATETIMEまたはTIMESTAMP列に挿入された値の端数部分は、破棄されるのではなく保存されます。これはもちろんオプションです。
ko: DATETIME 또는 TIMESTAMP 값은 소수점 이하 초 부분을 최대 마이크로 초 (6 자리) 정밀도로 포함 할 수 있습니다. 특히 DATETIME 또는 TIMESTAMP 열에 삽입 된 값의 소수 부분은 버리지 않고 저장됩니다. 이것은 물론 선택 사항입니다.
ru: Значение DATETIME (ВРЕМЯ ДАТЫ)или TIMESTAMP (ВРЕМЯ УСТАНОВКИ)может включать в себя часть,измеряемую в дробных секундах с точностью до микросекунд (6 цифр).В частности,любая дробная часть в значении,вставленном в столбец ВРЕМЯ ДАТЫ или ВРЕМЕНИ,сохраняется,а не выбрасывается.Это,конечно,необязательно.
zh_cn: 一个DATETIME或TIMESTAMP值可以包含一个尾随的小数秒部分,精度最高为微秒(6位数)。特别是,插入到DATETIME或TIMESTAMP列的值中的任何小数部分都会被存储而不是丢弃。这当然是可选的。

source: A great example of DATETIME being used where TIMESTAMP should have been used is in Facebook, where their servers are never quite sure what time stuff happened across time zones. Once I was having a conversation in which the time said I was replying to messages before the message was actually sent. (This, of course, could also have been caused by bad time zone translation in the messaging software if the times were being posted rather than synchronized.)
es: Un gran ejemplo de DATETIME siendo usado donde TIMESTAMP debería haber sido usado es en Facebook,donde sus servidores nunca están muy seguros de qué cosas de tiempo ocurrieron a través de las zonas horarias.Una vez tuve una conversación en la que la hora decía que estaba respondiendo a los mensajes antes de que el mensaje fuera enviado.(Esto,por supuesto,también podría haber sido causado por una mala traducción de la zona horaria en el software de mensajería si las horas estaban siendo publicadas en lugar de sincronizadas).
ja: DATETIMEがTIMESTAMPが使用されるべきところで使用されている素晴らしい例は、Facebookのサーバーがタイムゾーンをまたいで何が起こったのかを正確に把握していないところにあります。一度、私は会話をしていて、メッセージが実際に送信される前に、時間が私がメッセージに返信していると言っていたことがありました。(もちろん、時刻が同期されているのではなく、投稿されている場合は、メッセージングソフトウェアのタイムゾーンの変換が悪かったことが原因である可能性もあります)。
ko: TIMESTAMP가 사용 된 곳에서 사용되는 DATETIME의 좋은 예는 Facebook에서 서버가 시간대 전체에서 발생한 시간을 확실하게 알 수없는 Facebook입니다. 한때 나는 대화가 있었는데 메시지가 실제로 전송되기 전에 메시지에 답장을했다. 물론 시간이 동기화되지 않고 게시 된 경우 메시징 소프트웨어의 시간대 변환이 잘못되어 발생할 수도 있습니다.
ru: Отличный пример использования DATETIME,где должен был использоваться TIMESTAMP,-в Facebook,где их серверы никогда не уверены в том,что случилось во времени в часовых поясах.Однажды у меня был разговор,в котором время говорило,что я отвечал на сообщения до того,как они действительно были отправлены.(Это,конечно,также могло быть вызвано плохим переводом через часовой пояс в программном обеспечении для обмена сообщениями,если бы время не синхронизировалось).
zh_cn: 一个很好的例子是在Facebook中使用了DATETIME,而TIMESTAMP本该使用的是DATETIME,他们的服务器永远无法确定跨时区的时间。有一次,我在进行对话时,时间显示我在回复消息之前就已经回复了。(当然,这也可能是由于消息软件中的时区翻译不好造成的,如果时间是发布的,而不是同步的的话。)

source: All localised time format available here: <a href="https://docs.angularjs.org/api/ng/filter/date">https://docs.angularjs.org/api/ng/filter/date</a>
es: Todos los formatos de hora localizados disponibles aqu&iacute;: <a href="https://docs.angularjs.org/api/ng/filter/date">https://docs.angularjs.org/api/ng/filter/date</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで利用可能なすべてのローカライズされた時刻形式：</font><a href="https://docs.angularjs.org/api/ng/filter/date"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//docs.angularjs.org/api/ng/filter/date</font></font>
ko: 현지화 된 모든 시간 형식은 여기 ( <a href="https://docs.angularjs.org/api/ng/filter/date">https://docs.angularjs.org/api/ng/filter/date)에서</a> 확인할 수 있습니다.
ru: Весь локализованный формат времени доступен здесь: <a href="https://docs.angularjs.org/api/ng/filter/date">https://docs.angularjs.org/api/ng/filter/date</a>
zh_cn: 此处提供所有本地化的时间格式： <a href="https://docs.angularjs.org/api/ng/filter/date">https</a> ： //docs.angularjs.org/api/ng/filter/date

source: Another difference between Timestamp and Datetime is in Timestamp you can't default value to NULL.
es: Otra diferencia entre la marca de tiempo y la fecha y hora es que en la marca de tiempo no puedes poner el valor por defecto en NULL.
ja: また、TimestampとDatetimeのもう一つの違いは、Timestampではデフォルト値をNULLにすることができないことです。
ko: Timestamp와 Datetime의 또 다른 차이점은 Timestamp에서 기본값을 NULL로 설정할 수 없다는 것입니다.
ru: Другая разница между Timestamp и Datetime заключается в том,что в Timestamp вы не можете установить значение по умолчанию NULL.
zh_cn: Timestamp和Datetime的另一个区别是,在Timestamp中,你不能默认值为NULL。

source: Another thing worth considering:
es: Otra cosa que vale la pena considerar:
ja: もう一つ、検討する価値のあるものがあります。
ko: 고려해야 할 또 다른 사항 :
ru: Еще одна вещь,заслуживающая внимания:
zh_cn: 另一个值得考虑的事情。

source: Any recent front-end framework (Angular 1/2, react, Vue,...) can easily and automatically convert your UTC datetime to local time.
es: Cualquier marco reciente (Angular 12,reaccionar,Vue,...)puede fácil y automáticamente convertir su fecha y hora UTC a la hora local.
ja: 最近のフロントエンドフレームワーク(Angular 12,react,Vueなど)であれば、簡単かつ自動的にUTCの日付をローカルタイムに変換することができます。
ko: 최근 프런트 엔드 프레임 워크 (Angular 1/2, react, Vue, ...)를 사용하면 UTC 날짜 시간을 현지 시간으로 쉽고 자동으로 변환 할 수 있습니다.
ru: Любой современный фреймворк (Угол 12,реакция,Vue,...)может легко и автоматически конвертировать UTC-дату в местное время.
zh_cn: 任何最近的前端框架(Angular 12、react、Vue...........)都可以轻松自动将你的UTC日期时间转换为本地时间。

source: As <a href="http://dev.mysql.com/doc/refman/5.1/en/datetime.html">mentioned</a> in the MySQL documentation:
es: Como se <a href="http://dev.mysql.com/doc/refman/5.1/en/datetime.html">menciona</a> en la documentaci&oacute;n de MySQL:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のよう</font></font><a href="http://dev.mysql.com/doc/refman/5.1/en/datetime.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に述べた</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> MySQLのマニュアルに：</font></font>
ko: MySQL 문서에서 <a href="http://dev.mysql.com/doc/refman/5.1/en/datetime.html">언급했듯이</a> :
ru: Как <a href="http://dev.mysql.com/doc/refman/5.1/en/datetime.html">упомянуто</a> в документации MySQL:
zh_cn: 如MySQL文档中所述：

source: As a plus, in the case of a migration of the database to a system with another timezone, I would feel more confident using timestamps. Not to say possible issues when calculating differences between two moments with a sumer time change in between and needing a precision of 1 hour or less.
es: Como ventaja,en el caso de una migración de la base de datos a un sistema con otra zona horaria,me sentiría más seguro utilizando las marcas de tiempo.Por no decir posibles problemas al calcular las diferencias entre dos momentos con un cambio de tiempo sumario entre ellos y que necesitan una precisión de 1 hora o menos.
ja: プラスとして、データベースを別のタイムゾーンのシステムに移行する場合、私はタイムスタンプを使用してより自信を持っています。2つの瞬間の差を計算する際に、1時間以下の精度が必要になることは言うまでもありません。
ko: 또한 다른 시간대의 시스템으로 데이터베이스를 마이그레이션하는 경우 타임 스탬프를 사용하는 것이 더 자신감이 있습니다. Sumer 시간이 변경되어 1 시간 이하의 정밀도가 필요한 두 순간 간의 차이를 계산할 때 가능한 문제는 말할 것도 없습니다.
ru: В качестве плюса,в случае миграции базы данных на систему с другим часовым поясом,я бы чувствовал себя более уверенно,используя временные метки.Не говоря уже о возможных проблемах при вычислении разницы между двумя моментами с изменением времени сумеречного сдвига между ними и необходимостью точности 1 час или меньше.
zh_cn: 作为一个补充,在数据库迁移到另一个时区系统的情况下,我觉得使用时间戳会更有信心。更不用说在计算两个时刻之间的差值时可能出现的问题了,因为这两个时刻之间的时间变化需要1小时或更小的精度。

source: Beware of timestamp changing when you do a UPDATE statement on a table. If you have a table with columns 'Name' (varchar), 'Age' (int), and 'Date_Added' (timestamp) and you run the following DML statement
es: Ten cuidado con el cambio de fecha y hora cuando hagas una declaración de actualización en una mesa.Si tienes una tabla con las columnas 'Nombre' (varchar),'Edad' (int),y 'Fecha_Añadida' (marca de tiempo)y ejecutas la siguiente sentencia DML
ja: テーブルのUPDATE文を実行した時のタイムスタンプの変化に注意してください。テーブルに 'Name' (varchar),'Age' (int),'Date_Added' (timestamp)カラムを持つテーブルがあり、以下のような DML ステートメントを実行したとします。
ko: 테이블에서 UPDATE 문을 수행 할 때 타임 스탬프 변경에주의하십시오. 'Name'(varchar), 'Age'(int) 및 'Date_Added'(timestamp) 열이있는 테이블이 있고 다음 DML 문을 실행하는 경우
ru: Остерегайтесь изменения временных меток,когда вы делаете оператор UPDATE на таблице.Если у вас есть таблица со столбцами 'Имя' (varchar),'Возраст' (int)и 'Дата_Добавленная' (timestamp)и вы запускаете следующий оператор DML
zh_cn: 注意当你在表上执行UPDATE语句时,时间戳会发生变化。如果你有一个表的列 "Name"(varchar)、"Age"(int)和 "Date_Added"(timestamp),并且你运行以下DML语句

source: But like scronide said it does have a lower limit of the year 1970. It's great for anything that might happen in the future though ;)
es: Pero como dijo Scronide,tiene un límite inferior del año 1970.Es genial para cualquier cosa que pueda suceder en el futuro,sin embargo ;)
ja: しかし、scronideが言ったように、それは1970年の下限を持っています。将来起こるかもしれないことを考えると、これは素晴らしいことだと思います。)
ko: 그러나 scronide는 1970 년의 하한선이 있다고 말했듯이 미래에도 일어날 수있는 모든 것에 아주 좋습니다.)
ru: Но,как сказал Скронид,у него есть нижний предел 1970 года.Хотя это здорово для всего,что может случиться в будущем ;)
zh_cn: 但正如scronide所说,它确实有1970年的下限。这对于未来可能发生的任何事情来说都是很好的;)

source: By default, the current time zone for each connection is the server's time. The time zone can be set on a per-connection basis, as described in <em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html">MySQL Server Time Zone Support</a></em>.
es: Por defecto, la zona horaria actual para cada conexi&oacute;n es la hora del servidor. La zona horaria se puede establecer por conexi&oacute;n, como se describe en <em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html">Soporte de zona horaria del servidor MySQL</a></em> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デフォルトでは、各接続の現在のタイムゾーンはサーバーの時間です。</font><font style="vertical-align: inherit;">時間帯は、</font></font><em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLサーバーの時間帯サポートで</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明されているように、接続ごとに設定できます</font><font style="vertical-align: inherit;">。</font></font>
ko: 기본적으로 각 연결의 현재 시간대는 서버의 시간입니다. <em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html">MySQL 서버 시간대 지원에</a></em> 설명 된대로 시간대는 연결별로 설정할 수 있습니다.
ru: По умолчанию текущим часовым поясом для каждого соединения является время сервера. Часовой пояс может быть установлен для каждого соединения отдельно, как описано в <em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html">разделе Поддержка</a></em> часовых поясов <em>MySQL Server</em> .
zh_cn: 默认情况下，每个连接的当前时区是服务器的时间。 可以在每个连接的基础上设置时区，如<em><a href="http://dev.mysql.com/doc/refman/5.5/en//time-zone-support.html">MySQL服务器时区支持中所述</a></em> 。

source: Comparison between DATETIME, TIMESTAMP and DATE
es: Comparación entre FECHA,HORA y FECHA
ja: DATETIME、TIMESTAMP、DATEの比較
ko: DATETIME, TIMESTAMP 및 DATE 비교
ru: Сравнение ДАТЫ,ВРЕМЕНИ и ДАТЫ
zh_cn: DATETIME、TIMESTAMP和DATE之间的比较

source: Consider setting a timestamp by a user to a server in New York, for an appointment in Sanghai. Now when the user connects in Sanghai, he accesses the same appointment timestamp from a mirrored server in Tokyo. He will see the appointment in Tokyo time, offset from the original New York time.
es: Considere la posibilidad de establecer una marca de tiempo por un usuario a un servidor en Nueva York,para una cita en Sanghai.Ahora,cuando el usuario se conecta en Sanghai,accede a la misma marca de tiempo de la cita desde un servidor espejo en Tokio.Verá la cita en la hora de Tokio,compensada con la hora original de Nueva York.
ja: ユーザーがニューヨークのサーバーにタイムスタンプを設定して、上海でのアポイントメントのためにタイムスタンプを設定したとします。ユーザーが上海で接続すると、東京のミラーリングされたサーバーから同じアポイントメントのタイムスタンプにアクセスします。この場合、ユーザーは元のニューヨーク時間からオフセットした東京時間でのアポイントメントを見ることになります。
ko: 상하이에서의 약속을 위해 사용자가 뉴욕의 서버에 타임 스탬프를 설정하는 것을 고려하십시오. 이제 사용자가 상해에 연결하면 도쿄의 미러 서버에서 동일한 약속 시간 소인에 액세스합니다. 그는 원래 뉴욕 시간과 오프셋 된 도쿄 시간의 약속을 볼 것입니다.
ru: Рассмотрим возможность установки метки времени пользователем на сервер в Нью-Йорке для встречи в Санхае.Теперь,когда пользователь подключается в Санхае,он получает доступ к той же метке времени встречи с зеркалированного сервера в Токио.Он увидит время встречи в Токио,смещенное от первоначального времени Нью-Йорка.
zh_cn: 考虑用户在纽约的服务器上设置一个时间戳,在上海的预约时间戳。现在当用户在桑海连接时,他从东京的镜像服务器上访问同样的预约时间戳。他将看到东京时间的预约,与原来的纽约时间相抵。

source: Contrary to what one might think, DATETIME is <strong>FASTER</strong> THAN TIMESTAMP, <a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/">http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/</a>
es: Al contrario de lo que uno podr&iacute;a pensar, DATETIME es <strong>M&Aacute;S R&Aacute;PIDO</strong> QUE TIMESTAMP, <a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/">http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with -myisam /</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">思っていることとは逆に、DATETIMEは</font><font style="vertical-align: inherit;">TIMESTAMPより</font><font style="vertical-align: inherit;">も</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">速い</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、 </font></font><a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http：//gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with -myisam /</font></font></a>
ko: 생각하는 것과 달리 DATETIME은 TIMESTAMP보다 <strong>빠릅니다</strong> . <a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/">http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with -myisam /</a>
ru: Вопреки тому, что можно подумать, DATETIME <strong>БЫСТРЕЕ,</strong> ЧЕМ TIMESTAMP, <a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/">http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with -myisam /</a>
zh_cn: 与人们可能想到的相反，DATETIME比时间戳更<strong>快速</strong> ， <a href="http://gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with-myisam/">http</a> ： <strong>//gpshumano.blogs.dri.pt/2009/07/06/mysql-datetime-vs-timestamp-vs-int-performance-and-benchmarking-with</strong> -myisam /
