Repository: rueisnom/feedback
Catalog: xlf/40/92/86/409286.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Third-party tool integration. By using an integer, it's trivial for 3rd party tools (e.g. EclipseLink) to interface with the database. Not every third-party tool is going to have the same understanding of a "datetime" as MySQL does. Want to try and figure out in Hibernate whether you should use a java.sql.TimeStamp or java.util.Date object if you're using these custom data types? Using your base data types make's use with 3rd-party tools trivial.
es: Integración de herramientas de terceros.Al utilizar un número entero,es trivial que las herramientas de terceros (por ejemplo,EclipseLink)se conecten a la base de datos.No todas las herramientas de terceros van a tener el mismo entendimiento de una "fecha-hora" como lo tiene MySQL.¿Quieres intentar averiguar en Hibernación si debes usar un objeto java.sql.TimeStamp o java.util.Date si estás usando estos tipos de datos personalizados? Usar los tipos de datos de tu base hace que el uso con herramientas de terceros sea trivial.
ja: サードパーティツールの統合。整数を使用することで、サードパーティのツール(EclipseLinkなど)がデータベースとのインターフェースを取るのは簡単です。すべてのサードパーティツールがMySQLと同じように「日付」を理解しているわけではありません。これらのカスタム・データ型を使用している場合、java.sql.TimeStampとjava.util.Dateオブジェクトのどちらを使用すべきかをHibernateで試してみたいと思いませんか?基本データ型を使用することで、サードパーティのツールを使用するのが簡単になります。
ko: 타사 도구 통합. 정수를 사용하면 써드 파티 도구 (예 : EclipseLink)가 데이터베이스와 인터페이스하는 것이 쉽지 않습니다. 모든 타사 도구가 MySQL과 "날짜 / 시간"을 동일하게 이해하는 것은 아닙니다. 이러한 사용자 정의 데이터 유형을 사용하는 경우 java.sql.TimeStamp 또는 java.util.Date 객체를 사용해야하는지 Hibernate에서 알아 내고 싶습니까? 기본 데이터 유형을 사용하면 타사 도구를 사소하게 사용할 수 있습니다.
ru: Интеграция сторонних инструментов.Использование целого числа является тривиальным для сторонних инструментов (например,EclipseLink)для взаимодействия с базой данных.Не каждый сторонний инструмент будет иметь такое же понимание "времени",как и MySQL.Хотите попробовать и выяснить в Hibernate,следует ли вам использовать java.sql.TimeStamp или java.util.Date объект,если вы используете эти пользовательские типы данных? Используя базовые типы данных,используйте их со сторонними инструментами тривиально.
zh_cn: 第三方工具的集成。通过使用一个整数,第三方工具(如EclipseLink)与数据库的接口是很简单的。不是每一个第三方工具都会像MySQL那样对 "datetime "有同样的理解。想在Hibernate中尝试一下,如果你使用这些自定义数据类型,你应该使用java.sql.TimeStamp还是java.util.Date对象?使用你的基础数据类型,可以让第三方工具的使用变得简单易行。

source: This issue is closely related how you should store a money value (i.e. $1.99) in a database. Should you use a Decimal, or the database's Money type, or worst of all a Double? All 3 of these options are terrible, for many of the same reasons listed above. The solution is to store the value of money in cents using BIGINT, and then convert cents to dollars when you display the value to the user. The database's job is to store data, and NOT to intrepret that data. All these fancy data-types you see in databases(especially Oracle) add little, and start you down the road to vendor lock-in.
es: Este tema está estrechamente relacionado con la forma en que se debe almacenar un valor monetario (es decir,1,99 dólares)en una base de datos.¿Debería usar un decimal,o el tipo de dinero de la base de datos,o peor aún un doble? Las tres opciones son terribles,por muchas de las mismas razones mencionadas anteriormente.La solución es almacenar el valor del dinero en centavos usando BIGINT,y luego convertir los centavos en dólares cuando se muestra el valor al usuario.El trabajo de la base de datos es almacenar los datos,y NO interpretar esos datos.Todos estos tipos de datos de lujo que se ven en las bases de datos (especialmente en Oracle)añaden poco,y te inician en el camino hacia el bloqueo de los vendedores.
ja: この問題は、データベースにお金の値(例:$1.99)をどのように格納するかに密接に関係しています。10進数を使うべきなのか、データベースのお金の型を使うべきなのか、それとも最悪の場合はダブルを使うべきなのか?これらの3つの選択肢はすべて、上記に挙げた理由と同じ理由で、ひどいものです。解決策は、BIGINTを使用してお金の値をセントで保存し、ユーザーに値を表示するときにセントをドルに変換することです。データベースの仕事はデータを保存することであり、そのデータを解釈することではありません。データベース(特にOracle)で目にするこれらの派手なデータ型は何の役にも立たず、ベンダーのロックインへの道を歩み始めます。
ko: 이 문제는 데이터베이스에 돈 값 (예 : $ 1.99)을 저장하는 방법과 밀접한 관련이 있습니다. Decimal 또는 데이터베이스의 Money 유형을 사용해야합니까 아니면 최악의 Double을 사용해야합니까? 이러한 옵션 중 세 가지 모두 위에 나열된 여러 가지 이유로 끔찍합니다. 해결책은 BIGINT를 사용하여 돈의 가치를 센트로 저장 한 다음 사용자에게 가치를 표시 할 때 센트를 달러로 변환하는 것입니다. 데이터베이스의 임무는 데이터를 저장하고 해당 데이터를 해석하지 않는 것입니다. 데이터베이스 (특히 Oracle)에서 볼 수있는이 모든 멋진 데이터 유형은 거의 추가되지 않으며 벤더 잠금을 시작합니다.
ru: Этот вопрос тесно связан с тем,как следует хранить стоимость денег (т.е.$1.99)в базе данных.Должны ли вы использовать десятичную цифру,или тип Денег в базе данных,или,что хуже всего,двойную величину? Все 3 из этих вариантов ужасны по многим из вышеперечисленных причин.Решение заключается в том,чтобы хранить стоимость денег в центах,используя BIGINT,а затем конвертировать центы в доллары,когда вы показываете стоимость пользователю.Работа базы данных заключается в хранении данных,а не в их интерпретации.Все эти причудливые типы данных,которые вы видите в базах данных (особенно в Oracle),мало что добавляют,и начинают вас вниз по дороге,чтобы закрепить продавца.
zh_cn: 这个问题与你应该如何在数据库中存储一个货币值(即1.99美元)密切相关。你应该使用十进制,还是数据库的Money类型,或者最糟糕的是使用Double?这3个选项都很糟糕,原因和上面列出的许多相同。解决的办法是使用BIGINT将钱的值存储为美分,然后在显示给用户时将美分转换为美元。数据库的工作是存储数据,而不是解释数据。你在数据库中看到的所有这些花哨的数据类型(尤其是Oracle)都不会增加什么,而且会让你在厂商锁定的道路上开始走下去。

source: This will update the time at each instance you modify a row and is sometimes very helpful for stored last edit information. This only works with timestamp, not datetime however.
es: Esto actualizará la hora en cada instancia en la que modificas una fila y a veces es muy útil para almacenar la última información editada.Sin embargo,esto sólo funciona con la marca de tiempo,no con la hora de la fecha.
ja: これは、行を変更した各インスタンスの時刻を更新し、保存された最後の編集情報に非常に役立つことがあります。ただし、これはtimestampでのみ動作し、datetimeではありません。
ko: 이렇게하면 각 인스턴스에서 행을 수정하는 시간이 업데이트되고 마지막 편집 정보를 저장하는 데 매우 유용합니다. 그러나 datetime이 아닌 timestamp에서만 작동합니다.
ru: Это будет обновлять время в каждом случае,когда вы изменяете строку,и иногда очень полезно для сохранения информации о последнем редактировании.Однако это работает только с меткой времени,а не с датой.
zh_cn: 这将在你每次修改一行时更新时间,有时对存储的最后一次编辑信息非常有用。但这只适用于时间戳,而不是日期时间戳。

source: Timestamps are also lighter on the database and indexed faster.
es: Las marcas de tiempo también son más ligeras en la base de datos y se indexan más rápido.
ja: タイムスタンプもデータベースが軽くなり、インデックスが速くなりました。
ko: 타임 스탬프도 데이터베이스에서 더 가벼워지고 더 빠르게 색인됩니다.
ru: Штампы времени также легче попадают в базу данных и индексируются быстрее.
zh_cn: 时间戳在数据库中也更轻,索引速度更快。

source: Timestamps in MySQL are generally used to track changes to records, and are often updated every time the record is changed. If you want to store a specific value you should use a datetime field.
es: Las marcas de tiempo en MySQL se utilizan generalmente para rastrear los cambios en los registros,y a menudo se actualizan cada vez que se cambia el registro.Si desea almacenar un valor específico,debe utilizar un campo de fecha y hora.
ja: MySQLのタイムスタンプは一般的にレコードの変更を追跡するために使用され、レコードが変更されるたびに更新されることが多いです。特定の値を保存したい場合は、datetimeフィールドを使用する必要があります。
ko: MySQL의 타임 스탬프는 일반적으로 레코드 변경 사항을 추적하는 데 사용되며 종종 레코드가 변경 될 때마다 업데이트됩니다. 특정 값을 저장하려면 날짜 시간 필드를 사용해야합니다.
ru: Временные метки в MySQL обычно используются для отслеживания изменений в записях,и часто обновляются каждый раз при изменении записи.Если вы хотите сохранить определенное значение,используйте поле даты.
zh_cn: MySQL中的时间戳一般是用来跟踪记录的变化,通常在记录每次变化时都会更新。如果你想存储一个特定的值,你应该使用日期时间字段。

source: To get the current Unix timestamp in PHP, just do <code>time();</code>
es: Para obtener la marca de tiempo actual de Unix en PHP, solo haga <code>time();</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPで現在のUnixタイムスタンプを取得するには、</font></font> <code>time();</code>
ko: PHP에서 현재 유닉스 타임 스탬프를 얻으려면 <code>time();</code>
ru: Чтобы получить текущую метку времени Unix в PHP, просто сделайте <code>time();</code>
zh_cn: 要获得PHP中当前的Unix时间戳，只需执行 <code>time();</code> 。

source: Using datetimes without the timezone means that your application is dealing with only 1 timezone, however timestamps give you the benefits of <code>datetime</code> plus the flexibility of showing the same exact point of time in different timezones.
es: El uso de la fecha y hora sin la zona horaria significa que su aplicaci&oacute;n solo tiene 1 zona horaria, sin embargo, las marcas de tiempo le brindan los beneficios de la <code>datetime</code> y la flexibilidad de mostrar el mismo punto exacto en diferentes zonas horarias.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイムゾーンなしで日時を使用するということは、アプリケーションが扱うタイムゾーンが1つだけであることを意味しますが、タイムスタンプは</font></font> <code>datetime</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の利点に</font><font style="vertical-align: inherit;">加えて、異なるタイムゾーンで同じ正確な時点を表示できるという柔軟性をもたらします。</font></font>
ko: 시간대없이 날짜 / 시간을 사용한다는 것은 응용 프로그램이 하나의 시간대 만 처리한다는 것을 의미하지만 타임 스탬프는 <code>datetime</code> 의 이점과 다른 시간대에서 동일한 정확한 시점을 표시 할 수있는 유연성을 제공합니다.
ru: Использование datetime без часового пояса означает, что ваше приложение имеет дело только с 1 часовым поясом, однако временные метки дают вам преимущества <code>datetime</code> плюс гибкость показа одного и того же точного момента времени в разных часовых поясах.
zh_cn: 使用不带时区的datetimes意味着您的应用程序仅处理1个时区，但是时间戳为您提供了 <code>datetime</code> 的好处，以及在不同时区中显示相同精确时间点的灵活性。

source: What the right one is depends entirely on what you want to do.
es: Lo que es correcto depende enteramente de lo que quieras hacer.
ja: 何が正しいかは、あなたが何をしたいかにかかっています。
ko: 올바른 것은 전적으로 원하는 것에 달려 있습니다.
ru: То,что правильно,полностью зависит от того,что ты хочешь сделать.
zh_cn: 什么是正确的,完全取决于你想做什么。

source: When you ask what is the time ? and the answer comes as something like '2019-02-05 21:18:30', that is not completed, not defined answer because it lacks another part, in which timezone ? Washington ? Moscow ? Beijing ?
es: Cuando preguntas qué hora es? y la respuesta viene como algo como '2019-02-05 21:18:30',eso no se completa,no se define la respuesta porque le falta otra parte,en qué zona horaria? ¿Washington? ¿Moscú? ¿Pekín?
ja: あなたが尋ねるときは何ですか時間は ? と答えは '2019-02-05 21:18:30' のようなものとして来る、それが完了していない、定義されていない答えは、別の部分を欠いているので、どのタイムゾーンで ? ワシントン ? モスクワ ? 北京 ?
ko: 당신은 시간이 언제 물어볼 때? 그리고 대답은 '2019-02-05 21:18:30'과 같이 나타납니다. 완료되지 않고 정의되지 않은 대답은 다른 부분이 없기 때문에 어떤 시간대에 있습니까? 워싱턴? 모스크바? 베이징 ?
ru: Когда вы спрашиваете,какое время ? и ответ приходит как-то вроде '2019-02-05 21:18:30',то это не завершено,не определен ответ,потому что в нем отсутствует другая часть,в каком часовом поясе ? Вашингтон ? Москва ? Пекин ?
zh_cn: 当你问时间是什么时候? 答案是'2019-02-05 21:18:30',这是不完整的,没有定义的答案,因为它缺乏另一部分,在哪个时区?华盛顿?莫斯科?北京?

source: Would you recommend using a <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">datetime</a> or a <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">timestamp</a> field, and why (using MySQL)?
es: &iquest;Recomendar&iacute;a usar un campo de <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">fecha</a> y hora o una <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">marca de tiempo</a> , y por qu&eacute; (usando MySQL)?
ja: <font style="vertical-align: inherit;"></font><a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">日時</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールド</font><font style="vertical-align: inherit;">または</font></font><a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイムスタンプ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールド</font><font style="vertical-align: inherit;">を使用することをお勧めしますか</font><font style="vertical-align: inherit;">、またその理由（MySQLを使用）</font></font>
ko: <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">datetime</a> 또는 <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">timestamp</a> 필드를 사용하는 것이 좋으며 왜 MySQL을 사용합니까?
ru: Вы бы порекомендовали использовать поле <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">datetime</a> или <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">timestamp</a> и почему (используя MySQL)?
zh_cn: 您是否建议使用<a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">日期</a> <a href="https://dev.mysql.com/doc/refman/5.0/en/datetime.html">时间</a>或时间戳字段？为什么（使用MySQL）？

source: You avoid vendor lock-in. Pretty much every database supports integers in the relatively similar fashion. Suppose you want to move to another database. Do you want to worry about the differences between MySQL's DATETIME values and how Oracle defines them? Even among different versions of MySQL, TIMESTAMPS have a different level of precision. It was only just recently that MySQL supported milliseconds in the timestamps.
es: Evitas el encierro de los vendedores.Casi todas las bases de datos soportan números enteros de forma relativamente similar.Supongamos que quieres pasar a otra base de datos.¿Quiere preocuparse por las diferencias entre los valores de DATETIME de MySQL y cómo los define Oracle? Incluso entre las diferentes versiones de MySQL,los TIMESTAMPS tienen un nivel de precisión diferente.Sólo recientemente MySQL soportaba milisegundos en los timestamps.
ja: ベンダーのロックインを避けることができます。ほとんどのデータベースは、比較的似たような方法で整数をサポートしています。別のデータベースに移行したいとします。MySQLのDATETIME値とOracleが定義するDATETIME値の違いを心配することはありませんか?MySQLの異なるバージョン間でも、TIMESTAMPSの精度は異なります。MySQLがタイムスタンプにミリ秒をサポートしたのはつい最近のことです。
ko: 벤더 잠금을 피하십시오. 거의 모든 데이터베이스는 비교적 비슷한 방식으로 정수를 지원합니다. 다른 데이터베이스로 이동한다고 가정하십시오. MySQL의 DATETIME 값과 Oracle이 어떻게 정의하는지의 차이점에 대해 걱정하고 싶습니까? 다른 버전의 MySQL 중에서도 TIMESTAMPS의 정밀도는 다릅니다. 최근에야 MySQL이 타임 스탬프에서 밀리 초를 지원했습니다.
ru: Ты избегаешь блокировки поставщиков.Практически каждая база данных поддерживает целые числа относительно схожим образом.Предположим,вы хотите перейти к другой базе данных.Вы хотите беспокоиться о различиях между значениями DATETIME в MySQL и тем,как их определяет Oracle? Даже среди различных версий MySQL,TIMESTAMPS имеют разный уровень точности.Только недавно MySQL поддерживал миллисекунды в метках времени.
zh_cn: 你可以避免供应商的锁定。几乎所有的数据库都以相对类似的方式支持整数。假设你想转移到另一个数据库。你是否要担心MySQL的DATETIME值和Oracle如何定义它们之间的差异?即使在不同版本的MySQL中,TIMESTAMPS的精度也是不同的。直到最近,MySQL才支持时间戳中的毫秒数。

source: You're quite likely to hit the lower limit on TIMESTAMPs in general use -- e.g. storing birthdate.
es: Es muy probable que se llegue al límite inferior de los TIMESTAMPs de uso general-por ejemplo,almacenar la fecha de nacimiento.
ja: 一般的な使い方ではTIMESTAMPの下限値に当たる可能性がかなり高いです --例えば、生年月日の保存など。
ko: 생년월일 저장과 같이 일반적으로 사용되는 TIMESTAMP의 하한에 도달 할 가능성이 높습니다.
ru: Вполне вероятно,что вы попали в нижний предел ВРЕМЕННЫХ УСТАНОВКИ в общем пользовании-например,хранение даты рождения.
zh_cn: 你很可能会在一般使用中触及TIMESTAMP的下限 ----例如存储出生日期。

source: a INDEX's on Datetime - <a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working">Does not work</a>
es: un &Iacute;NDICE sobre fecha y hora: <a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working">no funciona</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">INDEXの日時- </font></font><a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能しません</font></font></a>
ko: Datetime의 INDEX- <a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working">작동하지 않습니다</a>
ru: Индекс на Datetime - <a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working">не работает</a>
zh_cn: 日期时间的索引- <a href="https://stackoverflow.com/questions/4013301/mysql-datetime-index-is-not-working">不起作用</a>

source: a INDEX's on Timestamp - works
es: un índice de la marca de tiempo-funciona
ja: タイムスタンプ上のINDEXの動作
ko: INDEX의 타임 스탬프-작동
ru: "ИНДЕКС" на "Таймэмп"-работает.
zh_cn: a INDEX的时间戳上的索引----有效

source: and in MySQL do <code>SELECT UNIX_TIMESTAMP();</code>.
es: y en MySQL hacer <code>SELECT UNIX_TIMESTAMP();</code> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLでは</font></font> <code>SELECT UNIX_TIMESTAMP();</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実行します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">。</font></font>
ko: MySQL에서는 <code>SELECT UNIX_TIMESTAMP();</code> .
ru: и в MySQL сделайте <code>SELECT UNIX_TIMESTAMP();</code> ,
zh_cn: 在MySQL中执行 <code>SELECT UNIX_TIMESTAMP();</code> 。

source: easy migrations between time zones
es: migraciones fáciles entre zonas horarias
ja: 時間帯間の移行が容易
ko: 시간대 간 쉬운 마이그레이션
ru: лёгкие миграции между часовыми поясами
zh_cn: 轻松实现时区之间的迁移

source: look at this <a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql">post to see problems with Datetime indexing</a>
es: mira esta <a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql">publicaci&oacute;n para ver problemas con la indexaci&oacute;n de fecha y hora</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font><a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">投稿を見て、日時インデックスの問題を確認してください</font></font></a>
ko: <a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql">Datetime 인덱싱 관련 문제를 보려면</a> 이 게시물을 확인하십시오.
ru: посмотрите на этот <a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql">пост, чтобы увидеть проблемы с индексацией Datetime</a>
zh_cn: 看看这篇<a href="https://stackoverflow.com/questions/95183/how-does-one-create-an-index-on-the-date-part-of-datetime-field-in-mysql">文章，看看日期时间索引问题</a>

source: no worry about dates in/out a summer time period
es: no se preocupe por las fechas en un período de tiempo de verano
ja: 夏場のデートにも安心
ko: 여름철에 날짜 / 시간에 대해 걱정할 필요가 없습니다.
ru: не беспокойтесь о свиданиях в летний период.
zh_cn: 夏日无忧

source: pretty easy to calculate diferences (just subtract both timestamps)
es: bastante fácil de calcular las diferencias (sólo hay que restar las dos marcas de tiempo)
ja: 差異を計算するのは簡単です。
ko: 차이를 계산하기가 매우 쉽습니다 (두 타임 스탬프를 빼기 만하면됩니다)
ru: довольно легко вычислить расхождения (просто вычитайте обе временные метки)
zh_cn: 很容易计算出差异(减去两个时间戳就可以了

source: ready to use on international (multi time zone) apps
es: listo para su uso en aplicaciones internacionales (multizona horaria)
ja: 国際的な(複数のタイムゾーン)アプリですぐに使える
ko: 국제 (다중 시간대) 앱에서 사용 가능
ru: готовые к использованию на международных (мульти часовых поясах)приложениях
zh_cn: 可在国际(多时区)应用程序中使用

source: then every single value in your 'Date_Added' column would be changed to the current timestamp.
es: entonces cada valor de la columna "Fecha_Añadida" se cambiaría a la marca de tiempo actual.
ja: とすると、'Date_Added' カラムのすべての値が現在のタイムスタンプに変更されます。
ko: 'Date_Added'열의 모든 단일 값이 현재 타임 스탬프로 변경됩니다.
ru: то каждое значение в столбце 'Date_Added' будет изменено на текущую метку времени.
zh_cn: 那么您的'Date_Added'列中的每一个值都会被更改为当前的时间戳。

source: you accept data from different clients around the world, each of them inserts the time in his timezone.
es: aceptas datos de diferentes clientes alrededor del mundo,cada uno de ellos inserta la hora en su zona horaria.
ja: あなたは世界中の異なるクライアントからのデータを受け入れ、それらのそれぞれが彼のタイムゾーンの時間を挿入します。
ko: 전 세계 여러 고객의 데이터를 수락하며 각 고객은 자신의 시간대에 시간을 삽입합니다.
ru: вы принимаете данные от разных клиентов по всему миру,каждый из них вставляет время в свой часовой пояс.
zh_cn: 你接受来自世界各地不同客户的数据,每个人都会在他的时间区中插入时间。

source: you changed the country you stay in, and continue your work of maintaining the data while seeing it in a different timezone (without changing the actual data).
es: cambiaste el país en el que te encuentras,y continuas tu trabajo de mantener los datos mientras los ves en una zona horaria diferente (sin cambiar los datos reales).
ja: あなたが滞在している国を変更し、異なるタイムゾーンで見ながら(実際のデータは変えずに)データを維持する作業を続けています。
ko: 귀하는 귀하가 거주하는 국가를 변경했으며 실제 시간대를 변경하지 않고 다른 시간대에서 보는 동안 데이터 유지 보수 작업을 계속합니다.
ru: вы изменили страну,в которой находитесь,и продолжаете работу по сохранению данных,видя их в другом часовом поясе (без изменения фактических данных).
zh_cn: 你改变了你所停留的国家,在不同的时间区(不改变实际数据的情况下)继续维护数据的工作。
