Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: For those who like <a href="http://nodejs.org">Node.JS</a> and its <a href="http://nodejs.org/api/util.html#util_util_format_format"><code>util.format</code></a> feature, I've just extracted it out into its vanilla JavaScript form (with only functions that util.format uses):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para aquellos a quienes les gusta </font></font><a href="http://nodejs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.JS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y su </font><font style="vertical-align: inherit;">funci&oacute;n </font></font><a href="http://nodejs.org/api/util.html#util_util_format_format"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , acabo de extraerlo en su formulario JavaScript vainilla (con solo las funciones que utiliza util.format):</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://nodejs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.JS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とその</font></font><a href="http://nodejs.org/api/util.html#util_util_format_format"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能</font><font style="vertical-align: inherit;">が好きな人のために</font><font style="vertical-align: inherit;">、私は</font><font style="vertical-align: inherit;">それを</font><font style="vertical-align: inherit;">通常の</font><font style="vertical-align: inherit;"> JavaScriptフォームに抽出しました（util.formatが使用する関数のみ）：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://nodejs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.JS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><a href="http://nodejs.org/api/util.html#util_util_format_format"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기능 </font><font style="vertical-align: inherit;">을 좋아하는 사람들을 위해 </font><font style="vertical-align: inherit;">방금 바닐라 JavaScript 형식으로 추출했습니다 (util.format에서 사용하는 기능 만 있음).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для тех, кто любит </font></font><a href="http://nodejs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.JS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и его </font><font style="vertical-align: inherit;">функцию </font></font><a href="http://nodejs.org/api/util.html#util_util_format_format"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я только что извлек его в свою ванильную форму JavaScript (только с функциями, которые использует util.format):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于那些喜欢</font></font><a href="http://nodejs.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.JS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">及其</font></font><a href="http://nodejs.org/api/util.html#util_util_format_format"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功能的人，我只是将其提取到其原始JavaScript格式中（仅包含util.format使用的功能）：</font></font>

source: For use with jQuery.ajax() success functions. Pass only a single argument and string replace with the properties of that object as {propertyName}:
es: Para usar con las funciones de éxito de jQuery.ajax().Pasa sólo un único argumento y la cadena se reemplaza con las propiedades de ese objeto como {propertyName}:
ja: jQuery.ajax()の成功関数で使用します。引数を1つだけ渡して、そのオブジェクトのプロパティを{propertyName}として文字列置換します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery.ajax () 성공 함수와 함께 사용합니다. </font><font style="vertical-align: inherit;">하나의 인수 만 전달하면 {propertyName}과 같이 해당 객체의 속성으로 문자열을 대체합니다.</font></font>
ru: Для использования с успешными функциями jQuery.ajax().Передайте только один аргумент и замените строку на свойства этого объекта как {propertyName}:
zh_cn: 用于与jQuery.ajax()成功函数一起使用。只传递一个参数和字符串替换为{propertyName}的对象的属性。

source: From ES6 on you could use <strong>template strings</strong>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de ES6, puede usar </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cadenas de plantilla</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6以降では、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テンプレート文字列を</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用でき</font><strong><font style="vertical-align: inherit;">ます</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6부터 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 문자열을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с ES6 вы можете использовать </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">шаблоны строк</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从ES6开始，您可以使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模板字符串</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: From ES6 on you could use template strings:
es: A partir de ES6 podrías usar cadenas de plantillas:
ja: ES6以降では、テンプレート文字列を使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6부터는 템플릿 문자열을 사용할 수 있습니다.</font></font>
ru: С ES6 вы можете использовать строки шаблонов:
zh_cn: 从ES6开始,你可以使用模板字符串。

source: Gives you the much more familiar:
es: Te hace mucho más familiar:
ja: より身近なものを提供します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">훨씬 더 친숙합니다.</font></font>
ru: Дает тебе намного более знакомое:
zh_cn: 给你更多的熟悉。

source: Harvested from: <a href="https://github.com/joyent/node/blob/master/lib/util.js">https://github.com/joyent/node/blob/master/lib/util.js</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cosechado de: </font></font><a href="https://github.com/joyent/node/blob/master/lib/util.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/joyent/node/blob/master/lib/util.js</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">収穫元：</font><a href="https://github.com/joyent/node/blob/master/lib/util.js"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/joyent/node/blob/master/lib/util.js</font></font>
ko: <font style="vertical-align: inherit;"><a href="https://github.com/joyent/node/blob/master/lib/util.js"><font style="vertical-align: inherit;">https://github.com/joyent/node/blob/master/lib/util.js</font></a><font style="vertical-align: inherit;"> 에서 수확</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Собран из: </font></font><a href="https://github.com/joyent/node/blob/master/lib/util.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/joyent/node/blob/master/lib/util.js</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">摘自：</font><a href="https://github.com/joyent/node/blob/master/lib/util.js"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/joyent/node/blob/master/lib/util.js</font></font>

source: Here are a few examples:
es: Aquí hay algunos ejemplos:
ja: いくつかの例をご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 몇 가지 예입니다.</font></font>
ru: Вот несколько примеров:
zh_cn: 以下是几个例子。

source: Here's a <em>minimal</em> implementation of sprintf in JavaScript: it only does "%s" and "%d", but I have left space for it to be extended. It is useless to the OP, but other people who stumble across this thread coming from Google might benefit from it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay una </font><font style="vertical-align: inherit;">implementaci&oacute;n </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&iacute;nima</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de sprintf en JavaScript: solo hace "% s" y "% d", pero he dejado espacio para que se extienda. </font><font style="vertical-align: inherit;">Es in&uacute;til para el OP, pero otras personas que se topan con este hilo proveniente de Google podr&iacute;an beneficiarse de &eacute;l.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここだ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、最小限</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のsprintfの実装では、JavaScriptで：それが唯一の「％sの」と「％d個」をし、それを拡張するために、私はスペースを残しています。</font><font style="vertical-align: inherit;">それはOPにとって役に立たないですが、Googleからのこのスレッドに出くわした他の人々はそれから利益を得るかもしれません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 </font><font style="vertical-align: inherit;">은 JavaScript에서 sprintf를 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최소한으로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구현 한 것입니다. "% s"및 "% d"만 수행하지만 확장 할 공간을 남겨 두었습니다. </font><font style="vertical-align: inherit;">OP에는 쓸모가 없지만 Google에서이 스레드를 우연히 발견 한 다른 사람들이 혜택을 볼 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">минимальная</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> реализация sprintf в JavaScript: он выполняет только &laquo;% s&raquo; и &laquo;% d&raquo;, но я оставил место для его расширения. </font><font style="vertical-align: inherit;">Это бесполезно для ОП, но другие люди, которые натыкаются на эту ветку из Google, могут извлечь из этого пользу.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这</font><font style="vertical-align: inherit;">是sprintf在JavaScript中</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最小</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实现：它仅执行&ldquo;％s&rdquo;和&ldquo;％d&rdquo;，但我留有扩展空间。</font><font style="vertical-align: inherit;">它对OP毫无用处，但其他偶然发现来自Google的线程的人可能会从中受益。</font></font>

source: Hexadecimal and other bases
es: Bases hexadecimales y otras bases
ja: 16進数とその他の塩基
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">16 진법 및 기타 기반</font></font>
ru: шестнадцатеричная и другие основы
zh_cn: 十六进制和其他基数

source: How it works:
es: Como funciona:
ja: どのように機能するのか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동 방식 :</font></font>
ru: Как это работает:
zh_cn: 它是如何工作的。

source: I also have a non-prototype version which I use more often for its Java-like syntax:
es: También tengo una versión no prototipo que uso más a menudo por su sintaxis parecida a la de Java:
ja: 非プロトタイプ版も持っていますが、こちらの方がJavaライクな構文でよく使っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 Java와 유사한 구문에 더 자주 사용하는 비 프로토 타입 버전이 있습니다.</font></font>
ru: У меня также есть версия без прототипа,которую я использую чаще всего для его Java-подобного синтаксиса:
zh_cn: 我也有一个非原型版本,我更经常使用它的类似于Java的语法。

source: I did not see the <code>String.format</code> variant:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No vi la </font><font style="vertical-align: inherit;">variante </font></font> <code>String.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>String.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バリアント</font><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">見つかり</font><font style="vertical-align: inherit;">ませんでした</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>String.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변형을 </font><font style="vertical-align: inherit;">보지 못했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я не видел </font><font style="vertical-align: inherit;">вариант </font></font> <code>String.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我没有看到</font></font> <code>String.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变体：</font></font>

source: I figured that since this, like the older ones, doesn't actually parse the letters, it might as well just use a single token <code>%%</code>. This has the benefit of being obvious and not making it difficult to use a single <code>%</code>. However, if you need <code>%%</code> for some reason, you would need to replace it with itself:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Supuse que, dado que esto, como los anteriores, no analiza las letras, tambi&eacute;n podr&iacute;a usar un solo token </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esto tiene el beneficio de ser obvio y no dificultar el uso de un solo </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Sin embargo, si necesita </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por alg&uacute;n motivo, deber&aacute; reemplazarlo por s&iacute; mismo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、古いものと同様に、実際には文字を解析しないため、単一のトークン</font></font> <code>%%</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用するだけでよいと考えました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これには明らかであり、単一の</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用することを難しくしないという利点があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">ただし、</font><font style="vertical-align: inherit;">何らかの理由で</font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が必要な場合は、それ自体で置き換える必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 오래된 것과 마찬가지로 실제로 문자를 파싱하지 않기 때문에 단일 토큰 </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 사용할 수도 있다고 생각했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이것은 명백하고 단일 </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용을 어렵게하지 않는 이점이 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">어떤 이유로 든 </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 필요한 경우이를 자체로 바꿔야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я подумал, что, поскольку он, как и старые, на самом деле не анализирует буквы, он может просто использовать один токен </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Преимущество этого состоит в том, что он очевиден и не затрудняет использование одного </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Однако, если вам нужен </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по какой-то причине, вам нужно заменить его на себя:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为，由于这与较旧的字母一样，实际上并未解析字母，因此最好只使用单个标记</font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这具有明显的好处，并且不会很难使用单个</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，如果</font><font style="vertical-align: inherit;">由于某些原因</font><font style="vertical-align: inherit;">需要</font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则需要</font><font style="vertical-align: inherit;">将其替换为自身：</font></font>

source: I got to this question page hoping to find how to <strong>format numbers</strong> in JavaScript, without introducing yet another library. Here's what I've found:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Llegu&eacute; a esta p&aacute;gina de preguntas con la esperanza de encontrar c&oacute;mo </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">formatear n&uacute;meros</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en JavaScript, sin presentar otra biblioteca. </font><font style="vertical-align: inherit;">Esto es lo que he encontrado:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さらに別のライブラリを導入せずに、JavaScriptで</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数値</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><strong><font style="vertical-align: inherit;">フォーマット</font></strong><font style="vertical-align: inherit;">する方法を見つけることを期待して、この質問ページに行きました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これが私が見つけたものです：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 라이브러리를 도입하지 않고 JavaScript에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자의</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서식을 지정하는 방법을 찾고자하는이 질문 페이지에 도달했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">내가 찾은 것은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я попал на эту страницу с вопросом в надежде найти способ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">форматирования чисел</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в JavaScript, не представляя еще одну библиотеку. </font><font style="vertical-align: inherit;">Вот что я нашел:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我来到了这个问题页面，希望找到如何</font><font style="vertical-align: inherit;">在JavaScript中</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">格式化数字</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而不引入另一个库。</font><font style="vertical-align: inherit;">这是我发现的：</font></font>
