Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: PS: This function is very cool if you are using translations in templates frameworks like <a href="http://en.wikipedia.org/wiki/AngularJS">AngularJS</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PD: Esta funci&oacute;n es muy buena si est&aacute; utilizando traducciones en marcos de plantillas como </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PS：この機能は、</font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などのテンプレートフレームワークで翻訳を使用している場合に非常に便利です</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추신 : </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같은 템플릿 프레임 워크에서 번역을 사용하는 경우이 기능은 매우 좋습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PS: эта функция очень полезна, если вы используете переводы в шаблонах, таких как </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PS：如果您在</font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS之</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类的模板框架中使用翻译，则此功能非常酷</font><font style="vertical-align: inherit;">：</font></font>

source: Quick tutorial on JS number formatting
es: Tutorial rápido sobre el formato del número JS
ja: JS番号の書式設定に関するクイックチュートリアル
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JS 번호 형식에 대한 빠른 자습서</font></font>
ru: Краткое руководство по форматированию JS-номеров
zh_cn: JS号码格式化快速教程

source: Reference Pages
es: Páginas de referencia
ja: 参考ページ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조 페이지</font></font>
ru: Справочные страницы
zh_cn: 参考页

source: Rounding floating-point numbers
es: Redondeando los números de punto flotante
ja: 浮動小数点数の丸め
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반올림 부동 소수점 숫자</font></font>
ru: Округление чисел с плавающей точкой
zh_cn: 浮点数的四舍五入

source: Sadly it seems sprintf doesn't handle thousand separator formatting like .NET's string format.
es: Tristemente parece que sprintf no maneja el formato de miles de separadores como el formato de cadena de .NET.
ja: 悲しいことに、sprintfは.NETの文字列フォーマットのような1000区切りのフォーマットは扱えないようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">슬프게도 sprintf는 .NET의 문자열 형식과 같은 천 단위 구분 기호 형식을 처리하지 않는 것 같습니다.</font></font>
ru: К сожалению,кажется,что sprintf не обрабатывает тысячи форматов разделителей,таких как строковый формат .NET.
zh_cn: 可悲的是,sprintf似乎不能像.NET的字符串格式那样处理千位分隔符格式。

source: See Kim's <a href="https://stackoverflow.com/a/32202320/2430448">answer</a> below for details.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vea la </font></font><a href="https://stackoverflow.com/a/32202320/2430448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Kim a </font><font style="vertical-align: inherit;">continuaci&oacute;n para m&aacute;s detalles.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細</font><font style="vertical-align: inherit;">については、以下の</font><font style="vertical-align: inherit;">Kimの</font></font><a href="https://stackoverflow.com/a/32202320/2430448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">回答を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 </font><font style="vertical-align: inherit;">아래 </font><font style="vertical-align: inherit;">의 Kim </font></font><a href="https://stackoverflow.com/a/32202320/2430448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">답변을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите </font></font><a href="https://stackoverflow.com/a/32202320/2430448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Ким </font><font style="vertical-align: inherit;">ниже для деталей.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关</font><font style="vertical-align: inherit;">详细信息，</font><font style="vertical-align: inherit;">请参见</font><font style="vertical-align: inherit;">下面的</font><font style="vertical-align: inherit;">Kim </font></font><a href="https://stackoverflow.com/a/32202320/2430448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: That's because <code>Array</code>'s <code>slice</code> will force whatever's in <code>arguments</code> into an <code>Array</code>, whether it was originally or not, and the <code>key</code> will be the index (0, 1, 2...) of each array element coerced into a string (eg, "0", so <code>"\\{0\\}"</code> for your first regexp pattern).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto se debe a que </font><font style="vertical-align: inherit;">el </font> <code>slice</code> </font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> forzar&aacute; lo que sea que est&eacute; en los </font> <code>arguments</code> <font style="vertical-align: inherit;"> en una </font> <code>Array</code> <font style="vertical-align: inherit;"> , ya sea originalmente o no, y la </font> <code>key</code> <font style="vertical-align: inherit;"> ser&aacute; el &iacute;ndice (0, 1, 2 ...) de cada elemento de la matriz coaccionado en una cadena (por ejemplo, "0", entonces </font> <code>"\\{0\\}"</code> <font style="vertical-align: inherit;"> para su primer patr&oacute;n regexp).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、</font></font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が元々あったかどうかにかかわらず、</font></font> <code>arguments</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべてを強制</font><font style="vertical-align: inherit;">的</font><font style="vertical-align: inherit;">に</font></font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">入れ</font><font style="vertical-align: inherit;">、</font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は文字列に強制変換された各配列要素のインデックス（0、1、2 ...）になるためです（たとえば、 「0」なので</font><font style="vertical-align: inherit;">、最初の正規表現パターンは</font></font> <code>"\\{0\\}"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때문에 그건 </font></font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에있어 어떤 강제 </font></font> <code>arguments</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 </font></font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 원래 아닌지 여부, 그리고 </font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자열로 강요 각 배열 요소의 인덱스 (0, 1, 2, ...)입니다 (예를 들어, "0"이므로 </font><font style="vertical-align: inherit;">첫 번째 정규 표현식 패턴은 </font></font> <code>"\\{0\\}"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это связано </font><font style="vertical-align: inherit;">с тем, что </font> <code>slice</code> </font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет принудительно </font><font style="vertical-align: inherit;">преобразовывать </font><font style="vertical-align: inherit;">все </font> <code>arguments</code> <font style="vertical-align: inherit;"> в </font> <code>Array</code> <font style="vertical-align: inherit;"> , независимо от того, был он изначально или нет, а </font> <code>key</code> <font style="vertical-align: inherit;"> будет индекс (0, 1, 2 ...) каждого элемента массива, приведенный к строке (например, &laquo;0&raquo;, поэтому </font> <code>"\\{0\\}"</code> <font style="vertical-align: inherit;"> для вашего первого шаблона регулярного выражения).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是因为</font></font> <code>Array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>slice</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将把</font></font> <code>arguments</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有内容强制</font><font style="vertical-align: inherit;">放入</font></font> <code>Array</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，无论它是否是原始的，并且</font></font> <code>key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将是每个数组元素的索引（0，1，2 ...）强制转换为字符串（例如， &ldquo; 0&rdquo;，因此</font><font style="vertical-align: inherit;">您的第一个正则表达式模式为</font></font> <code>"\\{0\\}"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: That's very similar to string.format:
es: Eso es muy similar al formato string.format:
ja: これはstring.formatと非常に似ています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이는 string.format과 매우 유사합니다.</font></font>
ru: Это очень похоже на формат string.format:
zh_cn: 这和string.format非常相似。

source: The <a href="http://phpjs.org/">PHPJS project</a> has written JavaScript implementations for many of PHP's functions. Since PHP's <code>sprintf()</code> function is basically the same as C's <code>printf()</code>, <a href="http://phpjs.org/functions/sprintf">their JavaScript implementation of it</a> should satisfy your needs.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font><a href="http://phpjs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">proyecto PHPJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ha escrito implementaciones de JavaScript para muchas de las funciones de PHP. </font><font style="vertical-align: inherit;">Dado que la funci&oacute;n </font></font> <code>sprintf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> PHP </font><font style="vertical-align: inherit;">es b&aacute;sicamente la misma que la de </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> C </font><font style="vertical-align: inherit;">, </font></font><a href="http://phpjs.org/functions/sprintf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">su implementaci&oacute;n de JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> deber&iacute;a satisfacer sus necesidades.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://phpjs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPJSプロジェクトは</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> PHPの機能の多くのためのJavaScriptの実装を書いています。</font><font style="vertical-align: inherit;">PHPの</font></font> <code>sprintf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数は基本的にCの</font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と同じであるため</font><font style="vertical-align: inherit;">、</font></font><a href="http://phpjs.org/functions/sprintf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのJavaScript実装は</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ニーズを満たして</font><font style="vertical-align: inherit;">いる</font><font style="vertical-align: inherit;">はずです。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://phpjs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPJS 프로젝트는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> PHP의 기능 중 많은 자바 스크립트 구현을 작성했습니다. </font><font style="vertical-align: inherit;">PHP의 이후 </font></font> <code>sprintf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수는 기본적으로 C의 것과 동일 </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="http://phpjs.org/functions/sprintf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것의 자신의 자바 스크립트 구현은</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자의 요구를 만족해야한다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проект </font></font><a href="http://phpjs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> написал JavaScript-реализации для многих функций PHP. </font><font style="vertical-align: inherit;">Так как </font><font style="vertical-align: inherit;">функция </font><font style="vertical-align: inherit;">PHP </font></font> <code>sprintf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в основном совпадает с функцией </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в C </font><font style="vertical-align: inherit;">, </font></font><a href="http://phpjs.org/functions/sprintf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">их реализация в JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должна удовлетворить ваши потребности.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><a href="http://phpjs.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPJS项目</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">写JavaScript实现的许多PHP的功能。</font><font style="vertical-align: inherit;">由于PHP的</font></font> <code>sprintf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数与C的</font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本相同</font><font style="vertical-align: inherit;">，因此</font></font><a href="http://phpjs.org/functions/sprintf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他们的JavaScript实现</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该可以满足您的需求。</font></font>

source: The JavaScript <a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference">Date</a> class can format localized dates and times.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">clase de </font></font><a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fecha de</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">puede formatear fechas y horas localizadas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptの</font></font><a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Date</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは、ローカライズされた日付と時刻をフォーマットできます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript </font></font><a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Date</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스는 현지화 된 날짜 및 시간의 형식을 지정할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Класс JavaScript </font></font><a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Date</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может форматировать локализованные даты и время.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript </font></font><a href="http://www.hunlock.com/blogs/Javascript_Dates-The_Complete_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Date</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类可以格式化本地化的日期和时间。</font></font>

source: The equivalent of <code>sprintf("%.2e", num)</code> is <code>num.toExponential(2)</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El equivalente de </font></font> <code>sprintf("%.2e", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font> <code>num.toExponential(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>sprintf("%.2e", num)</code> <font style="vertical-align: inherit;"></font> <code>num.toExponential(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"、num）に</font><font style="vertical-align: inherit;">相当するの</font><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">num.toExponential（2）</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동등 </font></font> <code>sprintf("%.2e", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font></font> <code>num.toExponential(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Эквивалент </font></font> <code>sprintf("%.2e", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равен </font></font> <code>num.toExponential(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>sprintf("%.2e", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的等效项</font><font style="vertical-align: inherit;">是</font></font> <code>num.toExponential(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
