Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I have a slightly longer formatter for JavaScript <a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js">here</a>...
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tengo un formateador un poco m&aacute;s largo para JavaScript </font></font><a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にJavaScriptの少し長いフォーマッターがあります</font><font style="vertical-align: inherit;">...</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 자바 스크립트에 대한 약간 더 포맷터가 </font></font><a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У меня есть немного больше форматера для JavaScript </font></font><a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我</font></font><a href="https://github.com/tracker1/core-js/blob/master/js-extensions/100-String.format.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的JavaScript格式化程序稍长</font><font style="vertical-align: inherit;">...</font></font>

source: I have a solution very close to Peter's, but it deals with number and object case.
es: Tengo una solución muy parecida a la de Peter,pero se trata de un caso de número y objeto.
ja: ピーターに非常に近い解決策がありますが、それは数とオブジェクトのケースを扱うものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Peter와 매우 가까운 솔루션이 있지만 숫자와 객체 사례를 처리합니다.</font></font>
ru: У меня есть решение,очень близкое к Питеру,но оно имеет дело с номером и объектным случаем.
zh_cn: 我有一个非常接近彼得的解决方案,但它处理的是数字和对象的情况。

source: I realize Microsoft's <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">Ajax</a> library provides a version of <code>String.Format()</code>, but we don't want the entire overhead of that framework.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Me doy cuenta de que la </font><font style="vertical-align: inherit;">biblioteca </font></font><a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ajax</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Microsoft </font><font style="vertical-align: inherit;">proporciona una versi&oacute;n de </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero no queremos toda la sobrecarga de ese marco.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Microsoftの</font></font><a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ajax</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ライブラリが</font></font> <code>String.Format()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バージョンを提供していることに</font><font style="vertical-align: inherit;">気づきました</font><font style="vertical-align: inherit;">が、そのフレームワークのオーバーヘッド全体は必要ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Microsoft의 </font></font><a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ajax</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라이브러리는 </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 버전을 제공 </font><font style="vertical-align: inherit;">하지만 해당 프레임 워크의 전체 오버 헤드를 원하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я понимаю, что </font><font style="vertical-align: inherit;">библиотека </font></font><a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ajax от</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Microsoft </font><font style="vertical-align: inherit;">предоставляет версию </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но нам не нужны все издержки этой инфраструктуры.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我意识到Microsoft的</font></font><a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ajax</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">库提供了</font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的版本</font><font style="vertical-align: inherit;">，但是我们不希望该框架的全部开销。</font></font>

source: I use a small library called <a href="http://www.masterdata.se/r/string_format_for_javascript/">String.format for JavaScript</a> which supports most of the format string capabilities (including format of numbers and dates), and uses the .NET syntax. The script itself is smaller than 4 kB, so it doesn't create much of overhead.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilizo una peque&ntilde;a biblioteca llamada </font></font><a href="http://www.masterdata.se/r/string_format_for_javascript/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.format para JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que admite la mayor&iacute;a de las capacidades de cadena de formato (incluido el formato de n&uacute;meros y fechas), y utiliza la sintaxis .NET. </font><font style="vertical-align: inherit;">El script en s&iacute; es m&aacute;s peque&ntilde;o que 4 kB, por lo que no crea mucha sobrecarga.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は、</font></font><a href="http://www.masterdata.se/r/string_format_for_javascript/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptのString.format</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれる小さなライブラリを使用</font><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">これは、ほとんどのフォーマット文字列機能（数値と日付のフォーマットを含む）をサポートし、.NET構文を使用します。</font><font style="vertical-align: inherit;">スクリプト自体は4 kBよりも小さいため、オーバーヘッドはあまり発生しません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 형식 문자열 기능 (숫자 및 날짜 형식 포함)을 지원하고 .NET 구문을 사용하는 </font></font><a href="http://www.masterdata.se/r/string_format_for_javascript/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 용 String.format</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이라는 작은 라이브러리를 </font><font style="vertical-align: inherit;">사용합니다. </font><font style="vertical-align: inherit;">스크립트 자체는 4kB보다 작으므로 오버 헤드가 많이 발생하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использую небольшую библиотеку </font></font><a href="http://www.masterdata.se/r/string_format_for_javascript/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.format для JavaScript,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которая поддерживает большинство возможностей форматирования строк (включая формат чисел и дат) и использует синтаксис .NET. </font><font style="vertical-align: inherit;">Сам скрипт меньше 4 кБ, поэтому он не создает больших накладных расходов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我</font></font><a href="http://www.masterdata.se/r/string_format_for_javascript/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用了一个名为</font><font style="vertical-align: inherit;">String.format</font><font style="vertical-align: inherit;">的小型库</font><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">该</font><font style="vertical-align: inherit;">库</font><font style="vertical-align: inherit;">支持大多数格式字符串功能（包括数字和日期的格式），并使用.NET语法。</font><font style="vertical-align: inherit;">该脚本本身小于4 kB，因此不会产生太多开销。</font></font>

source: I use this one:
es: Yo uso este:
ja: 私はこれを使っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것을 사용한다 :</font></font>
ru: Я пользуюсь этим:
zh_cn: 我用的是这个。

source: I use this simple function:
es: Utilizo esta simple función:
ja: 私はこのシンプルな機能を使っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 간단한 기능을 사용합니다.</font></font>
ru: Я использую эту простую функцию:
zh_cn: 我用的是这个简单的功能。

source: I want to share my solution for the 'problem'. I haven't re-invented the wheel but tries to find a solution based on what JavaScript already does. The advantage is, that you get all implicit conversions for free. Setting the prototype property $ of String gives a very nice and compact syntax (see examples below). It is maybe not the most efficient way, but in most cases dealing with output it does not have to be super optimized.
es: Quiero compartir mi solución para el "problema".No he reinventado la rueda,pero intento encontrar una solución basada en lo que ya hace JavaScript.La ventaja es que obtienes todas las conversiones implícitas de forma gratuita.Establecer la propiedad del prototipo $ de String da una sintaxis muy bonita y compacta (ver ejemplos abajo).Tal vez no sea la forma más eficiente,pero en la mayoría de los casos al tratar con la salida no tiene que ser súper optimizada.
ja: 私は「問題」のための私の解決策を共有したいと思っています。私はホイールを再発明していませんが、JavaScriptがすでに行っていることに基づいて解決策を見つけようとしています。利点は、あなたが自由のためにすべての暗黙の変換を得ることです。Stringのprototypeプロパティ$を設定すると、非常に美しくコンパクトな構文が得られます(以下の例を参照してください)。これは最も効率的な方法ではないかもしれませんが、ほとんどの場合、出力を扱う際に超最適化する必要はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'문제'에 대한 솔루션을 공유하고 싶습니다. </font><font style="vertical-align: inherit;">나는 바퀴를 다시 발명하지 않았지만 JavaScript가 이미 수행 한 것에 기반한 솔루션을 찾으려고 노력합니다. </font><font style="vertical-align: inherit;">장점은 모든 암시 적 변환을 무료로 얻을 수 있다는 것입니다. </font><font style="vertical-align: inherit;">String의 프로토 타입 속성 $를 설정하면 매우 훌륭하고 간단한 구문이 제공됩니다 (아래 예 참조). </font><font style="vertical-align: inherit;">아마도 가장 효율적인 방법은 아니지만 대부분의 경우 출력을 처리 할 때 반드시 최적화 할 필요는 없습니다.</font></font>
ru: Я хочу поделиться своим решением "проблемы".Я не изобретал колесо заново,но пытаюсь найти решение,основанное на том,что JavaScript уже делает.Преимущество в том,что вы получаете все неявные преобразования бесплатно.Установка свойства прототипа $ из String дает очень красивый и компактный синтаксис (см.примеры ниже).Возможно,это не самый эффективный способ,но в большинстве случаев,имея дело с выводом,он не должен быть супер-оптимизирован.
zh_cn: 我想分享一下我对这个 "问题 "的解决方案。我并没有重新发明车轮,而是试图在JavaScript已经做的基础上找到一个解决方案。这样做的好处是,你可以免费获得所有的隐式转换。设置String的prototype属性$,就可以得到一个非常漂亮而紧凑的语法(见下面的例子)。这也许不是最有效的方法,但在大多数情况下,处理输出时不需要进行超级优化。

source: I'll add my own discoveries which I've found since I asked:
es: Añadiré mis propios descubrimientos que he encontrado desde que pregunté:
ja: 頼んでから見つけた自分なりの発見を追加しておきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요청한 이후에 찾은 내 발견을 추가하겠습니다.</font></font>
ru: Я добавлю свои собственные открытия,которые я нашел с тех пор,как попросил:
zh_cn: 我把我自己的发现补充一下,这是我问过之后的发现。

source: I'm looking for a good JavaScript equivalent of the C/PHP <code>printf()</code> or for C#/Java programmers, <code>String.Format()</code> (<code>IFormatProvider</code> for .NET).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Estoy buscando un buen equivalente de JavaScript de C / PHP </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o para programadores de C # / Java, </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font> <code>IFormatProvider</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para .NET).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C / PHPの</font></font> <code>printf()</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相当するJavaScriptに相当するもの、</font><font style="vertical-align: inherit;">またはC＃/ Javaプログラマー</font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Formatの</font></font> <code>IFormatProvider</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を探し</font><font style="vertical-align: inherit;">ています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C / PHP </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 C # / Java 프로그래머 인 </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font><font style="vertical-align: inherit;">.NET 용 </font></font> <code>IFormatProvider</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">)</font><font style="vertical-align: inherit;"> 과 동등한 JavaScript를 찾고 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я ищу хороший эквивалент JavaScript для </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на C / PHP </font><font style="vertical-align: inherit;">или для программистов на C # / Java, </font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font> <code>IFormatProvider</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для .NET).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我正在寻找一个等效于C / PHP </font></font> <code>printf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或C＃/ Java程序员的</font></font> <code>String.Format()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><font style="vertical-align: inherit;">适用于.NET的</font></font> <code>IFormatProvider</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）的</font><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">。</font></font>

source: I'm surprised no one used <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"><code>reduce</code></a>, this is a native concise and powerful JavaScript function.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Me sorprende que nadie haya usado </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"> <code>reduce</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , esta es una funci&oacute;n JavaScript concisa y potente nativa.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">誰も</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"> <code>reduce</code> を</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用していないことに驚いてい</font><font style="vertical-align: inherit;">ます。これはネイティブの簡潔で強力なJavaScript関数です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아무도 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"> <code>reduce</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하지 않은 것에 놀랐습니다 </font><font style="vertical-align: inherit;">. 이것은 기본 간결하고 강력한 JavaScript 함수입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я удивлен, что никто не использовал </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"> <code>reduce</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , это нативная и мощная функция JavaScript.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我很惊讶没有人使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce"> <code>reduce</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这是一种本机简洁而强大的JavaScript函数。</font></font>

source: I've also aliased with .asFormat and have some detection in place in case there's already a string.format (such as with MS Ajax Toolkit (I hate that library).
es: También he hecho un alias con .asFormat y tengo alguna detección en el lugar en caso de que ya haya un formato de cadena (como con MS Ajax Toolkit (odio esa biblioteca).
ja: また、.asFormatをエイリアス化して、すでにstring.formatがある場合に備えて、いくつかの検出方法を用意しています(MS Ajax Toolkitのように(あのライブラリは嫌いです)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 .asFormat으로 별칭을 지정했으며 이미 string.format이있는 경우 (예 : MS Ajax Toolkit과 같은 경우) 라이브러리를 싫어합니다.</font></font>
ru: У меня также есть псевдоним с .asFormat и есть некоторое обнаружение на случай,если уже есть string.format (например,с помощью MS Ajax Toolkit (я ненавижу эту библиотеку).
zh_cn: 我还用.asFormat进行了别名,并且在已经有string.format的情况下也有了一些检测(比如用MS Ajax Toolkit(我讨厌那个库)。

source: If you are looking to handle the thousands separator, you should really use toLocaleString() from the JavaScript <a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference">Number</a> class since it will format the string for the user's region.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; buscando manejar el separador de miles, realmente deber&iacute;a usar toLocaleString () de la </font><font style="vertical-align: inherit;">clase de </font></font><a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">N&uacute;mero</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">ya que formatear&aacute; la cadena para la regi&oacute;n del usuario.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3桁ごとの区切り記号を処理する場合は、JavaScriptの</font></font><a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Number</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスの</font><font style="vertical-align: inherit;">toLocaleString（）を使用する必要があります。</font><font style="vertical-align: inherit;">これは、ユーザーの地域の文字列をフォーマットするためです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">천 단위 구분 기호를 처리하려면 JavaScript </font></font><a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Number</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 </font><font style="vertical-align: inherit;">에서 toLocaleString ()을 사용해야 </font><font style="vertical-align: inherit;">합니다. 사용자 지역의 문자열 형식을 지정하기 때문입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите обработать разделитель тысяч, вам действительно следует использовать toLocaleString () из </font><font style="vertical-align: inherit;">класса </font><font style="vertical-align: inherit;">JavaScript </font></font><a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Number,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> так как он отформатирует строку для региона пользователя.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要处理千位分隔符，则应该使用JavaScript </font></font><a href="http://www.hunlock.com/blogs/The_Complete_Javascript_Number_Reference"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Number</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类中的</font><font style="vertical-align: inherit;">toLocaleString（），</font><font style="vertical-align: inherit;">因为它将格式化用户区域的字符串。</font></font>
