Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you prefer not to modify <code>String</code>'s prototype:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si prefiere no modificar </font><font style="vertical-align: inherit;">el prototipo de </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のプロトタイプ</font><font style="vertical-align: inherit;">を変更したくない場合</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로토 타입 </font><font style="vertical-align: inherit;">을 수정하지 않으려는 경우 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы предпочитаете не изменять </font><font style="vertical-align: inherit;">прототип </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您不想修改</font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的原型：</font></font>

source: If you really want to do a simple format method on your own, don&rsquo;t do the replacements successively but do them simultaneously.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si realmente desea hacer un m&eacute;todo de formato simple por su cuenta, no haga los reemplazos sucesivamente, sino que los haga simult&aacute;neamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自分で簡単なフォーマット方法を本当に実行したい場合は、置換を連続して行わずに、同時に行います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 간단한 형식 방법을 원한다면 교체를 연속적으로 수행하지 말고 동시에 수행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы действительно хотите сделать простой метод форматирования самостоятельно, не делайте замен последовательно, а выполняйте их одновременно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您真的想自己做一个简单的格式化方法，请不要先后进行替换，而要同时进行。</font></font>

source: In contrast with similar solutions in previous replies, this one does all substitutions <em>in one go</em>, so it will not replace parts of previously replaced values.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A diferencia de soluciones similares en respuestas anteriores, esta realiza todas las sustituciones </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de una vez</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que no reemplazar&aacute; partes de valores reemplazados anteriormente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以前の返信の同様のソリューションとは対照的に、これは一度にすべての置換</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行うため、以前に置き換えられた値の一部を置き換えません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 답변의 유사한 솔루션과 달리이 방법은 한 번에 모든 대체 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">를 수행</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하므로 이전에 대체 된 값의 일부를 대체하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В отличие от аналогичных решений в предыдущих ответах, этот выполняет все замены </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">за один раз</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому он не заменит части ранее замененных значений.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与以往的答复类似的解决方案对比，这其中做了所有替代</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一气呵成</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，所以它不会取代先前所取代值的部分。</font></font>

source: It's funny because Stack&nbsp;Overflow actually has their own formatting function for the <code>String</code> prototype called <code>formatUnicorn</code>. Try it! Go into the console and type something like:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es divertido porque Stack Overflow en realidad tiene su propia funci&oacute;n de formateo para el </font><font style="vertical-align: inherit;">prototipo de </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llamado </font></font> <code>formatUnicorn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iexcl;Intentalo! </font><font style="vertical-align: inherit;">Entra en la consola y escribe algo como:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">面白いことに、Stack Overflowには、実際には</font> <code>formatUnicorn</code> <font style="vertical-align: inherit;">という</font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロトタイプ</font><font style="vertical-align: inherit;">用の独自のフォーマット関数があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">それを試してみてください！</font><font style="vertical-align: inherit;">コンソールに移動し、次のように入力します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스택 오버플로에는 실제로 </font> <code>formatUnicorn</code> <font style="vertical-align: inherit;"> 이라는 </font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로토 타입에 </font><font style="vertical-align: inherit;">대한 자체 형식 지정 기능이 있기 때문에 재미 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">시도 해봐! </font><font style="vertical-align: inherit;">콘솔로 이동하여 다음과 같이 입력하십시오.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это забавно, потому что Stack Overflow фактически имеет свою собственную функцию форматирования для </font><font style="vertical-align: inherit;">прототипа </font></font> <code>String</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> называемую </font></font> <code>formatUnicorn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Попытайся! </font><font style="vertical-align: inherit;">Зайдите в консоль и наберите что-то вроде:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这很有趣，因为Stack Overflow实际上对</font></font> <code>String</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原型</font><font style="vertical-align: inherit;">拥有自己的格式化功能，</font><font style="vertical-align: inherit;">称为</font></font> <code>formatUnicorn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">试试看！</font><font style="vertical-align: inherit;">进入控制台并输入如下内容：</font></font>

source: JavaScript equivalent to printf/String.Format
es: JavaScript equivalente a printfString.Format
ja: printfString.Format と同等の JavaScript
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">printf / String.Format에 해당하는 JavaScript</font></font>
ru: JavaScript эквивалент printfString.Format
zh_cn: 相当于 printfString.Format 的 JavaScript

source: JavaScript programmers can use String.prototype.sprintf at <a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js">https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js</a>. Below is example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los programadores de JavaScript pueden usar String.prototype.sprintf en </font></font><a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">A continuaci&oacute;n se muestra un ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptプログラマーは、</font></font><a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https：</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> //github.com/ildar-shaimordanov/jsxt/blob/master/js/String.jsにあるString.prototype.sprintfを使用でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">以下は例です：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 프로그래머는 </font></font><a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 String.prototype.sprintf를 사용할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">아래는 예입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Программисты JavaScript могут использовать String.prototype.sprintf по адресу </font></font><a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ниже приведен пример:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript程序员可以在</font></font><a href="https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/ildar-shaimordanov/jsxt/blob/master/js/String.js上</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用String.prototype.sprintf </font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">下面是示例：</font></font>

source: Just in case someone needs a function to prevent polluting global scope, here is the function that does the same:
es: En caso de que alguien necesite una función para prevenir la contaminación de alcance global,aquí está la función que hace lo mismo:
ja: 誰かがグローバルスコープを汚染しないようにするための関数を必要としている場合に備えて、ここに同じことを行う関数があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가가 전역 범위를 오염시키는 것을 방지하는 기능이 필요한 경우를 대비하여 다음과 같은 기능을 수행합니다.</font></font>
ru: На тот случай,если кому-то понадобится функция для предотвращения загрязнения глобального масштаба,вот такая функция,которая делает то же самое:
zh_cn: 万一有人需要一个防止污染全局范围的函数,这里有同样的函数。

source: Maybe it could be even better to deal with the all deeps cases, but for my needs this is just fine.
es: Tal vez sería mejor tratar con los casos más profundos,pero para mis necesidades esto está bien.
ja: オールディープスのケースに対応してくれればもっといいのかもしれませんが、私のニーズにはこれでちょうどいいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어쩌면 모든 심층 사건을 다루는 것이 더 나을 수도 있지만, 내 필요에 따라 이것은 괜찮습니다.</font></font>
ru: Может быть,было бы еще лучше разобраться со всеми глубокими делами,но для моих нужд это просто прекрасно.
zh_cn: 也许它可以更好地处理全深的情况下,但对于我的需求来说,这就够了。

source: My basic requirement is a thousand separator format for numbers for now, but something that handles lots of combinations (including dates) would be good.
es: Mi requisito básico es un formato de mil separadores para los números por ahora,pero algo que maneje muchas combinaciones (incluyendo fechas)sería bueno.
ja: 私の基本的な要件は、今のところ数字の1000区切り形式ですが、(日付を含む)多くの組み合わせを扱えるものが良いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 기본 요구 사항은 현재 숫자에 대한 천 단위 구분 기호 형식이지만 많은 조합 (날짜 포함)을 처리하는 것이 좋습니다.</font></font>
ru: На данный момент моим основным требованием является формат тысячи разделителей для чисел,но то,что работает с большим количеством комбинаций (включая даты),было бы неплохо.
zh_cn: 我现在的基本要求是数字的千位分隔符格式,但如果能处理很多组合(包括日期)就好了。

source: Normally you would expect the output to be <code>{1}{0}</code> but the actual output is <code>{1}{1}</code>. So do a simultaneously replacement instead like in <a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436">fearphage&rsquo;s suggestion</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Normalmente esperar&iacute;a que la salida sea </font></font> <code>{1}{0}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero la salida real es </font></font> <code>{1}{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Por lo tanto, realice un reemplazo simult&aacute;neo en lugar de </font></font><a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la sugerencia de miedo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通常、出力は</font></font> <code>{1}{0}</code> である<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と予想されます</font><font style="vertical-align: inherit;">が、実際の出力は</font></font> <code>{1}{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">そのため、代わりに</font></font><a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">恐怖症の提案の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ように同時に置換を行います</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 출력은 </font></font> <code>{1}{0}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이지만 실제 출력은 </font></font> <code>{1}{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">따라서 </font></font><a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fearphage의 제안</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서와 같이 동시에 교체하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обычно вы ожидаете, что результат будет </font></font> <code>{1}{0}</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> но фактический результат равен </font></font> <code>{1}{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Так что сделайте одновременно замену, как в </font></font><a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предложении страха</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通常，您希望输出为</font></font> <code>{1}{0}</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但实际输出为</font></font> <code>{1}{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，请同时执行替换操作，如在</font></font><a href="https://stackoverflow.com/questions/610406/javascript-printf-string-format/4673436#4673436"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">噬菌体的建议中那样</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Note the clever <code>Array.prototype.slice.call(arguments)</code> call -- that means if you throw in arguments that are strings or numbers, not a single JSON-style object, you get C#'s <a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"><code>String.Format</code></a> behavior almost exactly.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta la inteligente </font><font style="vertical-align: inherit;">llamada </font></font> <code>Array.prototype.slice.call(arguments)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo que significa que si agrega argumentos que son cadenas o n&uacute;meros, no un solo objeto de estilo JSON, obtendr&aacute; el </font><font style="vertical-align: inherit;">comportamiento </font></font><a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"> <code>String.Format</code> de</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> C # </font><font style="vertical-align: inherit;">casi exactamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">巧妙な</font></font> <code>Array.prototype.slice.call(arguments)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出しに</font><font style="vertical-align: inherit;">注意してください。</font><font style="vertical-align: inherit;">つまり、単一のJSONスタイルのオブジェクトではなく、文字列または数値である引数をスローすると、C＃の</font></font><a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"> <code>String.Format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">動作がほぼ正確に得られます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현명한 </font></font> <code>Array.prototype.slice.call(arguments)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출에 </font><font style="vertical-align: inherit;">주목하십시오. </font><font style="vertical-align: inherit;">즉, 단일 JSON 스타일 객체가 아닌 문자열 또는 숫자 인 인수를 던지면 C #의 </font></font><a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"> <code>String.Format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동작이 거의 정확하게 나타납니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание на умный </font></font> <code>Array.prototype.slice.call(arguments)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это означает, что если вы </font><font style="vertical-align: inherit;">добавите</font><font style="vertical-align: inherit;"> аргументы, которые являются строками или числами, а не одним объектом в стиле JSON, вы </font><font style="vertical-align: inherit;">почти точно </font></font><a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"> <code>String.Format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поведение </font><font style="vertical-align: inherit;">C # </font><font style="vertical-align: inherit;">String.Format</font><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意聪明的</font></font> <code>Array.prototype.slice.call(arguments)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用-这意味着，如果您抛出的参数是字符串或数字，而不是单个JSON样式的对象，则</font><font style="vertical-align: inherit;">几乎完全</font><font style="vertical-align: inherit;">可以得到C＃的</font></font><a href="https://msdn.microsoft.com/en-us/library/system.string.format(v=vs.110).aspx#Starting"> <code>String.Format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行为。</font></font>

source: Number Formatting in JavaScript
es: Formato de los números en JavaScript
ja: JavaScriptでの数字の書式設定
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript에서 숫자 서식</font></font>
ru: Форматирование номеров на JavaScript
zh_cn: JavaScript中的数字格式化

source: One very slightly different version, the one I prefer (this one uses {xxx} tokens rather than {0} numbered arguments, this is much more self-documenting and suits localization much better):
es: Una versión muy ligeramente diferente,la que yo prefiero (esta utiliza {xxx}fichas en lugar de {0}argumentos numerados,es mucho más auto-documentada y se adapta mucho mejor a la localización):
ja: 私が好きなのは、少し変わったバージョンです(このバージョンでは、{0}の番号付き引数ではなく{xxx}トークンを使用します。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우 선호하는 버전 중 하나는 내가 선호하는 버전입니다 (이 버전은 {0} 번호가 매겨진 인수가 아닌 {xxx} 토큰을 사용합니다.이 방법은 훨씬 더 자체 문서화되어 있으며 현지화에 훨씬 적합합니다).</font></font>
ru: Одна очень немножко другая версия,та,которую я предпочитаю (в этой версии используются жетоны {xxx},а не пронумерованные аргументы {0},это гораздо более самооформление и подходит для локализации гораздо лучше):
zh_cn: 一个非常不同的版本,我更喜欢这个版本(这个版本使用{xxx}令牌,而不是{0}编号参数,这样更容易自证,更适合本地化)。
