Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: &lt; ES6
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;ES6</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;ES6</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;ES6</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;ES6</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;ES6</font></font>

source: +1 Zippo with the exception that the function body needs to be as below or otherwise it appends the current string on every iteration:
es: +1 Zippo con la excepción de que el cuerpo de la función tiene que ser como abajo o de lo contrario añade la cadena actual en cada iteración:
ja: +1 Zippoは、関数本体が以下のようになっていなければならないという例外を除いて、反復のたびに現在の文字列を追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수 본문이 아래와 같거나 매 반복마다 현재 문자열을 추가한다는 점을 제외하고 Zippo +1</font></font>
ru: +1 Zippo за исключением того,что тело функции должно быть как указано ниже или иначе оно добавляет текущую строку на каждой итерации:
zh_cn: +1 Zippo,但函数体需要如下所示,否则每次迭代时都会附加当前字符串。

source: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed">Mozilla reference page for toFixed()</a> (with links to toPrecision(), toExponential(), toLocaleString(), ...)
es: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">P&aacute;gina de referencia de Mozilla para toFixed ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (con enlaces a toPrecision (), toExponential (), toLocaleString (), ...)</font></font>
ja: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">toFixed（）のMozillaリファレンスページ（</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> toPrecision（）、toExponential（）、toLocaleString（）などへのリンク付き）</font></font>
ko: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">toFixed ()에 대한 Mozilla 참조 페이지 (</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> toPrecision (), toExponential (), toLocaleString () 등의 링크 포함)</font></font>
ru: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Справочная страница Mozilla для toFixed ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (со ссылками на toPrecision (), toExponential (), toLocaleString (), ...)</font></font>
zh_cn: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Number/toFixed"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MoFi的</font><font style="vertical-align: inherit;">toFixed（）参考页</font><font style="vertical-align: inherit;">（带有toPrecision（），toExponential（），toLocaleString（）等的链接）</font></font>

source: <em>Note: Check the mozilla-site to find a list of supported browsers.</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota: Consulte el sitio de mozilla para encontrar una lista de navegadores compatibles.</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：サポートされているブラウザーのリストを見つけるには、mozilla-siteを確認してください。</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : 지원되는 브라우저 목록을 찾으려면 mozilla 사이트를 확인하십시오.</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание. Проверьте сайт mozilla, чтобы найти список поддерживаемых браузеров.</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：检查mozilla站点以找到支持的浏览器列表。</font></font></em>

source: <em>reduce</em> applies a function against an accumulator and each element in the array (from left to right) to reduce it to a single value.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reduce</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aplica una funci&oacute;n contra un acumulador y cada elemento de la matriz (de izquierda a derecha) para reducirlo a un solo valor.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reduce</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、アキュムレータと配列内の各要素（左から右へ）に対して関数を適用して、単一の値に減らします。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reduce</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 누산기와 배열의 각 요소 (왼쪽에서 오른쪽으로)에 대해 함수를 적용하여 단일 값으로 줄입니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Reduce</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> применяет функцию к аккумулятору и каждому элементу в массиве (слева направо), чтобы уменьшить его до одного значения.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reduce</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对一个累加器和数组中的每个元素（从左到右）应用一个函数，以将其减小为单个值。</font></font>

source: <strong>String Format for Objects including specifiers:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Formato de cadena para objetos que incluyen especificadores:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指定子を含むオブジェクトの文字列形式：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지정자를 포함한 객체의 문자열 형식 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Формат строки для объектов, включая спецификаторы:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象的字符串格式，包括说明符：</font></font></strong>

source: <strong>String Format for specifiers:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Formato de cadena para especificadores:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指定子の文字列形式：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지정자를위한 문자열 형식 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Формат строки для спецификаторов:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">说明符的字符串格式：</font></font></strong>

source: A variation would be:
es: Una variación sería:
ja: バリエーションとしては
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변형은 다음과 같습니다.</font></font>
ru: Вариант был бы:
zh_cn: 变化将是:

source: ASP is dead, but ASP.NET is alive! ASP {2}
es: El ASP está muerto,pero el ASP.NET está vivo.ASP {2}
ja: ASPは死んだが、ASP.NETは生きている! ASP {2}の
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ASP는 죽었지 만 ASP.NET은 살아 있습니다! </font><font style="vertical-align: inherit;">ASP {2}</font></font>
ru: ASP мертва,но ASP.NET жива! ASP {2}
zh_cn: ASP已经死了,但ASP.NET还活着! ASP {2}

source: Adding to <code>zippoxer</code>'s answer, I use this function:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Agregando a </font><font style="vertical-align: inherit;">la respuesta de </font></font> <code>zippoxer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , uso esta funci&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">追加</font></font> <code>zippoxer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の答えを、私はこの機能を使用します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>zippoxer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 답변에 </font><font style="vertical-align: inherit;">추가하면 </font><font style="vertical-align: inherit;">이 기능을 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Добавляя к </font></font> <code>zippoxer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я использую эту функцию:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font> <code>zippoxer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的答案中，我使用以下功能：</font></font>

source: All the cool new stuff in ES 2015 makes this a lot easier:
es: Todas las nuevas cosas geniales de ES 2015 lo hacen mucho más fácil:
ja: ES 2015のすべてのクールな新しいものは、これを非常に簡単にします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES 2015의 모든 멋진 새 기능을 사용하면이 작업이 훨씬 쉬워집니다.</font></font>
ru: Все крутые новинки в ES 2015 делают это намного проще:
zh_cn: ES 2015中所有很酷的新东西都让这一切变得简单了许多。

source: Also, if you have say a ObjectBase.prototype.format (such as with <a href="http://www.datejs.com/">DateJS</a>) it will use that.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, si ha dicho un ObjectBase.prototype.format (como con </font></font><a href="http://www.datejs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DateJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) lo usar&aacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、ObjectBase.prototype.format（</font></font><a href="http://www.datejs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DateJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">など</font><font style="vertical-align: inherit;">）と</font><font style="vertical-align: inherit;">言った場合は、</font><font style="vertical-align: inherit;">それを使用します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 ObjectBase.prototype.format (예 : </font></font><a href="http://www.datejs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DateJS 사용</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">을 </font><font style="vertical-align: inherit;">말하면</font><font style="vertical-align: inherit;"> 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, если вы говорите ObjectBase.prototype.format (например, с </font></font><a href="http://www.datejs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DateJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), он будет использовать это.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另外，如果您说一个ObjectBase.prototype.format（例如</font></font><a href="http://www.datejs.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DateJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），它将使用它。</font></font>

source: Be aware that template strings are <strong>surrounded by backticks</strong> ` instead of (single) quotes.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que las cadenas de plantilla est&aacute;n </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rodeadas por</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comillas </font><strong><font style="vertical-align: inherit;">invertidas</font></strong><font style="vertical-align: inherit;"> `en lugar de comillas (simples).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テンプレート文字列は</font><font style="vertical-align: inherit;">、（単一の）引用符ではなく、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バッククォート</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> `で</font><strong><font style="vertical-align: inherit;">囲まれ</font></strong><font style="vertical-align: inherit;">ていることに注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 문자열은 </font><font style="vertical-align: inherit;">(작은) 따옴표 대신 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">백틱으로</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 묶습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имейте в виду, что строки шаблона заключаются </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в обратные кавычки</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> `вместо (одинарных) кавычек.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，模板字符串</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用反引号</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> `代替，而不是（单引号）。</font></font>

source: Because most of the other proposals that are mentioned fail when a replace string of previous replacement does also contain a format sequence like this:
es: Porque la mayoría de las demás propuestas que se mencionan fracasan cuando una cadena de sustitución de la anterior contiene también una secuencia de formato como ésta:
ja: なぜなら、言及されている他の提案のほとんどは、前の置換の置換文字列がこのようなフォーマットのシーケンスを含む場合にも失敗するからです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 대체 문자열 바꾸기에 다음과 같은 형식 순서가 포함되어 있으면 언급 된 대부분의 다른 제안이 실패하기 때문에 :</font></font>
ru: Потому что большинство других предложений,которые упоминаются,терпят неудачу,когда заменяющая строка предыдущей замены также содержит последовательность форматов,подобную этой:
zh_cn: 因为当替换前的替换字符串也包含像这样的格式序列时,大多数其他提到的建议都会失败。

source: Building on the previously suggested solutions:
es: Basándose en las soluciones sugeridas anteriormente:
ja: 以前に提案された解決策に基づいて構築する。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전에 제안 된 솔루션을 기반으로 :</font></font>
ru: Основываясь на ранее предложенных решениях:
zh_cn: 在先前建议的解决方案的基础上:

source: Credit goes to <del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/">(broken link)</a></del><a href="https://gist.github.com/0i0/1519811">https://gist.github.com/0i0/1519811</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El cr&eacute;dito va a </font></font><del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Enlace roto)</font></font></a></del><a href="https://gist.github.com/0i0/1519811"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://gist.github.com/0i0/1519811</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クレジットは </font></font><del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（リンク切れ）</font></font></a></del><a href="https://gist.github.com/0i0/1519811"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://gist.github.com/0i0/1519811</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">신용은 </font></font><del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(깨진 링크)</font></font></a></del><a href="https://gist.github.com/0i0/1519811"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://gist.github.com/0i0/1519811</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кредит идет в </font></font><del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(неработающей ссылке)</font></font></a></del><a href="https://gist.github.com/0i0/1519811"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://gist.github.com/0i0/1519811</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功劳归于 </font></font><del><a href="http://technoblogia.net/2011/11/08/%D7%98%D7%99%D7%A4-%D7%A4%D7%95%D7%A0%D7%A7%D7%A6%D7%99%D7%99%D7%AA-%D7%A2%D7%96%D7%A8-%D7%91-javascript-%D7%9C%D7%A2%D7%99%D7%A6%D7%95%D7%91-%D7%9E%D7%97%D7%A8%D7%95%D7%96%D7%95%D7%AA/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（链接断开）</font></font></a></del><a href="https://gist.github.com/0i0/1519811"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://gist.github.com/0i0/1519811</font></font></a>

source: ES 2015 update
ja: ES 2015年更新
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES 2015 업데이트</font></font>
ru: обновление ES 2015
zh_cn: ES 2015年更新

source: ES6 (EcmaScript2015)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 (EcmaScript2015)</font></font>

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Exponential form
es: Forma exponencial
ja: 指数形
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수 형태</font></font>
ru: Экспоненциальная форма
zh_cn: 指数形式

source: For <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> users there is <a href="https://nodejs.org/api/util.html#util_util_format_format_args"><code>util.format</code></a> which has printf-like functionality:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para los </font><font style="vertical-align: inherit;">usuarios de </font></font><a href="http://en.wikipedia.org/wiki/Node.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay </font></font><a href="https://nodejs.org/api/util.html#util_util_format_format_args"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que tiene una funcionalidad similar a printf:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のため</font></font><a href="http://en.wikipedia.org/wiki/Node.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のNode.jsの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザーが存在し</font></font><a href="https://nodejs.org/api/util.html#util_util_format_format_args"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> printfのような機能があります：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">들어 </font></font><a href="http://en.wikipedia.org/wiki/Node.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.js를의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자가 </font></font><a href="https://nodejs.org/api/util.html#util_util_format_format_args"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> printf와 같은 기능이 있습니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для </font><font style="vertical-align: inherit;">пользователей </font></font><a href="http://en.wikipedia.org/wiki/Node.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> есть </font></font><a href="https://nodejs.org/api/util.html#util_util_format_format_args"> <code>util.format</code> ,</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который имеет </font><font style="vertical-align: inherit;">подобную</font><font style="vertical-align: inherit;"> printf функциональность:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于</font></font><a href="http://en.wikipedia.org/wiki/Node.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Node.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用户，有</font></font><a href="https://nodejs.org/api/util.html#util_util_format_format_args"> <code>util.format</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有类似于printf的功能：</font></font>

source: For basic formatting:
es: Para el formato básico:
ja: 基本的な書式設定のため。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 형식의 경우 :</font></font>
ru: Для базового форматирования:
zh_cn: 对于基本的格式化。

source: For further information:
es: Para más información:
ja: 詳細はこちらをご覧ください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 정보 :</font></font>
ru: Для дополнительной информации:
zh_cn: 进一步的信息:
