Repository: rueisnom/feedback
Catalog: xlf/61/04/06/610406.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The equivalent of <code>sprintf("%.2f", num)</code> in JavaScript seems to be <code>num.toFixed(2)</code>, which formats <code>num</code> to 2 decimal places, with rounding (but see @ars265's comment about <code>Math.round</code> below).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El equivalente de </font></font> <code>sprintf("%.2f", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en JavaScript parece ser </font></font> <code>num.toFixed(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que formatea </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con 2 decimales, con redondeo (pero vea el comentario de @ ars265 sobre </font></font> <code>Math.round</code> a<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> continuaci&oacute;n).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript </font><font style="vertical-align: inherit;">の</font></font> <code>sprintf("%.2f", num)</code> <font style="vertical-align: inherit;"></font> <code>num.toFixed(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"、num）</font><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">相当するのは</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">num.toFixed（2）のようです</font><font style="vertical-align: inherit;">。これは、</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を小数点以下2桁に</font><font style="vertical-align: inherit;">フォーマット</font><font style="vertical-align: inherit;">し、丸めます（ただし、</font><font style="vertical-align: inherit;">以下の</font></font> <code>Math.round</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に関する@ ars265のコメントを</font><font style="vertical-align: inherit;">参照）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 등가 </font></font> <code>sprintf("%.2f", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자바 스크립트는 것 같다 </font></font> <code>num.toFixed(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포맷, </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반올림하여 소수점 이하 2 자리까지를, (그러나 약 ars265의 코멘트 @ 참조 </font></font> <code>Math.round</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아래).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Эквивалент </font></font> <code>sprintf("%.2f", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в JavaScript выглядит как </font></font> <code>num.toFixed(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который форматирует </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> до 2 десятичных знаков с округлением (но см. Комментарий @ ars265 о </font></font> <code>Math.round</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ниже).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript中</font><font style="vertical-align: inherit;">的</font></font> <code>sprintf("%.2f", num)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等效</font><font style="vertical-align: inherit;">于</font></font> <code>num.toFixed(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其格式将</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">舍入为小数点后2位（但请参见下面的@ ars265关于</font></font> <code>Math.round</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的评论</font><font style="vertical-align: inherit;">）。</font></font>

source: Then I call it:
es: Entonces lo llamo:
ja: それから電話します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 호출합니다.</font></font>
ru: Тогда я назову это:
zh_cn: 那我就叫它。

source: There is "sprintf" for JavaScript which you can find at <a href="http://www.webtoolkit.info/javascript-sprintf.html">http://www.webtoolkit.info/javascript-sprintf.html</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay "sprintf" para JavaScript que puede encontrar en </font></font><a href="http://www.webtoolkit.info/javascript-sprintf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.webtoolkit.info/javascript-sprintf.html</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptの「sprintf」が</font></font><a href="http://www.webtoolkit.info/javascript-sprintf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.webtoolkit.info/javascript-sprintf.htmlにあります</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://www.webtoolkit.info/javascript-sprintf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.webtoolkit.info/javascript-sprintf.html</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 찾을 수있는 JavaScript 용 "sprintf"가 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для JavaScript есть &laquo;sprintf&raquo;, который вы можете найти по адресу </font></font><a href="http://www.webtoolkit.info/javascript-sprintf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.webtoolkit.info/javascript-sprintf.html</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以在</font></font><a href="http://www.webtoolkit.info/javascript-sprintf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.webtoolkit.info/javascript-sprintf.html上</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到JavaScript的&ldquo; sprintf&rdquo; </font><font style="vertical-align: inherit;">。</font></font>

source: This option fits better.
es: Esta opción encaja mejor.
ja: このオプションの方がフィットします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 옵션이 더 적합합니다.</font></font>
ru: Этот вариант подходит лучше.
zh_cn: 这个方案比较适合。

source: To print numbers in base B, try <code>num.toString(B)</code>. JavaScript supports automatic conversion to and from bases 2 through 36 (in addition, some browsers have <a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa">limited support for base64 encoding</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para imprimir n&uacute;meros en la base B, intente </font></font> <code>num.toString(B)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">JavaScript admite la conversi&oacute;n autom&aacute;tica hacia y desde las bases 2 a 36 (adem&aacute;s, algunos navegadores tienen </font></font><a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">soporte limitado para la codificaci&oacute;n base64</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基数Bの数値を出力するには、</font></font> <code>num.toString(B)</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">試してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">JavaScriptは、base 2からbase 36への自動変換をサポートします（さらに、一部のブラウザーは</font></font><a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">base64エンコードのサポートを制限しています</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 B의 숫자를 인쇄하려면 </font></font> <code>num.toString(B)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 시도 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">JavaScript는베이스 2에서 36까지의 자동 변환을 지원합니다 (또한 일부 브라우저는 </font></font><a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">base64 인코딩에 대한 지원</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font><font style="vertical-align: inherit;">제한되어 있습니다</font><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы напечатать числа в базе B, попробуйте </font></font> <code>num.toString(B)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">JavaScript поддерживает автоматическое преобразование в базы 2 и 36 и обратно (кроме того, некоторые браузеры имеют </font></font><a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ограниченную поддержку кодировки base64</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要在基数B中打印数字，请尝试</font></font> <code>num.toString(B)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">JavaScript支持从2到36的自动转换（此外，某些浏览器</font></font><a href="https://developer.mozilla.org/en-US/docs/DOM/window.btoa"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对base64编码的支持有限</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: Try <a href="https://github.com/alexei/sprintf.js">sprintf() for JavaScript</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prueba </font></font><a href="https://github.com/alexei/sprintf.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sprintf () para JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/alexei/sprintf.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptのsprintf（）を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">試してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/alexei/sprintf.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript는 sprintf ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용해보십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попробуйте </font></font><a href="https://github.com/alexei/sprintf.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sprintf () для JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试</font></font><a href="https://github.com/alexei/sprintf.js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sprintf（）for JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Very elegant:
es: Muy elegante:
ja: とてもエレガントです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우 우아함 :</font></font>
ru: Очень элегантно:
zh_cn: 非常优雅。

source: We can use a simple lightweight <a href="https://github.com/sevensc/typescript-string-operations#stringformat">String.Format</a> string operation library for Typescript.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podemos usar una </font><font style="vertical-align: inherit;">biblioteca </font><font style="vertical-align: inherit;">simple de </font><font style="vertical-align: inherit;">operaci&oacute;n de cadenas </font></font><a href="https://github.com/sevensc/typescript-string-operations#stringformat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.Format</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ligera para </font><font style="vertical-align: inherit;">Typecript</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/sevensc/typescript-string-operations#stringformat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typescriptに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、単純な軽量の</font><font style="vertical-align: inherit;">String.Format</font><font style="vertical-align: inherit;">文字列操作ライブラリを</font><font style="vertical-align: inherit;">使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Typescript에 </font><font style="vertical-align: inherit;">간단한 경량 </font></font><a href="https://github.com/sevensc/typescript-string-operations#stringformat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.Format</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자열 작업 라이브러리를 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы можем использовать простую облегченную </font></font><a href="https://github.com/sevensc/typescript-string-operations#stringformat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">библиотеку</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> строковых операций </font><font style="vertical-align: inherit;">String.Format</font><font style="vertical-align: inherit;"> для Typescript.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以</font><font style="vertical-align: inherit;">为Typescript </font><font style="vertical-align: inherit;">使用简单的轻量级</font></font><a href="https://github.com/sevensc/typescript-string-operations#stringformat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String.Format</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符串操作库。</font></font>

source: Where the en.json is something like
es: Donde el en.json es algo así como
ja: en.json は以下のようなものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">en.json과 같은 곳</font></font>
ru: Где Эн-Джсон-это что-то вроде
zh_cn: 其中en.json是类似于

source: With this option I can replace strings like these:
es: Con esta opción puedo reemplazar cuerdas como estas:
ja: このオプションを使うと、このような文字列を置き換えることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 옵션을 사용하면 다음과 같은 문자열을 바꿀 수 있습니다.</font></font>
ru: С помощью этой опции я могу заменить такие строки:
zh_cn: 有了这个选项,我就可以更换像这样的字符串。

source: With your code the second {0} wouldn't be replaced. ;)
es: Con tu código el segundo {0}no sería reemplazado.;)
ja: あなたのコードでは、2 番目の {0}は置き換えられません。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드를 사용하면 두 번째 {0}이 (가) 대체되지 않습니다. </font><font style="vertical-align: inherit;">;)</font></font>
ru: С вашим кодом вторая {0}не будет заменена.;)
zh_cn: 用你的代码,第二个{0}不会被替换。)

source: You can do formatting several ways:
es: Puedes hacer el formateo de varias maneras:
ja: フォーマットはいくつかの方法で行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 가지 형식을 지정할 수 있습니다.</font></font>
ru: Вы можете сделать форматирование несколькими способами:
zh_cn: 你可以通过多种方式进行格式化。

source: You can use objects, arrays, and strings as arguments! I got its code and reworked it to produce a new version of <code>String.prototype.format</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Puedes usar objetos, matrices y cadenas como argumentos! </font><font style="vertical-align: inherit;">Obtuve su c&oacute;digo y lo reformul&eacute; para producir una nueva versi&oacute;n de </font></font> <code>String.prototype.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト、配列、文​​字列を引数として使用できます！</font><font style="vertical-align: inherit;">私はそのコードを取得して、新しいバージョンの</font></font> <code>String.prototype.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を生成するように</font><font style="vertical-align: inherit;">修正しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체, 배열 및 문자열을 인수로 사용할 수 있습니다! </font><font style="vertical-align: inherit;">코드를 가져 와서 새로운 버전의 </font></font> <code>String.prototype.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 생성하도록 재 작업했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать объекты, массивы и строки в качестве аргументов! </font><font style="vertical-align: inherit;">Я получил его код и переработал его, чтобы создать новую версию </font></font> <code>String.prototype.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用对象，数组和字符串作为参数！</font><font style="vertical-align: inherit;">我得到了它的代码，并对其进行了重新处理以产生新版本的</font></font> <code>String.prototype.format</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: You get this output:
es: Tienes esta salida:
ja: このような出力が得られます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 출력을 얻습니다.</font></font>
ru: Ты получишь этот выход:
zh_cn: 你可以得到这个输出。

source: jsxt, Zippo
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsxt, 지포</font></font>

source: number_format (for thousand separator/currency formatting)
es: formato_de_número (para el formato de mil monedas de separación)
ja: number_format (千区切り通貨フォーマット用)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">number_format (천 단위 구분 기호 / 통화 형식)</font></font>
ru: number_format (для форматирования тысяч разделительных валют)
zh_cn: number_format (用于千位数分隔符货币格式化)

source: sprintf (same author as above)
es: sprintf (mismo autor que el anterior)
ja: スプリントフ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sprintf (위와 동일한 저자)</font></font>
ru: спринтф (тот же автор,что и выше)
zh_cn: sprintf(同上)

source: that calls an l() localization function first.
es: que llama primero a una función de localización l().
ja: は、最初に l()ローカライズ関数を呼び出すことになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 l () 지역화 함수를 호출합니다.</font></font>
ru: которая сначала вызывает функцию локализации l().
zh_cn: 先调用一个l()定位函数。

source: with the same result:
es: con el mismo resultado:
ja: と同じ結果になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은 결과로 :</font></font>
ru: с тем же результатом:
zh_cn: 以同样的结果。
