Repository: rueisnom/feedback
Catalog: xlf/13/59/01/8/1359018.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: link text
es: texto de enlace
ja: リンクテキスト
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링크 텍스트</font></font>
ru: текст ссылки
zh_cn: 链接文字
