Repository: rueisnom/feedback
Catalog: xlf/13/59/01/8/1359018.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://stackoverflow.com/a/9331127/24970">Sean's answer</a> shows an example.
es: <a href="https://stackoverflow.com/a/9331127/24970"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La respuesta de Sean</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> muestra un ejemplo.</font></font>
ja: <a href="https://stackoverflow.com/a/9331127/24970"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ショーンの答え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は例を示しています。</font></font>
ko: <a href="https://stackoverflow.com/a/9331127/24970"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sean의 답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 예를 보여줍니다.</font></font>
ru: <a href="https://stackoverflow.com/a/9331127/24970"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ответ Шона</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> показывает пример.</font></font>
zh_cn: <a href="https://stackoverflow.com/a/9331127/24970"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">肖恩的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">显示了一个例子。</font></font>

source: <strong>For example:</strong>
es: <strong>Por ejemplo:</strong>
ja: <strong>例えば：</strong>
ko: <strong>예를 들면 다음과 같습니다.</strong>
ru: <strong>Например:</strong>
zh_cn: <strong>例如：</strong>

source: After jQuery 1.7 the preferred methods are <a href="http://api.jquery.com/on/">.on()</a> and <a href="http://api.jquery.com/off/">.off()</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Despu&eacute;s de jQuery 1.7, los m&eacute;todos preferidos son </font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.on ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="http://api.jquery.com/off/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.off ()</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.7以降、推奨されるメソッドは</font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.on（）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font><a href="http://api.jquery.com/off/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.off（）です。</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery를 1.7 후에 바람직한 방법은 </font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSTE 연구진 ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font><a href="http://api.jquery.com/off/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.OFF ()</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">После jQuery 1.7 предпочтительными являются методы </font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.on ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://api.jquery.com/off/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.off ()</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在jQuery 1.7之后，首选方法是</font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.on（）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font><font style="vertical-align: inherit;">.off </font></font><a href="http://api.jquery.com/off/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（）</font></font></a>

source: Also, the <a href="http://docs.jquery.com/Plugins/livequery/livequery">livequery</a> plugin does this and has support for more events.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, el </font><font style="vertical-align: inherit;">complemento </font></font><a href="http://docs.jquery.com/Plugins/livequery/livequery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">livequery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace esto y tiene soporte para m&aacute;s eventos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font><a href="http://docs.jquery.com/Plugins/livequery/livequery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">livequery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プラグインはこれを行い、より多くのイベントをサポートします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font></font><a href="http://docs.jquery.com/Plugins/livequery/livequery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">livequery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플러그인이이를 수행하며 더 많은 이벤트를 지원합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, </font><font style="vertical-align: inherit;">плагин </font></font><a href="http://docs.jquery.com/Plugins/livequery/livequery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">livequery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает это и поддерживает больше событий.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另外，</font></font><a href="http://docs.jquery.com/Plugins/livequery/livequery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">livequery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">插件可以做到这一点，并支持更多事件。</font></font>

source: And my HTML might be as follows:
es: Y mi HTML podría ser el siguiente:
ja: そして、私のHTMLは以下のようになるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 HTML은 다음과 같습니다.</font></font>
ru: И мой HTML может быть следующим:
zh_cn: 而我的HTML可能是这样的。

source: As long as the ul tag exists this will work (no li elements need exist yet).
es: Mientras exista el ul tag esto funcionará (no es necesario que existan elementos de li todavía).
ja: ul タグが存在する限り、これは動作します(まだ li 要素が存在する必要はありません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ul 태그가 존재하는 한 이것이 작동합니다 (li 요소가 아직 필요하지 않습니다).</font></font>
ru: Пока существует ul-тег,это будет работать (пока нет необходимости в наличии элементов li).
zh_cn: 只要UL标签存在,这就可以工作(还不需要存在li元素)。

source: As of jQuery 1.7, the .live() method is deprecated. Use .on() to attach event handlers. Users of older versions of jQuery should use .delegate() in preference to .live().
es: A partir de jQuery 1.7,el método .live()está desaprobado.Usa .on()para adjuntar manejadores de eventos.Los usuarios de versiones anteriores de jQuery deben usar .delegate()en lugar de .live().
ja: jQuery 1.7 以降、.live()メソッドは非推奨となっています。イベント ハンドラをアタッチするには .on()を使用してください。古いバージョンの jQuery のユーザーは、.live()ではなく .delegate()を使用する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.7부터 .live () 메소드는 더 이상 사용되지 않습니다. </font><font style="vertical-align: inherit;">.on ()을 사용하여 이벤트 핸들러를 첨부하십시오. </font><font style="vertical-align: inherit;">이전 버전의 jQuery 사용자는 .live ()보다 .delegate ()를 사용해야합니다.</font></font>
ru: Начиная с версии jQuery 1.7,метод .live()устарел.Используйте .on()для прикрепления обработчиков событий.Пользователи старых версий jQuery должны использовать .delegate()вместо .live().
zh_cn: 由于jQuery 1.7,.live()方法已经被淘汰。使用.on()方法来附加事件处理程序。旧版本的jQuery的用户应该使用.delegate()优先于.live()。

source: Basically, I would like to write the <code>click()</code> handler once and have it apply to both content present at page load, and content brought in later via <strong>AJAX / DHTML</strong>. Any idea how I can fix this?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B&aacute;sicamente, me gustar&iacute;a escribir el </font><font style="vertical-align: inherit;">controlador </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una vez y hacer que se aplique tanto al contenido presente en la carga de la p&aacute;gina como al contenido introducido m&aacute;s tarde a trav&eacute;s de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX / DHTML</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iquest;Alguna idea de c&oacute;mo puedo solucionar esto?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的に、私は</font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハンドラーを1回</font><font style="vertical-align: inherit;">記述して、</font><font style="vertical-align: inherit;">ページのロード時に存在するコンテンツと、後で</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX / DHTMLを</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">介して</font><strong><font style="vertical-align: inherit;">取り込ま</font></strong><font style="vertical-align: inherit;">れるコンテンツの両方に適用したいと考えています</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">どうすればこれを修正できますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 핸들러를 한 번 </font><font style="vertical-align: inherit;">작성하여 </font><font style="vertical-align: inherit;">페이지로드시 존재하는 컨텐츠와 나중에 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX / DHTML을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 통해 가져온 컨텐츠에 적용하고 </font><font style="vertical-align: inherit;">싶습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">어떻게 해결할 수 있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">По сути, я хотел бы написать </font><font style="vertical-align: inherit;">обработчик </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> один раз, и он будет применяться как к контенту, присутствующему при загрузке страницы, так и к контенту, добавляемому позже через </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX / DHTML</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Любая идея, как я могу это исправить?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上，我想编写</font><font style="vertical-align: inherit;">一次</font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理函数，并将其应用于页面加载时出现的内容以及以后通过</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AJAX / DHTML</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引入的内容</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">知道我该如何解决吗？</font></font>

source: Because it is a function, whenever I set up my listener this way, I typically call it on document ready:
es: Como es una función,cada vez que configuro mi oyente de esta manera,normalmente lo llamo "document ready":
ja: これは関数なので、このようにリスナーを設定するときは、通常はドキュメントの準備ができたときにこれを呼び出します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수이기 때문에 리스너를 이런 식으로 설정할 때마다 일반적으로 문서 준비에서 호출합니다.</font></font>
ru: Поскольку это функция,всякий раз,когда я настраиваю своего слушателя таким образом,я обычно вызываю его по готовности документа:
zh_cn: 因为它是一个函数,所以每当我这样设置我的监听器时,我通常会在文档准备好时调用它。

source: Been using it for a while. Works like a charm.
es: Lo he estado usando por un tiempo.Funciona como un encanto.
ja: しばらくの間、それを使用しています。魅力のように動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">한동안 사용했습니다. </font><font style="vertical-align: inherit;">매력처럼 작동합니다.</font></font>
ru: Давно этим пользуюсь.Работает как очарование.
zh_cn: 已经用了一段时间了。效果很好。

source: Binds a handler to an event (like click) for all current - and future - matched element. Can also bind custom events.
es: Vincula un manejador a un evento (como un clic)para todos los elementos actuales-y futuros-coincidentes.También puede vincular eventos personalizados.
ja: 現在および将来のマッチしたすべての要素のイベント(クリックなど)にハンドラをバインドします。カスタムイベントをバインドすることもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 및 미래에 일치하는 모든 요소에 대해 처리기를 클릭과 같은 이벤트에 바인딩합니다. </font><font style="vertical-align: inherit;">사용자 정의 이벤트를 바인딩 할 수도 있습니다.</font></font>
ru: Привязывает обработчика к событию (как клик)для всех текущих-и будущих-совпадающих элементов.Может также связывать пользовательские события.
zh_cn: 为所有当前和未来匹配的元素绑定一个事件处理程序(如点击)。也可以绑定自定义事件。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For jQuery 1.7+ you can attach an event handler to a parent element using .on(), and pass the a selector combined with 'myclass' as an argument.
es: Para jQuery 1.7+puedes adjuntar un manejador de eventos a un elemento padre usando .on(),y pasar el selector a combinado con 'myclass' como argumento.
ja: jQuery 1.7+では、.on()を使って親要素にイベントハンドラをアタッチし、引数に'myclass'を組み合わせたセレクタを渡すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.7+의 경우 .on ()을 사용하여 이벤트 핸들러를 상위 요소에 첨부하고 'myclass'와 결합 된 선택기를 인수로 전달할 수 있습니다.</font></font>
ru: Для jQuery 1.7+вы можете прикрепить обработчик события к родительскому элементу,используя .on(),и передать селектор в сочетании с 'myclass' в качестве аргумента.
zh_cn: 对于jQuery 1.7+,你可以使用.on()附加一个事件处理程序到父元素,并传递一个选择器与'myclass'作为参数。

source: From <a href="http://api.jquery.com/live/">http://api.jquery.com/live/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde </font></font><a href="http://api.jquery.com/live/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/live/</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://api.jquery.com/live/"><font style="vertical-align: inherit;">http://api.jquery.com/live/</font></a><font style="vertical-align: inherit;">から</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://api.jquery.com/live/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/live/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С </font></font><a href="http://api.jquery.com/live/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/live/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><a href="http://api.jquery.com/live/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/live/</font></font></a>

source: From the docs:
es: De los médicos:
ja: ドキュメントから
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문서에서 :</font></font>
ru: От докторов:
zh_cn: 从文件中。

source: Here's a simple example:
es: Aquí hay un ejemplo simple:
ja: 簡単な例を挙げてみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 간단한 예입니다.</font></font>
ru: Вот простой пример:
zh_cn: 这里有一个简单的例子。

source: Hopefully this helps!
es: ¡Esperemos que esto ayude!
ja: 願わくば、これが役に立つことを願っています
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잘만되면 이것이 도움이된다!</font></font>
ru: Надеюсь,это поможет!
zh_cn: 希望这对你有帮助!

source: How do I attach events to dynamic HTML elements with jQuery
es: ¿Cómo puedo adjuntar eventos a elementos HTML dinámicos con jQuery
ja: jQueryで動的なHTML要素にイベントをアタッチする方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery를 사용하여 동적 HTML 요소에 이벤트를 첨부하는 방법</font></font>
ru: Как прикреплять события к динамическим элементам HTML с помощью jQuery
zh_cn: 如何用jQuery将事件附加到动态HTML元素上?

source: I am adding a new answer to reflect changes in later jQuery releases. The .live() method is deprecated as of jQuery 1.7.
es: Estoy agregando una nueva respuesta para reflejar los cambios en los posteriores lanzamientos de jQuery.El método .live()está obsoleto desde jQuery 1.7.
ja: 後の jQuery リリースでの変更を反映させるために、新しい回答を追加します。.live()メソッドは jQuery 1.7 で非推奨となりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이후 jQuery 릴리스의 변경 사항을 반영하기 위해 새로운 답변을 추가하고 있습니다. </font><font style="vertical-align: inherit;">.live () 메소드는 jQuery 1.7부터 사용되지 않습니다.</font></font>
ru: Я добавляю новый ответ,чтобы отразить изменения в последующих релизах jQuery.Метод .live()устарел с версии jQuery 1.7.
zh_cn: 我添加了一个新的答案,以反映出jQuery以后的版本的变化。从jQuery 1.7版本开始,.live()方法已经过时了。

source: If you're adding a pile of anchors to the DOM, look into event delegation instead.
es: Si estás añadiendo un montón de anclas al DOM,busca en la delegación del evento en su lugar.
ja: アンカーの山を DOM に追加するのであれば、代わりにイベントデリゲーションを調べてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOM에 앵커 더미를 추가하는 경우 대신 이벤트 위임을 살펴보십시오.</font></font>
ru: Если вы добавляете к DOM кучу якорей,обратите внимание на делегирование событий.
zh_cn: 如果你要在DOM中添加一堆锚点,那就研究一下事件授权。

source: If your on jQuery 1.3+ then use .<a href="http://docs.jquery.com/Events/live">live()</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute;s en jQuery 1.3+, &uacute;salo. </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En Vivo()</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.3以降の場合は、を使用します。</font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">住む（）</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.3 이상이라면을 사용하십시오. </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">라이브()</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете JQuery 1.3+, используйте. </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">прямой эфир()</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您使用的是jQuery 1.3+，请使用。</font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">生活（）</font></font></a>

source: In jQuery 1.7 and later, it is recommended to use <code>.on()</code> in place of bind or any other event delegation method, but <code>.bind()</code> still works.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En jQuery 1.7 y posterior, se recomienda usar </font></font> <code>.on()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en lugar de bind o cualquier otro m&eacute;todo de delegaci&oacute;n de eventos, pero </font></font> <code>.bind()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a&uacute;n funciona.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 1.7以降では</font><font style="vertical-align: inherit;">、バインドまたはその他のイベント委任メソッドの代わりに</font></font> <code>.on()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用することをお勧めします</font><font style="vertical-align: inherit;">が、</font></font> <code>.bind()</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引き続き機能します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery를 1.7 이상에서, 그것은 사용을 권장 </font></font> <code>.on()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 바인드 또는 다른 이벤트 위임 방법 대신에,하지만 </font></font> <code>.bind()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여전히 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В jQuery 1.7 и более поздних версиях рекомендуется использовать </font></font> <code>.on()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо bind или любого другого метода делегирования события, но </font></font> <code>.bind()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> все еще работает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在jQuery 1.7和更高版本中，建议使用</font></font> <code>.on()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替bind或任何其他事件委托方法，但是</font></font> <code>.bind()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仍然有效。</font></font>
