Repository: rueisnom/feedback
Catalog: xlf/13/59/01/8/1359018.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In this case, the <code>test4</code> link is created when a user clicks on <code>a#anchor1</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En este caso, el </font><font style="vertical-align: inherit;">enlace </font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se crea cuando un usuario hace clic en </font></font> <code>a#anchor1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この場合、</font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リンクは、ユーザーが</font></font> <code>a#anchor1</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クリックし</font><font style="vertical-align: inherit;">た</font><font style="vertical-align: inherit;">ときに作成されます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 경우 </font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 링크는 사용자가 </font></font> <code>a#anchor1</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클릭하면 생성됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В этом случае </font><font style="vertical-align: inherit;">ссылка </font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> создается, когда пользователь нажимает на </font></font> <code>a#anchor1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这种情况下，</font><font style="vertical-align: inherit;">当用户单击</font> <code>a#anchor1</code> <font style="vertical-align: inherit;">时将创建</font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">链接</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Now Deprecated:
es: Ahora es desaprobado:
ja: 現在は非推奨です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 이상 사용되지 않습니다.</font></font>
ru: Теперь устарел:
zh_cn: 现在已经过时了。

source: See <a href="http://api.jquery.com/on/">http://api.jquery.com/on/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ver </font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/on/</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;">http://api.jquery.com/on/を</font></a><font style="vertical-align: inherit;">参照して</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ください</font></font>
ko: <font style="vertical-align: inherit;"><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;">http://api.jquery.com/on/을</font></a><font style="vertical-align: inherit;"> 참조하십시오.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите </font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/on/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参见</font></font><a href="http://api.jquery.com/on/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/on/</font></font></a>

source: So instead of...
es: Así que en lugar de...
ja: その代わりに...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신에 ...</font></font>
ru: Так что вместо...
zh_cn: 所以.....

source: Sometimes doing this <strong>(the top-voted answer)</strong> is not always enough:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A veces, hacer esto </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(la respuesta m&aacute;s votada)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no siempre es suficiente:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">時々これをすること</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（トップ投票された答え）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は常に十分ではありません：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때로는이 작업 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(최고의 답변)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 항상 충분하지는 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иногда сделать это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(ответ с</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> наибольшим количеством </font><strong><font style="vertical-align: inherit;">голосов)</font></strong><font style="vertical-align: inherit;"> не всегда достаточно:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有时这样做</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（投票最多的答案）</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并不总是足够的：</font></font>

source: Suppose I have some jQuery code that attaches an event handler to all elements with class <code>.myclass</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Supongamos que tengo un c&oacute;digo jQuery que adjunta un controlador de eventos a todos los elementos con la clase </font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス</font></font> <code>.myclass</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">持つすべての要素にイベントハンドラーをアタッチするjQueryコードがあるとし</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스를 가진 모든 요소에 이벤트 핸들러를 연결하는 jQuery 코드가 있다고 가정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предположим, у меня есть некоторый код jQuery, который присоединяет обработчик событий ко всем элементам класса </font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设我有一些jQuery代码，将事件处理程序附加到所有类为</font></font> <code>.myclass</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素上</font><font style="vertical-align: inherit;">。</font></font>

source: That works with no problem. However, consider if the <code>.myclass</code> elements were written to the page at some future time.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso funciona sin problema. </font><font style="vertical-align: inherit;">Sin embargo, considere si los </font><font style="vertical-align: inherit;">elementos </font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se escribieron en la p&aacute;gina en alg&uacute;n momento futuro.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題なく動作します。</font><font style="vertical-align: inherit;">ただし、</font><font style="vertical-align: inherit;">将来的に</font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素がページに書き込まれた</font><font style="vertical-align: inherit;">かどうかを検討</font><font style="vertical-align: inherit;">してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제없이 작동합니다. </font><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">나중에 </font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요소가 페이지에 작성 </font><font style="vertical-align: inherit;">되었는지 고려 </font><font style="vertical-align: inherit;">하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это работает без проблем. </font><font style="vertical-align: inherit;">Однако, подумайте, были ли </font><font style="vertical-align: inherit;">элементы </font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> записаны на странице в будущем.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没问题。</font><font style="vertical-align: inherit;">但是，请考虑是否</font></font> <code>.myclass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font><font style="vertical-align: inherit;">.myclass</font><font style="vertical-align: inherit;">元素写入页面。</font></font>

source: The <code>test4</code> link does not have the <code>click()</code> handler associated with it, even though it has <code>class="myclass"</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font><font style="vertical-align: inherit;">enlace </font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no tiene </font><font style="vertical-align: inherit;">asociado el controlador </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , aunque tenga </font></font> <code>class="myclass"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リンクはありません</font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それが持っているにもかかわらず、それに関連したハンドラ</font></font> <code>class="myclass"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 링크가없는 </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가있다하더라도, 그와 관련된 핸들러 </font></font> <code>class="myclass"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылка не имеет </font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обработчик , </font><font style="vertical-align: inherit;">связанный с ним, даже если он имеет </font></font> <code>class="myclass"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尽管</font></font> <code>test4</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">链接</font><font style="vertical-align: inherit;">具有</font> <code>class="myclass"</code> <font style="vertical-align: inherit;">，但它</font><font style="vertical-align: inherit;">没有与</font></font> <code>click()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理函数关联的内容</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: The body tag is used here as the example had no closer static surrounding tag, but any parent tag that exists when the .on method call occurs will work. For instance a ul tag for a list which will have dynamic elements added would look like this:
es: La etiqueta del cuerpo se utiliza aquí ya que el ejemplo no tenía una etiqueta estática circundante más cercana,pero cualquier etiqueta matriz que exista cuando se produce la llamada del método .on funcionará.Por ejemplo,una etiqueta ul para una lista que tenga elementos dinámicos añadidos se vería así:
ja: この例では、より近い静的な周囲タグがなかったため、ここではボディタグを使用していますが、.onメソッドの呼び出しが発生したときに存在する親タグであれば、どのようなものでも動作します。例えば、動的な要素が追加されるリストの ul タグは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">본문 태그는 예제에 더 가까운 정적 주변 태그가 없었기 때문에 사용되지만 .on 메소드 호출이 발생할 때 존재하는 모든 상위 태그는 작동합니다. </font><font style="vertical-align: inherit;">예를 들어 동적 요소가 추가되는 목록의 ul 태그는 다음과 같습니다.</font></font>
ru: Теговое тело используется здесь,так как в примере не было ближайшего статического окружающего тега,но любой родительский тег,который существует при вызове метода .on,будет работать.Например,тег ul для списка,в который будут добавляться динамические элементы,будет выглядеть следующим образом:
zh_cn: 这里使用了body标签,因为这个例子中没有更接近静态的周边标签,但任何在.on方法调用时存在的父标签都可以工作。例如,一个将添加动态元素的列表的 ul 标记看起来是这样的。

source: Then, whenever you add some dynamically added element, call that method again:
es: Entonces,cada vez que añada algún elemento añadido dinámicamente,vuelva a llamar a ese método:
ja: そして、動的に追加された要素を追加するときはいつでも、そのメソッドを再度呼び出します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 동적으로 추가 된 요소를 추가 할 때마다 해당 메소드를 다시 호출하십시오.</font></font>
ru: Затем,всякий раз,когда вы добавляете динамически добавляемый элемент,вызывайте этот метод снова:
zh_cn: 然后,每当你添加一些动态添加的元素时,再次调用该方法。

source: This can be an issue because of the order event handlers are fired. If you find yourself doing this, but it is causing issues because of the order in which it is handled.. You can always wrap that into a function, that when called "refreshes" the listener.
es: Esto puede ser un problema porque los encargados de los eventos de orden son despedidos.Si te encuentras haciendo esto,pero está causando problemas debido al orden en que se maneja...Siempre puedes envolver eso en una función,que cuando se llama "refresca" al oyente.
ja: これは、イベントハンドラの発生順序が原因で問題になることがあります。もしあなたがこれをやっていて、処理される順序のせいで問題が発生していることに気がついたら...。そのような場合は、常に関数にラップすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">order 이벤트 처리기가 시작 되었기 때문에 문제가 될 수 있습니다. </font><font style="vertical-align: inherit;">이 작업을 수행하지만 처리 된 순서로 인해 문제가 발생하는 경우에는 항상 리스너를 "새로 고침"하는 함수로 래핑 할 수 있습니다.</font></font>
ru: Это может быть проблемой из-за того,что обработчики событий заказа уволены.Если вы обнаружили,что делаете это,но это вызывает проблемы из-за порядка,в котором он обрабатывается...Вы всегда можете обернуть это в функцию,которая,когда ее называют "освежает" слушателя.
zh_cn: 这可能是一个问题,因为事件处理程序被启动的顺序。如果你发现自己这样做了,但是因为处理顺序的原因而造成了问题。你可以将其封装到一个函数中,当调用时 "刷新 "监听器。

source: This will work for all a tags with 'myclass' in the body, whether already present or dynamically added later.
es: Esto funcionará para todas las etiquetas con "myclass" en el cuerpo,ya sea que estén presentes o se añadan dinámicamente más tarde.
ja: これは、すでに存在しているか、後で動的に追加されたかに関わらず、本文に 'myclass' を持つすべてのタグに対して動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 이미 존재하거나 나중에 동적으로 추가되는지 여부에 관계없이 본문에 'myclass'가있는 모든 태그에서 작동합니다.</font></font>
ru: Это сработает для всех тегов с 'myclass' в теле,будь то уже присутствующие или динамически добавленные позже.
zh_cn: 这将适用于所有在正文中带有 "myclass "的标签,不管是已经存在的还是以后动态添加的。

source: To display each paragraph's text in an alert box whenever it is clicked:
es: Para mostrar el texto de cada párrafo en un cuadro de alerta cada vez que se hace clic en él:
ja: 各段落のテキストがクリックされるたびにアラートボックスに表示されるようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클릭 할 때마다 경고 상자에 각 단락의 텍스트를 표시하려면</font></font>
ru: Отображение текста каждого параграфа в предупреждающем окне при каждом нажатии:
zh_cn: 每当点击一个提示框中的每个段落的文字,就会显示在提示框中。

source: Use the jQuery functions <a href="http://docs.jquery.com/Events/live"><code>.live()</code></a> and <a href="http://docs.jquery.com/Events/die"><code>.die()</code></a>. Available in jQuery 1.3.x
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use las funciones jQuery </font></font><a href="http://docs.jquery.com/Events/live"> <code>.live()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="http://docs.jquery.com/Events/die"> <code>.die()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Disponible en jQuery 1.3.x</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery関数</font></font><a href="http://docs.jquery.com/Events/live"> <code>.live()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font><a href="http://docs.jquery.com/Events/die"> <code>.die()</code> を使用し</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">jQuery 1.3.xで利用可能</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기능이 jQuery를 사용 </font></font><a href="http://docs.jquery.com/Events/live"> <code>.live()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><a href="http://docs.jquery.com/Events/die"> <code>.die()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">jQuery 1.3.x에서 사용 가능</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте функции jQuery </font></font><a href="http://docs.jquery.com/Events/live"> <code>.live()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://docs.jquery.com/Events/die"> <code>.die()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Доступно в jQuery 1.3.x</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用jQuery函数</font></font><a href="http://docs.jquery.com/Events/live"> <code>.live()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="http://docs.jquery.com/Events/die"> <code>.die()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在jQuery 1.3.x中可用</font></font>

source: You can bind a single click event to a page for all elements, no matter if they are already on that page or if they will arrive at some future time, like that:
es: Puedes vincular un evento de un solo clic a una página para todos los elementos,sin importar si ya están en esa página o si llegarán en algún momento futuro,así:
ja: シングルクリックイベントをすべての要素のページにバインドすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해당 요소가 이미 해당 페이지에 있거나 다음에 도착하는지 여부에 관계없이 모든 요소에 대해 한 번의 클릭 이벤트를 페이지에 바인딩 할 수 있습니다.</font></font>
ru: Вы можете привязать событие в один клик к странице для всех элементов,независимо от того,находятся ли они уже на этой странице или прибудут в какое-то будущее время,как это:
zh_cn: 你可以将所有元素的单次点击事件绑定到一个页面上,不管这些元素是否已经在该页面上,还是在未来的某个时间到达,比如说,你可以将所有的元素都绑定到页面上。

source: You can write...
es: Puedes escribir...
ja: 書いてもいいんだよ...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 쓸 수 있습니다...</font></font>
ru: Ты можешь писать...
zh_cn: 你可以写.....

source: You want to use the <code>live()</code> function. See <a href="http://docs.jquery.com/Events/live">the docs</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desea usar la funci&oacute;n </font></font> <code>live()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ver </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">los documentos</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>live()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font><font style="vertical-align: inherit;">を使用したい</font><font style="vertical-align: inherit;">。</font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docsを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>live()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수 </font><font style="vertical-align: inherit;">를 사용하려고 </font><font style="vertical-align: inherit;">합니다. </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문서를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы хотите использовать </font><font style="vertical-align: inherit;">функцию </font></font> <code>live()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Смотрите </font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">документы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您要使用</font></font> <code>live()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数。</font><font style="vertical-align: inherit;">请参阅</font></font><a href="http://docs.jquery.com/Events/live"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
