Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: ** It won't work if you reference for urls outsite of your domain because of 'X-Frame-Options' to 'sameorigin'.
ja: **X-Frame-Optionsが'sameorigin'になっているため、ドメイン外のURLを参照している場合は動作しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">** 'X-Frame-Options'에서 'sameorigin'으로 인해 도메인 외부에서 URL을 참조하는 경우 작동하지 않습니다.</font></font>
ru: **Это не сработает,если Вы будете ссылаться на urls вне Вашего домена из-за 'X-Frame-Options' к 'sameorigin'.
zh_cn: **如果你把'X-Frame-Options'改为'sameorigin',如果你把域外的URL引用为'同源',那就不行了。

source: .. denotes a folder - denotes a file while four | denote a sub directory or file in parent folder
ja: denote a sub directory or file in parent folder
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">..는 폴더를 나타냅니다. 파일은 4 개이며 | </font><font style="vertical-align: inherit;">상위 폴더의 하위 디렉토리 또는 파일을 나타냅니다.</font></font>
ru: denote a sub directory or file in parent folder
zh_cn: denote a sub directory or file in parent folder

source: 7 Ways to do that:
ja: 7つの方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">7 가지 방법 :</font></font>
ru: 7 способов сделать это:
zh_cn: 7个方法。

source: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons">Bootstrap (v2)</a> sample appearance:
ja: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブートストラップ（v2）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サンプルの外観：</font></font>
ko: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부트 스트랩 (v2)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 샘플 모양 :</font></font>
ru: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Образец </font><font style="vertical-align: inherit;">Bootstrap (v2)</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap（v2）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例外观：</font></font>

source: <a href="http://jsfiddle.net/q4616mvr/">Here's</a> a <a href="http://jsfiddle.net/">jsFiddle</a> to check it out and play around with it.
ja: <a href="http://jsfiddle.net/q4616mvr/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここだ</font></font></a><font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddleは</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それをチェックアウトし、それで遊んします。</font></font>
ko: <a href="http://jsfiddle.net/q4616mvr/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기 </font></font></a><font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 확인해 그것으로 놀러.</font></font>
ru: <a href="http://jsfiddle.net/q4616mvr/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><a href="http://jsfiddle.net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , чтобы проверить его и играть с ним.</font></font>
zh_cn: <a href="http://jsfiddle.net/q4616mvr/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个</font></font><a href="http://jsfiddle.net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以检查出来并</font><font style="vertical-align: inherit;">尝试</font><font style="vertical-align: inherit;">使用它。</font></font>

source: <a href="https://getbootstrap.com/docs/3.3/css/#buttons">Bootstrap (v3)</a> sample appearance:
ja: <a href="https://getbootstrap.com/docs/3.3/css/#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブートストラップ（v3）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サンプルの外観：</font></font>
ko: <a href="https://getbootstrap.com/docs/3.3/css/#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부트 스트랩 (v3)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 샘플 모양 :</font></font>
ru: <a href="https://getbootstrap.com/docs/3.3/css/#buttons"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Образец </font><font style="vertical-align: inherit;">Bootstrap (v3)</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <a href="https://getbootstrap.com/docs/3.3/css/#buttons"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap（v3）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例外观：</font></font>

source: <a href="https://getbootstrap.com/docs/4.0/components/buttons/">Bootstrap (v4)</a> sample appearance:
ja: <a href="https://getbootstrap.com/docs/4.0/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブートストラップ（v4）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サンプルの外観：</font></font>
ko: <a href="https://getbootstrap.com/docs/4.0/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부트 스트랩 (v4)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 샘플 모양 :</font></font>
ru: <a href="https://getbootstrap.com/docs/4.0/components/buttons/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Образец </font><font style="vertical-align: inherit;">Bootstrap (v4)</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <a href="https://getbootstrap.com/docs/4.0/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap（v4）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例外观：</font></font>

source: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button">Styling a link like a button</a> is relatively easy and can provide similar experience across different browsers. <a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29">Bootstrap</a> does this, but it is also easy to achieve on your own using simple styles.
ja: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ボタンのようにリンクにスタイルを設定する</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことは比較的簡単で、さまざまなブラウザーで同様のエクスペリエンスを提供できます。</font></font><a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブートストラップ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はこれを行いますが、シンプルなスタイルを使用して自分で簡単に達成することもできます。</font></font>
ko: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼과 같은 링크의 스타일</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 비교적 쉽고 다른 브라우저에서도 비슷한 경험을 제공 할 수 있습니다. </font></font><a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부트 스트랩</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은이 작업을 수행하지만 간단한 스타일을 사용하여 쉽게 달성 할 수도 있습니다.</font></font>
ru: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стилизовать ссылку, например, кнопку</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , относительно легко, и она может обеспечить одинаковые возможности в разных браузерах. </font></font><a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает это, но этого также легко достичь самостоятельно, используя простые стили.</font></font>
zh_cn: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">像按钮一样设计链接的样式</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相对容易，并且可以在不同的浏览器中提供类似的体验。</font></font><a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap可以</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做到这一点，但是使用简单的样式也可以很容易地自己实现。</font></font>

source: <code>&lt;button&gt;</code> type must be "submit" (or unspecified), I couldn't get it working with type "button." Which brings up point below.
ja: <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプは「送信」（または指定されていない）である必要があります。「ボタン」タイプでは機能しません。</font><font style="vertical-align: inherit;">これは以下のポイントをもたらします。</font></font>
ko: <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유형은 "제출"(또는 지정되지 않음)이어야합니다. "button"유형으로 작동하지 못했습니다. </font><font style="vertical-align: inherit;">아래에 요점이 있습니다.</font></font>
ru: <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тип </font><font style="vertical-align: inherit;">&lt;button&gt;</font><font style="vertical-align: inherit;"> должен быть &laquo;submit&raquo; (или не указан), я не могу заставить его работать с типом &laquo;button&raquo;. </font><font style="vertical-align: inherit;">Что поднимает вопрос ниже.</font></font>
zh_cn: <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型必须为&ldquo;提交&rdquo;（或未指定），我无法使用&ldquo; button&rdquo;类型。</font><font style="vertical-align: inherit;">这在下面提出了要点。</font></font>

source: <strong>BUT</strong> then recently, I encountered a problem when I used a link inside a <code>&lt;form&gt;&lt;/form&gt;</code>.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、最近、</font></font> <code>&lt;form&gt;&lt;/form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内でリンクを使用したときに問題が発生しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 최근에 </font></font> <code>&lt;form&gt;&lt;/form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 안에 링크를 사용할 때 문제가 발생했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">НО</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> тогда недавно я столкнулся с проблемой, когда использовал ссылку внутри </font></font> <code>&lt;form&gt;&lt;/form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近，当我在</font></font> <code>&lt;form&gt;&lt;/form&gt;</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用链接时遇到了一个问题</font><font style="vertical-align: inherit;">。</font></font>

source: <strong>For HTML 5 and styled button along with image background</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML 5とスタイル付きボタンと画像の背景</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미지 배경과 함께 HTML 5 및 스타일 버튼</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для HTML 5 и стилизованной кнопки вместе с фоновым изображением</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于HTML 5和样式按钮以及图片背景</font></font></strong>

source: @Nicolas,following worked for me as yours didn't have <code>type="button"</code> due to which it started behaving as submit type..since i already have one submit type.it didn't worked for me ....and now you can either add class to button or to <code>&lt;a&gt;</code> to get required layout:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Nicolas </font><font style="vertical-align: inherit;">は、</font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がなかったため、次のように機能しました。</font><font style="vertical-align: inherit;">送信タイプとして動作し始めたためです。すでに1つの送信タイプがあるため、機能しません...ボタンまたは</font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">クラスを追加</font><font style="vertical-align: inherit;">して、必要なレイアウトを取得できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Nicolas, 다음은 </font><font style="vertical-align: inherit;">제출 유형으로 동작하기 시작한 </font></font> <code>type="button"</code> 이<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 없기 때문에 </font><font style="vertical-align: inherit;">다음과 같이 작동했습니다. </font><font style="vertical-align: inherit;">이미 제출 유형이 하나 있기 때문에. </font><font style="vertical-align: inherit;">필요한 레이아웃을 얻기 </font><font style="vertical-align: inherit;">위해 버튼이나 </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">클래스를 추가 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ Николас, следующие работали для меня, так как у вас не было </font></font> <code>type="button"</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из-за чего он начал вести себя как тип отправки ... так как у меня уже есть один тип отправки. Он не работал для меня .... и сейчас Вы можете добавить класс к кнопке или к </font></font> <code>&lt;a&gt;</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить необходимый макет:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Nicolas，以下为我工作，因为您的人没有</font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因此它开始表现为提交类型。.因为我已经有一个提交类型。它对我不起作用..现在您可以将类添加到按钮或</font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以获得所需的布局：</font></font>

source: Adds extra <code>&lt;form&gt;</code> element
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">追加の</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素を</font><font style="vertical-align: inherit;">追加し</font><font style="vertical-align: inherit;">ます</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여분의 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요소를 </font><font style="vertical-align: inherit;">추가합니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Добавляет дополнительный </font><font style="vertical-align: inherit;">элемент </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加额外的</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素</font></font>

source: Allows you to cleanly separte the button styling and text styling from each other (stretch advantage? Sure, but CSS can get nasty-looking so it's nice to decompose it).
ja: ボタンのスタイリングとテキストのスタイリングをきれいに分離することができます(ストレッチの利点?確かに、でもCSSは見栄えが悪くなることがあるので、分解するのはいいですね)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼 스타일링과 텍스트 스타일링을 서로 깔끔하게 분리 할 수 ​​있습니다 (확장 장점? 물론 CSS는 불쾌하게 보일 수 있으므로 분해하는 것이 좋습니다).</font></font>
ru: Позволяет чисто отделить стилизацию кнопок и текста друг от друга (преимущество растягивания? Конечно,но CSS может быть неприятно выглядеть,поэтому его приятно разлагать).
zh_cn: 允许你将按钮样式和文本样式干净地分开(拉伸优势?当然,但是CSS可能会变得很难看,所以分解一下就好了)。)

source: Also you can use a button:
ja: また、ボタンを使用することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 버튼을 사용할 수 있습니다 :</font></font>
ru: Также можно использовать кнопку:
zh_cn: 也可以使用一个按钮。

source: And it will load the href into the same page. Want a new page? Just use <code>target="_blank"</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、同じページにhrefをロードします。</font><font style="vertical-align: inherit;">新しいページが欲しいですか？</font></font> <code>target="_blank"</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">する</font><font style="vertical-align: inherit;">だけ</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 href를 같은 페이지에로드합니다. </font><font style="vertical-align: inherit;">새 페이지를 원하십니까? </font><font style="vertical-align: inherit;">그냥 사용 </font></font> <code>target="_blank"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И он загрузит href на ту же страницу. </font><font style="vertical-align: inherit;">Хотите новую страницу? </font><font style="vertical-align: inherit;">Просто используйте </font></font> <code>target="_blank"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它将把href加载到同一页面。</font><font style="vertical-align: inherit;">想要一个新页面？</font><font style="vertical-align: inherit;">只需使用</font></font> <code>target="_blank"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: And then create your link with a <em>class</em> tag named after the CSS style you have made:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、作成し</font><font style="vertical-align: inherit;">たCSSスタイルにちなんだ名前の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ</font><font style="vertical-align: inherit;">を使用してリンクを作成します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 </font><font style="vertical-align: inherit;">CSS 스타일의 이름을 딴 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그로 </font><font style="vertical-align: inherit;">링크를 만듭니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">А затем создайте свою ссылку с </font><font style="vertical-align: inherit;">тегом </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">класса,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> названным в честь созданного вами стиля CSS:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后使用</font><font style="vertical-align: inherit;">以您制作的CSS样式命名</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标记</font><font style="vertical-align: inherit;">创建链接</font><font style="vertical-align: inherit;">：</font></font>

source: Another option is to create a link in the button:
ja: もう一つのオプションは、ボタンの中にリンクを作成することです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 옵션은 버튼에 링크를 만드는 것입니다.</font></font>
ru: Другой вариант-создать ссылку в кнопке:
zh_cn: 另一个选项是在按钮中创建一个链接。
