Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: if you are using SSL Certificate
ja: SSL証明書を使用している場合
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SSL 인증서를 사용중인 경우</font></font>
ru: если вы используете SSL-сертификат
zh_cn: 如果您使用的是SSL证书

source: |||| ..html
ja: 衆人
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">|||| </font><font style="vertical-align: inherit;">..html</font></font>
ru: ..общественность
zh_cn: ...公共

source: |||| |||| -main.html
ja: 衆人
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">|||| </font><font style="vertical-align: inherit;">|||| </font><font style="vertical-align: inherit;">-main.html</font></font>
ru: ..общественность
zh_cn: ...公共

source: |||| |||| -secondary.html
ja: 衆人
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">|||| </font><font style="vertical-align: inherit;">|||| </font><font style="vertical-align: inherit;">-secondary.html</font></font>
ru: ..общественность
zh_cn: ...公共
