Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Use the <code>&lt;form method="get"&gt;</code> method that the OP is starting with. This works really well, but it sometimes appends a <code>?</code> to the URL. The <code>?</code> is the main problem.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OPを開始</font><font style="vertical-align: inherit;">する</font></font> <code>&lt;form method="get"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">これは非常にうまく機能しますが、</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URLに。</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主な問題です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP가 시작 </font><font style="vertical-align: inherit;">하는 </font></font> <code>&lt;form method="get"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 사용하십시오. </font><font style="vertical-align: inherit;">이것은 실제로 잘 작동하지만 때로는 </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URL에. </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주요 문제입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте метод </font></font> <code>&lt;form method="get"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , с которого начинается OP. </font><font style="vertical-align: inherit;">Это работает очень хорошо, но иногда добавляет </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">на URL. </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это главная проблема.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">OP所</font><font style="vertical-align: inherit;">使用的</font></font> <code>&lt;form method="get"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">这确实很好，但有时会附加一个</font></font> <code>?</code> 。<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URL。</font><font style="vertical-align: inherit;">的</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是主要问题。</font></font>

source: Using <code>window.location = 'URL'</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location = 'URL'</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>window.location = 'URL'</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>window.location = 'URL'</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location = 'URL'</code>

source: Using <code>window.location.assign('URL')</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.assign('URL')</code> を
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>window.location.assign('URL')</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>window.location.assign('URL')</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.assign('URL')</code>

source: Using <code>window.location.href = 'URL'</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.href = 'URL'</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>window.location.href = 'URL'</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>window.location.href = 'URL'</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.href = 'URL'</code>

source: Using <code>window.location.replace('URL')</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.replace('URL')</code> を
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>window.location.replace('URL')</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>window.location.replace('URL')</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.location.replace('URL')</code>

source: Using <code>window.open('URL')</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.open('URL')</code> を
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>window.open('URL')</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>window.open('URL')</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>window.open('URL')</code>

source: Using HTML <strong>anchor</strong> tag
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アンカー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグの</font><font style="vertical-align: inherit;">使用</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">앵커</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그 사용</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font><font style="vertical-align: inherit;">тега </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">привязки</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> HTML</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用HTML </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">锚</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标记</font></font>

source: Using HTML <strong>form</strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML </font><strong><font style="vertical-align: inherit;">フォームの</font></strong><font style="vertical-align: inherit;">使用</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML </font><strong><font style="vertical-align: inherit;">양식</font></strong><font style="vertical-align: inherit;"> 사용</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font><strong><font style="vertical-align: inherit;">формы</font></strong><font style="vertical-align: inherit;"> HTML</font></font><strong><font style="vertical-align: inherit;"></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用HTML </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表单</font></font></strong>

source: Using JavaScript:
ja: JavaScriptを使用しています。
ko: 자바 스크립트 사용 :
ru: Используя JavaScript:
zh_cn: 使用JavaScript。

source: When linking another local file just put it in the same folder and add the file name as the reference. Or specify the location of the file if in is not in the same folder.
ja: 別のローカルファイルをリンクする場合は、同じフォルダに入れてファイル名を参照先として追加してください。また、同じフォルダにない場合は、ファイルの場所を指定してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 로컬 파일을 링크 할 때 파일을 동일한 폴더에 넣고 파일 이름을 참조로 추가하십시오. </font><font style="vertical-align: inherit;">또는 동일한 폴더에 파일이없는 경우 파일 위치를 지정하십시오.</font></font>
ru: При связывании другого локального файла просто поместите его в ту же папку и добавьте имя файла в качестве ссылки.Или укажите расположение файла,если он находится не в той же папке.
zh_cn: 当链接另一个本地文件时,只需将其放在同一个文件夹中,并添加文件名作为引用。如果文件不在同一个文件夹中,也可以指定文件的位置。

source: Why not just place your button inside of a reference tag e.g
ja: ボタンを参照タグの中に配置してみてはいかがでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼을 참조 태그 안에 넣으면 안됩니다. 예 :</font></font>
ru: Почему бы просто не поместить вашу кнопку внутри контрольной метки,например
zh_cn: 为什么不直接把你的按钮放在参考标签里面,比如说

source: Working JSFiddle <a href="http://jsfiddle.net/sfwqsgLm/">here</a>.
ja: <font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/sfwqsgLm/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JSFiddleを動作させ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSFiddle을 </font></font><a href="http://jsfiddle.net/sfwqsgLm/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에서 사용하십시오</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Работаю JSFiddle </font></font><a href="http://jsfiddle.net/sfwqsgLm/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><a href="http://jsfiddle.net/sfwqsgLm/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">工作的JSFiddle </font><font style="vertical-align: inherit;">。</font></font>

source: You can set any value from here.
ja: ここから任意の値を設定することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에서 값을 설정할 수 있습니다.</font></font>
ru: Отсюда можно установить любое значение.
zh_cn: 你可以从这里设置任何值。

source: You can simply put an a tag around the element:
ja: 要素の周りにaタグを付けるだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단순히 요소 주위에 태그를 넣을 수 있습니다.</font></font>
ru: Вы можете просто поместить метку вокруг элемента:
zh_cn: 你可以简单地在元素周围加上一个标签。

source: You can use JavaScript to trigger onclick and other events to mimic the behavior of a link using a button. The example below could be improve and remove from the HTML, but it is there simply to illustrate the idea:
ja: JavaScript を使用して onclick やその他のイベントをトリガーにして、ボタンを使用したリンクの動作を模倣することができます。以下の例は、HTMLを改善したり削除したりすることができますが、アイデアを説明するために単にそこにあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript를 사용하여 onclick 및 기타 이벤트를 트리거하여 단추를 사용하여 링크의 동작을 모방 할 수 있습니다. </font><font style="vertical-align: inherit;">아래 예제는 HTML에서 개선하고 제거 할 수 있지만 아이디어를 설명하기위한 것입니다.</font></font>
ru: Вы можете использовать JavaScript для запуска кликов и других событий,чтобы имитировать поведение ссылки с помощью кнопки.Пример ниже может быть улучшен и удален из HTML,но это просто для иллюстрации идеи:
zh_cn: 你可以使用JavaScript来触发onclick和其他事件来模仿使用按钮的链接行为。下面的例子可以从HTML中改进和删除,但它只是为了说明这个想法。

source: You can use javascript:
ja: javascriptを使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 자바 스크립트를 사용할 수 있습니다</font></font>
ru: Вы можете использовать javascript:
zh_cn: 你可以使用javascript。

source: You could also set the buttons <code>type-property</code> to "button" (it makes it not submit the form), and then nest it inside a link (makes it redirect the user).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、ボタンの</font></font> <code>type-property</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を "button"（フォームを送信しないようにする）に設定し、リンク内にネストする（ユーザーをリダイレクトさせる）こともできます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font></font> <code>type-property</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 버튼을 "button"으로 설정 한 다음 (폼을 제출하지 않도록) 링크 안에 중첩하여 사용자를 리디렉션 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете установить для </font></font> <code>type-property</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> кнопок </font><font style="vertical-align: inherit;">значение &laquo;кнопка&raquo; (оно не отправляет форму), а затем вложить его в ссылку (оно перенаправляет пользователя).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您还可以将按钮的</font></font> <code>type-property</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为&ldquo;按钮&rdquo;（使其不提交表单），然后将其嵌套在链接中（使其重定向用户）。</font></font>

source: You could just make the &lt;a&gt; display:block, move it around, and style it as a button, but then vertically aligning text inside of it becomes hard.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;a&gt;のdisplay：blockを作成して移動し、ボタンとしてスタイル設定することもできますが、その中のテキストを垂直方向に整列させるのは難しくなります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;a&gt; display : block을 만들고, 움직여서 버튼처럼 스타일을 지정할 수 있지만, 그 안에 텍스트를 세로로 맞추는 것은 어려워집니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете просто сделать &lt;a&gt; display: block, переместить его и стилизовать как кнопку, но тогда вертикальное выравнивание текста внутри него становится трудным.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以只使&lt;a&gt; display：block，移动它，并将其样式设置为按钮，但是垂直对齐其中的文本变得很困难。</font></font>

source: You could of course wrap this in a form tag but it is not necessary.
ja: もちろんフォームタグで包むこともできますが、その必要はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 이것을 폼 태그로 감쌀 수는 있지만 반드시 그럴 필요는 없습니다.</font></font>
ru: Вы,конечно,можете завернуть это в метку формы,но это не обязательно.
zh_cn: 当然,你可以用表单标签来包装,但没有必要。

source: You don't have to deal with forms if you're just trying to move to another page. Forms are meant for inputting information, and they should be reserved for that.
ja: 別のページに移動しようとしているだけなら、フォームを扱う必要はありません。フォームは情報を入力するためのものであり、そのためのものであるべきです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 페이지로 이동하려는 경우 양식을 처리 할 필요가 없습니다. </font><font style="vertical-align: inherit;">양식은 정보를 입력하기위한 것이며 예약되어 있어야합니다.</font></font>
ru: Тебе не нужно иметь дело с бланками,если ты просто пытаешься перейти на другую страницу.Формы предназначены для ввода информации,и они должны быть зарезервированы для этого.
zh_cn: 如果你只是想移动到另一个页面,你就不需要处理表单。表单是用来输入信息的,表单应该保留给它。

source: You'd intuitively expect to be able to use <code>&lt;button href="https://google.com"&gt;</code> analogous with the <code>&lt;a&gt;</code> element, but unfortunately no, this attribute does not exist according to <a href="https://www.w3.org/TR/html5/forms.html#the-button-element">HTML specification</a>.
ja: <font style="vertical-align: inherit;"> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;">要素</font><font style="vertical-align: inherit;">と同様に</font></font> <code>&lt;button href="https://google.com"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用できると直感的に期待でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">が、残念ながら、この属性は</font><a href="https://www.w3.org/TR/html5/forms.html#the-button-element"><font style="vertical-align: inherit;">HTML仕様</font></a><font style="vertical-align: inherit;">に従って存在しません</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"> 요소 </font><font style="vertical-align: inherit;">와 유사한 </font></font> <code>&lt;button href="https://google.com"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 직관적으로 사용할 수 </font><font style="vertical-align: inherit;">있지만 </font><a href="https://www.w3.org/TR/html5/forms.html#the-button-element"><font style="vertical-align: inherit;">HTML 사양</font></a><font style="vertical-align: inherit;"> 에 따라이 속성이 존재하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы интуитивно ожидаете, что сможете использовать </font></font> <code>&lt;button href="https://google.com"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> аналогично </font><font style="vertical-align: inherit;">элементу </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но, к сожалению, нет, этот атрибут не существует в соответствии со </font></font><a href="https://www.w3.org/TR/html5/forms.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">спецификацией HTML</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从直觉上讲，您希望能够使用</font></font> <code>&lt;button href="https://google.com"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素</font><font style="vertical-align: inherit;">类似的</font><font style="vertical-align: inherit;">按钮</font><font style="vertical-align: inherit;">，但不幸的是，根据</font></font><a href="https://www.w3.org/TR/html5/forms.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML规范</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，该属性不存在</font><font style="vertical-align: inherit;">。</font></font>

source: Your button will be comprised of three nested pieces: a div wrapper, an anchor, and an h1, like so:
ja: ボタンは、3つの入れ子になっている部分で構成されます:div ラッパー、アンカー、h1。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼은 div 래퍼, 앵커 및 h1의 세 가지 중첩 조각으로 구성됩니다.</font></font>
ru: Ваша кнопка будет состоять из трех вложенных частей:обёртки для ныряния,якоря и h1,вроде того:
zh_cn: 你的按钮将由三个嵌套件组成:一个div包装器,一个锚,和一个h1,就像这样。

source: but the problem with this is that in <a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29">Safari</a> and <a href="http://en.wikipedia.org/wiki/Internet_Explorer">Internet&nbsp;Explorer</a>, it adds a question mark character to the end of the URL. I need to find a solution that doesn't add any characters to the end of the URL.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、これの問題は、</font></font><a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="http://en.wikipedia.org/wiki/Internet_Explorer"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、URLの末尾に疑問符文字が追加されることです。</font><font style="vertical-align: inherit;">URLの末尾に文字を追加しないソリューションを見つける必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것의 문제는 </font></font><a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><a href="http://en.wikipedia.org/wiki/Internet_Explorer"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 URL 끝에 물음표 문자를 추가한다는 것입니다. </font><font style="vertical-align: inherit;">URL 끝에 문자를 추가하지 않는 솔루션을 찾아야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">но проблема в том, что в </font></font><a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://en.wikipedia.org/wiki/Internet_Explorer"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> он добавляет знак вопроса в конце URL-адреса. </font><font style="vertical-align: inherit;">Мне нужно найти решение, которое не добавляет символы в конец URL.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但这是在</font></font><a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="http://en.wikipedia.org/wiki/Internet_Explorer"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它在URL的末尾添加了问号字符。</font><font style="vertical-align: inherit;">我需要找到一种不会在URL末尾添加任何字符的解决方案。</font></font>
