Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: If CSS is allowed, simply use an <code>&lt;a&gt;</code> which you style to look like a button using among others the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"><code>appearance</code></a> property (<a href="https://caniuse.com/#feat=css-appearance">it's only not supported in Internet&nbsp;Explorer</a>).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSSが許可されている場合は</font><font style="vertical-align: inherit;">、</font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"> <code>appearance</code> </a><font style="vertical-align: inherit;">プロパティ</font><font style="vertical-align: inherit;">などを使用してボタンのように表示</font><font style="vertical-align: inherit;">する</font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます（</font><a href="https://caniuse.com/#feat=css-appearance"><font style="vertical-align: inherit;">これはInternet Explorerでのみサポートされています</font></a><font style="vertical-align: inherit;">）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS가 허용되면 단순히 </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 스타일을 사용하여 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"> <code>appearance</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 </font><font style="vertical-align: inherit;">사용하여 버튼처럼 </font><font style="vertical-align: inherit;">보이게</font><font style="vertical-align: inherit;"> 합니다 ( </font></font><a href="https://caniuse.com/#feat=css-appearance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer에서만 지원되지 않음</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если CSS разрешено, просто использовать </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который вы стиль выглядеть как кнопка , </font><font style="vertical-align: inherit;">используя , </font><font style="vertical-align: inherit;">помимо прочего, </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"> <code>appearance</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> собственности ( </font></font><a href="https://caniuse.com/#feat=css-appearance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это только не поддерживается в Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果允许使用CSS，则只需使用</font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即可设置外观，使其看起来像一个按钮，并使用</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"> <code>appearance</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性（</font></font><a href="https://caniuse.com/#feat=css-appearance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅Internet Explorer不支持</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: If I open main.html the URL would be,
ja: main.htmlを開くとURLが出てきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">main.html을 열면 URL은</font></font>
ru: Если я открою main.html,URL будет,
zh_cn: 如果我打开main.html,URL会是,

source: If JavaScript is allowed, set the <code>window.location.href</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptが許可されている場合は、</font></font> <code>window.location.href</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設定し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript가 허용되면 </font></font> <code>window.location.href</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если JavaScript разрешен, установите </font></font> <code>window.location.href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果允许使用JavaScript，则设置</font></font> <code>window.location.href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If JavaScript is not an obstacle to your accessibility requirements, then solution #2 (<strong>JavaScript</strong>) would be preferred over #1 and #3.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptがアクセシビリティ要件の障害にならない場合は、ソリューション＃2（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）が＃1および＃3よりも優先されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript가 접근성 요구 사항에 장애가되지 않으면 솔루션 # 2 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )가 # 1 및 # 3보다 선호됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если JavaScript не является препятствием для ваших требований к доступности, то решение № 2 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) будет предпочтительнее, чем № 1 и № 3.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果JavaScript不会妨碍您的可访问性要求，则解决方案＃2（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）优于＃1和＃3。</font></font>

source: If for some reason, accessibility is vital (JavaScript is not an option) but you are in a situation where your design and/or your server configuration is preventing you from using option #1, then solution #3 (<strong>Anchor styled like a button</strong>) is a good alternative solve this problem with minimal usability impact.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">何らかの理由でアクセシビリティが不可欠である（JavaScriptはオプションではない）が、設計やサーバー構成によりオプション＃1の使用が妨げられている場合は、ソリューション＃3（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ボタンのようなスタイルのアンカー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）ユーザビリティへの影響を最小限に抑えてこの問題を解決する優れた代替策です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 이유로 액세스 가능성이 중요하지만 (자바 스크립트는 옵션이 아님) 설계 및 / 또는 서버 구성으로 인해 옵션 # 1을 사용하지 못하고 솔루션 # 3을 사용하지 못하는 경우 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼 스타일의 앵커</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) 사용성에 미치는 영향을 최소화하면서이 문제를 해결하는 좋은 대안입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если по какой-то причине доступность является жизненно важной (JavaScript не является опцией), но вы находитесь в ситуации, когда ваш дизайн и / или конфигурация вашего сервера не позволяют использовать опцию № 1, тогда решение № 3 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">привязка в стиле кнопки</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) является хорошей альтернативой для решения этой проблемы с минимальным влиянием на удобство использования.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果由于某种原因，可访问性至关重要（不是JavaScript的选择），但是您的设计和/或服务器配置使您无法使用选项＃1，则可以使用解决方案＃3（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">锚定样式为按钮</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）是解决此问题的最佳选择，对可用性的影响最小。</font></font>

source: If it's the visual appearance of a button you're looking for in a basic HTML anchor tag then you can use the <a href="http://getbootstrap.com/">Twitter Bootstrap</a> framework to format any of the following common HTML type links/buttons to appear as a button. Please note the visual differences between version 2, 3 or 4 of the framework:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的なHTMLアンカータグで探しているボタンの外観である場合は、</font></font><a href="http://getbootstrap.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Twitter Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フレームワークを</font><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">、次の一般的なHTMLタイプのリンク/ボタンをボタンとして表示するようにフォーマットできます。</font><font style="vertical-align: inherit;">フレームワークのバージョン2、3、または4の視覚的な違いに注意してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 HTML 앵커 태그에서 찾고있는 단추가 시각적으로 보이는 경우 </font></font><a href="http://getbootstrap.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Twitter Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프레임 워크를 사용하여 다음과 같은 일반적인 HTML 유형 링크 / 단추를 단추로 표시하도록 형식 </font><font style="vertical-align: inherit;">을 지정할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">프레임 워크 버전 2, 3 또는 4의 시각적 차이점에 유의하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если это визуальный вид кнопки, которую вы ищете в базовом теге привязки HTML, то вы можете использовать платформу </font></font><a href="http://getbootstrap.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Twitter Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для форматирования любой из следующих общих ссылок / кнопок типа HTML, чтобы они отображались в качестве кнопки. </font><font style="vertical-align: inherit;">Обратите внимание на визуальные различия между версией 2, 3 или 4 платформы:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果这是您在基本HTML锚标记中寻找的按钮的外观，则可以使用</font></font><a href="http://getbootstrap.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Twitter Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">框架格式化以下任何常见的HTML类型链接/按钮，使其显示为按钮。</font><font style="vertical-align: inherit;">请注意该框架的版本2、3或4之间的视觉差异：</font></font>

source: If my project structure was...
ja: もし私のプロジェクトの構造が...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 프로젝트 구조가 ...</font></font>
ru: Если бы структура моего проекта была...
zh_cn: 如果我的项目结构是.....

source: If necessary, set CSS <code>display: inline;</code> on the form to keep it in the flow with the surrounding text. Instead of <code>&lt;input type="submit"&gt;</code> in above example, you can also use <code>&lt;button type="submit"&gt;</code>. The only difference is that the <code>&lt;button&gt;</code> element allows children.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要に応じて、CSS </font></font> <code>display: inline;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で設定し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">フォーム上で、周囲のテキストとの流れを保ちます。</font><font style="vertical-align: inherit;">上記の例</font><font style="vertical-align: inherit;">の</font></font> <code>&lt;input type="submit"&gt;</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに、</font><font style="vertical-align: inherit;">&lt; </font></font> <code>&lt;button type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用することもでき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">唯一の違いは、</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素が子を許可することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필요한 경우 CSS </font></font> <code>display: inline;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정하십시오 </font><font style="vertical-align: inherit;">. inline; </font><font style="vertical-align: inherit;">주변 텍스트와의 흐름에 유지하기 위해 양식에. </font><font style="vertical-align: inherit;">위의 예에서 </font></font> <code>&lt;input type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대신 </font></font> <code>&lt;button type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용할 수도 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">유일한 차이점은 </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요소가 자식을 허용 </font><font style="vertical-align: inherit;">한다는 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При необходимости установите CSS </font></font> <code>display: inline;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">на форме, чтобы держать его в потоке с окружающим текстом. </font><font style="vertical-align: inherit;">Вместо </font></font> <code>&lt;input type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в приведенном выше примере вы также можете использовать </font></font> <code>&lt;button type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Единственное отличие состоит в том, что </font><font style="vertical-align: inherit;">элемент </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> допускает дочерние элементы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如有必要，设置CSS </font></font> <code>display: inline;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在表单上，​​以使其与周围的文本保持一致。</font><font style="vertical-align: inherit;">除了</font><font style="vertical-align: inherit;">上面的示例中</font><font style="vertical-align: inherit;">的</font></font> <code>&lt;input type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之外，您还可以使用</font></font> <code>&lt;button type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">唯一的区别是</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素允许子级。</font></font>

source: If what you need is that it will look like a button, <strong>with emphasis on the gradient image</strong>, you can do this:
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">グラデーション画像に重点を置いて</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ボタンのように見えることが必要な場合</font><font style="vertical-align: inherit;">、これを行うことができます：</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래디언트 이미지에 중점을 둔</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 버튼처럼 보이는 것이 필요한 경우 </font><font style="vertical-align: inherit;">다음을 수행 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам нужно, чтобы она выглядела как кнопка </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">с акцентом на градиентное изображение</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вы можете сделать это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您需要的是看起来像一个按钮，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重点放在渐变图像上</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则可以执行以下操作：</font></font>

source: If you are using an inside form, add the attribute <strong>type="reset"</strong> along with the button element. It will prevent the form action.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部フォームを使用している場合は</font><font style="vertical-align: inherit;">、ボタンの要素とともに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">type = "reset"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性を追加します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">フォームアクションを防止します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부 양식을 사용하는 </font><font style="vertical-align: inherit;">경우 버튼 요소와 함께 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">type = "reset"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 추가하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">양식 동작을 방지합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете внутреннюю форму, добавьте атрибут </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">type = "reset"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместе с элементом button. </font><font style="vertical-align: inherit;">Это предотвратит действие формы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您使用的是内部表单，请添加属性</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">type =&ldquo; reset&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和button元素。</font><font style="vertical-align: inherit;">它将阻止表单动作。</font></font>

source: If you want to avoid having to use a form or an input and you're looking for a button-looking link, you can create good-looking button links with a div wrapper, an anchor and an <code>h1</code> tag. You'd potentially want this so you can freely place the link-button around your page. This is especially useful for horizontally centering buttons and having vertically-centered text inside of them. Here's how:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フォームや入力を使用する必要がなく、ボタンのようなリンクを探している場合は、divラッパー、アンカー、</font></font> <code>h1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ</font><font style="vertical-align: inherit;">を使用して見栄えの良いボタンのリンクを作成できます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">リンクボタンをページの周りに自由に配置できるように、これが必要になる可能性があります。</font><font style="vertical-align: inherit;">これは、ボタンを水平方向に中央揃えし、その内部にテキストを垂直方向中央に配置する場合に特に便利です。</font><font style="vertical-align: inherit;">方法は次のとおりです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">폼이나 입력을 사용하지 않고 버튼 모양의 링크를 찾고 있다면 div 래퍼, 앵커 및 </font></font> <code>h1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그로 </font><font style="vertical-align: inherit;">잘 보이는 버튼 링크를 만들 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">페이지 주위에 자유롭게 링크 단추를 배치 할 수 있도록이 기능을 원할 수 있습니다. </font><font style="vertical-align: inherit;">이 기능은 단추를 가로로 가운데에 맞추고 세로 가운데에 텍스트를 넣을 때 특히 유용합니다. </font><font style="vertical-align: inherit;">방법은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите избежать использования формы или ввода и ищете ссылку, похожую на кнопку, вы можете создать красивые ссылки для кнопок с оболочкой div, якорем и </font><font style="vertical-align: inherit;">тегом </font></font> <code>h1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Возможно, вы захотите этого, поэтому можете свободно разместить кнопку ссылки на своей странице. </font><font style="vertical-align: inherit;">Это особенно полезно для горизонтальных центрирующих кнопок и имеющих вертикально центрированный текст внутри них. </font><font style="vertical-align: inherit;">Вот как:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要避免使用表单或输入，并且正在寻找按钮外观链接，则可以使用div包装器，锚点和</font></font> <code>h1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标签</font><font style="vertical-align: inherit;">创建外观美观的按钮链接</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您可能会希望这样做，因此可以在页面上随意放置链接按钮。</font><font style="vertical-align: inherit;">这对于水平居中居中的按钮并在其中包含垂直居中的文本特别有用。</font><font style="vertical-align: inherit;">就是这样：</font></font>

source: If you want to create a button that is used for a URL anywhere, create a button class for an anchor.
ja: どこでもURLに使うボタンを作りたい場合は、アンカー用のボタンクラスを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어디에서나 URL에 사용되는 버튼을 만들려면 앵커의 버튼 클래스를 만듭니다.</font></font>
ru: Если вы хотите создать кнопку,которая будет использоваться для URL в любом месте,создайте класс кнопки для якоря.
zh_cn: 如果你想在任何地方创建一个用于URL的按钮,就为一个锚创建一个按钮类。
