Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Reference: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</a> Browser Support: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リファレンス：</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</font><font style="vertical-align: inherit;"> ブラウザーサポート：</font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//developer.mozilla.org/en-US/docs/Web/ HTML / Element / button＃Browser_compatibility</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조 : </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브라우저 지원 : </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/ HTML / 요소 / 버튼 #Browser_compatibility</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ссылка: </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Поддержка браузера: </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/ HTML / элемент / кнопка # Browser_compatibility</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参考：</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</font><font style="vertical-align: inherit;"> 浏览器支持：</font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//developer.mozilla.org/en-US/docs/Web/ HTML /元素/按钮＃浏览器兼容性</font></font>

source: Replace <code>http://www.google.com</code> with your website, make sure to include <code>http://</code> before the URL.
ja: <font style="vertical-align: inherit;"></font> <code>http://www.google.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を自分のウェブサイトに</font><font style="vertical-align: inherit;">置き換え</font><font style="vertical-align: inherit;">、URLの前に</font><font style="vertical-align: inherit;">必ず</font></font> <code>http://</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を含めてください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교체 </font></font> <code>http://www.google.com</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 귀하의 웹 사이트에 포함해야합니다 </font></font> <code>http://</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> URL을하기 전에.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Замените </font></font> <code>http://www.google.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> своим веб-сайтом, но </font><font style="vertical-align: inherit;">перед URL-адресом </font><font style="vertical-align: inherit;">обязательно укажите </font></font> <code>http://</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font> <code>http://www.google.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">替换</font><font style="vertical-align: inherit;">为您的网站，并确保</font><font style="vertical-align: inherit;">在URL之前</font><font style="vertical-align: inherit;">包含</font></font> <code>http://</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Requires JavaScript which means less accessible. This is not ideal for a base (core) element such as a link.
ja: JavaScriptを必要とするため、アクセス性が低くなります。これはリンクのようなベース(コア)要素には適していません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">접근성이 떨어지는 JavaScript가 필요합니다. </font><font style="vertical-align: inherit;">링크와 같은 기본 (핵심) 요소에는 적합하지 않습니다.</font></font>
ru: Требуется JavaScript,что означает менее доступный.Это не идеально для базового (основного)элемента,такого как ссылка.
zh_cn: 需要JavaScript,这意味着访问量较少。这对于像链接这样的基础(核心)元素并不理想。

source: Sample code:
ja: サンプルコード。
ko: 샘플 코드 :
ru: Образец кода:
zh_cn: 样本代码:

source: Semantic is sort of broken, because you want a button that acts like a link and not a link that acts like a button.
ja: ボタンのように動作するリンクではなく、リンクのように動作するボタンが必要なので、セマンティックは壊れているようなものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시맨틱은 일종의 고장입니다. 버튼처럼 작동하는 링크가 아니라 링크처럼 작동하는 버튼을 원하기 때문입니다.</font></font>
ru: Семантика вроде как нарушена,потому что вам нужна кнопка,которая действует как ссылка,а не ссылка,которая действует как кнопка.
zh_cn: 语义是某种程度上被打破了,因为你要的是一个像链接一样的按钮,而不是像按钮一样的链接。

source: Similar configurations can vary depending on the webserver and stack used. So a summary of this approach:
ja: 同様の構成は、使用するウェブサーバやスタックによって異なります。というわけで、このアプローチのまとめです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유사한 구성은 사용 된 웹 서버 및 스택에 따라 달라질 수 있습니다. </font><font style="vertical-align: inherit;">따라서이 접근법에 대한 요약 :</font></font>
ru: Подобные конфигурации могут варьироваться в зависимости от используемого вебсервера и стека.Итак,краткое описание этого подхода:
zh_cn: 类似的配置,根据所使用的Web服务器和堆栈的不同,会有不同的配置。所以总结了一下这种方法。

source: Simple (for basic requirement) and good cross-browser support.
ja: シンプルで(基本的な要件のため)、クロスブラウザ対応が良い。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단순하고 (기본 요구 사항의 경우) 우수한 브라우저 간 지원</font></font>
ru: Простая (для основных требований)и хорошая поддержка кросс-браузера.
zh_cn: 简单(针对基本需求)和良好的跨浏览器支持。

source: Simple (for basic requirement) and keep semantic while not requiring an extra form.
ja: (基本的な要件のために)シンプルで、余計なフォームを必要とせず、セマンティックを保ちます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 (기본 요구 사항의 경우) 추가 의미없이 시맨틱을 유지합니다.</font></font>
ru: Простые (для основных требований)и сохраняют семантику,не требуя при этом дополнительной формы.
zh_cn: 简单(针对基本要求),保持语义,同时不需要额外的形式。

source: Since it is a real button, it will also act like a real button (e.g. draggable behavior and/or mimic a click when pressing space bar when active).
ja: 本物のボタンなので、本物のボタンのように動作します(ドラッグ可能な動作や、アクティブ時にスペースバーを押した時のクリックの真似など)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 버튼은 실제 버튼이므로 실제 버튼처럼 작동합니다 (예 : 활성 상태 일 때 스페이스 바를 누를 때 드래그 가능한 동작 및 / 또는 클릭을 모방).</font></font>
ru: Так как это настоящая кнопка,она также будет действовать как настоящая кнопка (например,перетаскиваемое поведение андорра или имитация щелчка при нажатии клавиши пробел,когда она активна).
zh_cn: 因为它是一个真正的按钮,所以它也会像真正的按钮一样行动(例如:可拖动的行为,或者在活动时按下空格键时模仿点击)。

source: So For redirect another page you can set <code>href</code> value with your link.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、別のページをリダイレクト</font><font style="vertical-align: inherit;">するには、リンクで</font></font> <code>href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値を</font><font style="vertical-align: inherit;">設定でき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 다른 페이지를 리디렉션하려면 </font><font style="vertical-align: inherit;">링크로 </font></font> <code>href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값을 </font><font style="vertical-align: inherit;">설정할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так что для перенаправления на другую страницу вы можете установить </font><font style="vertical-align: inherit;">значение </font></font> <code>href</code> по<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вашей ссылке.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，对于重定向另一个页面，您可以</font><font style="vertical-align: inherit;">使用链接</font><font style="vertical-align: inherit;">设置</font></font> <code>href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值。</font></font>

source: Solution #1 (<strong>Button in a form</strong>) seems like the most transparent for users with minimal work required. If your layout is not impacted by this choice and the server side tweak is feasible, this is a good option for cases where accessibility is the top priority (e.g. links on an error page or error messages).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション＃1（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フォーム内のボタン</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）は、最小限の作業でユーザーにとって最も透過的に見えます。</font><font style="vertical-align: inherit;">レイアウトがこの選択の影響を受けず、サーバー側の調整が可能である場合、これは、アクセシビリティが最優先事項である場合（たとえば、エラーページまたはエラーメッセージへのリンク）に適したオプションです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">솔루션 # 1 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">양식의 단추</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )은 최소한의 작업만으로도 사용자에게 가장 투명한 것처럼 보입니다. </font><font style="vertical-align: inherit;">레이아웃이이 선택의 영향을받지 않고 서버 측 조정이 가능한 경우, 접근성이 최우선 순위 인 경우 (예 : 오류 페이지의 링크 또는 오류 메시지)에 적합한 옵션입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение № 1 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">кнопка в форме</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) кажется наиболее прозрачным для пользователей с минимальными затратами труда. </font><font style="vertical-align: inherit;">Если этот вариант не влияет на ваш макет и возможна настройка на стороне сервера, это хороший вариант для случаев, когда доступность является главным приоритетом (например, ссылки на странице ошибок или сообщения об ошибках).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案1（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表单中的按钮</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）对于需要最少工作的用户来说似乎是最透明的。</font><font style="vertical-align: inherit;">如果您的布局不受此选择的影响，并且服务器端的调整是可行的，那么对于可访问性是头等大事（例如，错误页面上的链接或错误消息）的情况，这是一个不错的选择。</font></font>

source: Solution 1: Button in a form.
ja: 解決策1:フォーム内のボタン
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해결 방법 1 : 양식의 단추.</font></font>
ru: Решение 1:Кнопка в форме.
zh_cn: 解决方案1:表格中的按钮。

source: Solution 2: Using JavaScript.
ja: 解答2:JavaScriptを使う。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해결 방법 2 : JavaScript 사용.</font></font>
ru: Решение 2:Использование JavaScript.
zh_cn: 解决方案2:使用JavaScript。

source: Solution 3: Anchor (link) styled like a button.
ja: 解決策3:アンカー(リンク)をボタンのようにスタイリングする
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해결 방법 3 : 버튼 모양의 앵커 (링크).</font></font>
ru: Решение 3:Якорь (ссылка)в стиле кнопки.
zh_cn: 解决方案3:主播(链接)的风格像一个按钮。

source: Sometimes when you embed an &lt;a&gt; within a div, only the text is clickable, this setup makes the whole button clickable.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&lt;a&gt;をdiv内に埋め込むと、テキストのみがクリック可能になる場合があります。この設定により、ボタン全体がクリック可能になります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때로는 div 내에 &lt;a&gt;를 포함시킬 때 텍스트 만 클릭 할 수 있으며이 설정으로 전체 버튼을 클릭 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иногда, когда вы встраиваете &lt;a&gt; в элемент div, кликабелен только текст, эта настройка делает всю кнопку нажатой.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有时，当您在div中嵌入&lt;a&gt;时，只有文本是可单击的，此设置使整个按钮都可单击。</font></font>

source: That is it. It is very easy to do and lets you be as creative as you'd like. You control the colors, the size, the shapes(radius), etc. For more detailsm, see <a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3">the site I found this on</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それだ。</font><font style="vertical-align: inherit;">これはとても簡単で、好きなだけクリエイティブにできます。</font><font style="vertical-align: inherit;">あなたは色、サイズ、形（半径）などを制御します。詳細については</font></font><a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、私がこれを見つけたサイトを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그게 다야. </font><font style="vertical-align: inherit;">작업하기가 매우 쉽고 원하는만큼 창의력을 발휘할 수 있습니다. </font><font style="vertical-align: inherit;">색상, 크기, 모양 (반경) 등을 제어 할 수 있습니다. 자세한 내용은 </font></font><a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 찾은 사이트를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот и все. </font><font style="vertical-align: inherit;">Это очень легко сделать, и вы можете быть настолько креативными, насколько захотите. </font><font style="vertical-align: inherit;">Вы управляете цветами, размером, формами (радиусом) и т. Д. Для получения более подробной информации посетите </font></font><a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сайт, на котором я нашел это</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这就对了。</font><font style="vertical-align: inherit;">这很容易做到，并且可以让您发挥自己的创造力。</font><font style="vertical-align: inherit;">您可以控制颜色，大小，形状（半径）等。有关更多详细信息，请参见</font></font><a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我在上找到的网站</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The JavaScript code prevents the default action from happening and then follows the link given in the <code>&lt;form&gt;</code><code>action</code> attribute.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptコードは、デフォルトのアクションが発生するのを防ぎ、</font></font> <code>&lt;form&gt;</code> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性で</font><font style="vertical-align: inherit;">指定されたリンクをたどり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 코드는 기본 조치가 발생하지 않도록하고 </font></font> <code>&lt;form&gt;</code> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성에 </font><font style="vertical-align: inherit;">제공된 링크를 따릅니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Код JavaScript предотвращает выполнение действия по умолчанию, а затем следует по ссылке, указанной в </font><font style="vertical-align: inherit;">атрибуте </font> <code>action</code> </font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript代码可防止发生默认操作，然后使用</font></font> <code>&lt;form&gt;</code> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性中</font><font style="vertical-align: inherit;">给出的链接</font><font style="vertical-align: inherit;">。</font></font>

source: The JavaScript code uses event delegation so you can attach an event listener before the <code>&lt;form&gt;</code> or <code>&lt;button&gt;</code> even exist. I'm using jQuery in this example, because it is quick and easy, but it can be done in 'vanilla' JavaScript as well.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptコードはイベント委譲を使用するため、</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が存在する</font><font style="vertical-align: inherit;">前でもイベントリスナーをアタッチでき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この例では、jQueryを使用しています。これは迅速で簡単ですが、「バニラ」JavaScriptでも実行できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 코드는 이벤트 위임을 사용하므로 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 존재 </font><font style="vertical-align: inherit;">하기 전에 이벤트 리스너를 연결할 수 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">이 예제에서는 jQuery를 사용하는데 빠르고 쉽습니다. 그러나 'vanilla'JavaScript에서도 수행 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Код JavaScript использует делегирование событий, поэтому вы можете присоединить прослушиватель событий до того, как </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вообще существуют. </font><font style="vertical-align: inherit;">В этом примере я использую jQuery, потому что это быстро и просто, но это можно сделать и в &laquo;ванильном&raquo; JavaScript.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript代码使用事件委托，因此您可以在</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">甚至存在</font><font style="vertical-align: inherit;">之前附加一个事件侦听器</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我在此示例中使用的是jQuery，因为它既快速又容易，但是也可以在&ldquo;普通&rdquo; JavaScript中完成。</font></font>

source: The button is now regarded like/as a submit button (HTML5). I've tried working a way around, and have found this method.
ja: ボタンが送信ボタン(HTML5)のようにみなされるようになりました。工夫してみたところ、こんな方法がありました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 단추는 이제 제출 단추 (HTML5)와 같은 것으로 간주됩니다. </font><font style="vertical-align: inherit;">나는 주변에서 일을 시도했지만이 방법을 찾았습니다.</font></font>
ru: Кнопка теперь считается кнопкой отправки (HTML5).Я попробовал поработать,и нашел этот метод.
zh_cn: 现在这个按钮被认为是一个提交按钮(HTML5)。我试着想了一圈,发现这个方法。
