Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: If you want to redirect for pages which reside within your website, then then here's my method - I've added the attribute <em>href</em> to the button, and onclick assigned <em>this.getAttribute('href')</em> to document.location.href
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたのウェブサイト内にあるページにリダイレクトしたい場合は、ここに私のメソッドがあります-私は</font><font style="vertical-align: inherit;">ボタンに</font><font style="vertical-align: inherit;">属性</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">href</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">追加し、</font><font style="vertical-align: inherit;">onclickは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">this.getAttribute（ 'href'）</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をdocument.location.hrefに</font><font style="vertical-align: inherit;">割り当て</font><em><font style="vertical-align: inherit;">ました</font></em></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 웹 사이트에있는 페이지를 리디렉션하려면 여기 내 방법이 있습니다-속성 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">href</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 버튼에 추가하고 onclick을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">this.getAttribute ( 'href')</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 document.location.href에 </font><font style="vertical-align: inherit;">할당했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите перенаправить страницы, которые находятся на вашем сайте, то вот мой метод - я добавил атрибут </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">href</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к кнопке, и onclick назначил </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">this.getAttribute ('href')</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для document.location.href</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要重定向到网站中的页面，则这是我的方法-我将属性</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">href</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加</font><font style="vertical-align: inherit;">到了按钮，然后onclick将</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">this.getAttribute（'href'）</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分配</font><font style="vertical-align: inherit;">给document.location.href</font></font>

source: In HTML
ja: HTMLでは
ko: HTML에서
ru: В HTML
zh_cn: 在HTML中

source: In JavaScript
ja: JavaScriptでは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트에서</font></font>
ru: На JavaScript
zh_cn: 在JavaScript中

source: In Your Case-
ja: あなたのケースでは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 경우</font></font>
ru: В твоем случае...
zh_cn: 在您的案例中

source: Instead of <code>&lt;input type="button"&gt;</code> in above example, you can also use <code>&lt;button&gt;</code>. The only difference is that the <code>&lt;button&gt;</code> element allows children.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の例</font><font style="vertical-align: inherit;">の</font></font> <code>&lt;input type="button"&gt;</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに、</font><font style="vertical-align: inherit;">&lt; </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用することもでき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">唯一の違いは、</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素が子を許可することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 예에서 </font></font> <code>&lt;input type="button"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대신 </font></font> <code>&lt;button&gt;</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수도 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">유일한 차이점은 </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요소가 자식을 허용 </font><font style="vertical-align: inherit;">한다는 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вместо </font></font> <code>&lt;input type="button"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в приведенном выше примере вы также можете использовать </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Единственное отличие состоит в том, что </font><font style="vertical-align: inherit;">элемент </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> допускает дочерние элементы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除了</font><font style="vertical-align: inherit;">上面的示例中</font><font style="vertical-align: inherit;">的</font></font> <code>&lt;input type="button"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之外，您还可以使用</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">唯一的区别是</font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素允许子级。</font></font>

source: It definitely made my life easier styling a mobile website for variable-sized screens.
ja: そのおかげで、可変サイズの画面に対応した携帯サイトのスタイリングは、間違いなく私の生活を楽にしてくれました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가변 크기의 화면을위한 모바일 웹 사이트 스타일링이 더 쉬워졌습니다.</font></font>
ru: Это определенно облегчило мне жизнь,создав мобильный сайт для экранов различного размера.
zh_cn: 它绝对让我的生活更轻松,为不同大小的屏幕设计一个移动网站。

source: It is actualy very simple and without using any form elements. You can just use the &lt;a&gt; tag with a button inside :).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際には非常にシンプルで、フォーム要素を使用していません。</font><font style="vertical-align: inherit;">内側のボタンで&lt;a&gt;タグを使用するだけです:)。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 매우 간단하며 양식 요소를 사용하지 않습니다. </font><font style="vertical-align: inherit;">버튼 안에 &lt;a&gt; 태그를 사용할 수 있습니다 :).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это на самом деле очень просто и без использования каких-либо элементов формы. </font><font style="vertical-align: inherit;">Вы можете просто использовать тег &lt;a&gt; с кнопкой внутри :).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上，它非常简单，并且不使用任何表单元素。</font><font style="vertical-align: inherit;">您可以只在&lt;a&gt;标记内使用一个按钮：)。</font></font>

source: It might seem like I'm stating some really basic points but I just want to explain as best as I can. Thank you for reading and I hope this help someone at the very least. Happy programming.
ja: これは、私がいくつかの本当に基本的なポイントを述べているように見えるかもしれませんが、私はちょうど私ができる限りの最善の説明をしたいと思います。読んでいただきありがとうございます。プログラミングを楽しんでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 몇 가지 기본 사항을 언급하는 것처럼 보이지만 가능한 한 최대한 설명하고 싶습니다. </font><font style="vertical-align: inherit;">읽어 주셔서 감사합니다. 최소한 누군가에게 도움이되기를 바랍니다. </font><font style="vertical-align: inherit;">행복한 프로그래밍.</font></font>
ru: Может показаться,что я излагаю некоторые действительно основные моменты,но я просто хочу объяснить как можно лучше.Спасибо за чтение и я надеюсь,что это кому-нибудь поможет.Счастливого программирования.
zh_cn: 这可能看起来像是我在陈述一些非常基本的观点,但我只是想尽可能地解释一下。谢谢你的阅读,我希望这至少能帮助到一些人。祝大家编程愉快。

source: It will not reproduce all behaviors of solution #1. It will not support the same behavior as button. For example, links react differently when dragged. Also the "space bar" link trigger will not work without some extra JavaScript code. It will add a lot of complexity since browsers are not consistent on how they support <code>keypress</code> events on buttons.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション＃1のすべての動作を再現するわけではありません。</font><font style="vertical-align: inherit;">ボタンと同じ動作はサポートされません。</font><font style="vertical-align: inherit;">たとえば、リンクはドラッグしたときの反応が異なります。</font><font style="vertical-align: inherit;">また、「スペースバー」リンクトリガーは、追加のJavaScriptコードがないと機能しません。</font><font style="vertical-align: inherit;">ブラウザは</font><font style="vertical-align: inherit;">ボタンの</font></font> <code>keypress</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">イベントを</font><font style="vertical-align: inherit;">どのようにサポートするかについて一貫性がないため、複雑さが増し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">솔루션 # 1의 모든 동작을 재현하지는 않습니다. </font><font style="vertical-align: inherit;">버튼과 동일한 동작을 지원하지 않습니다. </font><font style="vertical-align: inherit;">예를 들어, 링크를 드래그하면 다르게 반응합니다. </font><font style="vertical-align: inherit;">또한 추가 JavaScript 코드가 없으면 "스페이스 바"링크 트리거가 작동하지 않습니다. </font><font style="vertical-align: inherit;">브라우저가 </font><font style="vertical-align: inherit;">버튼의 </font></font> <code>keypress</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이벤트를 </font><font style="vertical-align: inherit;">지원하는 방식에 일관성이 없기 때문에 많은 복잡성이 추가됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он не будет воспроизводить все варианты поведения решения № 1. </font><font style="vertical-align: inherit;">Он не будет поддерживать то же поведение, что и кнопка. </font><font style="vertical-align: inherit;">Например, ссылки перетаскиваются по-разному при перетаскивании. </font><font style="vertical-align: inherit;">Также триггер ссылки &laquo;пробел&raquo; не будет работать без дополнительного кода JavaScript. </font><font style="vertical-align: inherit;">Это добавит много сложности, так как браузеры не согласуются с тем, как они поддерживают </font><font style="vertical-align: inherit;">события </font></font> <code>keypress</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> клавиш на кнопках.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它不会重现解决方案1的所有行为。</font><font style="vertical-align: inherit;">它不支持与按钮相同的行为。</font><font style="vertical-align: inherit;">例如，链接在拖动时会有不同的反应。</font><font style="vertical-align: inherit;">同样，如果没有一些额外的JavaScript代码，&ldquo;空格键&rdquo;链接触发器将无法工作。</font><font style="vertical-align: inherit;">这将增加很多复杂性，因为浏览器在如何支持</font><font style="vertical-align: inherit;">按钮上的</font></font> <code>keypress</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">事件方面</font><font style="vertical-align: inherit;">不一致</font><font style="vertical-align: inherit;">。</font></font>

source: JS Fiddle
ja: JSフィドル
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JS 피들</font></font>
ru: JS Скрипка

source: JSBin Example (code snippet can't follow links)
ja: JSBin の例 (コードスニペットがリンクを辿れない)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSBin 예제 (코드 스 니펫이 링크를 따라갈 수 없음)</font></font>
ru: JSBin Пример (фрагмент кода не может следовать по ссылкам)
zh_cn: JSBin示例(代码代码片段无法跟随链接

source: Like this:
ja: こんな感じで。
ko: 이처럼 :
ru: Вот так:
zh_cn: 就像这样。

source: Must be surrounded by <code>&lt;form&gt;</code> tags.
ja: <font style="vertical-align: inherit;"></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ</font><font style="vertical-align: inherit;">で囲む必要があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로 묶어야합니다 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Должен быть окружен </font><font style="vertical-align: inherit;">тегами </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须用</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标记</font><font style="vertical-align: inherit;">包围</font><font style="vertical-align: inherit;">。</font></font>

source: No JavaScript, no complex style required.
ja: JavaScriptや複雑なスタイルは必要ありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript가 필요없고 복잡한 스타일이 필요하지 않습니다.</font></font>
ru: Нет JavaScript,нет необходимости в сложном стиле.
zh_cn: 不需要JavaScript,不需要复杂的样式。

source: No special characters included at the end of the URL. I hope this helps. By the way - (%20 denotes a space in a URL its encoded and inserted in the place of them.)
ja: URLの最後に特殊文字が含まれていません。これがお役に立てれば幸いです。ところで-(%20はURL内のスペースを示し、そのエンコードされた場所に挿入されます)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URL 끝에 특수 문자가 포함되어 있지 않습니다. </font><font style="vertical-align: inherit;">이게 도움이 되길 바란다. </font><font style="vertical-align: inherit;">그건 그렇고-(% 20은 URL에서 인코딩되어 공백 대신 삽입 된 공백을 나타냅니다.)</font></font>
ru: В конце URL-адреса нет специальных символов.Надеюсь,это поможет.Кстати-(%20 обозначает пробел в URL,который он закодирован и вставлен на место).
zh_cn: 在URL的末尾不包含特殊字符。我希望这对你有帮助。顺便说一下--(%20表示URL中的空格,它的编码和插入的地方是它们的位置。)

source: Note that the <code>type="button"</code> attribute is important, since <a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element">its missing value default is the Submit Button state</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことを注意</font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以来属性は、重要であり</font></font><a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、その欠損値のデフォルトは送信ボタンの状態です</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결 </font><a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element"><font style="vertical-align: inherit;">측값 기본값은 제출 단추 상태</font></a><font style="vertical-align: inherit;"> 이므로 </font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성이 중요 </font><font style="vertical-align: inherit;">합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font><font style="vertical-align: inherit;">атрибут </font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> важен, поскольку </font></font><a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">его отсутствующим значением по умолчанию является состояние кнопки "Отправить"</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，</font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性很重要，因为</font></font><a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它的缺失值默认为Submit Button state</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Note: The localhost:0000 will obviously not be 0000 you'll have your own port number there.
ja: 注:localhost:0000は明らかにあなた自身のポート番号を持っている0000ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : localhost : 0000은 분명히 0000이 아니며 자신의 포트 번호가 있습니다.</font></font>
ru: Примечание:Местный хост:0000,очевидно,не будет 0000,у вас там будет свой номер порта.
zh_cn: 注意:localhost:0000显然不会是0000,你会有自己的端口号。

source: Or create a new one here : <a href="http://button.csscook.com/">CSS Button Generator</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、ここで新しいものを作成します</font></font><a href="http://button.csscook.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。CSSボタンジェネレータ</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 여기에 새로운 것을 만드십시오 : </font></font><a href="http://button.csscook.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS Button Generator</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или создайте новый здесь: </font></font><a href="http://button.csscook.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS Button Generator</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者在这里创建一个新的：</font></font><a href="http://button.csscook.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS Button Generator</font></font></a>

source: Or pick one of those many CSS libraries like <a href="https://getbootstrap.com/docs/4.4/components/buttons/">Bootstrap</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font><a href="https://getbootstrap.com/docs/4.4/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrapの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ような多くのCSSライブラリの1つを選択し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font><a href="https://getbootstrap.com/docs/4.4/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 같은 많은 CSS 라이브러리 중 하나를 선택하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или выберите одну из тех многих библиотек CSS, как </font></font><a href="https://getbootstrap.com/docs/4.4/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者选择众多CSS库之一，例如</font></font><a href="https://getbootstrap.com/docs/4.4/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Overrides the default action in a form. In other words, if you do this inside another form it's going to cause a conflict.
ja: フォーム内のデフォルトアクションを上書きします。言い換えれば、これを別のフォームの中で行うとコンフリクトが発生します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">양식에서 기본 조치를 대체합니다. </font><font style="vertical-align: inherit;">즉, 다른 양식에서이 작업을 수행하면 충돌이 발생합니다.</font></font>
ru: Переопределяет действие по умолчанию в форме.Другими словами,если вы сделаете это внутри другой формы,это вызовет конфликт.
zh_cn: 覆盖表单中的默认操作。换句话说,如果你在另一个表单中做这个动作,就会引起冲突。

source: People who have answered using <code>&lt;a&gt;&lt;/a&gt;</code> attributes on a <code>&lt;button&gt;&lt;/button&gt;</code> was helpful.
ja: <font style="vertical-align: inherit;"> <code>&lt;button&gt;&lt;/button&gt;</code> で</font> <code>&lt;a&gt;&lt;/a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font><font style="vertical-align: inherit;">を使用して回答した人</font><font style="vertical-align: inherit;">は役に立ちました。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>&lt;button&gt;&lt;/button&gt;</code> <font style="vertical-align: inherit;"> 에서 </font></font> <code>&lt;a&gt;&lt;/a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 </font><font style="vertical-align: inherit;">사용하여 답변 한 사람들 </font><font style="vertical-align: inherit;">이 도움이되었습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пользователи, которые ответили, используя </font></font> <code>&lt;a&gt;&lt;/a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> атрибуты на </font></font> <code>&lt;button&gt;&lt;/button&gt;</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> помогли.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font> <code>&lt;button&gt;&lt;/button&gt;</code> <font style="vertical-align: inherit;">上</font><font style="vertical-align: inherit;">使用</font></font> <code>&lt;a&gt;&lt;/a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性进行</font><font style="vertical-align: inherit;">回答的人会</font><font style="vertical-align: inherit;">很有帮助。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
