Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The only way to do this (except for BalusC's ingenious form idea!) is by adding a JavaScript <code>onclick</code> event to the button, which is not good for accessibility.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを行う唯一の方法（BalusCの独創的なフォームのアイデアを除いて！）は</font><font style="vertical-align: inherit;">、ボタンに</font><font style="vertical-align: inherit;">JavaScript </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">イベントを</font><font style="vertical-align: inherit;">追加すること</font><font style="vertical-align: inherit;">です。これは、アクセシビリティには適していません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 수행 할 수있는 유일한 방법은 BalusC의 독창적 인 양식 아이디어를 제외하고 JavaScript </font><font style="vertical-align: inherit;">버튼 </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이벤트를 버튼 </font><font style="vertical-align: inherit;">에 추가하는 </font><font style="vertical-align: inherit;">것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Единственный способ сделать это (кроме гениальной идеи BalusC!) - добавить </font><font style="vertical-align: inherit;">на кнопку событие </font><font style="vertical-align: inherit;">JavaScript </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , что не очень </font><font style="vertical-align: inherit;">удобно </font><font style="vertical-align: inherit;">для доступности.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做到这一点的唯一方法（除了BalusC巧妙的表单构想！）是</font><font style="vertical-align: inherit;">在按钮上</font><font style="vertical-align: inherit;">添加JavaScript </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">事件，这对可访问性不利。</font></font>

source: The plain HTML way is to put it in a <code>&lt;form&gt;</code> wherein you specify the desired target URL in the <code>action</code> attribute.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレーンHTMLの方法は、</font></font> <code>&lt;form&gt;</code> に配置<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すること</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">この場合、</font></font> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font><font style="vertical-align: inherit;">で目的のターゲットURLを指定し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 HTML 방식은 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 배치하여 </font></font> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성 </font><font style="vertical-align: inherit;">에서 원하는 대상 URL을 지정 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Простой HTML-способ - поместить его в </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где вы указываете желаемый целевой URL-адрес в </font><font style="vertical-align: inherit;">атрибуте </font></font> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">普通的HTML方法是将其放在</font></font> <code>&lt;form&gt;</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您可以在</font></font> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性中</font><font style="vertical-align: inherit;">指定所需的目标URL </font><font style="vertical-align: inherit;">。</font></font>

source: Then use CSS to style the link and button, so that the link takes up the entire space within the button (so there's no miss-clicking by the user):
ja: その後、CSSを使用してリンクとボタンのスタイルを設定し、リンクがボタン内のスペース全体を占めるようにします(ユーザーがクリックし損ねることがないように)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 CSS를 사용하여 링크와 버튼의 스타일을 지정하여 링크가 버튼 내의 전체 공간을 차지하도록합니다.</font></font>
ru: Затем используйте CSS для стилизации ссылки и кнопки,так чтобы ссылка занимала все пространство внутри кнопки (чтобы не было ошибок при щелчке пользователем):
zh_cn: 然后用CSS来样式化链接和按钮,让链接占据了按钮内的整个空间(这样就不会被用户错过点击)。

source: There are two other solutions to do this: Using JavaScript or styling a link to look like a button.
ja: これを行うには、他に2つの解決策があります。JavaScript を使用するか、リンクをボタンのようにスタイリングするかです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 수행하는 다른 두 가지 솔루션이 있습니다. JavaScript를 사용하거나 링크 스타일을 지정하여 단추처럼 보입니다.</font></font>
ru: Для этого есть еще два решения:Использование JavaScript или стилизация ссылки,чтобы она выглядела как кнопка.
zh_cn: 还有另外两个解决方案可以做到这一点。使用JavaScript或造型化链接,看起来就像一个按钮。

source: There is one way to fix this, but it will require server-side configuration. One example using <strong>Apache Mod_rewrite</strong> would be to redirect all requests with a trailing <code>?</code> to their corresponding URL without the <code>?</code>. Here is an example using .htaccess, but there is a full thread <a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess">here</a>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを修正する方法は1つありますが、サーバー側の構成が必要になります。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Mod_rewrite</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する1つの例</font><font style="vertical-align: inherit;">は、末尾に</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">対応するURLに</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは.htaccessの使用例ですが、ここには完全なスレッドがあり</font></font><a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 해결하는 한 가지 방법이 있지만 서버 측 구성이 필요합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Mod_rewrite</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 한 가지 예 </font><font style="vertical-align: inherit;">는 모든 요청을 후행 </font></font> <code>?</code> <font style="vertical-align: inherit;"></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 없이 해당 URL로 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">다음은 .htaccess를 사용하는 예이지만 </font></font><a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 전체 스레드가 </font><font style="vertical-align: inherit;">있습니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть один способ исправить это, но это потребует настройки на стороне сервера. </font><font style="vertical-align: inherit;">Одним из примеров использования </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Mod_rewrite</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было бы перенаправить все запросы с завершающим </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">на их соответствующий URL без </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Ниже приведен пример использования .htaccess, но есть полная резьба </font></font><a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有一种解决方法，但需要服务器端配置。</font><font style="vertical-align: inherit;">使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Mod_rewrite的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个示例是使用</font><font style="vertical-align: inherit;">尾随的重定向所有请求</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到对应的网址，不带</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">下面是使用的.htaccess的例子，但有一个完整的线程</font></font><a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: There seems to be three solutions to this problem (all with pros and cons).
ja: この問題の解決策は3つあるようです(いずれも賛否両論あり)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문제에 대한 세 가지 해결책이있는 것 같습니다 (모두 장단점이 있습니다).</font></font>
ru: Кажется,что существует три решения этой проблемы (все с плюсами и минусами).
zh_cn: 对于这个问题,似乎有三种解决办法(都是有利有弊)。

source: This allows you to make the &lt;a&gt; display: inline-table and the &lt;h1&gt; display: table-cell, which allows you to use vertical-align: middle on the &lt;h1&gt; and center it vertically (which is always nice on a button). Yes, you could use padding, but if you want your button to dynamically resize, that won't be as clean.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、&lt;a&gt; display：inline-tableと&lt;h1&gt; display：table-cellを作成できます。これにより、&lt;h1&gt;でvertical-align：middleを使用して垂直方向に中央揃えにできます（これは常に便利です）ボタン）。</font><font style="vertical-align: inherit;">はい、パディングを使用できますが、ボタンの動的なサイズ変更が必要な場合は、それほどきれいではありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 통해 &lt;a&gt; 디스플레이 : 인라인 테이블 및 &lt;h1&gt; 디스플레이 : 테이블 셀을 만들 수 있습니다. &lt;h1&gt;에서 세로 정렬 : 중간을 사용하고 세로로 가운데에 배치 할 수 있습니다 (항상 좋은 위치) 단추). </font><font style="vertical-align: inherit;">예, 패딩을 사용할 수 있지만 버튼의 크기를 동적으로 조정하려면 깨끗하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это позволяет вам создавать &lt;a&gt; display: inline-table и &lt;h1&gt; display: table-cell, что позволяет вам использовать вертикальное выравнивание: среднее на &lt;h1&gt; и центрировать его вертикально (что всегда удобно при кнопка). </font><font style="vertical-align: inherit;">Да, вы можете использовать отступы, но если вы хотите, чтобы размер кнопки изменялся динамически, это будет не так уж и чисто.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这使您可以使&lt;a&gt;显示：内联表和&lt;h1&gt;显示：table-cell，这允许您在&lt;h1&gt;上使用vertical-align：中间并将其垂直居中（在一个按钮）。</font><font style="vertical-align: inherit;">是的，您可以使用填充，但是如果您希望按钮动态调整大小，那将不那么干净。</font></font>

source: This does not add any character onto the end of the URL either, however it does have the files project path as the url before ending with the name of the file. e.g
ja: これはURLの最後に文字を追加することはありませんが、ファイル名で終わる前にファイルのプロジェクトパスをURLに追加しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 URL 끝에 문자를 추가하지 않지만 파일 이름으로 끝나기 전에 파일 프로젝트 경로를 URL로 사용합니다. </font><font style="vertical-align: inherit;">예 :</font></font>
ru: Это также не добавляет никаких символов в конец URL,однако у него есть путь к файлам проекта в виде url перед окончанием с именем файла,например
zh_cn: 这也不会在URL的末尾添加任何字符,但是,它在文件名之前以文件项目路径作为URL的结尾。

source: This is a real button, and semantically it makes sense.
ja: これは本物のボタンで、意味的には意味があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 실제 버튼이며 의미 상 의미가 있습니다.</font></font>
ru: Это настоящая кнопка,и семантически она имеет смысл.
zh_cn: 这是个真正的按钮,从语义上讲,它是有意义的。

source: This seems to work perfectly for me and does not add any %20 tags to the link, just how you want it. I have used a link to google to demonstrate.
ja: これは私にとっては完璧に機能しているようで、リンクに%20タグを追加することはありません、あなたが望む方法だけです。私はデモのためにgoogleへのリンクを使用しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 나에게 완벽하게 작동하는 것으로 보이며 링크에 % 20 태그를 추가하지 않고 원하는 방식으로 추가합니다. </font><font style="vertical-align: inherit;">시연하기 위해 Google에 대한 링크를 사용했습니다.</font></font>
ru: Мне кажется,что это отлично работает и не добавляет никаких тегов %20 к ссылке,как вы хотите.Я использовал ссылку для демонстрации в Google.
zh_cn: 这样做似乎对我来说效果很好,不会给链接添加任何%20的标签,就像你想要的那样。我用了一个链接到google来演示。

source: This way the first button redirects the user, while the second submits the form.
ja: このようにして、最初のボタンはユーザーをリダイレクトし、2番目のボタンはフォームを送信します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이렇게하면 첫 번째 단추가 사용자를 리디렉션하고 두 번째 단추는 양식을 제출합니다.</font></font>
ru: Таким образом,первая кнопка перенаправляет пользователя,а вторая отправляет форму.
zh_cn: 这样一来,第一个按钮重定向用户,而第二个提交表单。

source: This way you could have another button in the same form that does submit the form, in case that's needed. I also think this is preferable in most cases over setting the form method and action to be a link (unless it's a search-form I guess...)
ja: この方法では、必要な場合に備えて、フォームを送信する別のボタンを同じフォームに設置することができます。また、ほとんどの場合、フォームのメソッドとアクションをリンクに設定するよりも、この方法が望ましいと思います (検索フォームでない限り...)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이런 식으로 필요한 경우 양식을 제출하는 동일한 양식의 다른 단추를 가질 수 있습니다. </font><font style="vertical-align: inherit;">나는 또한 이것이 대부분의 경우 양식 방법과 동작을 링크로 설정하는 것보다 바람직하다고 생각합니다 (검색 양식이 아닌 한 ...)</font></font>
ru: Таким образом,у вас может быть еще одна кнопка в той же форме,которая отправляет форму,в случае необходимости.Я также думаю,что в большинстве случаев это предпочтительнее,чем задавать метод формы и действие как ссылку (если только это не поисковая форма,я думаю...).
zh_cn: 这样,你可以在同一个表单中设置另一个按钮,以备不时之需。我也认为在大多数情况下,这比将表单的方法和操作设置为链接要好(除非是搜索表单,我想...)。

source: Trailing <code>?</code> looks ugly in some browsers. This can be fixed by a hack (in some cases) using POST instead of GET, but the clean way is to have a server-side redirect. The downside with the server side redirect is that it will cause an extra HTTP call for these links because of the 304 redirect.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">末尾に</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一部のブラウザでは見苦しく見えます。</font><font style="vertical-align: inherit;">これは、GETの代わりにPOSTを使用するハック（場合によっては）で修正できますが、クリーンな方法はサーバー側のリダイレクトを使用することです。</font><font style="vertical-align: inherit;">サーバー側リダイレクトの欠点は、304リダイレクトが原因で、これらのリンクに対して余分なHTTP呼び出しが発生することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">후행 </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 브라우저에서는보기에 좋지 않습니다. </font><font style="vertical-align: inherit;">이것은 GET 대신 POST를 사용하여 해킹 (일부 경우)으로 해결할 수 있지만 서버 측 리디렉션을 사용하는 것이 좋습니다. </font><font style="vertical-align: inherit;">서버 측 리디렉션의 단점은 304 리디렉션으로 인해 이러한 링크에 대한 추가 HTTP 호출이 발생한다는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Трейлинг </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">выглядит некрасиво в некоторых браузерах. </font><font style="vertical-align: inherit;">Это может быть исправлено хаком (в некоторых случаях) с использованием POST вместо GET, но чистый способ - перенаправление на стороне сервера. </font><font style="vertical-align: inherit;">Недостатком перенаправления на стороне сервера является то, что он вызовет дополнительный HTTP-вызов для этих ссылок из-за перенаправления 304.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尾随</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在某些浏览器中看起来很难看。</font><font style="vertical-align: inherit;">可以通过使用POST而不是GET的黑客（在某些情况下）解决此问题，但是最干净的方法是进行服务器端重定向。</font><font style="vertical-align: inherit;">服务器端重定向的缺点在于，由于304重定向，将导致这些链接的额外HTTP调用。</font></font>

source: Type <code>window.location</code> and press <code>enter</code> in your browser console. Then you can get the clear idea what <code>location</code> contains
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプ</font></font> <code>window.location</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーを押し</font></font> <code>enter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブラウザのコンソールで。</font><font style="vertical-align: inherit;">次に、</font></font> <code>location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が含まれて</font><font style="vertical-align: inherit;">いる明確なアイデアを得ることができ</font><font style="vertical-align: inherit;">ます</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유형 </font></font> <code>window.location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 Enter 키를 눌러 </font></font> <code>enter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브라우저 콘솔에서. </font><font style="vertical-align: inherit;">그런 다음 어떤 </font></font> <code>location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포함되어 </font><font style="vertical-align: inherit;">있는지 분명하게 알 수 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Введите </font></font> <code>window.location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и нажмите </font></font> <code>enter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в консоли браузера. </font><font style="vertical-align: inherit;">Тогда вы можете получить четкое представление о том, какое </font></font> <code>location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержит</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型</font></font> <code>window.location</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，按</font></font> <code>enter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您的浏览器控制台。</font><font style="vertical-align: inherit;">然后您可以清楚地知道哪个</font></font> <code>location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含</font></font>

source: Unfortunately, this markup is no longer valid in HTML5 and will neither validate nor always work as potentially expected. Use another approach.
ja: 残念ながら、このマークアップはHTML5ではもはや有効ではなく、潜在的に期待されていた通りに検証も動作もしません。別のアプローチを使用してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">불행하게도,이 마크 업은 HTML5에서 더 이상 유효하지 않으며 잠재적으로 예상대로 작동하지 않거나 항상 작동하지 않습니다. </font><font style="vertical-align: inherit;">다른 접근법을 사용하십시오.</font></font>
ru: К сожалению,эта разметка больше недействительна в HTML5 и не будет ни проверяться,ни всегда работать,как потенциально ожидалось.Используйте другой подход.
zh_cn: 遗憾的是,这种标记在HTML5中已经不再有效,既不能验证,也不一定能达到潜在的预期效果。请使用另一种方法。

source: Use jQuery/JavaScript to do the link following when JavaScript is enabled so that <code>?</code> doesn't end up appended to the URL. It will seamlessly fallback to the <code>&lt;form&gt;</code> method for the very small fraction of users who don't have JavaScript enabled.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptが有効になっているときにjQuery / JavaScriptを使用して次のリンクを実行すると、</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最終的にURLに追加されません。</font><font style="vertical-align: inherit;">JavaScriptを有効にしていないごく一部のユーザーに対して、</font><font style="vertical-align: inherit;">シームレスに</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">にフォールバックし</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript가 활성화되어있을 때 다음 링크를 수행하려면 jQuery / JavaScript를 사용하십시오 </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URL에 추가되지 않습니다. </font><font style="vertical-align: inherit;">JavaScript를 사용하지 않는 소수의 사용자를 위해 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드로 </font><font style="vertical-align: inherit;">완벽하게 대체됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте jQuery / JavaScript, чтобы сделать ссылку, следующую, когда JavaScript включен, так что </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не добавляется в URL. </font><font style="vertical-align: inherit;">Он будет легко переходить на метод </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для очень небольшой части пользователей, у которых не включен JavaScript.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">启用JavaScript后，使用jQuery / JavaScript进行以下链接，以便</font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最终不会附加到URL。</font><font style="vertical-align: inherit;">对于极少数未启用JavaScript的用户，</font><font style="vertical-align: inherit;">它将无缝地回退到</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font></font>
