Repository: rueisnom/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: As of HTML5, buttons support the <code>formaction</code> attribute. Best of all, no Javascript or trickery is needed.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML5以降、ボタンは</font></font> <code>formaction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性を</font><font style="vertical-align: inherit;">サポートして</font><font style="vertical-align: inherit;">い</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">何よりも、Javascriptやトリックは必要ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML5부터 버튼은 </font></font> <code>formaction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 </font><font style="vertical-align: inherit;">지원 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">무엇보다도 자바 스크립트 나 속임수가 필요하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с HTML5, кнопки поддерживают </font><font style="vertical-align: inherit;">атрибут </font></font> <code>formaction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Лучше всего, никакой Javascript или хитрости не требуется.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从HTML5开始，按钮支持</font></font> <code>formaction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性。</font><font style="vertical-align: inherit;">最好的是，不需要Java脚本或欺骗手段。</font></font>

source: Based on the answers posted so far, I am currently doing this:
ja: これまでに投稿された回答をもとに、私は現在このようにしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지금까지 게시 된 답변을 기반으로 현재이 작업을 수행하고 있습니다.</font></font>
ru: Основываясь на уже опубликованных ответах,я в настоящее время делаю это:
zh_cn: 根据目前发布的答案,我目前正在做这个。

source: Be careful to make sure the button doesn't trigger any action, as that will result in a conflict. Also as Arius pointed out, you should be aware that, for the above reason, this isn't strictly speaking considered valid HTML, according to the standard. It does however work as expected in Firefox and Chrome, but I haven't yet tested it for Internet&nbsp;Explorer.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">競合が発生するため、ボタンがアクションをトリガーしないように注意してください。</font><font style="vertical-align: inherit;">また、Ariusが指摘したように、標準によれば、上記の理由により、これは厳密には有効なHTMLとは見なされないことに注意してください。</font><font style="vertical-align: inherit;">ただし、FirefoxとChromeでは期待どおりに機能しますが、まだInternet Explorerでテストしていません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼이 동작을 트리거하지 않도록주의하십시오. 충돌이 발생할 수 있습니다. </font><font style="vertical-align: inherit;">또한 Arius가 지적했듯이 위의 이유로 표준에 따라 유효한 HTML로 간주되는 것은 아닙니다. </font><font style="vertical-align: inherit;">그러나 Firefox 및 Chrome에서 예상대로 작동하지만 Internet Explorer에서 아직 테스트하지 않았습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Будьте внимательны, чтобы убедиться, что кнопка не вызывает никаких действий, так как это приведет к конфликту. </font><font style="vertical-align: inherit;">Также, как указал Ариус, вы должны знать, что по вышеприведенной причине это, строго говоря, не считается действительным HTML, согласно стандарту. </font><font style="vertical-align: inherit;">Однако в Firefox и Chrome он работает, как и ожидалось, но я еще не тестировал его для Internet Explorer.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意确保按钮不会触发任何操作，因为这将导致冲突。</font><font style="vertical-align: inherit;">另外，正如Arius指出的那样，您应该意识到，由于上述原因，根据标准，严格来讲，这并不是有效的HTML。</font><font style="vertical-align: inherit;">但是，它确实可以在Firefox和Chrome中正常运行，但是我尚未针对Internet Explorer对其进行测试。</font></font>

source: Benefits of this setup: 1. Making the div wrapper display: block makes it easy to center (using margin: 0 auto) and position (while an &lt;a&gt; is inline and harder to positionand not possible to center).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このセットアップの利点：1. divラッパーを表示する：ブロックを使用すると、中央揃え（マージン：0 autoを使用）と配置（&lt;a&gt;がインラインで配置が難しく、中央揃えができない場合）が容易になります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 설정의 장점 : 1. div 래퍼 디스플레이 만들기 : 블록을 사용하면 가운데에 쉽게 (마진 : 0 자동 사용) 위치를 지정할 수 있습니다 (&lt;a&gt;는 인라인이고 위치를 맞추기가 어렵고 가운데에 배치 할 수 없음).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Преимущества этой настройки: 1. Создание отображения div-оболочки: блок облегчает центрирование (с помощью поля: 0 авто) и положение (в то время как &lt;a&gt; встроен и сложнее позиционировать, а центрирование невозможно).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此设置的好处：1.使div包装器显示：块使居中（使用margin：0自动）和位置（&lt;a&gt;是内联且更难定位并且无法居中）更容易。</font></font>

source: But the problem with this is that in some version of popular browsers such as Chrome, Safari and Internet Explorer, it adds a question mark character to the end of the URL. So in other words for the code above your URL will end up looking like this:
ja: しかし、これの問題は、Chrome、Safari、Internet Explorerのような人気のあるブラウザのいくつかのバージョンでは、URLの最後にクエスチョンマーク文字が追加されていることです。つまり、上記のコードの場合、URLはこのようになってしまいます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것의 문제는 Chrome, Safari 및 Internet Explorer와 같은 인기있는 브라우저의 일부 버전에서 URL 끝에 물음표 문자를 추가한다는 것입니다. </font><font style="vertical-align: inherit;">즉, 위의 코드에 대한 URL은 다음과 같이 나타납니다.</font></font>
ru: Но проблема в том,что в некоторых версиях популярных браузеров,таких как Chrome,Safari и Internet Explorer,в конце URL добавляется символ вопросительного знака.Другими словами,код над вашим URL будет выглядеть именно так:
zh_cn: 但问题是,在某些版本的流行浏览器,如Chrome、Safari和Internet Explorer等浏览器中,它会在URL的末尾添加一个问号字符。因此,换句话说,你的URL上面的代码最终会变成这样。

source: But this obviously requires JavaScript, and for that reason it is less accessible to screen readers. The point of a link is to go to another page. So trying to make a button act like a link is the wrong solution. My suggestion is that you should use a link and <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button">style it to look like a button</a>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、これには明らかにJavaScriptが必要です。そのため、スクリーンリーダーからのアクセスは困難です。</font><font style="vertical-align: inherit;">リンクのポイントは、別のページに移動することです。</font><font style="vertical-align: inherit;">したがって、ボタンをリンクのように振る舞うことは、間違った解決策です。</font><font style="vertical-align: inherit;">私の提案は、リンクを使用して</font></font><a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ボタンのように見えるようにスタイルを設定することです</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것은 분명히 JavaScript를 필요로하기 때문에 스크린 리더에게는 접근성이 떨어집니다. </font><font style="vertical-align: inherit;">링크의 요점은 다른 페이지로 이동하는 것입니다. </font><font style="vertical-align: inherit;">따라서 버튼을 링크처럼 작동시키는 것은 잘못된 해결책입니다. </font><font style="vertical-align: inherit;">내 제안은 링크를 사용 </font></font><a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하고 버튼처럼 보이도록 스타일을 지정해야한다는 것</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но для этого, очевидно, требуется JavaScript, и по этой причине он менее доступен для программ чтения с экрана. </font><font style="vertical-align: inherit;">Смысл ссылки - перейти на другую страницу. </font><font style="vertical-align: inherit;">Поэтому попытка заставить кнопку действовать как ссылка - неправильное решение. </font><font style="vertical-align: inherit;">Я предлагаю вам использовать ссылку и </font></font><a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стилизовать ее, чтобы она выглядела как кнопка</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但这显然需要JavaScript，因此，屏幕阅读器无法访问它。</font><font style="vertical-align: inherit;">链接的重点是转到另一个页面。</font><font style="vertical-align: inherit;">因此，试图使按钮像链接一样工作是错误的解决方案。</font><font style="vertical-align: inherit;">我的建议是，您应该使用链接并设置其</font></font><a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">样式以使其看起来像一个按钮</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Couple of years later, while my solution still works, keep in mind you can use a lot of CSS to make it look whatever you want. This was just a fast way.
ja: 数年後、私の解決策はまだ機能していますが、あなたが好きなように見せるために多くのCSSを使うことができることを覚えておいてください。これはただの手っ取り早い方法でした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 년 후 내 솔루션이 여전히 작동하는 동안 많은 CSS를 사용하여 원하는대로 보이게 할 수 있습니다. </font><font style="vertical-align: inherit;">이것은 단지 빠른 길이었습니다.</font></font>
ru: Пару лет спустя,пока мое решение еще работает,имейте в виду,что вы можете использовать много CSS,чтобы оно выглядело так,как вы хотите.Это был быстрый способ.
zh_cn: 几年后,虽然我的解决方案仍然有效,但请记住,你可以使用大量的CSS来使它看起来像你想要的任何东西。这只是一个快速的方法。

source: Create a CSS class and add it to your anchor. The code is below.
ja: CSSクラスを作成し、アンカーに追加します。コードは以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS 클래스를 만들어 앵커에 추가하십시오. </font><font style="vertical-align: inherit;">코드는 다음과 같습니다.</font></font>
ru: Создайте класс CSS и добавьте его в якорь.Код приведен ниже.
zh_cn: 创建一个CSS类,并将其添加到你的锚点中。代码如下。

source: Create a CSS style button like the one below:
ja: 下のようなCSSスタイルのボタンを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래와 같은 CSS 스타일 버튼을 만듭니다 :</font></font>
ru: Создайте кнопку стиля CSS,как показано ниже:
zh_cn: 创建一个像下面这样的CSS样式按钮。

source: Does not need JavaScript to work.
ja: JavaScriptは必要ありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동하기 위해 JavaScript가 필요하지 않습니다.</font></font>
ru: Для работы не требуется JavaScript.
zh_cn: 不需要JavaScript才能工作。

source: Does not need a <code>&lt;form&gt;</code> to work.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">動作する</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は必要ありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동하기 위해 </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font><font style="vertical-align: inherit;">필요하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Не нужно </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для работы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不需要</font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即可工作。</font></font>

source: Element positioning when using multiple forms can be tricky and becomes even worse when dealing with responsive designs. Some layout can become impossible to achieve with this solution depending on the order of the elements. This can end up impacting usability if the design is impacted by this challenge.
ja: 複数のフォームを使用している場合、要素の配置は厄介で、レスポンシブデザインを扱う場合はさらに悪化します。要素の順番によっては、このソリューションでは実現できないレイアウトになることがあります。この課題がデザインに影響を与えてしまうと、最終的にユーザビリティに影響を与えてしまう可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 양식을 사용할 때 요소 배치는 까다로울 수 있으며 반응 형 디자인을 처리 할 때 더욱 악화됩니다. </font><font style="vertical-align: inherit;">요소의 순서에 따라이 솔루션으로 일부 레이아웃을 구현하는 것이 불가능해질 수 있습니다. </font><font style="vertical-align: inherit;">이 문제로 인해 디자인이 영향을받는 경우 사용성에 영향을 줄 수 있습니다.</font></font>
ru: Позиционирование элементов при использовании нескольких форм может быть сложным и становится еще хуже при работе с отзывчивыми конструкциями.Некоторые компоновки могут стать недостижимыми при таком решении в зависимости от порядка расположения элементов.Это может в конечном итоге повлиять на удобство использования,если на дизайн влияет эта проблема.
zh_cn: 在使用多个表单时,元素定位可能会很棘手,在处理响应式设计时,元素定位会变得更加糟糕。根据元素的顺序,有些布局可能会变得无法实现,这取决于元素的顺序。如果设计受到这一挑战的影响,最终会影响到可用性。

source: Expand snippet
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: For example, in <em>ASP.NET Core syntax</em>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ASP.NET Core構文では</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のようになり</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ASP.NET Core 구문에서</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">синтаксисе ASP.NET Core</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ASP.NET Core语法中</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Furthermore the ?_ijt=xxxxxxxxxxxxxx at the end off the main.html URL, x is determined by your own connection so obviously will not be equal to mine.
ja: さらに、main.htmlのURLの最後にある ?_ijt=xxxxxxxxxxxxxxxxxxは、xはあなた自身の接続によって決定されるので、明らかに私のものとは一致しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 main.html URL 끝에서? _ijt = xxxxxxxxxxxxxx x는 자신의 연결에 의해 결정되므로 분명히 내 것과 같지 않습니다.</font></font>
ru: Кроме того,?_ijt=xxxxxxxxxxxxx в конце URL main.html,x определяется вашим собственным соединением,так что очевидно,что оно не будет равно моему.
zh_cn: 此外,在main.html URL的结尾处的"_ijt=xxxxxxxxxxxxxxxxxx",x是由你自己的连接方式决定的,所以显然不会和我的一样。

source: Going along with what a few others have added, you can go wild with just using a simple CSS class with no PHP, no <a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a> code, just simple HTML and CSS.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他のいくつかの人が追加したものに合わせて、PHPも</font></font><a href="http://en.wikipedia.org/wiki/JQuery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードもない単純なHTMLとCSSだけの単純</font><font style="vertical-align: inherit;">なCSSクラスを使用するだけで、ワイルドになり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 사람들이 추가 한 내용과 함께 PHP, </font></font><a href="http://en.wikipedia.org/wiki/JQuery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 코드, 간단한 HTML 및 CSS </font><font style="vertical-align: inherit;">가없는 간단한 CSS 클래스를 사용하여 열광 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Придерживаясь того, что добавили несколько других, вы можете сойти с ума, просто используя простой класс CSS без PHP, без </font><font style="vertical-align: inherit;">кода </font></font><a href="http://en.wikipedia.org/wiki/JQuery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , просто с простым HTML и CSS.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">再加上其他一些功能，只需使用一个简单的CSS类（没有PHP，没有</font></font><a href="http://en.wikipedia.org/wiki/JQuery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码，只有简单的HTML和CSS）</font><font style="vertical-align: inherit;">就可以疯狂</font><font style="vertical-align: inherit;">。</font></font>

source: Have you considered styling a normal link like a button? You can't achieve OS specific buttons that way, but it's still the best way IMO.
ja: 通常のリンクをボタンのようにスタイリングすることを考えたことはありますか?この方法ではOS固有のボタンを実現することはできませんが、IMOではこれが一番良い方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼과 같은 일반 링크 스타일링을 고려 했습니까? </font><font style="vertical-align: inherit;">그런 식으로 OS 특정 버튼을 얻을 수는 없지만 여전히 가장 좋은 방법입니다.</font></font>
ru: Задумывались ли вы о том,чтобы сделать обычную ссылку,например,на кнопку? Вы не можете добиться таких кнопок для конкретных операционных систем,но это все же лучший способ для IMO.
zh_cn: 你有没有考虑过把一个普通的链接像按钮一样设计成样式?你不能用这种方式实现操作系统特定的按钮,但这仍然是最好的方式。

source: Here's a fiddle:
ja: ここにバイオリンがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바이올린은 다음과 같습니다.</font></font>
ru: Вот скрипка:
zh_cn: 这里有一个小提琴。

source: How can I achieve this?
ja: どうすれば実現できるのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떻게하면 되나요?</font></font>
ru: Как я могу этого добиться?
zh_cn: 如何才能做到这一点呢?

source: How to create an HTML button that acts like a link
ja: リンクのように動作するHTMLボタンの作成方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링크처럼 작동하는 HTML 버튼을 만드는 방법</font></font>
ru: Как создать кнопку HTML,которая будет действовать как ссылка.
zh_cn: 如何创建一个像链接一样的HTML按钮?

source: However, when I clicked the button inside main.html to change to secondary.html, the URL would be,
ja: しかし、main.html内のボタンをクリックしてsecondary.htmlに変更すると、URLが表示されてしまいました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 main.html 내부의 버튼을 클릭하여 secondary.html로 변경하면 URL은</font></font>
ru: Однако,когда я нажимаю кнопку внутри main.html,чтобы перейти на вторичный.html,URL будет,
zh_cn: 但是,当我点击main.html里面的按钮,要改成secondary.html时,URL会是:。

source: I have created a <a href="http://codepen.io/lukeocom/pen/LpdKz">demo here</a>.
ja: <font style="vertical-align: inherit;"></font><a href="http://codepen.io/lukeocom/pen/LpdKz"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでデモ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を作成し</font><font style="vertical-align: inherit;">ました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://codepen.io/lukeocom/pen/LpdKz"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데모를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만들었습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я создал </font></font><a href="http://codepen.io/lukeocom/pen/LpdKz"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">демо здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我在</font></font><a href="http://codepen.io/lukeocom/pen/LpdKz"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">创建了一个</font><font style="vertical-align: inherit;">演示</font><font style="vertical-align: inherit;">。</font></font>

source: I know there have been a lot of answers submitted, but none of them seemed to really nail the problem. Here is my take at a solution:
ja: 多くの回答が提出されていることは知っていますが、どれも本当に問題を釘付けにしているようには見えませんでした。ここでは、解決策を考えてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 많은 답변이 제출되었음을 알고 있지만 실제로 문제를 해결하지는 못했습니다. </font><font style="vertical-align: inherit;">여기 해결책이 있습니다.</font></font>
ru: Я знаю,что было подано много ответов,но ни один из них,похоже,не решил проблему.Вот моя точка зрения на решение:
zh_cn: 我知道已经有很多人提交了很多答案,但似乎没有一个能真正解决这个问题。以下是我的解决方案。

source: I used this for a website I'm currently working on and it works great!. If you want some cool styling too I'll put the CSS down here.
ja: 今作っているサイトに使ってみたのですが、とてもいい感じに動いています。あなたがあまりにもいくつかのクールなスタイリングをしたい場合は、私はここにCSSを下に置くでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 현재 작업중 인 웹 사이트에 이것을 사용했으며 훌륭하게 작동합니다!. </font><font style="vertical-align: inherit;">멋진 스타일링을 원한다면 CSS를 여기에 넣으십시오.</font></font>
ru: Я использовал это для сайта,над которым сейчас работаю,и он отлично работает!..Если вы тоже хотите немного крутого стиля,я поставлю CSS здесь.
zh_cn: 我在一个网站上用过这个,效果很好。如果你也想要一些很酷的造型,我会把CSS放在这里。

source: I would also like it so there aren't any extra characters, or parameters in the URL.
ja: また、URLに余計な文字やパラメータを入れないようにしてほしいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 URL에 추가 문자 또는 매개 변수가 없도록하고 싶습니다.</font></font>
ru: Мне также хотелось бы,чтобы в URL не было лишних символов или параметров.
zh_cn: 我也希望在URL中没有任何额外的字符或参数。

source: I would like to create an HTML button that acts like a link. So, when you click the button, it redirects to a page. I would like it to be as accessible as possible.
ja: リンクのように動作するHTMLボタンを作成したいと思います。そのため、ボタンをクリックするとページにリダイレクトされます。できるだけアクセスしやすいようにしたいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링크처럼 작동하는 HTML 버튼을 만들고 싶습니다. </font><font style="vertical-align: inherit;">따라서 버튼을 클릭하면 페이지로 리디렉션됩니다. </font><font style="vertical-align: inherit;">가능한 한 액세스 할 수 있기를 바랍니다.</font></font>
ru: Я хотел бы создать кнопку HTML,которая будет действовать как ссылка.Таким образом,когда вы нажимаете на кнопку,она перенаправляется на страницу.Я хотел бы,чтобы она была как можно более доступной.
zh_cn: 我想创建一个HTML按钮,它的作用就像一个链接。所以,当你点击这个按钮,它就会重定向到一个页面。我希望它能尽可能的容易访问。
