Repository: rueisnom/feedback
Catalog: xlf/13/57/11/8/1357118.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: From my experience, there is at least one clear advantage when using event.preventDefault() over using return false. Suppose you are capturing the click event on an anchor tag, otherwise which it would be a big problem if the user were to be navigated away from the current page. If your click handler uses return false to prevent browser navigation, it opens the possibility that the interpreter will not reach the return statement and the browser will proceed to execute the anchor tag's default behavior.
es: Desde mi experiencia,hay al menos una clara ventaja cuando se usa event.preventDefault()sobre el uso de return false.Suponga que está capturando el evento de clic en una etiqueta de anclaje,de lo contrario sería un gran problema si el usuario se alejara de la página actual.Si tu manejador de clics utiliza return false para evitar la navegación del navegador,se abre la posibilidad de que el intérprete no llegue a la declaración de retorno y el navegador proceda a ejecutar el comportamiento predeterminado de la etiqueta de anclaje.
ja: 私の経験では、event.preventDefault()を使用した場合、return falseを使用するよりも少なくとも1つの明確な利点があります。アンカータグでクリックイベントをキャプチャしているとしましょう。クリックハンドラがブラウザのナビゲーションを防ぐために return false を使用している場合、インタプリタが return 文に到達せず、ブラウザがアンカータグのデフォルト動作を実行し続ける可能性が出てきます。
ko: 내 경험상 return false를 사용하는 것보다 event.preventDefault ()를 사용할 때 분명한 이점이 하나 있습니다. 앵커 태그에서 클릭 이벤트를 캡처한다고 가정하십시오. 그렇지 않으면 사용자가 현재 페이지에서 다른 위치로 이동해야하는 경우 큰 문제가됩니다. 클릭 핸들러가 return false를 사용하여 브라우저 탐색을 방지하면 인터프리터가 return 문에 도달하지 못하고 브라우저가 앵커 태그의 기본 동작을 계속 실행할 가능성이 열립니다.
ru: По моему опыту,есть по крайней мере одно очевидное преимущество при использовании event.preventDefault()по сравнению с использованием return false.Предположим,вы захватываете событие клика по якорному тегу,в противном случае это будет большой проблемой,если пользователь будет перемещаться в сторону от текущей страницы.Если обработчик кликов использует return false для предотвращения навигации браузера,то это открывает возможность того,что интерпретатор не достигнет оператора возврата и браузер перейдет к выполнению поведения якорного тега по умолчанию.
zh_cn: 从我的经验来看,使用event.protectedDefault()比使用return false至少有一个明显的优势。假设你是在一个锚点标记上捕获点击事件,否则如果用户被导航离开当前页面,那将是一个很大的问题。如果你的点击处理程序使用返回false来阻止浏览器导航,那么就有可能导致解释器无法到达返回语句,而浏览器将继续执行锚标记的默认行为。

source: Generally, your first option (<code>preventDefault()</code>) is the one to take, but you have to know what context you're in and what your goals are.
es: En general, su primera opci&oacute;n ( <code>preventDefault()</code> ) es la que debe tomar, pero debe saber en qu&eacute; contexto se encuentra y cu&aacute;les son sus objetivos.
ja: 一般に、最初のオプション（ <code>preventDefault()</code> ）を使用することをお勧めしますが、現在のコンテキストと目標は何かを知る必要があります。
ko: 일반적으로 첫 번째 옵션 ( <code>preventDefault()</code> )을 사용하는 것이 좋지만 현재 상황과 목표가 무엇인지 알아야합니다.
ru: Как правило, вам <code>preventDefault()</code> выбрать первый вариант ( protectDefault () ), но вы должны знать, в каком контексте вы находитесь, и каковы ваши цели.
zh_cn: 通常，您的第一个选项（ <code>preventDefault()</code> ）是您要采用的选项，但是您必须知道您所处的环境以及目标是什么。

source: I think
es: Creo que
ja: 思うに
ko: 나는 생각한다
ru: по-моему
zh_cn: 我想

source: I think the best way to do this is to use <code>event.preventDefault()</code> because if some exception is raised in the handler, then the return <code>false</code> statement will be skipped and the behavior will be opposite to what you want.
es: Creo que la mejor manera de hacer esto es usar <code>event.preventDefault()</code> porque si se genera alguna excepci&oacute;n en el controlador, entonces se omitir&aacute; la declaraci&oacute;n return <code>false</code> y el comportamiento ser&aacute; opuesto a lo que desea.
ja: これを行うための最良の方法は、 <code>event.preventDefault()</code> を使用することだと思います。ハンドラーで何らかの例外が発生した場合、return <code>false</code> ステートメントがスキップされ、動作が希望とは逆になります。
ko: 핸들러에서 예외가 발생하면 return <code>false</code> 문을 건너 뛰고 동작이 원하는 것과 반대이기 때문에이를 수행하는 가장 좋은 방법은 <code>event.preventDefault()</code> 를 사용하는 것입니다.
ru: Я думаю, что лучший способ сделать это - использовать <code>event.preventDefault()</code> потому что, если в обработчике возникнет какое-то исключение, оператор return <code>false</code> будет пропущен, а поведение будет противоположным желаемому.
zh_cn: 我认为最好的方法是使用 <code>event.preventDefault()</code> ,因为如果在处理程序中引发某些异常，则将跳过 <code>false</code> 语句，并且行为与您想要的相反。

source: If you still want to go with the return <code>false</code>, then you can put your entire handler code in a try catch block like below:
es: Si a&uacute;n desea ir con el retorno <code>false</code> , puede poner su c&oacute;digo de controlador completo en un bloque de captura de prueba como a continuaci&oacute;n:
ja: それでもreturn <code>false</code> を使いたい場合は、ハンドラコード全体を以下のようなtry catchブロックに配置できます。
ko: return <code>false</code> 를 계속 사용하려면 다음과 같이 전체 처리기 코드를 try catch 블록에 넣을 수 있습니다.
ru: Если вы все еще хотите использовать возвращаемое значение <code>false</code> , вы можете поместить весь код обработчика в блок try catch, как показано ниже:
zh_cn: 如果您仍然希望使用return <code>false</code> ，那么可以将整个处理程序代码放入如下所示的try catch块中：

source: Instance Ex.:-
es: Instancia Ex.:-
ja: インスタンス Ex...
ko: 사례 예 :-
ru: Экстрасенс Экс.
zh_cn: 例子 Ex.:-

source: Is there any significant difference between those two methods of stopping event propagation?
es: ¿Hay alguna diferencia significativa entre esos dos métodos para detener la propagación de eventos?
ja: この2つのイベント伝播の停止方法には大きな違いがあるのでしょうか?
ko: 이벤트 전파를 중지하는 두 가지 방법 사이에 중요한 차이점이 있습니까?
ru: Есть ли существенная разница между этими двумя методами прекращения распространения событий?
zh_cn: 这两种停止事件传播的方法是否有明显区别?

source: It simply stops the default action of an element.
es: Simplemente detiene la acción por defecto de un elemento.
ja: これは単に要素のデフォルトアクションを停止するだけです。
ko: 단순히 요소의 기본 동작을 중지합니다.
ru: Он просто останавливает действие элемента по умолчанию.
zh_cn: 它只是停止了一个元素的默认动作。

source: It simply stops the execution of the function().
es: Simplemente detiene la ejecución de la función().
ja: これは単に関数()の実行を停止するだけです。
ko: 단순히 function ()의 실행을 중지합니다.
ru: Она просто останавливает выполнение функции().
zh_cn: 它只是停止了函数()的执行。

source: My opinion from my experience saying, that it is always better to use
es: Mi opinión desde mi experiencia diciendo,que siempre es mejor usar
ja: と言っている私の経験からの私の意見では、それは常に使用する方が良いということです。
ko: 내 경험에 따르면 내 의견은 항상 사용하는 것이 좋습니다
ru: По моему опыту я считаю,что всегда лучше использовать
zh_cn: 根据我的经验,我的意见是,最好是使用 "我"。

source: Practically to stop or prevent submit event, whenever we required rather than <code>return false</code><code>event.preventDefault()</code> works fine.
es: Pr&aacute;cticamente para detener o evitar el env&iacute;o de eventos, siempre que lo <code>event.preventDefault()</code> lugar de <code>return false</code> evento falso. PreventDefault () funciona bien.
ja: 送信イベントを実際に停止または防止するには、 <code>return false</code> ではなく、必要に応じて <code>event.preventDefault()</code> を使用します。
ko: 실제로 <code>return false</code> 이벤트를 반환 하지 않고 필요할 때마다 제출 이벤트를 중지하거나 방지하기 위해 <code>event.preventDefault()</code> 가 제대로 작동합니다.
ru: Практически, чтобы остановить или предотвратить <code>event.preventDefault()</code> события, всякий раз, когда нам требуется, а не <code>return false</code> событие. PreventDefault () работает нормально.
zh_cn: 实际上，无论何时我们需要而不是 <code>return false</code> <code>event.preventDefault()</code> 都可以停止或阻止Submit事件。

source: See <a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">jQuery Events: Stop (Mis)Using Return False</a> for more information and examples.
es: Consulte <a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">jQuery Events: Stop (Mis) Using Return False</a> para obtener m&aacute;s informaci&oacute;n y ejemplos.
ja: 詳細と例については、「 <a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">jQueryイベント：停止（Mis）</a> 」を参照してください。
ko: 자세한 내용과 예제는 <a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">jQuery 이벤트 : Return False 사용 중지 (Mis)</a> 를 참조하십시오.
ru: Посмотрите <a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">События jQuery: Stop (Mis) Использование Return False</a> для получения дополнительной информации и примеров.
zh_cn: 有关更多信息和示例，请参见<a href="http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">jQuery Events：Stop（Mis）Using Return False</a> 。

source: So basically this code below:
es: Así que básicamente este código de abajo:
ja: だから基本的には以下のコードです。
ko: 기본적으로 아래 코드는 다음과 같습니다.
ru: Так что,в основном,этот код ниже:
zh_cn: 所以下面基本上是这样的代码。

source: So we can simply say, return false in <code>jQuery</code> is equal to:
es: Entonces podemos simplemente decir, return false en <code>jQuery</code> es igual a:
ja: したがって、簡単に言うと、 <code>jQuery</code> でfalseを返すと、次のようになります。
ko: 따라서 <code>jQuery</code> 에서 false를 반환하는 것은 다음과 같습니다.
ru: Таким образом, мы можем просто сказать, что false в <code>jQuery</code> равно:
zh_cn: 所以我们可以简单地说，在 <code>jQuery</code> 中返回false等于：

source: Source: <a href="http://ejohn.org/">John Resig</a>
es: Fuente: <a href="http://ejohn.org/">John Resig</a>
ja: 出典： <a href="http://ejohn.org/">John Resig</a>
ko: 출처 : <a href="http://ejohn.org/">John Resig</a>
ru: Источник: <a href="http://ejohn.org/">Джон Резиг</a>
zh_cn: 资料来源： <a href="http://ejohn.org/">John Resig</a>

source: Stops callback execution and returns immediately when called.
es: Detiene la ejecución de la llamada y regresa inmediatamente cuando se le llama.
ja: コールバックの実行を停止し、呼び出されたらすぐに戻ります。
ko: 콜백 실행을 중지하고 호출되면 즉시 반환합니다.
ru: Останавливает выполнение обратного вызова и возвращается немедленно при вызове.
zh_cn: 停止回调执行并在调用时立即返回。

source: The <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">documentation from MDN</a> explains how <code>return false</code> in an event handler works
es: La <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">documentaci&oacute;n de MDN</a> explica c&oacute;mo funciona <code>return false</code> en un controlador de eventos
ja: <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">MDN</a>のドキュメントには、イベントハンドラーで <code>return false</code> を返す方法が説明されています
ko: <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">MDN</a> 의 문서 는 이벤트 핸들러에서 <code>return false</code> 를 반환 하는 방법을 설명합니다
ru: <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">Документация от MDN</a> объясняет, как работает <code>return false</code> в обработчике событий
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Tutorial/More_Event_Handlers#Prevent_Default_Action">MDN</a>的文档说明了事件处理程序中 <code>return false</code> 的工作方式

source: The benefit to using event.preventDefault() is that you can add this as the first line in the handler, thereby guaranteeing that the anchor's default behavior will not fire, regardless if the last line of the function is not reached (eg. runtime error).
es: El beneficio de usar event.preventDefault()es que se puede añadir como primera línea en el manejador,garantizando así que el comportamiento por defecto del ancla no se disparará,independientemente de que no se alcance la última línea de la función (por ejemplo,error en tiempo de ejecución).
ja: event.preventDefault()を使用する利点は、ハンドラの最初の行としてこれを追加することで、関数の最後の行に到達していない場合(ランタイムエラーなど)であっても、アンカーのデフォルト動作が実行されないことを保証することができるということです。
ko: event.preventDefault ()를 사용하면 이점을 핸들러의 첫 번째 줄로 추가 할 수 있으므로 함수의 마지막 줄에 도달하지 않더라도 앵커의 기본 동작이 시작되지 않습니다 (예 : 런타임 오류). ).
ru: Преимущество использования функции event.preventDefault()заключается в том,что вы можете добавить ее в качестве первой строки в обработчике,гарантируя тем самым,что поведение якоря по умолчанию не начнется,независимо от того,достигнута ли последняя строка функции (например,ошибка во время выполнения).
zh_cn: 使用event.protectedDefault()的好处是,你可以在处理程序的第一行中添加这个,从而保证锚的默认行为不会被触发,不管函数的最后一行没有到达(例如运行时错误)。

source: The main difference between <code>return false</code> and <code>event.preventDefault()</code> is that your code below <code>return false</code> will not be executed and in <code>event.preventDefault()</code> case your code will execute after this statement.
es: La principal diferencia entre <code>return false</code> y <code>event.preventDefault()</code> es que su c&oacute;digo debajo de <code>return false</code> no se ejecutar&aacute; y, en caso <code>event.preventDefault()</code> , su c&oacute;digo se ejecutar&aacute; despu&eacute;s de esta declaraci&oacute;n.
ja: <code>return false</code> と <code>event.preventDefault()</code> の主な違いは、以下の <code>return false</code> のコードは実行されず、 <code>event.preventDefault()</code> の場合、このステートメントの後にコードが実行されることです。
ko: <code>return false</code> 와 <code>event.preventDefault()</code> 의 주요 차이점은 false 를 반환 하는 코드는 실행되지 않으며 <code>event.preventDefault()</code> 경우이 명령문 이후에 코드가 실행된다는 것입니다.
ru: Основное различие между <code>return false</code> и <code>event.preventDefault()</code> заключается в том, что код ниже <code>return false</code> не будет выполнен, а в случае <code>event.preventDefault()</code> ваш код будет выполнен после этого оператора.
zh_cn: <code>return false</code> 和 <code>event.preventDefault()</code> 之间的主要区别在于， 返回false下面的代码将不会执行，在 <code>event.preventDefault()</code> 情况下，您的代码将在此语句后执行。

source: The reason to use <code>e.preventDefault();</code> is that in our code so something goes wrong in the code, then it will allow to execute the link or form to get submitted or allow to execute or allow whatever action you need to do. &amp; link or submit button will get submitted &amp; still allow further propagation of the event.
es: La raz&oacute;n para usar <code>e.preventDefault();</code> es que en nuestro c&oacute;digo hay algo que falla en el c&oacute;digo, entonces permitir&aacute; ejecutar el enlace o formulario para enviarlo o permitir ejecutar o permitir cualquier acci&oacute;n que necesite hacer. El bot&oacute;n &amp; link o submit se enviar&aacute; y a&uacute;n permitir&aacute; una mayor propagaci&oacute;n del evento.
ja: <code>e.preventDefault();</code> を使用する理由 私たちのコードでは、コードに問題があるため、リンクまたはフォームを実行して送信したり、必要なアクションを実行または許可したりすることができます。 ＆リンクまたは送信ボタンをクリックすると送信され、さらにイベントの伝播が許可されます。
ko: <code>e.preventDefault();</code> 를 사용하는 이유 ; 우리 코드에서 코드에 문제가 발생하면 링크 또는 양식을 실행하여 제출하거나 실행 또는 필요한 조치를 허용한다는 것입니다. &amp; 링크 또는 제출 버튼이 제출되며 이벤트를 계속 전파 할 수 있습니다.
ru: Причина использования <code>e.preventDefault();</code> в том, что в нашем коде что-то идет не так в коде, тогда это позволит выполнить ссылку или форму для отправки или позволить выполнить или разрешить любое действие, которое вам нужно сделать. &amp; ссылка или кнопка отправки будут отправлены и все еще позволяют дальнейшее распространение события.
zh_cn: 使用 <code>e.preventDefault();</code> 的原因 是在我们的代码中，代码中出了点问题，那么它将允许执行链接或表单以提交或允许执行或执行您需要执行的任何操作。 ＆链接或提交按钮将被提交，并且仍允许事件的进一步传播。

source: The reason to use return false; is that you don't want to execute the function any more in strictly mode.
es: La razón para usar return false;es que no quieres ejecutar la función más en modo estricto.
ja: return false;を使う理由は、厳密なモードでこれ以上関数を実行したくないからです。
ko: 사용 이유는 false를 반환합니다. 엄격하게 모드에서 더 이상 함수를 실행하고 싶지 않다는 것입니다.
ru: Причина использования return false заключается в том,что вы больше не хотите выполнять функцию строго в режиме.
zh_cn: 使用返回false;的原因是你不想再严格的模式下执行函数。

source: This is not, as you've titled it, a "JavaScript" question; it is a question regarding the design of jQuery.
es: Esta no es,como la has titulado,una pregunta de "JavaScript";es una pregunta sobre el diseño de jQuery.
ja: これはタイトルにあるように「JavaScript」の質問ではなく、jQueryのデザインに関する質問です。
ko: 제목은 "JavaScript"질문이 아닙니다. jQuery 디자인에 관한 질문입니다.
ru: Это не вопрос "JavaScript",как вы его назвали,а вопрос,касающийся дизайна jQuery.
zh_cn: 这不是像你所说的那样,是一个 "JavaScript "问题,而是一个关于jQuery设计的问题。

source: What happens in jQuery is not the same as what happens with event handlers. DOM event listeners and MSIE "attached" events are a different matter altogether.
es: Lo que sucede en jQuery no es lo mismo que lo que sucede con los manejadores de eventos.Los oyentes de eventos DOM y los eventos "adjuntos" MSIE son un asunto totalmente diferente.
ja: jQuery で起こることは、イベント ハンドラで起こることと同じではありません。DOM イベント リスナーと MSIE "アタッチされた" イベントは全く別の問題です。
ko: jQuery에서 발생하는 것은 이벤트 핸들러에서 발생하는 것과 다릅니다. DOM 이벤트 리스너와 MSIE "첨부 된"이벤트는 전혀 다릅니다.
ru: То,что происходит в jQuery,не то же самое,что происходит с обработчиками событий.Слушатели DOM событий и "прикрепленные" события MSIE-это совсем другое дело.
zh_cn: jQuery中发生的事情和事件处理程序发生的事情不一样。DOM事件监听器和MSIE "附加 "事件完全是两回事。

source: When I want to prevent other event handlers from executing after a certain event is fired, I can use one of two techniques. I'll use jQuery in the examples, but this applies to plain-JS as well:
es: Cuando quiero evitar que otros manejadores de eventos se ejecuten después de que un cierto evento es disparado,puedo usar una de dos técnicas.Usaré jQuery en los ejemplos,pero esto también se aplica a plain-JS:
ja: 特定のイベントが発生した後に他のイベントハンドラが実行されるのを防ぎたい場合、2つのテクニックのうちの1つを使うことができます。例ではjQueryを使いますが、これはPlain-JSにも適用されます。
ko: 특정 이벤트가 발생한 후 다른 이벤트 처리기가 실행되지 않게하려면 두 가지 기술 중 하나를 사용할 수 있습니다. 예제에서는 jQuery를 사용하지만 일반 JS에도 적용됩니다.
ru: Когда я хочу предотвратить выполнение других обработчиков событий после того,как определенное событие уволено,я могу использовать одну из двух техник.Я буду использовать jQuery в примерах,но это относится и к plain-JS:
zh_cn: 当我想阻止其他事件处理程序在某个事件被触发后执行时,我可以使用两种技术之一。我将在例子中使用jQuery,但这也适用于纯JS。

source: When using jQuery, <code>return false</code> is doing 3 separate things when you call it:
es: Cuando usa jQuery, <code>return false</code> est&aacute; haciendo 3 cosas separadas cuando lo llama:
ja: jQueryを使用する場合、 <code>return false</code> と、呼び出し時に3つの異なる処理が行われます。
ko: jQuery를 사용할 때 <code>return false</code> 하면 호출 할 때 3 가지 작업을 수행합니다.
ru: При использовании jQuery <code>return false</code> делает 3 отдельных вещи, когда вы вызываете его:
zh_cn: 使用jQuery时，在调用它时， <code>return false</code> 会做3件事：

source: When you write return false it do the following things for you behind the scenes.
es: Cuando escribas "return false" haz lo siguiente entre bastidores.
ja: return falseを書くと、裏では次のようなことをしてくれます。
ko: return false를 쓰면 뒤에서 다음을 수행합니다.
ru: Когда вы пишете фальшивый ответ,он делает для вас следующие вещи за кулисами.
zh_cn: 当你写回假的时候,它在幕后为你做以下事情。

source: You can hang a lot of functions on the <code>onClick</code> event for one element. How can you be sure the <code>false</code> one will be the last one to fire? <code>preventDefault</code> on the other hand will definitely prevent only the default behavior of the element.
es: Puede colgar muchas funciones en el evento <code>onClick</code> para un elemento. &iquest;C&oacute;mo puedes estar seguro de que el <code>false</code> ser&aacute; el &uacute;ltimo en disparar? <code>preventDefault</code> , por otro lado, definitivamente evitar&aacute; solo el comportamiento predeterminado del elemento.
ja: 1つの要素の <code>onClick</code> イベントに多くの関数を掛けることができます。 <code>false</code> ものが最後に発砲するものであることをどうやって確認できますか？ 一方、 <code>preventDefault</code> は、要素のデフォルトの動作のみを確実に防止します。
ko: 하나의 요소에 대해 <code>onClick</code> 이벤트에 많은 기능을 정지시킬 수 있습니다. <code>false</code> 이 마지막으로 발사되는 것을 어떻게 확신 할 수 있습니까? 반면에 <code>preventDefault</code> 는 요소의 기본 동작 만 확실히 방지합니다.
ru: Вы можете повесить множество функций на событие <code>onClick</code> для одного элемента. Как вы можете быть уверены, что <code>false</code> будет последним, кто выстрелит? <code>preventDefault</code> другой стороны, protectDefault определенно предотвратит только поведение элемента по умолчанию.
zh_cn: 您可以在 <code>onClick</code> 事件上为一个元素挂起很多功能。 您如何确定 <code>false</code> 将是最后一个被解雇的人？ 另一方面， <code>preventDefault</code> 绝对只能阻止元素的默认行为。

source: You can read this in the W3C spec on <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">Event cancelation</a>.
es: Puede leer esto en la especificaci&oacute;n del W3C sobre <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">cancelaci&oacute;n de eventos</a> .
ja: これは、 <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">イベントのキャンセル</a>に関するW3C仕様で読むことができます。
ko: <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">이벤트 취소</a> 에 대한 W3C 사양에서이 내용을 읽을 수 있습니다.
ru: Вы можете прочитать это в спецификации W3C по <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">отмене событий</a> .
zh_cn: 您可以在W3C规范中有关<a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-cancelation">事件取消的内容中进行阅读</a> 。

source: event.preventDefault() vs. return false
ja: event.preventDefault()vs.false を返す
ko: event.preventDefault () vs. false 반환
zh_cn: event.protectDefault()vs.return false

source: is <strong>equal</strong> to this code:
es: es <strong>igual</strong> a este c&oacute;digo:
ja: このコードと<strong>等しい</strong> ：
ko: 이 코드와 같습니다
ru: <strong>равно</strong> этому коду:
zh_cn: <strong>等于</strong>以下代码：

source: is the w3c specified way of canceling events.
es: es la forma especificada por el W3C para cancelar eventos.
ja: はw3cが指定したイベントのキャンセル方法です。
ko: 이벤트를 취소하는 w3c 지정 방법입니다.
ru: это указанный w3c способ отмены мероприятий.
zh_cn: 是w3c指定的取消事件的方式。

source: jQuery and the <a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">previously linked citation</a> from <a href="http://ejohn.org">John Resig</a> (in <a href="https://stackoverflow.com/users/70393">karim79's</a><a href="https://stackoverflow.com/questions/1357118/#1357151">message</a>) seem to be the source misunderstanding of how event handlers in general work.
es: jQuery y la <a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">cita previamente vinculada</a> de <a href="http://ejohn.org">John Resig</a> (en <a href="https://stackoverflow.com/users/70393">el</a> <a href="https://stackoverflow.com/questions/1357118/#1357151">mensaje</a> de karim79 ) parecen ser la fuente de malentendidos de c&oacute;mo funcionan los controladores de eventos en general.
ja: jQueryと<a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">以前リンクさ</a>れていた<a href="http://ejohn.org">John Resig</a>からの引用 （ <a href="https://stackoverflow.com/users/70393">karim79の</a> <a href="https://stackoverflow.com/questions/1357118/#1357151">メッセージ内</a> ）は、一般的なイベントハンドラーの動作に関する誤解の原因のようです。
ko: jQuery와 <a href="http://ejohn.org">John Resig</a> ( <a href="https://stackoverflow.com/users/70393">karim79의</a> <a href="https://stackoverflow.com/questions/1357118/#1357151">메시지</a> )에서 <a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">이전에 연결된 인용</a> 은 일반적인 이벤트 처리기가 어떻게 작동하는지에 대한 오해의 소지가있는 것 같습니다.
ru: jQuery и <a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">ранее связанная цитата</a> от <a href="http://ejohn.org">Джона Резига</a> (в <a href="https://stackoverflow.com/questions/1357118/#1357151">сообщении</a> <a href="https://stackoverflow.com/users/70393">karim79</a> ), похоже, являются источником неправильного понимания того, как вообще работают обработчики событий.
zh_cn: jQuery和<a href="http://ejohn.org">John Resig</a> <a href="http://www.mail-archive.com/jquery-en@googlegroups.com/msg71371.html">先前链接的引用</a> （在<a href="https://stackoverflow.com/users/70393">karim79的</a> <a href="https://stackoverflow.com/questions/1357118/#1357151">消息中</a> ）似乎是对事件处理程序在一般情况下如何工作的误解。
