Repository: rueisnom/feedback
Catalog: xlf/13/57/11/8/1357118.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "<code>return false;</code>" will end the whole execution of process.
es: " <code>return false;</code> " terminar&aacute; la ejecuci&oacute;n completa del proceso.
ja: 「 <code>return false;</code> 」は、プロセスの実行全体を終了します。
ko: " <code>return false;</code> "는 프로세스의 전체 실행을 종료합니다.
ru: &laquo; <code>return false;</code> &raquo; завершит все выполнение процесса.
zh_cn: &ldquo; <code>return false;</code> &rdquo;将结束整个过程的执行。

source: <code>e.preventDefault()</code> will prevent the default event from occuring, <code>e.stopPropagation()</code> will prevent the event from bubbling up and <code>return false</code> will do both. Note that this behaviour differs from <em>normal</em> (non-jQuery) event handlers, in which, notably, <code>return false</code> does <em>not</em> stop the event from bubbling up.
es: <code>e.preventDefault()</code> evitar&aacute; que ocurra el evento predeterminado, <code>e.stopPropagation()</code> evitar&aacute; que el evento brote y <code>return false</code> har&aacute; ambas cosas. Tenga en cuenta que este comportamiento difiere de <em>los</em> controladores de eventos <em>normales</em> (no jQuery), en los que, en particular, <code>return false</code> <em>no</em> impide que el evento brote.
ja: <code>e.preventDefault()</code> はデフォルトのイベントが発生するのを防ぎ、 e.stopPropagation（）はイベントが発生するのを防ぎ、 <code>return false</code> を返すと両方が行われます。 この動作は<em>通常の</em> （jQuery以外の）イベントハンドラーとは異なります。特に、 <code>return false</code> てもイベントが発生し<em>なくなる</em> ことはありませ<em>ん</em> 。
ko: <code>e.preventDefault()</code> 는 기본 이벤트가 발생하지 않도록합니다. <code>e.stopPropagation()</code> 은 이벤트가 버블 링되는 것을 방지하고 <code>return false</code> 를 반환 하면 둘 다 수행됩니다. 이 동작은 <em>일반</em> (jQuery가 아닌) 이벤트 핸들러와 다르며, 특히 <code>return false</code> 해도 이벤트 버블 링이 중지되지 <em>않습니다</em> .
ru: <code>e.preventDefault()</code> предотвратит возникновение события по умолчанию, <code>e.stopPropagation()</code> предотвратит всплытие события и <code>return false</code> сделает оба. Обратите внимание, что это поведение отличается от <em>обычных</em> (не jQuery) обработчиков событий, в которых, в частности, <code>return false</code> <em>не</em> останавливает всплывающее событие.
zh_cn: <code>e.preventDefault()</code> 将阻止默认事件的发生， <code>e.stopPropagation()</code> 将阻止该事件的冒泡并 <code>return false</code> 会同时执行这两种操作。 请注意，此行为不同于<em>普通的</em> （非jQuery）事件处理程序，在事件处理程序中，值得注意的是， <code>return false</code> 不会阻止事件冒泡。

source: <code>return false</code> from <em>within a jQuery event handler</em> is effectively the same as calling both <code>e.preventDefault</code> and <code>e.stopPropagation</code> on the passed <a href="http://api.jquery.com/category/events/event-object/">jQuery.Event object.</a>
es: <code>return false</code> desde <em>un controlador de eventos jQuery</em> es efectivamente lo mismo que llamar a <code>e.preventDefault</code> y <code>e.stopPropagation</code> en el <a href="http://api.jquery.com/category/events/event-object/">objeto jQuery.Event</a> pasado .
ja: <em>jQueryイベントハンドラ内</em>から <code>return false</code> を返すことは、渡された<a href="http://api.jquery.com/category/events/event-object/">jQuery.Eventオブジェクトで</a> <code>e.preventDefault</code> と <code>e.stopPropagation</code> の両方を呼び出すことと実質的に同じです。
ko: <em>jQuery 이벤트 핸들러 내에서</em> <code>return false</code> 은 전달 된 <a href="http://api.jquery.com/category/events/event-object/">jQuery.Event 객체</a> 에서 <code>e.preventDefault</code> 와 <code>e.stopPropagation</code> 을 모두 호출하는 것과 사실상 동일 합니다.
ru: <code>return false</code> из <em>обработчика событий jQuery</em> фактически аналогичен вызову <code>e.preventDefault</code> и <code>e.stopPropagation</code> для переданного <a href="http://api.jquery.com/category/events/event-object/">объекта jQuery.Event.</a>
zh_cn: 从<em>jQuery事件处理程序中</em> <code>return false</code> <code>e.preventDefault</code> 与在传递的<a href="http://api.jquery.com/category/events/event-object/">jQuery.Event对象</a>上调用e.preventDefault和 <code>e.stopPropagation</code> 相同。

source: <em>Fuel Your Coding</em> has a great <a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">article on <code>return false;</code> vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code></a>.
es: <em>Fuel Your Coding</em> tiene un excelente <a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">art&iacute;culo sobre <code>return false;</code> </a> vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code> .
ja: <em>Fuel Your Codingに</em>は<a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/"> <code>return false;</code> に関する</a>すばらしい記事があります。 vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code> 。
ko: <em>연료 코딩</em> 에는 <a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/"> <code>return false;</code> 에</a> 대한 훌륭한 기사가 있습니다 . vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code>
ru: <em>Fuel Your Coding</em> имеет отличную <a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">статью о <code>return false;</code> </a> vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code> .
zh_cn: <em>《加油您的代码》中</em>有一篇很棒的<a href="https://web.archive.org/web/20160429070956/http://fuelyourcoding.com/jquery-events-stop-misusing-return-false/">文章，关于 <code>return false;</code> </a> vs <code>event.preventDefault()</code> vs <code>event.stopPropagation()</code> vs <code>event.stopImmediatePropagation()</code> 。

source: <strong>Any benefit to using event.preventDefault() over "return false" to cancel out an href click?</strong>
es: <strong>&iquest;Alg&uacute;n beneficio al usar event.preventDefault () sobre "return false" para cancelar un clic href?</strong>
ja: <strong>「return false」よりもevent.preventDefault（）を使用して、hrefクリックをキャンセルする利点はありますか？</strong>
ko: <strong>href 클릭을 취소하기 위해 "false return"에 대해 event.preventDefault ()를 사용하면 어떤 이점이 있습니까?</strong>
ru: <strong>Есть ли какая-либо польза от использования event.preventDefault () по сравнению с &laquo;return false&raquo; для отмены href клика?</strong>
zh_cn: <strong>使用event.preventDefault（）代替&ldquo; return false&rdquo;来取消href点击有什么好处？</strong>

source: <strong>return False;</strong>
es: <strong>falso retorno;</strong>
ja: <strong>Falseを返します。</strong>
ko: <strong>False를 반환;</strong>
ru: <strong>вернуть Ложь;</strong>
zh_cn: <strong>返回False;</strong>

source: <strong>return false is e.preventDefault AND e.stopPropagation</strong>
es: <strong>return false es e.preventDefault AND e.stopPropagation</strong>
ja: <strong>falseはe.preventDefault AND e.stopPropagationを返します</strong>
ko: <strong>false를 반환하면 e.preventDefault이며 e.stopPropagation입니다.</strong>
ru: <strong>вернуть false - это e.preventDefault AND e.stopPropagation</strong>
zh_cn: <strong>返回false是e.preventDefault和e.stopPropagation</strong>

source: Also you can't use return false in every situation. When giving a javascript function in the href attribute and if you return false then the user will be redirected to a page with false string written.
es: Tampoco puedes usar el retorno falso en cada situación.Al dar una función javascript en el atributo href y si devuelves false entonces el usuario será redirigido a una página con una cadena falsa escrita.
ja: また、すべての状況でreturn falseを使用することはできません。href属性にjavascriptの関数を指定した場合、falseを返すとfalseの文字列が書かれたページにリダイレクトされます。
ko: 또한 모든 상황에서 return false를 사용할 수는 없습니다. href 속성에 자바 스크립트 함수를 제공하고 false를 반환하면 사용자는 false 문자열이 작성된 페이지로 리디렉션됩니다.
ru: Также нельзя использовать фальшивые возвраты в любой ситуации.При задании функции javascript в атрибуте href и если вы вернете false,то пользователь будет перенаправлен на страницу с написанной ложной строкой.
zh_cn: 另外,你不能在任何情况下都使用 return false。当给一个javascript函数的 href属性中的函数,如果你返回false,那么用户将被重定向到一个写有false字符串的页面。

source: Also, I have to define the first parameter in callback to be able to call the method. Perhaps, there are some reasons why I should avoid doing it like this and use <code>preventDefault</code> instead? What's the better way?
es: Adem&aacute;s, tengo que definir el primer par&aacute;metro en la devoluci&oacute;n de llamada para poder llamar al m&eacute;todo. Tal vez, &iquest;hay algunas razones por las que deber&iacute;a evitar hacerlo as&iacute; y usar <code>preventDefault</code> en su lugar? &iquest;Cu&aacute;l es la mejor manera?
ja: また、メソッドを呼び出せるように、コールバックの最初のパラメーターを定義する必要があります。 おそらく、このようにすることを避け、代わりに <code>preventDefault</code> を使用する必要があるいくつかの理由がありますか？ より良い方法は何ですか？
ko: 또한 메소드를 호출하려면 콜백에서 첫 번째 매개 변수를 정의해야합니다. 아마도 이와 같이하지 말아야하고 <code>preventDefault</code> 를 대신 사용해야하는 몇 가지 이유가 있습니까? 더 좋은 방법은 무엇입니까?
ru: Кроме того, я должен определить первый параметр в обратном вызове, чтобы иметь возможность вызывать метод. Возможно, есть некоторые причины, по которым мне следует избегать подобных <code>preventDefault</code> и использовать вместо него protectDefault ? Какой способ лучше?
zh_cn: 另外，我必须在回调中定义第一个参数才能调用该方法。 也许，出于某些原因，我应该避免这样做，而使用 <code>preventDefault</code> 呢？ 有什么更好的方法？

source: Basically before starting using <code>return false;</code>, first understand what <code>e.preventDefault();</code> and <code>e.stopPropagation();</code> do, then if you think you need both at the same time, then simply use it.
es: B&aacute;sicamente antes de comenzar a usar <code>return false;</code> , primero entienda qu&eacute; <code>e.preventDefault();</code> y <code>e.stopPropagation();</code> Si crees que necesitas ambos al mismo tiempo, simplemente &uacute;salo.
ja: 基本的に <code>return false;</code> 使用を開始する前。 、まず <code>e.preventDefault();</code> を理解します。 および <code>e.stopPropagation();</code> 両方を同時に使用する必要があると思われる場合は、使用してください。
ko: 기본적으로 <code>return false;</code> 사용하기 전에 ; 먼저 <code>e.preventDefault();</code> 및 <code>e.stopPropagation();</code> 그런 다음 동시에 둘 다 필요하다고 생각되면 간단히 사용하십시오.
ru: В основном перед началом использования <code>return false;</code> , сначала поймите, что <code>e.preventDefault();</code> и <code>e.stopPropagation();</code> сделайте, тогда, если вы думаете, что вам нужно и то и другое одновременно, просто используйте его.
zh_cn: 基本上在开始使用前 <code>return false;</code> ，首先了解一下 <code>e.preventDefault();</code> 和 <code>e.stopPropagation();</code> 然后，如果您认为同时需要两者，则只需使用它。

source: Basically, this way you combine things because jQuery is a framework which mostly focuses on HTML elements, you basically preventing the default, but at the same time, you stop propagation to bubble up.
es: Básicamente,de esta manera combinas las cosas porque jQuery es un marco de trabajo que se centra mayormente en los elementos HTML,básicamente evitas el predeterminado,pero al mismo tiempo,detienes la propagación para hacer burbujas.
ja: 基本的には、jQueryはHTML要素を中心としたフレームワークなので、このように組み合わせることで、基本的にはデフォルトを防ぐことができますが、同時にバブルアップの伝播を止めることができます。
ko: 기본적으로 jQuery는 HTML 요소에 주로 중점을 둔 프레임 워크이기 때문에 기본적으로 기본값을 방지하지만 동시에 전파를 중지시키는 방식이기 때문에 이러한 방식으로 결합합니다.
ru: В основном,таким образом вы комбинируете вещи,потому что jQuery-это фреймворк,который в основном фокусируется на элементах HTML,вы в основном препятствуете установке по умолчанию,но в то же время,вы останавливаете распространение,чтобы "пузыриться".
zh_cn: 基本上,这种方式可以把事情结合起来,因为jQuery是一个框架,它主要是以HTML元素为主,你基本上是防止默认的,但同时,你停止传播的同时,也就停止了传播的泡沫化。

source: But also don't forget it's all in jQuery or DOM related functions, when you run it on the element, basically, it prevents everything from firing including the default behaviour and propagation of the event.
es: Pero tampoco olvides que todo está en las funciones relacionadas con jQuery o DOM,cuando lo ejecutas en el elemento,básicamente,impide que todo se dispare incluyendo el comportamiento por defecto y la propagación del evento.
ja: しかし、それはすべてjQueryやDOM関連の関数の中にあることも忘れてはいけません、要素上で実行すると、基本的にはデフォルトの振る舞いやイベントの伝播を含めて、すべてのイベントが発生しないようにします。
ko: 그러나 jQuery 또는 DOM 관련 함수에 있다는 것을 잊지 마십시오. 요소에서 요소를 실행할 때 기본적으로 기본 동작 및 이벤트 전파를 포함하여 모든 항목이 실행되는 것을 방지합니다.
ru: Но также не забывайте,что все это находится в функциях,связанных с jQuery или DOM,когда вы запускаете его на элементе,в основном,это предотвращает все от стрельбы,включая поведение по умолчанию и распространение события.
zh_cn: 但是也别忘了它都是在jQuery或者DOM相关的函数中,当你在元素上运行它的时候,基本上就会阻止所有的事情发生,包括事件的默认行为和传播。

source: But if you are sure that the code won't trigger any exceptions, then you can go with any of the method you wish.
es: Pero si está seguro de que el código no provocará ninguna excepción,entonces puede ir con cualquier método que desee.
ja: しかし、コードが例外を発生させないと確信しているのであれば、どのメソッドを使っても構いません。
ko: 그러나 코드가 예외를 트리거하지 않을 것이라고 확신하는 경우 원하는 방법을 사용할 수 있습니다.
ru: Но если вы уверены,что код не вызовет никаких исключений,то вы можете выбрать любой метод.
zh_cn: 但如果你确定代码不会触发任何异常,那么你可以用你想用的任何一种方法。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Fact: An event handler that returns false prevents the default action for that event. It does not stop the event propagation. Event handlers have always worked this way, since the old days of Netscape Navigator.
es: Hecho:Un manejador de eventos que devuelve false impide la acción por defecto para ese evento.No detiene la propagación del evento.Los manejadores de eventos siempre han trabajado de esta manera,desde los viejos tiempos de Netscape Navigator.
ja: 事実:false を返すイベントハンドラは、そのイベントのデフォルトのアクションを防ぎます。イベントの伝播を停止するわけではありません。イベントハンドラは昔のNetscape Navigatorの時代から常にこのように動作してきました。
ko: 사실 : false를 리턴하는 이벤트 핸들러는 해당 이벤트에 대한 기본 조치를 방지합니다. 이벤트 전파를 중지하지 않습니다. Netscape Navigator의 옛날부터 이벤트 핸들러는 항상 이런 식으로 작동했습니다.
ru: Факт:обработчик события,возвращающий false,предотвращает действие по умолчанию для этого события.Он не останавливает распространение события.Обработчики событий всегда работали таким образом,начиная со старых времен Netscape Navigator.
zh_cn: 事实:一个返回false的事件处理程序会阻止该事件的默认操作。它不会停止事件的传播。从Netscape Navigator的旧时代开始,事件处理程序就一直是这样工作的。

source: For further reading, see <a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">attachEvent on MSDN</a> and the <a href="http://www.w3.org/TR/DOM-Level-2-Events/">W3C DOM 2 Events documentation</a>.
es: Para leer m&aacute;s, vea <a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">attachEvent en MSDN</a> y la <a href="http://www.w3.org/TR/DOM-Level-2-Events/">documentaci&oacute;n de eventos W3C DOM 2</a> .
ja: 詳細については、 <a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">MSDNのattachEvent</a>と<a href="http://www.w3.org/TR/DOM-Level-2-Events/">W3C DOM 2イベントのドキュメントを</a>ご覧ください。
ko: 자세한 내용 <a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">은 MSDN의 attachEvent</a> 및 <a href="http://www.w3.org/TR/DOM-Level-2-Events/">W3C DOM 2 이벤트 설명서를</a> 참조하십시오.
ru: Для получения дополнительной информации см. <a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">AttachEvent на MSDN</a> и документацию <a href="http://www.w3.org/TR/DOM-Level-2-Events/">W3C DOM 2 Events</a> .
zh_cn: 有关更多阅读，请参阅<a href="http://msdn.microsoft.com/en-us/library/ms536343%28VS.85%29.aspx">MSDN上的attachEvent</a>和<a href="http://www.w3.org/TR/DOM-Level-2-Events/">W3C DOM 2事件文档</a> 。

source: For me, <code>return false;</code> is simpler, shorter and probably less error prone than executing a method. With the method, you have to remember about correct casing, parenthesis, etc.
es: Para m&iacute;, <code>return false;</code> es m&aacute;s simple, m&aacute;s corto y probablemente menos propenso a errores que ejecutar un m&eacute;todo. Con el m&eacute;todo, debe recordar acerca de la carcasa correcta, par&eacute;ntesis, etc.
ja: 私にとっては、 <code>return false;</code> メソッドを実行するよりも簡単で、短く、おそらくエラーが起こりにくいです。 この方法では、大文字小文字の区別、括弧などについて覚えておく必要があります。
ko: 나를 위해, <code>return false;</code> 메소드를 실행하는 것보다 간단하고 짧으며 오류가 적습니다. 이 방법을 사용하면 올바른 케이스, 괄호 등을 기억해야합니다.
ru: Для меня <code>return false;</code> проще, короче и, вероятно, менее подвержен ошибкам, чем выполнение метода. При использовании этого метода вы должны помнить о правильном регистре, скобках и т. Д.
zh_cn: 对我来说， <code>return false;</code> 与执行方法相比，它更简单，更短并且更容易出错。 使用该方法时，您必须记住正确的大小写，括号等。

source: From my experience event.stopPropagation() is mostly used in CSS effect or animation works, for instance when you have hover effect for both card and button element, when you hover on the button both card and buttons hover effect will be triggered in this case, you can use event.stopPropagation() stop bubbling actions, and event.preventDefault() is for prevent default behaviour of browser actions. For instance, you have form but you only defined click event for the submit action, if the user submits the form by pressing enter, the browser triggered by keypress event, not your click event here you should use event.preventDefault() to avoid inappropriate behavior. I don't know what the hell is return false; sorry.For more clarification visit this link and play around with line #33 <a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv</a>
es: Desde mi experiencia, event.stopPropagation () se usa principalmente en efectos de CSS o trabajos de animaci&oacute;n, por ejemplo, cuando tiene un efecto de desplazamiento para el elemento de la tarjeta y el bot&oacute;n, cuando se desplaza sobre el bot&oacute;n, el efecto de desplazamiento de la tarjeta y los botones se activar&aacute; en este caso , puede usar event.stopPropagation () para detener las acciones burbujeantes, y event.preventDefault () es para evitar el comportamiento predeterminado de las acciones del navegador. Por ejemplo, tiene un formulario, pero solo defini&oacute; un evento de clic para la acci&oacute;n de env&iacute;o, si el usuario env&iacute;a el formulario presionando enter, el navegador se activar&aacute; con el evento de pulsaci&oacute;n de tecla, no su evento de clic aqu&iacute;, debe usar event.preventDefault () para evitar comportamiento. No s&eacute; qu&eacute; demonios es volver falso; lo siento. Para obtener m&aacute;s aclaraciones, visite este enlace y juegue con la l&iacute;nea # 33 <a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv</a>
ja: 私の経験からevent.stopPropagation（）は主にCSSエフェクトまたはアニメーション作品で使用されています。たとえば、カードとボタンの両方の要素にホバー効果がある場合、ボタンにカーソルを合わせると、カードとボタンの両方のホバー効果がトリガーされます。 、event.stopPropagation（）を使用してバブリングアクションを停止できます。event.preventDefault（）は、ブラウザアクションのデフォルトの動作を防止するためのものです。 たとえば、フォームはありますが、送信アクションに対してクリックイベントのみを定義しました。ユーザーがEnterキーを押してフォームを送信した場合、ブラウザはここでクリックイベントではなく、keypressイベントによってトリガーされます。不適切な事態を避けるためにevent.preventDefault（）を使用する必要があります。動作。 地獄が何であるか私にはわかりません。 申し訳ありませんが、より明確にするために、このリンクに<a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">アクセス</a>し、行＃33で遊んでくださいhttps://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv
ko: 내 경험에서 event.stopPropagation ()은 CSS 효과 또는 애니메이션 작업에 주로 사용됩니다. 예를 들어 카드와 버튼 요소 모두에 호버 효과가있는 경우, 버튼 위에 마우스를 올리면 카드와 버튼 호버 효과가 모두 트리거됩니다. event.stopPropagation () 중지 버블 링 동작을 사용할 수 있으며 event.preventDefault ()는 브라우저 동작의 기본 동작을 방지하기위한 것입니다. 예를 들어, 양식이 있지만 제출 조치에 대한 클릭 이벤트 만 정의했습니다. 사용자가 Enter 키를 눌러 양식을 제출하는 경우 여기에서 클릭 이벤트가 아닌 키 누르기 이벤트에 의해 브라우저가 트리거됩니다. 여기서 부적절한 이벤트를 피하려면 event.preventDefault ()를 사용해야합니다. 행동. 나는 도대체 거짓이 무엇인지 모른다. 자세한 내용을 보려면이 링크를 방문하여 33 번 라인 ( <a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv)을 참조하십시오.</a>
ru: Из моего опыта event.stopPropagation () в основном используется в эффектах CSS или анимационных работах, например, когда у вас есть эффект наведения как для карты, так и для элемента кнопки, когда вы наводите курсор на кнопку, в этом случае сработает эффект наведения карты и кнопок. , вы можете использовать event.stopPropagation (), чтобы прекратить всплывать действия, а event.preventDefault () предназначен для предотвращения поведения по умолчанию действий браузера. Например, у вас есть форма, но вы только определили событие щелчка для действия отправки, если пользователь отправляет форму нажатием клавиши ввода, браузер запускается по событию нажатия клавиши, а не событие щелчка здесь, вы должны использовать event.preventDefault (), чтобы избежать неуместного поведение. Я не знаю, что, черт возьми, вернуть ложь; извините. Для получения дополнительной информации перейдите по этой ссылке и поиграйте со строкой # 33 <a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv</a>
zh_cn: 根据我的经验，event.stopPropagation（）主要用于CSS效果或动画作品中，例如，当您同时对卡片和按钮元素都具有悬停效果时，当您在按钮上悬停时，会触发卡片和按钮的悬停效果，您可以使用event.stopPropagation（）停止冒泡操作，而event.preventDefault（）用于阻止浏览器操作的默认行为。 例如，您有一个表单，但您仅为该提交操作定义了click事件，如果用户通过按Enter提交表单，则由keypress事件触发的浏览器（而不是您的click事件）在这里，您应该使用event.preventDefault（）以避免不合适行为。 我不知道该死的是假。 抱歉。有关更多说明，请访问此链接，并播放＃33行<a href="https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv">https://www.codecademy.com/courses/introduction-to-javascript/lessons/requests-i/exercises/xhr-get-request-iv</a>
