Repository: rueisnom/feedback
Catalog: xlf/13/57/11/8/1357118.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: prevents the hyperlink from following the URL, prevents the submit button to submit the form. When you have many event handlers and you just want to prevent default event from occuring, &amp; occuring from many times, for that we need to use in the top of the function().
es: evita que el hiperv&iacute;nculo siga la URL, evita que el bot&oacute;n enviar env&iacute;e el formulario. Cuando tienes muchos controladores de eventos y solo quieres evitar que ocurra un evento predeterminado, y que ocurra muchas veces, para eso necesitamos usarlo en la parte superior de la funci&oacute;n ().
ja: ハイパーリンクがURLをたどらないようにし、送信ボタンがフォームを送信できないようにします。 多くのイベントハンドラーがあり、デフォルトのイベントが発生しないようにしたい場合、およびfunction（）の上部で使用する必要があるため、何度も発生しないようにする場合。
ko: 하이퍼 링크가 URL을 따르지 못하게하고 제출 단추가 양식을 제출하지 못하게합니다. 많은 이벤트 핸들러가 있고 기본 이벤트가 발생하지 않도록 여러 번 발생하는 것을 막으려면 function () 맨 위에 사용해야합니다.
ru: предотвращает переход по гиперссылке по URL, запрещает кнопку отправки для отправки формы. Когда у вас есть много обработчиков событий, и вы просто хотите предотвратить возникновение события по умолчанию и повторение много раз, для этого нам нужно использовать в верхней части функции ().
zh_cn: 阻止超链接跟随URL，阻止提交按钮提交表单。 当您有很多事件处理程序并且只想防止默认事件发生以及多次发生时，为此，我们需要在function（）的顶部使用。
