Repository: rueisnom/feedback
Catalog: xlf/26/93/77/6/2693776.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <code>buffer</code>, from the original <code>fgets()</code> will not contain in <code>"\n"</code> under some circumstances:
ja: <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元の</font></font> <code>fgets()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バッファは</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">状況によって</font><font style="vertical-align: inherit;">は</font></font> <code>"\n"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">含まれません</font><font style="vertical-align: inherit;">。</font></font>
ko: <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 상황 </font><font style="vertical-align: inherit;">에서는 원래 </font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font><font style="vertical-align: inherit;">buffer</font><font style="vertical-align: inherit;"> 에 </font></font> <code>"\n"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포함되지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , из исходного </font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не будет содержаться в </font></font> <code>"\n"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> при некоторых обстоятельствах:</font></font>
zh_cn: <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在某些情况下</font><font style="vertical-align: inherit;">，原始</font></font> <code>fgets()</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buffer</font><font style="vertical-align: inherit;">不会包含在</font></font> <code>"\n"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: <code>sprintf(buffer,"%s",buffer);</code> is undefined behavior: <a href="https://stackoverflow.com/questions/1283354/is-sprintfbuffer-s-buffer-safe">Ref</a>. Further, it does not save any leading, separating or trailing whitespace. Now <a href="https://stackoverflow.com/a/23695411/2410359">deleted</a>.
ja: <code>sprintf(buffer,"%s",buffer);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">未定義の動作です：</font></font><a href="https://stackoverflow.com/questions/1283354/is-sprintfbuffer-s-buffer-safe"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ref</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">さらに、先行、分離、または末尾の空白は保存されません。</font><font style="vertical-align: inherit;">今すぐ</font></font><a href="https://stackoverflow.com/a/23695411/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">削除しました</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <code>sprintf(buffer,"%s",buffer);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정의되지 않은 동작입니다 : </font></font><a href="https://stackoverflow.com/questions/1283354/is-sprintfbuffer-s-buffer-safe"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ref</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">또한 선행, 분리 또는 후행 공백을 저장하지 않습니다. </font><font style="vertical-align: inherit;">이제 </font></font><a href="https://stackoverflow.com/a/23695411/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">삭제되었습니다</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <code>sprintf(buffer,"%s",buffer);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является неопределенным поведением: </font></font><a href="https://stackoverflow.com/questions/1283354/is-sprintfbuffer-s-buffer-safe"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ref</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Кроме того, он не сохраняет начальные, разделительные или конечные пробелы. </font><font style="vertical-align: inherit;">Сейчас </font></font><a href="https://stackoverflow.com/a/23695411/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">удалено</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <code>sprintf(buffer,"%s",buffer);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是未定义的行为：</font></font><a href="https://stackoverflow.com/questions/1283354/is-sprintfbuffer-s-buffer-safe"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ref</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">此外，它不保存任何前导，分隔或尾随空格。</font><font style="vertical-align: inherit;">现在</font></font><a href="https://stackoverflow.com/a/23695411/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">删除</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <code>strtok(buffer, "\n");</code> fails to remove the <code>'\n'</code> when <code>buffer</code> is <code>"\n"</code>. From this <a href="https://stackoverflow.com/a/2693826/2410359">answer</a> - amended after this answer to warn of this limitation.
ja: <code>strtok(buffer, "\n");</code> <font style="vertical-align: inherit;"> <code>buffer</code> <font style="vertical-align: inherit;">が</font> <code>"\n"</code> </font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">「\ n」の</font><font style="vertical-align: inherit;">削除に失敗します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この</font><a href="https://stackoverflow.com/a/2693826/2410359"><font style="vertical-align: inherit;">回答</font></a><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">-この制限を警告するためにこの回答の後に修正されました。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <code>strtok(buffer, "\n");</code> <font style="vertical-align: inherit;"> <code>buffer</code> <font style="vertical-align: inherit;"> 가 </font> <code>"\n"</code> <font style="vertical-align: inherit;"> 경우 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 제거하지 못합니다 </font><font style="vertical-align: inherit;">. 이 </font><a href="https://stackoverflow.com/a/2693826/2410359"><font style="vertical-align: inherit;">답변에서</font></a><font style="vertical-align: inherit;"> -이 제한 이후에 경고하기 위해이 답변 이후 수정되었습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <code>strtok(buffer, "\n");</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не удается удалить </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> когда </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равен </font></font> <code>"\n"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Из этого </font></font><a href="https://stackoverflow.com/a/2693826/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответа</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - исправлены после этого ответа, чтобы предупредить об этом ограничении.</font></font>
zh_cn: <code>strtok(buffer, "\n");</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当</font> <code>buffer</code> <font style="vertical-align: inherit;">为</font> <code>"\n"</code> <font style="vertical-align: inherit;">时，</font><font style="vertical-align: inherit;">无法删除</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">来自此</font><a href="https://stackoverflow.com/a/2693826/2410359"><font style="vertical-align: inherit;">答案</font></a><font style="vertical-align: inherit;"> -在此答案后进行修改，以警告此限制。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <sup><strong>Note</strong>: The <a href="https://stackoverflow.com/questions/2008173/writing-secure-c-and-secure-c-idioms">[ <strong>security issues</strong> ]</a> with <code>getline</code> shouldn't be neglected though.</sup>
ja: <sup><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font> <code>getline</code> <font style="vertical-align: inherit;">の</font></font><a href="https://stackoverflow.com/questions/2008173/writing-secure-c-and-secure-c-idioms"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セキュリティの問題</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">無視すべきではありません。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></sup>
ko: <sup><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font> <code>getline</code> <font style="vertical-align: inherit;"> 의 </font></font><a href="https://stackoverflow.com/questions/2008173/writing-secure-c-and-secure-c-idioms"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">security issues</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><font style="vertical-align: inherit;">무시해서는 안됩니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></sup>
ru: <sup><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><a href="https://stackoverflow.com/questions/2008173/writing-secure-c-and-secure-c-idioms"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проблемами безопасности</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не следует пренебрегать.</font></font></sup>
zh_cn: <sup><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：但是</font><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">不应忽略</font> <code>getline</code> <font style="vertical-align: inherit;">的</font></font><a href="https://stackoverflow.com/questions/2008173/writing-secure-c-and-secure-c-idioms"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">安全问题</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></sup>

source: A) The line was too long for <code>buffer</code> so only <code>char</code> preceding the <code>'\n'</code> is saved in <code>buffer</code>. The unread characters remain in the stream.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A）行が</font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は長すぎる</font><font style="vertical-align: inherit;">ため</font><font style="vertical-align: inherit;">、</font> <code>'\n'</code> <font style="vertical-align: inherit;">前の</font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみ</font><font style="vertical-align: inherit;">が</font> <code>buffer</code> <font style="vertical-align: inherit;">保存され</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">未読の文字はストリームに残ります。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 너무 길어서 </font> <code>'\n'</code> <font style="vertical-align: inherit;"> 앞의 </font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만이 </font> <code>buffer</code> 에<font style="vertical-align: inherit;"> 저장됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">읽지 않은 문자는 스트림에 남아 있습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) Строка была слишком длинной для </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поэтому </font><font style="vertical-align: inherit;">в </font> <code>buffer</code> <font style="vertical-align: inherit;"> сохраняется </font><font style="vertical-align: inherit;">только </font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предшествующий </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Непрочитанные символы остаются в потоке.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A）该行对于</font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来说太长，</font><font style="vertical-align: inherit;">因此只有</font> <code>'\n'</code> <font style="vertical-align: inherit;">之前的</font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被保存在</font> <code>buffer</code> 中<font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">未读字符保留在流中。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: An example usage could be
ja: 使用例としては、次のようなものがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 예는 다음과 같습니다.</font></font>
ru: Примером использования может быть
zh_cn: 一个例子可以是

source: Aside from the question on its own. Try to avoid double negations that make your code unclearer: <code>if (!(fgets(Name, sizeof Name, stdin) != NULL) {}</code>. You can simply do <code>if (fgets(Name, sizeof Name, stdin) == NULL) {}</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それ自体の質問は別として。</font><font style="vertical-align: inherit;">コードが不明確になる二重否定を避けてください：</font></font> <code>if (!(fgets(Name, sizeof Name, stdin) != NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font> <code>if (fgets(Name, sizeof Name, stdin) == NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 자체로 질문을 제외하고. </font><font style="vertical-align: inherit;">코드가 명확하지 않은 이중 부정을 피하십시오. </font></font> <code>if (!(fgets(Name, sizeof Name, stdin) != NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>if (fgets(Name, sizeof Name, stdin) == NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Помимо вопроса сам по себе. </font><font style="vertical-align: inherit;">Старайтесь избегать двойных отрицаний, которые делают ваш код неясным: </font></font> <code>if (!(fgets(Name, sizeof Name, stdin) != NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Вы можете просто сделать </font></font> <code>if (fgets(Name, sizeof Name, stdin) == NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除了问题本身。</font><font style="vertical-align: inherit;">尝试避免使代码不清楚的双重否定：</font></font> <code>if (!(fgets(Name, sizeof Name, stdin) != NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。您可以简单地执行</font></font> <code>if (fgets(Name, sizeof Name, stdin) == NULL) {}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: B) The last line in the file did not end with a <code>'\n'</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B）ファイルの最後の行が</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">終わっていません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B) 파일의 마지막 줄은 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 끝나지 않았습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Б) Последняя строка в файле не заканчивалась символом </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B）文件中的最后一行没有以</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结尾</font><font style="vertical-align: inherit;">。</font></font>

source: Below is a fast approach to remove a potential <code>'\n'</code> from a string saved by <code>fgets()</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下は、</font> <code>fgets()</code> <font style="vertical-align: inherit;">によって保存された文字列から</font><font style="vertical-align: inherit;">潜在的な</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を削除するための高速なアプローチ</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 </font> <code>fgets()</code> <font style="vertical-align: inherit;"> 저장된 문자열에서 </font><font style="vertical-align: inherit;">잠재적 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 제거하는 빠른 방법 </font><font style="vertical-align: inherit;">입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ниже приведен быстрый способ удаления потенциального </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из строки, сохраненной </font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下面是一种</font><font style="vertical-align: inherit;">从</font> <code>fgets()</code> <font style="vertical-align: inherit;">保存的字符串中</font><font style="vertical-align: inherit;">删除可能的</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的快速方法</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
