Repository: rueisnom/feedback
Catalog: xlf/26/93/77/6/2693776.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Check if the last character of the proper string is a newline character <code>'\n'</code>. If this is the case, replace <code>\n</code> with a <code>\0</code>. Note that index counts start at <code>0</code> so we will need to do <code>NAME[sl - 1]</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">適切な文字列の最後の文字が改行文字</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">かどうかを確認します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この場合は、</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">置き換えてください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">インデックスカウントは</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">始まる</font><font style="vertical-align: inherit;">ため、</font></font> <code>NAME[sl - 1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行する必要があることに</font><font style="vertical-align: inherit;">注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">올바른 문자열의 마지막 문자가 개행 문자 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이 경우 </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 바꾸십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">색인 카운트는 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 시작 </font><font style="vertical-align: inherit;">하므로 </font></font> <code>NAME[sl - 1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 수행해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте, является ли последний символ правильной строки символом новой строки </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если это так, замените </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Обратите внимание, что индекс начинается с </font></font> <code>0</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поэтому нам нужно сделать </font></font> <code>NAME[sl - 1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查正确字符串的最后一个字符是否为换行符</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这种情况下，请将</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">替换</font><font style="vertical-align: inherit;">为</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请注意，索引计数从</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开始，</font><font style="vertical-align: inherit;">因此我们需要执行</font></font> <code>NAME[sl - 1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Determine the length of the string inside <code>NAME</code> by using <code>strlen()</code>, header <code>string.h</code>. Note that <code>strlen()</code> does not count the terminating <code>\0</code>.
ja: <font style="vertical-align: inherit;"> <code>strlen()</code> <font style="vertical-align: inherit;">、ヘッダー</font> <code>string.h</code> <font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">て、</font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内の文字列の長さを決定し</font><font style="vertical-align: inherit;">ます。</font> <code>strlen()</code> <font style="vertical-align: inherit;">は終端の</font> <code>\0</code> <font style="vertical-align: inherit;">数えない</font><font style="vertical-align: inherit;">ことに注意してください</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>strlen()</code> <font style="vertical-align: inherit;"> , header </font> <code>string.h</code> 를<font style="vertical-align: inherit;"> 사용하여 </font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내의 문자열 길이를 결정하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">주의 </font> <code>strlen()</code> <font style="vertical-align: inherit;"> 종단 계산하지 않습니다 </font> <code>\0</code> <font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Определите длину строки внутри </font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , заголовок </font></font> <code>string.h</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Обратите внимание, что </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не считает завершающий </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过使用</font> <code>strlen()</code> <font style="vertical-align: inherit;">标题</font> <code>string.h</code> <font style="vertical-align: inherit;">来</font><font style="vertical-align: inherit;">确定</font></font> <code>NAME</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符串的长度</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请注意，</font> <code>strlen()</code> <font style="vertical-align: inherit;">不计算结尾</font> <code>\0</code> <font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Direct to remove the '\n' from the fgets output if every line has '\n'
ja: Direct to remove the '\n' from the fgets output if every line has '\n' if every line has '\n' if every line has '\n' from the fgets output.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 줄에 '\ n'이 있으면 fgets 출력에서 ​​'\ n'을 제거하도록 지시하십시오.</font></font>
ru: Непосредственно для удаления '\n' из вывода фджетов,если в каждой строке есть '\n'.
zh_cn: 如果每一行都有'\n',则直接从fgets输出中删除'\n'。

source: For single '\n' trimming,
ja: シングル「\n」トリミングの場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 '\ n'트리밍의 경우</font></font>
ru: Для обрезки сингла '\n',
zh_cn: 对于单一的'\n'修剪。

source: For those looking for a Perl chomp equivalent in C, I think this is it (chomp only removes the trailing newline).
ja: C言語でPerlのchompに相当するものを探している人のために、これがあると思います(chompは末尾の改行を削除するだけです)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C에서 Perl chomp에 해당하는 것을 찾는 사람들에게는 이것이라고 생각합니다 (chomp는 후행 줄 바꿈 만 제거합니다).</font></font>
ru: Для тех,кто ищет эквивалент chomp на Perl в C,я думаю,что это он (chomp только удаляет новую линию).
zh_cn: 对于那些在C语言中寻找Perl chomp等价物的人来说,我想就是这个了(chomp只是去掉了尾部的换行)。

source: However, I find that it has a newline <code>\n</code> character in the end. So if I enter <code>John</code> it ends up sending <code>John\n</code>. How do I remove that <code>\n</code> and send a proper string.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、</font><font style="vertical-align: inherit;">最後に</font><font style="vertical-align: inherit;">改行</font><font style="vertical-align: inherit;">文字</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">があることがわかり</font><font style="vertical-align: inherit;">ました。</font><font style="vertical-align: inherit;">したがって、</font></font> <code>John</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">入力すると、</font><font style="vertical-align: inherit;">Johnを</font><font style="vertical-align: inherit;">送信してしまいます</font></font> <code>John\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">その</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を削除し</font><font style="vertical-align: inherit;">て適切な文字列を送信</font><font style="vertical-align: inherit;">するにはどうすればよいですか</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">끝에 </font><font style="vertical-align: inherit;">줄 바꿈 문자 </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자 </font><font style="vertical-align: inherit;">가 있음을 알았습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">따라서 </font></font> <code>John</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 들어가면 </font></font> <code>John\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보냅니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그 </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 제거 </font><font style="vertical-align: inherit;">하고 적절한 문자열을 보내 </font><font style="vertical-align: inherit;">려면 어떻게해야합니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тем не менее, я считаю, что </font><font style="vertical-align: inherit;">в конце </font><font style="vertical-align: inherit;">он имеет </font><font style="vertical-align: inherit;">символ </font><font style="vertical-align: inherit;">новой строки </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Так что, </font><font style="vertical-align: inherit;">если я вхожу </font></font> <code>John</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> он заканчивает отправку </font></font> <code>John\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Как мне удалить это </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и отправить правильную строку.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，我发现它最后有一个换行符</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，如果我输入</font></font> <code>John</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它将最终发送</font></font> <code>John\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如何删除该</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并发送适当的字符串。</font></font>

source: I am trying to get some data from the user and send it to another function in gcc. The code is something like this.
ja: 私はユーザーからデータを取得して、それをgccの別の関数に送ろうとしています。コードは次のようなものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자로부터 일부 데이터를 가져 와서 gcc의 다른 함수로 보내려고합니다. </font><font style="vertical-align: inherit;">코드는 이와 같습니다.</font></font>
ru: Я пытаюсь получить некоторые данные от пользователя и отправить их в другую функцию в gcc.Код что-то вроде этого.
zh_cn: 我试图从用户那里获取一些数据,并将其发送到gcc中的另一个函数。代码是这样的。

source: If input has embedded null characters <code>'\0'</code> in it somewhere, the length reported by <code>strlen()</code> will not include the <code>'\n'</code> location.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">入力の</font><font style="vertical-align: inherit;">どこかに</font><font style="vertical-align: inherit;">ヌル文字</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が埋め込まれている場合</font><font style="vertical-align: inherit;">、</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">によって報告される長さ</font><font style="vertical-align: inherit;">には</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場所</font><font style="vertical-align: inherit;">は含まれません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력에 널 문자 </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 (가) 포함되어 있으면 </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의해보고 된 길이 </font><font style="vertical-align: inherit;">에는 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 위치가 </font><font style="vertical-align: inherit;">포함되지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если во входе есть где-то встроенные нулевые символы </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , длина, сообщаемая </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , не будет включать </font><font style="vertical-align: inherit;">местоположение </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果输入</font><font style="vertical-align: inherit;">在某处</font><font style="vertical-align: inherit;">嵌入了空字符</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">报告的长度</font><font style="vertical-align: inherit;">将不包含</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">位置。</font></font>

source: If using <code>getline</code> is an option - Not neglecting its security issues and if you wish to brace pointers - you can avoid string functions as the <code>getline</code> returns the number of characters. Something like below
ja: <font style="vertical-align: inherit;"></font> <code>getline</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">がオプションである場合-そのセキュリティ問題を無視せず、ポインターを中括弧にしたい場合</font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が文字数を返す</font><font style="vertical-align: inherit;">ため、文字列関数を回避でき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">以下のようなもの</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>getline</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하는 옵션-보안 문제를 무시하지 않고 포인터를 괄호로 묶고 싶다면 </font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 문자 수를 반환하므로 </font><font style="vertical-align: inherit;">문자열 함수를 피할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">아래와 같은 것</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если использование </font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является опцией - не пренебрегая проблемами безопасности и если вы хотите заключить указатели в скобки - вы можете избежать строковых функций, поскольку </font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает количество символов. </font><font style="vertical-align: inherit;">Что-то вроде ниже</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果使用</font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一种选择-不忽略其安全性问题，并且希望支撑指针，则可以避免使用字符串函数，因为</font></font> <code>getline</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回字符数。</font><font style="vertical-align: inherit;">像下面这样</font></font>

source: If you are in a different context and want to handle strings that may contain more than one newline, you might be looking for strrspn. It is not POSIX, meaning you will not find it on all Unices. I wrote one for my own needs.
ja: 別のコンテキストで、複数の改行を含む可能性のある文字列を扱いたい場合は、 strrspn を探すとよいでしょう。これはPOSIXではないので、すべてのUnicesで見つかるわけではありません。私は自分の必要性のために書いたものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 컨텍스트에 있고 둘 이상의 개행을 포함 할 수있는 문자열을 처리하려는 경우 strrspn을 찾고있을 수 있습니다. </font><font style="vertical-align: inherit;">POSIX가 아니므로 모든 Unices에서 찾을 수 없습니다. </font><font style="vertical-align: inherit;">나는 내 자신의 필요를 위해 하나를 썼습니다.</font></font>
ru: Если вы находитесь в другом контексте и хотите работать со строками,которые могут содержать более одной новой строки,вы можете искать strrspn.Это не POSIX,это означает,что вы не найдете его на всех Unices.Я написал один для своих нужд.
zh_cn: 如果你在不同的上下文中想要处理可能包含一个以上换行的字符串,你可能需要寻找strrspn。它不是POSIX,这意味着你不会在所有的Unices上找到它。我根据自己的需要写了一个。

source: If you rather like a function for use this technique by handling <code>fgets</code> output strings in general without retyping each and every time, here is <code>fgets_newline_kill</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">毎回再入力せずに一般に</font></font> <code>fgets</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力文字列を</font><font style="vertical-align: inherit;">処理することにより、この手法を使用する関数が好きな場合</font><font style="vertical-align: inherit;">は、</font></font> <code>fgets_newline_kill</code> を次に示し<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매번 다시 입력하지 않고 일반적으로 </font></font> <code>fgets</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 출력 문자열 </font><font style="vertical-align: inherit;">을 처리하여이 기술을 사용하는 함수를 </font></font> <code>fgets_newline_kill</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 </font><font style="vertical-align: inherit;">은 </font><font style="vertical-align: inherit;">fgets_newline_kill입니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы предпочитаете использовать функцию для этой техники, обрабатывая </font><font style="vertical-align: inherit;">выходные строки </font></font> <code>fgets</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в целом, не вводя каждый раз </font></font> <code>fgets_newline_kill</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вот </font><font style="vertical-align: inherit;">fgets_newline_kill</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您更喜欢通过处理</font></font> <code>fgets</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出字符串而无需每次都重新键入的方式</font><font style="vertical-align: inherit;">来使用此技术</font><font style="vertical-align: inherit;">，那么这里是</font></font> <code>fgets_newline_kill</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: If you want it to also handle <code>'\r'</code> (say, if the stream is binary):
ja: <font style="vertical-align: inherit;"></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も処理したい場合</font><font style="vertical-align: inherit;">（たとえば、ストリームがバイナリの場合）：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 처리하려면 </font><font style="vertical-align: inherit;">(예 : 스트림이 이진 인 경우) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите, чтобы он также обрабатывал </font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (скажем, если поток двоичный):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您还希望它也处理</font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（例如，如果流是二进制的）：</font></font>
