Repository: rueisnom/feedback
Catalog: xlf/26/93/77/6/2693776.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: In your provided example, it would be:
ja: あなたが提供した例では、それは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제공된 예에서 다음과 같습니다.</font></font>
ru: В приведенном вами примере:
zh_cn: 在你提供的例子中,它将是:

source: It uses <code>strlen()</code>, with 2 tests.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2つのテストで</font></font> <code>strlen()</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하여 두 가지 테스트를 수행합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он использует </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , с 2 тестами.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它使用</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并进行了2次测试。</font></font>

source: Look if the string begins with or only includes one <code>\0</code> character (empty string). In this case <code>sl</code> would be <code>0</code> since <code>strlen()</code> as I said above doesn&acute;t count the <code>\0</code> and stops at the first occurrence of it:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列が</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字（空の文字列）で</font><font style="vertical-align: inherit;">始まるか、または1つだけ含まれているかどうかを確認します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この場合、</font></font> <code>sl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なり</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は上記のdoesn'tカウント言ったように</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：し、それが最初に発生で停止し</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열이 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자로 </font><font style="vertical-align: inherit;">시작하거나 하나만 포함하는지 확인하십시오 </font><font style="vertical-align: inherit;">(빈 문자열). </font><font style="vertical-align: inherit;">이 경우에 </font></font> <code>sl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것이다 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이후 </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> I 위 나던가 카운트 말했듯 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 처음 나타나는 정차 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Посмотрите, начинается ли строка с или содержит только один </font><font style="vertical-align: inherit;">символ </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (пустая строка). </font><font style="vertical-align: inherit;">В этом случае </font></font> <code>sl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет </font></font> <code>0</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> так как </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как я сказал выше, не считает </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и останавливается при его первом появлении:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查看字符串是否以开头或仅包含一个</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符（空字符串）。</font><font style="vertical-align: inherit;">在这种情况下，</font></font> <code>sl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将为</font></font> <code>0</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font><font style="vertical-align: inherit;">如上所述，</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不会计算</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并在第一次出现时停止：</font></font>

source: My Newbie way ;-) Please let me know if that's correct. It seems to be working for all my cases:
ja: 私の初心者道 ;-)正しいかどうか教えてください。私の場合は全てのケースでうまくいっているようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 초보자 방법 ;-) 그것이 올바른지 알려주십시오. </font><font style="vertical-align: inherit;">내 모든 경우에 효과가있는 것 같습니다.</font></font>
ru: Мой путь новичка ;-)Пожалуйста,дайте мне знать,если это правильно.Похоже,это работает на все мои дела:
zh_cn: 我的新手方式;--)请让我知道是否正确。看来我所有的情况都是这样的。

source: Note if you only pressed Enter at the <code>fgets()</code> string request (the string content was only consisted of a newline character) the string in <code>NAME</code> will be an empty string thereafter.
ja: <font style="vertical-align: inherit;"></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列リクエストで</font><font style="vertical-align: inherit;">Enterキーのみを押した場合</font><font style="vertical-align: inherit;">（文字列の内容は改行文字のみで構成されていました）、</font></font> <code>NAME</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列はその後空の文字列になります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자열 요청 </font><font style="vertical-align: inherit;">에서 Enter 만 누른 경우 </font><font style="vertical-align: inherit;">(문자열 내용은 개행 문자로만 구성됨) </font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 문자열은 </font><font style="vertical-align: inherit;">이후 빈 문자열이됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что если вы только нажали Enter при </font><font style="vertical-align: inherit;">запросе строки </font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (содержимое строки состояло только из символа новой строки), строка в </font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> после этого будет пустой строкой.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，如果仅在</font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符串请求中</font><font style="vertical-align: inherit;">按Enter键</font><font style="vertical-align: inherit;">（字符串内容仅由换行符组成），则</font></font> <code>NAME</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中的字符串此后将为空字符串。</font></font>

source: Note that the <code>strtok</code> function doesn't work as expected if the user enters an empty string (i.e. presses only Enter). It leaves the <code>\n</code> character intact.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザーが空の文字列を入力した場合（つまり、Enterキーのみを押した場合）</font><font style="vertical-align: inherit;">、</font></font> <code>strtok</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数は期待どおりに機能しない</font><font style="vertical-align: inherit;">ことに注意して</font><font style="vertical-align: inherit;">ください。</font><font style="vertical-align: inherit;">これは、葉</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の文字はそのまま。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다 </font></font> <code>strtok</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자가 빈 문자열을 입력하면 (예 : 프레스 만 입력) 예상대로 기능이 작동을하지 않습니다. </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자는 그대로 </font><font style="vertical-align: inherit;">둡니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font><font style="vertical-align: inherit;">функция </font></font> <code>strtok</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не работает должным образом, если пользователь вводит пустую строку (т.е. нажимает только Enter). </font><font style="vertical-align: inherit;">Он оставляет </font><font style="vertical-align: inherit;">символ </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> без изменений.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，</font><font style="vertical-align: inherit;">如果用户输入一个空字符串（即仅按Enter）</font><font style="vertical-align: inherit;">，则</font></font> <code>strtok</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数将无法正常工作。</font><font style="vertical-align: inherit;">它的叶子</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符不变。</font></font>

source: Note that this method does not work if the input string has embedded <code>\0</code>s in it. If that would be the case <code>strlen()</code> would only return the amount of characters until the first <code>\0</code>. But this isn&acute;t quite a common approach, since the most string-reading functions usually stop at the first <code>\0</code> and take the string until that null character.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">入力文字列に</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が埋め込まれている場合、このメソッドは機能しないことに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">その場合、</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初の</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">までの文字数のみを返し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">しかし、これは一般的なアプローチではありません。ほとんどの文字列読み取り関数は通常、最初の</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で停止し、</font><font style="vertical-align: inherit;">そのnull文字まで文字列を取得します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력 문자열에 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 포함되어 있으면이 방법이 작동하지 않습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 경우 </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 첫 번째 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 까지 문자 수만 반환합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 대부분의 문자열 읽기 기능은 일반적으로 첫 번째 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 멈추고 </font><font style="vertical-align: inherit;">해당 null 문자까지 문자열을 가져 오기 </font><font style="vertical-align: inherit;">때문에 이것은 일반적인 접근 방식이 </font><font style="vertical-align: inherit;">아닙니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что этот метод не работает, если во входной строке есть </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s. </font><font style="vertical-align: inherit;">В этом случае </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет возвращать только количество символов до первого </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но это не совсем обычный подход, так как большинство функций чтения строк обычно останавливаются на первом </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и принимают строку до нулевого символа.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，如果输入字符串中嵌入</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则此方法无效</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样，</font><font style="vertical-align: inherit;">strlen（）</font><font style="vertical-align: inherit;">只会返回直到第一个</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为止的字符</font><font style="vertical-align: inherit;">数</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但这不是一种很常见的方法，因为大多数读取字符串的函数通常在第一个</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处停止，</font><font style="vertical-align: inherit;">然后将字符串取出，直到该空字符为止。</font></font>

source: Note that this works fine even if there is no newline, because <code>strcspn</code> stops at a <code>'\0'</code>. In that case, the entire line is simply replacing <code>'\0'</code> with <code>'\0'</code>.
ja: <font style="vertical-align: inherit;"></font> <code>strcspn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">停止する</font><font style="vertical-align: inherit;">ため、改行がなくてもこれは正常に機能することに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">その場合、行全体が単に</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">置き換えてい</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>strcspn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 중지 </font><font style="vertical-align: inherit;">하기 때문에 줄 바꿈이 없어도 </font><font style="vertical-align: inherit;">제대로</font><font style="vertical-align: inherit;"> 작동합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 경우 전체 행은 단순히 </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 바꾸는 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что это работает нормально, даже если нет новой строки, потому что </font></font> <code>strcspn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> останавливается на </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В этом случае вся строка просто заменяет </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，即使没有换行符，它也可以正常工作，因为</font></font> <code>strcspn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">停在</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这种情况下，整行只需将</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">替换</font><font style="vertical-align: inherit;">为</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Note that you are comparing characters and not strings in this line, then there's no need to use strcmp():
ja: この行では文字列ではなく文字を比較していることに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 줄에서 문자열이 아닌 문자를 비교하는 경우 strcmp ()를 사용할 필요가 없습니다.</font></font>
ru: Обратите внимание,что вы сравниваете символы,а не строки в этой строке,тогда нет необходимости использовать strcmp():
zh_cn: 注意,你在这一行中比较的是字符而不是字符串,那么就没有必要使用strcmp()。

source: Now use <code>buffer</code> and <code>len</code> as needed.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に</font><font style="vertical-align: inherit;">、必要に応じて</font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 </font><font style="vertical-align: inherit;">필요에 따라 </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь используйте </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>len</code> по<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мере необходимости.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在</font><font style="vertical-align: inherit;">根据需要</font><font style="vertical-align: inherit;">使用</font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Perhaps the simplest solution uses one of my favorite little-known functions, <a href="http://www.freebsd.org/cgi/man.cgi?query=strcspn&amp;sektion=3"><code>strcspn()</code></a>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おそらく最も簡単な解決策は、私のお気に入りのあまり知られていない関数の1つである</font></font><a href="http://www.freebsd.org/cgi/man.cgi?query=strcspn&amp;sektion=3"> <code>strcspn()</code> を使用すること</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 가장 간단한 해결책은 내가 가장 좋아하는 작은 함수 </font></font><a href="http://www.freebsd.org/cgi/man.cgi?query=strcspn&amp;sektion=3"> <code>strcspn()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 중 하나를 사용하는 것입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Возможно, самое простое решение использует одну из моих любимых малоизвестных функций </font></font><a href="http://www.freebsd.org/cgi/man.cgi?query=strcspn&amp;sektion=3"> <code>strcspn()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也许最简单的解决方案使用了我最喜欢的鲜为人知的函数之一</font></font><a href="http://www.freebsd.org/cgi/man.cgi?query=strcspn&amp;sektion=3"> <code>strcspn()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Removing trailing newline character from fgets() input
ja: fgets()の入力から末尾の改行文字を削除する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fgets () 입력에서 후행 줄 바꿈 문자 제거</font></font>
ru: Удаление символа новой строки из входа fgets()
zh_cn: 删除fgets()输入中的拖尾换行字符

source: Some other answers' issues:
ja: 他にもいくつかの回答の問題があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 답변의 문제 :</font></font>
ru: Проблемы с некоторыми другими ответами:
zh_cn: 一些其他答案的问题。

source: The finished code:
ja: 完成したコード。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">완성 된 코드 :</font></font>
ru: Готовый код:
zh_cn: 完成的代码。
