Repository: rueisnom/feedback
Catalog: xlf/26/93/77/6/2693776.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The following fails on rare occasions when the first <code>char</code> read by <code>fgets()</code> is <code>'\0'</code>. This happens when input begins with an embedded <code>'\0'</code>. Then <code>buffer[len -1]</code> becomes <code>buffer[SIZE_MAX]</code> accessing memory certainly outside the legitimate range of <code>buffer</code>. Something a hacker may try or found in foolishly reading UTF16 text files. This was the state of an <a href="https://stackoverflow.com/a/2693827/2410359">answer</a> when this answer was written. Later a non-OP edited it to include code like this answer's check for <code>""</code>.
ja: <font style="vertical-align: inherit;"> <code>fgets()</code> <font style="vertical-align: inherit;">によって読み取られ</font><font style="vertical-align: inherit;">た最初の</font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font> <code>'\0'</code> <font style="vertical-align: inherit;">場合、まれに以下が失敗します</font><font style="vertical-align: inherit;">。これは、入力が埋め込まれた</font> <code>'\0'</code> <font style="vertical-align: inherit;">始まる場合に発生します</font><font style="vertical-align: inherit;">。次に、</font> <code>buffer[len -1]</code> <font style="vertical-align: inherit;">は</font> <code>buffer[SIZE_MAX]</code> <font style="vertical-align: inherit;">]に</font><font style="vertical-align: inherit;">なり</font><font style="vertical-align: inherit;">、確実に</font> <code>buffer</code> の<font style="vertical-align: inherit;">正当な範囲外にあるメモリにアクセスします</font><font style="vertical-align: inherit;">。ハッカーがUTF16テキストファイルを愚かに読んでみたり見つけたりするかもしれない何か。これは、</font><font style="vertical-align: inherit;">この答えが書かれたとき</font><font style="vertical-align: inherit;">の</font><a href="https://stackoverflow.com/a/2693827/2410359"><font style="vertical-align: inherit;">答え</font></a><font style="vertical-align: inherit;">の状態でした</font><font style="vertical-align: inherit;">。その後、非OPがそれを編集して、この回答の</font> <code>""</code> <font style="vertical-align: inherit;">のチェックのようなコードを含めました</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>fgets()</code> <font style="vertical-align: inherit;"> 의해 읽힌 </font><font style="vertical-align: inherit;">첫 번째 </font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font> <code>'\0'</code> <font style="vertical-align: inherit;"> 경우는 드물지만 다음과 같이 실패합니다 </font><font style="vertical-align: inherit;">. 입력이 포함 된 </font> <code>'\0'</code> <font style="vertical-align: inherit;"> 시작할 때 발생합니다 </font><font style="vertical-align: inherit;">. 그런 다음 </font> <code>buffer[len -1]</code> <font style="vertical-align: inherit;"> 은 </font><font style="vertical-align: inherit;">합법적 인 </font> <code>buffer</code> <font style="vertical-align: inherit;"> 범위를 벗어난 메모리에 액세스하는 </font> <code>buffer[SIZE_MAX]</code> <font style="vertical-align: inherit;">]</font><font style="vertical-align: inherit;"> 가됩니다 </font><font style="vertical-align: inherit;">. 해커가 UTF16 텍스트 파일을 어리석게 읽을 때 시도하거나 발견 할 수있는 것. 이 </font><font style="vertical-align: inherit;">답변이 작성되었을 때 </font><font style="vertical-align: inherit;">의 </font><a href="https://stackoverflow.com/a/2693827/2410359"><font style="vertical-align: inherit;">답변</font></a><font style="vertical-align: inherit;"> 상태입니다 </font><font style="vertical-align: inherit;">. 나중에 비 OP 가이 답변의 </font> <code>""</code> <font style="vertical-align: inherit;"> 검사와 같은 코드를 포함하도록 편집했습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В редких случаях происходит сбой, когда первый </font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> читаемый </font></font> <code>fgets()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равен </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Это происходит, когда ввод начинается со встроенного </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Затем </font></font> <code>buffer[len -1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> становится </font></font> <code>buffer[SIZE_MAX]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обращаясь к памяти, безусловно, вне допустимого диапазона </font></font> <code>buffer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Что-то хакер может попробовать или найти в глупом чтении текстовых файлов UTF16. Это было состояние </font></font><a href="https://stackoverflow.com/a/2693827/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответа,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> когда этот ответ был написан. Позже , </font><font style="vertical-align: inherit;">не ОП отредактировали включить подобный код проверки Ответ на </font><font style="vertical-align: inherit;">этот вопрос для </font></font> <code>""</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当</font> <code>fgets()</code> <font style="vertical-align: inherit;">读取</font><font style="vertical-align: inherit;">的第一个</font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为</font> <code>'\0'</code> <font style="vertical-align: inherit;">时，以下情况在少数情况下会失败</font><font style="vertical-align: inherit;">。当输入以嵌入式</font> <code>'\0'</code> <font style="vertical-align: inherit;">开头时，就会发生这种情况</font><font style="vertical-align: inherit;">。然后，</font> <code>buffer[len -1]</code> <font style="vertical-align: inherit;">成为</font><font style="vertical-align: inherit;">肯定在</font> <code>buffer</code> <font style="vertical-align: inherit;">合法范围之外访问内存的</font> <code>buffer[SIZE_MAX]</code> <font style="vertical-align: inherit;">。黑客在愚蠢地读取UTF16文本文件时可能尝试或发现的某些东西。这</font><font style="vertical-align: inherit;">是写</font><a href="https://stackoverflow.com/a/2693827/2410359"><font style="vertical-align: inherit;">答案</font></a><font style="vertical-align: inherit;">时</font><font style="vertical-align: inherit;">的状态</font><font style="vertical-align: inherit;">。后来，一个非OP对其进行了编辑，以包含此答案的</font> <code>""</code> <font style="vertical-align: inherit;">检查之类的代码</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: The function below is a part of string processing library I am maintaining on Github. It removes and unwanted characters from a string, exactly what you want
ja: 以下の関数は、私がGithubで管理している文字列処理ライブラリの一部です。文字列から不要な文字を削除してくれます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 함수는 Github에서 유지 관리하는 문자열 처리 라이브러리의 일부입니다. </font><font style="vertical-align: inherit;">정확하게 원하는 문자열을 제거하고 원하지 않는 문자를 제거합니다.</font></font>
ru: Функция,приведенная ниже,является частью библиотеки обработки строк,которую я поддерживаю на Github.Она удаляет из строки нежелательные символы,именно то,что вы хотите.
zh_cn: 下面这个函数是我在Github上维护的字符串处理库的一部分。它可以从字符串中删除不需要的字符,这正是你想要的。

source: The function counts the number of characters until it hits a <code>'\r'</code> or a <code>'\n'</code> (in other words, it finds the first <code>'\r'</code> or <code>'\n'</code>). If it doesn't hit anything, it stops at the <code>'\0'</code> (returning the length of the string).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この関数は、</font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到達</font><font style="vertical-align: inherit;">するまで文字数をカウントし</font><font style="vertical-align: inherit;">ます（つまり、最初の</font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つけます</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">何もヒットしない場合は、</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で停止します</font><font style="vertical-align: inherit;">（文字列の長さを返します）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 함수는 </font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도달 할 때까지 문자 수를 계산합니다 </font><font style="vertical-align: inherit;">(즉, 첫 번째 </font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 찾습니다 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">아무 것도 맞지 않으면 </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 멈 춥니 다 </font><font style="vertical-align: inherit;">(문자열 길이를 반환).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Функция считает количество символов до тех пор, пока не достигнет </font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (другими словами, она находит первые </font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Если он ничего не ударил, он останавливается на </font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (возвращая длину строки).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该函数对字符数进行计数，直到达到</font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为止</font><font style="vertical-align: inherit;">（换句话说，它找到第一个</font></font> <code>'\r'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>'\n'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">如果没有击中任何内容，它将在</font></font> <code>'\0'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处停止</font><font style="vertical-align: inherit;">（返回字符串的长度）。</font></font>

source: The slightly strange way:
ja: ちょっと変わった方法。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">약간 이상한 방법 :</font></font>
ru: Немного странным образом:
zh_cn: 略显奇怪的方式。

source: The slightly ugly way:
ja: ちょっと不細工な方法。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">약간 못생긴 방법 :</font></font>
ru: Слегка уродливый способ:
zh_cn: 略显丑陋的方式。

source: The steps to remove the newline character in the perhaps most obvious way:
ja: おそらく最もわかりやすい方法で改行文字を削除する手順です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 분명한 방법으로 개행 문자를 제거하는 단계 :</font></font>
ru: Шаги по удалению символа новой строки,возможно,самым очевидным образом:
zh_cn: 用也许是最明显的方法去掉换行字的步骤。

source: The strrcspn function:
ja: strrcspn関数です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">strrcspn 함수 :</font></font>
ru: Функция strrcspn:
zh_cn: strrcspn函数。

source: There are others as well, of course.
ja: もちろん他にもあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 다른 것도 있습니다.</font></font>
ru: Конечно,есть и другие.
zh_cn: 当然,还有其他的也有。

source: This method has the side benefit of a <code>len</code> value for subsequent code. It can be easily faster than <code>strchr(Name, '\n')</code>. <a href="https://codereview.stackexchange.com/a/67844/29485">Ref</a> YMMV, but both methods work.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このメソッドには、</font><font style="vertical-align: inherit;">後続のコードで</font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値を使用</font><font style="vertical-align: inherit;">するという副次的な利点があり</font><font style="vertical-align: inherit;">ます。</font></font> <code>strchr(Name, '\n')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも簡単に高速化できます</font><font style="vertical-align: inherit;">。 </font><font style="vertical-align: inherit;"> YMMVを</font></font><a href="https://codereview.stackexchange.com/a/67844/29485"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照し</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ますが、どちらの方法でも機能します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법은 </font><font style="vertical-align: inherit;">후속 코드 </font><font style="vertical-align: inherit;">에 대한 </font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값 </font><font style="vertical-align: inherit;">의 부작용이 </font><font style="vertical-align: inherit;">있습니다. </font></font> <code>strchr(Name, '\n')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 쉽게 ​​빠를 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;"> YMMV를 </font></font><a href="https://codereview.stackexchange.com/a/67844/29485"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하지만 두 방법 모두 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот метод имеет побочное преимущество значения </font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для последующего кода. </font><font style="vertical-align: inherit;">Это может быть легко быстрее, чем </font></font> <code>strchr(Name, '\n')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><a href="https://codereview.stackexchange.com/a/67844/29485"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Реф</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> YMMV, но оба метода работают.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此方法的附带好处是</font><font style="vertical-align: inherit;">后续代码</font><font style="vertical-align: inherit;">的</font></font> <code>len</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值。</font><font style="vertical-align: inherit;">它可以比</font></font> <code>strchr(Name, '\n')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更快</font><font style="vertical-align: inherit;">。 </font></font><a href="https://codereview.stackexchange.com/a/67844/29485"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> YMMV，但是两种方法都可以。</font></font>

source: Tim Čas one liner is amazing for strings obtained by a call to fgets, because you know they contain a single newline at the end.
ja: Tim Čas のワンライナーは、fgets の呼び出しで得られた文字列に対して素晴らしいものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tim Čas 하나의 라이너는 fgets 호출로 얻은 문자열에 놀랍습니다. 마지막에 줄 바꿈이 하나 포함되어 있기 때문입니다.</font></font>
ru: Тим Час один лайнер удивительно для строк,полученных вызовом к fgets,потому что вы знаете,что они содержат одну новую строку в конце.
zh_cn: Tim Čas的单行线对于通过调用fgets获得的字符串来说是很神奇的,因为你知道它们在结尾处包含一个单行线。

source: Try this one:
ja: これを試してみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이걸로 해봐:</font></font>
ru: Попробуй вот это:
zh_cn: 试试这个。

source: We can combine step 2. and 3. together in just one <code>if</code>-statement by using the logic operator <code>&amp;&amp;</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私達はちょうど1で一緒にステップ2と3を組み合わせることができます</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、論理演算子を使って-statement </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">논리 연산자 </font> <code>&amp;&amp;</code> 를<font style="vertical-align: inherit;"> 사용하여 </font><font style="vertical-align: inherit;">2 단계와 3 단계를 하나의 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문으로 </font><font style="vertical-align: inherit;">결합 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы можем объединить шаг 2. и 3. вместе только один , </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -statement с помощью логического оператора </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以在短短的一个结合在一起步骤2和3 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用逻辑运算符语句来</font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: You may want to check other available functions, or even contribute to the project :) <a href="https://github.com/fnoyanisi/zString">https://github.com/fnoyanisi/zString</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の利用可能な機能をチェックしたり、プロジェクトに貢献したりすることもできます:) </font></font><a href="https://github.com/fnoyanisi/zString"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/fnoyanisi/zString</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 가능한 다른 기능을 확인하거나 프로젝트에 기여할 수도 있습니다 :) </font></font><a href="https://github.com/fnoyanisi/zString"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/fnoyanisi/zString</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете проверить другие доступные функции или даже внести свой вклад в проект :) </font></font><a href="https://github.com/fnoyanisi/zString"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/fnoyanisi/zString</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可能要检查其他可用功能，甚至对项目有所帮助：） </font></font><a href="https://github.com/fnoyanisi/zString"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/fnoyanisi/zString</font></font></a>

source: You should give it a try. This code basically loop through the string until it finds the '\n'. When it's found the '\n' will be replaced by the null character terminator '\0'
ja: 試してみてください。このコードは、基本的に、文字列をループして、'\n'を見つけるまで。When it's found the 'ann' will be replaced by the null character terminator '\0'
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 그것을 시도해야합니다. </font><font style="vertical-align: inherit;">이 코드는 기본적으로 '\ n'을 찾을 때까지 문자열을 반복합니다. </font><font style="vertical-align: inherit;">발견되면 '\ n'은 널 문자 종결 자 '\ 0'으로 대체됩니다.</font></font>
ru: Тебе стоит попробовать.Этот код в основном циклически проходит через строку,пока не найдет '\n'.Когда он найдет '\n' будет заменен на нулевой символьный терминатор '\0'.
zh_cn: 你应该试一试。这段代码基本上是在字符串中循环,直到找到'\n'。当它找到后,'\n'将被空字符结束符'\0'取代。
