Repository: rueisnom/feedback
Catalog: xlf/26/93/77/6/2693776.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: [Edit due to good later <a href="https://stackoverflow.com/a/28462221/2410359">answer</a>] There are no problems with the 1 liner <code>buffer[strcspn(buffer, "\n")] = 0;</code> other than performance as compared to the <code>strlen()</code> approach. Performance in trimming is usually not an issue given code is doing I/O - a black hole of CPU time. Should following code need the string's length or is highly performance conscious, use this <code>strlen()</code> approach. Else the <code>strcspn()</code> is a fine alternative.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[後で良い</font></font><a href="https://stackoverflow.com/a/28462221/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答えの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ために編集</font><font style="vertical-align: inherit;">] 1ライナー</font></font> <code>buffer[strcspn(buffer, "\n")] = 0;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題はありません</font><font style="vertical-align: inherit;">。</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプローチ</font><font style="vertical-align: inherit;">と比較した場合のパフォーマンス以外</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">コードがI / Oを実行している場合、トリミングのパフォーマンスは通常、問題ではありません-CPU時間のブラックホール。</font><font style="vertical-align: inherit;">次のコードで文字列の長さが必要な場合、またはパフォーマンスを重視する場合は、この</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプローチを使用してください。</font><font style="vertical-align: inherit;">それ以外の場合、</font></font> <code>strcspn()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は優れた代替手段です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[나중에 좋은 </font></font><a href="https://stackoverflow.com/a/28462221/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 편집 </font><font style="vertical-align: inherit;">] 1 라이너 </font></font> <code>buffer[strcspn(buffer, "\n")] = 0;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문제가 없습니다 </font><font style="vertical-align: inherit;">[strcspn (buffer, "\ n")] = 0; </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 접근 방식 </font><font style="vertical-align: inherit;">과 비교하여 성능 이외의 것 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">트리밍 성능은 일반적으로 코드가 I / O를 수행 할 때 문제가되지 않습니다. CPU 시간의 블랙홀입니다. </font><font style="vertical-align: inherit;">다음 코드에서 문자열의 길이가 필요하거나 성능을 높이려면이 </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법을 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그렇지 않으면 </font></font> <code>strcspn()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 훌륭한 대안이다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[Изменить из-за хорошего последующего </font></font><a href="https://stackoverflow.com/a/28462221/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответа</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] Нет проблем с </font></font> <code>buffer[strcspn(buffer, "\n")] = 0;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с 1 вкладышем </font><font style="vertical-align: inherit;">[strcspn (buffer, "\ n")] = 0; </font><font style="vertical-align: inherit;">кроме производительности по сравнению с </font><font style="vertical-align: inherit;">подходом </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Производительность при обрезке обычно не является проблемой, учитывая, что код выполняет ввод-вывод - черная дыра процессорного времени. </font><font style="vertical-align: inherit;">Если следующий код нуждается в длине строки или имеет высокую производительность, используйте этот </font><font style="vertical-align: inherit;">подход </font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Иначе </font></font> <code>strcspn()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является прекрасной альтернативой.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[由于稍后的</font></font><a href="https://stackoverflow.com/a/28462221/2410359"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答复，请进行</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑</font><font style="vertical-align: inherit;">] 1衬里</font></font> <code>buffer[strcspn(buffer, "\n")] = 0;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有任何问题</font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">与性能（与</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">相比</font><font style="vertical-align: inherit;">）不同</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果代码正在执行I / O，则修剪性能通常不是问题，这是CPU时间的黑洞。</font><font style="vertical-align: inherit;">如果以下代码需要字符串的长度或对性能有高度的了解，请使用此</font></font> <code>strlen()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">否则，</font></font> <code>strcspn()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个很好的选择。</font></font>

source: for multiple '\n' trimming,
ja: を使って、複数の'\n'トリミングを行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 개의 '\ n'트리밍의 경우</font></font>
ru: для множественной обрезки '\n',
zh_cn: 对于多个"\n "的修剪。

source: since you will be using single quotes and not double quotes. <a href="https://stackoverflow.com/questions/3683602/single-quotes-vs-double-quotes-in-c-or-c">Here's</a> a link about single vs double quotes if you want to know more
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">二重引用符ではなく単一引用符を使用するためです。</font></font><a href="https://stackoverflow.com/questions/3683602/single-quotes-vs-double-quotes-in-c-or-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">については、シングルクォートとダブルクォートのリンクをご覧ください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">큰 따옴표가 아닌 작은 따옴표를 사용하기 때문입니다. </font></font><a href="https://stackoverflow.com/questions/3683602/single-quotes-vs-double-quotes-in-c-or-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 더 많은 것을 알고 싶은 경우에 큰 따옴표 대 싱글에 대한 링크</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">так как вы будете использовать одинарные кавычки, а не двойные кавычки. </font></font><a href="https://stackoverflow.com/questions/3683602/single-quotes-vs-double-quotes-in-c-or-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылка на одиночные и двойные кавычки, если вы хотите узнать больше</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为您将使用单引号而不是双引号。</font><font style="vertical-align: inherit;">如果您想了解更多，</font></font><a href="https://stackoverflow.com/questions/3683602/single-quotes-vs-double-quotes-in-c-or-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里是</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">单引号和双引号的链接</font></font>
