Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It is necessary to refer to a class element using <code>self</code>, and refer to an object element using <code>$this</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es necesario referirse a un elemento de clase usando </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y referirse a un elemento objeto usando </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してクラス要素を</font><font style="vertical-align: inherit;">参照し、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してオブジェクト要素を参照する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>self</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 클래스 요소를 </font><font style="vertical-align: inherit;">참조하고 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 객체 요소를 참조해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Необходимо сослаться на элемент класса, используя </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и сослаться на элемент объекта, используя </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有必要使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来引用类元素</font><font style="vertical-align: inherit;">，并使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来引用对象元素</font><font style="vertical-align: inherit;">。</font></font>

source: It's <em>extremely</em> important to note that when we do this <strong>from outside</strong>, the object's instance is hidden from the <code>bar()</code> method. Meaning that it's the exact same as running:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">extremadamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> importante tener en cuenta que cuando hacemos esto </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">desde afuera</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la instancia del objeto se oculta del </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Lo que significa que es exactamente lo mismo que correr:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それはだ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我々はこれを行う際に注意することが重要</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外側から</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、オブジェクトのインスタンスがから隠されている</font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド。</font><font style="vertical-align: inherit;">それは実行とまったく同じであることを意味します：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은이다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 우리는이 작업을 수행 할 때주의하는 것이 중요 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부에서</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 객체의 인스턴스가 숨겨져 </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법. </font><font style="vertical-align: inherit;">그것은 달리기와 정확히 동일하다는 것을 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чрезвычайно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> важно отметить , </font><font style="vertical-align: inherit;">что , </font><font style="vertical-align: inherit;">когда мы делаем это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">снаружи</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , экземпляр объекта скрыт от </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> метода. </font><font style="vertical-align: inherit;">Это означает, что это точно так же, как бег:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要注意的是，我们这样做时，重要的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来自外部</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的对象的实例从隐藏</font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">这意味着它与运行完全相同：</font></font>

source: It's <em>very</em> important to note that the <em>class</em> is a static structure. Which means that the class <code>Person</code>, once defined, is always the same everywhere you look at it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">muy</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> importante tener en cuenta que la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una estructura est&aacute;tica. </font><font style="vertical-align: inherit;">Lo que significa que la clase </font></font> <code>Person</code> a<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , una vez definida, siempre es la misma en todas partes donde la miras.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それはだ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことに注意することが重要な</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的な構造です。</font><font style="vertical-align: inherit;">つまり、</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは</font><font style="vertical-align: inherit;">、一度定義されると、どこを見ても常に同じです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은이다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 것이 중요 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스는</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정적 구조입니다. </font><font style="vertical-align: inherit;">즉, </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 </font><font style="vertical-align: inherit;">는 일단 정의되면 항상 어디에서나 동일하다는 것을 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">очень</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> важно отметить , </font><font style="vertical-align: inherit;">что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">класс</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является статической структурой. </font><font style="vertical-align: inherit;">Это означает, что класс </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , когда-то определенный, всегда одинаков везде, где бы вы ни смотрели.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值得注意的是，重要的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是静态结构。</font><font style="vertical-align: inherit;">这意味着</font><font style="vertical-align: inherit;">一旦定义</font><font style="vertical-align: inherit;">了</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">，无论您在</font><font style="vertical-align: inherit;">哪里</font><font style="vertical-align: inherit;">查看，它始终是相同的。</font></font>

source: It's important to note that calling <code>Person-&gt;foo</code> does not make sense (since <code>Person</code> is a class, not an instance). Therefore, that is a parse error.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es importante tener en cuenta que llamar a </font></font> <code>Person-&gt;foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no tiene sentido (ya que </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una clase, no una instancia). </font><font style="vertical-align: inherit;">Por lo tanto, eso es un error de an&aacute;lisis.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Person-&gt;foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出し</font><font style="vertical-align: inherit;">ても意味がないこと</font><font style="vertical-align: inherit;">に注意してください</font><font style="vertical-align: inherit;">（</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はインスタンスではなくクラスであるため）。</font><font style="vertical-align: inherit;">したがって、これは解析エラーです。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Person-&gt;foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 호출하는 </font><font style="vertical-align: inherit;">것은 의미가 없습니다 ( </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 클래스가 아니기 때문에 클래스가 아니므로). </font><font style="vertical-align: inherit;">따라서 구문 분석 오류입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Важно отметить, что вызов </font></font> <code>Person-&gt;foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не имеет смысла (поскольку </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это класс, а не экземпляр). </font><font style="vertical-align: inherit;">Следовательно, это ошибка разбора.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重要的是要注意，调用</font></font> <code>Person-&gt;foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有任何意义（因为</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个类，而不是实例）。</font><font style="vertical-align: inherit;">因此，这是一个解析错误。</font></font>

source: Just as objects have constructors, they also have destructors, which are executed when the object dies or is unset:
es: Así como los objetos tienen constructores,también tienen destructores,que se ejecutan cuando el objeto muere o se desestabiliza:
ja: オブジェクトにコンストラクタがあるように、オブジェクトにもデストラクタがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체에 생성자가있는 것처럼 객체도 죽거나 설정이 해제 될 때 실행되는 소멸자가 있습니다.</font></font>
ru: Подобно тому,как объекты имеют конструкторы,они также имеют деструкторы,которые выполняются,когда объект умирает или отменяется:
zh_cn: 就像对象有构造函数一样,它们也有破坏函数,当对象死亡或被取消设置时,破坏函数会被执行。

source: Let's start off by talking about what a <em>class</em> and an <em>object</em> is.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Comencemos hablando de qu&eacute; es una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">objeto</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">何であるかについて話すことから始めましょう</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">무엇인지 이야기하면서 시작하겠습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Давайте начнем с разговора о том, что такое </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">класс</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">объект</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">让我们从谈论</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象开始</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Make sense? Didn't think so. It's confusing.
es: ¿Tiene sentido? No lo creo.Es confuso.
ja: 意味があるのか?そうは思わなかった 混乱してる
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">말이 되나요? </font><font style="vertical-align: inherit;">그렇게 생각하지 않았다. </font><font style="vertical-align: inherit;">혼란 스럽습니다.</font></font>
ru: В этом есть смысл? Не думаю.Это сбивает с толку.
zh_cn: 说得通吗?我不觉得有道理。真让人困惑。

source: Most of the time you want to refer to the current class which is why you use <code>static</code> or <code>$this</code>. However, there are times when you <em>need</em><code>self</code> because you want the original class regardless of what extends it. (Very, Very seldom)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La mayor&iacute;a de las veces desea referirse a la clase actual, raz&oacute;n por la cual usa </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Sin embargo, hay momentos en los que </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">necesita </font></font></em> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> porque desea la clase original independientemente de lo que la extienda. </font><font style="vertical-align: inherit;">(Muy, muy raramente)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ほとんどの場合、現在のクラスを参照する必要があるため、</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、</font><font style="vertical-align: inherit;">何を拡張するかに関係なく、元のクラス</font><font style="vertical-align: inherit;">が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要</font></font></em> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ため、</font><font style="vertical-align: inherit;">自己</font><font style="vertical-align: inherit;">が</font><em><font style="vertical-align: inherit;">必要になる</font></em><font style="vertical-align: inherit;">場合が</font><em><font style="vertical-align: inherit;">あり</font></em><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">（とても、めったにない）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 경우 현재 클래스를 참조하려는 이유는 </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 이유 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">무엇을 확장하든 원래의 수업을 원하기 때문에 </font> <code>self</code> <font style="vertical-align: inherit;"> 이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필요할</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때가 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">(매우 드물게)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В большинстве случаев вы хотите сослаться на текущий класс, поэтому вы используете </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Однако бывают случаи, когда вам </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нужен </font></font></em> <code>self</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> потому что вы хотите оригинальный класс независимо от того, что его расширяет. </font><font style="vertical-align: inherit;">(Очень, очень редко)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大多数情况下，您想引用当前类，这就是为什么要使用</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，有时您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要</font></font></em> <code>self</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为您想要原始类，而不管它的扩展如何。</font><font style="vertical-align: inherit;">（非常，很少）</font></font>

source: Note that static methods and properties are shared by everyone. That makes them basically global variables. With all the same problems that come with globals. So I would be really hesitant to store information in static methods/properties unless you're comfortable with it being truly global.
es: Tenga en cuenta que los métodos y propiedades estáticas son compartidos por todos.Eso los hace básicamente variables globales.Con todos los mismos problemas que vienen con los globales.Así que yo dudaría mucho en almacenar información en propiedades estáticas de métodos a menos que te sientas cómodo con que sea realmente global.
ja: 静的なメソッドとプロパティは全員で共有されていることに注意してください。つまり、基本的にはグローバル変数になります。グローバルと同じ問題を抱えています。ですから、真のグローバル変数であることに不安がない限り、静的メソッドプロパティに情報を保存することは本当に躊躇してしまいます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 메서드와 속성은 모든 사람이 공유합니다. </font><font style="vertical-align: inherit;">기본적으로 전역 변수가됩니다. </font><font style="vertical-align: inherit;">전 세계와 동일한 문제가 있습니다. </font><font style="vertical-align: inherit;">따라서 전 세계에 익숙하지 않다면 정적 메서드 / 속성에 정보를 저장하는 것이 주저 할 것입니다.</font></font>
ru: Обратите внимание,что статические методы и свойства являются общими для всех.Это делает их в основном глобальными переменными.Со всеми теми же проблемами,которые приходят с глобальными переменными.Поэтому я буду очень нерешительно хранить информацию в статических методах,если вам не нравится,что она по-настоящему глобальная.
zh_cn: 注意,静态方法和属性是每个人共享的。这使得它们基本上是全局变量。所有的问题都和全局变量一样。所以我真的不愿意把信息存储在静态方法和属性中,除非你对它是真正意义上的全局变量很满意。
