Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that the calling context is what determines if an instance is used. Therefore:
es: Tenga en cuenta que el contexto de la llamada es lo que determina si se utiliza una instancia.Por lo tanto:
ja: 呼び出しコンテキストは、インスタンスが使用されるかどうかを決定するものであることに注意してください。したがって
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호출 컨텍스트는 인스턴스 사용 여부를 결정합니다. </font><font style="vertical-align: inherit;">따라서:</font></font>
ru: Обратите внимание,что именно контекст вызова определяет,используется ли экземпляр.Поэтому:
zh_cn: 注意,调用上下文决定了是否使用实例。因此。

source: Note that we're executing the <code>Person::getName()</code><em>instance</em> method every time. But we're using the <code>parent::getName()</code> to do it in one of the cases (the child case). This is what makes this approach powerful.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que estamos ejecutando el </font><font style="vertical-align: inherit;">m&eacute;todo de </font><em><font style="vertical-align: inherit;">instancia </font></em></font> <code>Person::getName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cada vez. </font><font style="vertical-align: inherit;">Pero estamos usando </font> <code>parent::getName()</code> <font style="vertical-align: inherit;"> para hacerlo en uno de los casos (el caso secundario). </font><font style="vertical-align: inherit;">Esto es lo que hace que este enfoque sea poderoso.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"></font> <code>Person::getName()</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを毎回</font><font style="vertical-align: inherit;">実行していることに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">しかし、私たちは</font></font> <code>parent::getName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して、いずれかのケース（子ケース）でそれを実行しています。</font><font style="vertical-align: inherit;">これが、このアプローチを強力にする理由です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 </font><font style="vertical-align: inherit;">매번 </font></font> <code>Person::getName()</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 </font><font style="vertical-align: inherit;">실행합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 우리는 </font></font> <code>parent::getName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하여 사례 중 하나 (자식 사례)에서 수행합니다. </font><font style="vertical-align: inherit;">이것이이 접근 방식을 강력하게 만듭니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что мы выполняем </font><font style="vertical-align: inherit;">метод </font><em><font style="vertical-align: inherit;">экземпляра </font></em></font> <code>Person::getName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> каждый раз. </font><font style="vertical-align: inherit;">Но мы используем </font> <code>parent::getName()</code> <font style="vertical-align: inherit;"> чтобы сделать это в одном из случаев (дочерний случай). </font><font style="vertical-align: inherit;">Это то, что делает этот подход мощным.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，我们</font><font style="vertical-align: inherit;">每次</font><font style="vertical-align: inherit;">都执行</font></font> <code>Person::getName()</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">但是</font><font style="vertical-align: inherit;">在一种情况下（子情况下），</font><font style="vertical-align: inherit;">我们使用</font></font> <code>parent::getName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来做到这一点。</font><font style="vertical-align: inherit;">这就是使此方法功能强大的原因。</font></font>

source: Now it is <em>really</em> weird here. We're calling a different class, but the <code>$this</code> that gets passed to the <code>Foo::isFoo()</code> method is the instance of <code>$bar</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora es </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">realmente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> raro aqu&iacute;. </font><font style="vertical-align: inherit;">Estamos llamando a una clase diferente, pero el </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se pasa al </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>Foo::isFoo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es la instancia de </font></font> <code>$bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">今</font><font style="vertical-align: inherit;">ここ</font><font style="vertical-align: inherit;">は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本当に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">奇妙です。</font><font style="vertical-align: inherit;">別のクラスを呼び出しています</font><font style="vertical-align: inherit;">が、</font> <code>Foo::isFoo()</code> <font style="vertical-align: inherit;">メソッドに</font><font style="vertical-align: inherit;">渡される</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font> <code>$bar</code> <font style="vertical-align: inherit;">インスタンスです</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정말</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이상합니다. </font><font style="vertical-align: inherit;">우리는 다른 클래스를 호출하지만 </font> <code>Foo::isFoo()</code> <font style="vertical-align: inherit;"> 메소드에 </font><font style="vertical-align: inherit;">전달 </font><font style="vertical-align: inherit;">되는 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font> <code>$bar</code> <font style="vertical-align: inherit;"> 의 인스턴스입니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">действительно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> странно здесь. </font><font style="vertical-align: inherit;">Мы вызываем другой класс, но </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который передается </font><font style="vertical-align: inherit;">методу </font></font> <code>Foo::isFoo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является экземпляром </font></font> <code>$bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，</font><font style="vertical-align: inherit;">这里</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真的很</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">奇怪。</font><font style="vertical-align: inherit;">我们正在调用其他类，但是</font><font style="vertical-align: inherit;">传递给</font> <code>Foo::isFoo()</code> <font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">的</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font> <code>$bar</code> <font style="vertical-align: inherit;">的实例</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Now we can see that self refers to the class in which it is called, while <code>$this</code> refers to the <strong>class of the current object</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora podemos ver que self se refiere a la clase en la que se llama, mientras que </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase del objeto actual</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これで、selfが呼び出さ</font><font style="vertical-align: inherit;">れた</font><strong><font style="vertical-align: inherit;">クラスを</font></strong><font style="vertical-align: inherit;">参照しているの</font><font style="vertical-align: inherit;">に対し、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在のオブジェクトのクラスを</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照していることがわかり</font><strong><font style="vertical-align: inherit;">ます</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 self는 자신이 호출 된 클래스를 나타내고 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 객체</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font><strong><font style="vertical-align: inherit;">클래스를</font></strong><font style="vertical-align: inherit;"> 나타냅니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь мы можем видеть, что self ссылается на класс, в котором он вызывается, а </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">класс текущего объекта</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在我们可以看到self指向调用它的类，而</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指向</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当前对象</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font><strong><font style="vertical-align: inherit;">类</font></strong><font style="vertical-align: inherit;">。</font></font>

source: Now, we're also looking at inheritance here. Ignore for a moment that this is a bad object model, but let's look at what happens when we play with this:
es: Ahora,también estamos viendo la herencia aquí.Ignoren por un momento que este es un mal modelo de objeto,pero veamos qué pasa cuando jugamos con esto:
ja: さて、ここでは継承についても考えてみましょう。これが悪いオブジェクトモデルであることはちょっと無視して、これを使って何が起こるかを見てみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 우리는 또한 상속을보고 있습니다. </font><font style="vertical-align: inherit;">이것이 잘못된 객체 모델이라는 것을 잠시 무시하십시오.</font></font>
ru: Теперь,мы также смотрим на наследование.Проигнорируйте на мгновение,что это плохая объектная модель,но давайте посмотрим,что происходит,когда мы играем с этим:
zh_cn: 现在,我们在这里也要看一下继承。暂时不要理会这是一个糟糕的对象模型,但我们来看看当我们玩这个的时候会发生什么。

source: Ok, fine. In short, <code>self</code> is used to reference <em>the current class name</em> within a class, where as <code>$this</code> refers to the current object <em>instance</em>. Note that <code>self</code> is a copy/paste short-cut. You can safely replace it with your class name, and it'll work fine. But <code>$this</code> is a dynamic variable that can't be determined ahead of time (and may not even be your class).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Est&aacute; bien. </font><font style="vertical-align: inherit;">En resumen, </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa para hacer referencia </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">al nombre de la clase actual</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de una clase, donde </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancia del</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> objeto actual </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Tenga en cuenta que </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un atajo de copiar / pegar. </font><font style="vertical-align: inherit;">Puede reemplazarlo con seguridad con el nombre de su clase, y funcionar&aacute; bien. </font><font style="vertical-align: inherit;">Pero </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una variable din&aacute;mica que no se puede determinar con anticipaci&oacute;n (y puede que ni siquiera sea su clase).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いいよ。</font><font style="vertical-align: inherit;">つまり、</font><em><font style="vertical-align: inherit;">クラス</font></em><font style="vertical-align: inherit;">内</font><em><font style="vertical-align: inherit;">の現在のクラス名</font></em><font style="vertical-align: inherit;">を参照</font><em><font style="vertical-align: inherit;">する</font></em><font style="vertical-align: inherit;">ために</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が使用され</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font> <code>$this</code> <font style="vertical-align: inherit;">は現在のオブジェクト</font><em><font style="vertical-align: inherit;">インスタンスを</font></em><font style="vertical-align: inherit;">参照し</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font> <code>self</code> <font style="vertical-align: inherit;">はコピー/貼り付けのショートカットである</font><font style="vertical-align: inherit;">ことに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">安全にクラス名に置き換えることができ、問題なく機能します。</font><font style="vertical-align: inherit;">しかし、</font> <code>$this</code> <font style="vertical-align: inherit;">は事前に決定できない動的変数であり、クラスでさえない場合があります。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알았어 괜찮아. </font><font style="vertical-align: inherit;">즉, </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내 </font><em><font style="vertical-align: inherit;">에서 현재 클래스 이름</font></em><font style="vertical-align: inherit;"> 을 참조 </font><em><font style="vertical-align: inherit;">하는</font></em><font style="vertical-align: inherit;"> 데 사용됩니다 </font><font style="vertical-align: inherit;">. 여기서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스를</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 나타냅니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">참고 것을 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 복사본입니다 / 바로 가기를 붙여 넣습니다. </font><font style="vertical-align: inherit;">클래스 이름으로 안전하게 바꿀 수 있으며 정상적으로 작동합니다. </font><font style="vertical-align: inherit;">그러나 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 미리 결정할 수없는 동적 변수이며 클래스가 아닐 수도 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хорошо. </font><font style="vertical-align: inherit;">Короче говоря, </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется для ссылки </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">на текущее имя класса</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри класса, где как </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляру</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Обратите внимание, что </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является копией / вставкой. </font><font style="vertical-align: inherit;">Вы можете смело заменить его своим именем класса, и оно будет работать нормально. </font><font style="vertical-align: inherit;">Но </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> динамическая переменная, которая не может быть определена заранее (и может даже не быть вашим классом).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">好的。</font><font style="vertical-align: inherit;">简而言之，</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于引用</font><font style="vertical-align: inherit;">一个类中</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的当前类名</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其中</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示当前对象</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请注意，</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是复制/粘贴的快捷方式。</font><font style="vertical-align: inherit;">您可以使用您的班级名称安全地替换它，它将正常运行。</font><font style="vertical-align: inherit;">但是</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个动态变量，无法提前确定（甚至可能不是您的课程）。</font></font>
