Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: One other thing we should talk about, is that we can <em>check</em> if an instance is an <code>instanceof</code> a particular class: <code>$bob instanceof Person</code> which returns a boolean if the <code>$bob</code> instance was made using the <code>Person</code> class, <em>or</em> a child of <code>Person</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Otra cosa de la que deber&iacute;amos hablar es que podemos </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">verificar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si una instancia es una </font></font> <code>instanceof</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una clase en particular: </font></font> <code>$bob instanceof Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que devuelve un valor booleano si la </font><font style="vertical-align: inherit;">instancia </font></font> <code>$bob</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se realiz&oacute; utilizando la </font><font style="vertical-align: inherit;">clase </font></font> <code>Person</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> un hijo de </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もう1つ説明する必要があるの</font><font style="vertical-align: inherit;">は、</font> <code>instanceof</code> <font style="vertical-align: inherit;">が特定のクラスの</font><font style="vertical-align: inherit;">インスタンスで</font><font style="vertical-align: inherit;">ある</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">か</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どうか</font><font style="vertical-align: inherit;">を</font><em><font style="vertical-align: inherit;">確認</font></em><font style="vertical-align: inherit;">できること</font><font style="vertical-align: inherit;">です</font><font style="vertical-align: inherit;">。</font> <code>$bob instanceof Person</code> <font style="vertical-align: inherit;">は、</font> <code>$bob</code> <font style="vertical-align: inherit;">インスタンスが</font> <code>Person</code> <font style="vertical-align: inherit;">クラス</font><em><font style="vertical-align: inherit;">または</font></em> <code>Person</code> の<font style="vertical-align: inherit;">子を</font><font style="vertical-align: inherit;">使用して作成された場合に</font><font style="vertical-align: inherit;">ブール値を返します</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리가에 대한 이야기해야 또 한가지는 우리가 할 수 있다는 것입니다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">확인</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스가있는 경우 </font></font> <code>instanceof</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 특정 클래스 </font></font> <code>$bob instanceof Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우 부울을 반환 </font></font> <code>$bob</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스가 사용되었다 </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스를, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 자식 </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Еще одна вещь, о которой мы должны поговорить, это то, что мы можем </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проверить</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , является ли экземпляр </font></font> <code>instanceof</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> определенного класса: </font></font> <code>$bob instanceof Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который возвращает логическое значение, если </font><font style="vertical-align: inherit;">экземпляр </font></font> <code>$bob</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> был создан с использованием </font><font style="vertical-align: inherit;">класса </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> потомком </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们应该讨论的另一件事是，我们可以</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例是否是</font><font style="vertical-align: inherit;">特定类</font><font style="vertical-align: inherit;">的</font></font> <code>instanceof</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font> <code>$bob instanceof Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font> <code>$bob</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例是使用</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font></em><font style="vertical-align: inherit;"></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的子对象</font><font style="vertical-align: inherit;">制成的</font><font style="vertical-align: inherit;">，则返回一个布尔值</font><font style="vertical-align: inherit;">。</font></font>

source: Output: parent child
es: Salida:padre e hijo
ja: 出力:親子
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출력 : 부모 자식</font></font>
ru: Выход:родительский ребенок
zh_cn: 产出:亲子关系

source: PHP 5.3 has a solution. the <strong><code>static::</code></strong> resolution operator implements "late static binding" which is a fancy way of saying that it's bound to the scope of the class called. Change the line in <code>status()</code> to <code>static::getStatus()</code> and the results are what you would expect. In older versions of PHP you will have to find a kludge to do this.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.3 tiene una soluci&oacute;n. </font><font style="vertical-align: inherit;">El </font><font style="vertical-align: inherit;">operador </font></font><strong> <code>static::</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> resolution implementa el "enlace est&aacute;tico tard&iacute;o", que es una forma elegante de decir que est&aacute; vinculado al alcance de la clase llamada. </font><font style="vertical-align: inherit;">Cambie la l&iacute;nea en el </font></font> <code>status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>static::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los resultados son lo que esperar&iacute;a. </font><font style="vertical-align: inherit;">En versiones anteriores de PHP, tendr&aacute; que encontrar un kludge para hacer esto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.3には解決策があります。</font></font><strong> <code>static::</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それはと呼ばれるクラスのスコープにバインドされていますというのファンシーな方法です解像度オペレータが実装「結合後半静的」。</font></font> <code>status()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行</font><font style="vertical-align: inherit;">を </font></font> <code>static::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と、期待どおりの結果になります。</font><font style="vertical-align: inherit;">PHPの古いバージョンでは、これを行うための手がかりを見つける必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.3에는 해결책이 있습니다. </font></font><strong> <code>static::</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해상도 연산자 구현은 호출 클래스의 범위에 바인딩 된 것을 말하는 멋진 방법이다 "늦게 정적 바인딩". </font></font> <code>status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 행 </font><font style="vertical-align: inherit;">을 </font></font> <code>static::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 변경하면 결과가 예상됩니다. </font><font style="vertical-align: inherit;">이전 버전의 PHP에서는이를 수행하기 위해 kludge를 찾아야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.3 имеет решение. </font><font style="vertical-align: inherit;">то </font></font><strong> <code>static::</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> оператор реализует разрешение &laquo; в </font><font style="vertical-align: inherit;">конце статической привязки&raquo; , </font><font style="vertical-align: inherit;">который представляет собой причудливый способ сказать , </font><font style="vertical-align: inherit;">что это связано с областью класса называется. </font><font style="vertical-align: inherit;">Измените строку в </font></font> <code>status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>static::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вы </font><font style="vertical-align: inherit;">получите ожидаемые</font><font style="vertical-align: inherit;"> результаты. </font><font style="vertical-align: inherit;">В более старых версиях PHP вам нужно будет найти kludge для этого.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.3有一个解决方案。</font><font style="vertical-align: inherit;">在</font></font><strong> <code>static::</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分辨率运营商实行&ldquo;后期静态绑定&rdquo;，这是说，它必然要调用的类范围的一个奇特的方式。</font><font style="vertical-align: inherit;">将</font></font> <code>status()</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的行更改</font><font style="vertical-align: inherit;">为 </font></font> <code>static::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，结果就是您所期望的。</font><font style="vertical-align: inherit;">在较旧版本的PHP中，您将必须找到解决方法。</font></font>

source: Second, it prevents naming conflicts. In a big project, you're likely to have two developers create getName() functions. If one creates a ClassName1::getName(), and the other creates ClassName2::getName(), it's no problem at all. No conflict. Yay static methods!
es: En segundo lugar,evita los conflictos de nombres.En un proyecto grande,es probable que dos desarrolladores creen funciones getName().Si uno crea un ClassName1::getName(),y el otro crea ClassName2::getName(),no hay ningún problema.No hay conflicto.Yay métodos estáticos!
ja: 第二に、名前の競合を防ぐことができます。大きなプロジェクトでは、二人の開発者が getName()関数を作成することになるでしょう。一人が ClassName1::getName()を作成し、もう一人が ClassName2::getName()を作成すれば、全く問題ありません。競合もありません。イェーイ!静的メソッド
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘째, 이름 충돌을 방지합니다. </font><font style="vertical-align: inherit;">큰 프로젝트에서는 두 명의 개발자가 getName () 함수를 작성하게 할 것입니다. </font><font style="vertical-align: inherit;">하나는 ClassName1 :: getName ()을 작성하고 다른 하나는 ClassName2 :: getName ()을 작성하면 전혀 문제가되지 않습니다. </font><font style="vertical-align: inherit;">충돌이 없습니다. </font><font style="vertical-align: inherit;">예 정적 방법!</font></font>
ru: Во-вторых,это предотвращает конфликты с именами.В большом проекте,скорее всего,два разработчика создадут функции getName().Если один создает ClassName1::getName(),а другой создает ClassName2::getName(),то это совсем не проблема.Конфликта нет.Ура статическим методам!
zh_cn: 第二,它可以防止命名冲突。在一个大项目中,你很可能会有两个开发人员创建getName()函数。如果一个人创建了ClassName1:::getName(),另一个人创建了ClassName2:::getName(),那就完全没有问题了。没有冲突。Yay static methods!

source: See <a href="http://php.net/manual/en/language.oop5.late-static-bindings.php">PHP Documentation</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ver </font></font><a href="http://php.net/manual/en/language.oop5.late-static-bindings.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentaci&oacute;n de PHP</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://php.net/manual/en/language.oop5.late-static-bindings.php"><font style="vertical-align: inherit;">PHPのドキュメントを</font></a><font style="vertical-align: inherit;">参照</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://php.net/manual/en/language.oop5.late-static-bindings.php"><font style="vertical-align: inherit;">PHP 설명서를</font></a><font style="vertical-align: inherit;"> 참조하십시오</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите </font></font><a href="http://php.net/manual/en/language.oop5.late-static-bindings.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP документацию</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参见</font></font><a href="http://php.net/manual/en/language.oop5.late-static-bindings.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP文档</font></font></a>

source: See the following example which shows overloading.
es: Véase el siguiente ejemplo que muestra la sobrecarga.
ja: オーバーロードを示す次の例を参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">과부하를 보여주는 다음 예를 참조하십시오.</font></font>
ru: См.следующий пример,показывающий перегрузку.
zh_cn: 请看下面的例子,它显示了超载。

source: Short Answer
es: Respuesta corta
ja: ショートアンサー
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">짧은 답변</font></font>
ru: краткий ответ
zh_cn: 简答

source: Short-Cut Keywords
es: Palabras clave cortas
ja: ショートカットキーワード
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">짧은 키워드</font></font>
ru: Краткосрочные ключевые слова
zh_cn: 捷报关键字

source: So basically, we're storing information on the class and object container using "hints" about <em>static</em> which identify whether the information is shared (and hence static) or not (and hence dynamic).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B&aacute;sicamente, estamos almacenando informaci&oacute;n sobre la clase y el contenedor de objetos usando "pistas" sobre </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">est&aacute;tica</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que identifican si la informaci&oacute;n es compartida (y por lo tanto est&aacute;tica) o no (y por lo tanto din&aacute;mica).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、基本的に、</font><font style="vertical-align: inherit;">情報が共有されている（したがって静的）か共有されていない（したがって動的）かを識別する</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に関する「ヒント」を使用して、クラスとオブジェクトコンテナーに情報を格納しています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 기본적으로 우리는 </font><font style="vertical-align: inherit;">정보가 공유되는지 (따라서 정적 인) 아닌지 (그리고 동적)를 식별하는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">static</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 "힌트"를 사용하여 클래스와 객체 컨테이너에 정보를 저장합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, в основном, мы храним информацию о классе и контейнере объектов, используя &laquo;подсказки&raquo; о </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статическом,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которые определяют, является ли информация общей (и, следовательно, статической) или нет (и, следовательно, динамической).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，基本上，我们使用关于</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &ldquo;提示&rdquo;将信息存储在类和对象容器上，这些&ldquo;提示&rdquo; </font><font style="vertical-align: inherit;">标识信息是否共享（因此是静态）（是否是动态）。</font></font>

source: So in other words, use <code>self for static</code> and <code>this for none-static members or methods</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En otras palabras, use </font></font> <code>self for static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>this for none-static members or methods</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、</font></font> <code>self for static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">には</font><font style="vertical-align: inherit;">selfを</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">、静的</font><font style="vertical-align: inherit;">で</font></font> <code>this for none-static members or methods</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 즉, 사용의 </font></font> <code>self for static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>this for none-static members or methods</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другими словами, используйте </font></font> <code>self for static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а </font></font> <code>this for none-static members or methods</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，换句话说，将</font></font> <code>self for static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，将</font></font> <code>this for none-static members or methods</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: So let's dig a bit into what a class actually contains. There are 5 types of "things" that a class contains:
es: Así que vamos a indagar un poco en lo que realmente contiene una clase.Hay 5 tipos de "cosas" que contiene una clase:
ja: それでは、クラスが実際に何を含んでいるのかを少し掘り下げてみましょう。クラスに含まれる「もの」には5つのタイプがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스에 실제로 포함 된 내용을 조금 살펴 보겠습니다. </font><font style="vertical-align: inherit;">클래스에는 5 가지 유형의 "사물"이 있습니다.</font></font>
ru: Так что давайте немного покопаемся в том,что на самом деле содержится в классе.Есть 5 типов "вещей",которые содержит класс:
zh_cn: 那么,让我们来深挖一下类到底包含了什么。一个类所包含的 "东西 "有5种。
