Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To really understand what we're talking about when we talk about <code>self</code> versus <code>$this</code>, we need to actually dig into what's going on at a conceptual and a practical level. I don't really feel any of the answers do this appropriately, so here's my attempt.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para comprender realmente de qu&eacute; estamos hablando cuando hablamos de </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> frente a </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , necesitamos profundizar en lo que est&aacute; sucediendo a nivel conceptual y pr&aacute;ctico. </font><font style="vertical-align: inherit;">Realmente no siento que ninguna de las respuestas haga esto apropiadamente, as&iacute; que aqu&iacute; est&aacute; mi intento.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">対</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について話すときに何を話しているのかを本当に理解するには</font><font style="vertical-align: inherit;">、概念レベルと実用レベルで何が起こっているのかを実際に掘り下げる必要があります。</font><font style="vertical-align: inherit;">私は答えがどれも適切にこれをすることを本当に感じていません、それでここに私の試みがあります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대해 이야기 할 때 우리가 이야기하는 것을 실제로 이해하려면 </font><font style="vertical-align: inherit;">실제로 개념적이고 실용적인 수준에서 진행되는 일을 파헤쳐 야합니다. </font><font style="vertical-align: inherit;">나는 실제로 어떤 대답도 적절하게 수행한다고 생각하지 않으므로 여기에 내 시도가 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы по-настоящему понять, о чем мы говорим, когда говорим о </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> против </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , нам нужно </font><font style="vertical-align: inherit;">действительно разобраться </font><font style="vertical-align: inherit;">в том, что происходит на концептуальном и практическом уровне. </font><font style="vertical-align: inherit;">Я не чувствую, что какой-либо из ответов делает это соответствующим образом, вот моя попытка.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要真正了解我们在谈论</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时在谈论什么</font><font style="vertical-align: inherit;">，我们需要在概念和实践层面上深入研究正在发生的事情。</font><font style="vertical-align: inherit;">我真的没有任何答案能正确地做到这一点，所以这是我的尝试。</font></font>

source: Too bad, go back and read it. It may be too long, but it's that long because this is a complex topic
es: Lástima,vuelve y léelo.Puede que sea demasiado largo,pero es así de largo porque este es un tema complejo
ja: 残念、戻って読んでみてください。長すぎるかもしれませんが、複雑なテーマだからこその長さです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">너무 나쁘고 돌아가서 읽어보십시오. </font><font style="vertical-align: inherit;">너무 길지만 복잡한 주제이기 때문에 너무 깁니다.</font></font>
ru: Очень жаль,возвращайся и читай.Это может быть слишком долго,но это так долго,потому что это сложная тема.
zh_cn: 太可惜了,回去看一下吧。可能是太长了,但之所以这么长,是因为这是个复杂的话题。

source: Use <code>$this</code> to refer to the current object. Use <code>self</code> to refer to the current class. In other words, use <code>$this-&gt;member</code> for non-static members, use <code>self::$member</code> for static members.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para referirse al objeto actual. </font><font style="vertical-align: inherit;">Use </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para referirse a la clase actual. </font><font style="vertical-align: inherit;">En otras palabras, use </font></font> <code>$this-&gt;member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font><font style="vertical-align: inherit;">miembros</font><font style="vertical-align: inherit;"> no est&aacute;ticos, use </font></font> <code>self::$member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para miembros est&aacute;ticos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在のオブジェクトを参照します。</font><font style="vertical-align: inherit;">現在のクラスを参照するには、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">つまり、</font><font style="vertical-align: inherit;">非静的メンバー</font><font style="vertical-align: inherit;">には </font></font> <code>$this-&gt;member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用し、静的メンバーには</font></font> <code>self::$member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 현재 객체를 참조하십시오. </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 현재 클래스를 참조하십시오. </font><font style="vertical-align: inherit;">즉, </font><font style="vertical-align: inherit;">정적이 아닌 </font></font> <code>$this-&gt;member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 </font><font style="vertical-align: inherit;">$ this-&gt; member</font><font style="vertical-align: inherit;"> 를 사용하고 정적 멤버에는 </font></font> <code>self::$member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для ссылки на текущий объект. </font><font style="vertical-align: inherit;">Используйте </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для ссылки на текущий класс. </font><font style="vertical-align: inherit;">Другими словами, используйте </font></font> <code>$this-&gt;member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для нестатических членов, используйте </font></font> <code>self::$member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для статических членов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前对象。</font><font style="vertical-align: inherit;">使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来引用当前类。</font><font style="vertical-align: inherit;">换句话说，</font><font style="vertical-align: inherit;">对非静态成员</font><font style="vertical-align: inherit;">使用 </font></font> <code>$this-&gt;member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，对静态成员使用</font></font> <code>self::$member</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Use <code>self</code> if you want to call a method of a class without creating an object/instance of that class, thus saving <a href="http://en.wikipedia.org/wiki/Random-access_memory">RAM</a> (sometimes use self for that purpose). In other words, it is actually calling a method statically. Use <code>this</code> for object perspective.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si desea llamar a un m&eacute;todo de una clase sin crear un objeto / instancia de esa clase, ahorrando as&iacute; </font></font><a href="http://en.wikipedia.org/wiki/Random-access_memory"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAM</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (a veces use self para ese prop&oacute;sito). </font><font style="vertical-align: inherit;">En otras palabras, en realidad est&aacute; llamando a un m&eacute;todo est&aacute;ticamente. </font><font style="vertical-align: inherit;">Use </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la perspectiva del objeto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは、このように保存し、そのクラスのオブジェクト/インスタンスを作成せずに、クラスのメソッドを呼び出したい場合は</font></font><a href="http://en.wikipedia.org/wiki/Random-access_memory"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAMを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（時には、その目的のために自己を使用します）。</font><font style="vertical-align: inherit;">つまり、実際にはメソッドを静的に呼び出しています。</font><font style="vertical-align: inherit;">オブジェクトのパースペクティブに</font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 이렇게 절약, 그 클래스의 객체 / 인스턴스를 생성하지 않고 클래스의 메소드를 호출 할 경우 </font></font><a href="http://en.wikipedia.org/wiki/Random-access_memory"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAM은</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (때로는 그 목적 자체를 사용). </font><font style="vertical-align: inherit;">즉, 실제로 메소드를 정적으로 호출합니다. </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체 원근법에 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font> <code>self</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы хотите вызывать метод класса без создания объекта / экземпляра этого класса, тем самым экономя </font></font><a href="http://en.wikipedia.org/wiki/Random-access_memory"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оперативную память</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (иногда для этой цели используйте self). </font><font style="vertical-align: inherit;">Другими словами, это фактически вызывает метод статически. </font><font style="vertical-align: inherit;">Используйте </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для перспективы объекта.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要在不创建该类的对象/实例的情况下调用类的方法，</font><font style="vertical-align: inherit;">请使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这样可以节省</font></font><a href="http://en.wikipedia.org/wiki/Random-access_memory"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAM</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（有时将self用于该目的）。</font><font style="vertical-align: inherit;">换句话说，它实际上是在静态地调用方法。</font><font style="vertical-align: inherit;">使用</font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为对象的观点。</font></font>

source: Using the code above is not common or recommended practice, but is simply to illustrate its usage, and is to act as more of a "Did you know?" in reference to the original poster's question.
es: El uso del código anterior no es una práctica común o recomendada,sino que es simplemente para ilustrar su uso,y es para actuar como más de un "¿Sabía usted?" en referencia a la pregunta del cartel original.
ja: 上記のコードを使用することは、一般的でも推奨される慣習でもなく、単にその使用法を説明するためのものであり、元のポスターの質問を参照して、より多くの「知っていましたか」として振る舞うことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 코드를 사용하는 것은 일반적이거나 권장되는 방법이 아니라 단순히 사용법을 설명하기위한 것이며 "알고 있습니까?" </font><font style="vertical-align: inherit;">원래 포스터의 질문과 관련하여.</font></font>
ru: Использование приведенного выше кода не является обычной или рекомендуемой практикой,а просто для иллюстрации его использования,и является скорее "Знаете ли вы?" в связи с вопросом оригинала плаката.
zh_cn: 使用上面的代码,并不是常见的做法,也不是推荐的做法,只是为了说明它的用法,更多的是作为 "你知道吗?"来参考原帖的问题。

source: We create new <em>instances</em> of a class using the <code>new</code> operator.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creamos nuevas </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancias</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de una clase usando el </font></font> <code>new</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> operador.</font></font>
ja: <font style="vertical-align: inherit;"> <code>new</code> <font style="vertical-align: inherit;">演算子</font><font style="vertical-align: inherit;">を使用して、クラスの</font><font style="vertical-align: inherit;">新しい</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を作成し</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>new</code> <font style="vertical-align: inherit;"> 연산자를 </font><font style="vertical-align: inherit;">사용하여 클래스의 </font><font style="vertical-align: inherit;">새 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">만듭니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы создаем новые </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляры</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> класса, используя </font><font style="vertical-align: inherit;">оператор </font></font> <code>new</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们</font><font style="vertical-align: inherit;">使用</font> <code>new</code> <font style="vertical-align: inherit;">运算符</font><font style="vertical-align: inherit;">创建</font><font style="vertical-align: inherit;">类的</font><font style="vertical-align: inherit;">新</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: When <code>self</code> is used with the <code>::</code> operator it refers to the current class, which can be done both in static and non-static contexts. <code>$this</code> refers to the object itself. In addition, it is perfectly legal to use <code>$this</code> to call static methods (but not to refer to fields).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa con el </font><font style="vertical-align: inherit;">operador </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se refiere a la clase actual, que se puede hacer tanto en contextos est&aacute;ticos como no est&aacute;ticos. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto en s&iacute;. </font><font style="vertical-align: inherit;">Adem&aacute;s, es perfectamente legal usar </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para llamar a m&eacute;todos est&aacute;ticos (pero no para referirse a los campos).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ときに</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用いて使用されている</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オペレータは静的および非静的コンテキストの両方を行うことができる現在のクラスを指します。</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオブジェクト自体を指します。</font><font style="vertical-align: inherit;">さらに、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して</font><font style="vertical-align: inherit;">静的メソッドを呼び出す</font><font style="vertical-align: inherit;">ことは完全に合法です</font><font style="vertical-align: inherit;">（ただし、フィールドを参照することはできません）。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자 </font><font style="vertical-align: inherit;">와 함께 사용 </font><font style="vertical-align: inherit;">되면 </font><font style="vertical-align: inherit;">정적 및 비 정적 컨텍스트에서 모두 수행 할 수있는 현재 클래스를 참조합니다. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 객체 자체를 나타냅니다. </font><font style="vertical-align: inherit;">또한 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용 </font><font style="vertical-align: inherit;">하여 정적 메소드를 호출 </font><font style="vertical-align: inherit;">하는 것은 완벽하지만 합법적 </font><font style="vertical-align: inherit;">이지만 필드를 참조하지는 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется с </font><font style="vertical-align: inherit;">оператором </font></font> <code>::</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> он ссылается на текущий класс, что может быть сделано как в статическом, так и в нестатическом контексте. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к самому объекту. </font><font style="vertical-align: inherit;">Кроме того, вполне допустимо использовать </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для вызова статических методов (но не для ссылки на поля).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运算符</font><font style="vertical-align: inherit;">一起使用时，</font><font style="vertical-align: inherit;">它引用当前类，可以在静态和非静态上下文中完成。</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用对象本身。</font><font style="vertical-align: inherit;">另外，使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用静态方法</font><font style="vertical-align: inherit;">是完全合法的</font><font style="vertical-align: inherit;">（但不要引用字段）。</font></font>

source: When is each appropriate?
es: ¿Cuándo es apropiado cada uno?
ja: それぞれどのような時に適切なのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언제 각각 적절한가요?</font></font>
ru: Когда каждый из них подходит?
zh_cn: 每个人什么时候合适?

source: When to use self over $this
es: Cuándo usar uno mismo por encima de esto
ja: self over $thisを使うタイミング
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this보다 자기를 사용할 때</font></font>
ru: Когда использовать себя за $ это
zh_cn: 何时使用自我超过$this
