Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <code>sayHello()</code> uses the <code>$this</code> pointer, so the vtable is invoked to call <code>Geek::getTitle()</code>. <code>sayGoodbye()</code> uses <code>self::getTitle()</code>, so the vtable is not used, and <code>Person::getTitle()</code> is called. In both cases, we are dealing with the method of an instantiated object, and have access to the <code>$this</code> pointer within the called functions.
es: <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usa el </font><font style="vertical-align: inherit;">puntero </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que se invoca la vtable para llamar a </font></font> <code>Geek::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>sayGoodbye()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usa </font></font> <code>self::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que no se usa vtable y </font><font style="vertical-align: inherit;">se llama a </font></font> <code>Person::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En ambos casos, estamos tratando con el m&eacute;todo de un objeto instanciado, y tenemos acceso al </font><font style="vertical-align: inherit;">puntero </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de las funciones llamadas.</font></font>
ja: <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ポインターを</font><font style="vertical-align: inherit;">使用する</font><font style="vertical-align: inherit;">ため、</font></font> <code>Geek::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出すためにvtableが呼び出されます</font><font style="vertical-align: inherit;">。 </font></font> <code>sayGoodbye()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>self::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getTitle（）を</font><font style="vertical-align: inherit;">使用する</font><font style="vertical-align: inherit;">ため、vtableは使用されず、</font></font> <code>Person::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が呼び出されます。</font><font style="vertical-align: inherit;">どちらの場合も、インスタンス化されたオブジェクトのメソッドを処理しており</font><font style="vertical-align: inherit;">、呼び出された関数内の</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ポインターに</font><font style="vertical-align: inherit;">アクセスでき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포인터를 사용하므로 </font></font> <code>Geek::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출하기 위해 vtable이 호출됩니다 </font><font style="vertical-align: inherit;">. </font></font> <code>sayGoodbye()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>self::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하므로 vtable이 사용되지 않으며 </font></font> <code>Person::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 호출됩니다. </font><font style="vertical-align: inherit;">두 경우 모두 인스턴스화 된 객체의 메서드를 다루며 </font><font style="vertical-align: inherit;">호출 된 함수 내에서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포인터에 </font><font style="vertical-align: inherit;">액세스 할 수 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использует </font><font style="vertical-align: inherit;">указатель </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому vtable вызывается для вызова </font></font> <code>Geek::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>sayGoodbye()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использует </font></font> <code>self::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому vtable не используется и </font></font> <code>Person::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В обоих случаях мы имеем дело с методом экземпляра объекта и имеем доступ к </font><font style="vertical-align: inherit;">указателю </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в вызываемых функциях.</font></font>
zh_cn: <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指针，因此调用了vtable来调用</font></font> <code>Geek::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 </font></font> <code>sayGoodbye()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>self::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因此不使用vtable，并且</font><font style="vertical-align: inherit;">调用</font></font> <code>Person::getTitle()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这两种情况下，我们都处理实例化对象的方法，并且可以访问</font><font style="vertical-align: inherit;">被调用函数中</font><font style="vertical-align: inherit;">的</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指针。</font></font>

source: <code>self::</code> doesn't
es: <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no</font></font>
ja: <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しない</font></font>
ko: <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하지 않습니다</font></font>
ru: <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не</font></font>
zh_cn: <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font></font>

source: <code>self</code> (not $self) refers to the <em>type</em> of class, where as <code>$this</code> refers to the current <em>instance</em> of the class. <code>self</code> is for use in static member functions to allow you to access static member variables. <code>$this</code> is used in non-static member functions, and is a reference to the instance of the class on which the member function was called.
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (no $ self) se refiere al </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tipo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de clase, donde </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> actual </font><font style="vertical-align: inherit;">de la clase. </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa en funciones miembro est&aacute;ticas para permitirle acceder a variables miembro est&aacute;ticas. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa en funciones miembro no est&aacute;ticas y es una referencia a la instancia de la clase en la que se llam&oacute; a la funci&oacute;n miembro.</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（$ selfではない）は</font><font style="vertical-align: inherit;">クラス</font><font style="vertical-align: inherit;">の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">指し</font><font style="vertical-align: inherit;">、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">クラスの</font><font style="vertical-align: inherit;">現在の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">指し</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、静的メンバー関数で使用して、静的メンバー変数にアクセスできるようにします。</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は非静的メンバー関数で使用され、メンバー関数が呼び出されたクラスのインスタンスへの参照です。</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ($ self가 아님)는 </font><font style="vertical-align: inherit;">클래스 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유형</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">나타내며 </font><font style="vertical-align: inherit;">, </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><font style="vertical-align: inherit;">클래스 </font><font style="vertical-align: inherit;">의 현재 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">나타냅니다 </font><font style="vertical-align: inherit;">. </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 멤버 함수에 사용하여 정적 멤버 변수에 액세스 할 수 있도록합니다. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 비 정적 멤버 함수에서 사용되며 멤버 함수가 호출 된 클래스의 인스턴스에 대한 참조입니다.</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (не $ self) относится к </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">типу</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> класса, где как </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляру</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> класса. </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предназначен для использования в статических функциях-членах, чтобы позволить вам получить доступ к статическим переменным-членам. </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется в нестатических функциях-членах и является ссылкой на экземпляр класса, для которого была вызвана функция-член.</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（不是$ self）是指</font><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其中</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是指</font><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">的当前</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于静态成员函数，以允许您访问静态成员变量。</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在非静态成员函数中使用，是对调用成员函数的类的实例的引用。</font></font>

source: <code>self</code> - This refers to the current class name. So <code>self::baz()</code> is the same as <code>Foo::baz()</code> within the <code>Foo</code> class (any method on it).
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : se refiere al nombre de la clase actual. </font><font style="vertical-align: inherit;">Entonces </font></font> <code>self::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es lo mismo que </font></font> <code>Foo::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de la </font><font style="vertical-align: inherit;">clase </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (cualquier m&eacute;todo en &eacute;l).</font></font>
ja: <code>self</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは現在のクラス名を指します。</font><font style="vertical-align: inherit;">したがって、</font></font> <code>self::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">、</font> <code>Foo</code> <font style="vertical-align: inherit;">クラス（その上の任意のメソッド</font></font> <code>Foo::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内の</font><font style="vertical-align: inherit;">Foo :: baz（）</font><font style="vertical-align: inherit;">と同じ</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <code>self</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 현재 클래스 이름을 나타냅니다. </font><font style="vertical-align: inherit;">그래서 </font></font> <code>self::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 동일 </font></font> <code>Foo::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내에서 </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 (거기에 어떤 방법).</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Это относится к текущему имени класса. </font><font style="vertical-align: inherit;">Поэтому </font></font> <code>self::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это то же самое, что </font></font> <code>Foo::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><font style="vertical-align: inherit;">классе </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (любой метод на нем).</font></font>
zh_cn: <code>self</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前的类名称。</font><font style="vertical-align: inherit;">因此</font></font> <code>self::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font> <code>Foo</code> <font style="vertical-align: inherit;">类中的</font></font> <code>Foo::baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相同</font><font style="vertical-align: inherit;">（任何方法）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <code>self</code> can also turn off polymorphic behavior by bypassing the vtable
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n puede desactivar el comportamiento polim&oacute;rfico al pasar por alto la vtable</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、vtableをバイパスすることで、ポリモーフィックな動作をオフにすることもできます</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 vtable을 우회하여 다형성 동작을 끌 수도 있습니다.</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также может отключить полиморфное поведение, минуя vtable</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也可以通过绕过vtable来关闭多态行为</font></font>

source: <code>self</code> can be used inside static functions
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar dentro de funciones est&aacute;ticas</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は静的関数内で使用できます</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 함수 내에서 </font><font style="vertical-align: inherit;">자체</font><font style="vertical-align: inherit;"> 사용 가능</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может использоваться внутри статических функций</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以在静态函数中使用</font></font>

source: <code>self</code> can be used to call static functions and reference static member variables
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar para llamar funciones est&aacute;ticas y hacer referencia a variables miembro est&aacute;ticas</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して静的関数を呼び出し、静的メンバー変数を参照できます</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 함수를 호출하고 정적 멤버 변수를 참조하는 데 사용할 수 있습니다</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может использоваться для вызова статических функций и ссылки на статические переменные-члены</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以用来调用静态函数并引用静态成员变量</font></font>

source: <code>self</code> refers current class(in which it is called),
es: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace referencia a la clase actual (en la que se llama),</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のクラス（それが呼び出されるクラス）を参照し、</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 클래스 (호출되는 클래스)를 나타냅니다.</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на текущий класс (в котором он называется),</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是指当前的类别（在其中被称为），</font></font>

source: <code>self</code> refers to the current class
es: <code>self</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la clase actual</font></font>
ja: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のクラスを参照します</font></font>
ko: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 클래스를 나타냅니다</font></font>
ru: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему классу</font></font>
zh_cn: <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是指当前阶层</font></font>
