Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The class value <code>parent</code> refers to the parent of the exact class it was defined in.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El valor de clase </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al padre de la clase exacta en la que se defini&oacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス値の</font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、それが定義された正確なクラスの親を指します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 값 </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정의 된 정확한 클래스의 </font><font style="vertical-align: inherit;">부모를</font><font style="vertical-align: inherit;"> 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> значения класса </font><font style="vertical-align: inherit;">ссылается на родителя того класса, в котором он был определен.</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类的类值</font><font style="vertical-align: inherit;">是指其定义所在的确切类的父类。</font></font>

source: The class value <code>self</code> refers to the exact class it was defined in.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El valor de clase </font></font> <code>self</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la clase exacta en la que se defini&oacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス値</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、それが定義された正確なクラスを参照します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 값 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정의 된 정확한 클래스를 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Значение класса </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к точному классу, в котором оно было определено.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类值</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指的是其定义的确切类。</font></font>

source: The class value <code>static</code> refers to the current object.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El valor de clase </font></font> <code>static</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto actual.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス値</font><font style="vertical-align: inherit;">は、現在のオブジェクトを参照します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 값 </font><font style="vertical-align: inherit;">은 현재 객체를 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Значение класса </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему объекту.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类值</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前对象。</font></font>

source: The code given below is a example of <strong>self::</strong> and <strong>$this</strong> keyword. Just copy and paste the code in your code file and see the output.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El c&oacute;digo que figura a continuaci&oacute;n es un ejemplo de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> palabra clave. </font><font style="vertical-align: inherit;">Simplemente copie y pegue el c&oacute;digo en su archivo de c&oacute;digo y vea el resultado.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のコードは、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードの例です。</font><font style="vertical-align: inherit;">コードをコピーしてコードファイルに貼り付け、出力を確認するだけです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 코드는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 키워드 </font><font style="vertical-align: inherit;">의 예입니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">코드 파일에 코드를 복사하여 붙여 넣고 출력을 확인하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Приведенный ниже код является примером </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ключевого слова. </font><font style="vertical-align: inherit;">Просто скопируйте и вставьте код в ваш файл кода и посмотрите результат.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下面给出的代码是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关键字</font><font style="vertical-align: inherit;">的示例</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">只需将代码复制并粘贴到代码文件中，然后查看输出即可。</font></font>

source: The easiest way to understand this is to start looking at some examples. Let's pick a class:
es: La forma más fácil de entender esto es empezar a ver algunos ejemplos.Elijamos una clase:
ja: これを理解する最も簡単な方法は、いくつかの例を見始めることです。クラスを選んでみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 이해하는 가장 쉬운 방법은 몇 가지 예를 살펴 보는 것입니다. </font><font style="vertical-align: inherit;">수업을 고르자 :</font></font>
ru: Самый простой способ понять это-начать просматривать некоторые примеры.Давайте выберем класс:
zh_cn: 最简单的理解方法就是开始看一些例子。我们来选一个类。

source: The idea is that <code>$this-&gt;foo()</code> calls the <code>foo()</code> member function of whatever is the exact type of the current object. If the object is of <code>type X</code>, it thus calls <code>X::foo()</code>. If the object is of <code>type Y</code>, it calls <code>Y::foo()</code>. But with self::foo(), <code>X::foo()</code> is always called.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La idea es que </font></font> <code>$this-&gt;foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llama a la </font><font style="vertical-align: inherit;">funci&oacute;n miembro </font></font> <code>foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de lo que sea el tipo exacto del objeto actual. </font><font style="vertical-align: inherit;">Si el objeto es de </font></font> <code>type X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , llama a </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si el objeto es de </font></font> <code>type Y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , llama a </font></font> <code>Y::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Pero con self :: foo (), </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siempre se llama.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>$this-&gt;foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、現在のオブジェクトの正確な型である</font></font> <code>foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メンバー関数を</font><font style="vertical-align: inherit;">呼び出す</font><font style="vertical-align: inherit;">という考え方です</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">オブジェクトの</font></font> <code>type X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、オブジェクトは</font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">オブジェクトの</font></font> <code>type Y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、オブジェクトは</font></font> <code>Y::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">しかし、self :: foo（）では、</font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が常に呼び出されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아이디어는 </font></font> <code>$this-&gt;foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">현재 객체의 정확한 유형에 관계없이 </font></font> <code>foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 멤버 함수를 </font><font style="vertical-align: inherit;">호출한다는 </font><font style="vertical-align: inherit;">것입니다. </font><font style="vertical-align: inherit;">객체의 </font></font> <code>type X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이면 </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 호출합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">객체의 </font></font> <code>type Y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 경우 </font></font> <code>Y::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 self :: foo ()를 사용하면 </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 항상 호출됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Идея состоит в том, что </font></font> <code>$this-&gt;foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывает </font><font style="vertical-align: inherit;">функцию-член </font></font> <code>foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> любого точного типа текущего объекта. </font><font style="vertical-align: inherit;">Если объект имеет </font></font> <code>type X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , он вызывает </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если объект имеет </font></font> <code>type Y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , он вызывает </font></font> <code>Y::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но с self :: foo () </font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывается всегда.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个想法是</font></font> <code>$this-&gt;foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用</font></font> <code>foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">成员函数，而不管当前对象的确切类型是什么。</font><font style="vertical-align: inherit;">如果对象的</font></font> <code>type X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则它将调用</font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果对象的</font></font> <code>type Y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则调用</font></font> <code>Y::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是对于self :: foo（），</font><font style="vertical-align: inherit;">总是会调用</font></font> <code>X::foo()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The interesting thing here is how static calls are made. So let's talk about how we access the state:
es: Lo interesante aquí es cómo se hacen las llamadas estáticas.Así que hablemos de cómo accedemos al estado:
ja: ここで興味深いのは、静的な呼び出しがどのように行われているかということです。では、どのようにして状態にアクセスするのかについてお話しましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 흥미로운 점은 정적 호출 방법입니다. </font><font style="vertical-align: inherit;">우리가 상태에 접근하는 방법에 대해 이야기 해 봅시다 :</font></font>
ru: Интересная вещь здесь-то,как производятся статические звонки.Итак,давайте поговорим о том,как мы получаем доступ к штату:
zh_cn: 这里有趣的是静态调用的方式。那么我们来谈谈如何访问状态。

source: The keyword self does <strong>NOT</strong> refer merely to the 'current class', at least not in a way that restricts you to static members. Within the context of a non-static member, <code>self</code> also provides a way of bypassing the vtable (<a href="https://en.wikipedia.org/wiki/Virtual_method_table">see wiki on vtable</a>) for the current object. Just as you can use <code>parent::methodName()</code> to call the parents version of a function, so you can call <code>self::methodName()</code> to call the current classes implementation of a method.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La palabra clave self </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NO se</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere simplemente a la 'clase actual', al menos no de una manera que lo restrinja a miembros est&aacute;ticos. </font><font style="vertical-align: inherit;">Dentro del contexto de un miembro no est&aacute;tico, </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n proporciona una forma de omitir vtable ( </font></font><a href="https://en.wikipedia.org/wiki/Virtual_method_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ver wiki en vtable</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) para el objeto actual. </font><font style="vertical-align: inherit;">Del mismo modo que puede usar </font></font> <code>parent::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para llamar a la versi&oacute;n principal de una funci&oacute;n, tambi&eacute;n puede llamar a </font></font> <code>self::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para llamar a la implementaci&oacute;n de las clases actuales de un m&eacute;todo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードselfは</font><font style="vertical-align: inherit;">、「現在のクラス」を単に参照するのではなく、少なくとも静的メンバーに制限する方法では参照</font><font style="vertical-align: inherit;">し</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">非静的メンバーのコンテキスト内では、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のオブジェクト</font><font style="vertical-align: inherit;">のvtable（</font></font><a href="https://en.wikipedia.org/wiki/Virtual_method_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">vtableのwikiを参照</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">バイパスする方法も提供し</font><font style="vertical-align: inherit;">ます。</font></font> <code>parent::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">て関数の親バージョンを呼び出す</font><font style="vertical-align: inherit;">ことができるのと同じように</font><font style="vertical-align: inherit;">、</font></font> <code>self::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出してメソッドの現在のクラス実装を呼び出す</font><font style="vertical-align: inherit;">ことができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self 키워드는 </font><font style="vertical-align: inherit;">정적 멤버로 제한하는 방식이 아닌 '현재 클래스'만을 가리키는 것이 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아닙니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">정적이 아닌 멤버의 컨텍스트 내에서 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><font style="vertical-align: inherit;">현재 객체에 대한 </font><font style="vertical-align: inherit;">vtable을 무시하는 방법을 제공합니다 (vtable의 </font></font><a href="https://en.wikipedia.org/wiki/Virtual_method_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">wiki 참조</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">당신이 사용할 수있는 것처럼 </font></font> <code>parent::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 할 수 있도록, 함수의 부모 버전을 호출하는 </font></font> <code>self::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드의 현재 클래스 구현을 호출 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ключевое слово self </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">НЕ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится только к &laquo;текущему классу&raquo;, по крайней мере, не таким образом, который ограничивает вас статическими членами. </font><font style="vertical-align: inherit;">В контексте нестатического члена </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также обеспечивает способ обхода vtable ( </font></font><a href="https://en.wikipedia.org/wiki/Virtual_method_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">см. Wiki по vtable</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) для текущего объекта. </font><font style="vertical-align: inherit;">Так же, как вы можете использовать </font></font> <code>parent::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для вызова родительской версии функции, вы также можете вызвать </font></font> <code>self::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для вызова текущей реализации классов метода.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关键字自不</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只是指&ldquo;当前类的，至少不会在某种程度上，限制你的静态成员。</font><font style="vertical-align: inherit;">在非静态成员的上下文中，</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还提供了一种绕过</font><font style="vertical-align: inherit;">当前对象</font><font style="vertical-align: inherit;">的vtable的方法（</font></font><a href="https://en.wikipedia.org/wiki/Virtual_method_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请参阅vtable上的wiki</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">正如您可以使用</font></font> <code>parent::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用函数的父版本一样，您也可以调用</font></font> <code>self::methodName()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来调用方法的当前类实现。</font></font>
