Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: So now that we have stored that state, we need to access it. This can get a bit tricky (or <strong>way</strong> more than a bit), so let's split this into two viewpoints: from outside of an instance/class (say from a normal function call, or from the global scope), and inside of an instance/class (from within a method on the object).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, ahora que hemos almacenado ese estado, necesitamos acceder a &eacute;l. </font><font style="vertical-align: inherit;">Esto puede ser un poco complicado (o </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mucho</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> m&aacute;s que un poco), as&iacute; que dividamos esto en dos puntos de vista: desde fuera de una instancia / clase (por ejemplo, desde una llamada de funci&oacute;n normal, o desde el alcance global), y dentro de una instancia / class (desde un m&eacute;todo en el objeto).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その状態を保存したので、それにアクセスする必要があります。</font><font style="vertical-align: inherit;">これは少しトリッキー（または得ることができる</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス/クラス（通常の関数呼び出しから、またはグローバルスコープから言う）の外側、およびインスタンスの内部から：ので、2つの視点にのスプリットこれを聞かせて、より多くのビットより） / class（オブジェクトのメソッド内から）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 해당 상태를 저장 했으므로 해당 상태에 액세스해야합니다. </font><font style="vertical-align: inherit;">이 비트를 얻을 수있는 까다로운 (또는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법으로</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 더 많은 비트 이상), 그래서 두 가지 관점으로이 분할하자 : 인스턴스 / 클래스의 외부에서 (일반 함수 호출에서, 또는 글로벌 범위에서 말하는), 그리고 인스턴스의 내부 / class (객체의 메소드 내에서).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь, когда мы сохранили это состояние, нам нужно получить к нему доступ. </font><font style="vertical-align: inherit;">Это может получить немного сложнее (или </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">путь</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> больше , </font><font style="vertical-align: inherit;">чем немного), так что </font><font style="vertical-align: inherit;">давайте разделить это на двух точек зрения: с внешней стороны </font><font style="vertical-align: inherit;">экземпляра / класса (скажем , </font><font style="vertical-align: inherit;">от обычного вызова функции или глобальной области видимости), так </font><font style="vertical-align: inherit;">и внутри экземпляра / класс (изнутри метода объекта).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，既然我们已经存储了该状态，就需要访问它。</font><font style="vertical-align: inherit;">这能有点棘手（或</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方式</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多一点），所以让我们拆到这两种观点：从一个实例/类以外的（说从一个普通的函数调用，或从全球范围），以及一个实例内部/ class（从对象的方法内部）。</font></font>

source: So that's how we expect.
es: Así que así es como esperamos.
ja: ということで、期待しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 우리가 기대하는 방식입니다.</font></font>
ru: Так вот как мы ожидаем.
zh_cn: 所以我们的期望是这样的。

source: So the ID counter is shared across both instances and the children (because we're using <code>self</code> to access it. If we used <code>static</code>, we could override it in a child class).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, el contador de ID se comparte entre ambas instancias y los elementos secundarios (porque estamos usando </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para acceder a &eacute;l. Si utilizamos </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podr&iacute;amos anularlo en una clase secundaria).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IDカウンタが両方のインスタンスと子供たちの間で共有されるので、（私たちが使用しているので、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それにアクセスする。我々が使用している場合</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、我々は、子クラスでそれをオーバーライドすることができます）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 ID 카운터는 인스턴스와 자식 모두에서 공유됩니다 ( </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 액세스하기 때문입니다. </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용 </font><font style="vertical-align: inherit;">하는 경우 자식 클래스에서 재정의 할 수 있음).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, счетчик идентификаторов является общим для обоих экземпляров и дочерних элементов (поскольку мы используем </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для доступа к нему. Если бы мы использовали </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы могли бы переопределить его в дочернем классе).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，ID计数器在实例和子实例之间共享（因为我们使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来访问它。如果使用</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则可以在子类中覆盖它）。</font></font>

source: So to answer the question not as asked ...
es: Así que para responder a la pregunta no como se hizo...
ja: だから尋ねられたようにではなく、質問に答えるために...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 질문대로 대답하지 않기 위해 ...</font></font>
ru: Итак,чтобы ответить на вопрос не так,как было задано...
zh_cn: 所以要回答的问题不是问的问题......

source: So, looking at the above code, calling <code>$foo-&gt;bar()</code> will return <code>true</code>, since the "static" call happens inside of an instance context.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, mirando el c&oacute;digo anterior, llamar a </font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&aacute; </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , ya que la llamada "est&aacute;tica" ocurre dentro de un contexto de instancia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、上記のコードを見ると、</font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出す</font><font style="vertical-align: inherit;">と</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が返され</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。これは、「静的」呼び出しがインスタンスコンテキスト内で発生するためです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font><font style="vertical-align: inherit;">"static"호출이 인스턴스 컨텍스트 내에서 발생하기 때문에 </font><font style="vertical-align: inherit;">위 코드를 보면 </font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">호출하면 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 반환 </font><font style="vertical-align: inherit;">됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Итак, глядя на приведенный выше код, вызов </font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поскольку &laquo;статический&raquo; вызов происходит внутри контекста экземпляра.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，查看上面的代码，调用</font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将返回</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因为&ldquo;静态&rdquo;调用发生在实例上下文内部。</font></font>

source: So, what <strong>is</strong> a <em>class</em>? A lot of people define it as a <em>blueprint</em> or a <em>template</em> for an object. In fact, you can read more <a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835">About Classes In PHP Here</a>. And to some extent that's what it really is. Let's look at a class:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, &iquest;qu&eacute; </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">Mucha gente lo define como un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">plano</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">plantilla</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para un objeto. </font><font style="vertical-align: inherit;">De hecho, puede leer m&aacute;s </font></font><a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sobre las clases en PHP aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y hasta cierto punto, eso es lo que realmente es. </font><font style="vertical-align: inherit;">Veamos una clase:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">だから、何</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">である</font></font></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font><font style="vertical-align: inherit;">多くの人がそれを</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">青写真</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font><font style="vertical-align: inherit;">オブジェクトの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テンプレート</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として定義し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">実際、</font></font><a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPのクラスについてはこちらを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧ください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">そして、それが実際にはある程度です。</font><font style="vertical-align: inherit;">クラスを見てみましょう：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그럼, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이다 </font></font></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스는</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">많은 사람들이 그것을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">청사진</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이나 </font><font style="vertical-align: inherit;">객체 </font><font style="vertical-align: inherit;">의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 정의 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">실제로, </font></font><a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 클래스에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 </font><font style="vertical-align: inherit;">정보는 여기를 참조하십시오</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그리고 그것은 어느 정도 그것이 진짜입니다. </font><font style="vertical-align: inherit;">수업을 봅시다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Итак, что </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это </font></font></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">класс</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">Многие люди определяют его как </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проект</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">шаблон</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для объекта. </font><font style="vertical-align: inherit;">На самом деле, вы можете прочитать больше </font></font><a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">о классах в PHP здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">И в какой-то степени это то, что есть на самом деле. </font><font style="vertical-align: inherit;">Давайте посмотрим на класс:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">那么，什么</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font><font style="vertical-align: inherit;">许多人将其定义</font><font style="vertical-align: inherit;">为对象</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">蓝图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模板</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">实际上，您可以</font></font><a href="https://stackoverflow.com/questions/2206387/what-is-a-class-in-php/2206835#2206835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在此处</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">阅读有关</font><font style="vertical-align: inherit;">PHP中的类的</font><font style="vertical-align: inherit;">更多信息</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在某种程度上，这就是真正的含义。</font><font style="vertical-align: inherit;">让我们看一课：</font></font>

source: So, you should use self only when <code>$this</code> is not available, or when you don&rsquo;t want to allow descendant classes to overwrite the current method.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, debe usar self solo cuando </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no est&aacute; disponible, o cuando no desea permitir que las clases descendientes sobrescriban el m&eacute;todo actual.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が使用できない場合、または子孫クラスが現在のメソッドを上書きできないようにする場合に</font><font style="vertical-align: inherit;">のみ、selfを使用する必要</font><font style="vertical-align: inherit;">があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용할 수 없거나 자손 클래스가 현재 메소드를 겹쳐 쓰지 못하게하려는 경우 </font><font style="vertical-align: inherit;">에만 self를 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, вы должны использовать self только тогда, когда </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> недоступно, или если вы не хотите, чтобы классы-потомки перезаписывали текущий метод.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，仅在</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不可用时，或者不想让子孙类覆盖当前方法时，</font><font style="vertical-align: inherit;">才应使用self </font><font style="vertical-align: inherit;">。</font></font>

source: State and Methods
es: Estado y métodos
ja: 状態と方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상태 및 방법</font></font>
ru: Состояние и методы
zh_cn: 国家和方法

source: Static Methods (i.e. public static View::format_phone_number($digits)) can be used WITHOUT first instantiating one of those objects (i.e. They do not internally refer to $this).
es: Los métodos estáticos (es decir,la vista estática pública::formato_número_de_teléfono($dígitos))pueden ser usados SIN tener que instanciar primero uno de esos objetos (es decir,no se refieren internamente a $esto).
ja: 静的メソッド (すなわち、public static View::format_phone_number($digits))は、それらのオブジェクトのいずれかを最初にインスタンス化しなくても使用できます (つまり、内部的に $this を参照しません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 메소드 (예 : public static View :: format_phone_number ($ digits))는 먼저 해당 오브젝트 중 하나를 인스턴스화하지 않고 사용할 수 있습니다 (즉, 내부적으로 $ this를 참조하지 않음).</font></font>
ru: Статические методы (т.е.публичный статический вид::format_phone_number($digits))можно использовать БЕЗ первого инстанцирования одного из этих объектов (т.е.они внутренне не относятся к $this).
zh_cn: 静态方法(即 public static View::::format_phone_number($digits))可以在不首先实例化这些对象的情况下使用(即它们不在内部引用$this)。

source: TL/DR #2
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TL / DR # 2</font></font>

source: TL/DR #3
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TL / DR # 3</font></font>

source: The <em>object-operator</em><code>-&gt;</code> is still used to make calls to the object's instance state.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">operador de objeto </font></font></em> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> todav&iacute;a se usa para hacer llamadas al estado de instancia del objeto.</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト・オペレータは、</font></font></em> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まだ、オブジェクトのインスタンス状態への呼び出しを行うために使用されています。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 연산자 </font></font></em> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여전히 객체의 인스턴스 상태에 대한 호출을 만드는 데 사용됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оператор </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">объекта </font></font></em> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по-прежнему используется для вызова состояния экземпляра объекта.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象的运营商</font></font></em> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还是用来对对象的实例状态的呼叫。</font></font>
