Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: $derek is now a specific instance of Person. Every Person has a first_name and a last_name, but $derek has a specific first_name and last_name (Derek Martin). Inside the $derek instance, we can refer to those as $this-&gt;first_name and $this-&gt;last_name
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ derek ahora es una instancia espec&iacute;fica de Person. </font><font style="vertical-align: inherit;">Cada persona tiene un nombre y un apellido, pero $ derek tiene un nombre y apellido espec&iacute;ficos (Derek Martin). </font><font style="vertical-align: inherit;">Dentro de la instancia $ derek, podemos referirnos a ellos como $ this-&gt; first_name y $ this-&gt; last_name</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ derekはPersonの特定のインスタンスになりました。</font><font style="vertical-align: inherit;">すべての人にはfirst_nameとlast_nameがありますが、$ derekには特定のfirst_nameとlast_nameがあります（Derek Martin）。</font><font style="vertical-align: inherit;">$ derekインスタンス内では、$ this-&gt; first_nameおよび$ this-&gt; last_nameとして参照できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ derek은 이제 Person의 특정 인스턴스입니다. </font><font style="vertical-align: inherit;">모든 Person은 first_name과 last_name을 가지고 있지만 $ derek은 특정한 first_name과 last_name을 가지고 있습니다 (Derek Martin). </font><font style="vertical-align: inherit;">$ derek 인스턴스 내에서 $ this-&gt; first_name 및 $ this-&gt; last_name으로 참조 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ derek теперь является конкретным экземпляром Person. </font><font style="vertical-align: inherit;">У каждого персонажа есть имя и фамилия, но у $ derek есть конкретные имя и фамилия (Дерек Мартин). </font><font style="vertical-align: inherit;">Внутри экземпляра $ derek мы можем ссылаться на них как $ this-&gt; first_name и $ this-&gt; last_name</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ derek现在是Person的特定实例。</font><font style="vertical-align: inherit;">每个人都有一个名字和一个姓氏，但是$ derek有一个特定的名字和姓氏（Derek Martin）。</font><font style="vertical-align: inherit;">在$ derek实例中，我们可以将它们称为$ this-&gt; first_name和$ this-&gt; last_name</font></font>

source: <code>$this-&gt;</code> is used to refer to a specific instance of a class's variables (member variables) or methods.
es: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa para referirse a una instancia espec&iacute;fica de las variables o m&eacute;todos de una clase (variables miembro).</font></font>
ja: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、クラスの変数（メンバー変数）またはメソッドの特定のインスタンスを参照するために使用されます。</font></font>
ko: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 클래스 변수 (멤버 변수) 또는 메서드의 특정 인스턴스를 나타내는 데 사용됩니다.</font></font>
ru: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется для ссылки на конкретный экземпляр переменных класса (переменных-членов) или методов.</font></font>
zh_cn: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于引用类变量（成员变量）或方法的特定实例。</font></font>

source: <code>$this-&gt;</code> refers to the current object (an instance of a class), whereas <code>static::</code> refers to a class
es: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto actual (una instancia de una clase), mientras que </font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a una clase</font></font>
ja: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のオブジェクト（クラスのインスタンス）を</font><font style="vertical-align: inherit;">参照し</font><font style="vertical-align: inherit;">ますが、</font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はクラスを参照し</font><font style="vertical-align: inherit;">ます</font></font>
ko: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체 (클래스의 인스턴스)를 나타내는 반면 </font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 클래스를 나타냅니다.</font></font>
ru: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на текущий объект (экземпляр класса), тогда как </font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на класс</font></font>
zh_cn: <code>$this-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前对象（类的实例），而</font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用类</font></font>

source: <code>$this</code> can be used to call static functions
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar para llamar a funciones est&aacute;ticas</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は静的関数を呼び出すために使用できます</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 함수를 호출하는 데 사용할 수 있습니다</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно использовать для вызова статических функций</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可用于调用静态函数</font></font>

source: <code>$this</code> can not be used inside static functions
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no se puede usar dentro de funciones est&aacute;ticas</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は静的関数内では使用できません</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 함수 내에서 사용할 수 없습니다</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> нельзя использовать внутри статических функций</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不能在静态函数中使用</font></font>

source: <code>$this</code> refers current object. You can use static instead of self. See the example:
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto actual. </font><font style="vertical-align: inherit;">Puedes usar static en lugar de self. </font><font style="vertical-align: inherit;">Mira el ejemplo:</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のオブジェクトを参照します。</font><font style="vertical-align: inherit;">自分の代わりに静的を使用できます。</font><font style="vertical-align: inherit;">例を参照してください。</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체를 나타냅니다. </font><font style="vertical-align: inherit;">self 대신 static을 사용할 수 있습니다. </font><font style="vertical-align: inherit;">예를보십시오 :</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему объекту. </font><font style="vertical-align: inherit;">Вы можете использовать статические вместо себя. </font><font style="vertical-align: inherit;">Смотрите пример:</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前对象。</font><font style="vertical-align: inherit;">您可以使用静态而不是自我。</font><font style="vertical-align: inherit;">参见示例：</font></font>

source: <code>$this</code> refers to the current class object, <code>self</code> refers to the current class (Not object). The class is the blueprint of the object. So you define a class, but you construct objects.
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto de clase actual, </font></font> <code>self</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la clase actual (No objeto). </font><font style="vertical-align: inherit;">La clase es el plano del objeto. </font><font style="vertical-align: inherit;">Entonces usted define una clase, pero construye objetos.</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のクラスオブジェクトを</font><font style="vertical-align: inherit;">指し</font><font style="vertical-align: inherit;">、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のクラス（オブジェクトではない）を指します。</font><font style="vertical-align: inherit;">クラスはオブジェクトの青写真です。</font><font style="vertical-align: inherit;">したがって、クラスを定義しますが、オブジェクトを作成します。</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 클래스 객체 </font><font style="vertical-align: inherit;">를 나타내고 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 클래스를 나타냅니다 (객체 아님). </font><font style="vertical-align: inherit;">클래스는 객체의 청사진입니다. </font><font style="vertical-align: inherit;">따라서 클래스를 정의하지만 객체를 생성합니다.</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему классу объекта, </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему классу (не объекту). </font><font style="vertical-align: inherit;">Класс - это план объекта. </font><font style="vertical-align: inherit;">Итак, вы определяете класс, но вы создаете объекты.</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指当前类的对象，</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指当前类（非对象）。</font><font style="vertical-align: inherit;">该类是对象的蓝图。</font><font style="vertical-align: inherit;">因此，您定义了一个类，但是构造了对象。</font></font>

source: <code>$this</code> refers to the current object
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto actual</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のオブジェクトを参照します</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체를 나타냅니다</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к текущему объекту</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指向当前对象</font></font>

source: <code>$this</code> requires an instance of the class
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> requiere una instancia de la clase</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にはクラスのインスタンスが必要です</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스의 인스턴스가 필요합니다</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> требует экземпляра класса</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要该类的实例</font></font>

source: <code>$this</code> should not be used to call static member variables. Use <code>self</code> instead.
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no debe usarse para llamar a variables miembro est&aacute;ticas. </font><font style="vertical-align: inherit;">Use </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font><font style="vertical-align: inherit;">su</font><font style="vertical-align: inherit;"> lugar.</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して静的メンバー変数を呼び出すことはできません。</font><font style="vertical-align: inherit;">代わりに</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 멤버 변수를 호출하는 데 사용해서는 안됩니다. </font><font style="vertical-align: inherit;">대신 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не следует использовать для вызова статических переменных-членов. </font><font style="vertical-align: inherit;">Вместо этого </font><font style="vertical-align: inherit;">используйте </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不应用于调用静态成员变量。</font><font style="vertical-align: inherit;">改用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <code>$this</code>, on the other hand, is used to call an instance and methods of any class as long as that class is accessible.
es: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por otro lado, se usa para llamar a una instancia y m&eacute;todos de cualquier clase siempre que esa clase sea accesible.</font></font>
ja: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、</font><font style="vertical-align: inherit;">$ thisは</font><font style="vertical-align: inherit;">、そのクラスがアクセス可能である限り、任意のクラスのインスタンスとメソッドを呼び出すために使用されます。</font></font>
ko: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면 </font><font style="vertical-align: inherit;">$ this</font><font style="vertical-align: inherit;"> 는 해당 클래스에 액세스 할 수있는 한 모든 클래스의 인스턴스와 메서드를 호출하는 데 사용됩니다.</font></font>
ru: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , с другой стороны, используется для вызова экземпляра и методов любого класса, если этот класс доступен.</font></font>
zh_cn: <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一方面，</font><font style="vertical-align: inherit;">$ this</font><font style="vertical-align: inherit;">用于调用任何类的实例和方法，只要该类是可访问的。</font></font>

source: <code>-&gt;</code> - <em>object-operator</em> - This is always used when we're accessing an instance.
es: <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">object-operator</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : esto siempre se usa cuando accedemos a una instancia.</font></font>
ja: <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">object-operator-</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、インスタンスにアクセスするときに常に使用されます。</font></font>
ko: <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">object-operator-</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스에 액세스 할 때 항상 사용됩니다.</font></font>
ru: <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">объект-оператор</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Это всегда используется, когда мы обращаемся к экземпляру.</font></font>
zh_cn: <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象操作符</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -当我们访问实例时总是使用它。</font></font>

source: <code>::</code> - <em>scope-resolution-operator</em> - This is always used to access a Class static property or method.
es: <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scope-resolution-operator</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Esto siempre se usa para acceder a una propiedad o m&eacute;todo est&aacute;tico de Clase.</font></font>
ja: <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scope-resolution-operator-</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは常に、クラスの静的プロパティまたはメソッドにアクセスするために使用されます。</font></font>
ko: <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scope-resolution-operator-</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 항상 클래스 정적 속성 또는 메서드에 액세스하는 데 사용됩니다.</font></font>
ru: <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scope-resolution-operator</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - всегда используется для доступа к статическому свойству или методу Class.</font></font>
zh_cn: <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scope-resolution-operator-</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始终用于访问Class静态属性或方法。</font></font>

source: <code>parent</code> - This refers to the parent of the current class.
es: <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Esto se refiere al padre de la clase actual.</font></font>
ja: <code>parent</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、現在のクラスの親を指します。</font></font>
ko: <code>parent</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 현재 클래스의 부모를 나타냅니다.</font></font>
ru: <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - относится к родителю текущего класса.</font></font>
zh_cn: <code>parent</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是指当前类的父级。</font></font>
