Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you want to call it outside of the class, use <code>classA::POUNDS_TO_KILOGRAMS</code> to access the constants
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea llamarlo fuera de la clase, use </font></font> <code>classA::POUNDS_TO_KILOGRAMS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para acceder a las constantes</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスの外で呼び出す場合は、</font></font> <code>classA::POUNDS_TO_KILOGRAMS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して定数にアクセスします</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 외부에서 호출하려면 </font></font> <code>classA::POUNDS_TO_KILOGRAMS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 상수에 액세스하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите вызвать его вне класса, используйте </font></font> <code>classA::POUNDS_TO_KILOGRAMS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для доступа к константам</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要在类之外调用它，请使用</font></font> <code>classA::POUNDS_TO_KILOGRAMS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问常量。</font></font>

source: In PHP 5, what is the difference between using <code>self</code> and <code>$this</code>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En PHP 5, &iquest;cu&aacute;l es la diferencia entre usar </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5では、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">違いは何</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5에서 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하는 것의 차이점은 무엇 </font><font style="vertical-align: inherit;">입니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В PHP 5, в чем разница между использованием </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在PHP 5中，使用</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">什么</font><font style="vertical-align: inherit;">区别</font><font style="vertical-align: inherit;">？</font></font>

source: In PHP, you use the self keyword to access static properties and methods.
es: En PHP,se utiliza la palabra clave propia para acceder a las propiedades y métodos estáticos.
ja: PHP では、静的なプロパティやメソッドにアクセスするには self キーワードを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP에서는 self 키워드를 사용하여 정적 속성 및 메서드에 액세스합니다.</font></font>
ru: В PHP для доступа к статическим свойствам и методам вы используете собственное ключевое слово.
zh_cn: 在PHP中,你可以使用self关键字来访问静态属性和方法。

source: In general you'll want to use what's known as Late-Static-Binding by using <code>static</code> instead of <code>self</code>. But note that they are not the same thing, so saying "always use <code>static</code> instead of <code>self</code> is really short-sighted. Instead, stop and think about the call you want to make and think if you want child classes to be able to override that <em>static resolved</em> call.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En general, querr&aacute; usar lo que se conoce como enlace est&aacute;tico tard&iacute;o mediante el uso de </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Pero tenga en cuenta que no son lo mismo, por lo que decir "siempre usar </font></font> <code>static</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es realmente miope. En cambio, det&eacute;ngase y piense en la llamada que desea hacer y piense si desea que las clases secundarias puedan anular eso </font><font style="vertical-align: inherit;">llamada </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">est&aacute;tica resuelta</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一般的に、あなたは使用して後期スタティックバインディングとして知られているものを使用したいと思う</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の代わりに、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、これらは同じではないため、「常に</font> <code>self</code> <font style="vertical-align: inherit;">ではなく</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用するの</font><font style="vertical-align: inherit;">は近視眼です。代わりに、作成する呼び出しを停止して、子クラスでオーバーライドできるようにするかどうかを検討してください。</font><em><font style="vertical-align: inherit;">静的解決された</font></em><font style="vertical-align: inherit;">呼び出し。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 </font> <code>self</code> <font style="vertical-align: inherit;"> 대신 </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하여 Late-Static-Binding을 사용하려고합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 그것들은 같은 것이 아니므로 " </font> <code>self</code> <font style="vertical-align: inherit;"> 대신 </font><font style="vertical-align: inherit;">항상 </font> <code>static</code> <font style="vertical-align: inherit;"> 사용하는 </font><font style="vertical-align: inherit;">것은 근시안적입니다. </font><font style="vertical-align: inherit;">"라고 말하고 싶은 말을 </font><font style="vertical-align: inherit;">멈추고 생각하고 자식 클래스가 그것을 무시할 수 있기를 원한다면 </font><em><font style="vertical-align: inherit;">정적 해결 된</font></em><font style="vertical-align: inherit;"> 호출.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В общем, вы захотите использовать то, что известно как Late-Static-Binding, используя </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но обратите внимание, что это не одно и то же, поэтому выражение &laquo;всегда использовать </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> действительно недальновидно. Вместо этого остановитесь и подумайте о вызове, который вы хотите сделать, и подумайте, хотите ли вы, чтобы дочерние классы могли его переопределить. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статический разрешенный</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通常，您将希望通过使用</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来使用所谓的Late-Static-Binding </font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是请注意，它们不是一回事，所以说&ldquo;总是使用</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是很短视的。相反，停下来想一想您要进行的调用，并考虑是否希望子类能够覆盖该调用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态解决的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼叫。</font></font>

source: In this example, <code>self::who()</code> will always output &lsquo;parent&rsquo;, while <code>$this-&gt;who()</code> will depend on what class the object has.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En este ejemplo, </font></font> <code>self::who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siempre generar&aacute; 'parent', mientras que </font></font> <code>$this-&gt;who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> depender&aacute; de la clase que tenga el objeto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この例では、</font></font> <code>self::who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は常に「親」を出力しますが、</font></font> <code>$this-&gt;who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオブジェクトが持つクラスに依存します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 예제에서 </font></font> <code>self::who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 항상 'parent'를 출력하지만 </font></font> <code>$this-&gt;who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 객체의 클래스에 따라 다릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В этом примере </font></font> <code>self::who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> всегда будет выводить parent, тогда как </font></font> <code>$this-&gt;who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет зависеть от того, какой класс имеет объект.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在此示例中，</font></font> <code>self::who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将始终输出&ldquo; parent&rdquo;，而</font></font> <code>$this-&gt;who()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将取决于对象具有的类。</font></font>

source: Inside a class definition, <code>$this</code> refers to the current object, while <code>self</code> refers to the current class.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro de una definici&oacute;n de clase, </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al objeto actual, mientras </font></font> <code>self</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere a la clase actual.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス定義内では、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のオブジェクトを示し、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在のクラスを示します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 정의 내에서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체를 나타내고 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 클래스를 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Внутри определения класса </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на текущий объект, а </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылается на текущий класс.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在类定义中，</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前对象，而</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用当前类。</font></font>

source: Inside of a method, an object's instance is represented by the <code>$this</code> variable. The current state of that object is there, and mutating (changing) any property will result in a change to that instance (but not others).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro de un m&eacute;todo, la instancia de un objeto est&aacute; representada por la </font><font style="vertical-align: inherit;">variable </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">El estado actual de ese objeto est&aacute; all&iacute;, y la mutaci&oacute;n (cambio) de cualquier propiedad dar&aacute; como resultado un cambio en esa instancia (pero no en otras).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド内では、オブジェクトのインスタンスは</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数で</font><font style="vertical-align: inherit;">表され</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そのオブジェクトの現在の状態がそこにあり、プロパティを変更（変更）すると、そのインスタンスが変更されます（他のインスタンスは変更されません）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메소드 내부에서 객체의 인스턴스는 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수로 </font><font style="vertical-align: inherit;">표시됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">해당 객체의 현재 상태가 있으며 속성을 변경 (변경)하면 해당 인스턴스가 변경되지만 다른 인스턴스는 변경되지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Внутри метода экземпляр объекта представлен </font><font style="vertical-align: inherit;">переменной </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Текущее состояние этого объекта есть, и изменение (изменение) любого свойства приведет к изменению этого экземпляра (но не других).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在方法内部，对象的实例由</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量表示。</font><font style="vertical-align: inherit;">该对象的当前状态在那里，并且更改（更改）任何属性都将导致该实例（但其他实例）不发生更改。</font></font>

source: Inside the DB class, if we were referring to a static method of some other object, we would use the object's name: <strong>Example:</strong> Session::getUsersOnline();
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro de la clase DB, si nos referi&eacute;ramos a un m&eacute;todo est&aacute;tico de alg&uacute;n otro objeto, </font><font style="vertical-align: inherit;">usar&iacute;amos </font><font style="vertical-align: inherit;">el nombre del objeto: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Session :: getUsersOnline ();</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DBクラス内で、他のオブジェクトの静的メソッドを参照している場合は、オブジェクトの名前を使用します。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Session :: getUsersOnline（）;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB 클래스 내에서 다른 객체의 정적 메서드를 참조하는 경우 객체 이름을 사용합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Session :: getUsersOnline ();</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Внутри класса DB, если бы мы ссылались на статический метод какого-либо другого объекта, мы бы использовали имя объекта: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Session :: getUsersOnline ();</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在DB类内部，如果我们要引用其他对象的静态方法，则将使用对象的名称： </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Session :: getUsersOnline（）;</font></font>

source: Is not <strong>always</strong> true.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">siempre es</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> verdad.</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正しいと</font><font style="vertical-align: inherit;">は限りませ</font><strong><font style="vertical-align: inherit;">ん</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사실 </font><font style="vertical-align: inherit;">은 아닙니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всегда</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> так.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并非</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">总是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如此。</font></font>

source: It also represents the usage of <code>$object::CONSTANT</code> for example <code>echo $foo::NAME;</code> as opposed to <code>$this::NAME;</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n representa el uso de </font></font> <code>$object::CONSTANT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por ejemplo </font></font> <code>echo $foo::NAME;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a diferencia de </font></font> <code>$this::NAME;</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font> <code>$object::CONSTANT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用法も示し</font></font> <code>echo $foo::NAME;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font><font style="vertical-align: inherit;">echo $ foo :: NAME; </font> <code>$this::NAME;</code> <font style="vertical-align: inherit;">とは対照的</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font></font> <code>$object::CONSTANT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 사용법을 나타냅니다 ( </font><font style="vertical-align: inherit;">예 : </font></font> <code>echo $foo::NAME;</code> <font style="vertical-align: inherit;"> <code>$this::NAME;</code> <font style="vertical-align: inherit;"> 과 반대로 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он также представляет использование </font></font> <code>$object::CONSTANT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> например, </font></font> <code>echo $foo::NAME;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в отличие от </font></font> <code>$this::NAME;</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它还代表</font></font> <code>$object::CONSTANT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的用法，</font><font style="vertical-align: inherit;">例如</font></font> <code>echo $foo::NAME;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>$this::NAME;</code>
