Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Whenever you are using <strong>static methods</strong> or <strong>static attributes</strong> and want to call them without having an object of the class instantiated you need to use <code>self:</code> to call them, because <code>$this</code> always requires on object to be created.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Siempre que est&eacute; utilizando </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&eacute;todos est&aacute;ticos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">atributos est&aacute;ticos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y desee llamarlos sin tener un objeto de la clase instanciado, debe usar </font></font> <code>self:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para llamarlos, porque </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siempre requiere que se cree un objeto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用しているときはいつでも</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、静的メソッド</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的属性を</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">し、クラスのオブジェクトがなくても、それらを呼びたいあなたが使用する必要がインスタンス化</font></font> <code>self:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、それらを呼び出すために</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に作成されるオブジェクトに必要です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 때마다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 방법</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 속성</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 클래스의 객체를하지 않고 그들에게 전화하려는 당신이 사용에 필요한 인스턴스 </font></font> <code>self:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때문에, 그들을 호출 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 항상 생성 할 객체가 필요합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Всякий раз, когда вы используете </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статические методы</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статические атрибуты</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и хотите вызывать их без создания экземпляра объекта класса, вам нужно использовать </font></font> <code>self:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для их вызова, потому что </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> всегда требует создания объекта.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每当您使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态方法</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态属性</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且要在不实例化类的对象的情况下</font><font style="vertical-align: inherit;">调用它们时，</font><font style="vertical-align: inherit;">都需要</font><font style="vertical-align: inherit;">使用</font></font> <code>self:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来调用它们，因为</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始终要求在对象上创建对象。</font></font>

source: Within a static context
es: En un contexto estático
ja: 静的なコンテキストの中で
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 컨텍스트 내</font></font>
ru: В статическом контексте
zh_cn: 在静态背景下

source: Within a static context, any calls made using <code>::</code> will also be static. Let's look at an example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro de un contexto est&aacute;tico, cualquier llamada realizada usando </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n ser&aacute; est&aacute;tica. </font><font style="vertical-align: inherit;">Veamos un ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的コンテキスト内では、</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して行われた呼び出し</font><font style="vertical-align: inherit;">もすべて静的です。</font><font style="vertical-align: inherit;">例を見てみましょう：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 컨텍스트 내에서 </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용한 모든 호출 </font><font style="vertical-align: inherit;">도 정적입니다. </font><font style="vertical-align: inherit;">예를 보자.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В статическом контексте любые вызовы, сделанные с использованием </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , также будут статическими. </font><font style="vertical-align: inherit;">Давайте посмотрим на пример:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在静态上下文中，使用</font></font> <code>::</code> 进行的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任何调用</font><font style="vertical-align: inherit;">也将是静态的。</font><font style="vertical-align: inherit;">让我们看一个例子：</font></font>

source: Within an instance context
es: En el contexto de una instancia
ja: インスタンスコンテキスト内で
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스 컨텍스트 내</font></font>
ru: В контексте конкретного случая
zh_cn: 在一个实例上下文中

source: Within an instance context on the other hand, calls made using <code>::</code> depend on the receiver of the call (the method we're calling). If the method is defined as <code>static</code>, then it will use a static call. If it's not, it will forward the instance information.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por otro lado, dentro de un contexto de instancia, las llamadas realizadas usando </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dependen del receptor de la llamada (el m&eacute;todo al que estamos llamando). </font><font style="vertical-align: inherit;">Si el m&eacute;todo se define como </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , utilizar&aacute; una llamada est&aacute;tica. </font><font style="vertical-align: inherit;">Si no es as&iacute;, reenviar&aacute; la informaci&oacute;n de la instancia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、インスタンスコンテキスト内では、</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して行われ</font><font style="vertical-align: inherit;">た呼び出しは、呼び出しの受信者（呼び出しているメソッド）によって異なります。</font><font style="vertical-align: inherit;">メソッドが</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として定義されて</font><font style="vertical-align: inherit;">いる</font><font style="vertical-align: inherit;">場合は</font><font style="vertical-align: inherit;">、静的呼び出しを使用します。</font><font style="vertical-align: inherit;">そうでない場合は、インスタンス情報を転送します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면 인스턴스 컨텍스트 내에서 </font></font> <code>::</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 만든 호출은 호출 </font><font style="vertical-align: inherit;">수신자 (우리가 호출하는 방법)에 따라 다릅니다. </font><font style="vertical-align: inherit;">메소드가 </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 정의 </font><font style="vertical-align: inherit;">되면 정적 호출을 사용합니다. </font><font style="vertical-align: inherit;">그렇지 않은 경우 인스턴스 정보를 전달합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С другой стороны, в контексте экземпляра вызовы, выполняемые с использованием </font></font> <code>::</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> зависят от получателя вызова (метода, который мы вызываем). </font><font style="vertical-align: inherit;">Если метод определен как </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , он будет использовать статический вызов. </font><font style="vertical-align: inherit;">Если это не так, он перешлет информацию об экземпляре.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一方面，在实例上下文中，使用</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行的调用取决于</font><font style="vertical-align: inherit;">调用</font><font style="vertical-align: inherit;">的接收者（我们正在调用的方法）。</font><font style="vertical-align: inherit;">如果该方法定义为</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则它将使用静态调用。</font><font style="vertical-align: inherit;">如果不是，它将转发实例信息。</font></font>

source: Word Of Caution #1
es: Palabra de precaución #1
ja: 注意事項その1
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주의의 말 # 1</font></font>
ru: Слово предосторожности #1
zh_cn: 注意事项#1

source: Word Of Caution #2
es: Palabra de precaución #2
ja: 注意事項その2
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주의의 말 # 2</font></font>
ru: Слово предостережения №2
zh_cn: 注意事项#2

source: Word Of Caution #3
es: Palabra de precaución #3
ja: 注意の言葉その3
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주의 사항 # 3</font></font>
ru: Слово предостережения №3
zh_cn: 注意事项#3

source: You can use the <strong>self::</strong> keyword in another class and access the static members, method and constants. When it will be extends from parent class and same in case of <strong>$this</strong> keyword. You can access the non static members, method and function in another class when it will be extends from parent class.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar la </font><font style="vertical-align: inherit;">palabra clave </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en otra clase y acceder a los miembros est&aacute;ticos, el m&eacute;todo y las constantes. </font><font style="vertical-align: inherit;">Cu&aacute;ndo se extender&aacute; desde la clase padre e igual en el caso de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> keyword. </font><font style="vertical-align: inherit;">Puede acceder a los miembros no est&aacute;ticos, el m&eacute;todo y la funci&oacute;n en otra clase cuando se extender&aacute; desde la clase principal.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別のクラスで</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードを</font><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">、静的メンバー、メソッド、および定数にアクセスできます。</font><font style="vertical-align: inherit;">親クラスから拡張される場合、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードの</font><font style="vertical-align: inherit;">場合も同じ</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">親クラスから拡張される場合、別のクラスの非静的メンバー、メソッド、および関数にアクセスできます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 사용할 수있는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자체 ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 클래스 및 액세스 정적 멤버, 방법 및 상수 키워드를. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 키워드의 </font><font style="vertical-align: inherit;">경우 부모 클래스에서 확장 될 때와 동일 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">부모 클래스에서 확장 될 때 다른 클래스의 비 정적 멤버, 메서드 및 함수에 액세스 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font><font style="vertical-align: inherit;">ключевое слово </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в другом классе и получить доступ к статическим членам, методам и константам. </font><font style="vertical-align: inherit;">Когда это будет продолжаться от родительского класса и то же самое в случае </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ этого</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ключевого слова. </font><font style="vertical-align: inherit;">Вы можете получить доступ к нестатическим членам, методам и функциям в другом классе, когда он будет расширяться из родительского класса.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以</font><font style="vertical-align: inherit;">在另一个类中</font><font style="vertical-align: inherit;">使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关键字，并访问静态成员，方法和常量。</font><font style="vertical-align: inherit;">当它从父类扩展时，对于</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关键字也是如此。</font><font style="vertical-align: inherit;">从父类扩展后，您可以访问另一个类中的非静态成员，方法和函数。</font></font>

source: also in child/parent scenario <code>self / parent</code> is mostly used to identified child and parent class members and methods.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tambi&eacute;n en el escenario secundario / primario, </font></font> <code>self / parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa principalmente para identificar a los miembros y m&eacute;todos de la clase principal y secundaria.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子/親シナリオでも、</font></font> <code>self / parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は主に、子クラスと親クラスのメンバーとメソッドを識別するために使用されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 자식 / 부모 시나리오에서 </font></font> <code>self / parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 주로 자식 및 부모 클래스 멤버와 메소드를 식별하는 데 사용됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">также в дочернем / родительском сценарии </font></font> <code>self / parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чаще всего используется для идентификации дочерних и родительских членов класса и методов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在孩子/父母场景中，</font></font> <code>self / parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也通常用于标识孩子和父母类的成员和方法。</font></font>
