Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Here is an example of <strong>incorrect</strong> usage of <code>$this</code> and <code>self</code> for non-static and static member variables:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo del </font><font style="vertical-align: inherit;">uso </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">incorrecto</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para variables miembro no est&aacute;ticas y est&aacute;ticas:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下は、</font><font style="vertical-align: inherit;">非静的および静的メンバー変数に対する</font> <code>$this</code> <font style="vertical-align: inherit;">および</font> <code>self</code> <font style="vertical-align: inherit;">の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">誤った</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">例</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비 정적 및 정적 멤버 변수 </font><font style="vertical-align: inherit;">에 </font> <code>$this</code> <font style="vertical-align: inherit;"> 및 </font> <code>self</code> <font style="vertical-align: inherit;"> 를 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잘못</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하는 예는 다음과 같습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">неправильного</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использования </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для нестатических и статических переменных-членов:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font><font style="vertical-align: inherit;">对非静态和静态成员变量</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的示例</font><font style="vertical-align: inherit;">：</font></font>

source: Here is an example of <strong>polymorphism</strong> with <code>$this</code> for member functions:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">polimorfismo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para funciones miembro:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでの例である</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多型</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メンバ関数のためには：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음의 예는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다형성</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 멤버 함수는 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">полиморфизма</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для функций-членов:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font><font style="vertical-align: inherit;">成员函数</font><font style="vertical-align: inherit;">带有</font> <code>$this</code> <font style="vertical-align: inherit;">的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多态</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Here is an example of <strong>suppressing polymorphic behaviour</strong> by using <code>self</code> for member functions:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">supresi&oacute;n del comportamiento polim&oacute;rfico</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mediante el uso de </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para funciones miembro:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に</font><font style="vertical-align: inherit;">、メンバー関数に</font> <code>self</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多態性の動作</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><strong><font style="vertical-align: inherit;">抑制する</font></strong><font style="vertical-align: inherit;">例を示し</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 </font><font style="vertical-align: inherit;">멤버 함수에 </font> <code>self</code> <font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다형성 동작</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><strong><font style="vertical-align: inherit;">억제</font></strong><font style="vertical-align: inherit;"> 하는 예입니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подавления полиморфного поведения</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с использованием </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для функций-членов:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是</font><font style="vertical-align: inherit;">通过将</font> <code>self</code> <font style="vertical-align: inherit;">用作成员函数</font><font style="vertical-align: inherit;">来</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抑制多态行为</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的示例</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Here is an example of correct usage of $this and self for non-static and static member variables:
es: Aquí hay un ejemplo de uso correcto de $this and self para las variables de miembros no estáticos y estáticos:
ja: ここでは、非静的および静的なメンバー変数のための$thisとselfの正しい使い方の例を示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비 정적 및 정적 멤버 변수에 $ this 및 self를 올바르게 사용하는 예는 다음과 같습니다.</font></font>
ru: Приведем пример корректного использования $this и self для нестатических и статических членских переменных:
zh_cn: 下面是一个关于非静态和静态成员变量$this和self的正确用法的例子。

source: Hope that helps clear things up :)
es: Espero que eso ayude a aclarar las cosas :)
ja: それが物事を明確にするのに役立つことを願っています :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">희망은 일을 정리하는 데 도움이됩니다. :)</font></font>
ru: Надежда,которая поможет прояснить ситуацию :)
zh_cn: 希望这能帮助澄清事情的真相:)

source: I believe question was not whether you can call the static member of the class by calling <code>ClassName::staticMember</code>. Question was what's the difference between using <code>self::classmember</code> and <code>$this-&gt;classmember</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo que la pregunta no era si puede llamar al miembro est&aacute;tico de la clase llamando a </font></font> <code>ClassName::staticMember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La pregunta era cu&aacute;l es la diferencia entre usar </font></font> <code>self::classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>$this-&gt;classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ClassName::staticMember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出してクラスの静的メンバーを呼び出すことができるかどうかは問題ではなかったと</font><font style="vertical-align: inherit;">思い</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">問題は、</font></font> <code>self::classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>$this-&gt;classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用の違い</font><font style="vertical-align: inherit;">です</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ClassName::staticMember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출하여 클래스의 정적 멤버를 호출 할 수 있는지 여부는 질문이 아니라고 생각합니다 </font><font style="vertical-align: inherit;">. </font></font> <code>self::classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>$this-&gt;classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 차이점은 무엇 </font><font style="vertical-align: inherit;">입니까</font><font style="vertical-align: inherit;"> ?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я считаю , </font><font style="vertical-align: inherit;">что вопрос не может ли вызвать статический член класса, вызвав </font></font> <code>ClassName::staticMember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вопрос в том, в чем разница между использованием </font></font> <code>self::classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>$this-&gt;classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我相信问题不是您是否可以通过调用</font></font> <code>ClassName::staticMember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来调用类的静态成员</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">问题是使用</font></font> <code>self::classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>$this-&gt;classmember</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: I ran into the same question and the simple answer is:
es: Me encontré con la misma pregunta y la respuesta simple es:
ja: 同じ質問にぶつかったのですが、簡単な答えはこうです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 같은 질문에 부딪 쳤고 간단한 대답은 다음과 같습니다.</font></font>
ru: Я столкнулся с тем же вопросом,и простой ответ:
zh_cn: 我遇到了同样的问题,简单的答案是。

source: If a method is called statically, the <code>$this</code> variable <em>is not defined</em>. This is because there's no instance associated with a static call.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si un m&eacute;todo se llama est&aacute;ticamente, la </font><font style="vertical-align: inherit;">variable </font></font> <code>$this</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no est&aacute; definida</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esto se debe a que no hay una instancia asociada con una llamada est&aacute;tica.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドが静的に呼び出された場合、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は定義されません</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは、静的呼び出しに関連付けられたインスタンスがないためです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메소드가 정적으로 호출되면 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는 정의되지 않습니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">정적 호출과 연결된 인스턴스가 없기 때문입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если метод вызывается статически, </font><font style="vertical-align: inherit;">переменная </font></font> <code>$this</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не определена</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это потому, что нет никакого экземпляра, связанного со статическим вызовом.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果静态调用方法，</font><em><font style="vertical-align: inherit;">则不会定义</font></em></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这是因为没有实例与静态调用关联。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: If the object-operator is used (<code>-&gt;</code>), then you <em>always</em> know you're dealing with an instance. If the scope-resolution-operator is used (<code>::</code>), you need more information about the context (are we in an object-context already? Are we outside of an object? etc).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si se usa el operador de objeto ( </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">siempre</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sabr&aacute; que est&aacute; tratando con una instancia. </font><font style="vertical-align: inherit;">Si se utiliza el operador de resoluci&oacute;n de alcance ( </font></font> <code>::</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , necesita m&aacute;s informaci&oacute;n sobre el contexto (&iquest;ya estamos en un contexto de objeto? &iquest;Estamos fuera de un objeto? Etc.).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトオペレーターが使用されている場合（</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）、</font><font style="vertical-align: inherit;">インスタンスを処理していることが</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">わかります。</font><font style="vertical-align: inherit;">scope-resolution-operatorが使用されている場合（</font></font> <code>::</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、コンテキストに関する詳細情報が必要です（既にオブジェクトコンテキストにあるか？オブジェクトの外部にいるか？など）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">object-operator를 사용하는 경우 ( </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스를 처리하고 있다는 것을 알고 있습니다. </font><font style="vertical-align: inherit;">scope-resolution-operator를 사용하는 경우 ( </font></font> <code>::</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 컨텍스트에 대한 추가 정보가 필요합니다 (이미 오브젝트 컨텍스트에 있습니까? 오브젝트 외부에 있습니까? 등).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если используется объект-оператор ( </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), то вы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всегда</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> знаете, что имеете дело с экземпляром. </font><font style="vertical-align: inherit;">Если используется оператор scope-resolution-operator ( </font></font> <code>::</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вам нужна дополнительная информация о контексте (мы уже в объект-контексте? Мы вне объекта? И т. Д.).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果使用对象运算符（</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），则您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始终</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">知道您正在处理实例。</font><font style="vertical-align: inherit;">如果使用scope-resolution-operator（</font></font> <code>::</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则需要有关上下文的更多信息（我们是否已经在对象上下文中？我们是否在对象外部？等等）。</font></font>

source: If we call <code>Person::status()</code> we will see "Person is alive" . Now consider what happens when we make a class that inherits from this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si llamamos </font></font> <code>Person::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> veremos "Person is alive". </font><font style="vertical-align: inherit;">Ahora considere lo que sucede cuando hacemos una clase que hereda de esto:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Person::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出す</font><font style="vertical-align: inherit;">と、「Person is alive」が表示されます。</font><font style="vertical-align: inherit;">これから継承するクラスを作成するとどうなるかを考えてみましょう。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Person::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출하면 </font><font style="vertical-align: inherit;">"Person is alive"가 표시됩니다. </font><font style="vertical-align: inherit;">이제 이것을 상속받은 클래스를 만들 때 어떤 일이 발생하는지 고려하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если мы вызовем </font></font> <code>Person::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мы увидим &laquo;Человек жив&raquo;. </font><font style="vertical-align: inherit;">Теперь рассмотрим, что происходит, когда мы создаем класс, который наследуется от этого:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果调用</font></font> <code>Person::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们将看到&ldquo; Person is alive&rdquo;。</font><font style="vertical-align: inherit;">现在考虑当我们创建一个继承自此的类时会发生什么：</font></font>
