Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The meaning of the <code>::</code> operator though changes. It depends on the context of the call to the current function:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El significado del </font><font style="vertical-align: inherit;">operador </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aunque cambia. </font><font style="vertical-align: inherit;">Depende del contexto de la llamada a la funci&oacute;n actual:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子</font><font style="vertical-align: inherit;">の意味は</font><font style="vertical-align: inherit;">変わります。</font><font style="vertical-align: inherit;">これは、現在の関数の呼び出しのコンテキストによって異なります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자 </font><font style="vertical-align: inherit;">의 의미는 </font><font style="vertical-align: inherit;">변경됩니다. </font><font style="vertical-align: inherit;">현재 함수 호출의 컨텍스트에 따라 다릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Значение </font><font style="vertical-align: inherit;">оператора </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> хотя меняется. </font><font style="vertical-align: inherit;">Это зависит от контекста вызова текущей функции:</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运算符</font><font style="vertical-align: inherit;">的含义</font><font style="vertical-align: inherit;">虽然有所变化。</font><font style="vertical-align: inherit;">这取决于对当前函数的调用上下文：</font></font>

source: The object pointer <code>$this</code> to refers to the current object.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El puntero del objeto </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> to se refiere al objeto actual.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトポインター</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、現在のオブジェクトを参照します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 포인터 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 객체를 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Указатель на объект </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> указывает на текущий объект.</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的对象指针指向</font><font style="vertical-align: inherit;">当前对象。</font></font>

source: The problem is that you can replace <code>$this-&gt;method()</code> with <code>self::method()</code>anywhere, regardless if <code>method()</code> is declared static or not. So which one should you use?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El problema es que puede reemplazar </font></font> <code>$this-&gt;method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>self::method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cualquier lugar, independientemente de si el </font></font> <code>method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se declara est&aacute;tico o no. </font><font style="vertical-align: inherit;">Entonces, &iquest;cu&aacute;l deber&iacute;as usar?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題は、</font> <code>method()</code> <font style="vertical-align: inherit;">が静的に宣言されているか</font><font style="vertical-align: inherit;">どうかに関係なく、</font></font> <code>$this-&gt;method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>self::method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どこにでも</font><font style="vertical-align: inherit;">置き換えることができることです</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それであなたはどちらを使うべきですか？</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제는 </font> <code>method()</code> <font style="vertical-align: inherit;"> 가 static으로 선언 </font><font style="vertical-align: inherit;">되었는지 여부에 관계없이 </font></font> <code>$this-&gt;method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font></font> <code>self::method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 바꿀 수 있다는 것 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">어떤 것을 사용해야합니까?</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проблема в том, что вы можете заменить </font></font> <code>$this-&gt;method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>self::method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где угодно, независимо от того, объявлен ли </font></font> <code>method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> static </font><font style="vertical-align: inherit;">()</font><font style="vertical-align: inherit;"> или нет. </font><font style="vertical-align: inherit;">Так какой из них вы должны использовать?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">问题是您可以</font><font style="vertical-align: inherit;">在任何地方</font><font style="vertical-align: inherit;">用</font> <code>self::method()</code> <font style="vertical-align: inherit;">替换</font></font> <code>$this-&gt;method()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而不管</font> <code>method()</code> <font style="vertical-align: inherit;">是否声明为静态。</font><font style="vertical-align: inherit;">那么您应该使用哪一个呢？</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: The same goes for static variables: <strong>Example:</strong> View::templates_path versus self::templates_path
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo mismo ocurre con las variables est&aacute;ticas: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View :: templates_path versus self :: templates_path</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じことが静的変数にも当てはまります。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View :: templates_pathとself :: templates_path</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 변수도 마찬가지입니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View :: templates_path와 self :: templates_path</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">То же самое касается статических переменных: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View :: templates_path и self :: templates_path</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态变量也是如此： </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View :: templates_path与self :: templates_path</font></font>

source: There is another aspect of self:: that is worth mentioning. Annoyingly <strong><code>self::</code> refers to the scope at the point of definition not at the point of execution</strong>. Consider this simple class with two methods:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay otro aspecto de self :: que vale la pena mencionar. </font><font style="vertical-align: inherit;">Molestamente </font></font><strong> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refiere al alcance en el punto de definici&oacute;n, no en el punto de ejecuci&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Considere esta clase simple con dos m&eacute;todos:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自己の別の側面があります::言及する価値があります。</font><font style="vertical-align: inherit;">厄介な</font><strong><font style="vertical-align: inherit;">ことに、</font></strong></font><strong> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、実行ポイントではなく定義ポイントのスコープを指し</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">次の2つのメソッドを持つ単純なクラスを考えます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자기의 또 다른 측면이 있습니다 : 그것은 언급 할 가치가 있습니다. </font><font style="vertical-align: inherit;">성가신 </font></font><strong> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 실행 시점이 아닌 정의 시점의 범위를 나타냅니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">다음 두 가지 방법으로이 간단한 클래스를 고려하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть еще один аспект самости, который стоит упомянуть. </font><font style="vertical-align: inherit;">Досадно, что </font></font><strong> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> относится к области действия в точке определения, а не в точке исполнения</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Рассмотрим этот простой класс с двумя методами:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自我的另一方面：：值得一提。</font><font style="vertical-align: inherit;">烦人的</font></font><strong> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指的是定义时的范围而不是执行时的范围</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">考虑使用两种方法的简单类：</font></font>

source: Therefore, <code>$this</code> is not defined in the static call.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no est&aacute; definido en la llamada est&aacute;tica.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は静的呼び出しで定義されていません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정적 호출에 정의되어 있지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Следовательно, </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не определено в статическом вызове.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，</font><font style="vertical-align: inherit;">在静态调用中未定义</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Therefore, we say that a Class is a global structure, and an Object is a local structure. Don't worry about that funny <code>-&gt;</code> syntax, we're going to go into that in a little bit.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, decimos que una Clase es una estructura global y un Objeto es una estructura local. </font><font style="vertical-align: inherit;">No se preocupe por esa </font><font style="vertical-align: inherit;">sintaxis </font><font style="vertical-align: inherit;">divertida </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , vamos a entrar en eso en un momento.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、クラスはグローバル構造であり、オブジェクトはローカル構造であると言います。</font><font style="vertical-align: inherit;">おかしい</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構文</font><font style="vertical-align: inherit;">については心配しないでください</font><font style="vertical-align: inherit;">。少し後で説明します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 클래스는 전역 구조이고 객체는 로컬 구조라고합니다. </font><font style="vertical-align: inherit;">그 재미있는 </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구문 </font><font style="vertical-align: inherit;">에 대해 걱정하지 마십시오 </font><font style="vertical-align: inherit;">. 우리는 그것에 조금 들어가겠습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поэтому мы говорим, что класс - это глобальная структура, а объект - локальная структура. </font><font style="vertical-align: inherit;">Не беспокойтесь об этом смешном </font><font style="vertical-align: inherit;">синтаксисе </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы немного разберемся с этим.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，我们说一个类是一个全局结构，一个对象是一个局部结构。</font><font style="vertical-align: inherit;">不用担心这种有趣的</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语法，我们将对此进行一些介绍。</font></font>

source: Things change a bit here. The same operators are used, but their meaning becomes significantly blurred.
es: Las cosas cambian un poco aquí.Se utilizan los mismos operadores,pero su significado se vuelve significativamente borroso.
ja: ここで少し事情が変わります。同じ演算子を使っているのに、その意味がかなり曖昧になる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 조금 변합니다. </font><font style="vertical-align: inherit;">동일한 연산자가 사용되지만 의미가 크게 흐리게 표시됩니다.</font></font>
ru: Здесь все немного меняется.Используются одни и те же операторы,но их смысл значительно размывается.
zh_cn: 事情在这里发生了一些变化。使用相同的运算符,但它们的含义变得明显模糊不清。

source: This can cause all sorts of bugs and conceptual WTF-ery. So I'd highly suggest avoiding the <code>::</code> operator from within instance methods on anything except those three virtual "short-cut" keywords (<code>static</code>, <code>self</code>, and <code>parent</code>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto puede causar todo tipo de errores y errores conceptuales de WTF. </font><font style="vertical-align: inherit;">Por lo tanto, sugiero evitar el </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> operador desde dentro de los m&eacute;todos de instancia en cualquier cosa, excepto esas tres palabras clave virtuales de "atajo" ( </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、あらゆる種類のバグと概念的なWTF-eryを引き起こす可能性があります。</font><font style="vertical-align: inherit;">したがって、</font><font style="vertical-align: inherit;">3つの仮想「ショートカット」キーワード（</font> <code>static</code> <font style="vertical-align: inherit;">、</font> <code>self</code> <font style="vertical-align: inherit;">、および</font> <code>parent</code> <font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">以外のインスタンスメソッド内から</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子を使用し</font><font style="vertical-align: inherit;">ないことを強くお勧め</font><font style="vertical-align: inherit;">します</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이로 인해 모든 종류의 버그와 개념적 WTF-ery가 발생할 수 있습니다. </font><font style="vertical-align: inherit;">따라서 </font><font style="vertical-align: inherit;">세 개의 가상 "바로 가기"키워드 ( </font> <code>static</code> <font style="vertical-align: inherit;"> , </font> <code>self</code> <font style="vertical-align: inherit;"> 및 </font> <code>parent</code> <font style="vertical-align: inherit;"> )를 </font><font style="vertical-align: inherit;">제외한 모든 인스턴스 메소드에서 </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자를 사용 </font><font style="vertical-align: inherit;">하지 않는 것이 좋습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это может вызвать всевозможные ошибки и концептуальные WTF-еры. </font><font style="vertical-align: inherit;">Поэтому я настоятельно рекомендую избегать использования </font><font style="vertical-align: inherit;">оператора </font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из методов экземпляра для чего-либо, кроме этих трех виртуальных &laquo;коротких&raquo; ключевых слов ( </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这可能会导致各种错误和概念上的WTF-ery。</font><font style="vertical-align: inherit;">因此，我强烈建议避免</font><font style="vertical-align: inherit;">在实例方法中</font><font style="vertical-align: inherit;">的</font></font> <code>::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运算符上使用除这三个虚拟&ldquo;快捷&rdquo;关键字（</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">以外的任何方法</font><font style="vertical-align: inherit;">。</font></font>

source: This will output:
es: Esto saldrá:
ja: これで出力されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출력됩니다 :</font></font>
ru: Это выведет:
zh_cn: 这将输出。

source: Those are the results for 2 000 000 runs, and here is the code I used:
es: Estos son los resultados de 2 000 000 de ejecuciones,y aquí está el código que usé:
ja: これらは2,000,000回実行した結果であり、ここに私が使用したコードがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 결과 2 000 000 회에 대한 결과이며 다음은 내가 사용한 코드입니다.</font></font>
ru: Таковы результаты для 2 000 000 запусков,и вот код,который я использовал:
zh_cn: 这些是2 000 000 000运行的结果,这是我使用的代码。
