Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <code>static</code> - This refers to the called class. Thanks to inheritance, child classes can override methods and static properties. So calling them using <code>static</code> instead of a class name allows us to resolve where the call came from, rather than the current level.
es: <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Esto se refiere a la clase llamada. </font><font style="vertical-align: inherit;">Gracias a la herencia, las clases secundarias pueden anular m&eacute;todos y propiedades est&aacute;ticas. </font><font style="vertical-align: inherit;">Por lo tanto, llamarlos usando </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de un nombre de clase nos permite resolver de d&oacute;nde vino la llamada, en lugar del nivel actual.</font></font>
ja: <code>static</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出されたクラスを指します。</font><font style="vertical-align: inherit;">継承のおかげで、子クラスはメソッドと静的プロパティをオーバーライドできます。</font><font style="vertical-align: inherit;">したがって</font><font style="vertical-align: inherit;">、クラス名の代わりに</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してそれらを呼び出すと</font><font style="vertical-align: inherit;">、現在のレベルではなく、呼び出し元の場所を解決できます。</font></font>
ko: <code>static</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 된 클래스를 나타냅니다. </font><font style="vertical-align: inherit;">상속 덕분에 자식 클래스는 메서드와 정적 속성을 재정의 할 수 있습니다. </font><font style="vertical-align: inherit;">따라서 </font><font style="vertical-align: inherit;">클래스 이름 대신 </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 호출하면 현재 수준이 아니라 호출이 어디서 왔는지 확인할 수 있습니다.</font></font>
ru: <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это относится к вызываемому классу. </font><font style="vertical-align: inherit;">Благодаря наследованию дочерние классы могут переопределять методы и статические свойства. </font><font style="vertical-align: inherit;">Поэтому вызов их с использованием </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо имени класса позволяет нам определить источник вызова, а не текущий уровень.</font></font>
zh_cn: <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -这是指被调用的类。</font><font style="vertical-align: inherit;">由于继承，子类可以覆盖方法和静态属性。</font><font style="vertical-align: inherit;">因此，使用</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是类名来</font><font style="vertical-align: inherit;">调用它们</font><font style="vertical-align: inherit;">可以使我们确定调用的来源而不是当前级别。</font></font>

source: <em>Constants</em> - Class resolved constants. Not going any deeper here, but adding for completeness:
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Constantes</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : constantes resueltas por clase. </font><font style="vertical-align: inherit;">No profundizando aqu&iacute;, pero agregando para completar:</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">定数</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -クラス解決済み定数。</font><font style="vertical-align: inherit;">ここではこれ以上詳しく説明しませんが、完全を期すために追加します。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -클래스 해석 상수. </font><font style="vertical-align: inherit;">더 깊이 들어 가지 않고 완전성을 추가하십시오.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Константы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - класс разрешенных констант. </font><font style="vertical-align: inherit;">Здесь не буду углубляться, но добавлю для полноты:</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常量</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -类解析的常量。</font><font style="vertical-align: inherit;">这里不做更深入的介绍，但是为了完整性起见：</font></font>

source: <em>Methods</em> - These are functions which each instance will contain (and operate on instances).
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : son funciones que cada instancia contendr&aacute; (y operar&aacute; en instancias).</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -これらは、各インスタンスに含まれる（およびインスタンスで動作する）関数です。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -각 인스턴스가 포함하고 인스턴스에서 작동하는 함수입니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Методы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это функции, которые каждый экземпляр будет содержать (и работать с экземплярами).</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -这些是每个实例将包含的功能（并对实例进行操作）。</font></font>

source: <em>Properties</em> - Think of these as variables that each instance will contain.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Propiedades</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : piense en ellas como variables que contendr&aacute; cada instancia.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -これらは、各インスタンスに含まれる変数と考えてください。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -각 인스턴스에 포함될 변수로 생각하십시오.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Свойства</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Думайте о них как о переменных, которые будет содержать каждый экземпляр.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -将它们视为每个实例将包含的变量。</font></font>

source: <em>Static Methods</em> - These are functions which are shared across the entire class. They do <strong>not</strong> operate on instances, but instead on the static properties only.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todos est&aacute;ticos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : son funciones que se comparten en toda la clase. </font><font style="vertical-align: inherit;">Ellos </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> operan en los casos, pero en cambio en las propiedades est&aacute;ticas solamente.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的メソッド</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -これらはクラス全体で共有される関数です。</font><font style="vertical-align: inherit;">彼らはない</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ではない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス上で、代わりにのみ静的プロパティを操作します。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 메소드</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -전체 클래스에서 공유되는 함수입니다. </font><font style="vertical-align: inherit;">인스턴스에서는 작동 </font><font style="vertical-align: inherit;">하지 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">않지만</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정적 속성에서만 작동합니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Статические методы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это функции, которые являются общими для всего класса. </font><font style="vertical-align: inherit;">Они работают </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с экземплярами, а только со статическими свойствами.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态方法</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -这些是在整个类中共享的函数。</font><font style="vertical-align: inherit;">它们</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不对</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例进行操作，而是仅对静态属性进行操作。</font></font>

source: <em>Static Properties</em> - Think of these as variables that are shared at the class level. Meaning that they are never copied by each instance.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Propiedades est&aacute;ticas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : piense en estas como variables que se comparten a nivel de clase. </font><font style="vertical-align: inherit;">Lo que significa que nunca son copiados por cada instancia.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的プロパティ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -これらは、クラスレベルで共有される変数と考えてください。</font><font style="vertical-align: inherit;">つまり、各インスタンスによってコピーされることはありません。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 속성</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -클래스 수준에서 공유되는 변수로 생각하십시오. </font><font style="vertical-align: inherit;">각 인스턴스에 의해 복사되지 않음을 의미합니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Статические свойства</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Думайте о них как о переменных, которые являются общими на уровне класса. </font><font style="vertical-align: inherit;">Это означает, что они никогда не копируются каждым экземпляром.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态属性</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -将它们视为在类级别共享的变量。</font><font style="vertical-align: inherit;">意味着它们永远不会被每个实例复制。</font></font>

source: <strong>DO NOT USE <code>self::</code>, use <code>static::</code></strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NO USE </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , use </font></font> <code>static::</code> </strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DO NOT USE </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、使用</font></font> <code>static::</code> </strong>
ko: <strong><font style="vertical-align: inherit;"></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용 </font><font style="vertical-align: inherit;">하지 마십시오. </font></font> <code>static::</code> </strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">НЕ ИСПОЛЬЗУЙТЕ </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используйте </font></font> <code>static::</code> </strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不要使用</font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，请使用</font></font> <code>static::</code> </strong>

source: <strong>SELF::</strong> If you are coding <em>outside</em> the object that has the static method you want to refer to, you must call it using the object's name View::format_phone_number($phone_number); If you are coding <em>inside</em> the object that has the static method you want to refer to, you can <em>either</em> use the object's name View::format_phone_number($pn), OR you can use the self::format_phone_number($pn) shortcut
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELF ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Si est&aacute; codificando </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fuera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del objeto que tiene el m&eacute;todo est&aacute;tico al que desea referirse, debe llamarlo usando el nombre del objeto View :: format_phone_number ($ phone_number); </font><font style="vertical-align: inherit;">Si est&aacute; codificando </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">en el interior</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del objeto que tiene el m&eacute;todo est&aacute;tico que desea hacer referencia a, puede </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o bien</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> utilizar el nombre Vista :: format_phone_number del objeto ($ pn), o puede utilizar el mismo :: format_phone_number ($ pn) de acceso directo</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELF ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照する静的メソッドを持つオブジェクトの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外部で</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> コーディングする場合は</font><font style="vertical-align: inherit;">、オブジェクト名View :: format_phone_number（$ phone_number）;を使用してそれを呼び出す必要があります。</font><font style="vertical-align: inherit;">参照する静的メソッドを持つオブジェクト</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">コーディング</font><font style="vertical-align: inherit;">する</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、オブジェクト名View :: format_phone_number（$ pn）を使用するか、またはself :: format_phone_number（$ pn）ショートカットを使用できます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELF ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하려는 정적 메소드가있는 오브젝트 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;"> 코딩 </font><font style="vertical-align: inherit;">하는 경우 오브젝트 이름을 사용하여 호출해야합니다. View :: format_phone_number ($ phone_number); </font><font style="vertical-align: inherit;">당신이 코딩하는 경우 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안에</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 있습니다, 참조 할 정적 메서드가있는 객체 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중 하나를</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 오브젝트의 이름보기 :: format_phone_number ($ PN)를 사용, 또는 셀프 :: format_phone_number ($ PN)를 사용할 수 있습니다를 바로 가기</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELF ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Если вы кодируете </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вне</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта, который имеет статический метод, на который вы хотите сослаться, вы должны вызвать его, используя имя объекта View :: format_phone_number ($ phone_number); </font><font style="vertical-align: inherit;">Если вы кодирование </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внутри</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта , </font><font style="vertical-align: inherit;">который имеет статический метод , который </font><font style="vertical-align: inherit;">вы хотите обратиться, вы можете </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">либо</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использовать имя View :: format_phone_number объекта ($ Pn), или вы можете использовать автоматический :: format_phone_number ($ Pn) ярлык</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELF ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 如果要在</font><font style="vertical-align: inherit;">具有要引用的静态方法的对象</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之外</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行编码</font><font style="vertical-align: inherit;">，则必须使用对象的名称View :: format_phone_number（$ phone_number）;对其进行调用。</font><font style="vertical-align: inherit;">如果要</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有要引用的静态方法的对象</font><em><font style="vertical-align: inherit;">内</font></em><font style="vertical-align: inherit;">进行编码</font><font style="vertical-align: inherit;">，则</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用对象的名称View :: format_phone_number（$ pn），也可以使用self :: format_phone_number（$ pn）快捷方式</font></font>

source: <strong>Static Method Example:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo de m&eacute;todo est&aacute;tico:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的メソッドの例：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 방법 예 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример статического метода:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态方法示例：</font></font></strong>

source: <strong>Static Variables Example:</strong> Pretend we have a database class with a single member variable: static $num_connections; Now, put this in the constructor:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo de variables est&aacute;ticas: Supongamos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que tenemos una clase de base de datos con una sola variable miembro: static $ num_ connections; </font><font style="vertical-align: inherit;">Ahora, pon esto en el constructor:</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的変数の例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 単一のメンバー変数を持つデータベースクラスがあるとします：static $ num_connections; </font><font style="vertical-align: inherit;">次に、これをコンストラクターに入れます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 변수 예 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 단일 멤버 변수가있는 데이터베이스 클래스가 있다고 가정합니다. static $ num_connections; </font><font style="vertical-align: inherit;">이제 이것을 생성자에 넣습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример статических переменных: представьте,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что у нас есть класс базы данных с одной переменной-членом: static $ num_connections; </font><font style="vertical-align: inherit;">Теперь поместите это в конструктор:</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态变量示例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 假设我们有一个带有单个成员变量的数据库类：static $ num_connections; </font><font style="vertical-align: inherit;">现在，将其放入构造函数中：</font></font>
