Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Case 1: Use <code>self</code> can be used for class constants
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Caso 1: Use </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar para constantes de clase</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1：</font><font style="vertical-align: inherit;">クラス定数に使用できる</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 1 : </font><font style="vertical-align: inherit;">클래스 상수에 </font></font> <code>self</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있음</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Случай 1: использование </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может использоваться для констант класса</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况1：Use </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以用于类常量</font></font>

source: Case 2: For static properties
es: Caso 2:Para las propiedades estáticas
ja: ケース2:静的プロパティの場合
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 2 : 정적 속성</font></font>
ru: Случай 2:Для статических свойств
zh_cn: 案例2:对于静态属性

source: ClassName:: is used to refer to that type of class, and its static variables, static methods. If it helps, you can mentally replace the word "static" with "shared". Because they are shared, they cannot refer to $this, which refers to a specific instance (not shared). Static Variables (i.e. static $db_connection) can be shared among all instances of a type of object. For example, all database objects share a single connection (static $connection).
es: ClassName::se utiliza para referirse a ese tipo de clase,y sus variables estáticas,métodos estáticos.Si ayuda,puede reemplazar mentalmente la palabra "estática" por "compartida".Debido a que son compartidos,no pueden referirse a $this,que se refiere a una instancia específica (no compartida).Las variables estáticas (es decir,$db_connection estático)pueden ser compartidas entre todas las instancias de un tipo de objeto.Por ejemplo,todos los objetos de la base de datos comparten una única conexión ($conexión estática).
ja: ClassName::は、そのタイプのクラスとその静的変数、静的メソッドを参照するために使用されます。参考になれば、精神的に "static "という単語を "shared "に置き換えることができます。これらは共有されているので、特定のインスタンス(共有されていない)を参照する$thisを参照することはできません。静的変数 (すなわち静的 $db_connection)は、あるタイプのオブジェクトのすべてのインスタンス間で共有することができます。たとえば、すべてのデータベースオブジェクトは単一の接続を共有します (static $connection)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ClassName ::은 해당 유형의 클래스와 정적 변수 정적 메서드를 나타내는 데 사용됩니다. </font><font style="vertical-align: inherit;">도움이되면 정신적으로 "정적"이라는 단어를 "공유"로 바꿀 수 있습니다. </font><font style="vertical-align: inherit;">공유되어 있기 때문에 특정 인스턴스 (공유되지 않음)를 나타내는 $ this를 참조 할 수 없습니다. </font><font style="vertical-align: inherit;">정적 변수 (정적 $ db_connection)는 객체 유형의 모든 인스턴스간에 공유 될 수 있습니다. </font><font style="vertical-align: inherit;">예를 들어, 모든 데이터베이스 객체는 단일 연결 (정적 $ connection)을 공유합니다.</font></font>
ru: ClassName::используется для обозначения данного типа класса,а также его статических переменных,статических методов.Если это поможет,можно мысленно заменить слово "static" на "shared".Так как они являются общими,они не могут ссылаться на $this,который относится к конкретному экземпляру (не общим).Статические переменные (т.е.статические $db_connection)могут быть общими для всех экземпляров типа объекта.Например,все объекты БД совместно используют одно соединение (статическое $connection).
zh_cn: ClassName::是用来指那种类型的类,以及它的静态变量、静态方法。如果有帮助的话,可以在脑海中把 "static "这个词替换成 "share"。因为它们是共享的,所以不能引用$this,它指的是特定的实例(不是共享的)。静态变量(即静态$db_connection)可以在一种类型的对象的所有实例之间共享。例如,所有的数据库对象共享一个单一的连接(静态$connection)。

source: Classes And Objects, Conceptually
es: Clases y objetos,conceptualmente
ja: クラスとオブジェクト、概念的に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개념적으로 클래스와 객체</font></font>
ru: Классы и объекты,концептуально
zh_cn: 类和对象,概念上

source: Consider this code:
es: Considere este código:
ja: このコードを考えてみてください。
ko: 이 코드를 고려하십시오.
ru: Рассмотрим этот код:
zh_cn: 考虑一下这个代码。

source: Defining State
es: Definición de estado
ja: 状態の定義
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상태 정의</font></font>
ru: Определяющее государство
zh_cn: 国家的定义

source: Every time we create a new instance, it will increase our connection counter by one. Every time we destroy or stop using an instance, it will decrease the connection counter by one. In this way, we can monitor the number of instances of the database object we have in use with:
es: Cada vez que creemos una nueva instancia,aumentará nuestro contador de conexiones en uno.Cada vez que destruyamos o dejemos de usar una instancia,disminuirá el contador de conexiones en uno.De esta manera,podemos controlar el número de instancias del objeto de la base de datos que tenemos en uso:
ja: 新しいインスタンスを作成するたびに、接続カウンタが1つ増えます。インスタンスを破棄したり使用を停止したりするたびに、接続カウンタが1つ減ります。このようにして、使用中のデータベースオブジェクトのインスタンス数を監視することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새 인스턴스를 만들 때마다 연결 카운터가 하나씩 증가합니다. </font><font style="vertical-align: inherit;">인스턴스 사용을 중단하거나 중단 할 때마다 연결 카운터가 하나씩 줄어 듭니다. </font><font style="vertical-align: inherit;">이런 식으로 우리는 우리가 사용하고있는 데이터베이스 객체의 인스턴스 수를 모니터링 할 수 있습니다 :</font></font>
ru: Каждый раз,когда мы создаем новый экземпляр,он увеличивает наш счетчик соединений на один.Каждый раз,когда мы уничтожаем или прекращаем использование экземпляра,счетчик соединений уменьшается на единицу.Таким образом,мы можем отслеживать количество экземпляров объекта БД,с которым мы работаем:
zh_cn: 每当我们创建一个新的实例,它将增加一个连接计数器。每当我们销毁或停止使用一个实例,它就会把连接计数器减少一个。通过这种方式,我们可以监控我们使用的数据库对象的实例数量。

source: First, attaching functions to objects helps you keep things organized, so you know where to find them.
es: En primer lugar,adjuntar funciones a los objetos te ayuda a mantener las cosas organizadas,para que sepas dónde encontrarlas.
ja: まず、オブジェクトに機能を付けることで、物事を整理しやすくなり、どこに何があるかが分かるようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저, 기능을 객체에 연결하면 사물을 체계적으로 유지하는 데 도움이되므로 어디에 있는지 찾을 수 있습니다.</font></font>
ru: Во-первых,привязка функций к объектам помогает держать вещи организованными,так что вы знаете,где их найти.
zh_cn: 首先,将功能附加到对象上,可以帮助你把东西组织起来,让你知道在哪里可以找到它们。

source: For e.g., both of the following examples work without any errors, whether you use <code>self::</code> or <code>$this-&gt;</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, los dos ejemplos siguientes funcionan sin errores, ya sea que use </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>$this-&gt;</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、次の例は両方とも、</font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font> <code>$this-&gt;</code> <font style="vertical-align: inherit;">を使用してもエラーなしで機能します。</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font> <code>$this-&gt;</code> <font style="vertical-align: inherit;"> 를 사용하든 다음 예제 모두 오류없이 작동합니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, оба следующих примера работают без ошибок, используете ли вы </font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>$this-&gt;</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，无论您使用</font></font> <code>self::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还是</font> <code>$this-&gt;</code> <font style="vertical-align: inherit;">，以下两个示例都可以正常工作</font></font><font style="vertical-align: inherit;"></font>

source: For informational purposes only, as of PHP 5.3 when dealing with instantiated objects to get the current scope value, as opposed to using <code>static::</code>, one can alternatively use <code>$this::</code> like so.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Solo con fines informativos, a partir de PHP 5.3 cuando se trata de objetos instanciados para obtener el valor de alcance actual, en lugar de usar </font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , uno puede usar </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como tal.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情報提供のみを目的として、</font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用するのではなく、PHP 5.3以降、インスタンス化されたオブジェクトを処理して現在のスコープ値を取得する場合、</font><font style="vertical-align: inherit;">代わりに</font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用でき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하는 것과 달리 현재 범위 값을 얻기 위해 인스턴스화 된 객체를 처리 할 때 PHP 5.3부터 정보 목적으로 만 </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Только в информационных целях, начиная с PHP 5.3, когда имеешь дело с экземплярами объектов, чтобы получить текущее значение области действия, в отличие от использования </font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , можно альтернативно использовать </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вроде так.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅出于提供信息的目的，从PHP 5.3开始，在处理实例化对象以获取当前作用域值时，与使用</font></font> <code>static::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相对</font><font style="vertical-align: inherit;">，可以</font><font style="vertical-align: inherit;">像这样</font><font style="vertical-align: inherit;">使用</font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: From <a href="http://www.phpbuilder.com/board/showthread.php?t=10354489">http://www.phpbuilder.com/board/showthread.php?t=10354489</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De </font></font><a href="http://www.phpbuilder.com/board/showthread.php?t=10354489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.phpbuilder.com/board/showthread.php?t=10354489</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://www.phpbuilder.com/board/showthread.php?t=10354489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.phpbuilder.com/board/showthread.php?t=10354489</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://www.phpbuilder.com/board/showthread.php?t=10354489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.phpbuilder.com/board/showthread.php?t=10354489</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С </font></font><a href="http://www.phpbuilder.com/board/showthread.php?t=10354489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.phpbuilder.com/board/showthread.php?t=10354489</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><a href="http://www.phpbuilder.com/board/showthread.php?t=10354489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.phpbuilder.com/board/showthread.php?t=10354489</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: From <a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/">this blog post</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De </font></font><a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta publicaci&oacute;n de blog</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このブログ投稿</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 블로그 게시물</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Из </font></font><a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этого сообщения в блоге</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><a href="http://www.programmerinterview.com/index.php/php-questions/php-self-vs-this/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇博客文章</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: From Inside Of An Instance/Class
es: Desde el interior de una clase de instancia
ja: InstanceClass の内部から
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스 / 클래스 내부에서</font></font>
ru: Изнутри класса InstanceClass
zh_cn: 从一个实例类的内部

source: From Outside Of An Instance/Class
es: Desde fuera de una clase de instancia
ja: InstanceClass の外部から
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스 / 클래스 외부에서</font></font>
ru: из вне пределов класса InstanceClass.
zh_cn: 从一个实例类的外部

source: From the outside of an instance/class, our rules are quite simple and predictable. We have two operators, and each tells us immediately if we're dealing with an instance or a class static:
es: Desde el exterior de una clase instanciada,nuestras reglas son bastante simples y predecibles.Tenemos dos operadores,y cada uno nos dice inmediatamente si estamos tratando con una instancia o una clase estática:
ja: インスタンスクラスの外側から見ると、私たちのルールは非常にシンプルで予測可能です。2 つの演算子があり、それぞれがインスタンスを扱っているのか静的なクラスを扱っているのかをすぐに教えてくれます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스 / 클래스 외부에서 우리의 규칙은 매우 간단하고 예측 가능합니다. </font><font style="vertical-align: inherit;">우리는 두 개의 연산자를 가지고 있으며 인스턴스 또는 클래스 정적을 처리하고 있는지 즉시 알려줍니다.</font></font>
ru: С внешней стороны,наши правила довольно просты и предсказуемы.У нас есть два оператора,и каждый сразу говорит нам,имеем ли мы дело со статическим экземпляром или классом:
zh_cn: 从实例类的外部来看,我们的规则是相当简单和可预测的。我们有两个操作符,每个操作符都会立刻告诉我们是在处理一个实例还是类静态。

source: Full Answer
es: Respuesta completa
ja: フルアンサー
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 답변</font></font>
ru: Полный ответ
zh_cn: 全部答案

source: Goodbye from Ludwig the person
es: Adiós de Ludwig la persona
ja: ルートヴィヒ・ザ・パーソンからのお別れ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루트비히 사람으로부터의 안녕</font></font>
ru: Прощай от Людвига,человека.
zh_cn: 来自路德维希的再见

source: Hello, I'm Ludwig the geek
es: Hola,soy Ludwig el geek
ja: こんにちは、オタクのルートヴィヒです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안녕하세요, 괴짜 루드비히입니다</font></font>
ru: Здравствуйте,я Людвиг-ботаник.
zh_cn: 大家好,我是路德维希这个怪胎

source: Here is an example of <strong>correct</strong> usage of <code>$this</code> and <code>self</code> for non-static and static member variables:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo del </font><font style="vertical-align: inherit;">uso </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">correcto</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para variables miembro no est&aacute;ticas y est&aacute;ticas:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下は、</font><font style="vertical-align: inherit;">非静的および静的メンバー変数に対する</font> <code>$this</code> <font style="vertical-align: inherit;">および</font> <code>self</code> <font style="vertical-align: inherit;">の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正しい</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">例</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비 정적 및 정적 멤버 변수 </font><font style="vertical-align: inherit;">에 </font> <code>$this</code> <font style="vertical-align: inherit;"> 및 </font> <code>self</code> <font style="vertical-align: inherit;"> 를 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">올바르게</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하는 예는 다음과 같습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">правильного</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использования </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для нестатических и статических переменных-членов:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这</font><font style="vertical-align: inherit;">是非静态和静态成员变量</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正确</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的示例</font><font style="vertical-align: inherit;">：</font></font>
