Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Because $num_connections is static (shared), it will reflect the total number of active database objects. You may have seen this technique used to share database connections among all instances of a database class. This is done because creating the database connection takes a long time, so it's best to create just one, and share it (this is called a Singleton Pattern).
es: Debido a que $num_connections es estático (compartido),reflejará el número total de objetos activos de la base de datos.Es posible que haya visto cómo se utiliza esta técnica para compartir las conexiones de la base de datos entre todas las instancias de una clase de base de datos.Esto se hace porque crear la conexión de la base de datos lleva mucho tiempo,por lo que es mejor crear sólo una,y compartirla (esto se denomina Patrón Singleton).
ja: num_connections は静的 (共有)なので、アクティブなデータベースオブジェクトの総数を反映します。このテクニックは、データベースクラスのすべてのインスタンス間でデータベース接続を共有するために使用されているのを見たことがあるかもしれません。これは、データベース接続の作成に時間がかかるので、1つだけ作成して共有するのがベストだからです(これをシングルトンパターンと呼びます)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ num_connections는 정적 (공유)이므로 총 활성 데이터베이스 개체 수를 반영합니다. </font><font style="vertical-align: inherit;">데이터베이스 클래스의 모든 인스턴스간에 데이터베이스 연결을 공유하는 데이 기술이 사용 된 것을 보았을 것입니다. </font><font style="vertical-align: inherit;">데이터베이스 연결을 만드는 데 시간이 오래 걸리기 때문에이 작업을 수행하므로 하나만 만들어 공유하는 것이 가장 좋습니다 (단일 패턴이라고 함).</font></font>
ru: Поскольку $num_connections является статическим (общим),он будет отражать общее количество активных объектов БД.Возможно,вы видели эту технику,используемую для разделения соединений с БД между всеми экземплярами класса БД.Это делается потому,что создание соединения с БД занимает много времени,поэтому лучше всего создать только одно и поделиться им (это называется однокнопочной моделью).
zh_cn: 因为$num_connections是静态的(共享),所以它将反映出活动数据库对象的总数。你可能看到过这种技术用于在数据库类的所有实例之间共享数据库连接。这样做是因为创建数据库连接需要很长时间,所以最好只创建一个,然后共享一个(这叫做Singleton模式)。

source: Because <code>self</code> is not an object, it's basically a type that automatically refers to the current class, you use it like: <code>self::member</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no es un objeto, es b&aacute;sicamente un tipo que se refiere autom&aacute;ticamente a la clase actual, lo usas como: </font></font> <code>self::member</code>
ja: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオブジェクトではない</font><font style="vertical-align: inherit;">ため</font><font style="vertical-align: inherit;">、基本的には現在のクラスを自動的に参照する型なので、次のように使用します：</font></font> <code>self::member</code>
ko: <font style="vertical-align: inherit;"></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 객체가 아니기 </font><font style="vertical-align: inherit;">때문에 </font><font style="vertical-align: inherit;">기본적으로 현재 클래스를 자동으로 참조하는 유형입니다. </font></font> <code>self::member</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не является объектом, это в основном тип, который автоматически ссылается на текущий класс, вы используете его как: </font></font> <code>self::member</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不是对象，所以它基本上是一种自动引用当前类的类型，您可以这样使用它：</font></font> <code>self::member</code>

source: Because <code>this</code> is an object, you use it like: <code>$this-&gt;member</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un objeto, lo usa como: </font></font> <code>$this-&gt;member</code>
ja: <font style="vertical-align: inherit;"></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオブジェクトな</font><font style="vertical-align: inherit;">ので</font><font style="vertical-align: inherit;">、次のように使用します：</font></font> <code>$this-&gt;member</code>
ko: <font style="vertical-align: inherit;"></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체 </font><font style="vertical-align: inherit;">이므로 </font><font style="vertical-align: inherit;">다음</font><font style="vertical-align: inherit;"> 과 같이 사용합니다 : </font></font> <code>$this-&gt;member</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объект, вы используете его как: </font></font> <code>$this-&gt;member</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个对象，所以您可以像这样使用它：</font></font> <code>$this-&gt;member</code>

source: Because tying everything together using class names is rather dirty, PHP provides 3 basic "shortcut" keywords to make scope resolving easier.
es: Debido a que atar todo junto usando nombres de clase es bastante sucio,PHP proporciona 3 palabras clave básicas de "atajo" para hacer más fácil la resolución del alcance.
ja: クラス名を使ってすべてを結びつけるのはかなり汚いので、PHPではスコープ解決を簡単にするための基本的な3つの "ショートカット "キーワードを用意しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 이름을 사용하여 모든 것을 함께 묶는 것은 다소 더러워지기 때문에 PHP는 3 가지 기본 "단축"키워드를 제공하여 범위를 쉽게 해결할 수 있습니다.</font></font>
ru: Поскольку связывать все вместе,используя имена классов довольно грязно,PHP предоставляет 3 основных ключевых слова "short short",чтобы облегчить решение задач в области видимости.
zh_cn: 因为使用类名将所有的东西捆绑在一起是相当脏的,所以PHP提供了3个基本的 "快捷键",让作用域解析更容易。

source: But if the DB class wanted to refer to its own static variable, it would just say self: <strong>Example:</strong> self::connection;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero si la clase DB quisiera referirse a su propia variable est&aacute;tica, solo dir&iacute;a self: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> self :: connection;</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、DBクラスが独自の静的変数を参照したい場合は、単にselfと表示されます。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> self :: connection;</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 DB 클래스가 자체 정적 변수를 참조하려는 경우 self라고 말합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> self :: connection;</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но если класс DB хотел обратиться к своей собственной статической переменной, было бы просто сказать себе: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> само :: соединения;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，如果DB类想要引用其自己的静态变量，则只会说self： </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> self :: connection;</font></font>

source: By <a href="http://board.phpbuilder.com/member.php?145249-laserlight">http://board.phpbuilder.com/member.php?145249-laserlight</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por </font></font><a href="http://board.phpbuilder.com/member.php?145249-laserlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://board.phpbuilder.com/member.php?145249-laserlight</font></font></a>
ja: <font style="vertical-align: inherit;"></font><a href="http://board.phpbuilder.com/member.php?145249-laserlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://board.phpbuilder.com/member.php?145249-laserlight</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">으로 </font></font><a href="http://board.phpbuilder.com/member.php?145249-laserlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://board.phpbuilder.com/member.php?145249-laserlight</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Автор: </font></font><a href="http://board.phpbuilder.com/member.php?145249-laserlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://board.phpbuilder.com/member.php?145249-laserlight</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过</font></font><a href="http://board.phpbuilder.com/member.php?145249-laserlight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://board.phpbuilder.com/member.php?145249-laserlight</font></font></a>

source: Calling <code>Deceased::status()</code> we would expect to see "Person is deceased" however what we see is "Person is alive" as the scope contains the original method definition when call to <code>self::getStatus()</code> was defined.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Llamando a </font></font> <code>Deceased::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> esperar&iacute;amos ver "Persona fallecida", sin embargo, lo que vemos es "Persona viva" ya que el alcance contiene la definici&oacute;n del m&eacute;todo original cuando </font><font style="vertical-align: inherit;">se defini&oacute; la </font><font style="vertical-align: inherit;">llamada a </font></font> <code>self::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Deceased::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出すと、</font><font style="vertical-align: inherit;">「Person is deceased」が表示されることが予想されますが、</font></font> <code>self::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">への呼び出しが定義されたときにスコープには元のメソッド定義が含まれているため、「Person is alive」</font><font style="vertical-align: inherit;">が表示されます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Deceased::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 </font><font style="vertical-align: inherit;">하면 "Person is decessed"가 표시 될 것으로 예상되지만 </font></font> <code>self::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출이 정의 될 때 범위에 원래 메소드 정의가 포함되어 있으므로 "Person is alive" </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При вызове </font></font> <code>Deceased::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мы ожидаем увидеть &laquo;Person is deceased&raquo;, однако мы видим &laquo;Person is alive&raquo;, поскольку область действия содержит исходное определение метода, когда был определен вызов </font></font> <code>self::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用</font></font> <code>Deceased::status()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们希望看到&ldquo; Person已死&rdquo;，但是我们看到的是&ldquo; Person仍然活着&rdquo;，因为在定义对</font></font> <code>self::getStatus()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用时，范围包含原始方法</font><font style="vertical-align: inherit;">定义。</font></font>

source: Calling <code>Foo::bar()</code> will call the <code>baz()</code> method statically, and hence <code>$this</code> will <strong>not</strong> be populated. It's worth noting that in recent versions of PHP (5.3+) this will trigger an <code>E_STRICT</code> error, because we're calling non-static methods statically.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Llamando </font></font> <code>Foo::bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llamar&aacute; al </font></font> <code>baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> m&eacute;todo est&aacute;ticamente, y por lo tanto </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&aacute; </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser poblada. </font><font style="vertical-align: inherit;">Vale la pena se&ntilde;alar que en versiones recientes de PHP (5.3+) esto provocar&aacute; un </font><font style="vertical-align: inherit;">error </font></font> <code>E_STRICT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , porque estamos llamando a m&eacute;todos no est&aacute;ticos est&aacute;ticamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出し</font></font> <code>Foo::bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を呼び出します</font></font> <code>baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的メソッド、ひいては</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">になる</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ではない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">取り込むことを。</font><font style="vertical-align: inherit;">最近のバージョンのPHP（5.3以降）</font><font style="vertical-align: inherit;">では、静的ではないメソッドを静的に呼び出すため</font><font style="vertical-align: inherit;">、</font></font> <code>E_STRICT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エラー</font><font style="vertical-align: inherit;">がトリガーされることに</font><font style="vertical-align: inherit;">注意して</font><font style="vertical-align: inherit;">ください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호출 </font></font> <code>Foo::bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 부르는 것 </font></font> <code>baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정적 방법, 따라서 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수 없습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 채울 수 있습니다. </font><font style="vertical-align: inherit;">정적이 아닌 메소드를 정적으로 호출하기 때문에 </font><font style="vertical-align: inherit;">최신 버전의 PHP (5.3+)에서는 </font></font> <code>E_STRICT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 오류 </font><font style="vertical-align: inherit;">가 발생합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вызов </font></font> <code>Foo::bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет вызывать </font></font> <code>baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> метод статически, и , </font><font style="vertical-align: inherit;">следовательно , </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заполняться. </font><font style="vertical-align: inherit;">Стоит отметить, что в последних версиях PHP (5.3+) это вызовет </font><font style="vertical-align: inherit;">ошибку </font></font> <code>E_STRICT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , потому что мы вызываем нестатические методы статически.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用</font></font> <code>Foo::bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将调用</font></font> <code>baz()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法静态，因此</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被填充。</font><font style="vertical-align: inherit;">值得注意的是，在最新版本的PHP（5.3+）中，这将触发</font></font> <code>E_STRICT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误，因为我们正在静态地调用非静态方法。</font></font>

source: Calling the <code>bar()</code> method on <code>$foo</code> (an instance of <code>Foo</code>) using the object-operator: <code>$foo-&gt;bar()</code> will result in the instance's version of <code>$a</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Llamar al </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font></font> <code>$foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (una instancia de </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) usando el operador de objeto: </font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dar&aacute; como resultado la versi&oacute;n de la instancia de </font></font> <code>$a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトオペレーター</font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して</font> <code>$foo</code> <font style="vertical-align: inherit;">（</font> <code>Foo</code> の<font style="vertical-align: inherit;">インスタンス</font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">呼び出す</font><font style="vertical-align: inherit;">と、インスタンスのバージョンの</font> <code>$a</code> <font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">object-operator : </font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font> <code>$foo</code> <font style="vertical-align: inherit;"> ( </font> <code>Foo</code> <font style="vertical-align: inherit;"> 인스턴스 </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">bar ()</font><font style="vertical-align: inherit;"> 메소드를 </font><font style="vertical-align: inherit;">호출하면 </font><font style="vertical-align: inherit;">인스턴스 버전이 </font> <code>$a</code> <font style="vertical-align: inherit;"> 됩니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вызов </font><font style="vertical-align: inherit;">метода </font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>$foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (экземпляр </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) с использованием объекта-оператора: </font></font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> приведет к версии экземпляра </font></font> <code>$a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用对象操作符</font><font style="vertical-align: inherit;">在</font> <code>$foo</code> <font style="vertical-align: inherit;">（</font> <code>Foo</code> 的<font style="vertical-align: inherit;">一个实例</font></font> <code>bar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上</font><font style="vertical-align: inherit;">调用</font><font style="vertical-align: inherit;">bar（）</font><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">：</font> <code>$foo-&gt;bar()</code> <font style="vertical-align: inherit;">将产生实例的</font> <code>$a</code> <font style="vertical-align: inherit;">版本</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
