Repository: rueisnom/feedback
Catalog: xlf/15/19/69/151969.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>self::</strong>&nbsp;keyword&nbsp;used for the current class and basically it is used to access static members, methods, and constants. But in case of <strong>$this</strong> you cannot call the static member, method and functions.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &nbsp;palabra clave utilizada para la clase actual y b&aacute;sicamente se utiliza para acceder a miembros est&aacute;ticos, m&eacute;todos y constantes. </font><font style="vertical-align: inherit;">Pero en el caso de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no puede llamar al miembro est&aacute;tico, m&eacute;todo y funciones.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &nbsp;キーワードは現在のクラスに使用され、基本的には静的メンバー、メソッド、定数にアクセスするために使用されます。</font><font style="vertical-align: inherit;">しかし、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ thisの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、静的メンバー、メソッド、関数を呼び出すことはできません。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &nbsp;키워드는 현재 클래스에 사용되며 기본적으로 정적 멤버, 메서드 및 상수에 액세스하는 데 사용됩니다. </font><font style="vertical-align: inherit;">그러나 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this의</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우 </font><font style="vertical-align: inherit;">정적 멤버, 메서드 및 함수를 호출 할 수 없습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &nbsp;keyword используется для текущего класса и в основном используется для доступа к статическим членам, методам и константам. </font><font style="vertical-align: inherit;">Но в случае </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы не можете вызывать статический член, метод и функции.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">self ::</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &nbsp;关键字，用于当前类，基本上用于访问静态成员，方法和常量。</font><font style="vertical-align: inherit;">但是在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ this的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况下，</font><font style="vertical-align: inherit;">您不能调用静态成员，方法和函数。</font></font>

source: Accessing State
es: Estado de acceso
ja: 状態へのアクセス
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">접근 상태</font></font>
ru: Доступное состояние
zh_cn: 访问国家

source: According to <a href="http://www.php.net/manual/en/language.oop5.static.php">http://www.php.net/manual/en/language.oop5.static.php</a> there is no <code>$self</code>. There is only <code>$this</code>, for referring to the current instance of the class (the object), and self, which can be used to refer to static members of a class. The difference between an object instance and a class comes into play here.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De acuerdo con </font></font><a href="http://www.php.net/manual/en/language.oop5.static.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.php.net/manual/en/language.oop5.static.php</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no hay </font></font> <code>$self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Solo hay </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , para referirse a la instancia actual de la clase (el objeto) y self, que se puede usar para referirse a miembros est&aacute;ticos de una clase. </font><font style="vertical-align: inherit;">Aqu&iacute; entra en juego la diferencia entre una instancia de objeto y una clase.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://www.php.net/manual/en/language.oop5.static.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.php.net/manual/en/language.oop5.static.php</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">よる</font><font style="vertical-align: inherit;">と、</font></font> <code>$self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">唯一の存在である</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスの静的メンバを参照するために使用することができ、現在のクラス（オブジェクト）のインスタンス、および自己を参照するために、。</font><font style="vertical-align: inherit;">ここでは、オブジェクトインスタンスとクラスの違いが関係しています。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://www.php.net/manual/en/language.oop5.static.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.php.net/manual/en/language.oop5.static.php</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 따르면 </font></font> <code>$self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 없습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">클래스의 현재 인스턴스 (객체)와 클래스의 정적 멤버를 참조하는 데 사용할 수있는 self를 나타내는 </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">객체 인스턴스와 클래스의 차이점이 여기에 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно </font></font><a href="http://www.php.net/manual/en/language.oop5.static.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.php.net/manual/en/language.oop5.static.php,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> нет </font></font> <code>$self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Существует только </font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для ссылки на текущий экземпляр класса (объект) и self, которые можно использовать для ссылки на статические члены класса. </font><font style="vertical-align: inherit;">Разница между экземпляром объекта и классом вступает здесь в игру.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="http://www.php.net/manual/en/language.oop5.static.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.php.net/manual/zh/language.oop5.static.php</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，没有</font></font> <code>$self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">只有</font></font> <code>$this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用来引用类（对象）的当前实例，而self可以用来引用类的静态成员。</font><font style="vertical-align: inherit;">对象实例和类之间的区别在这里起作用。</font></font>

source: According to php.net there are three special keywords in this context: <code>self</code>, <code>parent</code> and <code>static</code>. They are used to access properties or methods from inside the class definition.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Seg&uacute;n php.net, hay tres palabras clave especiales en este contexto: </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Se utilizan para acceder a propiedades o m&eacute;todos desde dentro de la definici&oacute;n de clase.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">php.netによると、このコンテキストには</font><font style="vertical-align: inherit;">、</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>static</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3つの特別なキーワードが</font><font style="vertical-align: inherit;">あり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これらは、クラス定義内からプロパティまたはメソッドにアクセスするために使用されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">php.net에 따르면이 문맥에는 </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 세 가지 특수 키워드가 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">클래스 정의 내부에서 속성 또는 메서드에 액세스하는 데 사용됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно php.net, в этом контексте есть три специальных ключевых слова: </font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Они используются для доступа к свойствам или методам из определения класса.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据php.net，在这种情况下有三个特殊的关键字：</font></font> <code>self</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>static</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">它们用于从类定义内部访问属性或方法。</font></font>

source: Additionally since <code>$this::</code> has not been discussed yet.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, desde </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a&uacute;n no se ha discutido.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さらに、</font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">についてはまだ議論されていません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이후 </font><font style="vertical-align: inherit;">아직 논의되지 않았습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, поскольку </font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> еще не обсуждался.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另外，由于</font></font> <code>$this::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还没有被讨论。</font></font>

source: Additionally, we can call a static method on an object in the same way:
es: Además,podemos llamar a un método estático en un objeto de la misma manera:
ja: さらに、同じようにオブジェクトの静的メソッドを呼び出すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 동일한 방법으로 객체에서 정적 메서드를 호출 할 수 있습니다.</font></font>
ru: Кроме того,мы можем вызвать статический метод на объекте таким же образом:
zh_cn: 另外,我们可以用同样的方法在对象上调用一个静态方法。

source: An object on the other hand is what's called an <em>instance</em> of a Class. What that means is that we take the "blueprint" of the class, and use it to make a dynamic copy. This copy is now specifically tied to the variable it's stored in. Therefore, any changes to an <em>instance</em> is local to that instance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un objeto por otro lado es lo que se llama una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de una Clase. </font><font style="vertical-align: inherit;">Lo que eso significa es que tomamos el "plano" de la clase y lo usamos para hacer una copia din&aacute;mica. </font><font style="vertical-align: inherit;">Esta copia ahora est&aacute; vinculada espec&iacute;ficamente a la variable en la que est&aacute; almacenada. Por lo tanto, cualquier cambio en una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es local para esa instancia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、オブジェクト</font><font style="vertical-align: inherit;">は、クラスの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれるもの</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">つまり、クラスの「青写真」を取得し、それを使用して動的コピーを作成します。</font><font style="vertical-align: inherit;">このコピーは、格納されている変数に具体的に関連付けられています。したがって、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">への変更は、</font><font style="vertical-align: inherit;">そのインスタンスに対してローカルです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면에 객체 </font><font style="vertical-align: inherit;">는 클래스 </font><font style="vertical-align: inherit;">의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">즉, 클래스의 "청사진"을 가져 와서 동적 사본을 만드는 데 사용합니다. </font><font style="vertical-align: inherit;">이 복사본은 이제 저장된 변수에 연결됩니다. 따라서 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 모든 변경 사항은 해당 </font><em><font style="vertical-align: inherit;">인스턴스</font></em><font style="vertical-align: inherit;"> 에 로컬입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С другой стороны, объект - это то, что называется </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляром</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> класса. </font><font style="vertical-align: inherit;">Это означает, что мы берем &laquo;план&raquo; класса и используем его для создания динамической копии. </font><font style="vertical-align: inherit;">Эта копия теперь специально привязана к переменной, в которой она хранится. Поэтому любые изменения </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляра</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> являются локальными для этого экземпляра.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一方面，对象就是所谓的</font><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这意味着我们采用了该类的&ldquo;蓝图&rdquo;，并使用它来创建动态副本。</font><font style="vertical-align: inherit;">现在，此副本已专门与其存储在其中的变量绑定。因此，对</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任何更改都是该</font><em><font style="vertical-align: inherit;">实例</font></em><font style="vertical-align: inherit;">的本地</font><font style="vertical-align: inherit;">更改</font><font style="vertical-align: inherit;">。</font></font>

source: As no one here talked about performances, here is a small benchmark I did (5.6):
es: Como nadie aquí habló de actuaciones,aquí hay un pequeño punto de referencia que hice (5.6):
ja: ここでは誰もパフォーマンスの話をしていないので、ここでは私がやった小さなベンチマーク(5.6)を紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기 아무도 공연에 대해 이야기하지 않았으므로 여기에 내가 한 작은 벤치 마크 (5.6)가 있습니다.</font></font>
ru: Так как никто здесь не говорил о выступлениях,вот небольшой эталон,который я сделал (5,6):
zh_cn: 由于这里没有人谈表演,下面是我做的一个小标杆(5.6)。

source: As you can see, public static function prettyName knows nothing about the object. It's just working with the parameters you pass in, like a normal function that's not part of an object. Why bother, then, if we could just have it not as part of the object?
es: Como puedes ver,la función pública estática prettyName no sabe nada del objeto.Sólo trabaja con los parámetros que le pasas,como una función normal que no es parte de un objeto.¿Por qué molestarse,entonces,si podemos tenerla no como parte del objeto?
ja: ご覧のように、public static function prettyName はオブジェクトについて何も知りません。オブジェクトの一部ではない通常の関数のように、あなたが渡すパラメータを使って動作しています。オブジェクトの一部ではないのに、なぜ悩むのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보다시피 public static 함수 prettyName은 객체에 대해 아무것도 모른다. </font><font style="vertical-align: inherit;">객체의 일부가 아닌 일반 함수처럼 전달하는 매개 변수로 작업하고 있습니다. </font><font style="vertical-align: inherit;">그렇다면 왜 우리가 물건의 일부로 그것을 가질 수 없다면 왜 귀찮게합니까?</font></font>
ru: Как видите,публичная статическая функция prettyName ничего не знает об объекте.Она просто работает с параметрами,которые вы передаете,как обычная функция,которая не является частью объекта.Зачем тогда беспокоиться,если мы могли бы просто иметь ее не как часть объекта?
zh_cn: 你可以看到,public static函数prettyName对对象一无所知。它只是和你传递的参数一起工作,就像一个普通的函数一样,不属于对象的一部分。那么,如果我们可以让它不作为对象的一部分就好了,又何必费心呢?

source: As you can tell, there is a property on that class called <code>$name</code> and a method (function) called <code>sayHello()</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como puede ver, hay una propiedad en esa clase llamada </font></font> <code>$name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y un m&eacute;todo (funci&oacute;n) llamado </font></font> <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご存知のように、そのクラスには</font></font> <code>$name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">呼ばれるプロパティ</font><font style="vertical-align: inherit;">と</font></font> <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれるメソッド（関数</font><font style="vertical-align: inherit;">）があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알 수 있듯이 </font></font> <code>$name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이라는 클래스의 속성 </font><font style="vertical-align: inherit;">과 </font></font> <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라는 메서드 (함수 </font><font style="vertical-align: inherit;">)가</font><font style="vertical-align: inherit;"> 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как вы можете сказать, в этом классе есть свойство с именем </font></font> <code>$name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и метод (функция) с именем </font></font> <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如您所知，该类上有一个名为</font></font> <code>$name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的属性</font><font style="vertical-align: inherit;">和一个名为</font></font> <code>sayHello()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的方法（函数</font><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">。</font></font>
