Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It's not mentioned in your question, but (legacy) JSF also supports <a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"><code>@CustomScoped</code></a> and <a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"><code>@NoneScoped</code></a>, which are rarely used in real world. The <code>@CustomScoped</code> must refer a custom <code>Map&lt;K, Bean&gt;</code> implementation in some broader scope which has overridden <code>Map#put()</code> and/or <code>Map#get()</code> in order to have more fine grained control over bean creation and/or destroy.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No se menciona en su pregunta, pero JSF (heredado) tambi&eacute;n admite </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"> <code>@CustomScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"> <code>@NoneScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que rara vez se usan en el mundo real. El </font></font> <code>@CustomScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe referir a un encargo </font></font> <code>Map&lt;K, Bean&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aplicaci&oacute;n de alguna alcance m&aacute;s amplio que ha anulado </font></font> <code>Map#put()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y / o </font></font> <code>Map#get()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con el fin de tener un control de grano m&aacute;s fino sobre la creaci&oacute;n de frijol y / o destruir.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">質問では言及されていませんが、（レガシー）JSFは</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"> <code>@CustomScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"> <code>@NoneScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もサポートしてい</font><font style="vertical-align: inherit;">ます。これらは実際にはほとんど使用されません。</font></font> <code>@CustomScoped</code> は、<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">カスタムを参照する必要があります</font></font> <code>Map&lt;K, Bean&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オーバーライドしているいくつかのより広い範囲での実装</font></font> <code>Map#put()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および/または</font></font> <code>Map#get()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆の作成をよりきめの細かい制御を持っている、および/または破壊するためです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 질문에 언급되지 않았지만 (레거시) JSF는 </font><font style="vertical-align: inherit;">실제 환경에서는 거의 사용되지 않는 </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"> <code>@CustomScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"> <code>@NoneScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 지원합니다 </font><font style="vertical-align: inherit;">. </font></font> <code>@CustomScoped</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용자 정의를 참조해야합니다 </font></font> <code>Map&lt;K, Bean&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 오버라이드 (override) 한 몇 가지 더 넓은 범위에서 구현 </font></font> <code>Map#put()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 / 또는 </font></font> <code>Map#get()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 빈 생성을보다 세밀하게 제어 할 수 있습니다 및 / 또는 파괴하기 위해서이다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не упоминается в вашем вопросе, но (устаревшая) JSF также поддерживает </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"> <code>@CustomScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"> <code>@NoneScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которые редко используются в реальном мире. </font></font> <code>@CustomScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен ссылаться на обычае </font></font> <code>Map&lt;K, Bean&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> реализация в некоторой широкой области , </font><font style="vertical-align: inherit;">которая переопределяется </font></font> <code>Map#put()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и / или на </font></font> <code>Map#get()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для того , </font><font style="vertical-align: inherit;">чтобы иметь более мелкозернистый контроль над созданием боба и / или уничтожить.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您的问题中没有提到，但（传统）JSF还支持</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/CustomScoped.html"> <code>@CustomScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/bean/NoneScoped.html"> <code>@NoneScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这在现实世界中很少使用。该</font></font> <code>@CustomScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须引用自定义</font></font> <code>Map&lt;K, Bean&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在一些更大范围的实现已覆盖</font></font> <code>Map#put()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和/或</font></font> <code>Map#get()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，以有超过bean创建更为精细的控制和/或破坏。</font></font>

source: Note that the scope should rather not be chosen based on performance implications, unless you <em>really</em> have a low memory footprint and want to go completely stateless; you'd need to use exclusively <code>@RequestScoped</code> beans and fiddle with request parameters to maintain the client's state. Also note that when you have a single JSF page with differently scoped data, then it's perfectly valid to put them in separate backing beans in a scope matching the data's scope. The beans can just access each other via <code>@ManagedProperty</code> in case of JSF managed beans or <code>@Inject</code> in case of CDI managed beans.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que el alcance no debe elegirse en funci&oacute;n de las implicaciones de rendimiento, a menos que </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">realmente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tenga una huella de memoria baja y desee pasar completamente sin estado; necesitar&iacute;a usar exclusivamente </font><font style="vertical-align: inherit;">frijoles </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y viol&iacute;n con par&aacute;metros de solicitud para mantener el estado del cliente. Tambi&eacute;n tenga en cuenta que cuando tiene una sola p&aacute;gina JSF con datos de alcance diferente, entonces es perfectamente v&aacute;lido ponerlos en beans de respaldo separados en un &aacute;mbito que coincida con el alcance de los datos. Los beans solo pueden acceder entre s&iacute; a trav&eacute;s de </font></font> <code>@ManagedProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el caso de beans administrados por JSF o </font></font> <code>@Inject</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el caso de beans administrados por CDI.</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メモリフットプリントが低く、完全にステートレスにしたい</font><font style="vertical-align: inherit;">場合を除き、パフォーマンスへの影響に基づいてスコープを選択しないでください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">クライアントの状態を維持するには、</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanを</font><font style="vertical-align: inherit;">排他的に使用</font><font style="vertical-align: inherit;">し、リクエストパラメータをいじる</font><font style="vertical-align: inherit;">必要があり</font><font style="vertical-align: inherit;">ます。また、スコープが異なるデータを持つ単一のJSFページがある場合、データのスコープと一致するスコープ内の個別のバッキングBeanにそれらを配置することは完全に有効です。</font><font style="vertical-align: inherit;">JSFマネージドBeanの場合はBeanは</font></font> <code>@ManagedProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">介して</font><font style="vertical-align: inherit;">、CDIマネージドBeanの場合は</font></font> <code>@Inject</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">介してBeanは互いにアクセスできます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메모리 사용량이 적고 상태를 완전히 유지하지 않으려는 </font><font style="vertical-align: inherit;">경우가 아니라면 성능 영향에 따라 범위를 선택하지 않아야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">클라이언트의 상태를 유지하려면 </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 빈과 요청 매개 변수를 가진 바이올린을 </font><font style="vertical-align: inherit;">독점적으로 사용해야 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">또한 범위가 다른 데이터가있는 단일 JSF 페이지가있는 경우 데이터의 범위와 일치하는 범위에서 별도의 백킹 Bean에 배치하는 것이 유효합니다. </font><font style="vertical-align: inherit;">Bean은 </font><font style="vertical-align: inherit;">JSF 관리 Bean의 경우 </font></font> <code>@ManagedProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font><font style="vertical-align: inherit;">CDI 관리 Bean의 경우 </font></font> <code>@Inject</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">통해 서로 액세스 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что область видимости не должна выбираться исходя из факторов, влияющих на производительность, за исключением случаев, когда у вас </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">действительно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мало места в памяти и вы хотите полностью отказаться от состояния; вам нужно было бы использовать исключительно </font><font style="vertical-align: inherit;">компоненты </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и скрипку с параметрами запроса для поддержания состояния клиента. Также обратите внимание, что если у вас есть одна JSF-страница с данными различной области, то вполне допустимо поместить их в отдельные компоненты поддержки в области, соответствующей области данных. </font></font> <code>@ManagedProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> могут просто обращаться друг к другу через </font><font style="vertical-align: inherit;">@ManagedProperty</font><font style="vertical-align: inherit;"> в случае управляемых </font></font> <code>@Inject</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JSF или </font><font style="vertical-align: inherit;">@Inject</font><font style="vertical-align: inherit;"> в случае управляемых </font><font style="vertical-align: inherit;">бинов</font><font style="vertical-align: inherit;"> CDI.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，除非您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确实</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有较低的内存占用空间并且希望完全无状态</font><font style="vertical-align: inherit;">，否则不应根据性能的影响来选择范围</font><font style="vertical-align: inherit;">。您只需要使用</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean，并使用请求参数来维护客户端的状态。还要注意，当您只有一个JSF页面具有不同范围的数据时，将它们放在与数据范围相匹配的范围中的单独的支持bean中是完全有效的。</font><font style="vertical-align: inherit;">如果是JSF托管Bean，则</font><font style="vertical-align: inherit;">这些bean只能通过</font></font> <code>@ManagedProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">彼此访问</font><font style="vertical-align: inherit;">；如果是CDI托管Bean，则</font><font style="vertical-align: inherit;">可以通过</font></font> <code>@Inject</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">彼此访问</font><font style="vertical-align: inherit;">。</font></font>

source: Pass an object between @ViewScoped beans without using GET params
es: Pasar un objeto entre los frijoles @ViewScoped sin usar los parámetros GET
ja: GET パラメータを使わずに @ViewScoped ビーンズ間でオブジェクトを渡す
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GET 매개 변수를 사용하지 않고 @ViewScoped Bean간에 오브젝트를 전달하십시오.</font></font>
ru: Передача объекта между @ViewScoped бобами без использования GET-параметров
zh_cn: 在@ViewScoped Bean之间传递一个对象,而不使用GET参数。

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: Since JSF 2.3 all the bean scopes defined in package <code>javax.faces.bean</code> package have been deprecated to align the scopes with CDI. Moreover they're only applicable if your bean is using <code>@ManagedBean</code> annotation. If you are using JSF versions below 2.3 refer to the legacy answer at the end.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde JSF 2.3, todos los &aacute;mbitos de bean definidos en el paquete </font></font> <code>javax.faces.bean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> han quedado en desuso para alinear los &aacute;mbitos con CDI. </font><font style="vertical-align: inherit;">Adem&aacute;s, solo son aplicables si su bean utiliza la </font><font style="vertical-align: inherit;">anotaci&oacute;n </font></font> <code>@ManagedBean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si est&aacute; utilizando las versiones JSF inferiores a la 2.3, consulte la respuesta heredada al final.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF 2.3以降、パッケージ</font></font> <code>javax.faces.bean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージで</font><font style="vertical-align: inherit;">定義されたすべてのBeanスコープ</font><font style="vertical-align: inherit;">は、スコープをCDIに合わせるために非推奨になりました。</font><font style="vertical-align: inherit;">さらに、Beanが</font></font> <code>@ManagedBean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アノテーション</font><font style="vertical-align: inherit;">を使用している場合にのみ適用されます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">2.3未満のJSFバージョンを使用している場合は、最後の従来の回答を参照してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF 2.3 이후, </font></font> <code>javax.faces.bean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지에 </font><font style="vertical-align: inherit;">정의 된 모든 Bean 스코프 </font><font style="vertical-align: inherit;">는 스코프를 CDI에 맞추기 위해 사용되지 않습니다. </font><font style="vertical-align: inherit;">또한 bean이 </font></font> <code>@ManagedBean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 주석을 </font><font style="vertical-align: inherit;">사용하는 경우에만 적용 가능합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">2.3 미만의 JSF 버전을 사용하는 경우 끝에있는 레거시 답변을 참조하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с JSF 2.3 все области действия bean-компонентов, определенные в пакете </font></font> <code>javax.faces.bean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , устарели, чтобы выровнять области с CDI. </font><font style="vertical-align: inherit;">Более того, они применимы, только если ваш компонент использует </font><font style="vertical-align: inherit;">аннотацию </font></font> <code>@ManagedBean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если вы используете версии JSF ниже 2.3, обратитесь к устаревшему ответу в конце.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从JSF 2.3 </font><font style="vertical-align: inherit;">开始，不赞成使用</font><font style="vertical-align: inherit;">包</font></font> <code>javax.faces.bean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包中</font><font style="vertical-align: inherit;">定义的所有bean作用域，</font><font style="vertical-align: inherit;">以使作用域与CDI对齐。</font><font style="vertical-align: inherit;">此外，它们仅在您的bean使用</font></font> <code>@ManagedBean</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注释</font><font style="vertical-align: inherit;">时才适用</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果您使用的是2.3以下的JSF版本，请参考最后的遗留答案。</font></font>
