Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Abusing an <code>@ApplicationScoped</code> bean for session/view/request scoped data would make it to be shared among all users, so anyone else can see each other's data which is just plain wrong. Abusing a <code>@SessionScoped</code> bean for view/request scoped data would make it to be shared among all tabs/windows in a single browser session, so the enduser may experience inconsitenties when interacting with every view after switching between tabs which is bad for user experience. Abusing a <code>@RequestScoped</code> bean for view scoped data would make view scoped data to be reinitialized to default on every single (ajax) postback, causing possibly non-working forms (<a href="https://stackoverflow.com/a/2120183/157882">see also points 4 and 5 here</a>). Abusing a <code>@ViewScoped</code> bean for request, session or application scoped data, and abusing a <code>@SessionScoped</code> bean for application scoped data doesn't affect the client, but it unnecessarily occupies server memory and is plain inefficient.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Abusar de un </font><font style="vertical-align: inherit;">bean </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para los datos con alcance de sesi&oacute;n / vista / solicitud har&iacute;a que se compartiera entre todos los usuarios, para que cualquier otra persona pueda ver los datos de los dem&aacute;s, lo cual es simplemente incorrecto. Abusar de un </font><font style="vertical-align: inherit;">bean </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ver / solicitar datos con alcance har&iacute;a que se compartiera entre todas las pesta&ntilde;as / ventanas en una sola sesi&oacute;n del navegador, por lo que el usuario final puede experimentar inconsistencias al interactuar con cada vista despu&eacute;s de cambiar entre pesta&ntilde;as, lo que es malo para la experiencia del usuario. Abusar de un </font><font style="vertical-align: inherit;">bean </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ver los datos del alcance har&iacute;a que los datos del alcance de la vista se reinicialicen a los valores predeterminados en cada devoluci&oacute;n de datos (ajax), lo que puede causar formas que no funcionen ( </font></font><a href="https://stackoverflow.com/a/2120183/157882"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ver tambi&eacute;n los puntos 4 y 5 aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Abusar de un </font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bean para solicitud, sesi&oacute;n o datos con &aacute;mbito de aplicaci&oacute;n, y el abuso de un </font><font style="vertical-align: inherit;">bean </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para datos con &aacute;mbito de aplicaci&oacute;n no afecta al cliente, pero ocupa innecesariamente la memoria del servidor y es completamente ineficiente.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanをセッション/ビュー/リクエストスコープのデータに</font><font style="vertical-align: inherit;">悪用する</font><font style="vertical-align: inherit;">と、すべてのユーザー間で共有されるため、他の誰もがお互いのデータを見ることができますが、これは間違いです。</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanをビュー/リクエストスコープのデータに</font><font style="vertical-align: inherit;">悪用する</font><font style="vertical-align: inherit;">と、単一のブラウザセッションですべてのタブ/ウィンドウ間で共有されるため、エンドユーザーがタブを切り替えた後にすべてのビューを操作するときに不便が生じる可能性があり、ユーザーエクスペリエンスに悪影響を及ぼします。</font><font style="vertical-align: inherit;">ビュースコープデータに対して</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanを</font><font style="vertical-align: inherit;">悪用すると</font><font style="vertical-align: inherit;">、ビュースコープデータがすべての（ajax）ポストバックごとにデフォルトに再初期化され、フォームが機能しない可能性があります（</font></font><a href="https://stackoverflow.com/a/2120183/157882"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここのポイント4と5も参照</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font> <code>@ViewScoped</code> の<font style="vertical-align: inherit;">悪用</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リクエスト、セッション、またはアプリケーションスコープのデータ</font><font style="vertical-align: inherit;">用のBean </font><font style="vertical-align: inherit;">、および</font><font style="vertical-align: inherit;">アプリケーションスコープのデータ用の</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanの</font><font style="vertical-align: inherit;">悪用</font><font style="vertical-align: inherit;">はクライアントに影響しませんが、サーバーのメモリを不必要に占有し、非効率的です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">남용 </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 사람이 그냥 일반 잘못이다 서로의 데이터를 볼 수 있도록, 모든 사용자와 공유 할 수 있도록 할 데이터가 세션 /보기 / 요청에 대한 빈 봐줘서. 남용 </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 뷰의 빈을 / 요청이 데이터는 모든 탭에서 공유 할 수 있도록 할 범위 / 단일 브라우저 세션에서 창, 사용자 경험에 대한 나쁜 탭 사이를 전환 한 후 모든보기와 상호 작용 할 때 최종 사용자가 inconsitenties가 발생할 수 있도록. 남용 </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 데이터 뷰 범위의 데이터를 만들어보기 위해 콩을 할 범주가 지정된 것은 아마도 작동하지 않는 형태를 일으키는 매 (아약스) 포스트 백에 기본값으로 초기화되는 ( </font></font><a href="https://stackoverflow.com/a/2120183/157882"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조 또한 포인트 4, 여기 5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"> 남용</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요청, 세션 또는 응용 프로그램 범위의 데이터에 </font><font style="vertical-align: inherit;">대한 Bean 및 응용 프로그램 범위의 데이터에 대한 </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean을 </font><font style="vertical-align: inherit;">악용하는 </font><font style="vertical-align: inherit;">것은 클라이언트에 영향을 미치지 않지만 불필요하게 서버 메모리를 차지하며 비효율적입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Злоупотребление </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> компонентом </font><font style="vertical-align: inherit;">@ApplicationScoped</font><font style="vertical-align: inherit;"> для данных в области сеанса / просмотра / запроса сделало бы его доступным для всех пользователей, поэтому любой может увидеть данные друг друга, что просто неправильно. Злоупотребление </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> компонентом </font><font style="vertical-align: inherit;">@SessionScoped</font><font style="vertical-align: inherit;"> для данных области просмотра / запроса сделало бы его доступным для всех вкладок / окон в одном сеансе браузера, поэтому конечный пользователь может испытывать неудобства при взаимодействии с каждым представлением после переключения между вкладками, что плохо для пользовательского опыта. Злоупотребление </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> компонентом </font><font style="vertical-align: inherit;">@RequestScoped</font><font style="vertical-align: inherit;"> для представления данных в области представления приведет </font><font style="vertical-align: inherit;">к </font><font style="vertical-align: inherit;">повторной</font><font style="vertical-align: inherit;"> инициализации данных в области представления для значения по умолчанию при каждой обратной передаче (ajax), что может привести к нерабочим формам ( </font></font><a href="https://stackoverflow.com/a/2120183/157882"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">см. Также пункты 4 и 5 здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Злоупотребление </font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Компонент bean для запроса, данных сеанса или области приложения и злоупотребление </font><font style="vertical-align: inherit;">компонентом </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для данных области приложения не влияет на клиента, но он излишне занимает память сервера и, как правило, неэффективен.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean用作会话/视图/请求范围的数据将使其在所有用户之间共享，因此其他任何人都可以看到彼此的数据，这完全是错误的。将</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean用于视图/请求范围的数据将使其在单个浏览器会话中的所有选项卡/窗口之间共享，因此最终用户在选项卡之间切换后与每个视图进行交互时可能会遇到麻烦，这不利于用户体验。将</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean用作视图作用域数据将使视图作用域数据在每次单个（ajax）回发时都重新初始化为默认值，从而可能导致无法使用的表单（</font></font><a href="https://stackoverflow.com/a/2120183/157882"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另请参见此处的第4和第5点</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。滥用</font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于请求，会话或应用程序范围的数据的</font><font style="vertical-align: inherit;">bean </font><font style="vertical-align: inherit;">，并且滥用</font><font style="vertical-align: inherit;">用于应用程序范围的数据</font><font style="vertical-align: inherit;">的</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean不会影响客户端，但是会不必要地占用服务器内存，并且效率很低。</font></font>

source: Advantages of using JSF Faces Flow instead of the normal navigation system
es: Ventajas de usar JSF Faces Flow en lugar del sistema de navegación normal
ja: 通常のナビではなくJSF Faces Flowを使うメリット
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반 탐색 시스템 대신 JSF Faces Flow를 사용하는 이점</font></font>
ru: Преимущества использования JSF Faces Flow вместо обычной навигационной системы
zh_cn: 使用JSF面孔流代替普通导航系统的优势

source: As last, JSF also supports the flash scope. It is backed by a short living cookie which is associated with a data entry in the session scope. Before the redirect, a cookie will be set on the HTTP response with a value which is uniquely associated with the data entry in the session scope. After the redirect, the presence of the flash scope cookie will be checked and the data entry associated with the cookie will be removed from the session scope and be put in the request scope of the redirected request. Finally the cookie will be removed from the HTTP response. This way the redirected request has access to request scoped data which was been prepared in the initial request.
es: Por último,la JSF también soporta el visor de flash.Está respaldado por una cookie de vida corta que está asociada con una entrada de datos en el ámbito de la sesión.Antes de la redirección,una cookie será puesta en la respuesta HTTP con un valor que está asociado únicamente con la entrada de datos en el ámbito de la sesión.Después de la redirección,se comprobará la presencia de la cookie del ámbito de flash y la entrada de datos asociada a la cookie se eliminará del ámbito de sesión y se pondrá en el ámbito de la solicitud de la redirección.Finalmente la cookie será eliminada de la respuesta HTTP.De esta manera la petición redirigida tiene acceso a los datos del ámbito de la petición que se preparó en la petición inicial.
ja: 最後になりましたが、JSFはフラッシュスコープもサポートしています。これは、セッションスコープ内のデータエントリに関連付けられた短い生きたクッキーによってバックアップされています。リダイレクトの前に、クッキーはセッションスコープのデータエントリに一意に関連付けられた値を持つHTTPレスポンスに設定されます。リダイレクトの後、フラッシュ・スコープ・クッキーの存在がチェックされ、クッキーに関連付けられたデータ・エントリがセッション・スコープから削除され、リダイレクトされたリクエストのリクエスト・スコープに置かれます。最後に、クッキーはHTTPレスポンスから削除されます。このようにして、リダイレクトされたリクエストは最初のリクエストで用意されたリクエストスコープのデータにアクセスできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막으로 JSF는 플래시 범위도 지원합니다. </font><font style="vertical-align: inherit;">세션 범위의 데이터 항목과 연관된 짧은 리빙 쿠키로 지원됩니다. </font><font style="vertical-align: inherit;">경로 재 지정하기 전에 세션 범위의 데이터 항목과 고유하게 연관된 값을 사용하여 HTTP 응답에 쿠키가 설정됩니다. </font><font style="vertical-align: inherit;">리디렉션 후 플래시 범위 쿠키가 있는지 확인하고 쿠키와 관련된 데이터 항목이 세션 범위에서 제거되고 리디렉션 된 요청의 요청 범위에 배치됩니다. </font><font style="vertical-align: inherit;">마지막으로 쿠키는 HTTP 응답에서 제거됩니다. </font><font style="vertical-align: inherit;">이렇게하면 리디렉션 된 요청이 초기 요청에서 준비된 범위 데이터 요청에 액세스 할 수 있습니다.</font></font>
ru: Наконец,JSF также поддерживает область действия флэш-памяти.Он поддерживается коротким живым куки-файлом,который связан с вводом данных в область видимости сеанса.Перед переадресацией на HTTP-ответ будет установлен куки со значением,которое уникальным образом связано с вводом данных в сеансовом диапазоне.После перенаправления,будет проверено наличие куки-флеш-области,а запись данных,связанная с куки-файлом,будет удалена из сеансового диапазона и помещена в область запроса перенаправленного запроса.Наконец,cookie будет удален из HTTP ответа.Таким образом,перенаправленный запрос имеет доступ к запрашиваемым данным,которые были подготовлены в первоначальном запросе.
zh_cn: 如上一次,JSF还支持Flash作用域。它由一个简短的活体cookie支持,该cookie与会话范围中的数据条目相关联。在重定向之前,一个cookie将被设置在HTTP响应上,其值与会话范围中的数据条目唯一相关联。在重定向后,将检查flash scope cookie的存在,与cookie相关联的数据条目将从会话范围中删除,并放到重定向请求的请求范围中。最后,cookie将从HTTP响应中删除。这样,重定向的请求就可以访问在初始请求中准备好的请求范围数据。

source: As of JSF 2.x there are 4 Bean Scopes:
es: A partir de la JSF 2.x hay 4 alcances de frijoles:
ja: JSF 2.xでは、4つのBeanスコープがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF 2.x부터 4 개의 Bean 범위가 있습니다.</font></font>
ru: По состоянию на JSF 2.x имеется 4 диапазона бобов:
zh_cn: 截止到JSF 2.x,有4个Bean Scopes。

source: CDI missing @ViewScoped and @FlashScoped
es: Falta el CDI @ViewScoped y @FlashScoped
ja: CDI に @ViewScoped と @FlashScoped がありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ViewScoped 및 @FlashScoped가없는 CDI</font></font>
ru: Не хватает CDI @Просмотр и @Поиск прошивки
zh_cn: CDI缺失@ViewScoped和@FlashScoped

source: Choose the scope you based on your requirement.
es: Elija el ámbito de aplicación en función de sus necesidades.
ja: あなたの要件に基づいてスコープを選択します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요구 사항에 따라 범위를 선택하십시오.</font></font>
ru: Выберите область применения в соответствии с вашими требованиями.
zh_cn: 根据你的要求,选择你的范围。

source: Communication in JSF2 - Managed bean scopes
es: Comunicación en JSF2-Alcances de los frijoles administrados
ja: JSF2での通信-管理されたビーンスコープ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF2의 통신-관리 Bean 범위</font></font>
ru: Коммуникация в JSF2-управляемые бобовые диапазоны
zh_cn: JSF2中的通信----管理的豆子作用域

source: Difference between View and Request scope in managed beans
es: Diferencia entre el alcance de la vista y la solicitud en los frijoles manejados
ja: マネージドビーンズにおけるビュースコープとリクエストスコープの違い
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관리 Bean에서보기 범위와 요청 범위의 차이점</font></font>
ru: Разница между областью просмотра и областью запроса в управляемых бобах
zh_cn: 管理豆子中视图和请求范围的区别

source: Expire specific managed bean instance after time interval
es: Expirar una instancia específica de frijol administrado después de un intervalo de tiempo
ja: 特定の管理されたBeanインスタンスを時間間隔後に期限切れにする
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시간 간격 후 특정 관리 Bean 인스턴스 만료</font></font>
ru: Истечение срока действия конкретного управляемого экземпляра фасоли по истечении интервала времени.
zh_cn: 在时间间隔后过期的特定管理豆实例。

source: Flash scope
es: Alcance del flash
ja: フラッシュスコープ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">플래시 범위</font></font>
ru: Прицел для вспышек
zh_cn: 闪光范围

source: From JSF 2.3 here are scopes that can be used on JSF Backing Beans:
es: De JSF 2.3 aquí hay alcances que pueden ser usados en JSF Backing Beans:
ja: JSF 2.3からは、JSF Backing Beansで使用できるスコープをご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF 2.3부터는 JSF Backing Bean에서 사용할 수있는 범위가 있습니다.</font></font>
ru: Из JSF 2.3 здесь приведены диапазоны,которые могут быть использованы на бобах JSF Backing Beans:
zh_cn: 从JSF 2.3开始,这里是可以在JSF后盾豆上使用的范围。

source: How to choose the right bean scope
es: Cómo elegir el alcance correcto de los frijoles
ja: 正しいビーンズスコープの選び方
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">올바른 콩 범위를 선택하는 방법</font></font>
ru: Как выбрать правильный диапазон бобов
zh_cn: 如何选择合适的豆类范围

source: How to show faces message in the redirected page
es: Cómo mostrar el mensaje de caras en la página redirigida
ja: リダイレクトされたページに顔写真のメッセージを表示する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">리디렉션 된 페이지에 얼굴 메시지를 표시하는 방법</font></font>
ru: Как отобразить сообщение с лицами на перенаправленной странице?
zh_cn: 如何在重定向页面中显示面孔信息

source: I noticed that there are different bean scopes like:
es: Me he dado cuenta de que hay diferentes alcances de los frijoles como:
ja: のような豆のスコープがあることに気がつきました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 다른 Bean 범위가 있음을 알았습니다.</font></font>
ru: Я заметила,что есть разные бобовые оптические прицелы:
zh_cn: 我注意到,有不同的豆瓣评分像。

source: It represents the scope (the lifetime) of the bean. This is easier to understand if you are familiar with "under the covers" working of a basic servlet web application: <a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading">How do servlets work? Instantiation, sessions, shared variables and multithreading</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Representa el alcance (la vida &uacute;til) del bean. Esto es m&aacute;s f&aacute;cil de entender si est&aacute; familiarizado con el funcionamiento "oculto" de una aplicaci&oacute;n web de servlet b&aacute;sica: </font></font><a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo funcionan los servlets? Instanciaci&oacute;n, sesiones, variables compartidas y multihilo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Beanのスコープ（存続期間）を表します。これは、基本的なサーブレットWebアプリケーションの「内部」の動作に精通している場合に理解しやすくなり</font></font><a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。インスタンス化、セッション、シェア変数、マルチスレッド</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bean의 범위 (수명)를 나타냅니다. </font><font style="vertical-align: inherit;">기본 서블릿 웹 애플리케이션의 "표지 아래"작업에 익숙한 경우 이해하기 쉽습니다. </font></font><a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿은 어떻게 작동합니까? </font><font style="vertical-align: inherit;">인스턴스화, 세션, 공유 변수 및 멀티 스레딩</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он представляет область действия (время жизни) компонента. Это легче понять, если вы знакомы с работой &laquo;под прикрытием&raquo; основного веб-приложения с сервлетами: </font></font><a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">как работают сервлеты? Создание экземпляров, сессий, общих переменных и многопоточности</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它代表了bean的范围（生存期）。如果您熟悉基本servlet Web应用程序的&ldquo;幕后&rdquo;工作，这将更容易理解：</font></font><a href="https://stackoverflow.com/questions/3106452/how-do-servlets-work-instantiation-session-variables-and-multithreading"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">servlet如何工作？实例化，会话，共享变量和多线程</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
