Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>RequestScope:</strong> The request scope is short-lived. It starts when an HTTP request is submitted and ends after the response is sent back to the client. If you place a managed bean into request scope, a new instance is created with each request. It is worth considering request scope if you are concerned about the cost of session scope storage.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RequestScope:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el alcance de la solicitud es de corta duraci&oacute;n. </font><font style="vertical-align: inherit;">Comienza cuando se env&iacute;a una solicitud HTTP y finaliza despu&eacute;s de que la respuesta se devuelve al cliente. </font><font style="vertical-align: inherit;">Si coloca un bean administrado en el alcance de la solicitud, se crea una nueva instancia con cada solicitud. </font><font style="vertical-align: inherit;">Vale la pena considerar el alcance de la solicitud si le preocupa el costo del almacenamiento del alcance de la sesi&oacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RequestScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> リクエストスコープは短命です。</font><font style="vertical-align: inherit;">これは、HTTP要求が送信されたときに始まり、応答がクライアントに送り返された後に終了します。</font><font style="vertical-align: inherit;">マネージドBeanをリクエストスコープに配置すると、リクエストごとに新しいインスタンスが作成されます。</font><font style="vertical-align: inherit;">セッションスコープのストレージのコストが心配な場合は、リクエストスコープを検討する価値があります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RequestScope :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요청 범위가 짧습니다. </font><font style="vertical-align: inherit;">HTTP 요청이 제출 될 때 시작되고 응답이 클라이언트로 다시 전송 된 후 종료됩니다. </font><font style="vertical-align: inherit;">관리 Bean을 요청 범위에 배치하면 각 요청마다 새 인스턴스가 작성됩니다. </font><font style="vertical-align: inherit;">세션 범위 스토리지 비용이 염려되는 경우 요청 범위를 고려하는 것이 좋습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RequestScope:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объем запроса является недолгим. </font><font style="vertical-align: inherit;">Он начинается при отправке HTTP-запроса и заканчивается после отправки ответа клиенту. </font><font style="vertical-align: inherit;">Если вы помещаете управляемый компонент в область запроса, новый экземпляр создается с каждым запросом. </font><font style="vertical-align: inherit;">Стоит рассмотреть объем запроса, если вас беспокоит стоимость хранения области сеанса.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RequestScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 请求范围是短暂的。</font><font style="vertical-align: inherit;">它在提交HTTP请求时开始，在将响应发送回客户端后结束。</font><font style="vertical-align: inherit;">如果将托管bean放入请求范围，则会为每个请求创建一个新实例。</font><font style="vertical-align: inherit;">如果您担心会话范围存储的成本，则值得考虑请求范围。</font></font>

source: <strong>Session Scope:</strong> The session scope persists from the time that a session is established until session termination. A session terminates if the web application invokes the invalidate method on the HttpSession object, or if it times out.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Alcance de la sesi&oacute;n:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el alcance de la sesi&oacute;n persiste desde el momento en que se establece una sesi&oacute;n hasta su finalizaci&oacute;n. </font><font style="vertical-align: inherit;">Una sesi&oacute;n finaliza si la aplicaci&oacute;n web invoca el m&eacute;todo de invalidaci&oacute;n en el objeto HttpSession, o si se agota el tiempo de espera.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッションスコープ：セッションスコープ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> は、セッションが確立されてから終了するまで存続します。</font><font style="vertical-align: inherit;">WebアプリケーションがHttpSessionオブジェクトのinvalidateメソッドを呼び出すか、タイムアウトになった場合、セッションは終了します。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세션 범위 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 세션 범위는 세션이 설정된 시간부터 세션 종료까지 지속됩니다. </font><font style="vertical-align: inherit;">웹 애플리케이션이 HttpSession 오브젝트에서 invalidate 메소드를 호출하거나 시간 종료되면 세션이 종료됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Область сеанса:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> область сеанса сохраняется с момента установления сеанса до его завершения. </font><font style="vertical-align: inherit;">Сеанс завершается, если веб-приложение вызывает метод invalidate для объекта HttpSession или по истечении времени ожидания.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会话范围：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 会话范围从建立会话的时间一直持续到会话终止。</font><font style="vertical-align: inherit;">如果Web应用程序在HttpSession对象上调用invalidate方法，或者会话超时，则会话终止。</font></font>

source: <strong>Source:</strong><a href="http://horstmann.com/corejsf/">Core Java Server Faces 3rd Edition</a> by David Geary &amp; Cay Horstmann [Page no. 51 - 54]
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font></strong><a href="http://horstmann.com/corejsf/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core Java Server Faces 3rd Edition</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por David Geary y Cay Horstmann [P&aacute;gina no. </font><font style="vertical-align: inherit;">51 - 54]</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出典：</font></font></strong><a href="http://horstmann.com/corejsf/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core Java Server Faces 3rd Edition</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> by David Geary＆Cay Horstmann [ページ番号。</font><font style="vertical-align: inherit;">51〜54]</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> David Geary &amp; Cay Horstmann의 </font></font><a href="http://horstmann.com/corejsf/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core Java Server Faces 3rd Edition</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [페이지 번호. </font><font style="vertical-align: inherit;">51-54]</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font></strong><a href="http://horstmann.com/corejsf/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core Java Server Faces, 3-е издание</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , Дэвид Гири и Кей Хорстманн [Страница №. </font><font style="vertical-align: inherit;">51 - 54]</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">资料来源：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> David Geary和Cay Horstmann撰写的</font></font><a href="http://horstmann.com/corejsf/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core Java Server Faces第三版</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> [页面编号。</font><font style="vertical-align: inherit;">51-54]</font></font>

source: <strong>ViewScope:</strong> View scope was added in JSF 2.0. A bean in view scope persists while the same JSF page is redisplayed. (The JSF specification uses the term view for a JSF page.) As soon as the user navigates to a different page, the bean goes out of scope.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ViewScope: el</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> alcance de la vista se agreg&oacute; en JSF 2.0. </font><font style="vertical-align: inherit;">Un bean en el alcance de la vista persiste mientras se vuelve a mostrar la misma p&aacute;gina JSF. </font><font style="vertical-align: inherit;">(La especificaci&oacute;n JSF usa el t&eacute;rmino vista para una p&aacute;gina JSF). Tan pronto como el usuario navega a una p&aacute;gina diferente, el bean queda fuera de alcance.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ViewScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ビューのスコープはJSF 2.0で追加されました。</font><font style="vertical-align: inherit;">ビュー範囲内のBeanは、同じJSFページが再表示されている間も存続します。</font><font style="vertical-align: inherit;">（JSF仕様では、JSFページのビューという用語を使用しています。）ユーザーが別のページに移動するとすぐに、Beanはスコープ外になります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ViewScope :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JSF 2.0에서보기 범위가 추가되었습니다. </font><font style="vertical-align: inherit;">동일한 JSF 페이지가 다시 표시되는 동안 뷰 범위의 Bean이 지속됩니다. </font><font style="vertical-align: inherit;">JSF 스펙은 JSF 페이지에 대해 용어보기를 사용합니다. 사용자가 다른 페이지를 탐색하자마자 Bean은 범위를 벗어납니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ViewScope:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> область просмотра была добавлена ​​в JSF 2.0. </font><font style="vertical-align: inherit;">Область видимости компонента сохраняется, пока отображается та же страница JSF. </font><font style="vertical-align: inherit;">(Спецификация JSF использует термин представление для страницы JSF.) Как только пользователь переходит на другую страницу, бин выходит из области видимости.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ViewScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> View范围是在JSF 2.0中添加的。</font><font style="vertical-align: inherit;">重新显示相同的JSF页面时，视图范围内的bean仍然存在。</font><font style="vertical-align: inherit;">（JSF规范将术语&ldquo;视图&rdquo;用于JSF页面。）一旦用户导航到另一个页面，Bean就会超出范围。</font></font>
