Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>1. <code>@javax.enterprise.context.ApplicationScoped</code></strong>: The application scope persists for the entire duration of the web application. That scope is shared among all requests and all sessions. This is useful when you have data for whole application.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. </font></font> <code>@javax.enterprise.context.ApplicationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el &aacute;mbito de aplicaci&oacute;n persiste durante toda la duraci&oacute;n de la aplicaci&oacute;n web. </font><font style="vertical-align: inherit;">Ese alcance se comparte entre todas las solicitudes y todas las sesiones. </font><font style="vertical-align: inherit;">Esto es &uacute;til cuando tiene datos para toda la aplicaci&oacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. </font></font> <code>@javax.enterprise.context.ApplicationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：アプリケーションスコープは、Webアプリケーションの期間全体にわたって持続します。</font><font style="vertical-align: inherit;">そのスコープは、すべてのリクエストとすべてのセッションで共有されます。</font><font style="vertical-align: inherit;">これは、アプリケーション全体のデータがある場合に役立ちます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. </font></font> <code>@javax.enterprise.context.ApplicationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 응용 프로그램 범위는 웹 응용 프로그램의 전체 기간 동안 지속됩니다. </font><font style="vertical-align: inherit;">해당 범위는 모든 요청과 모든 세션에서 공유됩니다. </font><font style="vertical-align: inherit;">전체 응용 프로그램에 대한 데이터가있을 때 유용합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. </font></font> <code>@javax.enterprise.context.ApplicationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область действия приложения сохраняется в течение всего срока действия веб-приложения. </font><font style="vertical-align: inherit;">Эта область является общей для всех запросов и всех сеансов. </font><font style="vertical-align: inherit;">Это полезно, когда у вас есть данные для всего приложения.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. </font></font> <code>@javax.enterprise.context.ApplicationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：应用程序作用域在Web应用程序的整个持续时间内一直存在。</font><font style="vertical-align: inherit;">该范围在所有请求和所有会话之间共享。</font><font style="vertical-align: inherit;">当您拥有整个应用程序的数据时，这很有用。</font></font>

source: <strong>2. <code>@javax.enterprise.context.SessionScoped</code></strong>: The session scope persists from the time that a session is established until session termination. The session context is shared between all requests that occur in the same HTTP session. This is useful when you wont to save data for a specific client for a particular session.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. </font></font> <code>@javax.enterprise.context.SessionScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el alcance de la sesi&oacute;n persiste desde el momento en que se establece una sesi&oacute;n hasta su finalizaci&oacute;n. </font><font style="vertical-align: inherit;">El contexto de la sesi&oacute;n se comparte entre todas las solicitudes que se producen en la misma sesi&oacute;n HTTP. </font><font style="vertical-align: inherit;">Esto es &uacute;til cuando no va a guardar datos para un cliente espec&iacute;fico para una sesi&oacute;n en particular.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. </font></font> <code>@javax.enterprise.context.SessionScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：セッションスコープは、セッションが確立されてから終了するまで存続します。</font><font style="vertical-align: inherit;">セッションコンテキストは、同じHTTPセッションで発生するすべての要求間で共有されます。</font><font style="vertical-align: inherit;">これは、特定のセッションの特定のクライアントのデータを保存しない場合に役立ちます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. </font></font> <code>@javax.enterprise.context.SessionScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 세션 범위는 세션이 설정된 시간부터 세션 종료까지 지속됩니다. </font><font style="vertical-align: inherit;">세션 컨텍스트는 동일한 HTTP 세션에서 발생하는 모든 요청간에 공유됩니다. </font><font style="vertical-align: inherit;">특정 세션의 특정 클라이언트에 대한 데이터를 저장하지 않을 때 유용합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. </font></font> <code>@javax.enterprise.context.SessionScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область действия сеанса сохраняется с момента установления сеанса до его завершения. </font><font style="vertical-align: inherit;">Контекст сеанса является общим для всех запросов, которые происходят в одном сеансе HTTP. </font><font style="vertical-align: inherit;">Это полезно, когда вы хотите сохранить данные для конкретного клиента для определенного сеанса.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. </font></font> <code>@javax.enterprise.context.SessionScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：会话范围从建立会话的时间一直持续到会话终止为止。</font><font style="vertical-align: inherit;">会话上下文在同一HTTP会话中发生的所有请求之间共享。</font><font style="vertical-align: inherit;">当您不想为特定会话保存特定客户端的数据时，此功能很有用。</font></font>

source: <strong>3. <code>@javax.enterprise.context.ConversationScoped</code></strong>: The conversation scope persists as log as the bean lives. The scope provides 2 methods: <code>Conversation.begin()</code> and <code>Conversation.end()</code>. These methods should called explicitly, either to start or end the life of a bean.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. </font></font> <code>@javax.enterprise.context.ConversationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el alcance de la conversaci&oacute;n persiste como registro mientras vive el bean. </font><font style="vertical-align: inherit;">El alcance proporciona 2 m&eacute;todos: </font></font> <code>Conversation.begin()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Conversation.end()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Estos m&eacute;todos deben llamarse expl&iacute;citamente, ya sea para iniciar o finalizar la vida de un bean.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. </font></font> <code>@javax.enterprise.context.ConversationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：会話スコープは、Beanが生きている間、ログとして存続します。</font><font style="vertical-align: inherit;">スコープは2つのメソッドを提供します：</font></font> <code>Conversation.begin()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>Conversation.end()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これらのメソッドは、Beanの寿命を開始または終了するために、明示的に呼び出す必要があります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. </font></font> <code>@javax.enterprise.context.ConversationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 대화 범위는 빈이있는 동안 로그로 유지됩니다. </font><font style="vertical-align: inherit;">이 범위는 </font></font> <code>Conversation.begin()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Conversation.end()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 가지 방법을 제공합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 메소드는 Bean의 수명을 시작하거나 종료하기 위해 명시 적으로 호출해야합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. </font></font> <code>@javax.enterprise.context.ConversationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область диалога сохраняется в виде журнала в течение всего срока жизни компонента. </font><font style="vertical-align: inherit;">Область предоставляет 2 метода: </font></font> <code>Conversation.begin()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Conversation.end()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Эти методы должны вызываться явно, чтобы начать или закончить жизнь компонента.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. </font></font> <code>@javax.enterprise.context.ConversationScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：对话范围随着bean的存在而保持为日志。</font><font style="vertical-align: inherit;">范围提供2种方法：</font></font> <code>Conversation.begin()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Conversation.end()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这些方法应显式调用，以开始或结束Bean的生命。</font></font>

source: <strong>4. <code>@javax.enterprise.context.RequestScoped</code></strong>: The request scope is short-lived. It starts when an HTTP request is submitted and ends after the response is sent back to the client. If you place a managed bean into request scope, a new instance is created with each request. It is worth considering request scope if you are concerned about the cost of session scope storage.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4. </font></font> <code>@javax.enterprise.context.RequestScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el alcance de la solicitud es de corta duraci&oacute;n. </font><font style="vertical-align: inherit;">Comienza cuando se env&iacute;a una solicitud HTTP y finaliza despu&eacute;s de que la respuesta se devuelve al cliente. </font><font style="vertical-align: inherit;">Si coloca un bean administrado en el alcance de la solicitud, se crea una nueva instancia con cada solicitud. </font><font style="vertical-align: inherit;">Vale la pena considerar el alcance de la solicitud si le preocupa el costo del almacenamiento del alcance de la sesi&oacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4. </font></font> <code>@javax.enterprise.context.RequestScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：リクエストスコープは短命です。</font><font style="vertical-align: inherit;">これは、HTTP要求が送信されたときに始まり、応答がクライアントに送り返された後に終了します。</font><font style="vertical-align: inherit;">マネージドBeanをリクエストスコープに配置すると、リクエストごとに新しいインスタンスが作成されます。</font><font style="vertical-align: inherit;">セッションスコープのストレージのコストが心配な場合は、リクエストスコープを検討する価値があります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4. </font></font> <code>@javax.enterprise.context.RequestScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 요청 범위가 짧습니다. </font><font style="vertical-align: inherit;">HTTP 요청이 제출 될 때 시작되고 응답이 클라이언트로 다시 전송 된 후 종료됩니다. </font><font style="vertical-align: inherit;">관리 Bean을 요청 범위에 배치하면 각 요청마다 새 인스턴스가 작성됩니다. </font><font style="vertical-align: inherit;">세션 범위 스토리지 비용이 염려되는 경우 요청 범위를 고려하는 것이 좋습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4. </font></font> <code>@javax.enterprise.context.RequestScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область действия запроса недолговечна. </font><font style="vertical-align: inherit;">Он начинается при отправке HTTP-запроса и заканчивается после отправки ответа клиенту. </font><font style="vertical-align: inherit;">Если вы помещаете управляемый компонент в область запроса, новый экземпляр создается с каждым запросом. </font><font style="vertical-align: inherit;">Стоит рассмотреть объем запроса, если вас беспокоит стоимость хранения области сеанса.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4. </font></font> <code>@javax.enterprise.context.RequestScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：请求范围是短暂的。</font><font style="vertical-align: inherit;">它在提交HTTP请求时开始，在将响应发送回客户端后结束。</font><font style="vertical-align: inherit;">如果将托管bean放入请求范围，则会为每个请求创建一个新实例。</font><font style="vertical-align: inherit;">如果您担心会话范围存储的成本，则值得考虑请求范围。</font></font>

source: <strong>5. <code>@javax.faces.flow.FlowScoped</code></strong>: The Flow scope persists as long as the Flow lives. A flow may be defined as a contained set of pages (or views) that define a unit of work. Flow scoped been is active as long as user navigates with in the Flow.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5. </font></font> <code>@javax.faces.flow.FlowScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el alcance del flujo persiste mientras el flujo viva. </font><font style="vertical-align: inherit;">Un flujo puede definirse como un conjunto de p&aacute;ginas (o vistas) que definen una unidad de trabajo. </font><font style="vertical-align: inherit;">El &aacute;mbito de flujo estado est&aacute; activo siempre que el usuario navegue en el flujo.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5. </font></font> <code>@javax.faces.flow.FlowScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：フロースコープは、フローが存続する限り存続します。</font><font style="vertical-align: inherit;">フローは、作業の単位を定義する一連のページ（またはビュー）として定義できます。</font><font style="vertical-align: inherit;">スコープされたフローは、ユーザーがフロー内を移動している限りアクティブです。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5. </font></font> <code>@javax.faces.flow.FlowScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 흐름 범위는 흐름이 지속되는 한 지속됩니다. </font><font style="vertical-align: inherit;">플로우는 작업 단위를 정의하는 포함 된 페이지 세트 (또는보기)로 정의 될 수 있습니다. </font><font style="vertical-align: inherit;">사용자가 흐름에서 탐색하는 한 흐름 범위가 활성화되었습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5. </font></font> <code>@javax.faces.flow.FlowScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область действия Flow сохраняется в течение всего времени существования потока. </font><font style="vertical-align: inherit;">Поток может быть определен как содержащийся набор страниц (или представлений), которые определяют единицу работы. </font><font style="vertical-align: inherit;">Область действия потока активна, пока пользователь перемещается в потоке.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5. </font></font> <code>@javax.faces.flow.FlowScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：只要Flow存在，Flow范围就会持续存在。</font><font style="vertical-align: inherit;">流可以定义为一组包含页面（或视图）的页面，这些页面定义了一个工作单元。</font><font style="vertical-align: inherit;">只要用户在Flow中进行导航，作用域就一直处于活动状态。</font></font>

source: <strong>6. <code>@javax.faces.view.ViewScoped</code></strong>: A bean in view scope persists while the same JSF page is redisplayed. As soon as the user navigates to a different page, the bean goes out of scope.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6. </font></font> <code>@javax.faces.view.ViewScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : un bean en el alcance de la vista persiste mientras se vuelve a mostrar la misma p&aacute;gina JSF. </font><font style="vertical-align: inherit;">Tan pronto como el usuario navega a una p&aacute;gina diferente, el bean queda fuera de alcance.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6. </font></font> <code>@javax.faces.view.ViewScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：同じJSFページが再表示されている間、ビュースコープのBeanが持続します。</font><font style="vertical-align: inherit;">ユーザーが別のページに移動するとすぐに、Beanはスコープ外になります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6. </font></font> <code>@javax.faces.view.ViewScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 동일한 JSF 페이지가 다시 표시되는 동안 뷰 범위의 Bean이 지속됩니다. </font><font style="vertical-align: inherit;">사용자가 다른 페이지로 이동하자마자 Bean은 범위를 벗어납니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6. </font></font> <code>@javax.faces.view.ViewScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : область видимости компонента сохраняется, пока отображается та же страница JSF. </font><font style="vertical-align: inherit;">Как только пользователь переходит на другую страницу, бин выходит из области видимости.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6. </font></font> <code>@javax.faces.view.ViewScoped</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：视图范围内的Bean在重新显示同一JSF页面时仍然存在。</font><font style="vertical-align: inherit;">一旦用户导航到另一个页面，Bean就会超出范围。</font></font>

source: <strong>ApplicationScope:</strong> The application scope persists for the entire duration of the web application. That scope is shared among all requests and all sessions. You place managed beans into the application scope if a single bean should be shared among all instances of a web application. The bean is constructed when it is first requested by any user of the application, and it stays alive until the web application is removed from the application server.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ApplicationScope:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el alcance de la aplicaci&oacute;n persiste durante toda la duraci&oacute;n de la aplicaci&oacute;n web. </font><font style="vertical-align: inherit;">Ese alcance se comparte entre todas las solicitudes y todas las sesiones. </font><font style="vertical-align: inherit;">Coloca beans administrados en el &aacute;mbito de la aplicaci&oacute;n si un solo bean se debe compartir entre todas las instancias de una aplicaci&oacute;n web. </font><font style="vertical-align: inherit;">El bean se construye cuando un usuario de la aplicaci&oacute;n lo solicita por primera vez, y permanece activo hasta que la aplicaci&oacute;n web se elimina del servidor de aplicaciones.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ApplicationScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> アプリケーションスコープは、Webアプリケーションの持続時間全体にわたって持続します。</font><font style="vertical-align: inherit;">そのスコープは、すべてのリクエストとすべてのセッションで共有されます。</font><font style="vertical-align: inherit;">Webアプリケーションのすべてのインスタンス間で単一のBeanを共有する必要がある場合は、管理対象Beanをアプリケーションスコープに配置します。</font><font style="vertical-align: inherit;">Beanは、アプリケーションのユーザーが最初に要求したときに作成され、Webアプリケーションがアプリケーションサーバーから削除されるまで存続します。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ApplicationScope :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 응용 프로그램 범위는 웹 응용 프로그램의 전체 기간 동안 지속됩니다. </font><font style="vertical-align: inherit;">해당 범위는 모든 요청과 모든 세션에서 공유됩니다. </font><font style="vertical-align: inherit;">웹 애플리케이션의 모든 인스턴스간에 단일 Bean을 공유해야하는 경우 관리 Bean을 애플리케이션 범위에 배치하십시오. </font><font style="vertical-align: inherit;">Bean은 애플리케이션 사용자가 처음 요청할 때 구성되며 웹 애플리케이션이 애플리케이션 서버에서 제거 될 때까지 활성 상태를 유지합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ApplicationScope:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> область действия приложения сохраняется в течение всего срока действия веб-приложения. </font><font style="vertical-align: inherit;">Эта область является общей для всех запросов и всех сеансов. </font><font style="vertical-align: inherit;">Вы помещаете управляемые bean-компоненты в область приложения, если один bean-компонент должен совместно использоваться всеми экземплярами веб-приложения. </font><font style="vertical-align: inherit;">Бин создается, когда его сначала запрашивает любой пользователь приложения, и он остается активным до тех пор, пока веб-приложение не будет удалено с сервера приложений.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ApplicationScope：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 应用程序作用域在Web应用程序的整个过程中一直存在。</font><font style="vertical-align: inherit;">该范围在所有请求和所有会话之间共享。</font><font style="vertical-align: inherit;">如果应在Web应用程序的所有实例之间共享单个bean，则将托管bean放入应用程序范围。</font><font style="vertical-align: inherit;">Bean是在应用程序的任何用户首次请求时构造的，并且一直处于活动状态，直到从应用程序服务器中删除Web应用程序为止。</font></font>
