Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: A <a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"><code>@RequestScoped</code></a> bean lives as long as a single HTTP request-response cycle (note that an Ajax request counts as a single HTTP request too). A <a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"><code>@ViewScoped</code></a> bean lives as long as you're interacting with the same JSF view by postbacks which call action methods returning <code>null</code>/<code>void</code> without any navigation/redirect. A <a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"><code>@FlowScoped</code></a> bean lives as long as you're navigating through the specified collection of views registered in the flow configuration file. A <a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"><code>@SessionScoped</code></a> bean lives as long as the established HTTP session. An <a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"><code>@ApplicationScoped</code></a> bean lives as long as the web application runs. Note that the CDI <code>@Model</code> is basically a <a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html">stereotype</a> for <code>@Named @RequestScoped</code>, so same rules apply.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un </font><font style="vertical-align: inherit;">bean </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"> <code>@RequestScoped</code> dura</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tanto como un solo ciclo de solicitud-respuesta HTTP (tenga en cuenta que una solicitud de Ajax tambi&eacute;n cuenta como una sola solicitud HTTP). Un </font><font style="vertical-align: inherit;">bean </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"> <code>@ViewScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> vive mientras interact&uacute;es con la misma vista JSF mediante devoluciones que llaman m&eacute;todos de acci&oacute;n que devuelven </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>void</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sin ninguna navegaci&oacute;n / redirecci&oacute;n. Un </font><font style="vertical-align: inherit;">bean </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"> <code>@FlowScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> vive mientras navega por la colecci&oacute;n especificada de vistas registradas en el archivo de configuraci&oacute;n de flujo. Un </font><font style="vertical-align: inherit;">bean </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"> <code>@SessionScoped</code> dura</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tanto como la sesi&oacute;n HTTP establecida. Un </font><font style="vertical-align: inherit;">bean </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"> <code>@ApplicationScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> vive mientras se ejecute la aplicaci&oacute;n web. Tenga en cuenta que el CDI </font></font> <code>@Model</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es b&aacute;sicamente un</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">estereotipo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font></font> <code>@Named @RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que se aplican las mismas reglas.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"> <code>@RequestScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（あまりにも単一のHTTPリクエストとしてAjaxリクエストカウントことに注意してください）長い単一のHTTPリクエスト・レスポンス・サイクルなどとして豆の命を。 Aは</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"> <code>@ViewScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">限り、あなたはコールアクションメソッドが返すポストバックで同じJSFビューと対話しているようとして豆の命を</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>void</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意のナビゲーション/リダイレクトなし。</font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"> <code>@FlowScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">限り、あなたは、フロー設定ファイルに登録されたビューの指定されたコレクションをナビゲートしているほど豆生活。</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"> <code>@SessionScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Beanは老舗HTTPセッションなどとして住んでいます。アンは</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"> <code>@ApplicationScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">長いWebアプリケーションの実行などとして豆の命を。 CDI </font></font> <code>@Model</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は基本的に</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステレオタイプ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のための</font></font> <code>@Named @RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、同じルールが適用されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A는 </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"> <code>@RequestScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 긴 하나의 HTTP 요청 - 응답주기 등 (참고 단일 HTTP 요청으로 Ajax 요청 횟수도)로 콩의 삶을. A는 </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"> <code>@ViewScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 전화 액션 메소드가 반환 포스트 백에 의해 같은 JSF보기와 상호 작용하는만큼 콩 삶을 </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>void</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 어떤 네비게이션 / 리디렉션하지 않고. </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"> <code>@FlowScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean은 플로우 구성 파일에 등록 된 지정된보기 콜렉션을 탐색 </font><font style="vertical-align: inherit;">하는 한 </font><font style="vertical-align: inherit;">유효</font><font style="vertical-align: inherit;"> 합니다. A는 </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"> <code>@SessionScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 긴 확립 된 HTTP 세션 등으로 콩의 삶을. </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"> <code>@ApplicationScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean은 웹 응용 프로그램이 실행되는 </font><font style="vertical-align: inherit;">한 </font><font style="vertical-align: inherit;">유효</font><font style="vertical-align: inherit;"> 합니다. CDI </font></font> <code>@Model</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 기본적으로</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고정 관념</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 </font></font> <code>@Named @RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 그래서 동일한 규칙이 적용됩니다.</font></font>
ru: <font style="vertical-align: inherit;"></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"> <code>@RequestScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> боба жизнь до </font><font style="vertical-align: inherit;">тех пор , </font><font style="vertical-align: inherit;">как цикл запроса-ответа одного HTTP (обратите внимание , </font><font style="vertical-align: inherit;">что рассчитывает запрос Ajax как одного запроса HTTP тоже). </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"> <code>@ViewScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> боб жизни до </font><font style="vertical-align: inherit;">тех пор , </font><font style="vertical-align: inherit;">пока вы взаимодействуя с тем же точкой </font><font style="vertical-align: inherit;">зрения JSF по постбэк , </font><font style="vertical-align: inherit;">какие методы действия вызова возвращаются </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>void</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> без навигации / редиректа. </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"> <code>@FlowScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> фасоли живет до </font><font style="vertical-align: inherit;">тех пор , </font><font style="vertical-align: inherit;">пока вы перемещаясь по заданной коллекции представлений , </font><font style="vertical-align: inherit;">зарегистрированных в файле конфигурации потока. </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"> <code>@SessionScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> боб жизни до </font><font style="vertical-align: inherit;">тех пор, установленной HTTP сессии. </font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"> <code>@ApplicationScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> боб жизни до </font><font style="vertical-align: inherit;">тех пор , </font><font style="vertical-align: inherit;">как бегут веб - </font><font style="vertical-align: inherit;">приложения. Обратите внимание, что CDI </font></font> <code>@Model</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в основном</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стереотип</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>@Named @RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому применяются те же правила.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/RequestScoped.html"> <code>@RequestScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆的生活，只要一个HTTP请求响应周期（注意，Ajax请求算作一个HTTP请求太）。一个</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/faces/view/ViewScoped.html"> <code>@ViewScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆的生活，只要你通过调用操作方法返回的回传与同JSF视图交互</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>void</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，没有任何导航/重定向。一个</font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/flow/FlowScoped.html"> <code>@FlowScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆的生活，只要你通过的流量配置文件中注册的视图指定的集合导航。一个</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/SessionScoped.html"> <code>@SessionScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆的生活，只要建立HTTP会话。一个</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/context/ApplicationScoped.html"> <code>@ApplicationScoped</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆的生活，只要运行Web应用程序。请注意，CDI </font></font> <code>@Model</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上是</font></font><a href="https://docs.oracle.com/javaee/7/api/javax/enterprise/inject/Model.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">刻板印象</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>@Named @RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，所以规则也同样适用。</font></font>
