Repository: rueisnom/feedback
Catalog: xlf/70/31/88/5/7031885.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The JSF <code>@NoneScoped</code> and CDI <a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"><code>@Dependent</code></a> basically lives as long as a single EL-evaluation on the bean. Imagine a login form with two input fields referring a bean property and a command button referring a bean action, thus with in total three EL expressions, then effectively three instances will be created. One with the username set, one with the password set and one on which the action is invoked. You normally want to use this scope only on beans which should live as long as the bean where it's being injected. So if a <code>@NoneScoped</code> or <code>@Dependent</code> is injected in a <code>@SessionScoped</code>, then it will live as long as the <code>@SessionScoped</code> bean.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El JSF </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el CDI </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"> <code>@Dependent</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> b&aacute;sicamente viven tanto tiempo como una &uacute;nica evaluaci&oacute;n EL en el bean. Imagine un formulario de inicio de sesi&oacute;n con dos campos de entrada que hacen referencia a una propiedad de bean y un bot&oacute;n de comando que hace referencia a una acci&oacute;n de bean, por lo que con un total de tres expresiones EL, se crear&aacute;n efectivamente tres instancias. Uno con el nombre de usuario establecido, uno con la contrase&ntilde;a establecida y otro en el que se invoca la acci&oacute;n. Normalmente desea usar este &aacute;mbito solo en beans que deber&iacute;an vivir tanto tiempo como el bean donde se est&aacute; inyectando. Entonces, si </font><font style="vertical-align: inherit;">se inyecta </font><font style="vertical-align: inherit;">un </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>@Dependent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en un </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , entonces vivir&aacute; tanto tiempo como el </font><font style="vertical-align: inherit;">bean </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">およびCDI </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"> <code>@Dependent</code> は、</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的に、Beanでの単一のEL評価である限り</font><font style="vertical-align: inherit;">有効</font><font style="vertical-align: inherit;">です。 Beanプロパティを参照する2つの入力フィールドとBeanアクションを参照するコマンドボタンを含むログインフォームを想像してください。したがって、合計で3つのEL式を使用すると、事実上3つのインスタンスが作成されます。 1つはユーザー名が設定され、もう1つはパスワードが設定され、もう1つはアクションが呼び出されます。通常、このスコープは、注入先のBeanと同じ長さのBeanでのみ使用します。あれば</font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>@Dependent</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中に注入され</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、それは限り生き続ける</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">豆。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 CDI </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"> <code>@Dependent</code> 는</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기본적으로 Bean에 대한 단일 EL 평가가있는 한 수명을 유지합니다. </font><font style="vertical-align: inherit;">빈 속성을 참조하는 두 개의 입력 필드와 빈 동작을 참조하는 명령 버튼이있는 총 3 개의 EL 표현식이있는 로그인 양식을 상상해보십시오. 그러면 실제로 3 개의 인스턴스가 만들어집니다. </font><font style="vertical-align: inherit;">하나는 사용자 이름이 설정되고 하나는 암호가 설정되고 다른 하나는 작업이 호출됩니다. </font><font style="vertical-align: inherit;">일반적으로이 범위는 주입되는 Bean만큼 지속되어야하는 Bean에서만 사용하려고합니다. </font><font style="vertical-align: inherit;">경우에 따라서 </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>@Dependent</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> A의 주입 </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 다음은만큼 살 것이다 </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 콩.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и CDI </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"> <code>@Dependent</code> в</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> основном живут столько же, сколько одна EL-оценка на бобе. Представьте себе форму входа в систему с двумя полями ввода, относящимися к свойству bean-компонента, и командную кнопку, указывающую на действие bean-компонента, то есть, в общей сложности, с тремя выражениями EL, тогда фактически будут созданы три экземпляра. Один с установленным именем пользователя, один с установленным паролем и один, для которого вызывается действие. Обычно вы хотите использовать эту область только для bean-компонентов, которые должны существовать столько, сколько bean-компонент, в который он вводится. Таким образом, если </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>@Dependent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внедряется в </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , он будет </font><font style="vertical-align: inherit;">существовать </font><font style="vertical-align: inherit;">столько же</font><font style="vertical-align: inherit;"> , сколько и </font><font style="vertical-align: inherit;">компонент </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只要在bean上进行一次EL评估，</font><font style="vertical-align: inherit;">JSF </font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和CDI </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/enterprise/context/Dependent.html"> <code>@Dependent</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上就可以存在。想象一下一个登录表单，其中有两个输入字段引用一个bean属性，一个命令按钮引用一个bean操作，因此总共有三个EL表达式，那么实际上将创建三个实例。一种设置了用户名，一种设置了密码，另一种调用了操作。通常，您只想在应与注入的bean一样长的bean上使用此作用域。因此，如果将</font></font> <code>@NoneScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>@Dependent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注入</font></font> <code>@SessionScoped</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则它将与</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean一样有效。</font></font>

source: The following legacy answer applies JSF version before 2.3
es: La siguiente respuesta de legado aplica la versión de JSF anterior a la 2.3
ja: 次のレガシーアンサーは、2.3以前のJSFバージョンを適用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 레거시 답변은 2.3 이전의 JSF 버전에 적용됩니다.</font></font>
ru: Следующий унаследованный ответ касается версии JSF до 2.3.
zh_cn: 下面的遗留答案适用于2.3之前的JSF版本。

source: This is actually not available as a managed bean scope, i.e. there's no such thing as <code>@FlashScoped</code>. The flash scope is only available as a map via <a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"><code>ExternalContext#getFlash()</code></a> in managed beans and <code>#{flash}</code> in EL.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En realidad, esto no est&aacute; disponible como un alcance de bean administrado, es decir, no existe tal cosa como </font></font> <code>@FlashScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">El alcance de flash solo est&aacute; disponible como un mapa a trav&eacute;s de </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"> <code>ExternalContext#getFlash()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en beans administrados y </font></font> <code>#{flash}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en EL.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは実際にはマネージドBeanスコープとして使用できません。つまり、</font></font> <code>@FlashScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などはありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">flashスコープは</font><font style="vertical-align: inherit;">、管理対象Beanの</font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"> <code>ExternalContext#getFlash()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font><font style="vertical-align: inherit;">ELの</font></font> <code>#{flash}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">介したマップとしてのみ使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 실제로 관리되는 Bean 범위로는 사용할 수 없습니다. 즉 </font></font> <code>@FlashScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같은 것은 없습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">플래시 범위는 </font><font style="vertical-align: inherit;">관리 Bean에서 </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"> <code>ExternalContext#getFlash()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font><font style="vertical-align: inherit;">EL에서 </font></font> <code>#{flash}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">통해 맵으로 만 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На самом деле это недоступно как управляемая область действия bean-компонента, т. </font></font> <code>@FlashScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Область действия Flash доступна только в виде карты через </font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"> <code>ExternalContext#getFlash()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в управляемых bean-компонентах и </font></font> <code>#{flash}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в EL.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上，这不能用作托管bean范围，即没有</font></font> <code>@FlashScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之类的东西</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">Flash范围仅可通过</font><font style="vertical-align: inherit;">托管Bean中的</font></font><a href="http://docs.oracle.com/javaee/7/api/javax/faces/context/ExternalContext.html#getFlash--"> <code>ExternalContext#getFlash()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font><font style="vertical-align: inherit;">EL中的</font></font> <code>#{flash}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为映射使用</font><font style="vertical-align: inherit;">。</font></font>

source: What is the default Managed Bean Scope in a JSF 2 application?
es: ¿Cuál es el Managed Bean Scope por defecto en una aplicación JSF 2?
ja: JSF 2アプリケーションのデフォルトのマネージドビーンスコープは何ですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF 2 애플리케이션의 기본 관리 Bean 범위는 무엇입니까?</font></font>
ru: Какой объем управляемой фасоли по умолчанию в приложении JSF 2?
zh_cn: JSF 2 应用程序中默认的 Managed Bean Scope 是什么?

source: What is the purpose of each? How do I choose a proper scope for my bean?
es: ¿Cuál es el propósito de cada uno? ¿Cómo elijo un ámbito apropiado para mi frijol?
ja: それぞれの目的は?マメに適切なスコープの選び方は?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각각의 목적은 무엇입니까? </font><font style="vertical-align: inherit;">내 콩에 적합한 범위를 어떻게 선택합니까?</font></font>
ru: Какова цель каждого из них? Как выбрать подходящий объем для моего боба?
zh_cn: 各有什么作用?如何选择一个合适的范围,为豆子选择合适的范围?

source: Which scope to choose depends solely on the data (the state) the bean holds and represents. Use <code>@RequestScoped</code> for simple and non-ajax forms/presentations. Use <code>@ViewScoped</code> for rich ajax-enabled dynamic views (ajaxbased validation, rendering, dialogs, etc). Use <code>@FlowScoped</code> for the "wizard" ("questionnaire") pattern of collecting input data spread over multiple pages. Use <code>@SessionScoped</code> for client specific data, such as the logged-in user and user preferences (language, etc). Use <code>@ApplicationScoped</code> for application wide data/constants, such as dropdown lists which are the same for everyone, or managed beans without any instance variables and having only methods.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El alcance a elegir depende &uacute;nicamente de los datos (el estado) que el bean contiene y representa. Use </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para formularios / presentaciones simples y no ajax. Utilice </font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font><font style="vertical-align: inherit;">obtener</font><font style="vertical-align: inherit;"> vistas din&aacute;micas ricas habilitadas para ajax (validaci&oacute;n basada en ajax, renderizado, di&aacute;logos, etc.). Utilice </font></font> <code>@FlowScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para el </font><font style="vertical-align: inherit;">patr&oacute;n</font><font style="vertical-align: inherit;"> "asistente" ("cuestionario") de recopilaci&oacute;n de datos de entrada distribuidos en varias p&aacute;ginas. Use </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para datos espec&iacute;ficos del cliente, como el usuario conectado y las preferencias del usuario (idioma, etc.). Utilice </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para datos / constantes de toda la aplicaci&oacute;n, como listas desplegables que son iguales para todos, o beans administrados sin ninguna variable de instancia y que solo tienen m&eacute;todos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どのスコープを選択するかは、Beanが保持および表すデータ（状態）にのみ依存します。</font><font style="vertical-align: inherit;">シンプルで非Ajaxのフォーム/プレゼンテーションには</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">豊富なajax対応の動的ビュー（ajaxベースの検証、レンダリング、ダイアログなど）には</font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。使用</font></font> <code>@FlowScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数ページにわたる入力データの広がりを収集する「ウィザード」（「アンケート」）のパターンについて。</font><font style="vertical-align: inherit;">ログインしたユーザーやユーザー設定（言語など）などのクライアント固有のデータには</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。使用</font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">な任意のインスタンス変数なしとメソッドのみを持つすべての人、または管理対象Beanの同じドロップダウンリストなどのアプリケーション全体のデータ/定数、ため。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선택할 범위는 Bean이 보유하고 나타내는 데이터 (상태)에만 의존합니다. </font><font style="vertical-align: inherit;">단순하지 않은 양식 및 프리젠 테이션에 </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">풍부한 </font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지원 동적 뷰 (ajax 기반 유효성 검사, 렌더링, 대화 상자 등) </font><font style="vertical-align: inherit;">에는 </font><font style="vertical-align: inherit;">@ViewScoped</font><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">여러 페이지에 분산 된 입력 데이터를 수집하는 "마법사"( "질문") 패턴에 </font></font> <code>@FlowScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">로그인 한 사용자 및 사용자 기본 설정 (언어 등)과 같은 클라이언트 특정 데이터에 </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">모든 사용자에게 동일한 드롭 다운 목록 또는 인스턴스 변수가없고 메소드 만있는 관리 Bean과 같은 애플리케이션 전체 데이터 / 상수에 </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Выбор области действия зависит исключительно от данных (состояния), которые содержит и представляет компонент. Используйте </font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для простых и не-AJAX форм / презентаций. Используйте </font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для расширенных динамических представлений с поддержкой ajax (проверка на основе ajax, рендеринг, диалоги и т. Д.). Используйте </font></font> <code>@FlowScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font><font style="vertical-align: inherit;">шаблона</font><font style="vertical-align: inherit;"> &laquo;мастера&raquo; (&laquo;вопросник&raquo;) сбора входных данных, распределенных по нескольким страницам. Используйте </font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для клиентских данных, таких как зарегистрированный пользователь и пользовательские настройки (язык и т. Д.). Используйте </font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для данных / констант всего приложения, таких как выпадающие списки, которые являются одинаковыми для всех, или управляемые компоненты без каких-либо переменных экземпляра и имеющие только методы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择哪个范围仅取决于bean持有和表示的数据（状态）。将</font></font> <code>@RequestScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于简单和非ajax表单/表示。使用</font></font> <code>@ViewScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以启用丰富的启用了ajax的动态视图（基于ajax的验证，渲染，对话框等）。将</font></font> <code>@FlowScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于收集多个页面上的输入数据的&ldquo;向导&rdquo;（&ldquo;问卷&rdquo;）模式。将</font></font> <code>@SessionScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于客户端特定的数据，例如登录的用户和用户首选项（语言等）。将</font></font> <code>@ApplicationScoped</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于应用程序范围的数据/常量，例如对于每个人都相同的下拉列表，或不带任何实例变量且仅具有方法的托管bean。</font></font>

source: what is none scope bean and when to use it?
es: ¿qué es un frijol no verde y cuándo usarlo?
ja: noneスコープビーンとは何ですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스코프 빈은 무엇이며 언제 사용해야합니까?</font></font>
ru: что такое бобы без прицела и когда его использовать?
zh_cn: 什么是无范围豆,何时使用?
