Repository: rueisnom/feedback
Catalog: xlf/16/60/12/4/1660124.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You can also use the <strong>dplyr</strong> package for that purpose:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n puede usar el </font><font style="vertical-align: inherit;">paquete </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ese prop&oacute;sito:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのために</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージを</font><font style="vertical-align: inherit;">使用することもでき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해당 용도로 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지를 </font><font style="vertical-align: inherit;">사용할 수도 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете использовать </font><font style="vertical-align: inherit;">пакет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для этой цели:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您也可以</font><font style="vertical-align: inherit;">为此</font><font style="vertical-align: inherit;">使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">软件包：</font></font>

source: You could use the function <code>group.sum</code> from <strong>package <em>Rfast</em></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar la funci&oacute;n </font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">paquete </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">パッケージ</font></strong><strong><em><font style="vertical-align: inherit;">Rfastの</font></em></strong><font style="vertical-align: inherit;">関数</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用できます</font><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em></strong><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 함수를 사용할 수 </font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패키지 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast을</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать функцию </font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">пакета </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用函数</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: or <code>tapply</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o </font></font> <code>tapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>tapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font> <code>tapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или </font></font> <code>tapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>tapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: to get:
es: para conseguir:
ja: を取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">얻을 :</font></font>
ru: чтобы получить:
zh_cn: 要得到。

source: using <code>cast</code> instead of <code>recast</code> (note <code>'Frequency'</code> is now <code>'value'</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">usando el </font></font> <code>cast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de la </font></font> <code>recast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (nota </font></font> <code>'Frequency'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ahora es </font></font> <code>'value'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"> <code>recast</code> <font style="vertical-align: inherit;">代わりに</font></font> <code>cast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">（</font> <code>'Frequency'</code> <font style="vertical-align: inherit;">は</font> <code>'value'</code> <font style="vertical-align: inherit;">）</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>cast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대신 </font></font> <code>recast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (주 </font></font> <code>'Frequency'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지금 </font></font> <code>'value'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">использование </font></font> <code>cast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>recast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (примечание </font></font> <code>'Frequency'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теперь </font></font> <code>'value'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>cast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>recast</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（请注意，</font></font> <code>'Frequency'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在为</font></font> <code>'value'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>

source: we want to group by <code>Categ1</code> and <code>Categ2</code> and compute the sum of <code>Samples</code> and mean of <code>Freq</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">queremos agrupar por </font></font> <code>Categ1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Categ2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y calcular la suma de las </font></font> <code>Samples</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y la media de la </font></font> <code>Freq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Categ1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>Categ2</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">グループ化し</font><font style="vertical-align: inherit;">、</font></font> <code>Samples</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の合計</font><font style="vertical-align: inherit;">と</font></font> <code>Freq</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">平均を</font><font style="vertical-align: inherit;">計算し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는에 의해 그룹화 할 </font></font> <code>Categ1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Categ2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과의 합계 계산 </font></font> <code>Samples</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그리고 의미 </font></font> <code>Freq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">мы хотим сгруппировать по </font></font> <code>Categ1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Categ2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вычислить сумму </font></font> <code>Samples</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и среднего значения </font></font> <code>Freq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们</font></font> <code>Categ1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Categ2</code> 分组,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并计算</font></font> <code>Samples</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和和</font></font> <code>Freq</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">平均值</font><font style="vertical-align: inherit;">。</font></font>
