Repository: rueisnom/feedback
Catalog: xlf/16/60/12/4/1660124.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (embedding @thelatemail comment), <code>aggregate</code> has a formula interface too
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(incrustando el comentario de @thelatemail), el </font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene una interfaz de f&oacute;rmula</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（@thelatemailコメントを埋め込む）、</font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にも数式インターフェースがあります</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(@thelatemail 주석 포함) </font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 수식 인터페이스도 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(вложение комментария @thelatemail), </font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет интерфейс формулы</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（嵌入@thelatemail评论），</font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也有一个公式界面</font></font>

source: <strong><em>Rfast</em></strong> has many group functions and <code>group.sum</code> is one of them.
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene muchas funciones de grupo y</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una de ellas.</font></font>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfastに</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は多くのグループ関数があり、</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はその1つです。</font></font>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 많은 그룹 기능이 있으며</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 그중 하나입니다.</font></font>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет много групповых функций, и</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является одной из них.</font></font>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rfast</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有许多组功能，而</font></font> <code>group.sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是其中之一。</font></font>

source: And if you want to keep the column this is the syntax:
es: Y si quieres mantener la columna,esta es la sintaxis:
ja: そして、カラムを保持したい場合は、次のような構文になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 열을 유지하려면 다음 구문을 사용하십시오.</font></font>
ru: И если вы хотите сохранить колонку,то это синтаксис:
zh_cn: 而如果你想保留这个栏目,这就是语法。

source: EDIT: this is a very old answer. Now I would recommend the use of <code>group_by</code> and <code>summarise</code> from <code>dplyr</code>, as in @docendo answer.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">EDITAR: esta es una respuesta muy antigua. </font><font style="vertical-align: inherit;">Ahora recomendar&iacute;a el uso de </font></font> <code>group_by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>summarise</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> desde </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , como en la respuesta @docendo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集：これは非常に古い答えです。</font><font style="vertical-align: inherit;">@docendoの回答のように、今度</font><font style="vertical-align: inherit;">は</font></font> <code>group_by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して</font> <code>dplyr</code> <font style="vertical-align: inherit;">から</font></font> <code>summarise</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">することをお勧めします</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : 이것은 매우 오래된 대답입니다. </font><font style="vertical-align: inherit;">이제 </font><font style="vertical-align: inherit;">@docendo answer </font><font style="vertical-align: inherit;">에서 </font><font style="vertical-align: inherit;">와 </font> <code>summarise</code> </font> <code>group_by</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하고 </font> <code>dplyr</code> <font style="vertical-align: inherit;"> 에서 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요약</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 것이 좋습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">РЕДАКТИРОВАТЬ: это очень старый ответ. </font><font style="vertical-align: inherit;">Теперь я бы порекомендовал использовать </font></font> <code>group_by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>summarise</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> от </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , как в ответе @docendo.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑：这是一个非常古老的答案。</font><font style="vertical-align: inherit;">现在，我建议使用</font></font> <code>group_by</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并</font><font style="vertical-align: inherit;">从</font> <code>dplyr</code> 进行</font> <code>summarise</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，如@docendo答案中所示。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For more information, including the <code>%&gt;%</code> operator, see the <a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html">introduction to dplyr</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para obtener m&aacute;s informaci&oacute;n, incluido el </font><font style="vertical-align: inherit;">operador </font></font> <code>%&gt;%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , consulte la </font></font><a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">introducci&oacute;n a dplyr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>%&gt;%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子</font><font style="vertical-align: inherit;">を含む</font><font style="vertical-align: inherit;">詳細については</font></font><a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、dplyrの概要を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照し</font><font style="vertical-align: inherit;">てください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>%&gt;%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자를 </font><font style="vertical-align: inherit;">포함한 자세한 정보 </font></font><a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는 dplyr 소개를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для получения дополнительной информации, включая </font><font style="vertical-align: inherit;">оператор </font></font> <code>%&gt;%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , см. </font></font><a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Введение к dplyr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关更多信息，包括</font></font> <code>%&gt;%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运算符，请参阅</font></font><a href="https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dplyr简介</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: For multiple aggregations, you can combine <code>lapply</code> and <code>.SD</code> as follows
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para m&uacute;ltiples agregaciones, puede combinar </font></font> <code>lapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>.SD</code> de la<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siguiente manera</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数の集約の場合</font><font style="vertical-align: inherit;">、次のように</font></font> <code>lapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>.SD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">組み合わせることができ</font><font style="vertical-align: inherit;">ます</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 집계를 들어, 결합 할 수 </font></font> <code>lapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>.SD</code> 은<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 같은 다음</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для нескольких агрегаций вы можете комбинировать </font></font> <code>lapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>.SD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> следующим образом</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于多个聚合，可以</font><font style="vertical-align: inherit;">如下</font><font style="vertical-align: inherit;">组合</font></font> <code>lapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>.SD</code> <font style="vertical-align: inherit;"></font>

source: Given this input :
es: Dada esta entrada:
ja: この入力が与えられると...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 입력이 주어지면 :</font></font>
ru: С учетом этого ввода :
zh_cn: 鉴于这一输入:

source: Here are some more examples of how to summarise data by group using dplyr functions using the built-in dataset <code>mtcars</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay algunos ejemplos m&aacute;s de c&oacute;mo resumir datos por grupo usando las funciones dplyr usando los </font></font> <code>mtcars</code> del<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> conjunto de datos </font><font style="vertical-align: inherit;">incorporado</font><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組み込みのデータセット</font></font> <code>mtcars</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してdplyr関数を使用し、グループごとにデータを要約する方法のいくつかの例を次に示します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 내장 데이터 세트 </font></font> <code>mtcars</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 dplyr 함수를 사용하여 그룹별로 데이터를 요약하는 방법에 대한 몇 가지 예입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот еще несколько примеров того, как суммировать данные по группам, используя функции dplyr, используя встроенный набор данных </font></font> <code>mtcars</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是一些更多示例，说明如何使用内置数据集</font></font> <code>mtcars</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用dplyr函数按组汇总数据</font><font style="vertical-align: inherit;">：</font></font>

source: Here is an example of how this question can be answered with <code>sqldf</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo de c&oacute;mo se puede responder esta pregunta con </font></font> <code>sqldf</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、</font> <code>sqldf</code> を使用して<font style="vertical-align: inherit;">この質問に回答する方法の例です</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 </font> <code>sqldf</code> <font style="vertical-align: inherit;"> 로이 질문에 어떻게 대답 할 수 있는지에 대한 예입니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример того, как на этот вопрос можно ответить с помощью </font></font> <code>sqldf</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是如何使用</font> <code>sqldf</code> <font style="vertical-align: inherit;">回答此问题的示例</font></font><font style="vertical-align: inherit;"></font>

source: Here's a possible solution using <code>ave</code> :
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay una posible soluci&oacute;n usando </font></font> <code>ave</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ave</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用した解決策は</font><font style="vertical-align: inherit;">次のとおりです。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ave</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 가능한 솔루션은 다음과 같습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот возможное решение с использованием </font></font> <code>ave</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是使用</font></font> <code>ave</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的可能解决方案</font><font style="vertical-align: inherit;">：</font></font>

source: How to sum a variable by group
es: Cómo sumar una variable por grupo
ja: 変数をグループで合計する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그룹별로 변수를 합산하는 방법</font></font>
ru: Как просуммировать переменную по группам
zh_cn: 如何按组求和

source: How would I do this in R?
es: ¿Cómo haría esto en R?
ja: これをRでやるにはどうすればいいのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">R에서 어떻게해야합니까?</font></font>
ru: Как бы я сделал это в Р?
zh_cn: 我在R中该怎么做?

source: I find <a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"><code>ave</code></a> very helpful (and efficient) when you need to apply different aggregation functions on different columns (and you must/want to stick on base R) :
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Encuentro </font></font><a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"> <code>ave</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> muy &uacute;tiles (y eficiente) cuando es necesario aplicar diferentes funciones de agregaci&oacute;n en diferentes columnas (y debe / quiere meter en la base R):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が見つけ</font></font><a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"> <code>ave</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは（あなたが/ベース・Rに固執したくなければなりません）別の列に異なる集計関数を適用する必要がある場合に非常に有用（かつ効率的）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 찾을 </font></font><a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"> <code>ave</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 (당신은 / 기본 R에 충실하고자합니다) 다른 열을 다른 집계 함수를 적용 할 필요가있을 때 매우 도움 (효율적인) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я считаю , </font></font><a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"> <code>ave</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> очень полезно (и эффективно) , </font><font style="vertical-align: inherit;">когда вам необходимо применять различные функции агрегации на разных колонках (и вы должны / хотите придерживаться на базе R):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当您需要在不同的列上应用不同的聚合函数（并且您必须/想要坚持以R为基础）时，</font><font style="vertical-align: inherit;">我发现</font></font><a href="https://stat.ethz.ch/R-manual/R-patched/library/stats/html/ave.html"> <code>ave</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常有用（高效）：</font></font>

source: I want to sort the data by Category and sum the Frequencies:
es: Quiero ordenar los datos por categoría y sumar las frecuencias:
ja: カテゴリー別に並べ替えて、頻度を合計したい。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">범주별로 데이터를 정렬하고 빈도를 합치고 싶습니다.</font></font>
ru: Я хочу отсортировать данные по категориям и просуммировать частоты:
zh_cn: 我想把数据按类别进行排序,并把频率总和。

source: If <code>x</code> is a dataframe with your data, then the following will do what you want:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un marco de datos con sus datos, lo siguiente har&aacute; lo que desee:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がデータを含むデータフレームである</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、以下はあなたが望むことをします：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 데이터가 포함 된 데이터 프레임 인 </font><font style="vertical-align: inherit;">경우 </font><font style="vertical-align: inherit;">다음이 원하는 작업을 수행합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это фрейм данных с вашими данными, то следующее будет делать то, что вы хотите:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是包含数据的数据框，则将执行以下操作：</font></font>
