Repository: rueisnom/feedback
Catalog: xlf/16/60/12/4/1660124.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In the example above, multiple dimensions can be specified in the <code>list</code>. Multiple aggregated metrics of the same data type can be incorporated via <code>cbind</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el ejemplo anterior, se pueden especificar varias dimensiones en la </font></font> <code>list</code> a<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Se pueden incorporar m&uacute;ltiples m&eacute;tricas agregadas del mismo tipo de datos a trav&eacute;s de </font></font> <code>cbind</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の例では、</font></font> <code>list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に複数のディメンションを指定できます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">同じデータ型の複数の集約メトリックは、</font></font> <code>cbind</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を介して組み込むことができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 예에서 </font></font> <code>list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 여러 차원을 지정할 수 있습니다 </font><font style="vertical-align: inherit;">. </font></font> <code>cbind</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 통해 동일한 데이터 유형의 여러 집계 메트릭을 통합 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В приведенном выше примере в </font></font> <code>list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно указать несколько измерений </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Несколько агрегированных метрик одного и того же типа данных могут быть включены через </font></font> <code>cbind</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在上面的示例中，可以在</font></font> <code>list</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指定多个尺寸</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">可以通过</font></font> <code>cbind</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">合并同一数据类型的多个聚合指标</font><font style="vertical-align: inherit;">：</font></font>

source: Just to add a third option:
es: Sólo para añadir una tercera opción:
ja: 第三の選択肢を追加するだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세 번째 옵션을 추가하려면 다음을 수행하십시오.</font></font>
ru: Просто чтобы добавить третий вариант:
zh_cn: 只是为了增加第三个选项。

source: Let's compare that to the same thing using data.frame and the above above:
es: Comparemos eso con lo mismo usando data.frame y lo de arriba:
ja: それをdata.frameを使って同じことをしているのと、上記のように比較してみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">data.frame과 위의 내용을 사용하여 동일한 내용과 비교해 보겠습니다.</font></font>
ru: Давайте сравним это с тем же,что и при использовании data.frame и выше:
zh_cn: 让我们用data.frame和上面的data.frame和上面的比较一下。

source: Let's say I have two columns of data. The first contains categories such as "First", "Second", "Third", etc. The second has numbers which represent the number of times I saw "First".
es: Digamos que tengo dos columnas de datos.La primera contiene categorías como "Primera","Segunda","Tercera",etc.La segunda tiene números que representan el número de veces que vi "Primera".
ja: 2つの列のデータがあるとします。1つ目は「ファースト」「セカンド」「サード」などのカテゴリが入っています。2つ目は「ファースト」を見た回数を表す数字が入っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 개의 데이터 열이 있다고 가정 해 봅시다. </font><font style="vertical-align: inherit;">첫 번째는 "First", "Second", "Third"등과 같은 범주를 포함합니다. 두 번째에는 "First"를 본 횟수를 나타내는 숫자가 있습니다.</font></font>
ru: Допустим,у меня есть две колонки данных.Первый содержит такие категории,как "Первый","Второй","Третий" и др.Во втором есть числа,которые представляют собой количество раз,которое я видел "Первый".
zh_cn: 假设我有两列数据。第一列有 "第一次"、"第二次"、"第三次 "等类别。第二列有数字,代表我看到 "第一 "的次数。

source: Or if you want a <code>data.frame</code> back
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O si desea un </font></font> <code>data.frame</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font> <code>data.frame</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元に戻し</font><font style="vertical-align: inherit;">たい場合</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font> <code>data.frame</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다시 </font><font style="vertical-align: inherit;">원한다면</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или, если вы хотите </font><font style="vertical-align: inherit;">вернуть </font></font> <code>data.frame</code> <font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者如果您想</font><font style="vertical-align: inherit;">返回</font><font style="vertical-align: inherit;">一个</font></font> <code>data.frame</code> <font style="vertical-align: inherit;"></font>

source: Or if you want to aggregate multiple columns, you could use the <code>.</code> notation (works for one column too)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O si desea agregar varias columnas, puede usar el </font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">notaci&oacute;n (tambi&eacute;n funciona para una columna)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、複数の列を集計する場合は、を使用できます</font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表記法（1列でも機能）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 여러 열을 집계하려는 경우을 사용할 수 있습니다 </font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표기법 (하나의 열에도 적용됨)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или, если вы хотите объединить несколько столбцов, вы можете использовать </font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обозначение (работает для одного столбца тоже)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，如果您想汇总多个列，则可以使用</font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示法（也适用于一列）</font></font>

source: Or, for <strong>multiple summary columns</strong> (works with one column too):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O, para </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">varias columnas de resumen</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (tambi&eacute;n funciona con una columna):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数の集計列の場合</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（1列でも機能します）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 요약 열의 경우</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (하나의 열과 함께 작동) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или, для </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нескольких сводных столбцов</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (работает также с одним столбцом):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，对于</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多个摘要列</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（也适用于一列）：</font></font>

source: Result :
es: Resultado :
ja: 結果 .
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과 :</font></font>
ru: Результат :
zh_cn: 结果:

source: Several years later, just to add another simple base R solution that isn't present here for some reason- <code>xtabs</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Varios a&ntilde;os m&aacute;s tarde, s&oacute;lo para a&ntilde;adir otra soluci&oacute;n base de R sencilla que no est&aacute; presente aqu&iacute; por algunos razonable </font></font> <code>xtabs</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数年後、何らかの</font> <code>xtabs</code> <font style="vertical-align: inherit;">ここに存在しない単純なベースRソリューションを追加するだけ</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です-xtabs</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 년 후 여기에 존재하지 않는 또 다른 간단한 기본 R 솔루션을 추가하기 위해 </font></font> <code>xtabs</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Несколько лет спустя, просто чтобы добавить еще одно простое решение base R, которого здесь по некоторым </font></font> <code>xtabs</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">几年后，只是添加了出于某种</font> <code>xtabs</code> <font style="vertical-align: inherit;">在此不存在的另一个简单的基础R解决方案</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-xtabs</font></font>

source: The answer provided by rcs works and is simple. However, if you are handling larger datasets and need a performance boost there is a faster alternative:
es: La respuesta proporcionada por RCS funciona y es simple.Sin embargo,si usted está manejando conjuntos de datos más grandes y necesita un aumento de rendimiento hay una alternativa más rápida:
ja: rcsが提供する答えは機能し、シンプルです。しかし、より大きなデータセットを扱い、パフォーマンスを向上させる必要がある場合は、より高速な代替手段があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rcs가 제공하는 대답은 간단하며 간단합니다. </font><font style="vertical-align: inherit;">그러나 더 큰 데이터 세트를 처리하고 성능 향상이 필요한 경우 더 빠른 대안이 있습니다.</font></font>
ru: Ответ,предоставленный rcs,работает и прост.Однако,если вы работаете с большими наборами данных и вам нужен прирост производительности,то есть более быстрая альтернатива:
zh_cn: rcs提供的答案是有效的,而且很简单。然而,如果你要处理较大的数据集,需要性能提升,有一个更快的选择。

source: The difference will become more noticeable with larger datasets, as the code below demonstrates:
es: La diferencia se hará más notable con conjuntos de datos más grandes,como demuestra el siguiente código:
ja: この違いは、以下のコードが示すように、より大きなデータセットではより顕著になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 코드에서 알 수 있듯이 더 큰 데이터 세트에서는 차이가 더 두드러집니다.</font></font>
ru: Разница станет более заметной при использовании больших наборов данных,как показывает код,приведенный ниже:
zh_cn: 正如下面的代码所显示的那样,随着数据集的增大,差异会变得更加明显。

source: The recently added <code>dplyr::tally()</code> now makes this easier than ever:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El recientemente agregado </font></font> <code>dplyr::tally()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ahora hace esto m&aacute;s f&aacute;cil que nunca:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近追加された</font></font> <code>dplyr::tally()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、これをこれまでになく簡単にします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최근에 추가 된 </font></font> <code>dplyr::tally()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이제 그 어느 때보 다 쉬워졌습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недавно добавленный </font></font> <code>dplyr::tally()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теперь делает это проще, чем когда-либо:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近添加的</font></font> <code>dplyr::tally()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在使此操作比以往更加轻松：</font></font>

source: This is somewhat <a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split">related to this question</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto est&aacute; algo </font></font><a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">relacionado con esta pregunta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font></font><a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この質問に</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いくらか</font><font style="vertical-align: inherit;">関連しています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font></font><a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 질문과</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다소 </font><font style="vertical-align: inherit;">관련이</font><font style="vertical-align: inherit;"> 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это несколько </font></font><a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">связано с этим вопросом</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这</font></font><a href="https://stackoverflow.com/questions/1407449/for-each-group-summarise-means-for-all-variables-in-dataframe-ddply-split"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与这个问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有些</font><font style="vertical-align: inherit;">相关</font><font style="vertical-align: inherit;">。</font></font>

source: Those other packages (plyr, reshape) have the benefit of returning a data.frame, but it's worth being familiar with by() since it's a base function.
es: Esos otros paquetes (plyr,reshape)tienen el beneficio de devolver un data.frame,pero vale la pena familiarizarse con by()ya que es una función base.
ja: 他のパッケージ (plyr,reshape)には data.frame を返すという利点がありますが、基本関数なので by()に慣れる価値はあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 패키지 (plyr, reshape)는 data.frame을 반환하는 이점이 있지만 기본 함수이기 때문에 by ()에 익숙 할 가치가 있습니다.</font></font>
ru: Эти другие пакеты (plyr,reshape)имеют преимущество возврата data.frame,но с ними стоит познакомиться с помощью функции by(),так как это базовая функция.
zh_cn: 其他的那些包(plyr、reshape)有返回data.frame的好处,但值得熟悉的是by(),因为它是一个基础函数。

source: Using <code>aggregate</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя </font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>aggregate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Using this data:
es: Usando estos datos:
ja: このデータを使って
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 데이터를 사용하여 :</font></font>
ru: Используя эти данные:
zh_cn: 利用这些数据:

source: While I have recently become a convert to <code>dplyr</code> for most of these types of operations, the <code>sqldf</code> package is still really nice (and IMHO more readable) for some things.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si bien recientemente me convert&iacute; en un convertidor a </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la mayor&iacute;a de estos tipos de operaciones, el </font><font style="vertical-align: inherit;">paquete </font></font> <code>sqldf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sigue siendo realmente bueno (y en mi humilde opini&oacute;n, m&aacute;s legible) para algunas cosas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は最近</font><font style="vertical-align: inherit;">、これらのタイプの操作のほとんど</font><font style="vertical-align: inherit;">を</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">変換してい</font><font style="vertical-align: inherit;">ますが</font><font style="vertical-align: inherit;">、</font></font> <code>sqldf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージは、いくつかの点でまだ非常に優れています（そして</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">IMHOの</font><font style="vertical-align: inherit;">方が読みやすくなっています）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최근 </font><font style="vertical-align: inherit;">에 이러한 유형의 대부분의 작업에서 </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 변환 </font></font> <code>sqldf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지는 여전히 </font><font style="vertical-align: inherit;">일부로</font><font style="vertical-align: inherit;"> 훌륭합니다 (그리고 IMHO 더 읽기 </font><font style="vertical-align: inherit;">쉽습니다</font><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя недавно я стал преобразовывать в </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для большинства операций такого типа, </font><font style="vertical-align: inherit;">пакет </font></font> <code>sqldf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по-прежнему очень хорош (и IMHO более читабелен) для некоторых вещей.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尽管最近我已经可以</font><font style="vertical-align: inherit;">对大多数这些类型的操作</font><font style="vertical-align: inherit;">进行</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转换</font><font style="vertical-align: inherit;">，但是</font></font> <code>sqldf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">软件包</font><font style="vertical-align: inherit;">在</font><font style="vertical-align: inherit;">某些</font><font style="vertical-align: inherit;">方面仍然非常好（恕我直言，更具可读性）。</font></font>

source: You can also just use the <b>by()</b> function:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n puede usar la funci&oacute;n </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">by ()</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">by（）</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数を</font><font style="vertical-align: inherit;">使用することもでき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">by ()</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수를 </font><font style="vertical-align: inherit;">사용할 수도 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете просто использовать </font><font style="vertical-align: inherit;">функцию </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">by ()</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您也可以只使用</font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">by（）</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数：</font></font>
