Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: It is done using <a href="http://www.techotopia.com/index.php/The_Ruby_case_Statement"><code>case</code></a> in Ruby. Also see "<a href="http://en.wikipedia.org/wiki/Switch_statement#Ruby">Switch statement</a>" on Wikipedia.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se hace usando el </font></font><a href="http://www.techotopia.com/index.php/The_Ruby_case_Statement"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en Ruby. </font><font style="vertical-align: inherit;">Consulte tambi&eacute;n " </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Ruby"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Declaraci&oacute;n de cambio</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " en Wikipedia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby </font><font style="vertical-align: inherit;">では</font></font><a href="http://www.techotopia.com/index.php/The_Ruby_case_Statement"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して行われ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">Wikipediaの</font><font style="vertical-align: inherit;">「</font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Ruby"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Switchステートメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">も参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby에서 </font></font><a href="http://www.techotopia.com/index.php/The_Ruby_case_Statement"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 수행됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Wikipedia의 </font><font style="vertical-align: inherit;">" </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Ruby"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스위치 설명</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " </font><font style="vertical-align: inherit;">도 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это делается с использованием </font></font><a href="http://www.techotopia.com/index.php/The_Ruby_case_Statement"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Ruby. </font><font style="vertical-align: inherit;">Также см. &laquo; </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Ruby"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смена оператора</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; в Википедии.</font></font>

source: It's called <code>case</code> and it works like you would expect, plus lots more fun stuff courtesy of <code>===</code> which implements the tests.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se llama </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y funciona como era de esperar, adem&aacute;s de muchas cosas m&aacute;s divertidas cortes&iacute;a de </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que implementa las pruebas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">呼ばれ</font><font style="vertical-align: inherit;">、期待どおりに機能します。さらに</font><font style="vertical-align: inherit;">、テストを実装する</font></font> <code>===</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おかげで、もっと楽しいことがたくさん</font><font style="vertical-align: inherit;">あります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라고 불리며 </font><font style="vertical-align: inherit;">예상 한대로 작동 </font><font style="vertical-align: inherit;">하며 테스트를 구현하는 </font></font> <code>===</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 더 재미있는 것들이 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он называется </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и работает так, как вы и ожидали, плюс еще много забавных вещей благодаря </font></font> <code>===</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который реализует тесты.</font></font>

source: It's critical to emphasize the comma (<code>,</code>) in a <code>when</code> clause. It acts as an <code>||</code> of an <code>if</code> statement, that is, it does an <em>OR</em> comparison and not an <em>AND</em> comparison between the delimited expressions of the <code>when</code> clause. See the following case statement:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es cr&iacute;tico enfatizar la coma ( </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) en una </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Act&uacute;a como un </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de una </font><font style="vertical-align: inherit;">declaraci&oacute;n </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es decir, hace una </font><font style="vertical-align: inherit;">comparaci&oacute;n </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OR</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y no una </font><font style="vertical-align: inherit;">comparaci&oacute;n </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> entre las expresiones delimitadas de la </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Vea la siguiente declaraci&oacute;n de caso:</font></font>
ja: <font style="vertical-align: inherit;"> <code>when</code> <font style="vertical-align: inherit;">節</font><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">は、コンマ（</font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">を強調することが重要</font><font style="vertical-align: inherit;">です。</font> <code>||</code> <font style="vertical-align: inherit;">として機能します </font> <code>if</code> <font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、つまり、それは</font><em><font style="vertical-align: inherit;">OR</font></em><font style="vertical-align: inherit;">比較</font><font style="vertical-align: inherit;">を実行し、</font> <code>when</code> <font style="vertical-align: inherit;">節の</font><font style="vertical-align: inherit;">区切られた式間の</font><em><font style="vertical-align: inherit;">AND</font></em><font style="vertical-align: inherit;">比較は実行し</font><font style="vertical-align: inherit;">ません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">次のcaseステートメントを参照してください。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>when</code> <font style="vertical-align: inherit;"> 절 </font><font style="vertical-align: inherit;">에서 </font><font style="vertical-align: inherit;">쉼표 ( </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">를 강조하는 것이 중요합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것은 </font> <code>||</code> <font style="vertical-align: inherit;">의 </font> <code>if</code> <font style="vertical-align: inherit;"> 문입니다, 그것은하지 </font><em><font style="vertical-align: inherit;">OR</font></em><font style="vertical-align: inherit;"> 비교 아닌 </font><em><font style="vertical-align: inherit;">AND</font></em><font style="vertical-align: inherit;"> 의 구분 된 표현의 비교 </font> <code>when</code> <font style="vertical-align: inherit;"> 절을. </font><font style="vertical-align: inherit;">다음 사례 진술을 참조하십시오.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Важно подчеркнуть запятую ( </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) в предложении </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он действует как </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оператора </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то есть он выполняет </font><font style="vertical-align: inherit;">сравнение </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ИЛИ,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а не </font><font style="vertical-align: inherit;">сравнение </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> между выражениями с разделителями в </font><font style="vertical-align: inherit;">предложении </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Смотрите следующее описание случая:</font></font>

source: Lots of great answers but I thought I would add one factoid.. If you are attempting to compare objects (Classes) make sure you have a space ship method (not a joke) or understand how they are being compared
es: Muchas respuestas geniales,pero pensé en añadir un dato...Si estás intentando comparar objetos (Clases)asegúrate de tener un método de nave espacial (no una broma)o entender cómo se están comparando
ja: 多くの素晴らしい回答がありますが、私は一つの事実を追加しようと思いました。オブジェクト(クラス)を比較しようとしている場合は、宇宙船メソッド(冗談ではありません)を使用していることを確認するか、どのように比較されているかを理解してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 훌륭한 답변을 얻었지만 하나의 사실을 추가 할 것이라고 생각했습니다. 객체 (클래스)를 비교하려는 경우 우주선 방법 (농담 아님)이 있거나 비교 방법을 이해해야합니다.</font></font>
ru: Много отличных ответов,но я подумал,что добавлю один факт...Если вы пытаетесь сравнить объекты (Классы),убедитесь,что у вас есть метод космического корабля (не шутка)или поймите,как они сравниваются.

source: Many of Ruby's built-in classes, such as String, Range, and Regexp, provide their own implementations of the <code>===</code> operator, also known as "case-equality", "triple equals" or "threequals". Because it's implemented differently in each class, it will behave differently depending on the type of object it was called on. Generally, it returns true if the object on the right "belongs to" or "is a member of" the object on the left. For instance, it can be used to test if an object is an instance of a class (or one of its sub-classes).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Muchas de las clases integradas de Ruby, como String, Range y Regexp, proporcionan sus propias implementaciones del </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , tambi&eacute;n conocido como "igualdad de casos", "triple igual" o "tres iguales". </font><font style="vertical-align: inherit;">Debido a que se implementa de manera diferente en cada clase, se comportar&aacute; de manera diferente seg&uacute;n el tipo de objeto al que se llam&oacute;. </font><font style="vertical-align: inherit;">En general, devuelve verdadero si el objeto de la derecha "pertenece" o "es miembro del" objeto de la izquierda. </font><font style="vertical-align: inherit;">Por ejemplo, se puede usar para probar si un objeto es una instancia de una clase (o una de sus subclases).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String、Range、RegexpなどのRubyの組み込みクラスの多くは、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子の</font><font style="vertical-align: inherit;">独自の実装を提供します。これは、</font><font style="vertical-align: inherit;">「case-equality」、「triple equals」、「threequals」とも呼ばれます。</font><font style="vertical-align: inherit;">クラスごとに実装が異なるため、呼び出されたオブジェクトのタイプによって動作が異なります。</font><font style="vertical-align: inherit;">通常、右側のオブジェクトが左側のオブジェクトに「属している」または「のメンバーである」場合、trueを返します。</font><font style="vertical-align: inherit;">たとえば、オブジェクトがクラス（またはそのサブクラスの1つ）のインスタンスであるかどうかをテストするために使用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">String, Range 및 Regexp와 같은 많은 Ruby 내장 클래스 </font><font style="vertical-align: inherit;">는 "case-equality", "triple equals"또는 "threequals"라고도 </font><font style="vertical-align: inherit;">하는 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자 </font><font style="vertical-align: inherit;">의 자체 구현을 제공합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">각 클래스에서 다르게 구현되므로 호출 한 객체의 유형에 따라 다르게 동작합니다. </font><font style="vertical-align: inherit;">일반적으로 오른쪽에있는 개체가 왼쪽에있는 개체의 "포함"또는 "구성원"이면 true를 반환합니다. </font><font style="vertical-align: inherit;">예를 들어, 객체가 클래스 (또는 그 서브 클래스 중 하나)의 인스턴스인지 테스트하는 데 사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Многие из встроенных в Ruby классов, такие как String, Range и Regexp, предоставляют свои собственные реализации </font><font style="vertical-align: inherit;">оператора </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , также известного как &laquo;case-равенства&raquo;, &laquo;тройное равенство&raquo; или &laquo;тройное равенство&raquo;. </font><font style="vertical-align: inherit;">Поскольку он реализован по-разному в каждом классе, он будет вести себя по-разному в зависимости от типа объекта, к которому он был вызван. </font><font style="vertical-align: inherit;">Как правило, он возвращает true, если объект справа &laquo;принадлежит&raquo; или &laquo;является членом&raquo; объекта слева. </font><font style="vertical-align: inherit;">Например, его можно использовать для проверки, является ли объект экземпляром класса (или одного из его подклассов).</font></font>

source: Many programming languages, especially those derived from C, have support for the so-called <a href="http://en.wikipedia.org/wiki/Switch_statement#Fallthrough">Switch Fallthrough</a>. I was searching for the best way to do the same in Ruby and thought it might be useful to others:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Muchos lenguajes de programaci&oacute;n, especialmente los derivados de C, tienen soporte para el llamado </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Switch Fallthrough</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Estaba buscando la mejor manera de hacer lo mismo en Ruby y pens&eacute; que podr&iacute;a ser &uacute;til para otros:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くのプログラミング言語、特にCから派生したものは、いわゆる</font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Switch Fallthrough</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をサポートしてい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">私はRubyで同じことをする最良の方法を探していて、それが他の人に役立つかもしれないと思った：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 프로그래밍 언어, 특히 C에서 파생 된 프로그래밍 언어는 소위 </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스위치 폴 스루를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지원합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">루비에서 똑같이하는 가장 좋은 방법을 찾고 있었고 다른 사람들에게 유용 할 것이라고 생각했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Многие языки программирования, особенно те, что получены из C, поддерживают так называемый </font></font><a href="http://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Switch Fallthrough</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Я искал лучший способ сделать то же самое в Ruby и подумал, что это может быть полезно для других:</font></font>

source: Multi-value when and no-value case:
es: Caso de multi-valor cuando y sin valor:
ja: 多値の場合と無値の場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가치없는 경우와 가치없는 경우 :</font></font>
ru: Многозначный случай "когда" и "нет":

source: No support for regular expressions in your environment? E.g. <a href="https://help.shopify.com/manual/apps/apps-by-shopify/script-editor/limitations#regular-expressions"><strong>Shopify</strong> Script Editor</a> (April, 2018):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;No hay soporte para expresiones regulares en su entorno? </font><font style="vertical-align: inherit;">Por ejemplo, </font></font><a href="https://help.shopify.com/manual/apps/apps-by-shopify/script-editor/limitations#regular-expressions"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Shopify</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Script Editor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (abril de 2018):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご使用の環境では正規表現はサポートされていませんか？</font><font style="vertical-align: inherit;">例：</font></font><a href="https://help.shopify.com/manual/apps/apps-by-shopify/script-editor/limitations#regular-expressions"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Shopify</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スクリプトエディター</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2018年4月）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">환경에서 정규 표현식을 지원하지 않습니까? </font><font style="vertical-align: inherit;">예 : </font></font><a href="https://help.shopify.com/manual/apps/apps-by-shopify/script-editor/limitations#regular-expressions"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Shopify</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Script Editor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (2018 년 4 월) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нет поддержки регулярных выражений в вашей среде? </font><font style="vertical-align: inherit;">Например, </font><a href="https://help.shopify.com/manual/apps/apps-by-shopify/script-editor/limitations#regular-expressions"><font style="vertical-align: inherit;">редактор сценариев </font></a></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Shopify</font></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (апрель 2018 г.):</font></font>

source: Now for some fun:
es: Ahora para divertirse un poco:
ja: さて、お楽しみの時間だ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 약간의 재미를 위해 :</font></font>
ru: А теперь повеселимся:
