Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: This is not strictly equivalent, because it's not possible to let <code>'a'</code> execute a block of code before falling through to <code>'b'</code> or <code>'c'</code>, but for the most part I find it similar enough to be useful in the same way.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto no es estrictamente equivalente, porque no es posible dejar que </font></font> <code>'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ejecute un bloque de c&oacute;digo antes de pasar a </font></font> <code>'b'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>'c'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero en su mayor parte lo encuentro lo suficientemente similar como para ser &uacute;til de la misma manera.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは厳密には同等ではありません。</font></font> <code>'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にコードブロックを実行</font><font style="vertical-align: inherit;">させ</font><font style="vertical-align: inherit;">てから</font></font> <code>'b'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>'c'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に進むことはできないためですが、ほとんどの場合、同じように使用できるほど十分に似ています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 수 있도록하는 것은 불가능하기 때문에, 엄격하게 일치하지 않는 </font></font> <code>'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 통해 떨어지는 전에 코드 블록을 실행 </font></font> <code>'b'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>'c'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,하지만 대부분의 경우 나는 그것을 같은 방식으로 유용 유사한 충분히 찾을 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не является строго эквивалентным, потому что невозможно позволить </font></font> <code>'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выполнить блок кода, прежде чем перейти к </font></font> <code>'b'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>'c'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но по большей части я нахожу его достаточно похожим, чтобы быть полезным таким же образом.</font></font>

source: This is the syntax of <code>case...when</code> in Ruby:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta es la sintaxis del </font></font> <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en Ruby:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font></font> <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">小文字</font><font style="vertical-align: inherit;">の構文です</font><font style="vertical-align: inherit;">...</font><font style="vertical-align: inherit;"> Rubyの</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비에서 다음 </font><font style="vertical-align: inherit;">과 같은 </font></font> <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 구문입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это синтаксис </font></font> <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Ruby:</font></font>

source: This is the syntax of <code>switch...case</code> in C:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta es la sintaxis de </font></font> <code>switch...case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en C:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、</font><font style="vertical-align: inherit;">C </font><font style="vertical-align: inherit;">での</font></font> <code>switch...case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構文です</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">C </font><font style="vertical-align: inherit;">의 </font></font> <code>switch...case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구문입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это синтаксис </font></font> <code>switch...case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в C:</font></font>

source: This means that if you want to do a <code>case ... when</code> over an object's class, this will not work:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto significa que si quieres hacer un </font></font> <code>case ... when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> superes la clase de un objeto, esto no funcionar&aacute;:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、</font></font> <code>case ... when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行したい</font><font style="vertical-align: inherit;">場合...</font><font style="vertical-align: inherit;">オブジェクトのクラスを超え</font><font style="vertical-align: inherit;">た</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、これは機能しません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">객체의 클래스를 넘을 </font></font> <code>case ... when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 원한다면 </font><font style="vertical-align: inherit;">작동하지 않는다는 것을 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это означает, что если вы хотите сделать </font></font> <code>case ... when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> над классом объекта, это не будет работать:</font></font>

source: To add more examples to <a href="https://stackoverflow.com/a/948157/471214">Chuck's answer</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para agregar m&aacute;s ejemplos a </font></font><a href="https://stackoverflow.com/a/948157/471214"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la respuesta de Chuck</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/948157/471214"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チャックの答えに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さらに例を追加するには</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/948157/471214"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">척의 답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 더 많은 예제를 추가하려면 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы добавить больше примеров к </font></font><a href="https://stackoverflow.com/a/948157/471214"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответу Чака</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: To do an <code>&amp;&amp;</code> comparison, you will have to treat <code>case</code> like an <code>if</code>/<code>else</code> block:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para hacer una </font><font style="vertical-align: inherit;">comparaci&oacute;n </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , deber&aacute; tratar el </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como un </font><font style="vertical-align: inherit;">bloque </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比較</font><font style="vertical-align: inherit;">を行うには、</font></font> <code>case</code> <font style="vertical-align: inherit;"></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブロックの</font><font style="vertical-align: inherit;">よう</font><font style="vertical-align: inherit;">に扱う必要があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 비교 </font><font style="vertical-align: inherit;">를 수행하려면 </font> <code>if</code> <font style="vertical-align: inherit;"> / </font> <code>else</code> <font style="vertical-align: inherit;"> 블록 </font><font style="vertical-align: inherit;">처럼 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 처리해야합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы выполнить </font><font style="vertical-align: inherit;">сравнение </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вам нужно обработать </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как блок </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Unlike <code>switch</code> statements in many other languages, Ruby&rsquo;s <code>case</code> does not have <a href="https://en.wikipedia.org/wiki/Switch_statement#Fallthrough">fall-through</a>, so there is no need to end each <code>when</code> with a <code>break</code>. You can also specify multiple matches in a single <code>when</code> clause like <code>when "foo", "bar"</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A diferencia de </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> declaraciones en muchos otros idiomas, Ruby </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no tiene </font></font><a href="https://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ca&iacute;da a trav&eacute;s de</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que no hay necesidad de poner fin a cada uno </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con una </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Tambi&eacute;n puede especificar varios partidos en una sola </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la cl&aacute;usula como </font></font> <code>when "foo", "bar"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">異なり、</font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の多くの言語でのステートメント、Rubyの</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">持っていない</font></font><a href="https://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フォールスルー</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、それぞれを終了する必要はありません、</font><font style="vertical-align: inherit;">と</font> <code>break</code> <font style="vertical-align: inherit;">。</font> <code>when "foo", "bar"</code> <font style="vertical-align: inherit;">ような</font><font style="vertical-align: inherit;">単一の</font> <code>when</code> <font style="vertical-align: inherit;">節</font><font style="vertical-align: inherit;">で複数の一致を指定することもできます</font><font style="vertical-align: inherit;">。</font></font> <code>when</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">달리 </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 많은 다른 언어 문, 루비의 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 없는 </font></font><a href="https://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추락을 통해</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 각각의를 종료 할 필요가 없습니다, </font><font style="vertical-align: inherit;">와 </font> <code>break</code> <font style="vertical-align: inherit;"> . </font> <code>when "foo", "bar"</code> <font style="vertical-align: inherit;"> 와 같은 </font><font style="vertical-align: inherit;">단일 </font> <code>when</code> <font style="vertical-align: inherit;"> 절 </font><font style="vertical-align: inherit;">에 여러 개의 일치 항목을 지정할 수도 있습니다 </font><font style="vertical-align: inherit;">.</font></font> <code>when</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В отличии от </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заявлений во многих других языках, в </font><font style="vertical-align: inherit;">Ruby </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не имеет </font></font><a href="https://en.wikipedia.org/wiki/Switch_statement#Fallthrough"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">осенне-через</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , так что нет никакой необходимости в конце каждого , </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вы также можете указать несколько матчей в один , </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пункт , </font><font style="vertical-align: inherit;">как , </font></font> <code>when "foo", "bar"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: We can write switch statement for multiple conditions.
es: Podemos escribir una declaración de cambio para múltiples condiciones.
ja: 複数の条件に対応したswitch文を書くことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 조건에 대한 switch 문을 작성할 수 있습니다.</font></font>
ru: Мы можем написать оператор переключения для нескольких условий.

source: When the <code>===</code> operator is called on a range object, it returns true if the value on the right falls within the range on the left.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando </font><font style="vertical-align: inherit;">se llama al operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en un objeto de rango, devuelve verdadero si el valor de la derecha cae dentro del rango de la izquierda.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合</font></font> <code>===</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オペレータがRangeオブジェクトに対して呼び出され、右側の値は、左の範囲内にある場合、それは真を返します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">범위 객체 </font><font style="vertical-align: inherit;">에서 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자를 호출하면 오른쪽의 값이 왼쪽의 범위 내에 있으면 true를 반환합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда </font><font style="vertical-align: inherit;">оператор </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывается для объекта диапазона, он возвращает true, если значение справа попадает в диапазон слева.</font></font>

source: Will print "It is not a string or number".
es: Imprimirá "No es una cadena o un número".
ja: 文字列や数字ではありません」と表示されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"문자열 또는 숫자가 아닙니다"를 인쇄합니다.</font></font>
ru: Выведет "Это не строка или число".

source: You can also create your own comparators easily using a Struct with a custom <code>===</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n puede crear sus propios comparadores f&aacute;cilmente usando un Struct con un personalizado </font></font> <code>===</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、カスタムの</font> <code>===</code> <font style="vertical-align: inherit;">を使用したStructを使用して、独自のコンパレータを簡単に作成することもできます。</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 정의 </font> <code>===</code> <font style="vertical-align: inherit;"> 를 가진 Struct를 사용하여 자신 만의 비교기를 쉽게 만들 수도 있습니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете легко создавать свои собственные компараторы, используя Struct с пользовательскими </font></font> <code>===</code>

source: You can do like this in more natural way,
es: Puedes hacer esto de una manera más natural,
ja: もっと自然な形でこうすればいいんだよ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보다 자연스러운 방식으로이 작업을 수행 할 수 있습니다.</font></font>
ru: Ты можешь сделать это более естественным способом,

source: You can use regular expressions, such as finding a type of string:
es: Se pueden utilizar expresiones regulares,como encontrar un tipo de cadena:
ja: 文字列の型を探すなど、正規表現を使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 유형 찾기와 같은 정규식을 사용할 수 있습니다.</font></font>
ru: Можно использовать регулярные выражения,такие как поиск типа строки:

source: You can write <code>case</code> expressions in two different ways in Ruby:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede escribir </font><font style="vertical-align: inherit;">expresiones de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de dos maneras diferentes en Ruby:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyでは、2つの異なる方法で</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">式</font><font style="vertical-align: inherit;">を記述できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby에서 두 가지 다른 방식으로 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 표현을 </font><font style="vertical-align: inherit;">작성할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете написать </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выражения двумя различными способами в Ruby:</font></font>
