Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: Ruby's <code>case</code> will use the equality operand <code>===</code> for this (thanks @JimDeville). Additional information is available at "<a href="http://www.tutorialspoint.com/ruby/ruby_operators.htm">Ruby Operators</a>". This also can be done using @mmdemirbas example (without parameter), only this approach is cleaner for these types of cases.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Ruby </font><font style="vertical-align: inherit;">usar&aacute; el operando de igualdad </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para esto (gracias @JimDeville). </font><font style="vertical-align: inherit;">Hay informaci&oacute;n adicional disponible en " </font></font><a href="http://www.tutorialspoint.com/ruby/ruby_operators.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Operadores de Ruby</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ". </font><font style="vertical-align: inherit;">Esto tambi&eacute;n se puede hacer usando el ejemplo @mmdemirbas (sin par&aacute;metro), solo este enfoque es m&aacute;s limpio para este tipo de casos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyの</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、等価オペランド</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用します</font><font style="vertical-align: inherit;">（@JimDevilleに感謝）。</font><font style="vertical-align: inherit;">詳細については、「</font></font><a href="http://www.tutorialspoint.com/ruby/ruby_operators.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyオペレーター</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」を参照してください。</font><font style="vertical-align: inherit;">これは、@ mmdemirbasの例（パラメーターなし）を使用して行うこともできます。このアプローチのみが、これらのタイプのケースに適しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비의 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동등 피연산자 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용합니다 (@JimDeville 덕분에). </font><font style="vertical-align: inherit;">추가 정보는 " </font></font><a href="http://www.tutorialspoint.com/ruby/ruby_operators.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비 연산자</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " </font><font style="vertical-align: inherit;">에서 확인할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이것은 매개 변수없이 @mmdemirbas 예제를 사용하여 수행 할 수 있으며 이러한 유형의 경우에는이 방법 만 더 명확합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Руби для этого </font><font style="vertical-align: inherit;">будет использоваться операнд равенства </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (спасибо @JimDeville). </font><font style="vertical-align: inherit;">Дополнительная информация доступна на " </font></font><a href="http://www.tutorialspoint.com/ruby/ruby_operators.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рубин Операторы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ". </font><font style="vertical-align: inherit;">Это также можно сделать с помощью примера @mmdemirbas (без параметра), только этот подход более чист для таких случаев.</font></font>

source: See "<a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/">How A Ruby Case Statement Works And What You Can Do With It</a>".
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Consulte " </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&oacute;mo funciona una declaraci&oacute;n de caso Ruby y qu&eacute; puede hacer con ella</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ".</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「</font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RubyのCaseステートメントの仕組みとそれでできること</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」を</font><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">" </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby Case Statement의 작동 방식 및 수행 할 수있는 작업</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "을 참조하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите " </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как работает Ruby Case case и что вы можете с ним сделать</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ".</font></font>

source: See "<a href="https://www.tutorialspoint.com/ruby/ruby_if_else.htm">Ruby - if...else, case, unless</a>" for more information.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Consulte " </font></font><a href="https://www.tutorialspoint.com/ruby/ruby_if_else.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby: si ... si no, caso, a menos que</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " para obtener m&aacute;s informaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細については、「</font></font><a href="https://www.tutorialspoint.com/ruby/ruby_if_else.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby-if ... else、case、unless</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」を参照してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 정보는 " </font></font><a href="https://www.tutorialspoint.com/ruby/ruby_if_else.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby-if ... else, case, not</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "을 참조하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите " </font></font><a href="https://www.tutorialspoint.com/ruby/ruby_if_else.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby - если ... еще, case, если только</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " для получения дополнительной информации.</font></font>

source: Shorter version:
es: Versión más corta:
ja: より短いバージョン。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 짧은 버전 :</font></font>
ru: Укороченная версия:

source: Similar to a series of <code>if</code> statements
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Similar a una serie de </font><font style="vertical-align: inherit;">declaraciones </font></font> <code>if</code> <font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一連の</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメントに</font><font style="vertical-align: inherit;">似ています</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일련의 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문과 </font><font style="vertical-align: inherit;">유사</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Похоже на серию </font><font style="vertical-align: inherit;">операторов </font></font> <code>if</code> <font style="vertical-align: inherit;"></font>

source: Since <code>switch case</code> always returns a single object, we can directly print its result:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dado que el </font></font> <code>switch case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siempre devuelve un &uacute;nico objeto, podemos imprimir directamente su resultado:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以来</font></font> <code>switch case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に単一のオブジェクトを返す、我々は直接、その結果を印刷することができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이후 </font></font> <code>switch case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 항상 하나의 객체를 반환, 우리는 직접 결과를 인쇄 할 수 있습니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку </font></font> <code>switch case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> всегда возвращает один объект, мы можем напрямую напечатать его результат:</font></font>

source: So, in a <code>case</code> statement, a <code>,</code> is the equivalent of <code>||</code> in an <code>if</code> statement.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, en una </font><font style="vertical-align: inherit;">declaraci&oacute;n de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , a </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el equivalente de </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">en una </font><font style="vertical-align: inherit;">declaraci&oacute;n </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">だから、中</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文</font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のと同等である</font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">声明。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서, A의 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문, a는 </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것과 같습니다 </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, в </font><font style="vertical-align: inherit;">выражении </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , a </font></font> <code>,</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является эквивалентом </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в </font><font style="vertical-align: inherit;">заявлении </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Specify a target next to the <code>case</code> and each <code>when</code> clause is compared to the target.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Especifique un objetivo al lado del </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y cada </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se compare con el objetivo.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">横にターゲットを指定し、</font><font style="vertical-align: inherit;">各</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句をターゲットと比較します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 옆에 대상을 지정 </font><font style="vertical-align: inherit;">하고 각 </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 절을 대상과 비교하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Укажите цель рядом с </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и каждое </font><font style="vertical-align: inherit;">условие </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сравнивается с мишенью.</font></font>

source: That operator works as expected with literals, but not with classes:
es: Ese operador trabaja como se espera con los literales,pero no con las clases:
ja: この演算子はリテラルでは期待通りに動作しますが、クラスでは動作しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 연산자는 리터럴에서 예상대로 작동하지만 클래스에서는 작동하지 않습니다.</font></font>
ru: Этот оператор работает,как и ожидалось,с литералами,но не с классами:

source: The <code>case</code> statement operator is like <code>switch</code> in the other languages.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font><font style="vertical-align: inherit;">operador de declaraci&oacute;n de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es como un </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en los otros idiomas.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント演算子は次のようにある</font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の言語インチ</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문 연산자처럼 </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 언어입니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> оператор оператора, как </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на других языках.</font></font>

source: The only relevant difference between the two examples above is that, when there is a match, <code>===</code> returns true and <code>=~</code> returns an integer, which is a truthy value in Ruby. We will get back to this soon.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La &uacute;nica diferencia relevante entre los dos ejemplos anteriores es que, cuando hay una coincidencia, </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve verdadero y </font></font> <code>=~</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve un n&uacute;mero entero, que es un valor verdadero en Ruby. </font><font style="vertical-align: inherit;">Volveremos a esto pronto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の2つの例の唯一の関連する違いは、一致がある場合、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はtrueを</font><font style="vertical-align: inherit;">返し、</font></font> <code>=~</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は整数を返します。これは、Rubyでは真の値です。</font><font style="vertical-align: inherit;">これはすぐに戻ります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 두 예제 간의 유일한 관련 차이점은 일치하는 항목이있을 때 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 true를, </font></font> <code>=~</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 정수를 반환한다는 것입니다. 이는 Ruby의 값입니다. </font><font style="vertical-align: inherit;">곧 다시 연락 드리겠습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Единственное существенное различие между двумя приведенными выше примерами состоит в том, что при совпадении </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает true, а </font></font> <code>=~</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает целое число, которое является истинным значением в Ruby. </font><font style="vertical-align: inherit;">Мы скоро вернемся к этому.</font></font>

source: The same result can be achieved with other methods which are probably best suited for the job, such as <code>is_a?</code> and <code>instance_of?</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se puede lograr el mismo resultado con otros m&eacute;todos que probablemente sean los m&aacute;s adecuados para el trabajo, como </font></font> <code>is_a?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">e </font></font> <code>instance_of?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>is_a?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">など、ジョブにおそらく最適な他のメソッドでも同じ結果が得られ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">および</font></font> <code>instance_of?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>is_a?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같이 해당 작업에 가장 적합한 다른 방법으로도 동일한 결과를 얻을 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그리고 </font></font> <code>instance_of?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тот же результат может быть достигнут с помощью других методов, которые, вероятно, лучше всего подходят для работы, таких как </font></font> <code>is_a?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и </font></font> <code>instance_of?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">,</font></font>

source: This allows for sophisticated <code>when</code> clauses as seen above. Ranges, classes and all sorts of things can be tested for rather than just equality.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto permite </font><font style="vertical-align: inherit;">cl&aacute;usulas </font><font style="vertical-align: inherit;">sofisticadas </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ve arriba. </font><font style="vertical-align: inherit;">Los rangos, las clases y todo tipo de cosas se pueden probar en lugar de solo la igualdad.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、</font><font style="vertical-align: inherit;">上記のように</font><font style="vertical-align: inherit;">洗練された</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句</font><font style="vertical-align: inherit;">が可能になります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">範囲、クラス、およびあらゆる種類のものを、単なる等価ではなくテストできます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">위에서 본 것처럼 </font><font style="vertical-align: inherit;">정교한 </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 절을 </font><font style="vertical-align: inherit;">허용합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">범위, 클래스 및 모든 종류의 것들을 평등이 아닌 테스트 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это позволяет сложные , </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> положения , </font><font style="vertical-align: inherit;">как показано выше. </font><font style="vertical-align: inherit;">Диапазоны, классы и все виды вещей могут быть проверены, а не только на равенство.</font></font>
