Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: And it turns out you can also replace an arbitrary if/else chain (that is, even if the tests don't involve a common variable) with <code>case</code> by leaving out the initial <code>case</code> parameter and just writing expressions where the first match is what you want.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y resulta que tambi&eacute;n puede reemplazar una cadena arbitraria if / else (es decir, incluso si las pruebas no involucran una variable com&uacute;n) con </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al omitir el </font><font style="vertical-align: inherit;">par&aacute;metro de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> inicial </font><font style="vertical-align: inherit;">y simplemente escribir expresiones donde la primera coincidencia es lo que usted desear.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、任意のif / elseチェーン（つまり、テストに共通変数が含まれていない場合でも）を</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">置き換えることもできます。</font><font style="vertical-align: inherit;">最初の</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメーターを省略し、最初の一致が一致する式を記述するだけです。欲しいです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 </font><font style="vertical-align: inherit;">초기 </font> <code>case</code> <font style="vertical-align: inherit;"> 매개 변수 </font><font style="vertical-align: inherit;">를 생략 </font><font style="vertical-align: inherit;">하고 첫 번째 일치 항목이있는 표현식을 작성 </font><font style="vertical-align: inherit;">하여 임의의 if / else 체인 (즉, 테스트에 공통 변수가 포함되지 않은 경우에도)을 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 </font><font style="vertical-align: inherit;">바꿀 수도 있습니다 필요.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И получается, что вы также можете заменить произвольную цепочку if / else (то есть, даже если в тестах нет общей переменной) </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , пропустив исходный </font><font style="vertical-align: inherit;">параметр </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и просто написав выражения, где первое совпадение - это то, что вы хотеть.</font></font>

source: Another example:
es: Otro ejemplo:
ja: 別の例です。
ko: 또 다른 예:
ru: Еще один пример:

source: As per the <a href="http://ruby-doc.org/docs/keywords/1.9/Object.html#method-i-case"><code>case</code></a> documentation:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Seg&uacute;n la </font><font style="vertical-align: inherit;">documentaci&oacute;n </font><font style="vertical-align: inherit;">del </font></font><a href="http://ruby-doc.org/docs/keywords/1.9/Object.html#method-i-case"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://ruby-doc.org/docs/keywords/1.9/Object.html#method-i-case"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメント</font><font style="vertical-align: inherit;">に従って</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당으로 </font></font><a href="http://ruby-doc.org/docs/keywords/1.9/Object.html#method-i-case"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문서 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно </font><font style="vertical-align: inherit;">документации </font><font style="vertical-align: inherit;">по </font></font><a href="http://ruby-doc.org/docs/keywords/1.9/Object.html#method-i-case"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: As stated in many of the above answers, the <code>===</code> operator is used under the hood on <code>case</code>/<code>when</code> statements.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como se indica en muchas de las respuestas anteriores, el </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se utiliza bajo el cap&oacute; en las </font><font style="vertical-align: inherit;">declaraciones de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の回答の多くで述べたように、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子は</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">内部</font><font style="vertical-align: inherit;">で使用され</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 많은 답변에서 언급했듯이 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자는 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문 </font><font style="vertical-align: inherit;">에서 후드 아래에 사용됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как указано во многих приведенных выше ответах, </font><font style="vertical-align: inherit;">оператор </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется под капотом </font><font style="vertical-align: inherit;">в </font><font style="vertical-align: inherit;">операторах </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Can be used with <a href="http://ruby-doc.org/core-2.2.0/Range.html">Ranges</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se puede usar con </font></font><a href="http://ruby-doc.org/core-2.2.0/Range.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rangos</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://ruby-doc.org/core-2.2.0/Range.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">範囲</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で使用でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://ruby-doc.org/core-2.2.0/Range.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">범위</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 함께 사용할 수 있습니다 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Может использоваться с </font></font><a href="http://ruby-doc.org/core-2.2.0/Range.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">диапазонами</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Can be used with <a href="https://en.wikipedia.org/wiki/Regular_expression">Regex</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se puede usar con </font></font><a href="https://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regex</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regex</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정규식</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 함께 사용할 수 있습니다 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Может использоваться с </font></font><a href="https://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regex</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Can be used with <a href="https://rubymonk.com/learning/books/4-ruby-primer-ascent/chapters/18-blocks/lessons/64-blocks-procs-lambdas">Procs and Lambdas</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se puede usar con </font></font><a href="https://rubymonk.com/learning/books/4-ruby-primer-ascent/chapters/18-blocks/lessons/64-blocks-procs-lambdas"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Procs y Lambdas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://rubymonk.com/learning/books/4-ruby-primer-ascent/chapters/18-blocks/lessons/64-blocks-procs-lambdas"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ProcsとLambdas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で使用できます</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://rubymonk.com/learning/books/4-ruby-primer-ascent/chapters/18-blocks/lessons/64-blocks-procs-lambdas"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Procs 및 Lambdas와</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함께 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Может использоваться с </font></font><a href="https://rubymonk.com/learning/books/4-ruby-primer-ascent/chapters/18-blocks/lessons/64-blocks-procs-lambdas"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Procs и Lambdas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Case equality operator: <code>===</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Operador de igualdad de casos: </font></font> <code>===</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大文字と小文字の等価演算子：</font></font> <code>===</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대소 문자 평등 연산자 : </font></font> <code>===</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оператор равенства случая: </font></font> <code>===</code>

source: Case statements consist of an optional condition, which is in the position of an argument to <code>case</code>, and zero or more <code>when</code> clauses. The first <code>when</code> clause to match the condition (or to evaluate to Boolean truth, if the condition is null) &ldquo;wins&rdquo;, and its code stanza is executed. The value of the case statement is the value of the successful <code>when</code> clause, or <code>nil</code> if there is no such clause.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las declaraciones de caso consisten en una condici&oacute;n opcional, que est&aacute; en la posici&oacute;n de un argumento para el </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y cero o m&aacute;s </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cl&aacute;usulas. </font><font style="vertical-align: inherit;">La primera </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para que coincida con la condici&oacute;n (o para evaluar la verdad booleana, si la condici&oacute;n es nula) "gana", y se ejecuta su estrofa de c&oacute;digo. </font><font style="vertical-align: inherit;">El valor de la declaraci&oacute;n del caso es el valor de la </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> exitosa </font><font style="vertical-align: inherit;">, o </font></font> <code>nil</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si no existe tal cl&aacute;usula.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caseステートメントは、</font></font> <code>case</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引数の位置にあるオプションの条件</font><font style="vertical-align: inherit;">と、0個以上の</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句で構成されます。</font><font style="vertical-align: inherit;">条件に一致する（または条件がnullの場合はブール値の真実に評価する）</font><font style="vertical-align: inherit;">最初の</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句が「勝ち」、そのコードスタンザが実行されます。</font><font style="vertical-align: inherit;">caseステートメントの値は、成功した</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句の</font><font style="vertical-align: inherit;">値です</font><font style="vertical-align: inherit;">。そのような句がない場合は</font></font> <code>nil</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">케이스 명령문의 인수의 위치에 임의의 조건으로 구성 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 0 개 이상의 </font><font style="vertical-align: inherit;">절. </font><font style="vertical-align: inherit;">조건과 일치하는 (또는 조건이 null 인 경우 부울 진리로 평가 </font><font style="vertical-align: inherit;">되는) 첫 번째 </font> <code>when</code> <font style="vertical-align: inherit;"> 절이 "승리"되고 해당 코드 스탠자가 실행됩니다. </font><font style="vertical-align: inherit;">case 문의 값은 성공한 </font> <code>when</code> <font style="vertical-align: inherit;"> 절의 </font><font style="vertical-align: inherit;">값 </font><font style="vertical-align: inherit;">이거나 </font><font style="vertical-align: inherit;">해당 절이 없으면 </font> <code>nil</code> <font style="vertical-align: inherit;"> 입니다.</font></font> <code>when</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Операторы case состоят из необязательного условия, которое находится в позиции аргумента </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и нуля или более, </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предложения. </font><font style="vertical-align: inherit;">Первое </font><font style="vertical-align: inherit;">предложение </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которое соответствует условию (или оценивается как логическая истина, если условие имеет значение null) &laquo;выигрывает&raquo;, и выполняется его кодовая часть. </font><font style="vertical-align: inherit;">Значением оператора case является значение успешного </font><font style="vertical-align: inherit;">предложения </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>nil</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если такого предложения нет.</font></font>

source: Depending on your case, you could prefer to use a hash of methods.
es: Dependiendo de su caso,podría preferir utilizar un hachís de métodos.
ja: あなたのケースによっては、メソッドのハッシュを使用することを好むかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우에 따라 해시 방법을 사용하는 것이 좋습니다.</font></font>
ru: В зависимости от вашего случая,вы можете предпочесть использовать хэш-методы.

source: For Example,
es: Por ejemplo,
ja: 例えば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어</font></font>
ru: Например,

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:

source: For more information see the <a href="https://ruby-doc.org/core-2.6.5/doc/syntax/control_expressions_rdoc.html#label-case+Expression"><code>case</code></a> documentation.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para obtener m&aacute;s informaci&oacute;n, consulte la </font><font style="vertical-align: inherit;">documentaci&oacute;n del </font></font><a href="https://ruby-doc.org/core-2.6.5/doc/syntax/control_expressions_rdoc.html#label-case+Expression"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細については、</font></font><a href="https://ruby-doc.org/core-2.6.5/doc/syntax/control_expressions_rdoc.html#label-case+Expression"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメントを</font><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 </font></font><a href="https://ruby-doc.org/core-2.6.5/doc/syntax/control_expressions_rdoc.html#label-case+Expression"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설명서를 </font><font style="vertical-align: inherit;">참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для получения дополнительной информации см. </font><font style="vertical-align: inherit;">Документацию </font><font style="vertical-align: inherit;">по </font></font><a href="https://ruby-doc.org/core-2.6.5/doc/syntax/control_expressions_rdoc.html#label-case+Expression"> <code>case</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Fortunately, this is easily solved. The <code>===</code> operator has been defined so that it returns <code>true</code> if you use it with a class and supply an instance of that class as the second operand:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Afortunadamente, esto se resuelve f&aacute;cilmente. </font><font style="vertical-align: inherit;">El </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se ha definido para que devuelva </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si lo usa con una clase y proporciona una instancia de esa clase como el segundo operando:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">幸い、これは簡単に解決できます。</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子は、それが返すように定義されている</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはクラスでそれを使用し、第二オペランドとして、そのクラスのインスタンスを指定した場合：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다행히도 이것은 쉽게 해결됩니다. </font></font> <code>===</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자가 반환하도록 정의 된 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 클래스를 사용하고 두 번째 피연산자로 해당 클래스의 인스턴스를 제공하는 경우 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">К счастью, это легко решается. </font><font style="vertical-align: inherit;">Оператор </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> был определен так, что он возвращает </font></font> <code>true</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы используете его с классом и предоставляете экземпляр этого класса в качестве второго операнда:</font></font>

source: Here is additional information about that operator:
es: Aquí hay información adicional sobre ese operador:
ja: ここでは、その演算子に関する追加情報を紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해당 연산자에 대한 추가 정보는 다음과 같습니다.</font></font>
ru: Дополнительная информация об этом операторе:
