Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: You might think that to perform an <em>AND</em>, you can do something like this below, but it doesn't work:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede pensar que para realizar un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede hacer algo como esto a continuaci&oacute;n, pero no funciona:</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行するために、</font><font style="vertical-align: inherit;">以下のようなことができる</font><font style="vertical-align: inherit;">と思うかもしれ</font><font style="vertical-align: inherit;">ませんが、機能しません。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 수행하려면 </font><font style="vertical-align: inherit;">다음과 같이 할 수 있지만 작동하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете подумать, что для выполнения </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вы можете сделать что-то вроде этого ниже, но это не работает:</font></font>

source: [Error]: uninitialized constant <strong>RegExp</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[Error]: constante </font><strong><font style="vertical-align: inherit;">RegExp</font></strong><font style="vertical-align: inherit;"> no inicializada</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[エラー]：初期化されていない定数</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RegExp</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[오류] : 초기화되지 않은 상수 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RegExp</font></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[Ошибка]: неинициализированная константа </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RegExp</font></font></strong>
