Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: "<a href="http://www.skorks.com/2009/09/ruby-equality-and-object-comparison/">Ruby Equality And Object Comparison</a>" is a good discussion on the topic.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">" </font></font><a href="http://www.skorks.com/2009/09/ruby-equality-and-object-comparison/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby Equality And Object Comparison</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " es una buena discusi&oacute;n sobre el tema.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「</font></font><a href="http://www.skorks.com/2009/09/ruby-equality-and-object-comparison/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyの等価性とオブジェクトの比較</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」は、このトピックに関する良い議論です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">" </font></font><a href="http://www.skorks.com/2009/09/ruby-equality-and-object-comparison/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비 평등과 객체 비교</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "는이 주제에 대한 좋은 토론입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">" </font></font><a href="http://www.skorks.com/2009/09/ruby-equality-and-object-comparison/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рубиновое равенство и сравнение объектов</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " - хорошая дискуссия на эту тему.</font></font>

source: (Example taken from "<a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/">How A Ruby Case Statement Works And What You Can Do With It</a>".)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Ejemplo tomado de " </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&oacute;mo funciona una declaraci&oacute;n de caso Ruby y qu&eacute; puede hacer con ella</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ").</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（「</font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RubyのCaseステートメントがどのように機能し、それを使って何ができるか</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」からの例</font><font style="vertical-align: inherit;">。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( " </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비 사례 설명의 작동 방식 및</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조치"에서 발췌 한 예 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Пример взят из </font></font><a href="http://www.skorks.com/2009/08/how-a-ruby-case-statement-works-and-what-you-can-do-with-it/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статьи</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &laquo; </font><font style="vertical-align: inherit;">Как работает оператор случая Ruby и что вы можете с ним сделать</font><font style="vertical-align: inherit;"> &raquo;.)</font></font>

source: (Example taken from "<a href="https://stackoverflow.com/questions/16662295/can-procs-be-used-with-case-statements-in-ruby-2-0">Can procs be used with case statements in Ruby 2.0?</a>".)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Ejemplo tomado de " </font></font><a href="https://stackoverflow.com/questions/16662295/can-procs-be-used-with-case-statements-in-ruby-2-0"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Se pueden usar procs con declaraciones de casos en Ruby 2.0?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ").</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（「</font></font><a href="https://stackoverflow.com/questions/16662295/can-procs-be-used-with-case-statements-in-ruby-2-0"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ProはRuby 2.0のcaseステートメントで使用できますか？</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">からの例</font><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( " </font></font><a href="https://stackoverflow.com/questions/16662295/can-procs-be-used-with-case-statements-in-ruby-2-0"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비 2.0에서 procs를 case 문과 함께 사용할 수 있습니까?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Пример взят из &laquo; </font></font><a href="https://stackoverflow.com/questions/16662295/can-procs-be-used-with-case-statements-in-ruby-2-0"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Можно ли использовать процы с операторами case в Ruby 2.0?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;.)</font></font>

source: <code>case...when</code> behaves a bit unexpectedly when handling classes. This is due to the fact that it uses the <code>===</code> operator.
es: <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comporta un poco inesperadamente al manejar clases. </font><font style="vertical-align: inherit;">Esto se debe al hecho de que utiliza el </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスを処理するときに予期せぬ動作をする</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子を</font><font style="vertical-align: inherit;">使用しているため</font><font style="vertical-align: inherit;">です。</font></font>
ko: <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스를 처리 할 때 예기치 않게 약간 작동합니다. </font><font style="vertical-align: inherit;">이것은 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자를 </font><font style="vertical-align: inherit;">사용하기 때문입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <code>case...when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ведет себя немного неожиданно при обработке классов. </font><font style="vertical-align: inherit;">Это связано с тем, что он использует </font><font style="vertical-align: inherit;">оператор </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: <code>x</code> is not less than 2, yet the return value is <code>"apple"</code>. Why? Because <code>x</code> was 3 and since <code>',`` acts as an</code>||<code>, it did not bother to evaluate the expression</code>x &lt; 2'.
es: <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no es menor que 2, pero el valor de retorno es </font></font> <code>"apple"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iquest;Por qu&eacute;? </font><font style="vertical-align: inherit;">Como </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> era 3 y desde </font></font> <code>',`` acts as an</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> || </font></font> <code>, it did not bother to evaluate the expression</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> x &lt;2 '.</font></font>
ja: <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は2以上ですが、戻り値は</font></font> <code>"apple"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">どうして？</font><font style="vertical-align: inherit;">ので、</font></font> <code>x</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3であり、以来</font></font> <code>',`` acts as an</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> || </font></font> <code>, it did not bother to evaluate the expression</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> x &lt;2 ' </font><font style="vertical-align: inherit;">を評価する必要はありませんでした</font><font style="vertical-align: inherit;">。</font></font>
ko: <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 2 이상이지만 반환 값은 </font></font> <code>"apple"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">왜? </font><font style="vertical-align: inherit;">때문에 </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3이었고, 이후 </font></font> <code>',`` acts as an</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> || </font></font> <code>, it did not bother to evaluate the expression</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> x &lt;2 ' </font><font style="vertical-align: inherit;">를 평가하는 것은 귀찮지 않았다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не меньше 2, но возвращаемое значение - </font></font> <code>"apple"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Зачем? </font><font style="vertical-align: inherit;">Поскольку </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было 3, а поскольку </font></font> <code>',`` acts as an</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> || </font></font> <code>, it did not bother to evaluate the expression</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> x &lt;2 '.</font></font>

source: <strong>With parameter:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con par&aacute;metro:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメータあり：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매개 변수로 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С параметром:</font></font></strong>

source: <strong>Without parameter:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin par&aacute;metro:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメータなし：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매개 변수없이 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Без параметра:</font></font></strong>

source: A case statement can end with an <code>else</code> clause. Each <code>when</code> a statement can have multiple candidate values, separated by commas.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una declaraci&oacute;n de caso puede terminar con una </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Cada </font><font style="vertical-align: inherit;">una </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una declaraci&oacute;n puede tener m&uacute;ltiples valores candidatos, separados por comas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caseステートメントは、</font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句で</font><font style="vertical-align: inherit;">終了でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それぞれの</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のステートメントは、カンマで区切られた複数の候補値を持つことができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">case 문은 </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 절로 </font><font style="vertical-align: inherit;">끝날 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">각각의 </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 성명 여러 후보 값을 가질 수 쉼표로 구분.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оператор case может заканчиваться предложением </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Каждый , </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заявление может иметь несколько значений кандидатов, разделенных запятыми.</font></font>

source: A workaround following a combination of methods already previously covered in <a href="https://stackoverflow.com/a/38445037/6225838">here</a> and <a href="https://stackoverflow.com/a/20441220/6225838">here</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una soluci&oacute;n alternativa que sigue una combinaci&oacute;n de m&eacute;todos ya cubiertos anteriormente </font></font><a href="https://stackoverflow.com/a/38445037/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://stackoverflow.com/a/20441220/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/38445037/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://stackoverflow.com/a/20441220/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ですでにカバーされて</font><font style="vertical-align: inherit;">いる</font><font style="vertical-align: inherit;">方法の組み合わせに続く回避策</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 </font></font><a href="https://stackoverflow.com/a/38445037/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><a href="https://stackoverflow.com/a/20441220/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 다룬 방법의 조합을 따르는 해결 방법 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обходной путь, следующий за комбинацией методов, уже описанных </font></font><a href="https://stackoverflow.com/a/38445037/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://stackoverflow.com/a/20441220/6225838"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Also, can be used with your own match classes:
es: También,puede ser usado con sus propias clases de fósforo:
ja: また、自作のマッチクラスとの併用も可能です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 자신의 경기 클래스와 함께 사용할 수 있습니다.</font></font>
ru: Также может использоваться с вашими собственными игровыми классами:

source: And a <a href="http://en.wikipedia.org/wiki/Regular_expression">regular expression</a> solution here:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y una </font><font style="vertical-align: inherit;">soluci&oacute;n de </font></font><a href="http://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">expresi&oacute;n regular</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aqu&iacute;:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、</font><font style="vertical-align: inherit;">ここに</font></font><a href="http://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正規表現</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 </font></font><a href="http://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정규 표현식</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И </font><font style="vertical-align: inherit;">решение </font><font style="vertical-align: inherit;">с </font></font><a href="http://en.wikipedia.org/wiki/Regular_expression"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">регулярным выражением</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> здесь:</font></font>

source: And as "<a href="http://blog.honeybadger.io/rubys-case-statement-advanced-techniques/">Ruby's case statement - advanced techniques</a>" describes Ruby <code>case</code>;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y como " </font></font><a href="http://blog.honeybadger.io/rubys-case-statement-advanced-techniques/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Declaraci&oacute;n del caso de Ruby - t&eacute;cnicas avanzadas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " describe el </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Ruby </font><font style="vertical-align: inherit;">;</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして「</font></font><a href="http://blog.honeybadger.io/rubys-case-statement-advanced-techniques/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyのケースステートメント-高度なテクニック</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」はRubyの</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明してい</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 " </font></font><a href="http://blog.honeybadger.io/rubys-case-statement-advanced-techniques/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby의 사례 진술-고급 기술</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "은 Ruby </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설명합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И как &laquo; </font></font><a href="http://blog.honeybadger.io/rubys-case-statement-advanced-techniques/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">утверждение случая Руби - продвинутые методы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; описывает </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Руби </font><font style="vertical-align: inherit;">;</font></font>
