Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: On around page 123 of <em>The Ruby Programming Language</em> (1st Edition, O'Reilly) on my Kindle, it says the <code>then</code> keyword following the <code>when</code> clauses can be replaced with a newline or semicolon (just like in the <code>if then else</code> syntax). (Ruby 1.8 also allows a colon in place of <code>then</code>, but this syntax is no longer allowed in Ruby 1.9.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En torno a la p&aacute;gina 123 de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">The Ruby Lenguaje de programaci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (primera edici&oacute;n, O'Reilly) en mi Kindle, se dice que la </font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de palabras clave siguiendo el </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cl&aacute;usulas pueden ser sustituidos por un salto de l&iacute;nea o punto y coma (al igual que en la </font></font> <code>if then else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la sintaxis). </font><font style="vertical-align: inherit;">(Ruby 1.8 tambi&eacute;n permite dos puntos en lugar de </font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero esta sintaxis ya no est&aacute; permitida en Ruby 1.9).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Kindle </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のRubyプログラミング言語</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（第1版、O'Reilly）の</font><font style="vertical-align: inherit;">約123ページで</font><font style="vertical-align: inherit;">、</font> <code>when</code> <font style="vertical-align: inherit;">句に</font><font style="vertical-align: inherit;">続く</font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードを</font><font style="vertical-align: inherit;">改行またはセミコロンで置き換えることができる</font><font style="vertical-align: inherit;">と書か</font><font style="vertical-align: inherit;">れています（</font> <code>if then else</code> <font style="vertical-align: inherit;">構文と</font><font style="vertical-align: inherit;">同様</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">（Ruby 1.8では、</font> <code>then</code> の<font style="vertical-align: inherit;">代わりにコロンも使用でき</font><font style="vertical-align: inherit;">ますが、この構文はRuby 1.9 </font><font style="vertical-align: inherit;">では使用でき</font><font style="vertical-align: inherit;">なくなりました。）</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 Kindle </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 Ruby Programming Language</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (1st Edition, O'Reilly)의 </font><font style="vertical-align: inherit;">123 페이지 부근 </font><font style="vertical-align: inherit;">에서 </font> <code>when</code> <font style="vertical-align: inherit;"> 절 </font><font style="vertical-align: inherit;">다음의 </font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 키워드 </font><font style="vertical-align: inherit;">는 개행 또는 세미콜론으로 대체 할 수 있습니다 ( </font> <code>if then else</code> <font style="vertical-align: inherit;"> 구문과 동일). </font><font style="vertical-align: inherit;">(Ruby 1.8에서는 </font> <code>then</code> <font style="vertical-align: inherit;"> 대신 콜론을 사용할 수 </font><font style="vertical-align: inherit;">있지만이 구문은 Ruby 1.9에서 더 이상 허용되지 않습니다.)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На странице 123 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&laquo;Языка программирования Ruby&raquo;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (1-е издание, O'Reilly) в моем Kindle говорится, что </font><font style="vertical-align: inherit;">ключевое слово </font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> после предложений </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно заменить на новую строку или точку с запятой (как в </font><font style="vertical-align: inherit;">синтаксисе </font></font> <code>if then else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">(Ruby 1.8 также допускает двоеточие вместо </font></font> <code>then</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но этот синтаксис больше не разрешен в Ruby 1.9.)</font></font>

source: Or, with a complete class:
es: O,con una clase completa:
ja: あるいは、完全なクラスで。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 완전한 수업으로 :</font></font>
ru: Или,с полным классом:

source: Please, be aware of "<a href="https://stackoverflow.com/questions/948135/how-to-write-a-switch-statement-in-ruby/5694333#5694333">How to write a switch statement in Ruby</a>" that kikito warns about.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta " </font></font><a href="https://stackoverflow.com/questions/948135/how-to-write-a-switch-statement-in-ruby/5694333#5694333"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&oacute;mo escribir una declaraci&oacute;n de cambio en Ruby</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " sobre el que advierte kikito.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">kikitoが警告している「</font></font><a href="https://stackoverflow.com/questions/948135/how-to-write-a-switch-statement-in-ruby/5694333#5694333"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyでswitch文を書く方法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」に注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 유의하십시오 " </font></font><a href="https://stackoverflow.com/questions/948135/how-to-write-a-switch-statement-in-ruby/5694333#5694333"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떻게 루비에서 switch 문을 작성하는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> kikito에 대해 경고 것을".</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пожалуйста, имейте в </font><font style="vertical-align: inherit;">виду </font><font style="vertical-align: inherit;">" </font></font><a href="https://stackoverflow.com/questions/948135/how-to-write-a-switch-statement-in-ruby/5694333#5694333"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как написать оператор switch в Ruby</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ", о котором kikito предупреждает.</font></font>

source: Range Implementation of <code>===</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Implementaci&oacute;n de rango de </font></font> <code>===</code>
ja: <font style="vertical-align: inherit;"> <code>===</code> の<font style="vertical-align: inherit;">範囲の実装</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>===</code> 의<font style="vertical-align: inherit;"> 범위 구현</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Диапазон реализации </font></font> <code>===</code>

source: Regexp Implementation of <code>===</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Implementaci&oacute;n de expresiones regulares de </font></font> <code>===</code>
ja: <font style="vertical-align: inherit;"> <code>===</code> の<font style="vertical-align: inherit;">正規表現の実装</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>===</code> <font style="vertical-align: inherit;"> 정규 표현식 구현</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Внедрение регулярных выражений </font></font> <code>===</code>

source: Remember that the <code>===</code> operator invokes the <code>===</code> method of the left-hand object. So <code>(1..4) === 3</code> is equivalent to <code>(1..4).=== 3</code>. In other words, the class of the left-hand operand will define which implementation of the <code>===</code> method will be called, so the operand positions are not interchangeable.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Recuerde que el </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> invoca el </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del objeto de la izquierda. </font><font style="vertical-align: inherit;">Entonces </font></font> <code>(1..4) === 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es equivalente a </font></font> <code>(1..4).=== 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En otras palabras, la clase del operando de la izquierda definir&aacute; qu&eacute; implementaci&oacute;n del </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se llamar&aacute;, por lo que las posiciones de los operandos no son intercambiables.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演算子は</font><font style="vertical-align: inherit;">、左側のオブジェクトの</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">呼び出す</font><font style="vertical-align: inherit;">ことに</font><font style="vertical-align: inherit;">注意して</font><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">したがって、</font></font> <code>(1..4) === 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>(1..4).=== 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と同等</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">つまり、左側のオペランドのクラスは、</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドの</font><font style="vertical-align: inherit;">どの実装</font><font style="vertical-align: inherit;">が呼び出されるか</font><font style="vertical-align: inherit;">を定義する</font><font style="vertical-align: inherit;">ため、オペランドの位置を交換することはできません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기억 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연산자가 호출 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 왼쪽 개체의 방법. </font><font style="vertical-align: inherit;">따라서 </font></font> <code>(1..4) === 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>(1..4).=== 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">다시 말해, 왼쪽 피연산자 클래스는 </font><font style="vertical-align: inherit;">호출 될 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드의 </font><font style="vertical-align: inherit;">구현을 정의 </font><font style="vertical-align: inherit;">하므로 피연산자 위치는 서로 호환되지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Помните, что </font><font style="vertical-align: inherit;">оператор </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывает </font><font style="vertical-align: inherit;">метод </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> левого объекта. </font><font style="vertical-align: inherit;">Итак, </font></font> <code>(1..4) === 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> эквивалентно </font></font> <code>(1..4).=== 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Другими словами, класс левого операнда определит, какая реализация </font><font style="vertical-align: inherit;">метода </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет вызвана, поэтому позиции операнда не являются взаимозаменяемыми.</font></font>

source: Returns true if the string on the right matches the regular expression on the left.
es: Devuelve verdadero si la cuerda de la derecha coincide con la expresión regular de la izquierda.
ja: 右側の文字列が左側の正規表現と一致した場合に真を返します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오른쪽의 문자열이 왼쪽의 정규식과 일치하면 true를 반환합니다.</font></font>
ru: Возвращает true,если строка справа соответствует регулярному выражению слева.

source: Ruby compares the object in the <code>when</code> clause with the object in the <code>case</code> clause using the <code>===</code> operator. For example, <code>1..5 === x</code>, and not <code>x === 1..5</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby compara el objeto en la </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con el objeto en la </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando el </font><font style="vertical-align: inherit;">operador </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Por ejemplo, </font></font> <code>1..5 === x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y no </font></font> <code>x === 1..5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby </font><font style="vertical-align: inherit;">は、</font> <code>===</code> <font style="vertical-align: inherit;">演算子</font><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">して、</font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句のオブジェクトと</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">句</font><font style="vertical-align: inherit;">のオブジェクトを比較します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">たとえば、</font> <code>1..5 === x</code> <font style="vertical-align: inherit;">であり、</font> <code>x === 1..5</code> <font style="vertical-align: inherit;">ではありません</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby는 </font> <code>===</code> <font style="vertical-align: inherit;"> 연산자를 </font><font style="vertical-align: inherit;">사용하여 </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 절의 객체와 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 절의 </font><font style="vertical-align: inherit;">객체를 비교합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">예를 들어, </font> <code>x === 1..5</code> <font style="vertical-align: inherit;"> 아닌 </font> <code>1..5 === x</code> <font style="vertical-align: inherit;"> 입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby сравнивает объект в предложении </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с объектом в предложении </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью </font><font style="vertical-align: inherit;">оператора </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Например, </font></font> <code>1..5 === x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , а не </font></font> <code>x === 1..5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Ruby uses the <a href="http://ruby-doc.com/docs/ProgrammingRuby/html/tut_expressions.html#S5"><code>case</code> expression</a> instead.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby usa la </font><a href="http://ruby-doc.com/docs/ProgrammingRuby/html/tut_expressions.html#S5"><font style="vertical-align: inherit;">expresi&oacute;n de </font></a></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> su</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyは</font><font style="vertical-align: inherit;">代わりに</font></font><a href="http://ruby-doc.com/docs/ProgrammingRuby/html/tut_expressions.html#S5"> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">式を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비는 </font><font style="vertical-align: inherit;">대신 </font></font><a href="http://ruby-doc.com/docs/ProgrammingRuby/html/tut_expressions.html#S5"> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 표현을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вместо этого </font><font style="vertical-align: inherit;">Ruby использует </font><a href="http://ruby-doc.com/docs/ProgrammingRuby/html/tut_expressions.html#S5"><font style="vertical-align: inherit;">выражение </font></a></font> <code>case</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Ruby uses the <code>case</code> for writing switch statements.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby usa el </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para escribir declaraciones de cambio.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyは</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">してswitchステートメントを記述します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby는이 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font><font style="vertical-align: inherit;">스위치 문을 작성합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby использует этот </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для написания операторов switch.</font></font>
