Repository: rueisnom/feedback
Catalog: xlf/94/81/35/948135.*.001.xlf
Languages: es, ja, ko, ru

source: How do I write a <code>switch</code> statement in Ruby?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo escribo una </font><font style="vertical-align: inherit;">declaraci&oacute;n de </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en Ruby?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyで</font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">を作成するにはどうすればよい</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby에서 </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문을 </font><font style="vertical-align: inherit;">작성하는 방법</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как мне написать оператор </font></font> <code>switch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Ruby?</font></font>

source: How to write a switch statement in Ruby
es: Cómo escribir una declaración de cambio en Ruby
ja: Rubyでswitch文を書く方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby에서 switch 문을 작성하는 방법</font></font>
ru: Как написать заявление о переключении на Руби.

source: I hit this problem today while looking for an answer, and this was the first appearing page, so I figured it would be useful to others in my same situation.
es: Me encontré con este problema hoy mientras buscaba una respuesta,y esta fue la primera página que apareció,así que me imaginé que sería útil para otros en mi misma situación.
ja: 今日、答えを探しているときにこの問題にぶつかったのですが、これが最初に出てくるページだったので、私と同じ境遇の人にも参考になるだろうと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 오늘 대답을 찾는 동안이 문제에 부딪 쳤으며 이것이 처음으로 나타나는 페이지이므로 동일한 상황에서 다른 사람들에게 유용 할 것이라고 생각했습니다.</font></font>
ru: Сегодня я столкнулся с этой проблемой в поисках ответа,и это была первая появившаяся страница,поэтому я решил,что она будет полезна другим людям,оказавшимся в такой же ситуации.

source: I used <code>or</code>s in the class method statement since <code>||</code> has higher precedence than <code>.include?</code>. If you are a <a href="https://stackoverflow.com/a/49814089/6225838"><em>ruby-nazi</em></a>, please imagine I used this <code>(item.include? 'A') || ...</code> instead. <a href="https://repl.it/repls/LightyellowCloseAddition">repl.it</a> test.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Us&eacute; </font></font> <code>or</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s en la declaraci&oacute;n del m&eacute;todo de clase desde </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tiene mayor prioridad que </font></font> <code>.include?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Si eres un </font></font><a href="https://stackoverflow.com/a/49814089/6225838"><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rub&iacute;-nazi</font></font></em></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , imagina que us&eacute; esto </font></font> <code>(item.include? 'A') || ...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cambio. </font></font><a href="https://repl.it/repls/LightyellowCloseAddition"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">repl.it</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> test.</font></font>
ja: <font style="vertical-align: inherit;"> <code>||</code> <font style="vertical-align: inherit;">以降、クラスメソッドステートメントで</font></font> <code>or</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">ました </font> <code>.include?</code> <font style="vertical-align: inherit;">よりも </font><font style="vertical-align: inherit;">優先されますか？</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">あなたがいる場合は</font><a href="https://stackoverflow.com/a/49814089/6225838"><em><font style="vertical-align: inherit;">ルビー-ナチス</font></em></a><font style="vertical-align: inherit;">、私はこの使用を想像してください</font> <code>(item.include? 'A') || ...</code> <font style="vertical-align: inherit;">...</font><font style="vertical-align: inherit;">代わりに。</font><a href="https://repl.it/repls/LightyellowCloseAddition"><font style="vertical-align: inherit;">repl.it</font></a><font style="vertical-align: inherit;">テスト。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>||</code> <font style="vertical-align: inherit;"> 이후 클래스 메소드 명령문에서 </font></font> <code>or</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">했습니다. </font> <code>.include?</code> <font style="vertical-align: inherit;"> 보다 우선 순위가 더 높 </font><font style="vertical-align: inherit;">습니까? </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">당신이 경우 </font><a href="https://stackoverflow.com/a/49814089/6225838"><em><font style="vertical-align: inherit;">루비 나치</font></em></a><font style="vertical-align: inherit;"> , 나는이 사용 상상하십시오 </font> <code>(item.include? 'A') || ...</code> <font style="vertical-align: inherit;">...</font><font style="vertical-align: inherit;"> 대신. </font><a href="https://repl.it/repls/LightyellowCloseAddition"><font style="vertical-align: inherit;">반복</font></a><font style="vertical-align: inherit;"> 테스트.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использовал </font></font> <code>or</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s в выражении метода класса, поскольку </font></font> <code>||</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">имеет более высокий приоритет, чем </font></font> <code>.include?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Если вы </font></font><a href="https://stackoverflow.com/a/49814089/6225838"><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">рубин-нацист</font></font></em></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , пожалуйста, представьте, что я использовал это </font></font> <code>(item.include? 'A') || ...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font><a href="https://repl.it/repls/LightyellowCloseAddition"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Репл.ит</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> тест.</font></font>

source: I've started to use:
es: He empezado a usar:
ja: 使い始めました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 사용하기 시작했다 :</font></font>
ru: Я начал использовать:

source: If there is a long list of <code>when</code>s and each of them has a concrete value to compare with (not an interval), it will be more effective to declare a hash of methods and then to call the relevant method from the hash like that.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si hay una larga lista de </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s y cada uno de ellos tiene un valor concreto para comparar (no un intervalo), ser&aacute; m&aacute;s efectivo declarar un hash de m&eacute;todos y luego llamar al m&eacute;todo relevante del hash de esa manera.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">長いリストが</font><font style="vertical-align: inherit;">あり、それらのそれぞれが（間隔ではなく）比較する具体的な値を持っている場合、メソッドのハッシュを宣言し、そのようなハッシュから関連するメソッドを呼び出す方がより効果的です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">거기의 긴 목록의 경우 </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 들과 그들 각각의 (안 간격)와 비교하는 구체적인 값을 가지고, 방법의 해시를 선언하는 것이 더 효과적 일 것하고 같은 해시에서 해당 메소드를 호출 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если есть длинный список, </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s, и у каждого из них есть конкретное значение для сравнения (не с интервалом), будет более эффективно объявить хеш методов и затем вызвать соответствующий метод из хеша, подобного этому.</font></font>

source: If you are eager to know how to use an OR condition in a Ruby switch case:
es: Si estás ansioso por saber cómo usar una condición de quirófano en un caso de cambio de Ruby:
ja: RubyのスイッチケースでOR条件を使う方法を知りたい方は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby 스위치 케이스에서 OR 조건을 사용하는 방법을 알고 싶은 경우 :</font></font>
ru: Если вы хотите знать,как использовать условие "ИЛИ" в корпусе переключателя "Рубин":

source: In C-like languages fallthrough typically looks like this:
es: En las lenguas con forma de C,la caída de la caída se ve típicamente así:
ja: C言語のような言語では、フォールスルーは通常このようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C와 유사한 언어에서는 일반적으로 다음과 같이 나타납니다.</font></font>
ru: В C-подобных языках падение обычно выглядит так:

source: In Ruby 2.0, you can also use lambdas in <code>case</code> statements, as follows:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En Ruby 2.0, tambi&eacute;n puede usar lambdas en las </font><font style="vertical-align: inherit;">declaraciones de </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , de la siguiente manera:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby 2.0では、</font><font style="vertical-align: inherit;">次のように</font><font style="vertical-align: inherit;">、</font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメントで</font><font style="vertical-align: inherit;">ラムダを使用することもでき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby 2.0에서는 </font><font style="vertical-align: inherit;">다음과 같이 </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문에 </font><font style="vertical-align: inherit;">람다를 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В Ruby 2.0 вы также можете использовать лямбды в </font><font style="vertical-align: inherit;">операторах </font></font> <code>case</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , как показано ниже:</font></font>

source: In Ruby, the same can be achieved in the following way:
es: En Rubí,lo mismo se puede lograr de la siguiente manera:
ja: Rubyでは、以下のような方法で同様のことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비에서도 다음과 같은 방법으로 달성 할 수 있습니다.</font></font>
ru: В Рубине то же самое может быть достигнуто следующим образом:

source: In short, the code above can be fixed by removing the <code>.class</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En resumen, el c&oacute;digo anterior se puede solucionar eliminando el </font></font> <code>.class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、上記のコードは</font></font> <code>.class</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">削除することで修正できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, 위의 코드는 </font></font> <code>.class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 제거하여 수정할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Короче говоря, приведенный выше код можно исправить, удалив </font></font> <code>.class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: In the Ruby Programming Language book, Matz says this latter form is the simple (and infrequently used) form, which is nothing more than an alternative syntax for <code>if</code>/<code>elsif</code>/<code>else</code>. However, whether it is infrequently used or not, I do not see any other way to attach multiple <code>&amp;&amp;</code> expressions for a given <code>when</code> clause.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el libro Ruby Programming Language, Matz dice que esta &uacute;ltima forma es la forma simple (y que se usa con poca frecuencia), que no es m&aacute;s que una sintaxis alternativa para </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>elsif</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Sin embargo, ya sea que se use con poca frecuencia o no, no veo ninguna otra forma de adjuntar m&uacute;ltiples </font><font style="vertical-align: inherit;">expresiones </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para una </font><font style="vertical-align: inherit;">cl&aacute;usula </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dada </font><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rubyプログラミング言語の本で、マッツはこの後者の形式は単純な（そしてあまり使用されない）形式であると</font></font> <code>if</code> <font style="vertical-align: inherit;"> <code>else</code> <font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは</font><font style="vertical-align: inherit;">if</font><font style="vertical-align: inherit;"> / </font></font> <code>elsif</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">elseの</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替構文にすぎませ</font><font style="vertical-align: inherit;">ん</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、使用頻度が低いかどうかに関係なく</font><font style="vertical-align: inherit;">、特定の</font> <code>when</code> <font style="vertical-align: inherit;">句に</font><font style="vertical-align: inherit;">複数の</font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">式</font><font style="vertical-align: inherit;">をアタッチする他の方法はありません</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루비 프로그래밍 언어 책에서 마츠는이 후자의 형태에 대한 대안 구문에 불과하다 간단한 (그리고 자주 사용) 형태 말합니다 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>elsif</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그러나 드물게 사용되는지 여부에 관계없이 </font><font style="vertical-align: inherit;">주어진 </font> <code>when</code> <font style="vertical-align: inherit;"> 절 </font><font style="vertical-align: inherit;">에 여러 </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 표현식 </font><font style="vertical-align: inherit;">을 첨부하는 다른 방법은 없습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В книге Ruby Programming Language Матц говорит, что эта последняя форма является простой (и редко используемой) формой, которая является не чем иным, как альтернативным синтаксисом для </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>elsif</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Однако, независимо от того, используется он редко или нет, я не вижу другого способа присоединить несколько </font><font style="vertical-align: inherit;">выражений </font></font> <code>&amp;&amp;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для данного </font><font style="vertical-align: inherit;">предложения </font></font> <code>when</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: It doesn't work because <code>(3 &amp;&amp; x &gt; 2)</code> evaluates to true, and Ruby takes the True value and compares it to <code>x</code> with <code>===</code>, which is not true, since <code>x</code> is 3.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No funciona porque </font></font> <code>(3 &amp;&amp; x &gt; 2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> eval&uacute;a como verdadero, y Ruby toma el valor Verdadero y lo compara con </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo cual no es cierto, ya que </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es 3.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、それは仕事をしない</font></font> <code>(3 &amp;&amp; x &gt; 2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">評価するtrueに、そしてRubyは真の値を取り、それを比較し</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以来、事実ではない、</font></font> <code>x</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3です。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>(3 &amp;&amp; x &gt; 2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 true로 평가되고 Ruby가 True 값을 가져 와서 </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 </font><font style="vertical-align: inherit;">x</font><font style="vertical-align: inherit;"> 와 </font><font style="vertical-align: inherit;">비교 </font><font style="vertical-align: inherit;">하기 때문에 작동하지 않습니다 </font><font style="vertical-align: inherit;">. </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 3 </font><font style="vertical-align: inherit;">이므로 true가 아닙니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не работает, потому что </font></font> <code>(3 &amp;&amp; x &gt; 2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> оценивается как true, а Ruby принимает значение True и сравнивает его с </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>===</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , что неверно, поскольку </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равен 3.</font></font>

source: It helps compact code in some cases.
es: Ayuda a compactar el código en algunos casos.
ja: 場合によってはコードのコンパクト化に役立ちます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우에 따라 컴팩트 코드를 작성하는 데 도움이됩니다.</font></font>
ru: В некоторых случаях это помогает сжимать код.
