Repository: rueisnom/feedback
Catalog: xlf/10/93/25/109325.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: * /d table_name (or) \d+ table_name
es: *d nombre_tabla (o)\d+nombre_tabla
ja: *d table_name (or)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* / d table_name (또는) \ d + table_name</font></font>
ru: *d table_name (или)\d+table_name
zh_cn: *d table_name (或)d+table_name

source: *Using PG admin3
es: *Utilizando PG admin3
ja: *PG admin3を使用しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* PG admin3 사용</font></font>
zh_cn: *使用PG管理3

source: /d command and /d+ we can get the details of a table. The sysntax will be like
es: /d y d+podemos obtener los detalles de una tabla.El sysntax será como
ja: /dコマンドとd+でテーブルの詳細を取得することができます。sysntaxは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">/ d 명령과 / d +는 테이블의 세부 정보를 얻을 수 있습니다. </font><font style="vertical-align: inherit;">sysntax는 다음과 같습니다</font></font>
ru: Команда /d и d+мы можем получить детали таблицы.Синтаксис будет похож на
zh_cn: /d命令和d+我们可以得到一个表的详细信息。sysntax将是这样的

source: /dt is the commad which lists you all the tables present in a database. using
es: /dt es el commad que te enumera todas las tablas presentes en una base de datos.usando
ja: /dt はデータベースに存在するすべてのテーブルを一覧表示するコンマです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">/ dt는 데이터베이스에있는 모든 테이블을 나열하는 쉼표입니다. </font><font style="vertical-align: inherit;">사용</font></font>
ru: /dt-это запятая,которая перечисляет все таблицы,присутствующие в базе данных с использованием
zh_cn: /dt是列出数据库中所有的表。

source: <strong>1) PostgreSQL DESCRIBE TABLE using psql</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) TABLA DE DESCRIPCI&Oacute;N PostgreSQL usando psql</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）psqlを使用したPostgreSQL DESCRIBE TABLE</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) psql을 사용한 PostgreSQL DESCRIBE TABLE</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) PostgreSQL DESCRIBE TABLE с использованием psql</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）使用psql的PostgreSQL DESCRIBE TABLE</font></font></strong>

source: <strong>2) PostgreSQL DESCRIBE TABLE using information_schema</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) TABLA DE DESCRIPCI&Oacute;N PostgreSQL usando informaci&oacute;n_esquema</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）information_schemaを使用したPostgreSQL DESCRIBE TABLE</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) information_schema를 사용한 PostgreSQL DESCRIBE TABLE</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) PostgreSQL DESCRIBE TABLE с использованием information_schema</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）使用information_schema的PostgreSQL DESCRIBE TABLE</font></font></strong>

source: <strong>SELECT COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH from INFORMATION_SCHEMA.COLUMNS where table_name = 'tablename';</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELECCIONE COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH de INFORMATION_SCHEMA.COLUMNS donde table_name = 'tablename';</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SELECT_COLUMN_NAME、DATA_TYPE、CHARACTER_MAXIMUM_LENGTH from INFORMATION_SCHEMA.COLUMNS where table_name = 'tablename';</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">INFORMATION_SCHEMA.COLUMNS에서 COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH를 선택하십시오. 여기서 table_name = 'tablename';</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ВЫБЕРИТЕ COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH из INFORMATION_SCHEMA.COLUMNS, где table_name = 'tablename';</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从INFORMATION_SCHEMA.COLUMNS中选择COLUMN_NAME，DATA_TYPE，CHARACTER_MAXIMUM_LENGTH，其中table_name ='tablename';</font></font></strong>

source: Expmple : My table has 2 columns name and pwd. Giving screenshot below.
es: Expmple:Mi tabla tiene 2 columnas nombre y pwd.Dando una captura de pantalla abajo.
ja: Expmple:私のテーブルには、名前とパスワードの2つの列があります。以下のスクリーンショットを与える。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Expmple : 내 테이블에는 2 개의 열 이름과 암호가 있습니다. </font><font style="vertical-align: inherit;">아래 스크린 샷 제공.</font></font>
ru: Expmple:Мой стол имеет 2 колонки с именем и pwd.Снимок экрана ниже.
zh_cn: Expmple:我的表有2个列name和pwd。给出下面的截图。

source: For more information <a href="https://www.postgresqltutorial.com/postgresql-describe-table/">https://www.postgresqltutorial.com/postgresql-describe-table/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para m&aacute;s informaci&oacute;n </font></font><a href="https://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細については、</font></font><a href="https://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https：//www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 </font></font><a href="https://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для получения дополнительной информации </font></font><a href="https://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关更多信息，</font></font><a href="https://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请访问https://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>

source: How do you perform the equivalent of Oracle's <code>DESCRIBE TABLE</code> in PostgreSQL (using the psql command)?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo realiza el equivalente de </font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Oracle </font><font style="vertical-align: inherit;">en PostgreSQL (usando el comando psql)?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Oracleの</font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">相当するものを</font><font style="vertical-align: inherit;">PostgreSQLで</font><font style="vertical-align: inherit;">どのように実行しますか</font><font style="vertical-align: inherit;">（psqlコマンドを使用）？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL에서 </font><font style="vertical-align: inherit;">Oracle의 </font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 동등한 성능을 어떻게 수행합니까 </font><font style="vertical-align: inherit;">(psql 명령 사용)?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как вы выполняете эквивалент Oracle </font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в PostgreSQL (с помощью команды psql)?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您如何</font><font style="vertical-align: inherit;">在PostgreSQL中</font><font style="vertical-align: inherit;">执行等效于Oracle的</font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（使用psql命令）？</font></font>

source: I worked out the following script for get table schema.
es: He elaborado el siguiente guión para obtener el esquema de la tabla.
ja: テーブルスキーマを取得するためのスクリプトは以下のようにしました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">get 테이블 스키마를 위해 다음 스크립트를 해결했습니다.</font></font>
ru: Я разработал следующий сценарий,чтобы получить схему таблицы.
zh_cn: 我想出了下面的脚本,用于get table schema。

source: If you replace tbl_name and col_name, it displays data type of the particular coloumn that you looking for.
es: Si reemplazas tbl_name y col_name,muestra el tipo de datos del color particular que estás buscando.
ja: tbl_nameとcol_nameを置き換えると、探している特定のcoloumnのデータ型を表示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tbl_name 및 col_name을 바꾸면 찾고자하는 특정 열의 데이터 유형이 표시됩니다.</font></font>
ru: Если вы заменяете tbl_name и col_name,то отображается тип данных конкретного столбца,который вы ищете.
zh_cn: 如果你替换掉tbl_name和col_name,它会显示你要找的特定coloumn的数据类型。

source: If you want to obtain it from query instead of psql, you can query the catalog schema. Here's a complex query that does that:
es: Si quiere obtenerlo de la consulta en lugar de psql,puede consultar el esquema del catálogo.Aquí hay una consulta compleja que hace eso:
ja: psqlではなくqueryから取得したい場合は、カタログスキーマをクエリで取得することができます。それを行う複雑なクエリを以下に示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">psql 대신 쿼리에서 가져 오려면 카탈로그 스키마를 쿼리 할 수 ​​있습니다. </font><font style="vertical-align: inherit;">이를 수행하는 복잡한 쿼리는 다음과 같습니다.</font></font>
ru: Если вы хотите получить его из запроса вместо psql,вы можете запросить схему каталога.Вот сложный запрос,который делает это:
zh_cn: 如果你想从查询中获取,而不是psql,你可以查询目录模式。这里有一个复杂的查询可以做到这一点。

source: In <strong>MySQL</strong> , DESCRIBE table_name
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , DESCRIBE nombre_tabla</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、table_nameの記述</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , TABLE_NAME을 DESCRIBE</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> DESCRIBE имя_таблицы</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，DESCRIBE table_name</font></font>

source: In <strong>PostgreSQL</strong> , \d table_name
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , \ d nombre_tabla</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQLの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、\ dはTABLE_NAME</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 PostgreSQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> \ D TABLE_NAME</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> \ d имя_таблицы</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，\ d table_name</font></font>

source: In addition to the PostgreSQL way (\d 'something' or \dt 'table' or \ds 'sequence' and so on)
es: Además de la forma PostgreSQL (\d 'algo' o \dt 'tabla' o \dt 'secuencia' y así sucesivamente)
ja: さらに、PostgreSQLの方法(\d 'something' or \dt 'table' or \ds 'sequence' and so on)に加えて、以下のような方法でも、PostgreSQLを使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL 방식 외에도 (\ d 'something'또는 \ dt 'table'또는 \ ds 'sequence'등)</font></font>
ru: В дополнение к способу PostgreSQL (\d 'что-то' или \dt 'таблица' или \ds 'последовательность' и так далее).
zh_cn: 除了PostgreSQL的方式(d'something'或d't'table'或d's'sequence'等)之外

source: In addition to the command line <code>\d+ &lt;table_name&gt;</code> you already found, you could also use the <a href="http://www.postgresql.org/docs/current/static/information-schema.html">information-schema</a> to look up the column data, using <a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html">info_schema.columns</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s de la l&iacute;nea de comando </font></font> <code>\d+ &lt;table_name&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que ya encontr&oacute;, tambi&eacute;n puede usar el </font></font><a href="http://www.postgresql.org/docs/current/static/information-schema.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esquema de informaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para buscar los datos de la columna, usando </font></font><a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">info_schema.columns</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すでに見つけ</font><font style="vertical-align: inherit;">たコマンドライン</font></font> <code>\d+ &lt;table_name&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加えて、</font><a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html"><font style="vertical-align: inherit;">info_schema.columnsを</font></a><font style="vertical-align: inherit;">使用して、</font></font><a href="http://www.postgresql.org/docs/current/static/information-schema.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情報スキーマ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して列データを検索する</font><font style="vertical-align: inherit;">こともでき</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 찾은 </font><font style="vertical-align: inherit;">명령 줄 </font></font> <code>\d+ &lt;table_name&gt;</code> <font style="vertical-align: inherit;"><a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html"><font style="vertical-align: inherit;">외에도 info_schema.columns를</font></a><font style="vertical-align: inherit;"> 사용하여 </font></font><a href="http://www.postgresql.org/docs/current/static/information-schema.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정보 스키마</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 열 데이터를 조회 </font><font style="vertical-align: inherit;">할 수 있습니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В дополнение к командной строке </font></font> <code>\d+ &lt;table_name&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы уже нашли, вы также можете использовать </font></font><a href="http://www.postgresql.org/docs/current/static/information-schema.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">информационную схему</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для поиска данных столбца, используя </font></font><a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">info_schema.columns</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除了</font><font style="vertical-align: inherit;">已经找到</font><font style="vertical-align: inherit;">的命令行</font></font> <code>\d+ &lt;table_name&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您还可以</font><font style="vertical-align: inherit;">使用</font><a href="http://www.postgresql.org/docs/current/static/infoschema-columns.html"><font style="vertical-align: inherit;">info </font></a></font><a href="http://www.postgresql.org/docs/current/static/information-schema.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-schema</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">info_schema.columns查找信息。</font></font>

source: In psql command line tool, <strong>\d table_name</strong> or <strong>\d+ table_name</strong> to find the information on columns of a table
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En la herramienta de l&iacute;nea de comando psql, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d nombre_tabla</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d + nombre_tabla</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para encontrar la informaci&oacute;n en las columnas de una tabla</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">psqlコマンドラインツールで、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d + table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して、テーブルの列に関する情報を検索します</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">psql 명령 행 도구에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d + table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하여 테이블의 열에 대한 정보를 찾으십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В инструменте командной строки psql </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d + table_name,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы найти информацию о столбцах таблицы</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在psql命令行工具中，使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">\ d + table_name</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查找有关表列的信息</font></font>

source: It also works for other objects:
es: También funciona para otros objetos:
ja: 他のオブジェクトにも対応しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 객체에서도 작동합니다.</font></font>
ru: Он также работает для других объектов:
zh_cn: 它对其他对象也很有效。
