Repository: rueisnom/feedback
Catalog: xlf/10/93/25/109325.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It's described here in details: <a href="http://www.postgresqltutorial.com/postgresql-describe-table/">http://www.postgresqltutorial.com/postgresql-describe-table/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se describe aqu&iacute; en detalles: </font></font><a href="http://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細はこちら：</font><a href="http://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.postgresqltutorial.com/postgresql-describe-table/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 자세하게 설명되어 있습니다 : </font></font><a href="http://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это подробно описано здесь: </font></font><a href="http://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.postgresqltutorial.com/postgresql-describe-table/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处详细介绍：</font><a href="http://www.postgresqltutorial.com/postgresql-describe-table/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.postgresqltutorial.com/postgresql-describe-table/</font></font>

source: It's pretty complex but it does show you the power and flexibility of the PostgreSQL system catalog and should get you on your way to pg_catalog mastery ;-). Be sure to change out the %s's in the query. The first is Schema and the second is the table name.
es: Es bastante complejo pero muestra el poder y la flexibilidad del catálogo del sistema PostgreSQL y debería llevarte a dominar el pg_catalog ;-).Asegúrate de cambiar los %s en la consulta.El primero es Schema y el segundo es el nombre de la tabla.
ja: これは非常に複雑ですが、PostgreSQLシステムカタログの力と柔軟性を示すものであり、pg_catalogを使いこなせるようになるまでの道のりを示しています。)クエリ内の%sを必ず変更してください。1つ目はスキーマで、2つ目はテーブル名です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">꽤 복잡하지만 PostgreSQL 시스템 카탈로그의 성능과 유연성을 보여 주므로 pg_catalog 마스터리 ;-)로 이동하십시오. </font><font style="vertical-align: inherit;">쿼리에서 % s를 변경하십시오. </font><font style="vertical-align: inherit;">첫 번째는 스키마이고 두 번째는 테이블 이름입니다.</font></font>
ru: Это довольно сложный процесс,но он показывает вам мощь и гибкость системного каталога PostgreSQL и должен привести вас на пути к освоению pg_catalog ;-).Не забудьте изменить %s в запросе.Первое-это Схема,а второе-имя таблицы.
zh_cn: 这很复杂,但它确实向你展示了PostgreSQL系统目录的功能和灵活性,应该能让你在pg_catalog的道路上一展身手;-)。一定要把查询中的%s改掉。第一个是Schema,第二个是表名。

source: It's supported by many db engines.
es: Está soportado por muchos motores db.
ja: 多くのdbエンジンでサポートされています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 DB 엔진에서 지원됩니다.</font></font>
ru: Она поддерживается многими db-двигателями.
zh_cn: 它得到了很多db引擎的支持。

source: Or , you can use this long command:
es: O,puedes usar este comando largo:
ja: または、この長いコマンドを使うこともできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는이 긴 명령을 사용할 수 있습니다.</font></font>
ru: Или,ты можешь использовать эту длинную команду:
zh_cn: 或者,你可以使用这个长命令。

source: PostgreSQL “DESCRIBE TABLE”
es: PostgreSQL "TABLA DE DESCRIPCIÓN"
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PostgreSQL&ldquo;DESCRIBE TABLE&rdquo;</font></font>
ru: PostgreSQL "ОПИСАНИЕ ТАБЛИЦЫ"

source: SELECT statement to query the column_names,datatype,character maximum length of the columns table in the information_schema database;
es: Sentencia SELECT para consultar los nombres de las columnas,el tipo de datos y la longitud máxima de los caracteres de la tabla de columnas en la base de datos del esquema de información;
ja: information_schemaデータベース内のカラムテーブルのcolumn_names,datatype,character maximum lengthを問い合わせるためのSELECT文です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">information_schema 데이터베이스에서 column_names, datatype, columns 테이블의 문자 최대 길이를 쿼리하는 SELECT 문.</font></font>
ru: SELECT-запрос имен столбцов,типа данных,символьной максимальной длины таблицы столбцов в базе данных information_schema;
zh_cn: SELECT语句,用于查询information_schema数据库中的列名、数据类型、字符最大长度的列表。

source: See <a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS">the manual</a> for more info.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vea </font></font><a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el manual</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para m&aacute;s informaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細</font></font><a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はマニュアル</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">参照し</font><font style="vertical-align: inherit;">て</font><font style="vertical-align: inherit;">ください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용 </font></font><a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은 설명서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 참조하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите </font></font><a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">руководство</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для получения дополнительной информации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关</font><font style="vertical-align: inherit;">更多信息，</font><font style="vertical-align: inherit;">请参见</font></font><a href="http://www.postgresql.org/docs/current/interactive/app-psql.html#APP-PSQL-META-COMMANDS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">手册</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: See the psql portion of the PostgreSQL manual for more details.
es: Vea la porción psql del manual de PostgreSQL para más detalles.
ja: 詳細はPostgreSQLマニュアルのpsql部分を参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 PostgreSQL 매뉴얼의 psql 부분을 참조하십시오.</font></font>
ru: Более подробная информация приведена в psql части руководства PostgreSQL.
zh_cn: 详情请参阅PostgreSQL手册中的psql部分。

source: Source: <a href="http://www.faqs.org/docs/ppbook/c4890.htm">faqs.org</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font><a href="http://www.faqs.org/docs/ppbook/c4890.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">faqs.org</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出典：</font></font><a href="http://www.faqs.org/docs/ppbook/c4890.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">faqs.org</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 : </font></font><a href="http://www.faqs.org/docs/ppbook/c4890.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">faqs.org</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="http://www.faqs.org/docs/ppbook/c4890.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">faqs.org</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">资料来源：</font></font><a href="http://www.faqs.org/docs/ppbook/c4890.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">faqs.org</font></font></a>

source: The SQL standard way, as shown <a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513">here</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La forma est&aacute;ndar de SQL, como se muestra </font></font><a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示すように、SQL標準的な方法、</font></font><a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같이 SQL 표준 방법, </font></font><a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стандартный способ SQL, как показано </font></font><a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQL标准的方式，如图所示</font></font><a href="https://stackoverflow.com/questions/100504/what-is-the-sql-command-to-return-the-field-names-of-a-table#100513"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: The best way to describe a table such as a column, type, modifiers of columns, etc.
es: La mejor manera de describir una tabla como una columna,tipo,modificadores de columnas,etc.
ja: 列、型、列の修飾子などの表を記述するのに最適です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">열, 유형, 열 수정 자 등과 같은 테이블을 설명하는 가장 좋은 방법</font></font>
ru: Лучший способ описать такую таблицу,как столбец,тип,модификаторы столбцов и т.д.
zh_cn: 如列、类型、列的修饰符等表的最佳描述方式。

source: The psql equivalent of <code>DESCRIBE TABLE</code> is <code>\d table</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El equivalente psql de </font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font> <code>\d table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>DESCRIBE TABLE</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相当するpsql </font><font style="vertical-align: inherit;">は</font></font> <code>\d table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>DESCRIBE TABLE</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해당하는 psql </font><font style="vertical-align: inherit;">은 </font></font> <code>\d table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Psql-эквивалент </font></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font> <code>\d table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>DESCRIBE TABLE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的psql等效项</font><font style="vertical-align: inherit;">是</font></font> <code>\d table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: This should be the solution:
es: Esta debería ser la solución:
ja: これが解決策になるはずです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 해결책이어야합니다.</font></font>
ru: Это должно быть решением:
zh_cn: 这应该是解决问题的办法。

source: This variation of the query (as explained in other answers) worked for me.
es: Esta variación de la consulta (como se explica en otras respuestas)me funcionó.
ja: このクエリのバリエーションは、(他の回答で説明されているように)私のために機能しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 다른 변형 (다른 답변에서 설명)은 저에게 효과적이었습니다.</font></font>
ru: Этот вариант запроса (как объяснено в других ответах)сработал на меня.
zh_cn: 这种变化的查询(如其他答案中所解释的那样)对我有效。

source: To improve on the other answer's SQL query (which is great!), here is a revised query. It also includes constraint names, inheritance information, and a data types broken into it's constituent parts (type, length, precision, scale). It also filters out columns that have been dropped (which still exist in the database).
es: Para mejorar la consulta SQL de la otra respuesta (¡lo cual es genial!),aquí hay una consulta revisada.También incluye nombres de restricciones,información sobre la herencia,y un tipo de datos divididos en sus partes constituyentes (tipo,longitud,precisión,escala).También filtra las columnas que se han eliminado (que todavía existen en la base de datos).
ja: 他の回答のSQLクエリ(これは素晴らしい!)を改善するために、ここにクエリを修正しました。また、制約名、継承情報、データ型を構成部分(型、長さ、精度、スケール)に分解したものも含まれています。また、削除されたカラム(データベース内にまだ存在するカラム)をフィルタリングしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 답변의 SQL 쿼리를 개선하기 위해 (좋은!) 수정 된 쿼리가 있습니다. </font><font style="vertical-align: inherit;">또한 제약 조건 이름, 상속 정보 및 구성 부분으로 분류 된 데이터 유형 (유형, 길이, 정밀도, 스케일)이 포함됩니다. </font><font style="vertical-align: inherit;">또한 삭제 된 열 (여전히 데이터베이스에 존재)을 필터링합니다.</font></font>
ru: Для улучшения SQL-запроса другого ответа (что здорово!),вот пересмотренный запрос.Он также включает в себя имена ограничений,информацию о наследовании и типы данных,разбитых на составные части (тип,длина,точность,масштаб).Он также отфильтровывает отсеянные столбцы (которые до сих пор существуют в базе данных).
zh_cn: 为了改进其他答案的SQL查询(这很好!),下面是一个修改后的查询。它还包括了约束名称,继承信息,以及数据类型的构成部分(类型,长度,精度,比例)。它还过滤掉了被删除的列(在数据库中仍然存在)。

source: Try this (in the <code>psql</code> command-line tool):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pruebe esto (en la </font><font style="vertical-align: inherit;">herramienta de l&iacute;nea de comandos </font></font> <code>psql</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>psql</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドラインツールで）</font><font style="vertical-align: inherit;">これを試してください</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>psql</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 줄 도구 </font><font style="vertical-align: inherit;">에서 다음을 시도하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попробуйте это (в </font><font style="vertical-align: inherit;">инструменте командной строки </font></font> <code>psql</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试以下操作（在</font></font> <code>psql</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令行工具中）：</font></font>

source: Use the following SQL statement
es: Utilice la siguiente declaración SQL
ja: 次のSQL文を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 SQL 문을 사용하십시오.</font></font>
ru: Используйте следующий SQL-оператор
zh_cn: 使用下面的SQL语句

source: You can also check using below query
es: También puede comprobar usando la siguiente consulta
ja: また、以下のクエリを使用して確認することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 쿼리를 사용하여 확인할 수도 있습니다</font></font>
ru: Вы также можете проверить,используя нижеприведенный запрос
zh_cn: 您还可以使用以下查询

source: You can do that with a psql slash command:
es: Puedes hacer eso con un comando de barra psql:
ja: これはpsqlのスラッシュコマンドで行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">psql slash 명령으로이를 수행 할 수 있습니다.</font></font>
ru: Вы можете сделать это с помощью команды psql slash:
zh_cn: 你可以用psql的斜线命令来做。

source: You can use this :
es: Puedes usar esto:
ja: これを使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 사용할 수 있습니다 :</font></font>
ru: Вы можете использовать это :
zh_cn: 你可以使用这个 :

source: You may do a <code>\d *search pattern *</code><strong>with asterisks</strong> to find tables that match the search pattern you're interested in.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede hacer un </font></font> <code>\d *search pattern *</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">con asteriscos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para encontrar tablas que coincidan con el patr&oacute;n de b&uacute;squeda que le interesa.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関心のある検索パターンに一致するテーブルを見つけるには</font><strong><font style="vertical-align: inherit;">、アスタリスク</font></strong><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">して</font></font> <code>\d *search pattern *</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実行します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 할 수 있습니다 </font></font> <code>\d *search pattern *</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">별표를</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 검색 패턴 당신에게있는 거 관심 분야에 맞는 테이블을 찾을 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете сделать </font></font> <code>\d *search pattern *</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">со звездочками,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы найти таблицы, соответствующие шаблону поиска, который вас интересует.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用</font></font> <code>\d *search pattern *</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加上星号</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来查找与您感兴趣的搜索模式匹配的表。</font></font>
