Repository: rueisnom/feedback
Catalog: xlf/23/80/37/43/23803743.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: But I've handled everything!
es: ¡Pero yo me he encargado de todo!
ja: しかし、私はすべてを処理してきました!
ko: 그러나 나는 모든 것을 처리했습니다!
ru: Но я со всем разобрался!
zh_cn: 但我已经处理好了一切!

source: But the pattern works!
es: ¡Pero el patrón funciona!
ja: でも、パターンが効いている!
ko: 그러나 패턴이 작동합니다!
ru: Но шаблон работает!
zh_cn: 但这个模式很有效!

source: How do I avoid it?
es: ¿Cómo lo evito?
ja: どうやって回避すればいいの?
ko: 어떻게 피할 수 있습니까?
ru: Как мне избежать этого?
zh_cn: 如何避免?

source: I was writing code that does something that looks like:
es: Estaba escribiendo un código que hace algo que parece:
ja: みたいなことをするコードを書いていました。
ko: 나는 다음과 같은 것을하는 코드를 작성하고있었습니다.
ru: Я писал код,который делает что-то похожее:
zh_cn: 我在写代码,做一些看起来像这样的事情。

source: If the other promise is rejected, this will happen unnoticed instead of being propagated to the new promise (where it would get handled) - and the new promise stays forever pending, which can induce leaks.
es: Si la otra promesa es rechazada,esto pasará desapercibido en lugar de ser propagado a la nueva promesa (donde se manejaría)-y la nueva promesa queda pendiente para siempre,lo que puede inducir fugas.
ja: 他方の約束が拒否された場合、これは新しい約束に伝搬される代わりに(処理される)気づかれずに起こります-そして、新しい約束は永遠に保留されたままであり、これはリークを誘発する可能性があります。
ko: 다른 약속이 거부되면, 이것은 새로운 약속 (처리 될 곳)으로 전파되는 대신 눈에 띄지 않게됩니다. 새로운 약속은 영원히 보류되어 누출을 유발할 수 있습니다.
ru: Если другое обещание будет отвергнуто,то это произойдет незамеченным,вместо того,чтобы быть переданным новому обещанию (где оно будет обработано)-и новое обещание останется в ожидании навсегда,что может привести к утечкам.
zh_cn: 如果另一个承诺被拒绝,这种情况会在不被注意到的情况下发生,而不是传播到新的承诺(在那里会得到处理)--而新的承诺会永远停留在悬而未决的状态,这可能会诱发泄密。

source: If you have found a need to compose some promises in a new way that is not supported by an existing helper function, writing your own function with unavoidable Deferreds should be your last option. Consider switching to a more featureful library, and/or file a bug against your current library. Its maintainer should be able to derive the composition from existing functions, implement a new helper function for you and/or help to identify the edge cases that need to be handled.
es: Si ha encontrado la necesidad de componer algunas promesas de una nueva forma que no esté apoyada por una función de ayuda existente,escribir su propia función con Deferreds inevitables debería ser su última opción.Considere la posibilidad de cambiar a una biblioteca con más funciones,o bien presente un error en su biblioteca actual.Su mantenedor debería ser capaz de derivar la composición de las funciones existentes,implementar una nueva función de ayuda para usted y/o ayudar a identificar los casos límite que deben ser tratados.
ja: もし、既存のヘルパー関数ではサポートされていない新しい方法でいくつかのプロミスを作成する必要性を見つけた場合、避けられないDeferredsを使って自分自身の関数を書くことが最後の選択肢になるはずです。より機能的なライブラリに乗り換えることを検討するか、現在のライブラリに対してバグを報告してください。メンテナは既存の関数から構成を導き出したり、あなたのために新しいヘルパー関数を実装したり、あるいは処理する必要があるエッジケースを特定するのを手伝ったりすることができるはずです。
ko: 기존 헬퍼 함수에서 지원하지 않는 새로운 방식으로 일부 약속을 작성해야하는 경우, 피할 수없는 지연으로 고유 한 함수를 작성하는 것이 마지막 옵션이어야합니다. 보다 유용한 라이브러리로 전환하거나 현재 라이브러리에 버그를 신고하십시오. 관리자는 기존 기능에서 컴포지션을 도출하고, 새로운 도우미 기능을 구현하고 /하거나 처리해야하는 에지 사례를 식별 할 수 있어야합니다.
ru: Если Вы нашли необходимость в составлении некоторых обещаний новым способом,который не поддерживается существующими вспомогательными функциями,то написание собственной функции с неизбежными деферредами должно быть Вашим последним вариантом.Подумайте о том,чтобы перейти на более функциональную библиотеку,а также или отправить ошибку против вашей текущей библиотеки.Ее сопровождающий должен быть в состоянии извлечь композицию из существующих функций,реализовать новую вспомогательную функцию для вас andor помочь определить крайние случаи,которые необходимо обработать.
zh_cn: 如果你发现需要用一种新的方式来编写一些承诺,而现有的帮助函数不支持的话,那么编写自己的函数,加上不可避免的Deferreds应该是你最后的选择。考虑切换到一个功能更强大的库,或者对你当前的库提出bug。它的维护者应该能够从现有的函数中推导出组成,为你实现一个新的辅助函数,或者帮助你识别需要处理的边缘情况。

source: In contrast, using <code>.then()</code> does automatically take care of both these scenarios, and rejects the new promise when an error happens:
es: Por el contrario, el uso de <code>.then()</code> ocupa autom&aacute;ticamente de estos dos escenarios y rechaza la nueva promesa cuando ocurre un error:
ja: 対照的に、 <code>.then()</code> を使用すると、これらの両方のシナリオが自動的に処理され、エラーが発生すると新しいプロミスが拒否されます。
ko: 반대로 <code>.then()</code> 사용 하면 두 시나리오를 자동으로 처리하고 오류가 발생하면 새로운 약속을 거부합니다.
ru: Напротив, использование <code>.then()</code> автоматически позаботится об обоих этих сценариях и отклонит новое обещание при возникновении ошибки:
zh_cn: 相反，使用 <code>.then()</code> 会自动处理这两种情况，并在发生错误时拒绝新的承诺：

source: Lucky you. Unfortunately, it probably doesn't, as you likely forgot some edge case. In more than half of the occurrences I've seen, the author has forgotten to take care of the error handler:
es: Qué afortunado.Desafortunadamente,probablemente no lo hace,ya que probablemente olvidaste algún caso límite.En más de la mitad de los casos que he visto,el autor ha olvidado ocuparse del manejador de errores:
ja: 運がいいわね 残念ながら、おそらくエッジケースを忘れているのでしょう。私が見てきた事例の半分以上では、作者はエラーハンドラの処理を忘れていました。
ko: 운이 좋다 불행히도, 일부 경우를 잊어 버렸을 가능성이 높습니다. 내가 본 사건의 절반 이상에서 저자는 오류 처리기를 처리하는 것을 잊었습니다.
ru: Повезло тебе.К сожалению,скорее всего,нет,так как ты,скорее всего,забыл какой-нибудь крайний случай.Более чем в половине случаев,которые я видел,автор забыл позаботиться об обработчике ошибок:
zh_cn: 你很幸运。不幸的是,它可能没有,因为你很可能忘记了一些边缘情况。在我见过的超过一半的情况下,作者忘记了对错误处理程序的照顾。

source: Promises are all about making asynchronous code more readable and behave like synchronous code without hiding that fact. Promises represent an abstraction over a value of one time operation, they abstract the notion of a statement or expression in a programming language.
es: Las promesas se refieren a hacer más legible el código asíncrono y a comportarse como un código síncrono sin ocultar ese hecho.Las promesas representan una abstracción sobre un valor de una operación de tiempo,abstraen la noción de una declaración o expresión en un lenguaje de programación.
ja: プロミスは、非同期コードをより読みやすくし、その事実を隠すことなく同期コードのように振る舞うことができるようにするためのものです。プロミスは1回の操作の値を抽象化したもので、プログラミング言語の文や式の概念を抽象化したものです。
ko: 약속은 비동기 코드를 더 읽기 쉽게 만들고 그 사실을 숨기지 않고 동기 코드처럼 동작하는 것입니다. 약속은 한 번의 연산 값에 대한 추상화를 나타내며, 프로그래밍 언어로 된 문장이나 표현의 개념을 추상화합니다.
ru: Обещания заключаются в том,чтобы сделать асинхронный код более читабельным и вести себя как синхронный код,не скрывая этого факта.Обещания представляют собой абстракцию над значением одноразовой операции,они абстрагируют понятие оператора или выражения в языке программирования.
zh_cn: 承诺的作用就是让异步代码更易读,表现得像同步代码一样,但又不掩盖这个事实。承诺代表了对一个时间操作的值的抽象,它们抽象了编程语言中的语句或表达式的概念。

source: Promises can chain with <code>.then</code> and you can return promises directly. Your code in <code>getStuffDone</code> can be rewritten as:
es: Las promesas pueden encadenarse con <code>.then</code> y usted puede devolverlas directamente. Su c&oacute;digo en <code>getStuffDone</code> puede reescribirse como:
ja: <code>.then</code> と連鎖でき、 Promiseを直接返すことができます。 <code>getStuffDone</code> のコードは、 次のように書き直すことができます。
ko: 약속은.와 <code>.then</code> 수 있으며 약속을 직접 반환 할 수 있습니다. <code>getStuffDone</code> 의 코드는 다음 과 같이 다시 작성할 수 있습니다.
ru: Обещания могут <code>.then</code> с .then, и вы можете возвращать обещания напрямую. Ваш код в <code>getStuffDone</code> может быть переписан как:
zh_cn: 承诺可以与 <code>.then</code> 链接 ，您可以直接返回承诺。 您在 <code>getStuffDone</code> 中的代码可以重写为：

source: Quoting Esailija:
es: Citando a Esailija:
ja: エサイリヤを引用して
ko: Esailija 인용 :
ru: Цитирую Эсаилию:
zh_cn: 引述Esailija的话:

source: Really? Good. However, this will be pretty detailed and copious, especially if you use a promise library that supports other features like cancellation or message passing. Or maybe it will in the future, or you want to swap your library against a better one? You won't want to rewrite your code for that.
es: ¿En serio? Bien.Sin embargo,esto será bastante detallado y copioso,especialmente si usas una biblioteca de promesas que soporte otras características como la cancelación o el paso de mensajes.O tal vez lo haga en el futuro,o quieres cambiar tu biblioteca por una mejor? No querrás reescribir tu código para eso.
ja: そうなの?いいですね。しかし、これはかなり詳細で膨大なものになるでしょう、特にキャンセルやメッセージパッシングのような他の機能をサポートしているプロミスライブラリを使用している場合には。あるいは、将来的にはそうなるかもしれませんし、ライブラリをより良いものと交換したいかもしれません。そのためにコードを書き換える必要はないでしょう。
ko: 정말? 좋은. 그러나 이는 특히 취소 또는 메시지 전달과 같은 다른 기능을 지원하는 약속 라이브러리를 사용하는 경우 매우 상세하고 풍부합니다. 아니면 미래에 또는 라이브러리를 더 나은 라이브러리로 바꾸고 싶습니까? 이를 위해 코드를 다시 작성하고 싶지 않을 것입니다.
ru: Правда? Хорошо.Тем не менее,это будет довольно подробно и много,особенно если вы используете библиотеку обещаний,которая поддерживает другие функции,такие как отмена или передача сообщений.Или,может быть,это будет в будущем,или вы хотите поменять вашу библиотеку на лучшую? Вы не захотите переписывать свой код для этого.
zh_cn: 真的吗?很好。然而,这将是相当详细和繁琐的,尤其是如果你使用的是支持其他功能的承诺库,比如取消或消息传递等功能的承诺库。或者说,也许它将来会支持,或者你想用更好的库来交换你的库?你不会想为此重写你的代码。

source: So whenever you find yourself manually creating a <code>Promise</code> or <code>Deferred</code> and already existing promises are involved, <strong>check the library API first</strong>. The Deferred antipattern is often applied by people who see promises [only] as an observer pattern - but <a href="https://stackoverflow.com/a/22562045/1048572">promises are <em>more</em> than callbacks</a>: they are supposed to be composable. Every decent library has lots of easy-to-use functions for the composition of promises in every thinkable manner, taking care of all the low-level stuff you don't want to deal with.
es: Por lo tanto, cada vez que se encuentre creando manualmente una <code>Promise</code> o una Promesa <code>Deferred</code> y ya est&eacute;n involucradas, <strong>consulte primero la API de la biblioteca</strong> . El antipatr&oacute;n diferido a menudo es aplicado por personas que ven las promesas [solo] como un patr&oacute;n de observaci&oacute;n, pero las <a href="https://stackoverflow.com/a/22562045/1048572">promesas son <em>m&aacute;s</em> que devoluciones de llamada</a> : se supone que son componibles. Cada biblioteca decente tiene muchas funciones f&aacute;ciles de usar para la composici&oacute;n de promesas de todas las maneras imaginables, cuidando todas las cosas de bajo nivel con las que no desea lidiar.
ja: そのため、手動で <code>Promise</code> または <code>Deferred</code> を作成していて、既存のPromiseが関係している<strong>場合は、最初にライブラリAPIを確認してください</strong> 。 Deferredアンチパターンは、promise [のみ]をオブザーバーパターンと見なす人々によって適用されることが多いですが、promiseは<a href="https://stackoverflow.com/a/22562045/1048572">コールバック<em>以上の</em>もので</a>あり、構成可能であると想定されています。 すべてのまともなライブラリには、扱いたくないすべての低レベルのものを処理しながら、あらゆる考えられる方法で約束を構成するための使いやすい関数がたくさんあります。
ko: 따라서 <code>Promise</code> 또는 <code>Deferred</code> 수동으로 작성하고 기존 약속이 포함 된 <strong>경우 라이브러리 API를 먼저 확인하십시오</strong> . 지연된 반 패턴은 종종 약속 만 관찰자 패턴으로 보는 사람들에 의해 적용되지만 <a href="https://stackoverflow.com/a/22562045/1048572">약속은 콜백 이상</a> 입니다. 모든 양질의 라이브러리에는 다루기 싫은 모든 하위 수준의 자료를 처리하면서 모든 생각할 수있는 방식으로 약속을 구성하는 데 사용하기 쉬운 많은 기능이 있습니다.
ru: Поэтому всякий раз, когда вы обнаруживаете, что создаете <code>Promise</code> или <code>Deferred</code> вручную, и уже задействованы уже существующие обещания, <strong>сначала проверьте библиотечный API</strong> . Отложенный антипаттерн часто применяется людьми, которые видят обещания [только] как образец наблюдателя - но <a href="https://stackoverflow.com/a/22562045/1048572">обещания - это <em>больше,</em> чем обратные вызовы</a> : они должны быть составными. Каждая приличная библиотека имеет множество простых в использовании функций для составления обещаний всеми возможными способами, заботясь обо всех вещах низкого уровня, с которыми вы не хотите иметь дело.
zh_cn: 因此，每当您发现自己手动创建 <code>Promise</code> 或 <code>Deferred</code> 并且涉及已经存在的Promise时 ， <strong>请首先检查库API</strong> 。 Deferred反模式通常由将promise（仅）视为观察者模式的人应用，但是<a href="https://stackoverflow.com/a/22562045/1048572">promise不仅仅是回调</a> ：它们应该是可组合的。 每个体面的图书馆都有许多易于使用的功能，以各种可想而知的方式来构成承诺，可以处理所有您不想处理的低级内容。

source: Someone told me this is called the "<strong>deferred antipattern</strong>" or the "<strong><code>Promise</code> constructor antipattern</strong>" respectively, what's bad about this code and why is this called an <a href="https://en.wikipedia.org/wiki/Anti-pattern">antipattern</a>?
es: Alguien me dijo que esto se llama " <strong>antipatr&oacute;n diferido</strong> " o " <strong>antipatr&oacute;n de constructor de promesas</strong> " respectivamente, &iquest;qu&eacute; tiene de malo este c&oacute;digo y por qu&eacute; se llama <a href="https://en.wikipedia.org/wiki/Anti-pattern">antipatr&oacute;n</a> ?
ja: これはそれぞれ「 <strong>遅延アンチパターン</strong> 」または「 <strong> <code>Promise</code> コンストラクタアンチパターン</strong> 」と呼ばれていると誰かから言われました。このコードの何が悪いのですか、なぜこれが<a href="https://en.wikipedia.org/wiki/Anti-pattern">アンチパターン</a>と呼ばれているのですか？
ko: 누군가 나에게 이것을 " <strong>지연된 반 패턴</strong> "또는 " <strong> <code>Promise</code> 생성자 반</strong> <strong>패턴</strong> "이라고 말했는데,이 코드에 대해 나쁜 점은 무엇이며 <a href="https://en.wikipedia.org/wiki/Anti-pattern">반 패턴</a> 이라고 불리는 이유는 무엇입니까?
ru: Кто-то сказал мне, что это называется &laquo; <strong>отложенным антипаттерном</strong> &raquo; или &laquo; <strong>антипаттерном конструктора <code>Promise</code> </strong> &raquo; соответственно, что плохого в этом коде и почему он называется <a href="https://en.wikipedia.org/wiki/Anti-pattern">антипаттерном</a> ?
zh_cn: 有人告诉我这分别称为&ldquo; <strong>延迟反模式</strong> &rdquo;或&ldquo; <strong> <code>Promise</code> 构造函数反模式</strong> &rdquo;，这段代码有什么不好之处，为什么<a href="https://en.wikipedia.org/wiki/Anti-pattern">又将</a>其称为反模式 ？

source: The <a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">deferred antipattern (now explicit-construction anti-pattern)</a> coined by <a href="https://stackoverflow.com/users/995876/esailija">Esailija</a> is a common anti-pattern people who are new to promises make, I've made it myself when I first used promises. The problem with the above code is that is fails to utilize the fact that promises chain.
es: El <a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">antipatr&oacute;n diferido (ahora antipatr&oacute;n de construcci&oacute;n expl&iacute;cita)</a> acu&ntilde;ado por <a href="https://stackoverflow.com/users/995876/esailija">Esailija</a> es un antipatr&oacute;n com&uacute;n que las personas que son nuevas en las promesas hacen, lo hice yo mismo cuando las us&eacute; por primera vez. El problema con el c&oacute;digo anterior es que no puede utilizar el hecho de que promete la cadena.
ja: <a href="https://stackoverflow.com/users/995876/esailija">Esailija</a>によって作られた<a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">延期されたアンチパターン（現在は明示的な構造のアンチパターン）</a>は、約束をするのが初めての一般的なアンチパターンの人々です。 上記のコードの問題は、チェーンを約束するという事実を利用できないことです。
ko: <a href="https://stackoverflow.com/users/995876/esailija">Esailija</a> 가 개발 한 <a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">연기 된 반 패턴 (현재 명시 적 구성 반 패턴)</a> 은 약속을 처음 접하는 일반적인 반 패턴 사람들입니다. 처음 약속을 사용할 때 직접 만들었습니다. 위의 코드의 문제점은 체인을 약속하는 사실을 활용하지 못한다는 것입니다.
ru: <a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">Отложенный антипаттерн (в настоящее время анти-паттерн явной конструкции),</a> придуманный <a href="https://stackoverflow.com/users/995876/esailija">Эсайлией,</a> является распространенным анти-паттерном людей, которые плохо знакомы с обещаниями, я сделал это сам, когда впервые использовал обещания. Проблема с приведенным выше кодом заключается в том, что он не использует тот факт, что обещает цепочку.
zh_cn: <a href="https://stackoverflow.com/users/995876/esailija">Esailija</a>创造的<a href="https://github.com/petkaantonov/bluebird/wiki/Promise-anti-patterns#the-deferred-anti-pattern">递延反模式（现在是显式构造反模式）</a>是一个新的对诺言做出新承诺的普通反模式人，当我第一次使用诺言时，我自己就做出了。 上面代码的问题是无法利用承诺链的事实。

source: The deferred antipattern is not only cumbersome, but also <strong>error-prone</strong>. Using <code>.then()</code> for chaining is much safer.
es: El antipatr&oacute;n diferido no solo es engorroso, sino tambi&eacute;n <strong>propenso a errores</strong> . Usar <code>.then()</code> para encadenar es mucho m&aacute;s seguro.
ja: 延期されたアンチパターンは扱いにくいだけでなく、 <strong>エラーが発生しやすくなり</strong>ます。 連鎖に <code>.then()</code> を使用すると、はるかに安全です。
ko: 지연된 반 패턴은 번거로울뿐만 아니라 <strong>오류가 발생하기 쉽습니다</strong> . 체인에 <code>.then()</code> 을 사용하는 것이 훨씬 안전합니다.
ru: Отложенный антипаттерн не только громоздок, но и <strong>подвержен ошибкам</strong> . Использование <code>.then()</code> для создания цепочек намного безопаснее.
zh_cn: 延迟的反模式不仅麻烦，而且<strong>容易出错</strong> 。 使用 <code>.then()</code> 进行链接要安全得多。

source: The libraries' methods (<code>then</code>) do not only natively support all the features, they also might have certain optimisations in place. Using them will likely make your code faster, or at least allow to be optimised by future revisions of the library.
es: Los m&eacute;todos de las bibliotecas ( <code>then</code> ) no solo admiten de forma nativa todas las caracter&iacute;sticas, sino que tambi&eacute;n pueden tener ciertas optimizaciones en su lugar. Su uso probablemente acelerar&aacute; su c&oacute;digo, o al menos permitir&aacute; que sea optimizado por futuras revisiones de la biblioteca.
ja: ライブラリのメソッド（）は、すべての機能をネイティブにサポートするだけでなく、特定の最適化を行っている場合もあります。 それらを使用すると、コードがより高速になるか、少なくともライブラリの将来のリビジョンで最適化できるようになります。
ko: 라이브러리의 메소드 ()는 모든 기능을 기본적으로 지원할뿐만 아니라 특정 최적화 기능을 갖추고있을 수도 있습니다. 그것들을 사용하면 코드가 더 빨라지거나 최소한 라이브러리의 개정판으로 최적화 될 수 있습니다.
ru: Методы библиотек ( <code>then</code> ) не только изначально поддерживают все функции, они также могут иметь определенные оптимизации. Их использование, скорее всего, сделает ваш код быстрее или, по крайней мере, позволит оптимизировать будущие изменения библиотеки.
zh_cn: 库的方法（ <code>then</code> ）不仅本地支持所有功能，而且还可能具有某些优化功能。 使用它们可能会使您的代码更快，或者至少允许通过该库的未来版本进行优化。

source: The same thing happens in the case that your callback code causes an error - e.g. when <code>result</code> doesn't have a <code>property</code> and an exception is thrown. That would go unhandled and leave the new promise unresolved.
es: Lo mismo sucede en el caso de que su c&oacute;digo de devoluci&oacute;n de llamada provoque un error, por ejemplo, cuando el <code>result</code> ado no tiene una <code>property</code> y se produce una excepci&oacute;n. Eso quedar&iacute;a sin control y dejar&iacute;a la nueva promesa sin resolver.
ja: コールバックコードでエラーが発生した場合も同じことが起こります。たとえば、 <code>result</code> <code>property</code> がなく、例外がスローされた場合などです。 それは処理されず、新しい約束は未解決のままになります。
ko: 콜백 코드에서 오류가 발생하는 경우에도 마찬가지입니다. 예를 들어 <code>result</code> 에 <code>property</code> 이없고 예외가 발생한 경우. 그것은 처리되지 않고 새 약속을 해결하지 않은 채로 둡니다.
ru: То же самое происходит в том случае, если ваш код обратного вызова вызывает ошибку - например, когда <code>result</code> не имеет <code>property</code> и генерируется исключение. Это было бы необработанным и оставило бы новое обещание нерешенным.
zh_cn: 在回调代码导致错误的情况下也会发生相同的事情-例如，当 <code>result</code> 没有 <code>property</code> 并且引发异常时。 那将无法处理，并使新的承诺无法实现。

source: This is the most common anti-pattern. It is easy to fall into this when you don't really understand promises and think of them as glorified event emitters or callback utility. Let's recap: promises are about making asynchronous code retain most of the lost properties of synchronous code such as flat indentation and one exception channel.
es: Este es el antipatrón más común.Es fácil caer en esto cuando no entiendes realmente las promesas y piensas en ellas como emisores de eventos glorificados o utilidad de devolución de llamada.Recapitulemos:las promesas se refieren a hacer que el código asíncrono retenga la mayoría de las propiedades perdidas del código síncrono como la indentación plana y un canal de excepción.
ja: これは最も一般的なアンチパターンです。プロミスをよく理解していなくて、プロミスを単なるイベントエミッタやコールバックユーティリティだと思っていると、このパターンに陥りやすくなります。要約すると、プロミスとは、同期コードで失われたフラットインデントや1つの例外チャンネルなどのプロパティを非同期コードに保持させることです。
ko: 이것은 가장 일반적인 안티 패턴입니다. 약속을 실제로 이해하지 못하고 약속을 영광스러운 이벤트 이미 터 또는 콜백 유틸리티로 생각할 때 여기에 빠지기 쉽습니다. 요약하자면 약속은 비동기 코드가 플랫 들여 쓰기 및 하나의 예외 채널과 같은 동기 코드의 손실 된 속성을 대부분 유지하도록하는 것입니다.
ru: Это самый распространенный анти-образец.В это легко попасть,если вы не понимаете обещаний и думаете о них,как о прославленных эмиттерах событий или утилитах обратного вызова.Резюмируя,обещания заключаются в том,чтобы заставить асинхронный код сохранить большую часть потерянных свойств синхронного кода,таких как плоский отступ и один канал исключений.
zh_cn: 这是最常见的反模式。当你不真正理解承诺的时候,很容易落入其中,把它们当成是美化的事件发射器或回调实用程序。让我们回顾一下:承诺就是让异步代码保留了同步代码的大部分丢失的属性,比如扁平化的缩进和一个异常通道。

source: What is the explicit promise construction antipattern and how do I avoid it
es: ¿Cuál es la promesa explícita antipatrón de construcción y cómo la evito?
ja: 明示的な約束構造のアンチパターンとは何か、それを回避するにはどうすればいいのか
ko: 명백한 약속 건설 반 패턴은 무엇이며 어떻게 피할 수 있습니까?
ru: Что является явным обещанием строительной антипатрии и как мне избежать этого.
zh_cn: 什么是显性承诺建设反例,如何避免?

source: What's wrong with it?
es: ¿Qué tiene de malo?
ja: 何が悪いの?
ko: 무슨 일이야?
ru: Что с ним не так?
zh_cn: 这有什么问题吗?

source: You should only use deferred objects when you are <a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">converting an API to promises</a> and can't do it automatically, or when you're writing aggregation functions that are easier expressed this way.
es: Solo debe usar objetos diferidos cuando <a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">convierte una API a promesas</a> y no puede hacerlo autom&aacute;ticamente, o cuando escribe funciones de agregaci&oacute;n que se expresan m&aacute;s f&aacute;cilmente de esta manera.
ja: <a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">APIをpromiseに変換</a>して自動的に実行できない場合、またはこの方法で簡単に表現できる集計関数を作成している場合にのみ、遅延オブジェクトを使用する必要があります 。
ko: <a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">API를 약속으로 변환하고</a> 이를 자동으로 수행 할 수 없거나 이러한 방식으로 표현하기 쉬운 집계 함수를 작성할 때만 지연된 오브젝트를 사용해야합니다.
ru: Вы должны использовать отложенные объекты только тогда, когда вы <a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">конвертируете API в обещания</a> и не можете делать это автоматически, или когда вы пишете функции агрегации, которые проще выразить таким образом.
zh_cn: 仅在<a href="https://stackoverflow.com/questions/22519784/how-do-i-convert-an-existing-callback-api-to-promises">将API转换为Promise</a>且无法自动执行时，或者在编写以这种方式表示的聚合函数时，才应使用延迟对象。
