Repository: rueisnom/feedback
Catalog: xlf/93/39/42/9/9339429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The current branch and HEAD pointer stay at the last commit successfully made.
es: La rama actual y el puntero de la CABEZA se mantienen en el último compromiso hecho con éxito.
ja: 現在のブランチとHEADポインタは、最後のコミットに成功した時のままです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 브랜치 및 HEAD 포인터는 성공적으로 마지막으로 커밋 된 상태를 유지합니다.</font></font>
ru: Текущая ветка и указатель HEAD остаются на последнем успешно выполненном коммите.
zh_cn: 当前分支和head指针停留在最后一次提交成功时。

source: The same animated:
es: El mismo animado:
ja: 同じくアニメ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은 애니메이션 :</font></font>
ru: Такой же анимированный:
zh_cn: 同样的动画。

source: This is in contrast with other ways such as <code>merge</code> and <code>rebase</code> which normally apply many commits onto another branch.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto contrasta con otras formas, como </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>rebase</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que normalmente aplican muchas confirmaciones en otra rama.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、</font><font style="vertical-align: inherit;">通常は多くのコミットを別のブランチに適用する</font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などの他の方法とは対照的</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">일반적으로 다른 커밋에 많은 커밋을 적용하는 </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같은 다른 방법과 대조됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это контрастирует с другими способами, такими как </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которые обычно применяют множество коммитов к другой ветви.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这与其他方法（例如</font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">形成对比，</font><font style="vertical-align: inherit;">后者通常将许多提交应用于另一个分支。</font></font>

source: This means :
es: Esto significa..:
ja: これはつまり
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 다음을 의미합니다.</font></font>
ru: Это означает :
zh_cn: 这意味着 :

source: This quote is taken from; <a href="https://rads.stackoverflow.com/amzn/click/com/1449316387">Version Control with Git</a> (Really great book, I encourage you to buy it if you are interested in git)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta cita est&aacute; tomada de; </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/1449316387"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Control de versiones con Git</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (libro realmente genial, te animo a que lo compres si est&aacute;s interesado en git)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この引用は、 </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/1449316387"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gitを使用したバージョン管理</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> （本当にすばらしい本です。gitに興味がある場合は購入することをお勧めします）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 인용문은 다음과 같습니다. </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/1449316387"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git을 사용한 버전 관리</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (정말 훌륭한 책, git에 관심이 있다면 구입하는 것이 좋습니다)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Эта цитата взята из; </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/1449316387"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контроль версий с помощью Git</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Действительно отличная книга, я рекомендую вам купить ее, если вы заинтересованы в git)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用来自： </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/1449316387"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用Git进行版本控制</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> （非常不错的书，如果您对git感兴趣，我建议您购买它）</font></font>

source: This way you will merge 3rd commit from the end of master.
es: De esta manera fusionarás el tercer compromiso del final del maestro.
ja: このようにして、masterの最後から3番目のコミットをマージします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이렇게하면 마스터의 끝에서 세 번째 커밋을 병합합니다.</font></font>
ru: Таким образом,вы объедините 3-ий коммит с концом мастера.
zh_cn: 这样一来,你将从主控端合并第3个提交。

source: This will generate a standardized commit message. This way, you (and your co-workers) can still keep track of the origin of the commit and may avoid merge conflicts in the future.
es: Esto generará un mensaje de confirmación estandarizado.De esta forma,usted (y sus compañeros)podrán seguir la pista del origen de la confirmación y podrán evitar conflictos de fusión en el futuro.
ja: これにより、標準化されたコミットメッセージが生成されます。この方法では、あなた (とあなたの同僚)はコミットの元を追跡することができ、将来的にマージの衝突を回避することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준화 된 커밋 메시지가 생성됩니다. </font><font style="vertical-align: inherit;">이런 식으로, 귀하 (및 동료)는 여전히 커밋의 출처를 추적 할 수 있으며 향후 병합 충돌을 피할 수 있습니다.</font></font>
ru: Это сгенерирует стандартное сообщение о фиксации.Таким образом,вы (и ваши коллеги)всё ещё можете отслеживать происхождение коммита и избежать конфликтов слияния в будущем.
zh_cn: 这将生成一个标准化的提交消息。这样一来,你(和你的同事)仍然可以追踪到提交的来源,并可能避免将来发生合并冲突。

source: To use it, you just need <code>git cherry-pick hash</code>, where <code>hash</code> is a commit hash from other branch.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para usarlo, solo necesita </font></font> <code>git cherry-pick hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , donde </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un hash de confirmaci&oacute;n de otra rama.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを使用するには、</font></font> <code>git cherry-pick hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が必要です</font><font style="vertical-align: inherit;">。ここで、</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は他のブランチからのコミットハッシュです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 사용하려면 </font></font> <code>git cherry-pick hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 필요합니다 </font><font style="vertical-align: inherit;">. 여기서 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 다른 브랜치의 커밋 해시입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы использовать его, вам просто нужен </font></font> <code>git cherry-pick hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , где </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - хеш коммита из другой ветки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要使用它，您只需要</font></font> <code>git cherry-pick hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其中</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是来自其他分支的提交哈希。</font></font>

source: Using git cherry-pick The command git cherry-pick commit applies the changes introduced by the named commit on the current branch. It will introduce a new, distinct commit. <strong>Strictly speaking, using git cherry-pick doesn&rsquo;t alter the existing history within a repository; instead, it adds to the history. As with other Git operations that introduce changes via the process of applying a diff, you may need to resolve conflicts to fully apply the changes from the given commit</strong> . The command git cherry-pick is typically used to introduce particular commits from one branch within a repository onto a different branch. A common use is to forward- or back-port commits from a maintenance branch to a development branch.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uso de git cherry-pick El comando git cherry-pick commit aplica los cambios introducidos por el commit con nombre en la rama actual. Introducir&aacute; una nueva confirmaci&oacute;n distinta. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hablando estrictamente, el uso de git cherry-pick no altera el historial existente dentro de un repositorio; en cambio, se agrega a la historia. Al igual que con otras operaciones de Git que introducen cambios a trav&eacute;s del proceso de aplicaci&oacute;n de un diff, es posible que deba resolver conflictos para aplicar completamente los cambios de la confirmaci&oacute;n dada</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . El comando git cherry-pick se usa generalmente para introducir confirmaciones particulares de una rama dentro de un repositorio en una rama diferente. Un uso com&uacute;n es reenviar las confirmaciones de puerto de una rama de mantenimiento a una rama de desarrollo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git cherry-pickコマンドの使用git cherry-pick commitコマンドは、現在のブランチの名前付きコミットによって導入された変更を適用します。これは、新しい明確なコミットを導入します。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">厳密に言うと、git cherry-pickを使用しても、リポジトリ内の既存の履歴は変更されません。代わりに、履歴に追加されます。差分を適用するプロセスを介して変更を導入する他のGit操作と同様に、特定のcommitからの変更を完全に適用するには、競合を解決する必要がある場合があります</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。コマンドgit cherry-pickは通常、リポジトリ内の1つのブランチから別のブランチに特定のコミットを導入するために使用されます。一般的な用途は、メンテナンスブランチから開発ブランチにコミットを転送またはバックポートすることです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git cherry-pick 사용 git cherry-pick commit 명령은 현재 브랜치에서 명명 된 commit에 의해 도입 된 변경 사항을 적용합니다. </font><font style="vertical-align: inherit;">새롭고 뚜렷한 커밋을 소개합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">엄밀히 말하면, git cherry-pick을 사용해도 저장소 내의 기존 기록이 변경되지 않습니다. </font><font style="vertical-align: inherit;">대신 기록에 추가됩니다. </font><font style="vertical-align: inherit;">diff를 적용하는 과정을 통해 변경 사항을 발생시키는 다른 Git 작업과 마찬가지로 충돌을 해결하여 주어진 commit의 변경 사항을 완전히 적용해야 할 수도 있습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">git cherry-pick 명령은 일반적으로 저장소 내의 한 분기에서 다른 분기로 특정 커밋을 도입하는 데 사용됩니다. </font><font style="vertical-align: inherit;">일반적으로 유지 보수 브랜치에서 개발 브랜치로 포워드 또는 백 포트 커밋을 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование git cherry-pick Команда git cherry-pick commit применяет изменения, внесенные именованным коммитом в текущую ветку. Это введет новый, отличный коммит. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Строго говоря, использование git cherry-pick не меняет существующую историю в репозитории; вместо этого это добавляет к истории. Как и в случае других операций Git, которые вносят изменения через процесс применения diff, вам может потребоваться разрешить конфликты, чтобы полностью применить изменения из данного коммита</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Команда git cherry-pick обычно используется для введения определенных коммитов из одной ветки в хранилище в другую ветку. Распространенным использованием является перенаправление или резервирование коммитов из ветви обслуживания в ветку разработки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用git cherry-pick命令git cherry-pick commit将在当前分支上应用由命名提交引入的更改。它将引入一个新的，独特的提交。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">严格来说，使用git cherry-pick不会改变存储库中的现有历史记录；相反，它增加了历史记录。与其他通过diff引入更改的Git操作一样，您可能需要解决冲突才能完全应用给定commit的更改</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 git cherry-pick命令通常用于将特定提交从存储库中的一个分支引入到另一个分支。通常的用途是将提交从维护分支转发或反向移植到开发分支。</font></font>

source: Visit <a href="https://git-scm.com/docs/git-cherry-pick">https://git-scm.com/docs/git-cherry-pick</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visita </font></font><a href="https://git-scm.com/docs/git-cherry-pick"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://git-scm.com/docs/git-cherry-pick</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">訪問</font></font><a href="https://git-scm.com/docs/git-cherry-pick"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://git-scm.com/docs/git-cherry-pick</font></font></a>
ko: <font style="vertical-align: inherit;"><a href="https://git-scm.com/docs/git-cherry-pick"><font style="vertical-align: inherit;">https://git-scm.com/docs/git-cherry-pick</font></a><font style="vertical-align: inherit;"> 방문</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Посетите </font></font><a href="https://git-scm.com/docs/git-cherry-pick"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://git-scm.com/docs/git-cherry-pick</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问</font></font><a href="https://git-scm.com/docs/git-cherry-pick"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://git-scm.com/docs/git-cherry-pick</font></font></a>

source: What does cherry-picking a commit with Git mean
es: ¿Qué significa elegir un compromiso con Git?
ja: Git でコミットをチェリーピックするというのはどういうことでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git으로 커밋을 고르는 것은 무엇을 의미합니까?</font></font>
ru: Что означает вишнёвый выбор коммита с Git'ом?
zh_cn: 用Git偷摘提交是什么意思?

source: When it is not obvious how to apply a change, the following happens:
es: Cuando no es obvio cómo aplicar un cambio,sucede lo siguiente:
ja: 変化をどのように適用したらよいかわからない場合は、次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변경 사항을 적용하는 방법이 확실하지 않은 경우 다음이 발생합니다.</font></font>
ru: Когда неясно,как применить изменение,происходит следующее:
zh_cn: 当不明显的时候,会出现以下情况。

source: When you are working with a team of developers on a project, managing the changes between a number of git branches can become a complex task. Sometimes you don't want to merge a whole branch into another, and only need to pick one or two specific commits. This process is called 'cherry picking'.
es: Cuando se trabaja con un equipo de desarrolladores en un proyecto,la gestión de los cambios entre un número de ramas git puede convertirse en una tarea compleja.A veces no quieres fusionar una rama entera en otra,y sólo necesitas elegir uno o dos commits específicos.Este proceso se llama 'cherry picking'.
ja: 開発者のチームでプロジェクトを進めているときに、複数の git ブランチ間の変更を管理するのは複雑な作業になるでしょう。ブランチ全体を別のブランチにマージするのではなく、特定のコミットをひとつかふたつだけピックアップする必要があることもあるでしょう。これを「チェリーピッキング」と呼びます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로젝트에서 개발자 팀과 함께 작업 할 때 여러 자식 분기 간의 변경 사항을 관리하는 것은 복잡한 작업이 될 수 있습니다. </font><font style="vertical-align: inherit;">때로는 전체 브랜치를 다른 브랜치로 병합하고 싶지 않고 하나 또는 두 개의 특정 커밋 만 선택하면됩니다. </font><font style="vertical-align: inherit;">이 과정을 '체리 따기'라고합니다.</font></font>
ru: Когда вы работаете с командой разработчиков над проектом,управление изменениями между несколькими git-ветками может стать сложной задачей.Иногда вам не хочется сливать целую ветку в другую,а нужно лишь выбрать один или два конкретных коммита.Этот процесс называется "выбором вишни".
zh_cn: 当你在一个项目中与一个开发者团队合作时,管理多个git分支之间的变化可能会成为一项复杂的任务。有时你不想把整个分支合并到另一个分支中,而只需要挑选一两个特定的提交。这个过程被称为 "樱桃采摘"。

source: You can think if a cherry pick as similar to a rebase, or rather it's managed like a rebase. By this, I mean that it takes an existing commit and regenerates it taking, as the starting point, the head of the branch you're currently on.
es: Puedes pensar si una selección de cerezas es similar a una base,o más bien se maneja como una base.Con esto quiero decir que toma un compromiso existente y lo regenera tomando como punto de partida la cabeza de la rama en la que estás actualmente.
ja: チェリーピックはリベースに似ていると考えることができます。つまり、既存のコミットを取得して、現在のブランチの先頭を起点にして再生成するということです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 픽이 rebase와 비슷하거나 오히려 rebase처럼 관리되는지 생각할 수 있습니다. </font><font style="vertical-align: inherit;">즉, 기존 커밋을 가져와 현재 지점의 헤드를 시작 지점으로 사용하여 다시 생성한다는 의미입니다.</font></font>
ru: Можно подумать,что если вишневый ломтик похож на ломтик,а точнее,он управляется как ломтик.Под этим я подразумеваю,что он берет существующий коммит и регенерирует его,принимая в качестве отправной точки голову той ветки,в которой вы в данный момент находитесь.
zh_cn: 你可以把cherry pick看成是类似于rebase,或者说它的管理方式就像rebase一样。我的意思是说,它把一个现有的提交作为起点,以你当前所在的分支的头部为起点,重新生成它。

source: Youtube: Introduction to Git cherry-pick
es: Youtube:Introducción a Git cherry-pick
ja: Youtubeで紹介されています。Gitの紹介 チェリーピック
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유튜브 : 깃 체리 픽 소개</font></font>
ru: Youtube:Введение в Git вишня-выборка
zh_cn: Youtube。Git cherry-pick介绍

source: a) <strong>release1</strong> - This branch is going to your customer, but there are still some bugs to be fixed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : esta rama va a su cliente, pero todav&iacute;a hay algunos errores que corregir.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a）</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1-</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このブランチはお客様に提供されますが、まだ修正されていないバグがいくつかあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1-</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 지점은 고객에게 제공되지만 여전히 해결해야 할 몇 가지 버그가 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - эта ветка отправляется вашему клиенту, но все еще есть ошибки, которые нужно исправить.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a）版本</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1-</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该分支将</font><strong><font style="vertical-align: inherit;">交付</font></strong><font style="vertical-align: inherit;">给您的客户，但仍有一些错误需要修复。</font></font>

source: all files added by this commit will be added
es: todos los archivos añadidos por esta confirmación serán añadidos
ja: このコミットで追加されたすべてのファイルが追加されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 커밋으로 추가 된 모든 파일이 추가됩니다</font></font>
ru: все файлы,добавленные этим коммитом,будут добавлены
zh_cn: 此提交所添加的所有文件将被添加到

source: all files deleted by this commit will be deleted
es: todos los archivos eliminados por esta confirmación serán eliminados
ja: このコミットによって削除されたすべてのファイルが削除されます
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 커밋으로 삭제 된 모든 파일이 삭제됩니다</font></font>
ru: все файлы,удалённые данным коммитом,будут удалены
zh_cn: 所有被此提交删除的文件将被删除
