Repository: rueisnom/feedback
Catalog: xlf/93/39/42/9/9339429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<code>feature~2</code> is the 2<sup>nd</sup> commit before
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(la </font></font> <code>feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es la </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">segunda</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> confirmaci&oacute;n antes</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2である</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ND</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前にコミット</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font> <code>feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 두 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">번째</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 커밋입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font> <code>feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это 2- </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">й</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> коммит до</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font><font style="vertical-align: inherit;">之前的</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第二次</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交</font></font>

source: (we are going to do a <em>cherry-pick</em> of the commit <code>L</code> from the branch <code>feature</code>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(vamos a hacer una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">selecci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la confirmaci&oacute;n </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la </font></font> <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ramificaci&oacute;n </font><font style="vertical-align: inherit;">):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><font style="vertical-align: inherit;">ブランチ</font> <code>feature</code> <font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">コミット</font> <code>L</code> の</font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェリーピック</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を行い</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">）：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(우리는 </font><font style="vertical-align: inherit;">브랜치 </font> <code>feature</code> <font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">커밋 </font> <code>L</code> <font style="vertical-align: inherit;"> 을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 픽 선택 </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">합니다</font><font style="vertical-align: inherit;"> ).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(мы будем делать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вишни выбор</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из фиксации </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> от ветви </font></font> <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（我们</font><font style="vertical-align: inherit;">将从分支</font> <code>feature</code> <font style="vertical-align: inherit;">中对提交</font> <code>L</code> </font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行挑选</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <code>feature</code>, i.e. the commit <code>L</code>):
es: <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es decir, el commit </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、つまりコミット</font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>
ko: <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 즉 커밋 </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) :</font></font>
ru: <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , т.е. коммит </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <code>feature</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，即提交</font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: <strong><em>So what does cherry-picking a commit in git mean? How do you do it?</em></strong>
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, &iquest;qu&eacute; significa elegir un commit en git? </font><font style="vertical-align: inherit;">&iquest;C&oacute;mo lo haces?</font></font></em></strong>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、gitでコミットをチェリーピッキングするとはどういう意味ですか？</font><font style="vertical-align: inherit;">どうやってやるの？</font></font></em></strong>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git에서 커밋을 고르는 것은 무엇을 의미합니까? </font><font style="vertical-align: inherit;">어떻게합니까?</font></font></em></strong>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так что же означает выбор вишни в git? </font><font style="vertical-align: inherit;">Как ты сделал это?</font></font></em></strong>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">那么，在git中选择提交是什么意思？</font><font style="vertical-align: inherit;">你怎么做呢？</font></font></em></strong>

source: <strong>Excerpt from the official docs:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Extracto de los documentos oficiales:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">公式ドキュメントからの抜粋：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공식 문서에서 발췌 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Выдержка из официальных документов:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">摘自官方文档：</font></font></strong>

source: <strong>NOW</strong>: You fix something in <strong>release1</strong>. Of course you need this fix also in <strong>master</strong>. And that is a typical use-case for cherry picking. So cherry pick in this scenario means that you take a commit from <strong>release1</strong> branch and include it into the <strong>master</strong> branch.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AHORA</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : arreglas algo en la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">versi&oacute;n 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Por supuesto, necesita esta soluci&oacute;n tambi&eacute;n en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">master</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y ese es un caso de uso t&iacute;pico para la recolecci&oacute;n de cerezas. </font><font style="vertical-align: inherit;">Entonces, la selecci&oacute;n de cereza en este escenario significa que toma una confirmaci&oacute;n de la </font><font style="vertical-align: inherit;">rama </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e la incluye en la </font><font style="vertical-align: inherit;">rama </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">maestra</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NOW</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1で</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">何かを修正し</font><strong><font style="vertical-align: inherit;">ます</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">もちろん、この修正は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マスターで</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も必要</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">そして、それはチェリーピッキングの典型的なユースケースです。</font><font style="vertical-align: inherit;">したがって、このシナリオでのチェリーピックは、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リリース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブランチ</font><font style="vertical-align: inherit;">からコミットを</font><strong><font style="vertical-align: inherit;">取得</font></strong><font style="vertical-align: inherit;">し、それを</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マスター</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブランチに</font><font style="vertical-align: inherit;">含めることを</font><font style="vertical-align: inherit;">意味します</font><font style="vertical-align: inherit;">。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지금</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 당신은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 무언가를 </font><strong><font style="vertical-align: inherit;">고쳤습니다</font></strong><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">물론 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">master</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서도이 수정이 필요합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그리고 그것은 체리 따기의 전형적인 유스 케이스입니다. </font><font style="vertical-align: inherit;">따라서이 시나리오에서 cherry pick은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브랜치를 </font><font style="vertical-align: inherit;">커밋 </font><font style="vertical-align: inherit;">하여 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마스터</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브랜치에 </font><font style="vertical-align: inherit;">포함시키는 </font><font style="vertical-align: inherit;">것을 의미합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">СЕЙЧАС</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Вы исправляете что-то в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Конечно, вам нужно это исправить также в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">мастере</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">И это типичный случай для сбора вишни. </font><font style="vertical-align: inherit;">Таким образом, выбор вишни в этом сценарии означает, что вы берете коммит из </font><font style="vertical-align: inherit;">ветки </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и включаете его в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">основную</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ветку.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：您可以在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">修复某些</font><strong><font style="vertical-align: inherit;">问题</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">当然，您也需要在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">master中进行</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此修复</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这是樱桃采摘的典型用例。</font><font style="vertical-align: inherit;">因此，在这种情况下选择樱桃意味着您从</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">release1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分支中</font><font style="vertical-align: inherit;">进行提交，</font><font style="vertical-align: inherit;">并将其包括在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">master</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分支中。</font></font>

source: <strong>Short example of situation, when you need cherry pick</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Breve ejemplo de situaci&oacute;n, cuando necesitas elegir cereza</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェリーピックが必要な状況の短い例</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 픽이 필요한 상황의 짧은 예</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Краткий пример ситуации, когда вам нужно вишня выбрать</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要摘樱桃的情况的简短示例</font></font></strong>

source: <strong>commit B</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cometer B</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コミットB</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋 B</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">совершить B</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交B</font></font></strong>

source: A <code>rebase</code> takes a commit that had a parent X and regenerates the commit as if it actually had a parent Y, and this is precisely what a <code>cherry-pick</code> does.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un </font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> toma un commit que ten&iacute;a un padre X y lo regenera como si realmente tuviera un padre Y, y esto es precisamente lo que hace una </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">親Xを持っていたコミット取り、それが実際に親Yを持っていたかのようにコミット再生成し、これが正確に何である</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ありません。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> A가 부모 X를했다 커밋 소요 실제로 부모 Y를 가진 것처럼 커밋 다시 생성하고, 이것은 정확하게 무엇 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> берет обязательства , </font><font style="vertical-align: inherit;">что у родителя X и регенерирует фиксацию , </font><font style="vertical-align: inherit;">как если бы он на </font><font style="vertical-align: inherit;">самом деле был родитель Y, и это именно то , </font><font style="vertical-align: inherit;">что </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个</font></font> <code>rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要提交的是有一个父X和再生的承诺，如果它实际上有一个父Y，而这恰恰是一个什么</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一样。</font></font>

source: Additional links:
es: Enlaces adicionales:
ja: 追加リンク。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추가 링크 :</font></font>
ru: Дополнительные ссылки:
zh_cn: 附加链接:

source: After performing the command (<code>git cherry-pick feature~2</code>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Despu&eacute;s de ejecutar el comando (funci&oacute;n </font></font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドを実行した後（</font></font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명령을 수행 한 후 ( </font></font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">После выполнения команды ( </font></font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">执行命令后（</font></font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: Before cherry-picking
es: Antes de escoger las cerezas
ja: チェリーピッキングの前に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 따기 전에</font></font>
ru: Перед выбором вишни
zh_cn: 采摘樱桃之前
