Repository: rueisnom/feedback
Catalog: xlf/93/39/42/9/9339429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: all files modified by this commit will be merged. This means <strong>the whole file</strong> from the commit, not only the <strong>changes</strong> from this commit!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todos los archivos modificados por este commit se fusionar&aacute;n. </font><font style="vertical-align: inherit;">&iexcl;Esto significa </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todo el archivo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del commit, no solo los </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cambios</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de este commit!</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このコミットによって変更されたすべてのファイルがマージされます。</font><font style="vertical-align: inherit;">これは</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このコミットから</font><font style="vertical-align: inherit;">の</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変更</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">だけでなく、コミットからの</font><strong><font style="vertical-align: inherit;">ファイル全体を</font></strong><font style="vertical-align: inherit;">意味</font><strong><font style="vertical-align: inherit;">します</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 커밋으로 수정 된 모든 파일이 병합됩니다. </font><font style="vertical-align: inherit;">이것은 </font><font style="vertical-align: inherit;">커밋의 </font><strong><font style="vertical-align: inherit;">변경</font></strong><font style="vertical-align: inherit;"> 뿐만 아니라 커밋 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 전체 파일</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">의미 </font><strong><font style="vertical-align: inherit;">합니다</font></strong><font style="vertical-align: inherit;"> !</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">все файлы, измененные этим коммитом, будут объединены. </font><font style="vertical-align: inherit;">Это означает, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">что весь файл</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из коммита, а не только </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">изменения</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из этого коммита!</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此提交修改的所有文件将被合并。</font><font style="vertical-align: inherit;">这意味着</font><font style="vertical-align: inherit;">提交中</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的整个文件</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而不仅仅是</font><font style="vertical-align: inherit;">此提交中</font><font style="vertical-align: inherit;">的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">！</font></font>

source: b) <strong>master</strong> - Classic master branch, where you can for example add functionality for release2.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">maestro</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : rama maestra cl&aacute;sica, donde puede, por ejemplo, agregar funcionalidad para la versi&oacute;n 2.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b）</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マスター</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -クラシックマスターブランチ。たとえば、リリース2の機能を追加できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b)는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마스터</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 클래식 마스터 지점, 어디 당신이 할 수있는 release2에 대한 예를 들어 추가 기능에 대한.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">б) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">master</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - классическая мастер-ветка, где вы можете, например, добавить функциональность для release2.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B）</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -经典主分支，在那里你可以为release2例如添加功能。</font></font>

source: checkout (switch to) target branch.
es: cambiar a la rama del objetivo.
ja: 対象ブランチをチェックアウト(切り替え)します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대상 지점을 체크 아웃 (전환)합니다.</font></font>
ru: проверка (переключение на)целевой ветки.
zh_cn: 结账(转到)目标分行。

source: cherry-pick is a Git feature. If someone wants to Commit specific commits in one branch to a target branch, then cherry-pick is used.
es: cherry-pick es una característica de Git.Si alguien quiere comprometerse específicamente en una rama con una rama objetivo,entonces se usa cherry-pick.
ja: cherry-pick は Git の機能です。あるブランチの特定のコミットをターゲットブランチにコミットしたい場合、 cherry-pick を使います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cherry-pick은 Git 기능입니다. </font><font style="vertical-align: inherit;">누군가가 한 분기의 특정 커밋을 대상 분기에 커밋하려면 cherry-pick이 사용됩니다.</font></font>
ru: вишнёвый выбор-это функция Git.Если кто-то хочет зафиксировать определённые коммиты в одной ветке в целевой,то используется функция cherry-pick.
zh_cn: cherry-pick 是 Git 的一个功能。如果有人想将一个分支中的特定提交提交到目标分支中,那么就会使用cherry-pick功能。

source: git cherry-pick steps are as below.
es: Los pasos de git cherry-pick son los siguientes.
ja: git cherry-pick の手順は以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git cherry-pick 단계는 다음과 같습니다.</font></font>
ru: шаги по выбору вишни,как показано ниже.
zh_cn: git 樱桃采摘步骤如下。

source: git official guide page
es: página de la guía oficial de git
ja: git 公式ガイドページ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자식 공식 가이드 페이지</font></font>
ru: страница git-официального руководства
zh_cn: git官方指南页面

source: push to target branch
es: empujar a la rama del objetivo
ja: 送り先分岐
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">목표 지점으로 미십시오</font></font>
ru: нажать на нужную ветку
zh_cn: 推到目标分支

source: since <strong>commit B</strong> contains <em>newFileB</em> and <em>main</em>, but no <em>newFileA</em>, resulting in a bug, so use with caution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dado que </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileB</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">main</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero no </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileA</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo que da como resultado un error, as&iacute; que </font><em><font style="vertical-align: inherit;">&uacute;selo</font></em><font style="vertical-align: inherit;"> con precauci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以来、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bがコミット</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">含ま</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileB</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メイン</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ない</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileA</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、バグが生じが、そう注意して使用します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이후 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B 커밋</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포함 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileB</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주요</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,하지만 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileA</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 버그의 결과를, 그래서 사용에주의.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так как </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержит </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileB</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">main</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но не </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileA</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , что приводит к ошибке, поэтому используйте с осторожностью.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">犯乙</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileB</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但没有</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">newFileA</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，造成了错误，所以请谨慎使用。</font></font>
