Repository: rueisnom/feedback
Catalog: xlf/93/39/42/9/9339429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I prepared step-by-step illustrations what <em>cherry-pick</em> does &mdash; and an <em>animation of these illustrations</em> (near the end).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prepar&eacute; ilustraciones paso a paso de lo que hace </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cherry-pick</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">animaci&oacute;n de estas ilustraciones</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (casi al final).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェリーピックの</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップバイステップのイラスト</font><font style="vertical-align: inherit;">と、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらのイラストのアニメーション</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（終わり近く）</font><font style="vertical-align: inherit;">を用意し</font><font style="vertical-align: inherit;">ました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 픽</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font><font style="vertical-align: inherit;">하는 단계적인 그림 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">과이 그림</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font><em><font style="vertical-align: inherit;">애니메이션</font></em><font style="vertical-align: inherit;"> (끝 근처)을 준비했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я подготовил пошаговые иллюстрации того, что делает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cherry-pick</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">анимацию этих иллюстраций</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (ближе к концу).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我准备了分步演示的插图，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">摘樱桃的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">工作以及</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这些插图</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font><em><font style="vertical-align: inherit;">动画</font></em><font style="vertical-align: inherit;">（接近尾声）。</font></font>

source: If you <strong>cherry-pick commit B</strong> on another branch, you'll end up with :
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">elige la confirmaci&oacute;n B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en otra rama, terminar&aacute; con:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別のブランチで</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><strong><font style="vertical-align: inherit;">チェリーピックすると</font></strong><font style="vertical-align: inherit;">、次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 지점에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋 B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><strong><font style="vertical-align: inherit;">선택</font></strong><font style="vertical-align: inherit;"> 하면 다음 </font><font style="vertical-align: inherit;">과 같이 끝납니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы выберете </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">коммит B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на другой ветке, вы получите:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您</font><font style="vertical-align: inherit;">在另一个分支上</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择提交B</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您将得到：</font></font>

source: If you cherry-pick from a public branch, you should consider using
es: Si eliges una sucursal pública,deberías considerar usar
ja: パブリックブランチからチェリーピックする場合は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공공 지점에서 체리 픽을 선택하면</font></font>
ru: Если вы выбираете вишню из государственного филиала,вам следует подумать об использовании
zh_cn: 如果你从公共支部中偷工减料的话,应该考虑用

source: If you have notes attached to the commit they do not follow the cherry-pick. To bring them over as well, You have to use:
es: Si tienes notas adjuntas al compromiso,no siguen la selección de la cereza.Para traerlos también,tienes que usar:
ja: コミットにノートが添付されている場合、チェリーピックには従いません。それらも同様に持ってくるには、以下のようにしてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋에 첨부 된 메모가 있으면 체리 픽을 따르지 않습니다. </font><font style="vertical-align: inherit;">그것들을 가져 오려면 다음을 사용해야합니다.</font></font>
ru: Если у вас есть прикреплённые к коммиту заметки,они не следуют за вишнёвым выбором.Чтобы принести их,вы должны их использовать:
zh_cn: 如果你在提交中附加了注释,那么它们就不会按照樱桃采摘的方式来。要把它们也带过来,你必须使用:

source: If you want to do a hot fix, for example, then you can use the <code>cherry-pick</code> feature.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea hacer una soluci&oacute;n r&aacute;pida, por ejemplo, puede usar la </font><font style="vertical-align: inherit;">funci&oacute;n de </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、ホットフィックスを実行する場合は、</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能を</font><font style="vertical-align: inherit;">使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, 핫픽스를 수행하려는 경우 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기능을 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите, например, сделать оперативное исправление, вы можете использовать </font><font style="vertical-align: inherit;">функцию </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，如果要进行热修复，则可以使用&ldquo; </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功能。</font></font>

source: If you want to do this for single commit just remove last option
es: Si quieres hacer esto para un solo compromiso,elimina la última opción.
ja: シングルコミットの場合は、最後のオプションを削除してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 커밋에 대해이 작업을 수행하려면 마지막 옵션을 제거하십시오.</font></font>
ru: Если вы хотите сделать это для одиночного коммита,просто удалите последнюю опцию
zh_cn: 如果你想对单次提交做此操作,只需删除最后一个选项

source: If you want to merge without commit ids you can use this command
es: Si quieres fusionarte sin cometer identificaciones puedes usar este comando
ja: コミット ID を使わずにマージしたい場合は、次のコマンドを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋 ID없이 병합하려면이 명령을 사용할 수 있습니다</font></font>
ru: Если вы хотите произвести слияние без фиксации,вы можете использовать эту команду.
zh_cn: 如果你想在没有提交id的情况下进行合并,可以使用这个命令

source: It will apply a particular commit to your current branch.
es: Aplicará un compromiso particular a su rama actual.
ja: 現在のブランチに特定のコミットを適用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 커밋에 특정 커밋을 적용합니다.</font></font>
ru: Он применит конкретный коммит к вашей текущей ветке.
zh_cn: 它将应用特定的提交到你当前的分支。

source: It's kind of like Copy (from somewhere) and Paste (to somewhere), but for specific commits.
es: Es como copiar (de algún sitio)y pegar (a algún sitio),pero para compromisos específicos.
ja: Copy (from somewhere)と Paste (to somewhere)のようなものですが、特定のコミットのためのものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Copy (어딘가에서) 및 Paste (어딘가로)와 비슷하지만 특정 커밋의 경우입니다.</font></font>
ru: Это что-то вроде копирования (откуда-то)и вставки (куда-то),но для конкретных коммитов.
zh_cn: 这有点像复制(从某个地方)和粘贴(到某个地方),但是针对特定的提交。

source: Make sure you are on the branch you want to apply the commit to.
es: Asegúrate de que estás en la rama en la que quieres aplicar el compromiso.
ja: コミットを適用したいブランチにいることを確認してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋을 적용하려는 지점에 있는지 확인하십시오.</font></font>
ru: Убедитесь,что вы находитесь на той ветке,к которой хотите применить коммит.
zh_cn: 确保你是在你想应用提交的分支上。

source: No other modifications are made.
es: No se hacen otras modificaciones.
ja: それ以外の改造はしていません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 수정은 없습니다.</font></font>
ru: Никаких других изменений не производится.
zh_cn: 不做其他修改。

source: Paths in which the change applied cleanly are updated both in the index file and in your working tree.
es: Los caminos en los que el cambio aplicado limpiamente se actualizan tanto en el archivo de índice como en su árbol de trabajo.
ja: 変更がクリーンに適用されたパスは、インデックスファイルと作業ツリーの両方で更新されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변경 사항이 완전히 적용된 경로는 인덱스 파일과 작업 트리에서 모두 업데이트됩니다.</font></font>
ru: Пути,в которых изменение,примененное чисто,обновляются как в индексном файле,так и в вашем рабочем дереве.
zh_cn: 在索引文件和你的工作树中都会更新更改应用的路径。

source: Read more...
es: Leer más...
ja: 読んでみてください...続きを読む
ko: 더 읽어보기 ...
ru: Подробнее...
zh_cn: 阅读更多.....

source: Recently, I have been asked to <code>cherry-pick</code> a commit.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Recientemente, se me ha pedido que </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> un compromiso.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近、私は</font><font style="vertical-align: inherit;">コミット</font><font style="vertical-align: inherit;">を</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する</font><font style="vertical-align: inherit;">ように頼まれました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최근 </font><font style="vertical-align: inherit;">에는 커밋 </font><font style="vertical-align: inherit;">을 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하라는 요청을 받았습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недавно мне было предложено </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> коммит.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近，有人要求我</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交。</font></font>

source: So the way you do it differs, but under the hood they are very similar operations - the regeneration of commits.
es: Así que la forma en que lo haces difiere,pero bajo el capó son operaciones muy similares-la regeneración de los compromisos.
ja: そのため、その方法は異なりますが、フードの下では、コミットの再生成という非常に類似した操作が行われています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 당신이하는 방식은 다르지만, 후드 아래에서 커밋의 재생과 매우 유사한 작업입니다.</font></font>
ru: Так что способ,которым вы это делаете,отличается,но под капотом находятся очень похожие операции-регенерация коммитов.
zh_cn: 所以方法不同,但在引擎盖下,它们的操作非常相似--提交的再生。

source: Starting the command <code>git cherry-pick feature~2</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Inicio del comando </font></font> <code>git cherry-pick feature~2</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font> <code>git cherry-pick feature~2</code> <font style="vertical-align: inherit;">開始</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시작 명령 </font></font> <code>git cherry-pick feature~2</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Запуск команды </font></font> <code>git cherry-pick feature~2</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">启动命令</font></font> <code>git cherry-pick feature~2</code>

source: Technically (internally), it's a <em>new, different</em> commit (because e.g. <code>L</code> contains a pointer to <code>K</code> (as its parent), while <code>L'</code> contains a pointer to <code>E</code>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">T&eacute;cnicamente (internamente), es una </font><font style="vertical-align: inherit;">confirmaci&oacute;n </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">nueva y diferente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (porque, por ejemplo, </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene un puntero a </font></font> <code>K</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (como su padre), mientras que </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene un puntero a </font></font> <code>E</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">技術的に（内部的に）、これは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">新しい別の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コミットです（たとえば、</font></font> <code>L</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">（親として）</font></font> <code>K</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">へのポインタが含まれ、</font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>E</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">へのポインタが含まれるため</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기술적으로 (내부적으로), </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새롭고 다른</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 커밋입니다 (예 : </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>K</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 포인터를 포함하고 </font><font style="vertical-align: inherit;">( </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>E</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 포인터를 포함 </font><font style="vertical-align: inherit;">)).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Технически (внутренне) это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">новый, другой</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> коммит (потому что, например, </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержит указатель на </font></font> <code>K</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (как его родитель), в то время как </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержит указатель на </font></font> <code>E</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从技术上讲（内部），这是一个</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">新的不同的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交（因为例如</font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含指向</font></font> <code>K</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（作为其父对象）</font><font style="vertical-align: inherit;">的指针</font><font style="vertical-align: inherit;">，而</font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含指向</font></font> <code>E</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的指针</font><font style="vertical-align: inherit;">）。</font></font>

source: The CHERRY_PICK_HEAD ref is set to point at the commit that introduced the change that is difficult to apply.
es: El árbitro CHERRY_PICK_HEAD está fijado para apuntar al compromiso que introdujo el cambio que es difícil de aplicar.
ja: CHERRY_PICK_HEAD refには、適用が難しい変更を導入したコミットを指すように設定しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CHERRY_PICK_HEAD 참조는 적용하기 어려운 변경을 도입 한 커밋을 가리 키도록 설정됩니다.</font></font>
ru: Справка CHERRY_PICK_HEAD устанавливается в точку коммита,который ввёл изменение,которое трудно применить.
zh_cn: CHERRY_PICK_HEAD ref被设置为指向引入难以应用的变更的提交。

source: The above command will merge last three commits of master from 1 to 3
es: El comando anterior fusionará las últimas tres comisiones del maestro de 1 a 3.
ja: 上記のコマンドは master の最後の 3 回のコミットを 1 から 3 にマージします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 명령은 마지막 3 개의 커밋을 1에서 3으로 병합합니다.</font></font>
ru: Вышеприведенная команда объединит три последних коммита мастера от 1 до 3.
zh_cn: 上面的命令将主站的最后三个提交从1合并到3。

source: The commit <code>L'</code> is <em>from the user's point of view (commit = snapshot)</em> the exact copy of the commit <code>L</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La confirmaci&oacute;n </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">desde el punto de vista del usuario (commit = snapshot)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la copia exacta de la cometer </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コミット</font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ユーザーの観点（commit = snapshot）</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">からのコミット</font></font> <code>L</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正確なコピーです</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋 </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 관점에서 (커밋 = 스냅 샷)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 커밋 </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 정확한 사본입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Фиксации </font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">с точки зрения пользователя (фиксации = снимок)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> точную копию фиксации </font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交</font></font> <code>L'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从视用户的角度（提交=快照）</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的提交精确副本</font></font> <code>L</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
