Repository: rueisnom/feedback
Catalog: xlf/93/39/42/9/9339429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Cherry pick is more about how you select the commits. With <code>pull</code> (rebase), git implicitly regenerates your local commits on top of what's pulled to your branch, but with <code>cherry-pick</code> you explicitly choose some commit(s), and implicitly regenerate it (them) on top of your current branch.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La selecci&oacute;n de cereza se trata m&aacute;s sobre c&oacute;mo seleccionar las confirmaciones. </font><font style="vertical-align: inherit;">Con </font></font> <code>pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (rebase), git regenera impl&iacute;citamente sus commits locales encima de lo que se extrae de su rama, pero con </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usted elige expl&iacute;citamente algunos </font><font style="vertical-align: inherit;">commits </font><font style="vertical-align: inherit;">, y los regenera impl&iacute;citamente encima de su rama actual.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェリーピックは、コミットの選択方法に関する詳細です。</font></font> <code>pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（リベース）、gitのは、暗黙のうちにあなたのブランチに引っ張られているものの上に、あなたの地元のコミットを再生成しますが、と</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明示的にいくつかの（s）がコミットを選択し、暗黙のうちにあなたの現在のブランチの上に（それらを）再生成します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cherry pick은 커밋을 선택하는 방법에 대한 자세한 내용입니다. </font><font style="vertical-align: inherit;">함께 </font></font> <code>pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (REBASE), 자식은 암시 적 지점에 뽑아 무슨 위에 해당 지역의 커밋을 다시 생성하지만, 함께 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명시 적 일부 (들) 커밋 선택하고 암시 적으로 현재 브랜치의 상단에 (을) 재생.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cherry pick - больше о том, как вы выбираете коммиты. </font><font style="vertical-align: inherit;">С помощью </font></font> <code>pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (rebase) git неявно регенерирует ваши локальные коммиты поверх того, что вытягивается в вашу ветку, но с </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы явно выбираете некоторые </font><font style="vertical-align: inherit;">коммиты </font><font style="vertical-align: inherit;">и неявно регенерируете их (их) поверх вашей текущей ветки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cherry Pick更多有关如何选择提交的信息。</font><font style="vertical-align: inherit;">使用</font></font> <code>pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（rebase），git会在拉到分支的内容的基础上隐式地重新生成本地提交，但是使用</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以显式选择一些提交，并在当前分支的基础上隐式地重新生成它们。</font></font>

source: Cherry picking in Git is designed to apply some commit from one branch into another branch. It can be done if you eg. made a mistake and committed a change into wrong branch, but do not want to merge the whole branch. You can just eg. revert the commit and cherry-pick it on another branch.
es: La recolección de cerezas en Git está diseñada para aplicar algún commit de una rama a otra rama.Se puede hacer si,por ejemplo,cometiste un error y cambiaste a la rama equivocada,pero no quieres fusionar toda la rama.Puedes revertir el error y seleccionarlo en otra rama.
ja: Git でのチェリーピッキングは、あるブランチのコミットを別のブランチに適用するためのものです。これは、例えばミスをして間違ったブランチに変更を加えてしまったが、ブランチ全体をマージしたくない場合などに有効です。コミットを元に戻して別のブランチでチェリーピックすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git에서의 체리 피킹은 한 지점에서 다른 지점으로 커밋을 적용하도록 설계되었습니다. </font><font style="vertical-align: inherit;">예를 들어 할 수 있습니다. </font><font style="vertical-align: inherit;">실수를하고 잘못된 지점으로 변경했지만 전체 지점을 병합하고 싶지는 않습니다. </font><font style="vertical-align: inherit;">당신은 예를 들어 할 수 있습니다. </font><font style="vertical-align: inherit;">커밋을 되돌리고 다른 지점에서 체리를 선택하십시오.</font></font>
ru: Вишнёвый пикинг в Git'е предназначен для применения некоторых коммитов из одной ветки в другую.Это можно сделать,если вы,например,совершили ошибку и зафиксировали изменение в неправильном ответвлении,но не желаете сливать всё ответвление целиком.Вы можете просто,например,вернуть коммит в исходное состояние и выбрать вишню в другой ветке.
zh_cn: Git中的Cherry picking是为了将一个分支中的一些提交应用到另一个分支中。如果你犯了一个错误,把一个错误的提交提交到了错误的分支中,但又不想合并整个分支,那么就可以这样做。你只需将提交恢复到另一个分支中,然后在另一个分支中进行樱桃采摘就可以了。

source: Cherry picking in Git means to choose a commit from one branch and apply it onto another.
es: Recoger cerezas en Git significa elegir un commit de una rama y aplicarlo a otra.
ja: Git でのチェリーピッキングとは、あるブランチのコミットを選択して別のブランチに適用することを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git에서의 체리 피킹은 한 지점에서 커밋을 선택하여 다른 지점에 적용하는 것을 의미합니다.</font></font>
ru: Выбор вишни в Git'е означает выбор коммита из одной ветки и применение его к другой.
zh_cn: Git中的Cherry picking是指从一个分支中选择一个提交,然后应用到另一个分支上。

source: Consider following scenario. You have two branches.
es: Considere el siguiente escenario.Tienes dos ramas.
ja: 次のシナリオを考えてみましょう。あなたは2つのブランチを持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 시나리오를 고려하십시오. </font><font style="vertical-align: inherit;">두 가지가 있습니다.</font></font>
ru: Рассмотрим следующий сценарий.У вас две ветки.
zh_cn: 考虑一下下面的情况。你有两个分支。

source: Do your <code>cherry-pick</code> in a development branch, and <code>merge</code> that commit to a release branch. Likewise, do a <code>cherry-pick</code> from a release branch to master. Voila
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Haga su selecci&oacute;n de </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en una rama de desarrollo y </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ese compromiso con una rama de lanzamiento. </font><font style="vertical-align: inherit;">Del mismo modo, haga una </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">cereza</font><font style="vertical-align: inherit;"> de una rama de lanzamiento para dominar. </font><font style="vertical-align: inherit;">Voila</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">お使いですか</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">開発ブランチでは、と</font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リリースブランチにコミットします。</font><font style="vertical-align: inherit;">同様に、</font><font style="vertical-align: inherit;">リリースブランチからマスターに</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実行し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">出来上がり</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신의 수행 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 개발 브랜치 및 </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 릴리스 브랜치에 커밋합니다. </font><font style="vertical-align: inherit;">마찬가지로 </font><font style="vertical-align: inherit;">릴리스 지점에서 마스터 </font><font style="vertical-align: inherit;">로 </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">수행하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">짜잔</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сделайте свой </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в ветке разработки и </font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> коммит с веткой релиза. </font><font style="vertical-align: inherit;">Точно так же, сделайте </font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из ветки релиза мастеру. </font><font style="vertical-align: inherit;">Вуаля</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做你的</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的开发分支，并</font></font> <code>merge</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该承诺发布分支。</font><font style="vertical-align: inherit;">同样，</font><font style="vertical-align: inherit;">从发布分支到主分支进行</font></font> <code>cherry-pick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">沃伊拉</font></font>

source: Edit: Since this answer is still getting impression, I would like to add very nice in action video tutorial about it:
es: Editar:Como esta respuesta todavía está causando impresión,me gustaría añadir un muy bonito video tutorial en acción sobre ello:
ja: 編集:この答えはまだ印象を得ているので、私はそれについてのアクションビデオチュートリアルで非常に素晴らしいを追加したいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 :이 답변은 여전히 ​​인상적이기 때문에 액션 비디오 자습서에 대해 매우 훌륭하게 추가하고 싶습니다.</font></font>
ru: Правка:Так как этот ответ все еще производит впечатление,я хотел бы добавить очень хорошее в действии видео-учебник об этом:
zh_cn: 编辑:由于这个答案还在得到印象,所以我想补充一下非常不错的动作视频教程。

source: Ex: Consider <strong>commit A</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ej: Considerar </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cometer A</font></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font><strong><font style="vertical-align: inherit;">コミットAを</font></strong><font style="vertical-align: inherit;">検討</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 : </font><strong><font style="vertical-align: inherit;">커밋 A</font></strong><font style="vertical-align: inherit;"> 고려</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример: рассмотрим </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">коммит А</font></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如：考虑</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交A</font></font></strong>

source: Execute the following:
es: Ejecute lo siguiente:
ja: 以下を実行してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음을 실행하십시오.</font></font>
ru: Выполните следующее:
zh_cn: 执行以下内容:

source: For conflicting paths, the index file records up to three versions, as described in the "TRUE MERGE" section of git-merge. The working tree files will include a description of the conflict bracketed by the usual conflict markers &lt;&lt;&lt;&lt;&lt;&lt;&lt; and &gt;&gt;&gt;&gt;&gt;&gt;&gt;.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para rutas conflictivas, el archivo de &iacute;ndice registra hasta tres versiones, como se describe en la secci&oacute;n "VERDADERO FUSI&Oacute;N" de git-merge. </font><font style="vertical-align: inherit;">Los archivos del &aacute;rbol de trabajo incluir&aacute;n una descripci&oacute;n del conflicto entre corchetes por los marcadores de conflicto habituales &lt;&lt;&lt;&lt;&lt;&lt;&lt; y &gt;&gt;&gt;&gt;&gt;&gt;&gt;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パスが競合する場合、git-mergeの「TRUE MERGE」セクションで説明されているように、インデックスファイルは最大3つのバージョンを記録します。</font><font style="vertical-align: inherit;">作業ツリーファイルには、通常の競合マーカー&lt;&lt;&lt;&lt;&lt;&lt;&lt;および&gt;&gt;&gt;&gt;&gt;&gt;&gt;で囲まれた競合の説明が含まれます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">충돌하는 경로의 경우 인덱스 파일은 git-merge의 "TRUE MERGE"섹션에 설명 된대로 최대 3 개의 버전을 기록합니다. </font><font style="vertical-align: inherit;">작업 트리 파일에는 일반적인 충돌 마커 &lt;&lt;&lt;&lt;&lt;&lt;&lt; 및 &gt;&gt;&gt;&gt;&gt;&gt;&gt;로 묶인 충돌에 대한 설명이 포함됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для конфликтующих путей индексный файл записывает до трех версий, как описано в разделе &laquo;TRUE MERGE&raquo; в git-merge. </font><font style="vertical-align: inherit;">Файлы рабочего дерева будут содержать описание конфликта, заключенного в скобки с помощью обычных маркеров конфликта &lt;&lt;&lt;&lt;&lt;&lt;&lt; и &gt;&gt;&gt;&gt;&gt;&gt;&gt;.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于冲突的路径，索引文件最多记录三个版本，如git-merge的&ldquo; TRUE MERGE&rdquo;部分所述。</font><font style="vertical-align: inherit;">工作树文件将包含对冲突的描述，并用通常的冲突标记&lt;&lt;&lt;&lt;&lt;&lt;&lt;和&gt;&gt;&gt;&gt;&gt;&gt;&gt;括起来。</font></font>

source: For full procedure see: <a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html">http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para ver el procedimiento completo, consulte: </font></font><a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全な手順については、</font><a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">//technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.htmlを</font><font style="vertical-align: inherit;">参照してください。</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 절차는 </font><a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html"><font style="vertical-align: inherit;">http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html을</font></a><font style="vertical-align: inherit;"> 참조하십시오.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для полной процедуры см .: </font></font><a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关完整过程，请参阅：</font><a href="http://technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//technosophos.com/2009/12/04/git-cherry-picking-move-small-code-patches-across-branches.html</font></font>

source: Found a great article on cherry picking, check it out for in-depth details: <a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git">https://www.previousnext.com.au/blog/intro-cherry-picking-git</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Encontr&eacute; un gran art&iacute;culo sobre la recolecci&oacute;n de cerezas, &eacute;chale un vistazo para obtener detalles en profundidad: </font></font><a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.previousnext.com.au/blog/intro-cherry-picking-git</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェリーピッキングに関する素晴らしい記事を見つけました。詳細については、</font><a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.previousnext.com.au/blog/intro-cherry-picking-gitをご覧ください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">체리 따기에 대한 훌륭한 기사를 찾았습니다. 자세한 내용은 </font><a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git"><font style="vertical-align: inherit;">https://www.previousnext.com.au/blog/intro-cherry-picking-git</font></a><font style="vertical-align: inherit;"> 에서 확인하십시오.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нашел отличную статью о сборке вишни, за подробностями </font><a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git"><font style="vertical-align: inherit;">обращайтесь к ней</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.previousnext.com.au/blog/intro-cherry-picking-git</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到了一篇有关采摘樱桃的好文章，请查看其详细信息：</font><a href="https://www.previousnext.com.au/blog/intro-cherry-picking-git"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.previousnext.com.au/blog/intro-cherry-picking-git</font></font>

source: Given one or more existing commits, apply the change each one introduces, recording a new commit for each. This requires your working tree to be clean (no modifications from the HEAD commit).
es: Dada una o más confirmaciones existentes,aplicar el cambio que cada una introduce,registrando una nueva confirmación para cada una.Esto requiere que tu árbol de trabajo esté limpio (sin modificaciones de la confirmación de HEAD).
ja: 一つ以上の既存のコミットがあった場合、それぞれの変更を適用し、それぞれに新しいコミットを記録します。このためには、作業ツリーがクリーンである必要があります (HEAD コミットからの変更はありません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나 이상의 기존 커밋이 주어지면 각 커밋에 대한 변경 사항을 적용하고 각각에 대해 새로운 커밋을 기록하십시오. </font><font style="vertical-align: inherit;">이를 위해서는 작업 트리가 깨끗해야합니다 (HEAD 커밋의 수정 사항 없음).</font></font>
ru: Учитывая один или несколько существующих коммитов,применяйте изменения,вносимые каждым из них,записывая новый коммит для каждого из них.Это требует,чтобы ваше рабочее дерево было чистым (никаких изменений из коммита HEAD).
zh_cn: 给出一个或多个现有的提交,应用每一个引入的更改,为每一个提交记录一个新的提交。这需要你的工作树是干净的(没有来自于 HEAD 提交的修改)。

source: Here commit id is activity id of another branch.Eg.
es: Aquí la identificación de compromiso es la actividad de otra rama.Por ejemplo.
ja: ここで commit id は別のブランチのアクティビティ ID です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 커밋 ID는 다른 지점의 활동 ID입니다.</font></font>
ru: Здесь идентификатор коммита-это идентификатор активности другой ветви.Eg.
zh_cn: 这里的提交ID是另一个分支的活动ID。
