Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Note: the <code>\0</code> at end of the format string is useless if you don't care about empty fields at end of the string or they're not present.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Nota: el </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al final de la cadena de formato es in&uacute;til si no le interesan los campos vac&iacute;os al final de la cadena o no est&aacute;n presentes).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（注：</font><font style="vertical-align: inherit;">書式文字列の最後の</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、文字列の最後の空のフィールドを気にしないか、存在しない場合は役に立ちません。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(참고 : </font><font style="vertical-align: inherit;">문자열 끝의 빈 필드에 신경 쓰지 않거나 존재하지 않는 경우 형식 문자열 끝의 </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 쓸모가 없습니다.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Примечание: </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в конце строки формата бесполезен, если вам не нужны пустые поля в конце строки или они отсутствуют.)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（注意：</font><font style="vertical-align: inherit;">如果您不关心字符串末尾的空字段或它们不存在，则格式字符串末尾</font><font style="vertical-align: inherit;">的</font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无效。）</font></font>

source: (The lack of this approach in any solution posted so far is the main reason I'm writing this answer ;)
es: (La falta de este enfoque en cualquier solución publicada hasta ahora es la principal razón por la que estoy escribiendo esta respuesta ;)
ja: (これまでに投稿されたどの解答にもこのアプローチがないことが、私がこの解答を書いている主な理由です;)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(지금까지 게시 된 솔루션 에이 접근법이 없기 때문에이 답변을 작성하는 주된 이유입니다.)</font></font>
ru: (Отсутствие такого подхода в любом размещенном на данный момент решении является основной причиной,по которой я пишу этот ответ ;)
zh_cn: (到目前为止贴出的任何解决方案中都没有这种方法,这也是我写这个答案的主要原因;)

source: (We can also display the contents of these variables using <code>declare -p</code>:)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Tambi&eacute;n podemos mostrar el contenido de estas variables usando </font></font> <code>declare -p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>declare -p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">して</font><font style="vertical-align: inherit;">これらの変数の内容を表示することもできます</font><font style="vertical-align: inherit;">:)</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(우리는 또한 사용하여 이러한 변수의 내용을 표시 할 수 있습니다 </font></font> <code>declare -p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Мы также можем отобразить содержимое этих переменных с помощью </font></font> <code>declare -p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（我们也可以使用</font></font> <code>declare -p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">显示这些变量的内容</font><font style="vertical-align: inherit;">：）</font></font>

source: <code>##</code> and <code>%%</code> delete the longest possible matching substring.
es: <code>##</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> eliminan la subcadena coincidente m&aacute;s larga posible.</font></font>
ja: <code>##</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、一致する可能性のある最長の部分文字列を削除します。</font></font>
ko: <code>##</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 가능한 가장 긴 일치하는 하위 문자열을 삭제합니다.</font></font>
ru: <code>##</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> удаляют максимально длинную подходящую подстроку.</font></font>
zh_cn: <code>##</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>%%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">删除可能的最长匹配子字符串。</font></font>

source: <code>#</code> and <code>%</code> delete the shortest possible matching substring from the <em>start</em> and <em>end</em> of the string respectively, and
es: <code>#</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> eliminan la subcadena coincidente m&aacute;s corta posible desde el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">inicio</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">final</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la cadena respectivamente, y</font></font>
ja: <code>#</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、それぞれ文字列の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">先頭</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">末尾</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から可能な限り短い一致する部分文字列を削除</font><font style="vertical-align: inherit;">します。</font></font>
ko: <code>#</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 문자열의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시작</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">끝</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 각각 </font><font style="vertical-align: inherit;">가장 짧은 일치하는 부분 문자열을 삭제합니다.</font></font>
ru: <code>#</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> удаляют максимально короткую подходящую подстроку из </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">начала</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">конца</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> строки соответственно, и</font></font>
zh_cn: <code>#</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分别</font><font style="vertical-align: inherit;">从字符串的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开头</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结尾</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">删除最短的匹配子</font><font style="vertical-align: inherit;">字符串，并且</font></font>

source: <code>IFS</code> is not overriden: Due to dynamic scoping of even local variables, overriding <code>IFS</code> over a loop causes the new value to leak into function calls performed from within the loop.
es: <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no se anula: debido al alcance din&aacute;mico de incluso las variables locales, anular el </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sobre un bucle hace que el nuevo valor se filtre en las llamadas a funciones realizadas desde dentro del bucle.</font></font>
ja: <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオーバーライドされません。ローカル変数の動的スコープでも</font><font style="vertical-align: inherit;">、ループ上で</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">オーバーライド</font><font style="vertical-align: inherit;">すると、ループ内から実行された関数呼び出しに新しい値がリークします。</font></font>
ko: <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 재정의되지 않음 : 로컬 변수의 동적 범위 지정으로 인해 </font><font style="vertical-align: inherit;">루프를 통해 </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">재정의 </font><font style="vertical-align: inherit;">하면 루프 내에서 수행 된 함수 호출로 새 값이 누출됩니다.</font></font>
ru: <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не переопределяется: из-за динамического выделения даже локальных переменных переопределение </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по циклу вызывает утечку нового значения в вызовы функций, выполняемые из цикла.</font></font>
zh_cn: <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不会被覆盖：由于甚至局部变量都具有动态作用域，因此</font><font style="vertical-align: inherit;">在循环上</font><font style="vertical-align: inherit;">覆盖</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会导致新值泄漏到从循环内部执行的函数调用中。</font></font>

source: <code>cut</code> is very handy to be able to <code>cat</code> this file and select a particular field for further processing.
es: <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es muy &uacute;til para poder </font></font> <code>cat</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> este archivo y seleccionar un campo en particular para su posterior procesamiento.</font></font>
ja: <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font><font style="vertical-align: inherit;">このファイル</font><font style="vertical-align: inherit;">を</font></font> <code>cat</code> し<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、さらに処理するために特定のフィールドを選択するの</font><font style="vertical-align: inherit;">に非常に便利</font><font style="vertical-align: inherit;">です。</font></font>
ko: <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 수있는 매우 편리 </font></font> <code>cat</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 파일을 추가 처리를 위해 특정 필드를 선택합니다.</font></font>
ru: <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> очень удобен, чтобы иметь возможность </font></font> <code>cat</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> этот файл и выбрать определенное поле для дальнейшей обработки.</font></font>
zh_cn: <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是非常方便的能够</font></font> <code>cat</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个文件，并选择用于进一步处理的特定领域。</font></font>

source: <em>Or</em> you could use <code>&lt;&lt;&lt;</code>, and in the function body include some processing to drop the newline it adds:
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede usar </font></font> <code>&lt;&lt;&lt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y en el cuerpo de la funci&oacute;n incluir alg&uacute;n procesamiento para descartar la nueva l&iacute;nea que agrega:</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>&lt;&lt;&lt;</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">し、関数の本文に、追加した改行を削除する処理を含める</font><font style="vertical-align: inherit;">ことができ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font></em><font style="vertical-align: inherit;"></font> <code>&lt;&lt;&lt;</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 </font><font style="vertical-align: inherit;">있으며 함수 본문에 추가 줄 바꿈을 삭제하는 처리가 포함됩니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы можете использовать </font></font> <code>&lt;&lt;&lt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и в тело функции включить некоторую обработку для удаления новой строки:</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用</font></font> <code>&lt;&lt;&lt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并在函数体中进行一些处理以删除添加的换行符：</font></font>

source: <strong>Case 1</strong>: Keep it nice and simple: Use a NewLine as the Record-Separator... eg.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : mant&eacute;ngalo simple y agradable: use una NewLine como separador de registros ... por ejemplo.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：シンプルに保つ：NewLineをRecord-Separatorとして使用します...例</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 멋지고 단순하게 유지 : 레코드 구분자로 NewLine을 사용하십시오. 예 :</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Случай 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Делайте это красиво и просто: используйте NewLine в качестве разделителя записей ... например.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：保持简单易懂：使用NewLine作为Record-Separator...。</font></font>

source: <strong>Case 2</strong>: Using a ";" as a record separator... eg.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Caso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Usando un ";" </font><font style="vertical-align: inherit;">como un separador de registros ... por ejemplo.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：「;」を使用する </font><font style="vertical-align: inherit;">レコードセパレータとして...例</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : ";"사용 </font><font style="vertical-align: inherit;">레코드 구분 기호로 사용 ... 예 :</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Случай 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : использование &laquo;;&raquo; </font><font style="vertical-align: inherit;">в качестве разделителя записей ... например.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：使用&ldquo;;&rdquo; </font><font style="vertical-align: inherit;">作为记录分隔符...例如</font></font>

source: A different take on <a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011">Darron's answer</a>, this is how I do it:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una </font></font><a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">versi&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> diferente de </font><font style="vertical-align: inherit;">la respuesta de Darron</font><font style="vertical-align: inherit;"> , as&iacute; es como lo hago:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ダロンの答えの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別の</font><font style="vertical-align: inherit;">見方</font><font style="vertical-align: inherit;">、これは私がそれをする方法です：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Darron의 대답</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 다른 견해 </font><font style="vertical-align: inherit;">는 내가하는 방법입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другой </font></font><a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответ на ответ Даррона</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вот как я это делаю:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对</font></font><a href="https://stackoverflow.com/questions/918886/split-string-based-on-delimiter-in-bash/3704011#3704011"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Darron的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有不同的看法</font><font style="vertical-align: inherit;">，这就是我的做法：</font></font>

source: A one-liner to split a string separated by ';' into an array is:
es: Una línea para dividir una cadena separada por ';' en una matriz es:
ja: ';'で区切られた文字列を配列に分割するワンライナーがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열을 ';'으로 구분하여 분할하는 하나의 라이너 </font><font style="vertical-align: inherit;">배열로 :</font></font>
ru: Одиночный лайнер для разделения строки,разделенной на массив символом ';':
zh_cn: 将一个以';'分隔的字符串分割成数组的单行本是。

source: After suggestions from the answers below, I ended up with the following which is what I was after:
es: Después de las sugerencias de las respuestas de abajo,terminé con lo siguiente,que es lo que buscaba:
ja: 下の回答から提案した結果、私が求めていたのは以下のようなものになりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 답변에서 제안한 후, 나는 다음과 같은 결과를 얻었습니다.</font></font>
ru: После предложений из ответов,приведенных ниже,я получил следующее:
zh_cn: 经过下面的答案的建议,我最终得出了以下的结论,这就是我所追求的。

source: And if you just want a simple printout of the array, you don't even need to loop over it:
es: Y si sólo quieres una simple impresión de la matriz,ni siquiera necesitas hacer un bucle sobre ella:
ja: また、単純に配列をプリントアウトしたいだけならば、それをループさせる必要もありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열의 간단한 인쇄물을 원한다면 반복 할 필요조차 없습니다.</font></font>
ru: А если вам нужна простая распечатка массива,то вам даже не нужно его зацикливать:
zh_cn: 如果你只是想要一个简单的数组的打印输出,你甚至不需要在它上面循环。
