Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In particular, <em>arrays</em>, <em>associative arrays</em>, and <em>pattern substitution</em>, which are used in the solutions in this post as well as others in the thread, are <em>bashisms</em> and may not work under other <em>shells</em> that many people use.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En particular, las </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matrices</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">las matrices asociativas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la sustituci&oacute;n de patrones</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que se usan en las soluciones en esta publicaci&oacute;n, as&iacute; como en otras en el hilo, son </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashismos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y pueden no funcionar bajo otras </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">capas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que muchas personas usan.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特に、</font><font style="vertical-align: inherit;">この投稿のソリューション</font><font style="vertical-align: inherit;">や</font><font style="vertical-align: inherit;">スレッドの他のソリューションで使用されている</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">連想配列</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パターン置換</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バシズム</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">であり</font><font style="vertical-align: inherit;">、多くの人が使用する</font><font style="vertical-align: inherit;">他の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シェル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">は機能しない可能性があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">특히이 </font><font style="vertical-align: inherit;">게시물의 솔루션과 스레드의 다른 솔루션에서 사용되는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연관 배열</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패턴 대체</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashism</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이며 </font><font style="vertical-align: inherit;">많은 사람들이 사용하는 </font><font style="vertical-align: inherit;">다른 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">쉘</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서는 작동하지 않을 수 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В частности, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массивы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ассоциативные массивы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подстановка шаблонов</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которые используются в решениях в этом посте, а также в других </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обсуждениях</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в потоке, являются </font><em><font style="vertical-align: inherit;">ошибками</font></em><font style="vertical-align: inherit;"> и могут не работать под другими </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оболочками,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которые используют многие люди.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特别是，本文</font><font style="vertical-align: inherit;">中的解决方案以及线程中的其他解决方案中使用的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">array</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关联数组</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模式替换</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一种</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，可能无法在</font><font style="vertical-align: inherit;">许多人使用的</font><font style="vertical-align: inherit;">其他</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">shell</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下工作</font><font style="vertical-align: inherit;">。</font></font>

source: In the case of splitting this specific example into a bash script array, <code>tr</code> is probably more efficient, but <code>cut</code> can be used, and is more effective if you want to pull specific fields from the middle.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso de dividir este ejemplo espec&iacute;fico en una matriz de script bash, </font></font> <code>tr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es probablemente m&aacute;s eficiente, pero el </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar y es m&aacute;s efectivo si desea extraer campos espec&iacute;ficos del medio.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この特定の例をbashスクリプト配列に分割する場合、</font></font> <code>tr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はおそらくより効率的ですが、</font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用でき、特定のフィールドを途中からプルしたい場合により効果的です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 특정 예제를 bash 스크립트 배열로 분할하는 경우 </font></font> <code>tr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 더 효율적일 </font><font style="vertical-align: inherit;">수 </font><font style="vertical-align: inherit;">있지만 </font></font> <code>cut</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있으며 중간에서 특정 필드를 가져 오려는 경우 더 효과적입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В случае разбиения этого конкретного примера на массив сценариев bash </font></font> <code>tr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вероятно, более эффективен, но </font><font style="vertical-align: inherit;">можно использовать </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и более эффективно, если вы хотите извлечь определенные поля из середины.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在将特定示例拆分为bash脚本数组的情况下，</font></font> <code>tr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可能会更有效，但是</font><font style="vertical-align: inherit;">可以使用</font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并且如果您要从中间拉出特定字段，则更有效。</font></font>

source: It will parse one line of items separated by <code>;</code>, pushing it into an array. Stuff for processing whole of <code>$IN</code>, each time one line of input separated by <code>;</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Analizar&aacute; una l&iacute;nea de elementos separados por </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, empuj&aacute;ndolo en una matriz. </font><font style="vertical-align: inherit;">Cosas para procesar todo </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , cada vez que una l&iacute;nea de entrada est&aacute; separada por </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で区切られた1行の項目を解析し</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、それを配列にプッシュします。</font><font style="vertical-align: inherit;">全体の処理のためのもの</font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、入力の1行で区切られた各時間</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">한 줄의 항목을 파싱하여 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열로 밀어 넣습니다. </font><font style="vertical-align: inherit;">한 줄의 입력으로 구분 될 때마다 </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 전체를 처리하기위한 것 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он будет анализировать одну строку элементов, разделенных </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, толкая его в массив. </font><font style="vertical-align: inherit;">Материал для обработки всего </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , каждый раз, когда одна строка ввода разделяется </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它将解析由</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分隔的一行项目</font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">，将其推入数组。</font><font style="vertical-align: inherit;">用于处理整个</font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，每次输入一行用分隔</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Maybe not the most elegant solution, but works with <code>*</code> and spaces:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Quiz&aacute;s no sea la soluci&oacute;n m&aacute;s elegante, pero funciona con </font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y espacios:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多分最もエレガントなソリューションではありませんが、</font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とスペースで</font><font style="vertical-align: inherit;">動作し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 가장 우아한 해결책은 아니지만 </font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 공백으로 </font><font style="vertical-align: inherit;">작동 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Возможно, не самое элегантное решение, но работает с </font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и пробелами:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也许不是最优雅的解决方案，但可以使用</font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和空格：</font></font>

source: Note that <code>read</code> is the <em>quickest</em> way to do the split because there are no <em>forks</em> or external resources called.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es la </font><font style="vertical-align: inherit;">forma </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&aacute;s</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> r&aacute;pida de hacer la divisi&oacute;n porque no se </font><font style="vertical-align: inherit;">llaman </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tenedores</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o recursos externos.</font></font>
ja: <font style="vertical-align: inherit;"><em><font style="vertical-align: inherit;">フォーク</font></em><font style="vertical-align: inherit;">や外部リソースが呼び出され</font><font style="vertical-align: inherit;">ないため</font><font style="vertical-align: inherit;">、</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">分割を行う</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最も速い</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法で</font><font style="vertical-align: inherit;">ある</font><font style="vertical-align: inherit;">ことに</font><font style="vertical-align: inherit;">注意して</font><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 IS </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빠른</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 전혀 없기 때문에 분할을 할 수있는 방법 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">포크</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라는 외부 자원.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">самый быстрый</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> способ выполнить разделение, потому что нет </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вызова вилок</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или внешних ресурсов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font><font style="vertical-align: inherit;">进行拆分</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最快</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法，因为没有</font><font style="vertical-align: inherit;">调用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">派生</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或外部资源。</font></font>

source: Note: in this first case no sub-process is forked to assist with list manipulation.
es: Nota:en este primer caso no se bifurca ningún subproceso para ayudar a la manipulación de la lista.
ja: 注意:この最初のケースでは、リスト操作を支援するためのサブプロセスはフォークされません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 :이 첫 번째 경우 목록 조작을 돕기 위해 하위 프로세스가 분기되지 않습니다.</font></font>
ru: Примечание:в этом первом случае ни один подпроцесс не будет вилкой для помощи в манипуляции со списками.
zh_cn: 注意:在第一种情况下,没有分叉的子进程来协助进行列表操作。

source: Now <code>${a[0]}</code>, <code>${a[1]}</code>, etc, are as you would expect. Use <code>${#a[*]}</code> for number of terms. Or to iterate, of course:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora </font></font> <code>${a[0]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>${a[1]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc., son lo que cabr&iacute;a esperar. </font><font style="vertical-align: inherit;">Use </font></font> <code>${#a[*]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la cantidad de t&eacute;rminos. </font><font style="vertical-align: inherit;">O para iterar, por supuesto:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これで、</font></font> <code>${a[0]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>${a[1]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などが予想どおりになりました。</font><font style="vertical-align: inherit;">用語の数には</font></font> <code>${#a[*]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">またはもちろん、繰り返します：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 </font></font> <code>${a[0]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>${a[1]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등이 예상대로입니다. </font><font style="vertical-align: inherit;">용어 수에 </font></font> <code>${#a[*]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">또는 물론 반복하려면 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь </font></font> <code>${a[0]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>${a[1]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д. Соответствуют ожиданиям. </font><font style="vertical-align: inherit;">Используйте </font></font> <code>${#a[*]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для количества терминов. </font><font style="vertical-align: inherit;">Или, конечно, повторить:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在</font></font> <code>${a[0]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>${a[1]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等已如您所愿。</font><font style="vertical-align: inherit;">使用</font></font> <code>${#a[*]}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示字词数量。</font><font style="vertical-align: inherit;">还是要迭代，当然：</font></font>

source: Now I would like to split the strings by <code>;</code> delimiter so that I have:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora me gustar&iacute;a dividir las cuerdas por </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">delimitador para que tenga:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、文字列をで分割したいと思い</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が持っているように区切り文字：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 문자열을 다음과 같이 나누고 싶습니다 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구분 기호를 사용하여 다음을 수행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь я хотел бы разделить строки </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">разделитель, так что у меня есть:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在我想用拆分字符串</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分隔符，以便我有：</font></font>
