Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I don't necessarily need the <code>ADDR1</code> and <code>ADDR2</code> variables. If they are elements of an array that's even better.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No necesariamente necesito las </font><font style="vertical-align: inherit;">variables </font></font> <code>ADDR1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>ADDR2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si son elementos de una matriz, eso es a&uacute;n mejor.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ADDR1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数</font><font style="vertical-align: inherit;">と</font></font> <code>ADDR2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数</font><font style="vertical-align: inherit;">は必ずしも必要では</font><font style="vertical-align: inherit;">ありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それらが配列の要素である場合は、さらに優れています。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ADDR1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>ADDR2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font><font style="vertical-align: inherit;">가 반드시 필요한 것은 아닙니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것들이 배열의 요소라면 더 좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мне не обязательно нужны </font><font style="vertical-align: inherit;">переменные </font></font> <code>ADDR1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ADDR2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если они являются элементами массива, это даже лучше.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我不一定需要</font></font> <code>ADDR1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ADDR2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量。</font><font style="vertical-align: inherit;">如果它们是数组的元素，那就更好了。</font></font>

source: I have this string stored in a variable:
es: Tengo esta cadena almacenada en una variable:
ja: この文字列を変数に格納しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문자열을 변수에 저장했습니다.</font></font>
ru: У меня эта строка хранится в переменной:
zh_cn: 我把这个字符串存储在一个变量中。

source: I only got the first string when printing it in loop, without brackets around <code>$IN</code> it works.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Solo obtuve la primera cadena cuando la imprim&iacute; en bucle, sin corchetes alrededor de </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funciona.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前後に角かっこがないと、ループで印刷するときに最初の文字列しか取得できません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프에서 인쇄 할 때 첫 번째 문자열 만 얻었으며 </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 주위에 대괄호가 없어도 </font><font style="vertical-align: inherit;">작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я получил только первую строку при печати в цикле, без скобок вокруг </font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> это работает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在循环打印时，我只有第一个字符串，在</font></font> <code>$IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">周围没有括号，</font><font style="vertical-align: inherit;">它可以工作。</font></font>

source: I think <a href="http://en.wikipedia.org/wiki/AWK">AWK</a> is the best and efficient command to resolve your problem. AWK is included by default in almost every Linux distribution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo que </font></font><a href="http://en.wikipedia.org/wiki/AWK"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AWK</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el comando mejor y eficiente para resolver su problema. </font><font style="vertical-align: inherit;">AWK se incluye por defecto en casi todas las distribuciones de Linux.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/AWK"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AWK</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は問題を解決するための最良かつ効率的なコマンド</font><font style="vertical-align: inherit;">だと思い</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">AWKは、ほぼすべてのLinuxディストリビューションにデフォルトで含まれています。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/AWK"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AWK</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 귀하의 문제를 해결하는 가장 효율적이고 효과적인 명령 </font><font style="vertical-align: inherit;">이라고 생각 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">AWK는 기본적으로 거의 모든 Linux 배포판에 포함되어 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я думаю, что </font></font><a href="http://en.wikipedia.org/wiki/AWK"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AWK</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - лучшая и эффективная команда для решения вашей проблемы. </font><font style="vertical-align: inherit;">AWK включен по умолчанию почти во все дистрибутивы Linux.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我认为</font></font><a href="http://en.wikipedia.org/wiki/AWK"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AWK</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是解决您问题的最佳且有效的命令。</font><font style="vertical-align: inherit;">默认情况下，几乎每个Linux发行版都包含AWK。</font></font>

source: I will use a modified version of this string to ensure that my solution is robust to strings containing whitespace, which could break other solutions:
es: Usaré una versión modificada de esta cadena para asegurarme de que mi solución es robusta a las cadenas que contienen espacios en blanco,lo que podría romper otras soluciones:
ja: この文字列の修正版を使用して、私のソリューションが空白を含む文字列に対してロバストであることを確認し、他のソリューションを破壊する可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문자열의 수정 된 버전을 사용하여 솔루션이 공백이 포함 된 문자열에 강력 해 다른 솔루션을 손상시킬 수 있도록합니다.</font></font>
ru: Я буду использовать модифицированную версию этой строки,чтобы убедиться,что мое решение устойчиво к строкам,содержащим пробелы,которые могут нарушить другие решения:
zh_cn: 我将使用这个字符串的修改版本,以确保我的解决方案对包含whitespace的字符串是稳健的,这可能会破坏其他解决方案。

source: I've seen a couple of answers referencing the <code>cut</code> command, but they've all been deleted. It's a little odd that nobody has elaborated on that, because I think it's one of the more useful commands for doing this type of thing, especially for parsing delimited log files.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He visto un par de respuestas que hacen referencia al </font><font style="vertical-align: inherit;">comando de </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero todas han sido eliminadas. </font><font style="vertical-align: inherit;">Es un poco extra&ntilde;o que nadie haya explicado eso, porque creo que es uno de los comandos m&aacute;s &uacute;tiles para hacer este tipo de cosas, especialmente para analizar archivos de registro delimitados.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドを</font><font style="vertical-align: inherit;">参照するいくつかの回答を見ました</font><font style="vertical-align: inherit;">が、それらはすべて削除されました。</font><font style="vertical-align: inherit;">特に、区切られたログファイルを解析するために、この種のことを行うためのより便利なコマンドの1つだと思うので、誰もそれについて詳しく説明していないのは少し奇妙です。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령을 </font><font style="vertical-align: inherit;">참조하는 몇 가지 답변을 보았지만 </font><font style="vertical-align: inherit;">모두 삭제되었습니다. </font><font style="vertical-align: inherit;">이 유형의 작업, 특히 구분 된 로그 파일을 구문 분석하는 데 유용한 명령 중 하나라고 생각하기 때문에 아무도 그것에 대해 자세히 설명하지 않은 것이 조금 이상합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я видел пару ответов, ссылающихся на </font><font style="vertical-align: inherit;">команду </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но все они были удалены. </font><font style="vertical-align: inherit;">Немного странно, что никто не уточнил это, потому что я думаю, что это одна из наиболее полезных команд для такого типа вещей, особенно для анализа файлов журнала с разделителями.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我看到了几个参考</font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">的答案</font><font style="vertical-align: inherit;">，但是它们都已被删除。</font><font style="vertical-align: inherit;">没有人详细说明这一点有点奇怪，因为我认为它是执行此类操作的更有用的命令之一，尤其是对于解析分隔的日志文件。</font></font>

source: IFS must be saved and restored since Bash does not treat an assignment the same way as a command. An alternate workaround is to wrap the assignment inside a function and call that function with a modified IFS. In that case separate saving/restoring of IFS is not needed. Thanks for "Bize" for pointing that out.
es: El IFS debe ser guardado y restaurado ya que Bash no trata una asignación de la misma manera que un comando.Una solución alternativa es envolver la asignación dentro de una función y llamar a esa función con un IFS modificado.En ese caso,no es necesario guardar por separado el IFS.Gracias a "Bize" por señalarlo.
ja: Bash は代入をコマンドと同じようには扱わないので、IFS を保存して復元する必要があります。別の回避策としては、代入を関数の中でラップして、IFS を変更してその関数を呼び出すことです。この場合、IFS の個別の保存と復元は必要ありません。Bize "さんの指摘に感謝します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash는 할당을 명령과 같은 방식으로 처리하지 않으므로 IFS를 저장하고 복원해야합니다. </font><font style="vertical-align: inherit;">다른 해결 방법은 할당을 함수 내부에 래핑하고 수정 된 IFS로 해당 함수를 호출하는 것입니다. </font><font style="vertical-align: inherit;">이 경우 별도의 IFS 저장 / 복원이 필요하지 않습니다. </font><font style="vertical-align: inherit;">"Bize"를 지적 해 주셔서 감사합니다.</font></font>
ru: IFS должен быть сохранен и восстановлен,так как Bash не относится к заданию так же,как к команде.Альтернативный обходной путь-обернуть назначение внутри функции и вызвать эту функцию с помощью модифицированного IFS.В этом случае отдельное сохранение и восстановление IFS не требуется.Спасибо за "Bize" за указание на это.
zh_cn: IFS必须被保存和恢复,因为Bash并不像对待命令那样对待赋值。另一个变通的方法是将赋值封装在一个函数中,然后用修改过的IFS调用该函数。在这种情况下,就不需要单独的IFS的保存和恢复了。感谢 "Bize" 指出了这一点。

source: IMPORTANT NOTE:
es: NOTA IMPORTANTE:
ja: 重要な注意事項
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중요 사항:</font></font>
ru: ВАЖНОЕ ПРИМЕЧАНИЕ:
zh_cn: 重要提示:

source: Idea: Maybe it is worth using NL extensively <em>internally</em>, and only converting to a different RS when generating the final result <em>externally</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Idea: Quiz&aacute;s valga la pena usar NL de manera extensiva </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">internamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y solo convertirlo a un RS diferente al generar el resultado final </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">externamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アイデア：多分、NLを</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">広範囲に使用</font><font style="vertical-align: inherit;">し、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外部で</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最終結果を生成するときにのみ別のRSに変換する</font><font style="vertical-align: inherit;">価値があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아이디어 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부적으로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> NL을 광범위하게 사용 </font><font style="vertical-align: inherit;">하고 최종 결과를 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부에서</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 생성 할 때 다른 RS로만 변환하는 것이 </font><font style="vertical-align: inherit;">좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Идея: Может быть, стоит использовать NL для </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внутреннего использования</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и преобразовывать его в другой RS только при </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внешнем</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> генерировании конечного результата </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">想法：也许值得在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">广泛使用NL </font><font style="vertical-align: inherit;">，并且只有在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外部</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">生成最终结果时才转换为其他RS </font><font style="vertical-align: inherit;">。</font></font>

source: If desired, the function may be put into a script as follows:
es: Si se desea,la función puede ponerse en un guión de la siguiente manera:
ja: 必要に応じて、この関数を以下のようにスクリプトに入れることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원하는 경우 함수를 다음과 같이 스크립트에 넣을 수 있습니다.</font></font>
ru: При желании функцию можно поместить в скрипт следующим образом:
zh_cn: 如果需要,可将该功能放入脚本中,如下所示。

source: If no space, Why not this?
es: Si no hay espacio,¿por qué no esto?
ja: スペースがない場合は、なぜこれではないのですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공간이 없다면, 왜 그렇지 않습니까?</font></font>
ru: Если нет места,то почему не это?
zh_cn: 如果没有空间,为什么不是这个?

source: If the original string has spaces <em>and</em> the delimiter is a new line, you can set <a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting">IFS</a> with:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si la cadena original tiene espacios </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el delimitador es una nueva l&iacute;nea, puede establecer </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元の文字列にスペースが</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あり</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、区切り文字が改行の場合、</font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を次のように</font><font style="vertical-align: inherit;">設定できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 문자열에 공백이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있고</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 분리 문자가 줄 </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바꾸기 인 경우 다음을 사용</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하여 </font><font style="vertical-align: inherit;">IFS</font><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">설정할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если в исходной строке есть пробелы, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">а</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разделителем является новая строка, вы можете установить </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果原始字符串包含空格</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">定界符是换行符，则可以使用以下命令设置</font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: If the original string has spaces, you will need to use <a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting">IFS</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si la cadena original tiene espacios, deber&aacute; usar </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元の文字列にスペースがある場合は、</font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 문자열에 공백이 있으면 </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если в исходной строке есть пробелы, вам нужно использовать </font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果原始字符串中有空格，则需要使用</font></font><a href="https://unix.stackexchange.com/questions/184863/what-is-the-meaning-of-ifs-n-in-bash-scripting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
