Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The following Bash/zsh function splits its first argument on the delimiter given by the second argument:
es: La siguiente función Bashzsh divide su primer argumento en el delimitador dado por el segundo argumento:
ja: 以下のBashzsh関数は、第1引数を第2引数で与えられたデリミタ上で分割します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 Bash / zsh 함수는 첫 번째 인수를 두 번째 인수가 제공 한 분리 문자로 분할합니다.</font></font>
ru: Следующая функция Bashzsh разделяет свой первый аргумент на разделитель,заданный вторым аргументом:
zh_cn: 下面的Bashzsh函数将其第一个参数拆分到第二个参数所给的分隔符上。

source: The string to be split in the above question is:
es: La cuerda que debe ser dividida en la pregunta anterior es:
ja: 上の質問で分割する文字列は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 질문에서 나눌 문자열은 다음과 같습니다.</font></font>
ru: Строка,которая должна быть разделена в вышеуказанном вопросе:
zh_cn: 上述问题中要分割的字符串是()。

source: The syntax used inside of the curly braces to replace each <code>';'</code> character with a <code>' '</code> character is called <a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html">Parameter Expansion</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La sintaxis utilizada dentro de las llaves para reemplazar cada </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El car&aacute;cter con un car&aacute;cter </font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se llama </font></font><a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">expansi&oacute;n de par&aacute;metros</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中括弧内で使用される構文は、各</font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を置き換え</font><font style="vertical-align: inherit;">ます。</font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">付いた</font><font style="vertical-align: inherit;">文字は、</font></font><a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメータ拡張</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중괄호 안에 사용 된 구문은 각 </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 대체합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">A의 문자 </font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문자라고 </font></font><a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매개 변수 확장</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Синтаксис, используемый внутри фигурных скобок для замены каждого </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">символ с символом </font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> называется </font></font><a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">расширением параметра</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">花括号内部用来替换每个</font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的语法 </font><font style="vertical-align: inherit;">带有</font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字符的字符称为</font></font><a href="https://www.gnu.org/software/bash/manual/html_node/Shell-Parameter-Expansion.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数扩展</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The trick for this to work is to use the <code>-d</code> option of <code>read</code> (delimiter) with an empty delimiter, so that <code>read</code> is forced to read everything it's fed. And we feed <code>read</code> with exactly the content of the variable <code>in</code>, with no trailing newline thanks to <code>printf</code>. Note that's we're also putting the delimiter in <code>printf</code> to ensure that the string passed to <code>read</code> has a trailing delimiter. Without it, <code>read</code> would trim potential trailing empty fields:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El truco para que esto funcione es usar la </font><font style="vertical-align: inherit;">opci&oacute;n </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (delimitador) con un delimitador vac&iacute;o, de modo que la </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se vea obligada a leer todo lo que se alimenta. </font><font style="vertical-align: inherit;">Y que se alimentan </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con exactamente el contenido de la variable </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , sin arrastre de nueva l&iacute;nea gracias a </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Tenga en cuenta que tambi&eacute;n estamos poniendo el delimitador en </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para asegurarnos de que la cadena pasada a </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tenga un delimitador final. </font><font style="vertical-align: inherit;">Sin ella, </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> recortar&iacute;a los campos vac&iacute;os finales posibles:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを機能させるコツは</font><font style="vertical-align: inherit;">、空の区切り文字</font><font style="vertical-align: inherit;">を指定して</font> <code>read</code> <font style="vertical-align: inherit;">（区切り文字）の</font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプション</font><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">ことです。これにより、読み込まれたすべての</font> <code>read</code> <font style="vertical-align: inherit;">が強制的に読み込まれます。</font><font style="vertical-align: inherit;">また</font><font style="vertical-align: inherit;">、</font> <code>printf</code> の<font style="vertical-align: inherit;">おかげで、末尾の改行なし</font><font style="vertical-align: inherit;">で、変数</font> <code>in</code> の<font style="vertical-align: inherit;">内容を正確に</font> <code>read</code> <font style="vertical-align: inherit;">て</font><font style="vertical-align: inherit;">フィードし</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font> <code>read</code> <font style="vertical-align: inherit;">渡された文字列に</font><font style="vertical-align: inherit;">末尾の区切り文字がある</font><font style="vertical-align: inherit;">ことを確認するために</font><font style="vertical-align: inherit;">、</font> <code>printf</code> <font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">も区切り文字を配置していることに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それがなければ、</font> <code>read</code> <font style="vertical-align: inherit;">は潜在的な後続の空のフィールドをトリムします：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일이에 대한 트릭은 사용하는 것입니다 </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 옵션을 </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그래서, 빈 구분자 (구분)를 </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 공급됩니다 모든 것을 읽어 강제로. </font><font style="vertical-align: inherit;">그리고 우리는 피드 </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수의 정확히 컨텐츠 </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아무런 뒤에 줄 바꿈 덕분에, </font></font> <code>printf</code> 와<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font> <code>read</code> 에<font style="vertical-align: inherit;"> 전달 된 문자열 </font><font style="vertical-align: inherit;">에 후행 구분 기호가 </font><font style="vertical-align: inherit;">있는지 확인하기 위해 </font><font style="vertical-align: inherit;">구분 기호를 </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">넣습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것이 없으면 </font> <code>read</code> <font style="vertical-align: inherit;"> 는 잠재적 인 후행 빈 필드를 잘라냅니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хитрость для этого заключается в том, чтобы использовать </font><font style="vertical-align: inherit;">опцию </font></font> <code>-d</code> <font style="vertical-align: inherit;"></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (delimiter) с пустым разделителем, так что </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вынужден читать все, что ему дано. </font><font style="vertical-align: inherit;">И мы передаем </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> точно с содержимым переменной </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , без завершающей строки, благодаря </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Обратите внимание, что мы также помещаем разделитель в </font></font> <code>printf</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы строка, передаваемая для </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имела завершающий разделитель. </font><font style="vertical-align: inherit;">Без него </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обрезал бы потенциальные конечные пустые поля:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于这项工作，关键是要使用</font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的选项，</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与空分隔符（分隔符），让</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被迫阅读一切它的美联储。</font><font style="vertical-align: inherit;">我们饲料</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与变量的准确内容</font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，没有尾随换行符感谢</font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请注意，我们还将分隔符放入</font></font> <code>printf</code> 中,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以确保传递给</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的字符串</font><font style="vertical-align: inherit;">具有结尾的分隔符。</font><font style="vertical-align: inherit;">如果没有它，则</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会修剪掉潜在的尾随空白字段：</font></font>

source: Then, let the party begin:
es: Entonces,que empiece la fiesta:
ja: では、パーティーを始めましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 파티를 시작하십시오.</font></font>
ru: Тогда пусть вечеринка начнется:
zh_cn: 然后,让聚会开始。

source: There are a lot of different ways to do this in <a href="/questions/tagged/bash">bash</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay muchas formas diferentes de hacer esto en </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行う方法はたくさんあります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 이것을 수행하는 많은 방법이 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть много разных способов сделать это в </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中有很多不同的方法可以做到这一点</font><font style="vertical-align: inherit;">。</font></font>

source: There are some common gotchas:
es: Hay algunos "gotas" comunes:
ja: よくあるゲッチュがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 가지 일반적인 문제가 있습니다.</font></font>
ru: Есть несколько распространённых готчей:
zh_cn: 有一些常见的小毛病。

source: There are some cool answers here (errator esp.), but for something analogous to split in other languages -- which is what I took the original question to mean -- I settled on this:
es: Hay algunas respuestas geniales aquí (errator esp.),pero para que algo análogo se divida en otros idiomas-que es lo que tomé la pregunta original-me decidí por esto:
ja: ここにはいくつかのクールな答えがありますが(正誤表)、他の言語での分割に類似した何かについては、私は元の質問の意味を理解していたので、これに落ち着きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 멋진 답변이 있습니다 (erator esp.). 다른 언어로 나눌 수있는 것과 비슷한 것-원래 질문을 의미했던 것-나는 이것에 정착했습니다.</font></font>
ru: Здесь есть несколько классных ответов (errator esp.),но для чего-то аналогичного разделения на другие языки-что я и имел в виду под оригинальным вопросом-я остановился на этом:
zh_cn: 这里有一些很酷的答案(特别是errator),但对于其他语言中类似于分裂的东西----这也是我原来的问题的意思----我决定用这个来回答。

source: There is a simple and smart way like this:
es: Hay una forma simple e inteligente como esta:
ja: こんな感じでシンプルでスマートな方法があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 간단하고 현명한 방법이 있습니다.</font></font>
ru: Есть такой простой и умный способ:
zh_cn: 有一个简单而聪明的方法是这样的。

source: There was a solution involving setting <a href="http://en.wikipedia.org/wiki/Internal_field_separator">Internal_field_separator</a> (IFS) to <code>;</code>. I am not sure what happened with that answer, how do you reset <code>IFS</code> back to default?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hab&iacute;a una soluci&oacute;n que implicaba configurar </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internal_field_separator</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (IFS) en </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">No estoy seguro de lo que sucedi&oacute; con esa respuesta, &iquest;c&oacute;mo restablece </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a sus </font><font style="vertical-align: inherit;">valores</font><font style="vertical-align: inherit;"> predeterminados?</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internal_field_separator</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（IFS）をに</font><font style="vertical-align: inherit;">設定することを含むソリューションがありました</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">その答えで何が起こったのかわかりませんが、</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をデフォルトに</font><font style="vertical-align: inherit;">リセットするにはどうすればよい</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설정을 포함하는 솔루션이 있었다 </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internal_field_separator</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 (IFS)는 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그 대답에 무슨 일이 있었는지 잘 모르겠습니다. 어떻게 </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 기본값으로 다시 설정합니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Было решение, включающее установку </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internal_field_separator</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (IFS) в </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Я не уверен, что случилось с этим ответом, как вы сбрасываете </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обратно по умолчанию?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有一个解决方案涉及将</font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internal_field_separator</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（IFS）</font><font style="vertical-align: inherit;">设置</font><font style="vertical-align: inherit;">为</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我不确定该答案发生了什么，如何将</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重置</font><font style="vertical-align: inherit;">为默认值？</font></font>

source: This also works:
es: Esto también funciona:
ja: これも効きます。
ko: 이것은 또한 작동합니다 :
ru: Это тоже работает:
zh_cn: 这个也是可以的。
