Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: For instance: on my <em>Debian GNU/Linux</em>, there is a <em>standard</em> shell called <a href="/questions/tagged/dash">dash</a>; I know many people who like to use another shell called <a href="/questions/tagged/ksh">ksh</a>; and there is also a special tool called <a href="/questions/tagged/busybox">busybox</a> with his own shell interpreter (<a href="/questions/tagged/ash">ash</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo: en mi </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian GNU / Linux</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , hay un </font><font style="vertical-align: inherit;">shell </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">est&aacute;ndar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llamado </font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gui&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Conozco a muchas personas a las que les gusta usar otro shell llamado </font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">y tambi&eacute;n hay una herramienta especial llamada </font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con su propio int&eacute;rprete de shell ( </font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、私の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian GNU / Linux</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">には、</font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;">ダッシュ</font></a><font style="vertical-align: inherit;">と呼ばれる</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シェル</font><font style="vertical-align: inherit;">があり</font><font style="vertical-align: inherit;">ます。</font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;">ksh</font></a><font style="vertical-align: inherit;">と呼ばれる別のシェルを使用したい多くの人々を知ってい</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">また、</font><font style="vertical-align: inherit;">独自のシェルインタープリター（</font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;">ash</font></a><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">備えた</font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;">busybox</font></a><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">呼ばれる特別なツールもあり</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데비안 GNU / 리눅스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 </font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;">dash</font></a><font style="vertical-align: inherit;"> 라는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 쉘이 있습니다 </font><font style="vertical-align: inherit;">. </font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;">ksh</font></a><font style="vertical-align: inherit;"> 라는 다른 쉘을 사용하는 많은 사람들을 알고 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">또한 </font><font style="vertical-align: inherit;">자체 쉘 인터프리터 ( </font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;">ash</font></a><font style="vertical-align: inherit;"> )가있는 </font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;">busybox</font></a><font style="vertical-align: inherit;"> 라는 특수 도구도 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например: в моем </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian GNU / Linux</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> есть </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стандартная</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> оболочка, которая называется </font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Я знаю многих людей, которые любят использовать другую оболочку под названием </font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">и есть также специальный инструмент под названием </font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с его собственным интерпретатором оболочки ( </font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如：在我的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian GNU / Linux上</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，有一个</font><font style="vertical-align: inherit;">称为</font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;">dash</font></a><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外壳</font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">我知道很多人喜欢使用另一个称为</font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;">ksh的</font></a><font style="vertical-align: inherit;"> shell </font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">还有一个名为</font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;">busybox</font></a><font style="vertical-align: inherit;">的特殊工具，</font><font style="vertical-align: inherit;">带有他自己的外壳解释器（</font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;">ash</font></a><font style="vertical-align: inherit;">）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Have fun!
es: ¡Diviértete!
ja: 楽しもう!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즐기세요!</font></font>
ru: Развлекайтесь!
zh_cn: 玩得开心!

source: Here is a clean 3-liner:
es: Aquí hay una línea de tres líneas limpia:
ja: こちらは綺麗な3ライナー。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">깨끗한 3 라이너가 있습니다.</font></font>
ru: Вот чистый 3-линейный:
zh_cn: 这里是清一色的三联机。

source: Here's my answer!
es: ¡Aquí está mi respuesta!
ja: これが私の答えだ!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기 내 대답이 있습니다!</font></font>
ru: Вот мой ответ!
zh_cn: 这就是我的答案!

source: How about this approach:
es: ¿Qué tal este enfoque?
ja: このアプローチはどうでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 접근법은 어떻습니까?</font></font>
ru: Как насчет такого подхода:
zh_cn: 这个方法怎么样。

source: How about this one liner, if you're not using arrays:
es: ¿Qué tal este revestimiento,si no estás usando matrices:
ja: 配列を使わないなら、このワンライナーはどうでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 사용하지 않는 경우이 라이너는 어떻습니까?</font></font>
ru: Как насчет этого лайнера,если ты не используешь массивы:
zh_cn: 如果你不用数组,那么这个单行本怎么样。

source: How do I split a string on a delimiter in Bash
es: ¿Cómo puedo dividir una cadena en un delimitador en Bash
ja: Bashでデリミタ上の文字列を分割するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash에서 구분 기호로 문자열을 분할하는 방법</font></font>
ru: Как разбить строку на разделитель в Bash.
zh_cn: 在Bash中如何在定界符上分割一个字符串?

source: However, it's important to first note that <code>bash</code> has many <em>special</em> features (so-called <em><a href="http://mywiki.wooledge.org/Bashism">bashisms</a></em>) that won't work in any other <a href="/questions/tagged/shell">shell</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, es importante tener en cuenta que </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene muchas </font><font style="vertical-align: inherit;">caracter&iacute;sticas </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">especiales</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (los llamados </font></font><em><a href="http://mywiki.wooledge.org/Bashism"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashismos</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) que no funcionar&aacute;n en ning&uacute;n otro </font></font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">shell</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、</font></font> <code>bash</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">他の</font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;">シェル</font></a><font style="vertical-align: inherit;">では機能しない</font><font style="vertical-align: inherit;">多くの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特別な</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能（いわゆる</font></font><em><a href="http://mywiki.wooledge.org/Bashism"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashism</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）があること</font><font style="vertical-align: inherit;">に最初に注意することが重要</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 </font><font style="vertical-align: inherit;">다른 </font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;">쉘</font></a><font style="vertical-align: inherit;"> 에서는 작동하지 않는 </font><font style="vertical-align: inherit;">많은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">특수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기능 (일명 </font></font><em><a href="http://mywiki.wooledge.org/Bashism"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )이 </font><font style="vertical-align: inherit;">있습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тем не менее, важно сначала отметить, что </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет много </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">специальных</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> функций (так называемых </font></font><em><a href="http://mywiki.wooledge.org/Bashism"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), которые не будут работать в любой другой </font></font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оболочке</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，重要的是要首先注意</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有许多</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">特殊</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功能（所谓的</font></font><em><a href="http://mywiki.wooledge.org/Bashism"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），这些功能在任何其他</font></font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">shell</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中都无法使用</font><font style="vertical-align: inherit;">。</font></font>

source: However, we don't need to use arrays to loop over "elements" of a string. There is a syntax used in many shells for deleting substrings of a string from the <em>first</em> or <em>last</em> occurrence of a pattern. Note that <code>*</code> is a wildcard that stands for zero or more characters:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, no necesitamos usar matrices para recorrer los "elementos" de una cadena. </font><font style="vertical-align: inherit;">Hay una sintaxis utilizada en muchos shells para eliminar subcadenas de una cadena desde la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">primera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&uacute;ltima</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aparici&oacute;n de un patr&oacute;n. </font><font style="vertical-align: inherit;">Tenga en cuenta que </font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un comod&iacute;n que significa cero o m&aacute;s caracteres:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、文字列の「要素」をループするために配列を使用する必要はありません。</font><font style="vertical-align: inherit;">多くのシェルで</font><font style="vertical-align: inherit;">は、パターンの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最後の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出現</font><font style="vertical-align: inherit;">から文字列の部分文字列を削除するために使用される構文があります</font><font style="vertical-align: inherit;">。</font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は0個以上の文字を表すワイルドカードであることに</font><font style="vertical-align: inherit;">注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 문자열의 "요소"를 반복하기 위해 배열을 사용할 필요는 없습니다. </font><font style="vertical-align: inherit;">패턴 </font><font style="vertical-align: inherit;">의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 항목 </font><font style="vertical-align: inherit;">에서 문자열의 하위 문자열을 삭제하기 위해 많은 쉘에서 사용되는 구문이 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">참고 것을 </font></font> <code>*</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 0 개 이상의 문자를 의미 와일드 카드는 다음과 같습니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако нам не нужно использовать массивы для циклического перебора &laquo;элементов&raquo; строки. </font><font style="vertical-align: inherit;">Существует синтаксис, используемый во многих оболочках для удаления подстрок строки из </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">первого</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">последнего</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вхождения шаблона. </font><font style="vertical-align: inherit;">Обратите внимание, что </font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является подстановочным знаком, который обозначает ноль или более символов:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，我们不需要使用数组来循环字符串的&ldquo;元素&rdquo;。</font><font style="vertical-align: inherit;">许多外壳程序使用一种语法来从模式的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第</font></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一次</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出现</font><font style="vertical-align: inherit;">或</font><em><font style="vertical-align: inherit;">最后一次</font></em><font style="vertical-align: inherit;">出现中</font><font style="vertical-align: inherit;">删除字符串的子字符串</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请注意，</font></font> <code>*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个通配符，代表零个或多个字符：</font></font>
