Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You can set the <a href="http://en.wikipedia.org/wiki/Internal_field_separator">internal field separator</a> (IFS) variable, and then let it parse into an array. When this happens in a command, then the assignment to <code>IFS</code> only takes place to that single command's environment (to <code>read</code> ). It then parses the input according to the <code>IFS</code> variable value into an array, which we can then iterate over.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede establecer la </font><font style="vertical-align: inherit;">variable del </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">separador de campo interno</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (IFS) y luego dejar que se analice en una matriz. </font><font style="vertical-align: inherit;">Cuando esto sucede en un comando, la asignaci&oacute;n a </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo tiene lugar en el entorno de ese comando &uacute;nico (para </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Luego analiza la entrada de acuerdo con el </font><font style="vertical-align: inherit;">valor de la variable </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en una matriz, que luego podemos iterar.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部フィールドセパレーター</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（IFS）変数</font><font style="vertical-align: inherit;">を設定して、</font><font style="vertical-align: inherit;">解析して配列にすることができます。</font><font style="vertical-align: inherit;">これがコマンドで発生すると、</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">への割り当て</font><font style="vertical-align: inherit;">はその単一のコマンドの環境でのみ行われます（</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">次に、</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数の値</font><font style="vertical-align: inherit;">に従って入力を解析</font><font style="vertical-align: inherit;">して配列にし、それを反復処理できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자가 설정할 수있는 </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부 필드 분리</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (IFS) 변수, 그리고 그 배열로 분석하자. </font><font style="vertical-align: inherit;">이것이 명령에서 발생하면 </font></font> <code>IFS</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 할당 </font><font style="vertical-align: inherit;">은 해당 단일 명령 환경에만 수행됩니다 ( </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">그런 다음 </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 값 </font><font style="vertical-align: inherit;">에 따라 입력을 구문 분석하고 </font><font style="vertical-align: inherit;">이를 반복 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете установить </font><font style="vertical-align: inherit;">переменную </font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внутреннего разделителя полей</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (IFS), а затем разрешить ее анализ в массив. </font><font style="vertical-align: inherit;">Когда это происходит в команде, тогда присвоение </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> происходит только в среде этой отдельной команды (для </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Затем он анализирует входные данные в соответствии со </font><font style="vertical-align: inherit;">значением переменной </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в массив, который мы затем можем перебрать.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以设置</font></font><a href="http://en.wikipedia.org/wiki/Internal_field_separator"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部字段分隔符</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（IFS）变量，然后将其解析为数组。</font><font style="vertical-align: inherit;">当这在命令中发生时，则</font><font style="vertical-align: inherit;">仅对单个命令的环境</font><font style="vertical-align: inherit;">进行</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分配</font><font style="vertical-align: inherit;">（</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">然后，它根据</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量值</font><font style="vertical-align: inherit;">将输入解析</font><font style="vertical-align: inherit;">为一个数组，然后可以对其进行迭代。</font></font>

source: You could use this kind of loop to initialize an array, but there's probably an easier way to do it. Hope this helps, though.
es: Podrías usar este tipo de bucle para inicializar una matriz,pero probablemente hay una forma más fácil de hacerlo.Espero que esto ayude,sin embargo.
ja: この種のループを使って配列を初期化することもできますが、もっと簡単な方法があるでしょう。しかし、これが役に立つことを願っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이런 종류의 루프를 사용하여 배열을 초기화 할 수는 있지만 더 쉬운 방법이 있습니다. </font><font style="vertical-align: inherit;">그래도 도움이되기를 바랍니다.</font></font>
ru: Можно использовать такой цикл для инициализации массива,но,наверное,есть более простой способ.Надеюсь,это поможет.
zh_cn: 你可以用这种循环来初始化一个数组,但可能还有更简单的方法。希望这对你有帮助。

source: You do <strong>not need to escape</strong> the delimiter;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">necesita escapar</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del delimitador;</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区切り文字</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をエスケープ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する</font><strong><font style="vertical-align: inherit;">必要はあり</font></strong><font style="vertical-align: inherit;">ませ</font><strong><font style="vertical-align: inherit;">ん</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분리 문자 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">를 벗어날 필요</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><strong><font style="vertical-align: inherit;">없습니다</font></strong><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не нужно избегать</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разделителя;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不需要转义</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分隔符；</font></font>

source: You will not have <strong>problem with blank spaces</strong>. The value will be properly separated in the array!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No tendr&aacute;s </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">problemas con los espacios en blanco</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iexcl;El valor se separar&aacute; correctamente en la matriz!</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">空白</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><strong><font style="vertical-align: inherit;">問題あり</font></strong><font style="vertical-align: inherit;">ません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">値は配列で適切に区切られます！</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빈 공간</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 </font><strong><font style="vertical-align: inherit;">문제</font></strong><font style="vertical-align: inherit;"> 가 없습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">배열에서 값이 올바르게 분리됩니다!</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У вас не будет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проблем с пробелами</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Значение будет правильно разделено в массиве!</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您将不会有</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">空格的问题</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">该值将在数组中正确分隔！</font></font>

source: also you can use this
es: también puedes usar esto
ja: また、あなたはこれを使用することができます
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 이것을 사용할 수 있습니다</font></font>
ru: также вы можете использовать это
zh_cn: 也可以用这个

source: the trailing empty field is preserved.
es: ...el campo vacío que queda se conserva.
ja: の後にある空のフィールドが保存されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">후행 빈 필드는 유지됩니다.</font></font>
ru: пустое поле сохраняется.
zh_cn: 后面的空场被保留。

source: where <code>//</code> means global replacement.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">donde </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa reemplazo global.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どこ</font></font> <code>//</code> は、<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">世界的な交換を意味します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 전역 교체를 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">где </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает глобальную замену.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其中</font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">手段全局替换。</font></font>

source: where <code>IFS</code> delimit words based on the separator and <code>()</code> is used to create an <a href="http://www.linuxjournal.com/content/bash-arrays">array</a>. Then <code>[@]</code> is used to return each item as a separate word.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">donde </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> delimita palabras basadas en el separador y </font></font> <code>()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa para crear una </font></font><a href="http://www.linuxjournal.com/content/bash-arrays"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Entonces </font></font> <code>[@]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa para devolver cada elemento como una palabra separada.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、</font></font> <code>IFS</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区切り文字に基づいて単語を区切り、</font></font> <code>()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><a href="http://www.linuxjournal.com/content/bash-arrays"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作成に使用されます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">次に、</font></font> <code>[@]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して、各アイテムを個別の単語として返します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 </font></font> <code>IFS</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구분 기호를 기준으로 단어를 구분하고 </font></font> <code>()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><a href="http://www.linuxjournal.com/content/bash-arrays"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 만드는 데 사용됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그런 다음 </font></font> <code>[@]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 각 항목을 별도의 단어로 반환합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">где </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разграничивает слова на основе разделителя и </font></font> <code>()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется для создания </font></font><a href="http://www.linuxjournal.com/content/bash-arrays"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массива</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Затем </font></font> <code>[@]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется для возврата каждого элемента в виде отдельного слова.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其中，</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基于分隔符和</font></font> <code>()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分隔单词</font><font style="vertical-align: inherit;">以创建</font></font><a href="http://www.linuxjournal.com/content/bash-arrays"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">然后，使用</font></font> <code>[@]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将每个项目作为一个单独的单词返回。</font></font>

source: will give
es: dará
ja: 与える
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">줄게</font></font>
ru: даст
zh_cn: 会给

source: you can apply awk to many situations
es: puedes aplicar awk a muchas situaciones
ja: 幾らでも応用が利く
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 상황에 awk를 적용 할 수 있습니다</font></font>
ru: вы можете применить awk во многих ситуациях
zh_cn: 你可以把awk应用到很多情况下

source: you will get:
es: ...que obtendrás:
ja: あなたが得ることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 얻을 것이다 :</font></font>
ru: ты получишь:
zh_cn: 你会得到。
