Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Of course your can store each email address by redefining the awk print field.
es: Por supuesto que puedes almacenar cada dirección de correo electrónico redefiniendo el campo de impresión awk.
ja: もちろん、 awk の印刷フィールドを再定義することで、各メールアドレスを保存することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 awk 인쇄 필드를 재정 의하여 각 이메일 주소를 저장할 수 있습니다.</font></font>
ru: Конечно,вы можете хранить каждый адрес электронной почты,переопределив поле для печати awk.
zh_cn: 当然你可以通过重新定义awk打印字段来存储每个电子邮件地址。

source: Okay guys!
es: ¡Está bien,chicos!
ja: みんな!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">얘들 아!</font></font>
ru: Ладно,ребята!
zh_cn: 好了,伙计们!

source: Once the array is defined, you can use a simple loop to process each field (or, rather, each element in the array you've now defined):
es: Una vez definida la matriz,puedes usar un simple bucle para procesar cada campo (o,mejor dicho,cada elemento de la matriz que has definido ahora):
ja: 配列を定義したら、単純なループを使って各フィールド(というか、今定義した配列の各要素)を処理することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열이 정의되면 간단한 루프를 사용하여 각 필드 (또는 이제 정의한 배열의 각 요소)를 처리 할 수 ​​있습니다.</font></font>
ru: После определения массива можно использовать простой цикл для обработки каждого поля (или,точнее,каждого элемента в массиве,который вы сейчас определили):
zh_cn: 一旦定义了数组,你可以使用一个简单的循环来处理每个字段(或者说,你现在定义的数组中的每个元素)。

source: Or you could drop each field from the array after processing using a <em>shifting</em> approach, which I like:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O bien, puede eliminar cada campo de la matriz despu&eacute;s de procesar utilizando un </font><font style="vertical-align: inherit;">enfoque de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">desplazamiento</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que me gusta:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シフト</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプローチ</font><font style="vertical-align: inherit;">を使用して処理した後、配列から各フィールドを削除することもできます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시프트</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방식을 </font><font style="vertical-align: inherit;">사용하여 처리 한 후 배열에서 각 필드를 삭제할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или вы можете удалить каждое поле из массива после обработки, используя </font><font style="vertical-align: inherit;">подход </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">смещения</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который мне нравится:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，您可以使用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">平移</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">在处理后从数组中删除每个字段</font><font style="vertical-align: inherit;">，我喜欢：</font></font>

source: Other example (delimiters at beginning and end):
es: Otro ejemplo (delimitadores al principio y al final):
ja: その他の例(先頭と末尾の区切り文字)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 예 (시작과 끝의 구분자) :</font></font>
ru: Другой пример (разделители в начале и в конце):
zh_cn: 其他例子(首尾的定界符)。

source: RE: <code>IFS</code> solution, I tried this and it works, I keep the old <code>IFS</code> and then restore it:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RE: </font><font style="vertical-align: inherit;">soluci&oacute;n </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , prob&eacute; esto y funciona, conservo el viejo </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y luego lo restauro:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RE：</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション、私はこれを試してみましたが、動作します。古い</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を保持してから</font><font style="vertical-align: inherit;">復元します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RE : </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션, 이것을 시도하고 작동하며 이전 </font></font> <code>IFS</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유지 </font><font style="vertical-align: inherit;">한 다음 복원하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RE: </font><font style="vertical-align: inherit;">Решение </font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я попробовал это, и оно работает, я сохраняю старый </font></font> <code>IFS</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем восстанавливаю его:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RE：</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案，我尝试过并且可以解决，我保留了旧的</font></font> <code>IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后将其还原：</font></font>

source: Requested string
es: La cuerda solicitada
ja: 要求された文字列
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요청 된 문자열</font></font>
ru: Запрашиваемая строка
zh_cn: 要求的字符串

source: Since Bash 4.4, the builtin <code>mapfile</code> (aka <code>readarray</code>) supports the <code>-d</code> option to specify a delimiter. Hence another canonical way is:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde Bash 4.4, el </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> incorporado </font><font style="vertical-align: inherit;">(tambi&eacute;n </font></font> <code>readarray</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como </font><font style="vertical-align: inherit;">readarray</font><font style="vertical-align: inherit;"> ) admite la </font><font style="vertical-align: inherit;">opci&oacute;n </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para especificar un delimitador. </font><font style="vertical-align: inherit;">Por lo tanto, otra forma can&oacute;nica es:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 4.4以降、組み込みの</font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（別名</font></font> <code>readarray</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）は、</font><font style="vertical-align: inherit;">区切り文字を指定する</font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプションを</font><font style="vertical-align: inherit;">サポートし</font><font style="vertical-align: inherit;">ています。</font><font style="vertical-align: inherit;">したがって、別の標準的な方法は次のとおりです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 4.4부터 내장 </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (일명 </font></font> <code>readarray</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )은 </font><font style="vertical-align: inherit;">구분 기호를 지정하는 </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 옵션을 </font><font style="vertical-align: inherit;">지원합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">따라서 또 다른 표준 방법은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с Bash 4.4, встроенный </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (он же </font></font> <code>readarray</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) поддерживает </font><font style="vertical-align: inherit;">опцию </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для указания разделителя. </font><font style="vertical-align: inherit;">Отсюда и другой канонический способ:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于击4.4，内建的</font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（又名</font></font> <code>readarray</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）支持</font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选项来指定的分隔符。</font><font style="vertical-align: inherit;">因此，另一种规范的方式是：</font></font>

source: Split string based on delimiter in <a href="/questions/tagged/bash">bash</a> (version &gt;=4.2)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Divisi&oacute;n de cadena basada en delimitador en </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (versi&oacute;n&gt; = 4.2)</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区切り文字に基づいて文字列を分割する</font><font style="vertical-align: inherit;">（バージョン&gt; = 4.2）</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구분 기호를 기반으로 분할 문자열 </font><font style="vertical-align: inherit;">(버전&gt; = 4.2)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Разделить строку на основе разделителя в </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (версия&gt; = 4.2)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基于定界符分割字符串</font><font style="vertical-align: inherit;">（版本&gt; = 4.2）</font></font>

source: Split string based on delimiter in <a href="/questions/tagged/shell">shell</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cadena dividida basada en delimitador en </font></font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">shell</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="/questions/tagged/shell"><font style="vertical-align: inherit;">シェルの</font></a><font style="vertical-align: inherit;">区切り文字に基づいて文字列を分割する</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="/questions/tagged/shell"><font style="vertical-align: inherit;">쉘의</font></a><font style="vertical-align: inherit;"> 구분 기호를 기반으로 분할 문자열</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Разделить строку на основе разделителя в </font></font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">оболочке</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font><a href="/questions/tagged/shell"><font style="vertical-align: inherit;">shell中</font></a><font style="vertical-align: inherit;">基于分隔符分割字符串</font></font><font style="vertical-align: inherit;"></font>

source: System : Ubuntu 12.04.1
es: Sistema:Ubuntu 12.04.1
ja: システム.Ubuntu 12.04.1
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시스템 : 우분투 12.04.1</font></font>
ru: Система:Убунту 12.04.1
zh_cn: 系统:[...]

source: Taken from <em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796">Bash shell script split array</a></em>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tomado de la </font></font><em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz dividida de script de shell Bash</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bashシェルスクリプトの分割配列</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><em><font style="vertical-align: inherit;">取得</font></em><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 쉘 스크립트 분할 배열</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 가져 왔습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Взято из </font></font><em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">скриптового массива Bash</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">取自</font></font><em><a href="http://www.linuxquestions.org/questions/programming-9/bash-shell-script-split-array-383848/#post3270796"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash shell脚本split array</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: The codeblock below works well in <a href="/questions/tagged/bash">bash</a> (including Mac OS's <code>bash</code>), <a href="/questions/tagged/dash">dash</a>, <a href="/questions/tagged/ksh">ksh</a>, and <a href="/questions/tagged/busybox">busybox</a>'s <a href="/questions/tagged/ash">ash</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El bloque de c&oacute;digo siguiente funciona bien en la </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fiesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (incluyendo Mac OS de </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), </font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tablero</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y </font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 's </font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de cenizas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下の</font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;">コード</font></a><font style="vertical-align: inherit;">ブロックは、</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（Mac OSの</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を含む</font><font style="vertical-align: inherit;">）、</font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ashで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">適切に機能し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 코드 블록은 </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Mac OS </font></font> <code>bash</code> 포함<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), </font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">재</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 잘 작동합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В кодоблок НИЖЕ хорошо работает в </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Баш</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (включая Mac OS в </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), </font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тире</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">KSH</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BusyBox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &laquo;сек </font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">золы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下面的代码块在</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（包括Mac OS的</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），</font></font><a href="/questions/tagged/dash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font><a href="/questions/tagged/ksh"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ksh</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="/questions/tagged/busybox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">busybox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font><a href="/questions/tagged/ash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ash中运行良好</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
