Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you can't use <code>bash</code>, or if you want to write something that can be used in many different shells, you often <strong>can't</strong> use <em>bashisms</em> -- and this includes the arrays we've been using in the solutions above.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si no puede usar </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , o si desea escribir algo que se pueda usar en muchos shells diferentes, a menudo </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no puede</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y esto incluye los arreglos que hemos estado usando en las soluciones anteriores.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>bash</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用できない場合</font><font style="vertical-align: inherit;">、または多くの異なるシェルで使用できるものを作成したい場合</font><font style="vertical-align: inherit;">は、</font><em><font style="vertical-align: inherit;">bashismを</font></em><font style="vertical-align: inherit;">使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">できない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こと</font><strong><font style="vertical-align: inherit;">が</font></strong><font style="vertical-align: inherit;">よく</font><strong><font style="vertical-align: inherit;">あり</font></strong><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これには、上記のソリューションで使用していた配列が含まれます。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font> <code>bash</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 없거나 </font><font style="vertical-align: inherit;">많은 다른 쉘에서 사용할 수있는 것을 쓰려면 종종 </font><em><font style="vertical-align: inherit;">bashism을</font></em><font style="vertical-align: inherit;"> 사용할 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수 없습니다.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여기에는 위의 솔루션에서 사용한 배열이 포함됩니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы не можете использовать </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , или если вы хотите написать что-то, что можно использовать во многих различных оболочках, вы часто </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не можете</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использовать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - и это включает в себя массивы, которые мы использовали в решениях выше.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您不能使用</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，或者想要编写可以在许多不同的shell中使用的东西，则通常</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不能</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bashisms</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">－这包括我们在上面的解决方案中一直使用的数组。</font></font>

source: If you don't mind processing them immediately, I like to do this:
es: Si no te importa procesarlos inmediatamente,me gusta hacer esto:
ja: すぐに処理しても構わないのであれば、私はこうするのが好きです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉시 처리하는 것이 마음에 들지 않으면 다음과 같이하십시오.</font></font>
ru: Если вы не против обработать их немедленно,я люблю это делать:
zh_cn: 如果你不介意马上处理,我喜欢这样做。

source: If you don't want to include empty fields, you could do the following:
es: Si no quieres incluir los campos vacíos,podrías hacer lo siguiente:
ja: 空のフィールドを入れたくない場合は、以下のようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빈 필드를 포함하지 않으려면 다음을 수행하십시오.</font></font>
ru: Если вы не хотите включать пустые поля,вы можете сделать следующее:
zh_cn: 如果你不想包含空的字段,你可以做以下操作。

source: If you just have one colon you can do that:
es: Si sólo tienes un colon,puedes hacerlo:
ja: コロンが1つあるだけで、それができるのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">콜론이 하나만 있다면 그렇게 할 수 있습니다.</font></font>
ru: Если у тебя только одна толстая кишка,ты можешь это сделать:
zh_cn: 如果你只有一个结肠,你可以做到这一点。

source: If you've any code after that, you also need to restore <code>$IFS</code>, e.g. <code>unset IFS</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si tiene alg&uacute;n c&oacute;digo despu&eacute;s de eso, tambi&eacute;n necesita restaurar </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por ejemplo, </font></font> <code>unset IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その後にコードがある場合は、</font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を復元する必要もあります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">たとえば、</font></font> <code>unset IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 후 코드가 있으면 </font> <code>unset IFS</code> <font style="vertical-align: inherit;"> 와 같이 </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 복원해야합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если после этого у вас есть какой-либо код, вам также необходимо восстановить </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , например, </font></font> <code>unset IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果之后有任何代码，则还需要还原</font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，例如，未</font></font> <code>unset IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: In <em>pure</em><code>bash</code>, we can create an <em>array</em> with elements split by a temporary value for <em><a href="https://mywiki.wooledge.org/IFS">IFS</a></em> (the <em>input field separator</em>). The IFS, among other things, tells <code>bash</code> which character(s) it should treat as a delimiter between elements when defining an array:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pure </font></font></em> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos crear una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con elementos divididos por un valor temporal para </font></font><em><a href="https://mywiki.wooledge.org/IFS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">separador de campo de entrada</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">El IFS, entre otras cosas, le dice a </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> qu&eacute; caracteres debe tratar como un delimitador entre elementos al definir una matriz:</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">純粋な</font></font></em> <code>bash</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、我々が作成することができ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、アレイ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のための一時的な値で要素分割とを</font></font><em><a href="https://mywiki.wooledge.org/IFS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">入力フィールドセパレータ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">とりわけ、IFSは</font><font style="vertical-align: inherit;">、配列を定義するときに要素間の区切り文字として処理する必要がある文字を</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に指示します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순수 </font></font></em> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서는 </font><em><a href="https://mywiki.wooledge.org/IFS"><font style="vertical-align: inherit;">IFS</font></a></em><font style="vertical-align: inherit;"> 의 임시 값 </font><font style="vertical-align: inherit;">( </font><em><font style="vertical-align: inherit;">입력 필드 구분 기호</font></em><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">으로 요소를 나누는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">만들 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">IFS는 무엇보다도 </font> <code>bash</code> <font style="vertical-align: inherit;"> 에게 배열을 정의 할 때 어떤 문자를 요소 사이의 구분자로 취급해야하는지 </font><font style="vertical-align: inherit;">알려줍니다 </font><font style="vertical-align: inherit;">.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чистом </font></font></em> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мы можем создать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массив</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с элементами, разделенными временным значением для </font></font><em><a href="https://mywiki.wooledge.org/IFS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">разделитель входного поля</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">IFS, помимо прочего, сообщает </font></font> <code>bash</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> какие символы он должен рассматривать как разделитель между элементами при определении массива:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">纯</font></font></em> <code>bash</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我们可以创建一个</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组，</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其中元素被</font></font><em><a href="https://mywiki.wooledge.org/IFS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输入字段分隔符</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">的临时值分割</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">IFS会告诉</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在定义数组时应将哪些字符视为元素之间的分隔符：</font></font>

source: In Android shell, most of the proposed methods just do not work:
es: En la concha de un androide,la mayoría de los métodos propuestos no funcionan:
ja: Androidシェルでは、提案された方法のほとんどが機能しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Android 셸에서 제안 된 방법의 대부분은 작동하지 않습니다.</font></font>
ru: В оболочке Android большинство предложенных методов просто не работают:
zh_cn: 在安卓shell中,大部分提出的方法都是行不通的。

source: In Bash, a bullet proof way, that will work even if your variable contains newlines:
es: En Bash,una forma a prueba de balas,que funcionará incluso si su variable contiene nuevas líneas:
ja: Bashでは、変数に改行が含まれていても動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash에서는 방탄 방법으로 변수에 줄 바꿈이 포함되어 있어도 작동합니다.</font></font>
ru: В Bash,пуленепробиваемый способ,который будет работать,даже если ваша переменная содержит новые строки:
zh_cn: 在Bash中,用子弹头证明的方式,即使你的变量包含了换行符,也能发挥作用。

source: In both cases a sub-list can be composed within the loop is persistent after the loop has completed. This is useful when manipulating lists in memory, instead storing lists in files. {p.s. keep calm and carry on B-) }
es: En ambos casos una sub-lista puede ser compuesta dentro del bucle es persistente después de que el bucle se ha completado.Esto es útil cuando se manipulan listas en la memoria,en lugar de almacenar listas en archivos.{p.s.mantener la calma y continuar B-)}
ja: どちらの場合も、ループ内でサブリストを構成することができ、ループが完了した後も永続化されます。これは、リストをファイルに格納する代わりに、メモリ内でリストを操作する場合に便利です。p.s.keep calm and carry on B-)}
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 경우 모두 루프가 완료된 후에 루프 내에서 하위 목록을 구성 할 수 있습니다. </font><font style="vertical-align: inherit;">이것은 목록을 파일로 저장하는 대신 메모리에서 목록을 조작 할 때 유용합니다. </font><font style="vertical-align: inherit;">{ps는 평온을 유지하고 B를 계속한다)}</font></font>
ru: В обоих случаях под-лист может быть составлен внутри цикла постоянно после его завершения.Это полезно при манипулировании списками в памяти,вместо того,чтобы хранить их в файлах.{p.s.сохранять спокойствие и продолжать B-).}
zh_cn: 在这两种情况下,循环内的子列表可以在循环完成后持久化。这在内存中操作列表时非常有用,而不是将列表存储在文件中。{p.s.s.保持冷静,继续进行B-)}

source: In newer versions of <code>bash</code>, prefixing a command with an IFS definition changes the IFS for that command <em>only</em> and resets it to the previous value immediately afterwards. This means we can do the above in just one line:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En las nuevas versiones de </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , anteponiendo un comando con una definici&oacute;n de IFS IFS para los cambios de ese comando </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y se restablece al valor anterior inmediatamente despu&eacute;s. </font><font style="vertical-align: inherit;">Esto significa que podemos hacer lo anterior en una sola l&iacute;nea:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">新しいバージョンの</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、コマンドの前にIFS定義を付けると、そのコマンドのIFS </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が変更され、</font><font style="vertical-align: inherit;">直後に以前の値にリセットされます。</font><font style="vertical-align: inherit;">これは、上記を1行で実行できることを意味します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최신 버전의 </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 명령 앞에 IFS 정의를 추가하면 해당 명령에 대한 IFS </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">만</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변경되고 </font><font style="vertical-align: inherit;">바로 이전 값으로 재설정됩니다. </font><font style="vertical-align: inherit;">이것은 우리가 한 줄로 위의 작업을 수행 할 수 있음을 의미합니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В более новых версиях </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , предварив команду с определением МФСА изменяет IFS для этой команды </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">только</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и сбрасывает его в предыдущее значение сразу же после этого. </font><font style="vertical-align: inherit;">Это означает, что мы можем сделать выше всего в одной строке:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在较新版本的</font></font> <code>bash</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，为命令添加IFS定义前缀</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只会</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改该命令的IFS，</font><font style="vertical-align: inherit;">然后立即将其重置为先前的值。</font><font style="vertical-align: inherit;">这意味着我们只需一行即可完成上述操作：</font></font>

source: In newer versions of <code>bash</code>, you can also play with the command <code>mapfile</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En las versiones m&aacute;s recientes de </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , tambi&eacute;n puedes jugar con el comando </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">新しいバージョンの</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、コマンド</font></font> <code>mapfile</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遊ぶこともでき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최신 버전의 </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서는 </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령을 사용할 수도 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В новых версиях </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы также можете поиграть с командой </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在较新版本的</font></font> <code>bash</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您还可以使用命令</font></font> <code>mapfile</code> 进行<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">播放</font><font style="vertical-align: inherit;">：</font></font>
