Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Apart from the fantastic answers that were already provided, if it is just a matter of printing out the data you may consider using <code>awk</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s de las fant&aacute;sticas respuestas que ya se proporcionaron, si solo se trata de imprimir los datos, puede considerar usar </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すでに提供されている素晴らしい答えは別として、データを印刷するだけの問題であれば、</font></font> <code>awk</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用を検討してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 제공된 환상적인 답변 외에도 </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용을 고려할 수있는 데이터를 인쇄하는 것만 </font><font style="vertical-align: inherit;">큼</font><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Помимо фантастических ответов, которые уже были предоставлены, если это просто вопрос распечатки данных, вы можете использовать </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除了已经提供的绝妙答案之外，如果仅打印出数据，您可以考虑使用</font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Arrays are not used: Reading a string into an array using <code>read</code> requires the flag <code>-a</code> in Bash and <code>-A</code> in zsh.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No se utilizan matrices: la lectura de una cadena en una matriz mediante </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> requiere el indicador </font></font> <code>-a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en Bash y </font></font> <code>-A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en zsh.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列は使用されません。readを使用して文字列を配列に</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font><font style="vertical-align: inherit;">Bash </font><font style="vertical-align: inherit;">では</font></font> <code>-a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、zshでは</font></font> <code>-A</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグが必要</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열은 사용되지 않습니다. </font></font> <code>read</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 문자열을 배열로 </font><font style="vertical-align: inherit;">읽으</font><font style="vertical-align: inherit;"> 려면 </font></font> <code>-a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 Bash </font><font style="vertical-align: inherit;">플래그 </font><font style="vertical-align: inherit;">, </font></font> <code>-A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 zsh </font><font style="vertical-align: inherit;">플래그가 필요합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Массивы не используются: для чтения строки в массив с использованием </font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> требуется флаг </font></font> <code>-a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Bash и </font></font> <code>-A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в zsh.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不使用数组：使用</font></font> <code>read</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将字符串读入数组</font><font style="vertical-align: inherit;">需要</font><font style="vertical-align: inherit;">Bash中的</font></font> <code>-a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志</font><font style="vertical-align: inherit;">和</font><font style="vertical-align: inherit;">zsh中的</font></font> <code>-A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志</font><font style="vertical-align: inherit;">。</font></font>

source: As explained by <a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1">Score_Under</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Seg&uacute;n lo explicado por </font></font><a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Score_Under</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Score_Underで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明した</font><font style="vertical-align: inherit;">ように</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Score_Under에서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설명한 바와 같이 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как объясняет </font></font><a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Score_Under</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如</font></font><a href="https://stackoverflow.com/posts/comments/47972612?noredirect=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Score_Under所述</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: BTW, when I tried
es: Por cierto,cuando intenté
ja: ところで、私が試してみたところ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BTW, 내가 시도했을 때</font></font>
ru: Кстати,когда я пытался
zh_cn: BTW,当我试着

source: Basically it removes every character other than <code>;</code> making <code>delims</code> eg. <code>;;;</code>. Then it does <code>for</code> loop from <code>1</code> to <code>number-of-delimiters</code> as counted by <code>${#delims}</code>. The final step is to safely get the <code>$i</code>th part using <code>cut</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B&aacute;sicamente elimina todos los caracteres que no sean </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">haciendo </font></font> <code>delims</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por ejemplo. </font></font> <code>;;;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Luego lo hace </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bucle del </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al </font></font> <code>number-of-delimiters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contados por </font></font> <code>${#delims}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">El &uacute;ltimo paso es obtener de forma segura la parte </font></font> <code>$i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的には以外のすべての文字を削除し</font></font> <code>;</code> <font style="vertical-align: inherit;"></font> <code>delims</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作成し</font><font style="vertical-align: inherit;">ます。</font></font> <code>;;;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">次に</font><font style="vertical-align: inherit;">、</font> <code>1</code> <font style="vertical-align: inherit;">から</font> <code>${#delims}</code> <font style="vertical-align: inherit;">によってカウントされる</font> <code>number-of-delimiters</code> <font style="vertical-align: inherit;">までの</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループを</font><font style="vertical-align: inherit;">実行します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">最後のステップは、</font> <code>cut</code> <font style="vertical-align: inherit;">を使用し</font><font style="vertical-align: inherit;">て</font> <code>$i</code> <font style="vertical-align: inherit;">番目のパーツを</font><font style="vertical-align: inherit;">安全に取得すること</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이외의 모든 문자를 제거합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">만드는 </font></font> <code>delims</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 예. </font></font> <code>;;;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그런 다음 </font> <code>${#delims}</code> <font style="vertical-align: inherit;"> 의해 계산 </font> <code>number-of-delimiters</code> <font style="vertical-align: inherit;"> 대로 </font> <code>1</code> <font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">구분 기호</font><font style="vertical-align: inherit;"> 로 </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루프를 </font><font style="vertical-align: inherit;">수행 </font><font style="vertical-align: inherit;">합니다</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">마지막 단계는 </font> <code>cut</code> 을<font style="vertical-align: inherit;"> 사용하여 </font> <code>$i</code> <font style="vertical-align: inherit;"> 번째 부분 </font><font style="vertical-align: inherit;">을 안전하게 얻는 </font><font style="vertical-align: inherit;">것</font><font style="vertical-align: inherit;"> 입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В основном это удаляет каждый символ, кроме </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">создание </font></font> <code>delims</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> например. </font></font> <code>;;;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Затем это делается </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> цикла от </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> до </font></font> <code>number-of-delimiters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> рассчитываемого как </font></font> <code>${#delims}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Последний шаг - безопасно получить </font></font> <code>$i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ю часть, используя </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上，它除去除</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之外的所有其他字符</font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">使</font></font> <code>delims</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如。</font></font> <code>;;;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">随后，它</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">循环从</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到</font></font> <code>number-of-delimiters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为计数由</font></font> <code>${#delims}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">最后一步是</font><font style="vertical-align: inherit;">使用</font> <code>cut</code> <font style="vertical-align: inherit;">安全地获得第</font></font> <code>$i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">个零件</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Be careful, this solution is not always correct. In case you pass "bla@some.com" only, it will assign it to both ADD1 and ADD2.
es: Ten cuidado,esta solución no siempre es correcta.En caso de que sólo pase "bla@some.com",lo asignará tanto a ADD1 como a ADD2.
ja: この解法は必ずしも正しいとは限らないので注意が必要です。bla@some.com」のみを渡した場合、ADD1とADD2の両方に割り当てられます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 솔루션이 항상 올바른 것은 아닙니다. </font><font style="vertical-align: inherit;">"bla@some.com"만 전달하면 ADD1과 ADD2에 모두 할당됩니다.</font></font>
ru: Будьте осторожны,это решение не всегда верно.Если вы передадите только "bla@some.com",то он присвоит его как ADD1,так и ADD2.
zh_cn: 注意,这个方案不一定是正确的。如果你只通过 "bla@some.com",它将同时分配给ADD1和ADD2。

source: Because of two reasons:
es: Por dos razones:
ja: 理由は2つあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 이유 때문에 :</font></font>
ru: По двум причинам:
zh_cn: 因为有两个原因。

source: But you must use gnu xargs, BSD xargs cant support -d delim. If you use apple mac like me. You can install gnu xargs :
es: Pero debes usar gnu xargs,los xargs de BSD no pueden soportar -d delim.Si usas Apple Mac como yo.Puedes instalar gnu xargs :
ja: BSDのxargsは-d delimをサポートしていないので、gnu xargsを使う必要があります。私のようにapple macを使っている人は、gnu xargsを使う必要があります。gnu xargs をインストールすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 gnu xargs를 사용해야합니다. BSD xargs는 -d delim을 지원할 수 없습니다. </font><font style="vertical-align: inherit;">나처럼 애플 맥을 사용한다면 </font><font style="vertical-align: inherit;">gnu xargs를 설치할 수 있습니다 :</font></font>
ru: Но вы должны использовать gnu xargs,BSD xargs не поддерживает -d разграничение.Если вы используете яблочный мак,как я.Вы можете установить gnu xargs :
zh_cn: 但你必须使用gnu xargs,BSD xargs不支持-d delim。如果你和我一样使用苹果mac。你可以安装 gnu xargs :

source: Compared to the other solutions given, this one has the following advantages:
es: En comparación con las otras soluciones dadas,ésta tiene las siguientes ventajas:
ja: 他のソリューションと比較して、このソリューションには以下のような利点があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주어진 다른 솔루션에 비해 다음과 같은 장점이 있습니다.</font></font>
ru: По сравнению с другими представленными решениями,это решение имеет следующие преимущества:
zh_cn: 与给出的其他解决方案相比,这个方案有以下优点。

source: Compatible answer
es: Respuesta compatible
ja: 互換性のある回答
ko: 호환되는 답변
ru: Совместимый ответ
zh_cn: 兼容的答案

source: Explanation: Simple assignment using parenthesis () converts semicolon separated list into an array provided you have correct IFS while doing that. Standard FOR loop handles individual items in that array as usual. Notice that the list given for IN variable must be "hard" quoted, that is, with single ticks.
es: Explicación:La asignación simple usando paréntesis ()convierte la lista separada por punto y coma en una matriz siempre y cuando se tenga el IFS correcto mientras se hace eso.El bucle FOR estándar maneja los elementos individuales de esa matriz como de costumbre.Fíjese que la lista dada para la variable IN debe ser citada "duramente",es decir,con un solo tic.
ja: 説明します。括弧()を使った単純な代入は、セミコロンで区切られたリストを配列に変換します。標準的なFORループは、通常通り、その配列内の個々の項目を処理します。IN変数に与えられたリストは、"ハード "クォートされていなければならないことに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명 : 괄호 ()를 사용한 단순 지정은 세미콜론으로 구분 된 목록을 올바른 IFS가있는 경우 배열로 변환합니다. </font><font style="vertical-align: inherit;">표준 FOR 루프는 평소와 같이 해당 배열의 개별 항목을 처리합니다. </font><font style="vertical-align: inherit;">IN 변수에 제공된 목록은 "하드"따옴표로 묶어야합니다. 즉, 단일 틱이 있어야합니다.</font></font>
ru: Объяснение:Простое присваивание с помощью скобок ()преобразует список,разделенный точкой с запятой,в массив при условии,что при этом вы имеете правильный IFS.Стандартный цикл FOR,как обычно,обрабатывает отдельные элементы в этом массиве.Обратите внимание,что список,заданный для переменной IN,должен быть "жестко" цитируемым,то есть с одиночными тиками.
zh_cn: 解释。使用括号()将分号分隔的列表转换为数组,只要你在做这个动作的时候有正确的IFS,那么简单的赋值就可以了。标准的FOR循环会像往常一样处理数组中的单个项目。注意,给IN变量的列表必须是 "硬 "引号,也就是说,要用单点符号。

source: For instance, the command
es: Por ejemplo,el comando
ja: 例えば、コマンド
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어</font></font>
ru: Например,команда
zh_cn: 例如,该命令
