Repository: rueisnom/feedback
Catalog: xlf/91/88/86/918886.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This construction replaces all occurrences of <code>';'</code> (the initial <code>//</code> means global replace) in the string <code>IN</code> with <code>' '</code> (a single space), then interprets the space-delimited string as an array (that's what the surrounding parentheses do).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta construcci&oacute;n reemplaza todas las ocurrencias de </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(el </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> inicial </font><font style="vertical-align: inherit;">significa reemplazo global) en la cadena </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (un solo espacio), luego interpreta la cadena delimitada por espacios como una matriz (eso es lo que hacen los par&eacute;ntesis circundantes).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この構造は、出現するすべての</font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を置き換え</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">（最初の</font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はグローバル置換を意味します）文字列</font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（単一のスペース）に</font><font style="vertical-align: inherit;">置き換え</font><font style="vertical-align: inherit;">、スペースで区切られた文字列を配列として解釈します（それが括弧で囲まれています）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 구조는 </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 모든 발생을 대체합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">문자열 </font> <code>IN</code> <font style="vertical-align: inherit;"> 에서 </font> <code>' '</code> <font style="vertical-align: inherit;"> (단일 공백)으로 ( </font><font style="vertical-align: inherit;">초기 </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 전역 바꾸기를 의미 함) </font><font style="vertical-align: inherit;">공백으로 구분 된 문자열을 배열로 해석합니다 (주변 괄호의 기능).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Эта конструкция заменяет все вхождения </font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(начальная буква </font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает глобальную замену) в строке </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (один пробел), а затем интерпретирует строку, разделенную пробелом, как массив (так поступают окружающие скобки).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此构造替换了所有出现的</font></font> <code>';'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（首字母</font></font> <code>//</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示全局替换），在字符串</font></font> <code>IN</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（单个空格），然后将以空格分隔的字符串解释为数组（这是括号引起的）。</font></font>

source: This gets more useful when you have a delimited log file with rows like this:
es: Esto se vuelve más útil cuando tienes un archivo de registro delimitado con filas como esta:
ja: これは、このような行を持つ区切りログファイルがある場合に、より便利になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 행이있는 구분 된 로그 파일이있는 경우 더 유용합니다.</font></font>
ru: Это становится более полезным,когда у вас есть разделенный лог-файл с такими строками:
zh_cn: 当你有一个以这样的行为分隔符的日志文件时,这就更有用了。

source: This is the simplest way to do it.
es: Esta es la forma más simple de hacerlo.
ja: これが一番簡単な方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 간단한 방법입니다.</font></font>
ru: Это самый простой способ.
zh_cn: 这是最简单的方法。

source: This only sets IFS in a subshell, so you don't have to worry about saving and restoring its value.
es: Esto sólo establece el IFS en una subcapa,así que no tienes que preocuparte por salvar y restaurar su valor.
ja: これはサブシェルにIFSを設定するだけなので、保存して値を元に戻す心配はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 서브 쉘에 IFS 만 설정하므로 값을 저장하고 복원하는 것에 대해 걱정할 필요가 없습니다.</font></font>
ru: Это только устанавливает IFS в подоболочку,так что вам не нужно беспокоиться о сохранении и восстановлении его стоимости.
zh_cn: 这只在子壳中设置IFS,所以你不用担心保存和恢复它的值。

source: This output may, for instance, be piped to other commands. Example:
es: Esta salida puede,por ejemplo,ser canalizada a otros comandos.Por ejemplo:
ja: この出力は、例えば、他のコマンドにパイプすることができます。例
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어이 출력은 다른 명령으로 파이프 될 수 있습니다. </font><font style="vertical-align: inherit;">예:</font></font>
ru: Этот вывод может,например,быть передан на другие команды.Пример:
zh_cn: 例如,这个输出可以被传送到其他命令中。例如:

source: This sets the field separator to <code>;</code>, so that it can loop through the fields with a <code>for</code> loop and print accordingly.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto establece el separador de campo en </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, para que pueda recorrer los campos con un </font><font style="vertical-align: inherit;">ciclo </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e imprimir en consecuencia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、フィールドセパレータがに設定され</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループで</font><font style="vertical-align: inherit;">フィールドを</font><font style="vertical-align: inherit;">ループし、それに応じ</font><font style="vertical-align: inherit;">て出力できるようにし</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필드 구분 기호를 </font></font> <code>;</code> <font style="vertical-align: inherit;"></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루프 </font><font style="vertical-align: inherit;">를 사용하여 필드 </font><font style="vertical-align: inherit;">를</font><font style="vertical-align: inherit;"> 반복하고 그에 따라 인쇄 </font><font style="vertical-align: inherit;">할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это устанавливает разделитель поля на </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, так что он может перебирать поля с помощью </font><font style="vertical-align: inherit;">цикла </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и печатать соответственно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这将字段分隔符设置为</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，以便它可以使用</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">循环</font><font style="vertical-align: inherit;">遍历字段</font><font style="vertical-align: inherit;">并进行相应打印。</font></font>

source: This syntax preserve special chars, newlines and empty fields!
es: ¡Esta sintaxis conserva caracteres especiales,líneas nuevas y campos vacíos!
ja: この構文は、特殊文字、改行、空のフィールドを保存します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 구문은 특수 문자, 줄 바꿈 및 빈 필드를 유지합니다!</font></font>
ru: Этот синтаксис сохраняет специальные символы,новые строки и пустые поля!
zh_cn: 这个语法保留了特殊字符、换行和空字段!

source: This worked for me:
es: Esto funcionó para mí:
ja: これは私には効果がありました。
ko: 이것은 나를 위해 일했다 :
ru: Это сработало на меня:
zh_cn: 这对我来说很有效。

source: This works in cases where there are no spaces to worry about, which solved my problem, but may not solve yours. Go with the <code>$IFS</code> solution(s) in that case.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto funciona en casos donde no hay espacios de los que preocuparse, lo que resolvi&oacute; mi problema, pero puede que no resuelva el tuyo. </font><font style="vertical-align: inherit;">Vaya con la </font><font style="vertical-align: inherit;">(s) soluci&oacute;n (es) de </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en ese caso.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは心配するスペースがない場合に機能し、私の問題は解決しましたが、あなたの問題は解決しない可能性があります。</font><font style="vertical-align: inherit;">その場合</font><font style="vertical-align: inherit;">は</font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューションを使用してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 걱정할 공간이 없어 내 문제를 해결했지만 귀하의 문제를 해결할 수없는 경우에 작동합니다. </font><font style="vertical-align: inherit;">이 경우 </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션으로 </font><font style="vertical-align: inherit;">이동하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это работает в тех случаях, когда нет места для беспокойства, что решило мою проблему, но не может решить вашу. </font><font style="vertical-align: inherit;">В этом случае используйте </font><font style="vertical-align: inherit;">решение (я) </font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这在没有空间可担心的情况下有效，解决了我的问题，但可能无法解决您的问题。</font><font style="vertical-align: inherit;">在这种情况下</font><font style="vertical-align: inherit;">，请使用</font></font> <code>$IFS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案。</font></font>

source: Two bourne-ish alternatives where neither require bash arrays:
es: Dos alternativas de tipo bourne en las que ninguna de las dos requiere arreglos de bazofia:
ja: どちらも bash 配列を必要としないボーン的な代替案が 2 つあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash 배열이 필요하지 않은 두 가지 번거로운 대안 :</font></font>
ru: Два варианта в стиле Борна,где ни один из них не требует массивов баш:
zh_cn: 两种波恩式的选择,都不需要bash数组。

source: Update for Bash&ge;4.4
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizaci&oacute;n para Bash&ge;4.4</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash&ge;4.4の更新</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash&ge;4.4 업데이트</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновление для Bash&ge;4.4</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash&ge;4.4的更新</font></font>

source: Update: recent <a href="/questions/tagged/bash">bash</a> &gt;= 4.4
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizaci&oacute;n: </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> reciente </font><font style="vertical-align: inherit;">&gt; = 4.4</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新：最近の</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &gt; = 4.4</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업데이트 : 최근 </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배쉬</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &gt; = 4.4</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновление: недавний </font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &gt; = 4.4</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新：最近</font></font><a href="/questions/tagged/bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &gt; = 4.4</font></font>

source: Use the <code>set</code> built-in to load up the <code>$@</code> array:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use el </font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> incorporado para cargar la </font><font style="vertical-align: inherit;">matriz </font></font> <code>$@</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組み込み</font><font style="vertical-align: inherit;">の</font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して</font></font> <code>$@</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列</font><font style="vertical-align: inherit;">をロードします</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내장 </font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 </font></font> <code>$@</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열 </font><font style="vertical-align: inherit;">을로드하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font><font style="vertical-align: inherit;">встроенный </font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для загрузки </font><font style="vertical-align: inherit;">массива </font></font> <code>$@</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">内置</font><font style="vertical-align: inherit;">的</font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加载</font></font> <code>$@</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组：</font></font>

source: Using the above syntax, we can create an approach where we extract substring "elements" from the string by deleting the substrings up to or after the delimiter.
es: Utilizando la sintaxis anterior,podemos crear un enfoque en el que extraemos "elementos" de la cadena borrando las subcadenas hasta o después del delimitador.
ja: 上記の構文を用いて、デリミタまでの部分文字列を削除したり、デリミタ以降の部分文字列を削除したりして、文字列から部分文字列「要素」を抽出するアプローチを作ることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 구문을 사용하면 구분 기호까지 또는 이후에 하위 문자열을 삭제하여 문자열에서 하위 문자열 "요소"를 추출하는 방법을 만들 수 있습니다.</font></font>
ru: Используя вышеприведенный синтаксис,мы можем создать подход,при котором мы извлекаем "элементы" подстроки из строки,удаляя подстроки до или после разделителя.
zh_cn: 使用上面的语法,我们可以创建一种方法,通过删除分隔符之前或之后的子串,从字符串中提取子串 "元素"。

source: We can see that the string <code>IN</code> has been stored into an array named <code>fields</code>, split on the semicolons:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podemos ver que la cadena </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se ha almacenado en una matriz llamada </font></font> <code>fields</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , divididos en punto y coma:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列</font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">、セミコロンで分割された</font></font> <code>fields</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という名前の配列に格納されている</font><font style="vertical-align: inherit;">ことがわかります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font></font> <code>fields</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라는 배열 </font><font style="vertical-align: inherit;">에 세미콜론으로 분할 </font><font style="vertical-align: inherit;">되어 저장되어 </font><font style="vertical-align: inherit;">있음을 알 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы видим, что строка </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> была сохранена в массив с именем </font></font> <code>fields</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , разделенный точкой с запятой:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以看到字符串</font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已存储在名为</font></font> <code>fields</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的数组中</font><font style="vertical-align: inherit;">，并以分号分隔：</font></font>

source: What does work is:
es: Lo que sí funciona es:
ja: 仕事とは何かというと
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동하는 것 :</font></font>
ru: Что работает,так это то:
zh_cn: 什么是工作是。

source: Why this approach is "the best" for me?
es: ¿Por qué este enfoque es "el mejor" para mí?
ja: なぜ、このアプローチが「自分にとってベスト」なのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법이 왜 "최고"입니까?</font></font>
ru: Почему этот подход "лучший" для меня?
zh_cn: 为什么这种方法对我来说是 "最好的"?

source: With <code>mapfile</code>, you can also skip declaring an array and implicitly "loop" over the delimited elements, calling a function on each:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , tambi&eacute;n puede omitir la declaraci&oacute;n de una matriz y "bucle" impl&iacute;citamente sobre los elementos delimitados, llamando a una funci&oacute;n en cada uno:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、あなたはまた、それぞれの関数を呼び出し、区切られた要素の上に配列し、暗黙的に「ループ」を宣言スキップすることができます：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>mapfile</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하면 </font><font style="vertical-align: inherit;">배열 선언을 건너 뛰고 구분 된 요소를 암시 적으로 "루프"하여 각 함수를 호출 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С помощью </font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы также можете пропустить объявление массива и неявно &laquo;зацикливаться&raquo; на элементах с разделителями, вызывая функцию для каждого:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>mapfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您还可以跳过声明数组的操作，并隐式地&ldquo;循环&rdquo;定界元素，在每个元素上调用一个函数：</font></font>

source: With another input:
es: Con otra entrada:
ja: 別の入力で
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 입력으로 :</font></font>
ru: С помощью другого входа:
zh_cn: 随着另一个输入。

source: Without setting the IFS
es: Sin configurar el IFS
ja: IFSを設定しない場合
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IFS를 설정하지 않고</font></font>
ru: Без установки IFS
zh_cn: 在不设置IFS的情况下

source: You can obviously put that into a loop, and iterate the -f parameter to pull each field independently.
es: Obviamente puedes poner eso en un bucle,e iterar el parámetro -f para tirar de cada campo independientemente.
ja: これをループに入れて、-fパラメータを反復して各フィールドを独立して引っ張ることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분명히 루프에 넣고 -f 매개 변수를 반복하여 각 필드를 독립적으로 가져옵니다.</font></font>
ru: Очевидно,что это можно поместить в цикл,и выполнить итерацию параметра -f,чтобы вытащить каждое поле независимо.
zh_cn: 显然,你可以把它放到一个循环中,然后迭代-f参数来独立拉出每个字段。
