Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: ... the loop unexpectedly outputs "i is 5" five times:
es: ...el bucle inesperadamente produce "i es 5" cinco veces:
ja: ...ループは予期せず「iは5」を5回出力してしまう。
ko: ... 루프가 예기치 않게 "i is 5"를 다섯 번 출력합니다.
ru: ...петля неожиданно 5 раз выдает "i is 5":
zh_cn: ...循环出人意料地输出 "i是5"5次。

source: ... the output remains unchanged as long as we stick with <code>let</code>. In contrast, if we had used <code>var i</code> instead:
es: ... la salida permanece sin cambios mientras nos quedemos con <code>let</code> . Por el contrario, si hubi&eacute;ramos usado <code>var i</code> en su lugar:
ja: ... <code>let</code> を使い続ける限り、出力は変わりません。 対照的に、代わりに <code>var i</code> を使用した場合：
ko: ... <code>let</code> 을 사용 하는 한 출력은 변경되지 않습니다. 반대로, 만약 우리가 대신 <code>var i</code> 를 사용했다면 :
ru: ... вывод остается неизменным, пока мы придерживаемся <code>let</code> . Напротив, если бы мы использовали вместо этого <code>var i</code> :
zh_cn: ...只要我们坚持 <code>let</code> ，输出将保持不变。 相反，如果我们改用 <code>var i</code> ：

source: <a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">This table</a> on Wikipedia shows which browsers support Javascript 1.7.
es: <a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">Esta tabla</a> en Wikipedia muestra qu&eacute; navegadores admiten Javascript 1.7.
ja: Wikipediaの<a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">この表は</a> 、Javascript 1.7をサポートするブラウザーを示しています。
ko: Wikipedia <a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">의이 표</a> 는 Javascript 1.7을 지원하는 브라우저를 보여줍니다.
ru: <a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">Эта таблица</a> в Википедии показывает, какие браузеры поддерживают Javascript 1.7.
zh_cn: 维基百科上的<a href="http://en.wikipedia.org/wiki/JavaScript#Version_history">此表</a>显示了哪些浏览器支持Javascript 1.7。

source: <code>My value: 3</code> was output to console each time <code>funcs[j]();</code> was invoked since anonymous functions were bound to the same variable.
es: <code>My value: 3</code> sali&oacute; a la consola cada vez que <code>funcs[j]();</code> fue invocado ya que las funciones an&oacute;nimas estaban vinculadas a la misma variable.
ja: <code>My value: 3</code> <code>funcs[j]();</code> たびに3がコンソールに出力されました。 匿名関数が同じ変数にバインドされたため、呼び出されました。
ko: <code>My value: 3</code> <code>funcs[j]();</code> 매번 콘솔에 3 이 출력되었습니다 . 익명 함수가 동일한 변수에 바인드 된 이후 호출되었습니다.
ru: <code>My value: 3</code> <code>funcs[j]();</code> на консоль каждый раз, когда funcs [j] (); был вызван, поскольку анонимные функции были связаны с одной и той же переменной.
zh_cn: <code>My value: 3</code> 每次 <code>funcs[j]();</code> 都会输出3到控制台。 由于匿名函数绑定到同一变量，因此被调用。

source: <code>const</code> is a signal that the identifier won&rsquo;t be reassigned.
es: <code>const</code> es una se&ntilde;al de que el identificador no ser&aacute; reasignado.
ja: <code>const</code> は、識別子が再割り当てされないことを示す信号です。
ko: <code>const</code> 는 식별자가 재 할당되지 않음을 나타내는 신호입니다.
ru: <code>const</code> является сигналом того, что идентификатор не будет переназначен.
zh_cn: <code>const</code> 是一个信号，它将不重新分配标识符。

source: <code>const</code> is quite similar to <code>let</code>&mdash;it's block-scoped and has TDZ. There are, however, two things which are different.
es: <code>const</code> es bastante similar a <code>let</code> : tiene un alcance de bloque y tiene TDZ. Sin embargo, hay dos cosas que son diferentes.
ja: <code>const</code> は <code>let</code> と非常に似ています&mdash;ブロックスコープで、TDZを持っています。 ただし、異なる点が2つあります。
ko: <code>const</code> 는 <code>let</code> 과 매우 유사합니다. 블록 범위이며 TDZ가 있습니다. 그러나 다른 두 가지가 있습니다.
ru: <code>const</code> очень похож на <code>let</code> - это блок-область и имеет TDZ. Однако есть две разные вещи.
zh_cn: <code>const</code> 与 <code>let</code> 非常相似，它具有块作用域并具有TDZ。 但是，有两件事是不同的。

source: <code>let</code> and <code>const</code> is block scope.
es: <code>let</code> y <code>const</code> es el alcance del bloque.
ja: <code>let</code> および <code>const</code> はブロックスコープです。
ko: <code>let</code> 과 <code>const</code> 는 블록 범위입니다.
ru: <code>let</code> и <code>const</code> это область видимости блока.
zh_cn: <code>let</code> 和 <code>const</code> 是块作用域。

source: <code>let</code> can also be used to avoid problems with closures. It binds fresh value rather than keeping an old reference as shown in examples below.
es: <code>let</code> tambi&eacute;n se puede usar para evitar problemas con los cierres. Vincula un valor nuevo en lugar de mantener una referencia antigua como se muestra en los ejemplos a continuaci&oacute;n.
ja: <code>let</code> は、クロージャーの問題を回避するためにも使用できます。 以下の例に示すように、古い参照を保持するのではなく、新しい値をバインドします。
ko: 폐쇄와 관련된 문제를 피하기 위해 사용할 수도 있습니다. 아래 예제와 같이 오래된 참조를 유지하는 대신 새로운 가치를 결속시킵니다.
ru: <code>let</code> также может использоваться, чтобы избежать проблем с замыканиями. Он связывает свежую ценность, а не сохраняет старую ссылку, как показано в примерах ниже.
zh_cn: <code>let</code> 也可以用来避免关闭问题。 它将绑定新的值，而不是保留旧的参考，如下面的示例所示。

source: <code>let</code> in the loop can <strong>re-binds it</strong> to each iteration of the loop, making sure to re-assign it the value from the end of the previous loop iteration. Consider,
es: <code>let</code> in the loop puede <strong>volver a vincularlo</strong> a cada iteraci&oacute;n del loop, asegur&aacute;ndose de reasignarle el valor desde el final de la iteraci&oacute;n del bucle anterior. Considerar,
ja: ループに <code>let</code> て、 <strong>それ</strong>をループの各反復に<strong>再バインドし</strong> 、前のループ反復の最後から値を確実に再割り当てできるようにします。 考えて、
ko: 루프에서 루프를 반복 <strong>할</strong> 때마다 루프를 <strong>다시 바인딩 할</strong> 수 있으므로 이전 루프 반복의 끝에서 값을 다시 할당해야합니다. 치다,
ru: <code>let</code> в цикле может <strong>повторно привязать его</strong> к каждой итерации цикла, убедившись, что ему присвоено значение с конца предыдущей итерации цикла. Рассматривать,
zh_cn: <code>let</code> in the loop可以<strong>将其重新绑定</strong>到循环的每个迭代中，并确保从上一个循环迭代结束时重新为其分配值。 考虑，

source: <code>let</code> is interesting, because it allows us to do something like this:
es: <code>let</code> es interesante, porque nos permite hacer algo como esto:
ja: <code>let</code> は興味深いので、次のようなことができます。
ko: 우리가 다음과 같이 할 수 있기 때문에 흥미 롭습니다.
ru: <code>let</code> это интересно, потому что это позволяет нам делать что-то вроде этого:
zh_cn: <code>let</code> 很有趣，因为它允许我们执行以下操作：

source: <code>let</code> variables are <em>easy to use</em> with closures (they do not cause <a href="https://en.wikipedia.org/wiki/Race_condition#Software">race conditions</a>).
es: <code>let</code> variables let son <em>f&aacute;ciles de usar</em> con los cierres (no causan <a href="https://en.wikipedia.org/wiki/Race_condition#Software">condiciones de carrera</a> ).
ja: <code>let</code> 変数はクロージャーで<em>簡単に使用できます</em> （ <a href="https://en.wikipedia.org/wiki/Race_condition#Software">競合状態を</a>引き起こしません）。
ko: 변수를 클로저와 함께 <em>사용하기 쉽게하십시오</em> ( <a href="https://en.wikipedia.org/wiki/Race_condition#Software">경쟁 조건을</a> 유발하지 않음).
ru: <code>let</code> переменные <em>легко использовать</em> с замыканиями (они не вызывают <a href="https://en.wikipedia.org/wiki/Race_condition#Software">условий гонки</a> ).
zh_cn: <code>let</code> 变量<em>易于</em>与闭包<em>一起使用</em> （它们不会引起<a href="https://en.wikipedia.org/wiki/Race_condition#Software">竞争条件</a> ）。

source: <code>let</code> variables are not initialized until their definition is evaluated. Accessing them before the initialization results in a <code>ReferenceError</code>. Variable said to be in "temporal dead zone" from the start of the block until the initialization is processed.
es: <code>let</code> variables no se inicialicen hasta que se eval&uacute;e su definici&oacute;n. Acceder a ellos antes de la inicializaci&oacute;n da como resultado un <code>ReferenceError</code> . Se dice que la variable est&aacute; en "zona muerta temporal" desde el inicio del bloque hasta que se procesa la inicializaci&oacute;n.
ja: <code>let</code> 変数は、その定義が評価されるまで初期化されません。 初期化の前にそれらにアクセスすると、 <code>ReferenceError</code> が発生します。 ブロックの開始から初期化が処理されるまでの間、「一時的なデッドゾーン」にあるとされる変数。
ko: 정의가 평가 될 때까지 변수를 초기화하지 마십시오. 초기화하기 전에 액세스하면 <code>ReferenceError</code> 가 발생 합니다. 변수는 블록의 시작부터 초기화가 처리 될 때까지 "임시 데드 존"에 있다고합니다.
ru: <code>let</code> переменные не инициализируются до тех пор, пока их определение не будет оценено. Доступ к ним до инициализации приводит к <code>ReferenceError</code> . Считается, что переменная находится в &laquo;временной мертвой зоне&raquo; от начала блока до обработки инициализации.
zh_cn: 在评估其定义之前，不初始化 <code>let</code> 变量。 在初始化之前访问它们会导致 <code>ReferenceError</code> 。 从块的开始直到初始化处理之前，变量都处于&ldquo;临时死区&rdquo;中。

source: <code>let</code> variables are only usable in lines of code that occur <em>after</em> the variable is declared (even though <a href="/questions/33198849">they are hoisted</a>!).
es: <code>let</code> variables solo se puedan usar en l&iacute;neas de c&oacute;digo que se producen <em>despu&eacute;s de</em> que se declara la variable (&iexcl;aunque <a href="/questions/33198849">se hayan izado</a> !).
ja: <code>let</code> 変数は、変数が宣言された<em>後</em>に発生するコード行でのみ使用できます（ <a href="/questions/33198849">それらが巻き上げられている</a>場合でも！）。
ko: 변수가 선언 된 <em>후에</em> 발생하는 코드 행에서만 변수를 사용할 수 <code>let</code> 하십시오 ( <a href="/questions/33198849">호이스트 된</a> 경우에도).
ru: переменные <code>let</code> могут использоваться только в строках кода, которые появляются <em>после того,</em> как переменная объявлена ​​(даже если <a href="/questions/33198849">они подняты</a> !).
zh_cn: <code>let</code> 变量仅在声明该变量<em>后</em>发生的代码行中可用（即使<a href="/questions/33198849">它们已吊起</a> ！）。

source: <code>let</code> variables are only visible in their <em>nearest enclosing</em> block (<code>{ ... }</code>).
es: <code>let</code> variables let solo son visibles en su bloque de <em>cierre m&aacute;s cercano</em> ( <code>{ ... }</code> ).
ja: <code>let</code> 変数は、 <em>最も近い囲み</em>ブロック（ <code>{ ... }</code> ）でのみ表示されます。
ko: 변수는 <em>가장 가까운 둘러싸는</em> 블록 ( <code>{ ... }</code> )에서만 볼 수 있습니다.
ru: <code>let</code> переменные видны только в <em>ближайшем окружающем их</em> блоке ( <code>{ ... }</code> ).
zh_cn: <code>let</code> 变量仅在其<em>最近的封闭</em>块（ <code>{ ... }</code> ）中可见。

source: <code>let</code> variables cannot be accessed in the <code>window</code> object because they cannot be globally accessed.
es: No se puede acceder a las variables <code>let</code> en el objeto de <code>window</code> porque no se puede acceder globalmente.
ja: 変数はグローバルにアクセスできないため、 <code>window</code> オブジェクトではアクセスできません。
ko: 변수는 전역 적으로 액세스 할 수 없으므로 <code>window</code> 객체에서 액세스 할 수 없습니다.
ru: <code>let</code> переменные не могут быть доступны в объекте <code>window</code> потому что они не могут быть доступны глобально.
zh_cn: <code>let</code> 变量无法在 <code>window</code> 对象中访问，因为它们无法全局访问。

source: <code>let</code> variables don't get hoisted:
es: <code>let</code> variables no se levanten:
ja: 変数が巻き上げられないようにします。
ko: 변수가 게양되지 않도록하십시오.
ru: <code>let</code> переменные не поднимаются:
zh_cn: <code>let</code> 变量不被悬挂：

source: <code>let</code> variables may not be redeclared by a subsequent <code>var</code> or <code>let</code>.
es: <code>let</code> variables let no pueden ser redeclaradas por una <code>var</code> o <code>let</code> posterior.
ja: <code>let</code> 変数は、後続の <code>var</code> または <code>let</code> で再宣言できません。
ko: <code>let</code> 변수는 후속 <code>var</code> 또는 <code>let</code> 에 의해 다시 선언되지 않을 수 있습니다.
ru: переменные <code>let</code> не могут быть повторно объявлены последующим <code>var</code> или <code>let</code> .
zh_cn: <code>let</code> 变量不能由后续的 <code>var</code> 或 <code>let</code> 声明。

source: <code>let</code> works very much like <code>var</code>. The main difference is that the scope of a <code>var</code> variable is the entire enclosing function
es: <code>let</code> funciona mucho como <code>var</code> . La principal diferencia es que el alcance de una variable <code>var</code> es la funci&oacute;n de cierre completa
ja: <code>let</code> は <code>var</code> と非常によく似ています。 主な違いは、 <code>var</code> 変数のスコープが、それを囲む関数全体であることです。
ko: <code>var</code> 와 매우 유사 <code>let</code> 작동합니다. 가장 큰 차이점은 <code>var</code> 변수의 범위가 전체 둘러싸는 함수라는 것입니다
ru: <code>let</code> работает очень похоже на <code>var</code> . Основное различие заключается в том, что область действия переменной <code>var</code> - это вся включающая функция
zh_cn: <code>let</code> 工作非常像 <code>var</code> 。 主要区别在于 <code>var</code> 变量的范围是整个封闭函数

source: <code>let</code>, is a signal that the variable may be reassigned, such as a counter in a loop, or a value swap in an algorithm. It also signals that the variable will be used only in the block it&rsquo;s defined in, which is not always the entire containing function.
es: <code>let</code> , es una se&ntilde;al de que la variable puede reasignarse, como un contador en un bucle o un intercambio de valores en un algoritmo. Tambi&eacute;n indica que la variable se usar&aacute; solo en el bloque en el que est&aacute; definida, que no siempre es la funci&oacute;n que contiene todo.
ja: <code>let</code> は、ループ内のカウンターやアルゴリズムの値スワップなど、変数を再割り当てできることを示す信号です。 また、変数がそれが定義されているブロックでのみ使用されることを通知します。これは、必ずしもそれを含む関数全体ではありません。
ko: <code>let</code> 은 루프의 카운터 또는 알고리즘의 값 스왑과 같이 변수가 재 할당 될 수 있다는 신호입니다. 또한 변수가 정의 된 블록에서만 사용된다는 신호를 보냅니다. 항상 전체 포함 함수는 아닙니다.
ru: <code>let</code> - это сигнал о том, что переменная может быть переназначена, например, счетчик в цикле или обмен значениями в алгоритме. Это также сигнализирует о том, что переменная будет использоваться только в блоке, в котором она определена, что не всегда является всей содержащей функцией.
zh_cn: <code>let</code> 是信号，表明可以重新分配变量，例如循环中的计数器或算法中的值交换。 它还表示该变量将仅在其定义的块中使用，而该块并不总是整个包含函数。

source: <code>var</code> and variables in ES5 has scopes in functions meaning the variables are valid within the function and not outside the function itself.
es: <code>var</code> y variables en ES5 tienen &aacute;mbitos en las funciones, lo que significa que las variables son v&aacute;lidas dentro de la funci&oacute;n y no fuera de la funci&oacute;n misma.
ja: ES5の <code>var</code> と変数には関数内にスコープがあり、変数は関数内で有効であり、関数自体の外では有効ではありません。
ko: ES5의 <code>var</code> 및 변수에는 함수 범위가 있으므로 변수는 함수 자체가 아닌 함수 내에서 유효합니다.
ru: <code>var</code> и variable в ES5 имеют области действия в функциях, что означает, что переменные действительны внутри функции, а не вне самой функции.
zh_cn: ES5中的 <code>var</code> 和variables在函数中具有作用域，这意味着变量在函数内部有效，而在函数本身外部无效。

source: <code>var</code> is global scope (hoist-able) variable.
es: <code>var</code> es una variable de alcance global (con capacidad de elevaci&oacute;n).
ja: <code>var</code> はグローバルスコープ（ホイスト可能）変数です。
ko: <code>var</code> 는 전역 범위 (호이스트 가능) 변수입니다.
ru: <code>var</code> - глобальная переменная области видимости.
zh_cn: <code>var</code> 是全局范围（可提升）变量。

source: <code>var</code> is now the weakest signal available when you define a variable in JavaScript. The variable may or may not be reassigned, and the variable may or may not be used for an entire function, or just for the purpose of a block or loop.
es: <code>var</code> es ahora la se&ntilde;al m&aacute;s d&eacute;bil disponible cuando define una variable en JavaScript. La variable se puede reasignar o no, y la variable se puede usar o no para una funci&oacute;n completa, o solo con el prop&oacute;sito de un bloque o bucle.
ja: <code>var</code> は、JavaScriptで変数を定義するときに利用できる最も弱いシグナルになりました。 変数は再割り当てされる場合とされない場合があり、変数は関数全体に使用される場合と使用されない場合があり、ブロックまたはループの目的でのみ使用される場合があります。
ko: <code>var</code> 는 이제 JavaScript에서 변수를 정의 할 때 사용 가능한 가장 약한 신호입니다. 변수는 재 할당되거나 재 할당되지 않을 수 있으며, 변수는 전체 기능 또는 블록 또는 루프의 목적으로 사용될 수도 있고 사용되지 않을 수도 있습니다.
ru: <code>var</code> теперь является самым слабым сигналом, доступным при определении переменной в JavaScript. Переменная может быть или не быть переназначена, и переменная может или не может использоваться для всей функции, или просто для цели блока или цикла.
zh_cn: <code>var</code> 现在是您在JavaScript中定义变量时可用的最弱信号。 可能会或可能不会重新分配该变量，并且该变量可能会或可能不会用于整个功能，或仅出于块或循环的目的。

source: <code>var</code> may still be useful if you are sure you want the single-binding effect when using a closure in a loop (#5) or for declaring externally-visible global variables in your code (#4). Use of <code>var</code> for exports may be supplanted if <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"><code>export</code></a> migrates out of transpiler space and into the core language.
es: <code>var</code> a&uacute;n puede ser &uacute;til si est&aacute; seguro de que desea el efecto de enlace &uacute;nico al usar un cierre en un bucle (# 5) o para declarar variables globales visibles externamente en su c&oacute;digo (# 4). El uso de <code>var</code> para las exportaciones puede suplantarse si la <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"> <code>export</code> aci&oacute;n</a> migra fuera del espacio del transpilador al lenguaje central.
ja: ループでクロージャーを使用する場合（＃5）、またはコード内で外部から見えるグローバル変数を宣言する場合（＃4）、シングルバインディングエフェクトが必要な場合は、 <code>var</code> が役立つ場合があります。 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"> <code>export</code> </a>がトランスパイラースペースからコア言語に移行する場合、 エクスポートに <code>var</code> を使用することはできません。
ko: 루프 (# 5)에서 클로저를 사용할 때 또는 코드에서 외부에서 볼 수있는 전역 변수를 선언 할 때 단일 바인딩 효과를 원한다면 <code>var</code> 가 여전히 유용 할 수 있습니다 (# 4). <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"> <code>export</code> </a> 가 트랜스 파일러 공간에서 핵심 언어로 마이그레이션되는 경우 내보내기 에 <code>var</code> 를 사용할 수 있습니다.
ru: <code>var</code> может быть полезен, если вы уверены, что хотите использовать эффект одиночного связывания при использовании замыкания в цикле (# 5) или для объявления внешне видимых глобальных переменных в вашем коде (# 4). Использование <code>var</code> для экспорта может быть заменено, если <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"> <code>export</code> </a> перемещается из пространства транспортера в основной язык.
zh_cn: 如果您确定要在循环中使用闭包（＃5）或在代码中声明外部可见的全局变量（＃4）时希望使用单绑定效果，则 <code>var</code> 可能仍然有用。 如果<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/export"> <code>export</code> </a>移出转译器空间并转移到核心语言中，则可以替换使用 <code>var</code> 进行出口。

source: <code>var</code> variables can be accessed in the <code>window</code> object because they cannot be globally accessed.
es: Se puede acceder a las variables <code>var</code> en el objeto de <code>window</code> porque no se puede acceder globalmente.
ja: <code>var</code> 変数はグローバルにアクセスできないため、 <code>window</code> オブジェクト内でアクセスできます。
ko: <code>var</code> 변수는 전역 적으로 액세스 할 수 없으므로 <code>window</code> 객체에서 액세스 할 수 있습니다.
ru: Переменные <code>var</code> могут быть доступны в объекте <code>window</code> потому что они не могут быть доступны глобально.
zh_cn: 可以在 <code>window</code> 对象中访问 <code>var</code> 变量，因为它们不能全局访问。

source: <del><code>let</code> will <strong>not hoist</strong> to the entire scope of the block they appear in. By contrast, <code>var</code> could hoist as below.</del>
es: <del> <code>let</code> <strong>no se</strong> elevar&aacute; a todo el alcance del bloque en el que aparecen. Por el contrario, <code>var</code> podr&iacute;a elevarse como se muestra a continuaci&oacute;n. </del>
ja: <del> <code>let</code> は、出現するブロックのスコープ全体を<strong>巻き上げません</strong> 。対照的に、 <code>var</code> は以下のように巻き上げます。 </del>
ko: <del> 블록이 표시되는 전체 범위를 <strong>끌어 올리지 마십시오</strong> . 반대로 <code>var</code> 는 다음과 같이 들어 올릴 수 있습니다. </del>
ru: <del> <code>let</code> <strong>не</strong> будет <strong>поднимать</strong> весь объем блока, в котором они появляются. В отличие от этого, <code>var</code> может подниматься, как показано ниже. </del>
zh_cn: <del> <code>let</code> <strong>不会提升</strong>它们出现在其中的块的整个范围。相反， <code>var</code> 可以如下提升。 </del>

source: <del><strong>Variable Not Hoisting</strong></del>
es: <del> <strong>Variable sin elevaci&oacute;n</strong> </del>
ja: <del> <strong>巻き上げない変数</strong> </del>
ko: <del> <strong>게양하지 않는 변수</strong> </del>
ru: <del> <strong>Переменная не поднимается</strong> </del>
zh_cn: <del> <strong>可变不吊装</strong> </del>

source: <em>(*) Globally and functionally scoped variables can be initialized and used before they are declared because JavaScript variables are <a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>hoisted</strong></a>.</em> This means that declarations are always much to the top of the scope.
es: <em>(*) Las variables de &aacute;mbito global y funcional pueden inicializarse y utilizarse antes de declararse porque las variables de JavaScript est&aacute;n <a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>izadas</strong></a> .</em> Esto significa que las declaraciones siempre est&aacute;n en lo m&aacute;s alto del alcance.
ja: <em>（*）JavaScript変数が<a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>ホイスト</strong></a>されるため、グローバルおよび機能的にスコープ指定された変数は、宣言される前に初期化して使用できます。</em> これは、宣言が常にスコープの一番上にあることを意味します。
ko: <em>(*) 전역 및 기능 범위 변수는 JavaScript 변수가 <a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>들어</strong></a> 있기 때문에 선언되기 전에 초기화 및 사용할 수 있습니다.</em> 이것은 선언이 항상 범위의 맨 위에 있다는 것을 의미합니다.
ru: <em>(*) Глобальные и функциональные переменные могут быть инициализированы и использованы до того, как объявлены, потому что переменные JavaScript <a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>подняты</strong></a> .</em> Это означает, что объявления всегда находятся на вершине области видимости.
zh_cn: <em>（*）因为<a href="https://developer.mozilla.org/en-US/docs/Glossary/Hoisting"><strong>提升了</strong></a> JavaScript变量，所以可以在声明全局和功能范围的变量之前对其进行初始化和使用。</em> 这意味着声明始终在作用域的顶部。

source: <em>(**) Block scoped variables are not hoisted</em>
es: <em>(**) Las variables de &aacute;mbito de bloque no se izan</em>
ja: <em>（**）ブロックスコープの変数は巻き上げられません</em>
ko: <em>(**) 블록 범위 변수는 게양되지 않습니다</em>
ru: <em>(**) Переменные области видимости не отображаются</em>
zh_cn: <em>（**）不提升块范围的变量</em>

source: <strong>1. No use outside nearest enclosing block:</strong> This block of code will throw a reference error because the second use of <code>x</code> occurs outside of the block where it is declared with <code>let</code>:
es: <strong>1. No usar fuera del bloque de cierre m&aacute;s cercano:</strong> este bloque de c&oacute;digo arrojar&aacute; un error de referencia porque el segundo uso de <code>x</code> ocurre fuera del bloque donde se declara con <code>let</code> :
ja: <strong>1.最も近い囲みブロックの外では使用しない：</strong>このコードブロックは、 <code>x</code> の2番目の使用が <code>let</code> で宣言されているブロックの外で発生するため、参照エラーをスローします。
ko: <strong>1. 가장 가까운 엔 클로징 블록 외부에서 사용하지 않음 :</strong> 이 코드 블록은 <code>x</code> 로 두 번째 사용이 <code>let</code> 으로 선언 된 블록 외부에서 발생하기 때문에 참조 오류가 발생합니다.
ru: <strong>1. Не использовать вне ближайшего окружающего блока:</strong> этот блок кода выдаст опорную ошибку, потому что второе использование <code>x</code> происходит за пределами блока, где оно объявлено с помощью <code>let</code> :
zh_cn: <strong>1.在最接近的封闭块外不使用：</strong>该代码块将引发引用错误，因为 <code>x</code> 的第二次使用发生在用 <code>let</code> 声明的块外：

source: <strong>2. No use before declaration:</strong>
es: <strong>2. Sin uso antes de la declaraci&oacute;n:</strong>
ja: <strong>2.宣言の前に使用しない：</strong>
ko: <strong>2. 신고 전 사용 금지 :</strong>
ru: <strong>2. Не использовать до объявления:</strong>
zh_cn: <strong>2.声明前不得使用：</strong>
