Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>3. No redeclaration:</strong> The following code demonstrates that a variable declared with <code>let</code> may not be redeclared later:
es: <strong>3. Sin redeclaraci&oacute;n:</strong> el siguiente c&oacute;digo demuestra que una variable declarada con <code>let</code> no se puede volver a declarar m&aacute;s tarde:
ja: <strong>3.再宣言なし：</strong>次のコードは、 <code>let</code> で宣言された変数が後で再宣言されない場合があることを示しています。
ko: <strong>3. 재 선언 없음 :</strong> 다음 코드는 <code>let</code> 으로 선언 된 변수가 나중에 재 선언되지 않을 수 있음을 보여줍니다.
ru: <strong>3. Без повторного объявления:</strong> следующий код демонстрирует, что переменная, объявленная с помощью <code>let</code> , не может быть повторно объявлена ​​позднее:
zh_cn: <strong>3.不重新声明：</strong>以下代码演示了用 <code>let</code> 声明的变量以后可能不会重新声明：

source: <strong>4. Globals not attached to <code>window</code>:</strong>
es: <strong>4. Globales no unidos a la <code>window</code> :</strong>
ja: <strong>4. <code>window</code> アタッチされていないグローバル：</strong>
ko: <strong>4. <code>window</code> 첨부되지 않은 전역 :</strong>
ru: <strong>4. Глобалы, не прикрепленные к <code>window</code> :</strong>
zh_cn: <strong>4.未连接到 <code>window</code> 全局变量：</strong>

source: <strong>5. Easy use with closures:</strong> Variables declared with <code>var</code> do not work well with closures inside loops. Here is a simple loop that outputs the sequence of values that the variable <code>i</code> has at different points in time:
es: <strong>5. Uso f&aacute;cil con cierres: las</strong> variables declaradas con <code>var</code> no funcionan bien con los cierres dentro de los bucles. Aqu&iacute; hay un bucle simple que genera la secuencia de valores que la variable <code>i</code> tiene en diferentes momentos:
ja: <strong>5.クロージャーでの簡単な使用：</strong> <code>var</code> で宣言された変数は、ループ内のクロージャーではうまく機能しません。 以下は、変数 <code>i</code> がさまざまな時点で持つ一連の値を出力する単純なループです。
ko: <strong>5. 클로저로 쉽게 사용 :</strong> <code>var</code> 로 선언 된 변수는 루프 내 클로저에서 잘 작동하지 않습니다. 다음은 변수 <code>i</code> 가 다른 시점에있는 일련의 값을 출력하는 간단한 루프입니다.
ru: <strong>5. Простота использования с замыканиями:</strong> переменные, объявленные с помощью <code>var</code> , плохо работают с замыканиями внутри циклов. Вот простой цикл, который выводит последовательность значений переменной <code>i</code> в разные моменты времени:
zh_cn: <strong>5.闭包易于使用：</strong>用 <code>var</code> 声明的变量在循环内的闭包中不能很好地工作。 这是一个简单的循环，输出变量 <code>i</code> 在不同时间点具有的值序列：

source: <strong><code>let</code> loops</strong>
es: <strong> <code>let</code> bucles</strong>
ja: <strong>ループをし <code>let</code> </strong>
ko: <strong>루프 <code>let</code> </strong>
ru: <strong> <code>let</code> петли</strong>
zh_cn: <strong> <code>let</code> 循环</strong>

source: <strong>Example2:</strong> In my second example instead of using <code>var</code> keyword in my conditional block I declare <code>myvar</code> using <code>let</code> keyword . Now when I call <code>myfunc</code> I get two different outputs: <code>myvar=20</code> and <code>myvar=10</code>.
es: <strong>Ejemplo2:</strong> en mi segundo ejemplo, en lugar de usar la palabra clave <code>var</code> en mi bloque condicional, declaro <code>myvar</code> usando la palabra clave <code>let</code> . Ahora cuando llamo a <code>myfunc</code> obtengo dos salidas diferentes: <code>myvar=20</code> y <code>myvar=10</code> .
ja: <strong>例</strong> 2 <strong>：</strong>条件ブロックで <code>var</code> キーワードを使用する代わりに2番目の例で、 <code>let</code> キーワードを使用して <code>myvar</code> を宣言します。 ここで <code>myfunc</code> を呼び出すと、2つの異なる出力 <code>myvar=20</code> と <code>myvar=10</code> が得られます。
ko: <strong>예 2 :</strong> 조건부 블록에서 <code>var</code> 키워드를 사용하는 대신 두 번째 예에서는 <code>let</code> keyword를 사용하여 <code>myvar</code> 을 선언합니다. 이제 <code>myfunc</code> 을 호출하면 <code>myvar=20</code> 과 <code>myvar=10</code> 의 두 가지 출력이 나타납니다.
ru: <strong>Пример 2:</strong> Во втором примере вместо использования ключевого слова <code>var</code> в моем условном блоке я объявляю <code>myvar</code> с помощью ключевого слова <code>let</code> . Теперь, когда я вызываю <code>myfunc</code> , я получаю два разных вывода: <code>myvar=20</code> и <code>myvar=10</code> .
zh_cn: 示例2 <strong>：</strong>在第二个示例中，我没有在条件块中使用 <code>var</code> 关键字， <code>myvar</code> 使用 <code>let</code> 关键字声明了myvar 。 现在，当我调用 <code>myfunc</code> 时 ，会得到两个不同的输出： <code>myvar=20</code> 和 <code>myvar=10</code> 。

source: <strong>Garbage Collection</strong>
es: <strong>Recolecci&oacute;n de basura</strong>
ja: <strong>ガベージコレクション</strong>
ko: <strong>가비지 콜렉션</strong>
ru: <strong>Вывоз мусора</strong>
zh_cn: <strong>垃圾收集</strong>

source: <strong>If you want to know more continue reading below</strong>
es: <strong>Si quieres saber m&aacute;s sigue leyendo a continuaci&oacute;n</strong>
ja: <strong>もっと知りたい場合は、以下をお読みください</strong>
ko: <strong>더 알고 싶다면 아래에서 계속 읽으십시오.</strong>
ru: <strong>Если вы хотите узнать больше, продолжайте читать ниже</strong>
zh_cn: <strong>如果您想了解更多，请继续阅读下面的内容</strong>

source: <strong>NOTE:</strong> This is a teaching example intended to demonstrate the <code>var</code>/<code>let</code> behavior in loops and with function closures that would also be easy to understand. This would be a terrible way to add numbers. But the general technique of capturing data in anonymous function closures might be encountered in the real world in other contexts. YMMV.
es: <strong>NOTA:</strong> Este es un ejemplo de ense&ntilde;anza destinado a demostrar el comportamiento <code>var</code> / <code>let</code> en bucles y con cierres de funciones que tambi&eacute;n ser&iacute;an f&aacute;ciles de entender. Esta ser&iacute;a una forma terrible de sumar n&uacute;meros. Pero la t&eacute;cnica general de captura de datos en el cierre de funciones an&oacute;nimas podr&iacute;a encontrarse en el mundo real en otros contextos. YMMV.
ja: <strong>注：</strong>これは、ループでの <code>var</code> / <code>let</code> の動作と、わかりやすい関数クロージャを使用することを示すことを目的とした指導例です。 これは数字を追加する恐ろしい方法でしょう。 しかし、匿名の関数クロージャでデータをキャプチャする一般的な手法は、他のコンテキストでは現実の世界で遭遇する可能性があります。 YMMV。
ko: <strong>참고 :</strong> 이것은 루프에서 <code>var</code> / <code>let</code> 동작을 보여주고 이해하기 쉬운 함수 클로저를 사용하기위한 교시 예제입니다. 이것은 숫자를 추가하는 끔찍한 방법입니다. 그러나 익명 함수 클로저에서 데이터를 캡처하는 일반적인 기술은 실제 상황에서는 다른 상황에서 발생할 수 있습니다. YMMV.
ru: <strong>ПРИМЕЧАНИЕ.</strong> Это обучающий пример, предназначенный для демонстрации поведения <code>var</code> / <code>let</code> в циклах и с замыканиями функций, которые также легко понять. Это был бы ужасный способ добавить цифры. Но общий метод сбора данных в анонимных замыканиях функций может встречаться в реальном мире в других контекстах. YMMV.
zh_cn: <strong>注意：</strong>这是一个教学示例，旨在演示循环中的 <code>var</code> / <code>let</code> 行为以及具有易于理解的函数闭包。 这将是添加数字的糟糕方法。 但是在其他上下文中，在现实世界中可能会遇到在匿名函数闭包中捕获数据的通用技术。 YMMV。

source: <strong>When Using <code>let</code></strong>
es: <strong>Al usar <code>let</code> </strong>
ja: <strong> <code>let</code> を使用する場合</strong>
ko: <strong> <code>let</code> 을 사용할 때</strong>
ru: <strong>При использовании <code>let</code> </strong>
zh_cn: <strong>当使用 <code>let</code> </strong>

source: <strong>When Using <code>var</code></strong>
es: <strong>Cuando se usa <code>var</code> </strong>
ja: <strong> <code>var</code> を使用する場合</strong>
ko: <strong> <code>var</code> 를 사용할 때</strong>
ru: <strong>При использовании <code>var</code> </strong>
zh_cn: <strong>使用 <code>var</code> 时</strong>

source: <strong>When should <code>let</code> be used over <code>var</code>?</strong>
es: <strong>&iquest;Cu&aacute;ndo deber&iacute;a <code>let</code> usar sobre <code>var</code> ?</strong>
ja: <strong>いつ <code>var</code> で使用 <code>let</code> べきですか？</strong>
ko: <strong>언제 <code>var</code> 이상 사용해야합니까?</strong>
ru: <strong>Когда следует использовать over <code>var</code> ?</strong>
zh_cn: <strong>什么时候应该在 <code>var</code> 上使用？</strong>

source: <strong>When using <code>let</code></strong>
es: <strong>Cuando use <code>let</code> </strong>
ja: <strong> <code>let</code> を使用する場合</strong>
ko: <strong> <code>let</code> 을 사용할 때</strong>
ru: <strong>При использовании <code>let</code> </strong>
zh_cn: <strong>使用 <code>let</code> 时</strong>

source: <strong>When using <code>var</code></strong>
es: <strong>Cuando se usa <code>var</code> </strong>
ja: <strong> <code>var</code> を使用する場合</strong>
ko: <strong> <code>var</code> 를 사용할 때</strong>
ru: <strong>При использовании <code>var</code> </strong>
zh_cn: <strong>使用 <code>var</code> 时</strong>

source: <strong>let</strong> allows you to declare variables that are limited in scope to the block, statement, or expression on which it is used. This is unlike the <strong>var</strong> keyword, which defines a variable globally, or locally to an entire function regardless of block scope.
es: <strong>let le</strong> permite declarar variables que tienen un alcance limitado al bloque, declaraci&oacute;n o expresi&oacute;n en la que se usa. Esto es diferente a la palabra clave <strong>var</strong> , que define una variable globalmente o localmente para una funci&oacute;n completa, independientemente del alcance del bloque.
ja: <strong>letを</strong>使用すると、スコープが限定されている変数を、それが使用されているブロック、ステートメント、または式に宣言できます。 これは、変数をグローバルに、またはブロックスコープに関係なく関数全体に対してローカルに定義する<strong>var</strong>キーワードとは異なります。
ko: 범위가 제한된 변수를 변수가 사용 된 블록, 명령문 또는 표현식으로 선언 할 수 있습니다. 이것은 블록 범위와 상관없이 변수를 전체적으로 또는 전체적으로 로컬로 정의하는 <strong>var</strong> 키워드와 다릅니다.
ru: Позволяет вам объявлять переменные, ограниченные по объему блоком, оператором или выражением, в котором они используются. Это отличается от ключевого слова <strong>var</strong> , которое определяет переменную глобально или локально для всей функции независимо от области видимости блока.
zh_cn: <strong>let</strong>允许您声明范围仅限于使用它的块，语句或表达式的变量。 这与<strong>var</strong>关键字不同， <strong>var</strong>关键字在全局范围内或整个函数本地定义变量，而与块范围无关。

source: <strong>var variables are global</strong> and can be accessed basically everywhere, while <strong>let variables are not global</strong> and only exist until a closing parenthesis kills them.
es: <strong>Las variables var son globales</strong> y se puede acceder b&aacute;sicamente a todas partes, mientras <strong>que las variables let no son globales</strong> y solo existen hasta que un par&eacute;ntesis de cierre las mata.
ja: <strong>var変数はグローバルで</strong>あり、基本的にどこからでもアクセスでき<strong>ますが</strong> 、 <strong>let変数はグローバル</strong>で<strong>はなく</strong> 、閉じ括弧がそれらを削除するまで存在します。
ko: <strong>var 변수는 전역 변수이며</strong> 기본적으로 모든 곳에서 액세스 할 수 있지만 <strong>변수는 전역</strong> <strong>변수가 아니며</strong> 닫는 괄호로 묶을 때까지만 존재해야합니다.
ru: <strong>Переменные var являются глобальными</strong> и могут быть доступны практически везде, хотя <strong>пусть переменные не являются глобальными</strong> и существуют только до тех пор, пока закрывающая скобка не убьет их.
zh_cn: <strong>var变量是全局变量，</strong>基本上可以在任何地方访问，而<strong>let变量不是全局变量</strong> ，仅在右括号将其杀死之前存在。

source: <strong>variables with <code>let</code>:</strong>
es: <strong>variables con <code>let</code> :</strong>
ja: <strong> <code>let</code> を使用した変数：</strong>
ko: <strong> <code>let</code> 변수 :</strong>
ru: <strong>переменные с <code>let</code> :</strong>
zh_cn: <strong> <code>let</code> 的变量：</strong>

source: <strong>variables with <code>var</code>:</strong>
es: <strong>variables con <code>var</code> :</strong>
ja: <strong> <code>var</code> を含む変数：</strong>
ko: <strong> <code>var</code> 변수 :</strong>
ru: <strong>переменные с переменной <code>var</code> :</strong>
zh_cn: <strong>带有 <code>var</code> 的变量：</strong>

source: <sub>(Tested in Chrome and Firefox 50)</sub>
es: <sub>(Probado en Chrome y Firefox 50)</sub>
ja: <sub>（ChromeおよびFirefox 50でテスト済み）</sub>
ko: <sub>(Chrome 및 Firefox 50에서 테스트)</sub>
ru: <sub>(Проверено в Chrome и Firefox 50)</sub>
zh_cn: <sub>（在Chrome和Firefox 50中测试）</sub>

source: A general workaround is to wrap this in an anonymous function and pass <code>i</code> as an argument. Such issues can also be avoided now by using <code>let</code> instead <code>var</code> as shown in the code below.
es: Una soluci&oacute;n general es envolver esto en una funci&oacute;n an&oacute;nima y pasar <code>i</code> como argumento. Tales problemas tambi&eacute;n se pueden evitar ahora usando <code>let</code> en su lugar <code>var</code> como se muestra en el c&oacute;digo a continuaci&oacute;n.
ja: 一般的な回避策は、これを無名関数でラップし、引数として <code>i</code> を渡すことです。 このような問題は、以下のコードに示すように、 <code>var</code> の代わりに <code>let</code> を使用することでも回避できます。
ko: 일반적인 해결 방법은 이것을 익명 함수로 감싸고 <code>i</code> 를 인수로 전달하는 것입니다. 아래 코드와 같이 <code>let</code> 대신 <code>var</code> 을 사용하면 이러한 문제를 피할 수 있습니다.
ru: Общий обходной путь - обернуть это в анонимную функцию и передать <code>i</code> в качестве аргумента. Таких проблем можно также избежать, используя <code>let</code> вместо <code>var</code> , как показано в коде ниже.
zh_cn: 一般的解决方法是将其包装在匿名函数中，然后将 <code>i</code> 作为参数传递。 现在也可以通过使用 <code>let</code> 代替 <code>var</code> 来避免此类问题，如下面的代码所示。

source: A variable declared with <code>let</code> in the global scope (which is code that is not in a function) doesn't get added as a property on the global <code>window</code> object. For example (this code is in global scope):
es: Una variable declarada con <code>let</code> en el &aacute;mbito global (que es un c&oacute;digo que no est&aacute; en una funci&oacute;n) no se agrega como una propiedad en el objeto de la <code>window</code> global. Por ejemplo (este c&oacute;digo est&aacute; en alcance global):
ja: グローバルスコープ（関数にないコード）で <code>let</code> を使用して宣言された変数は、グローバル <code>window</code> オブジェクトのプロパティとして追加されません。 例（このコードはグローバルスコープにあります）：
ko: 전역 범위에서 <code>let</code> 으로 선언 된 변수 (함수에없는 코드)는 전역 <code>window</code> 객체의 속성으로 추가되지 않습니다. 예를 들어 (이 코드는 전역 범위에 있습니다) :
ru: Переменная, объявленная с помощью <code>let</code> в глобальной области видимости (то есть код, который отсутствует в функции), не добавляется в качестве свойства объекта глобального <code>window</code> . Например (этот код находится в глобальной области видимости):
zh_cn: 在全局范围内用 <code>let</code> 声明的变量（该代码不在函数中）不会作为属性添加到全局 <code>window</code> 对象上。 例如（此代码在全局范围内）：

source: A variable defined using a <code>let</code> statement is only known in <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>the block</strong></a> it is defined in, from the moment it is defined onward. <em>(**)</em>
es: Una variable definida usando una declaraci&oacute;n <code>let</code> solo se conoce en <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>el bloque</strong></a> en <strong>el</strong> que se define, desde el momento en que se define en adelante. <em>(**)</em>
ja: <code>let</code> ステートメントを使用して定義された変数は<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>、</strong></a>それが定義された瞬間から、それが定義されて<strong>いるブロック</strong>でのみ認識されます。 <em>（**）</em>
ko: <code>let</code> 문을 사용하여 정의 된 변수는 정의 된 순간부터 정의 된 <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>블록</strong></a> 에서만 알 수 있습니다. <em>(**)</em>
ru: Переменная, определенная с помощью оператора <code>let</code> , известна только в <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>том блоке, в котором</strong></a> она определена, с момента ее определения. <em>(**)</em>
zh_cn: 从 <code>let</code> 语句开始定义的那一刻起，仅在其定义<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block"><strong>的块中</strong></a>才知道使用let语句定义的变量。 <em>（**）</em>

source: A variable defined using a <code>var</code> statement is known throughout <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>the function</strong></a> it is defined in, from the start of the function. <em>(*)</em>
es: Una variable definida usando una instrucci&oacute;n <code>var</code> es conocida en toda <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>la funci&oacute;n en la</strong></a> que est&aacute; definida, desde el inicio de la funci&oacute;n. <em>(*)</em>
ja: <code>var</code> ステートメントを使用して定義された変数は、関数の開始時から、それが定義されて<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>いる関数</strong></a>全体で認識されます。 <em>（*）</em>
ko: <code>var</code> 문을 사용하여 정의 된 변수 <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>는 함수</strong></a> 시작부터 정의 된 <strong>함수</strong> 전체 <strong>에</strong> 알려져 있습니다. <em>(*)</em>
ru: Переменная, определенная с помощью оператора <code>var</code> , известна во всей <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>функции, в которой</strong></a> она определена, с самого начала функции. <em>(*)</em>
zh_cn: 从函数开始，在整个<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/function"><strong>函数</strong></a>定义中都知道使用 <code>var</code> 语句定义的变量。 <em>（*）</em>

source: Actually, Per @Bergi, <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6">Both <code>var</code> and <code>let</code> are hoisted</a>.
es: En realidad, por @Bergi, <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6">tanto <code>var</code> como <code>let</code> son izados</a> .
ja: 実際、@ Bergiによると、 <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6"> <code>var</code> と <code>let</code> の両方が巻き上げられ</a>ます。
ko: 실제로, @@ Bergi 당 <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6"> <code>var</code> 와 <code>let</code> 은 모두 게양</a> 됩니다.
ru: На самом деле, Per @Bergi, <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6">оба <code>var</code> и <code>let</code> подняты</a> .
zh_cn: 实际上，Per @Bergi， <a href="https://stackoverflow.com/questions/31219420/are-variables-declared-with-let-or-const-not-hoisted-in-es6"> <code>var</code> 和 <code>let</code> 都被吊起</a> 。

source: Also don't forget it's ECMA6 feature, so it's not fully supported yet, so it's better always transpiles it to ECMA5 using Babel etc... for more info about visit <a href="https://babeljs.io">babel website</a>
es: Adem&aacute;s, no olvide que es la funci&oacute;n ECMA6, por lo que a&uacute;n no es totalmente compatible, por lo que es mejor que siempre lo transpile a ECMA5 usando Babel, etc. Para obtener m&aacute;s informaci&oacute;n sobre el <a href="https://babeljs.io">sitio web de Babel</a>
ja: ECMA6機能であることも忘れないでください。まだ完全にはサポートされていません。BabelWeb <a href="https://babeljs.io">サイトに</a>アクセスする方法の詳細については、常にBabelなどを使用してECMA5にトランスパイルすることをお勧めします。
ko: 또한 ECMA6 기능을 잊지 마십시오. 아직 완벽하게 지원되지는 않으므로 <a href="https://babeljs.io">babel 웹 사이트</a> 방문에 대한 자세한 내용은 Babel 등을 사용하여 ECMA5로 항상 변환하는 것이 좋습니다.
ru: Также не забывайте, что это функция ECMA6, поэтому она еще не полностью поддерживается, поэтому лучше всегда переносить ее на ECMA5 с помощью Babel и т. Д. ... для получения дополнительной информации о посещении <a href="https://babeljs.io">веб-сайта babel</a>
zh_cn: 另外，别忘了它的ECMA6功能，因此尚未得到完全支持，因此最好始终使用Babel等将其转换为ECMA5。有关访问<a href="https://babeljs.io">babel网站的</a>更多信息

source: Also, consider that block scoped variables are not known before they are declared because they are not hoisted. You're also not allowed to redeclare the same block scoped variable within the same block. This makes block scoped variables less error prone than globally or functionally scoped variables, which are hoisted and which do not produce any errors in case of multiple declarations.
es: Además,considere que las variables de ámbito de bloque no se conocen antes de ser declaradas porque no se izan.Tampoco se permite redeclarar la misma variable de ámbito de bloque dentro del mismo bloque.Esto hace que las variables de ámbito de bloque sean menos propensas a errores que las variables de ámbito global o funcional,que se elevan y que no producen ningún error en caso de declaraciones múltiples.
ja: また、ブロックスコープされた変数はホイストされていないので、宣言される前にはわからないと考えてください。また、同じブロック内で同じブロックスコープ変数を再宣言することもできません。これにより、ブロックスコープされた変数は、グローバルスコープされた変数や関数的にスコープされた変数よりもエラーが発生しにくくなり、 ホイストされ、複数の宣言をしてもエラーが発生しません。
ko: 또한 블록 범위 변수는 게양되지 않았기 때문에 선언되기 전에 알 수 없습니다. 또한 동일한 블록 내에서 동일한 블록 범위 변수를 다시 선언 할 수 없습니다. 이렇게하면 블록 범위 변수가 전역 또는 기능 범위 변수보다 오류가 덜 발생합니다.이 변수는 게양되어 여러 선언의 경우 오류가 발생하지 않습니다.
ru: Кроме того,следует учитывать,что переменные в блочном пространстве не известны до их объявления,так как они не поднимаются.Вы также не имеете права передекларировать одну и ту же переменную в пределах одного и того же блока.Это делает блок-скопированные переменные менее склонными к ошибкам,чем глобальные или функционально скопированные переменные,которые поднимаются и не производят ошибок в случае множественных деклараций.
zh_cn: 另外,要考虑到块范围变量在声明之前是不知道的,因为块范围变量是不被挂起的。你也不允许在同一个区块内重新声明同一个区块范围内的变量。这使得块范围化变量比全局或函数范围化变量更不容易出错,因为全局或函数范围化变量是被挂起的,在多次声明的情况下不会产生任何错误。

source: And, finally, when it comes to the Execution Context, variables defined with var will be attached to the 'this' object. In the global Execution Context, that will be the window object in browsers. This is not the case for let or const.
es: Y,finalmente,cuando se trata del Contexto de Ejecución,las variables definidas con var se adjuntarán al objeto "este".En el Contexto de Ejecución global,ese será el objeto ventana en los navegadores.Este no es el caso de let o const.
ja: そして最後に、実行コンテキストに関しては、var で定義された変数は 'this' オブジェクトにアタッチされます。グローバルな実行コンテキストでは、ブラウザのウィンドウオブジェクトになります。let や const の場合はそうではありません。
ko: 마지막으로 실행 컨텍스트와 관련하여 var로 정의 된 변수는 'this'객체에 첨부됩니다. 전역 실행 컨텍스트에서는 브라우저의 창 개체가됩니다. let 또는 const의 경우에는 해당되지 않습니다.
ru: И,наконец,когда дело доходит до контекста выполнения,переменные,определенные с помощью var,будут прикреплены к объекту 'this'.В глобальном контексте выполнения,это будет объект окна в браузерах.Это не случай let или const.
zh_cn: 最后,当谈到执行上下文时,用var定义的变量将被附加到 "this "对象上。在全局执行上下文中,这将是浏览器中的窗口对象。而let或const的情况就不一样了。

source: Another difference between <code>var</code> and <code>let</code> is variables with declared with <code>let</code><strong>don't get hoisted</strong>. An example is the best way to illustrate this behavior:
es: Otra diferencia entre <code>var</code> y <code>let</code> es que las variables declaradas con <code>let</code> <strong>no se izan</strong> . Un ejemplo es la mejor manera de ilustrar este comportamiento:
ja: <code>var</code> と <code>let</code> のもう1つの違いは、 letで宣言された変数<strong>が巻き上げられないこと</strong>です。 例は、この動作を説明する最良の方法です。
ko: <code>var</code> 와 <code>let</code> 의 또 다른 차이점은 let 으로 선언 된 변수가 <strong>게양되지 않습니다</strong> . 이 동작을 설명하는 가장 좋은 방법은 예입니다.
ru: Еще одно различие между <code>var</code> и <code>let</code> - переменные с объявленным с <code>let</code> <strong>, не поднимаются</strong> . Пример - лучший способ проиллюстрировать это поведение:
zh_cn: <code>var</code> 和 <code>let</code> 之间的另一个区别是，用 <code>let</code> 声明的变量<strong>不被提升</strong> 。 一个示例是说明此行为的最佳方法：

source: As mentioned above:
es: Como ya se ha mencionado:
ja: 前述したように
ko: 앞에서 말했다시피:
ru: Как упоминалось выше:
zh_cn: 如上所述。
