Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The main difference between <code>var</code> and <code>let</code> is that variables declared with <code>var</code> are <strong>function scoped</strong>. Whereas functions declared with <code>let</code> are <strong>block scoped</strong>. For example:
es: La principal diferencia entre <code>var</code> y <code>let</code> es que las variables declaradas con <code>var</code> tienen un <strong>alcance de funci&oacute;n</strong> . Mientras que las funciones declaradas con <code>let</code> tienen <strong>un alcance de bloque</strong> . Por ejemplo:
ja: <code>var</code> と <code>let</code> の主な違いは、 varで宣言された変数が<strong>関数スコープであること</strong>です。 一方、 <code>let</code> で宣言された関数は<strong>ブロックスコープ</strong>です。 例えば：
ko: <code>var</code> 와 <code>let</code> 의 주요 차이점은 var로 선언 된 <code>var</code> 는 <strong>함수 범위</strong> 입니다. <code>let</code> 으로 선언 된 함수는 <strong>블록 범위</strong> 입니다. 예를 들면 다음과 같습니다.
ru: Основное различие между <code>var</code> и <code>let</code> заключается в том, что переменные, объявленные с помощью <code>var</code> , являются <strong>областью видимости функции</strong> . В то время как функции, объявленные с помощью <code>let</code> , имеют <strong>область видимости</strong> . Например:
zh_cn: <code>var</code> 和 <code>let</code> 之间的主要区别在于，用 <code>var</code> 声明的变量是<strong>函数范围的</strong> 。 而用 <code>let</code> 声明的函数是<strong>块作用域的</strong> 。 例如：

source: The main difference is the <strong>scope</strong> difference, while <strong>let</strong> can be only available inside the <strong>scope</strong> it's declared, like in for loop, <strong>var</strong> can be accessed outside the loop for example. From the documentation in <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN</a> (examples also from MDN):
es: La principal diferencia es la diferencia de <strong>alcance</strong> , mientras que <strong>let</strong> solo puede estar disponible dentro del <strong>alcance</strong> que se declara, como en for loop, se puede acceder a <strong>var</strong> fuera del bucle, por ejemplo. De la documentaci&oacute;n en <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN</a> (ejemplos tambi&eacute;n de MDN):
ja: 主な違いは<strong>スコープの</strong>違いですが、 <strong>let</strong>は宣言された<strong>スコープ</strong>内でのみ使用できますが、forループの場合と同様に、たとえば<strong>var</strong>はループの外側からアクセスできます。 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN</a>のドキュメントから（ MDNの例も）：
ko: 주요 차이점은 <strong>범위</strong> 차이이며, for 루프에서와 같이 선언 된 <strong>범위</strong> 내에서만 사용할 수 있으며 <strong>var</strong> 는 루프 외부에서 액세스 할 수 있습니다. <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN</a> 설명서 (예 : MDN) :
ru: Основным отличием является различие в <strong>объеме</strong> , хотя <strong>let</strong> может быть доступен только внутри объявленной области, как, например, в цикле for, к <strong>var</strong> можно получить доступ, например, вне цикла. Из документации в <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN</a> (примеры также из MDN):
zh_cn: 主要的区别是<strong>范围的</strong>区别，而<strong>let</strong>只能在声明的<strong>范围</strong>内使用，例如在for循环中，例如<strong>var</strong>可以在循环外部访问。 从<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">MDN中</a>的文档中（也有MDN的示例）：

source: The process above doesn't generate the desired array of functions because <code>i</code>'s scope extends beyond the iteration of the <code>for</code> block in which each function was created. Instead, at the end of the loop, the <code>i</code> in each function's closure refers to <code>i</code>'s value at the end of the loop (1000) for every anonymous function in <code>adderFunctions</code>. This isn't what we wanted at all: we now have an array of 1000 different functions in memory with exactly the same behavior. And if we subsequently update the value of <code>i</code>, the mutation will affect all the <code>adderFunctions</code>.
es: El proceso anterior no genera la matriz de funciones deseada porque el alcance de <code>i</code> se extiende m&aacute;s all&aacute; de la iteraci&oacute;n del bloque <code>for</code> en el que se cre&oacute; cada funci&oacute;n. En cambio, al final del ciclo, la <code>i</code> en el cierre de cada funci&oacute;n se refiere al valor de <code>i</code> al final del ciclo (1000) para cada funci&oacute;n an&oacute;nima en <code>adderFunctions</code> . Esto no es lo que quer&iacute;amos en absoluto: ahora tenemos una matriz de 1000 funciones diferentes en la memoria con exactamente el mismo comportamiento. Y si posteriormente actualizamos el valor de <code>i</code> , la mutaci&oacute;n afectar&aacute; a todas las <code>adderFunctions</code> .
ja: 上記のプロセスは、 <code>i</code> のスコープが各関数が作成された <code>for</code> ブロックの反復を超えているため、目的の関数の配列を生成しません。 代わりに、ループの終わりで、各関数のクロージャーの <code>i</code> は、 <code>adderFunctions</code> のすべての匿名関数のループの終わり（1000）でのiの値を参照します。 これは私たちが望んでいたことではありません。まったく同じ動作をするメモリ内に1000の異なる関数の配列があります。 その後、 <code>i</code> の値を更新すると、変更はすべての <code>adderFunctions</code> に影響します。
ko: 위의 프로세스는 <code>i</code> 의 범위가 각 함수가 작성된 <code>for</code> 블록의 반복을 넘어 확장되기 때문에 원하는 함수 배열을 생성하지 않습니다. 대신 루프의 끝에서 각 함수의 닫힘에있는 <code>i</code> 는 <code>adderFunctions</code> 의 모든 익명 함수에 대해 루프 끝의 i 값 (1000)을 나타냅니다 . 이것은 우리가 원하는 것이 아닙니다. 이제 우리는 정확히 같은 동작을 가진 1000 개의 서로 다른 함수 배열을 메모리에 갖습니다. 그리고 나중에 <code>i</code> 값을 업데이트하면 돌연변이가 모든 <code>adderFunctions</code> 에 영향을 미칩니다.
ru: Процесс выше не генерирует желаемый массив функций, потому что область действия <code>i</code> выходит за рамки итерации блока <code>for</code> , в котором была создана каждая функция. Вместо этого в конце цикла <code>i</code> в закрытии каждой функции ссылается на значение <code>i</code> в конце цикла (1000) для каждой анонимной функции в <code>adderFunctions</code> . Это совсем не то, что мы хотели: у нас теперь есть массив из 1000 различных функций в памяти с точно таким же поведением. И если мы впоследствии обновим значение <code>i</code> , мутация повлияет на все функции <code>adderFunctions</code> .
zh_cn: 上面的过程无法生成所需的函数数组，因为 <code>i</code> 的范围超出了在其中创建每个函数的 <code>for</code> 块的迭代范围。 相反，在循环结束时，每个函数闭包中的 <code>i</code> <code>adderFunctions</code> 每个匿名函数在循环结束时i的值（1000）。 这根本不是我们想要的：我们现在在内存中拥有1000个不同功能的数组，它们的行为完全相同。 并且如果我们随后更新 <code>i</code> 的值，突变将影响所有 <code>adderFunctions</code> 。

source: The reason why <code>let</code> keyword was introduced to the language was function scope is confusing and was one of the main sources of bugs in JavaScript.
es: La raz&oacute;n por la <code>let</code> se introdujo la palabra clave en el lenguaje fue que el alcance de la funci&oacute;n es confuso y fue una de las principales fuentes de errores en JavaScript.
ja: <code>let</code> キーワードが言語に導入された理由は関数のスコープであり、JavaScriptのバグの主な原因の1つでした。
ko: 키워드가 언어에 도입 된 이유는 함수 범위이기 때문에 혼란스럽고 JavaScript의 주요 버그 소스 중 하나였습니다.
ru: Причина, по которой ключевое слово <code>let</code> было введено в язык, заключалась в том, что область действия функций сбивает с толку и является одним из основных источников ошибок в JavaScript.
zh_cn: 将 <code>let</code> 关键字引入语言的原因是函数范围令人困惑，并且是JavaScript中错误的主要来源之一。

source: The restrictions imposed by <code>let</code> reduce the visibility of the variables and increase the likelihood that unexpected name collisions will be found early. This makes it easier to track and reason about variables, including their <a href="https://en.wikipedia.org/wiki/Unreachable_memory">reachability</a>(helping with reclaiming unused memory).
es: Las restricciones impuestas por <code>let</code> reducen la visibilidad de las variables y aumentan la probabilidad de que se encuentren pronto colisiones inesperadas de nombres. Esto hace que sea m&aacute;s f&aacute;cil rastrear y razonar sobre las variables, incluida su <a href="https://en.wikipedia.org/wiki/Unreachable_memory">accesibilidad</a> (lo que ayuda a recuperar la memoria no utilizada).
ja: <code>let</code> によって課せられる制限により、変数の可視性が低下し、予期しない名前の衝突が早期に発見される可能性が高くなります。 これにより、 <a href="https://en.wikipedia.org/wiki/Unreachable_memory">到達可能性</a>を含む変数の追跡と推論が容易になります（未使用のメモリの再利用に役立ちます）。
ko: 변수의 가시성을 줄이고 예상치 못한 이름 충돌이 조기에 발견 될 가능성을 높이는 제한 사항 이를 통해 <a href="https://en.wikipedia.org/wiki/Unreachable_memory">도달 가능성을</a> 포함하여 변수를 추적하고 추론하기가 더 쉬워집니다 (미사용 메모리를 되 찾는 데 도움이 됨).
ru: Ограничения, налагаемые <code>let</code> , уменьшают видимость переменных и увеличивают вероятность того, что неожиданные конфликты имен будут обнаружены на ранней стадии. Это облегчает отслеживание и анализ переменных, включая их <a href="https://en.wikipedia.org/wiki/Unreachable_memory">достижимость</a> (помогая восстановить неиспользуемую память).
zh_cn: <code>let</code> 施加的限制降低了变量的可见性，并增加了提早发现意外的名称冲突的可能性。 这样可以更轻松地跟踪和推理变量，包括变量的<a href="https://en.wikipedia.org/wiki/Unreachable_memory">可达性</a> （帮助回收未使用的内存）。

source: The second feature of let is it introduces block scope. Blocks are defined by curly braces. Examples include function blocks, if blocks, for blocks, etc. When you declare a variable with let inside of a block, the variable is only available inside of the block. In fact, each time the block is run, such as within a for loop, it will create a new variable in memory.
es: La segunda característica de let es que introduce el bloqueo de la visión.Los bloques están definidos por llaves rizadas.Los ejemplos incluyen bloques de función,si son bloques,para bloques,etc.Cuando se declara una variable con let dentro de un bloque,la variable sólo está disponible dentro del bloque.De hecho,cada vez que se ejecuta el bloque,como dentro de un bucle de for,se creará una nueva variable en la memoria.
ja: letの2つ目の特徴は、ブロックスコープを導入したことです。ブロックは中括弧で定義されます。例としては、関数ブロック、ifブロック、forブロックなどがあります。ブロック内で let を使って変数を宣言した場合、その変数はブロック内でのみ利用可能です。実際には、forループ内など、ブロックが実行されるたびに、メモリ内に新しい変数が作成されます。
ko: let의 두 번째 기능은 블록 범위를 소개한다는 것입니다. 블록은 중괄호로 정의됩니다. 함수 블록, if 블록, 블록 등을 예로들 수 있습니다. 블록 내부에 let을 사용하여 변수를 선언하면 변수는 블록 내부에서만 사용할 수 있습니다. 실제로 for 루프 내에서와 같이 블록이 실행될 때마다 메모리에 새 변수가 생성됩니다.
ru: Второй особенностью пусть будет то,что она вводит блок-объект.Блоки определяются фигурными скобками.Примеры включают в себя функциональные блоки,если блоки,то для блоков и т.д.Когда вы объявляете переменную,имеющую пустую строку внутри блока,переменная доступна только внутри блока.Фактически,каждый раз,когда блок выполняется,например,внутри цикла for,он будет создавать новую переменную в памяти.
zh_cn: let的第二个特点是它引入了块范围。块是由大括号定义的。例如函数块、if块、for块等。当你在块内用let声明一个变量时,这个变量只在块内可用。事实上,每次运行块的时候,比如在for循环中,它都会在内存中创建一个新的变量。

source: There are some subtle differences &mdash; <code>let</code> scoping behaves more like variable scoping does in more or less any other languages.
es: Existen algunas diferencias sutiles: <code>let</code> alcance se comporte m&aacute;s como el alcance variable en m&aacute;s o menos cualquier otro idioma.
ja: 微妙な違いがいくつかあります。スコーピングの動作を、他の言語での変数スコーピングの動作と同じようにします。
ko: 몇 가지 미묘한 차이점이 있습니다. 범위 지정은 다른 언어의 변수 범위 지정과 비슷합니다.
ru: Есть некоторые тонкие различия - <code>let</code> видимости ведет себя больше как переменная область видимости в более или менее любых других языках.
zh_cn: 有一些细微的差异-范围界定的行为更像变量范围界定，或多或少与任何其他语言一样。

source: There are still some browsers that don't support <code>let</code> at all :
es: Todav&iacute;a hay algunos navegadores que no admiten <code>let</code> :
ja: <code>let</code> をまったくサポートしていないブラウザがまだいくつかあります：
ko: <code>let</code> 을 전혀 지원하지 않는 일부 브라우저가 여전히 있습니다.
ru: Есть еще некоторые браузеры, которые вообще не поддерживают <code>let</code> :
zh_cn: 仍然有一些根本不支持 <code>let</code> 的浏览器：

source: This article clearly defines the difference between var, let and const
es: Este artículo define claramente la diferencia entre var,let y const
ja: この記事では、var、let、const の違いを明確に定義しています。
ko: 이 기사는 var, let 및 const의 차이점을 명확하게 정의합니다.
ru: Эта статья четко определяет разницу между var,let и const
zh_cn: 这篇文章明确定义了var、let和const之间的区别

source: This block of code will throw a <code>ReferenceError</code> before the code can be run because <code>x</code> is used before it is declared:
es: Este bloque de c&oacute;digo arrojar&aacute; un <code>ReferenceError</code> antes de que se pueda ejecutar el c&oacute;digo porque <code>x</code> se usa antes de que se declare:
ja: このコードブロックは、 <code>x</code> が宣言される前にxが使用されるため、コードを実行する前に <code>ReferenceError</code> をスローします。
ko: 이 코드 블록은 <code>x</code> 가 선언되기 전에 사용되기 때문에 코드를 실행하기 전에 <code>ReferenceError</code> 를 발생시킵니다.
ru: Этот блок кода выдаст <code>ReferenceError</code> до того, как код может быть запущен, потому что <code>x</code> используется до его объявления:
zh_cn: 此代码块将在运行代码之前引发 <code>ReferenceError</code> ，因为在声明 <code>x</code> 之前使用了x ：

source: This is because when using <code>let</code>, for every loop iteration the variable is scoped and has its own copy.
es: Esto se debe a que cuando se usa <code>let</code> , para cada iteraci&oacute;n de bucle, la variable tiene un alcance y tiene su propia copia.
ja: これは、 <code>let</code> を使用すると 、ループの反復ごとに変数がスコープされ、独自のコピーを持つためです。
ko: <code>let</code> 을 사용할 때 모든 루프 반복에 대해 변수의 범위가 지정되고 자체 사본이 있기 때문입니다.
ru: Это связано с тем, что при использовании <code>let</code> для каждой итерации цикла переменная находится в области видимости и имеет свою собственную копию.
zh_cn: 这是因为使用 <code>let</code> 时 ，对于每次循环迭代，变量都具有作用域并具有自己的副本。

source: This is because when using <code>var</code>, for every loop iteration the variable is scoped and has shared copy.
es: Esto se debe a que cuando se usa <code>var</code> , para cada iteraci&oacute;n del bucle, la variable tiene un alcance y una copia compartida.
ja: これは、 <code>var</code> を使用すると、ループの反復ごとに変数のスコープが設定され、コピーが共有されるためです。
ko: <code>var</code> 를 사용할 때 모든 루프 반복에 대해 변수의 범위가 지정되고 공유 사본이 있기 때문입니다.
ru: Это связано с тем, что при использовании <code>var</code> для каждой итерации цикла переменная находится в области видимости и имеет общую копию.
zh_cn: 这是因为使用 <code>var</code> 时 ，对于每次循环迭代，变量都具有作用域并具有共享副本。

source: This time, <code>i</code> is rebound on each iteration of the <code>for</code> loop. Each function now keeps the value of <code>i</code> at the time of the function's creation, and <code>adderFunctions</code> behaves as expected.
es: Esta vez, se recupera en cada iteraci&oacute;n del bucle <code>for</code> . Cada funci&oacute;n ahora mantiene el valor de <code>i</code> en el momento de la creaci&oacute;n de la funci&oacute;n, y <code>adderFunctions</code> se comporta como se esperaba.
ja: 今回は、 <code>for</code> ループの反復ごとにリバウンドします。 各関数は、関数の作成時に <code>i</code> の値を保持し、 <code>adderFunctions</code> は期待どおりに動作します。
ko: 이번에는 <code>for</code> 루프가 반복 될 때마다 리바운드됩니다. 각 함수는 이제 함수 생성시 <code>i</code> 의 값을 유지하며 <code>adderFunctions</code> 는 예상대로 작동합니다.
ru: На этот раз <code>i</code> возвращаюсь на каждой итерации цикла <code>for</code> . Каждая функция теперь сохраняет значение <code>i</code> во время ее создания, а <code>adderFunctions</code> работает так, как ожидается.
zh_cn: 这次， <code>i</code> 在 <code>for</code> 循环的每次迭代中都反弹。 现在，每个函数在创建函数时都会保留 <code>i</code> 的值，并且 <code>adderFunctions</code> 的行为符合预期。

source: This will:
es: Esto lo hará:
ja: これは、そうなるだろう。
ko: 이것은 :
ru: Это будет:
zh_cn: 这将。

source: This won't generate a compile error:
es: Esto no generará un error de compilación:
ja: これではコンパイルエラーは発生しません。
ko: 컴파일 오류가 발생하지 않습니다.
ru: Это не спровоцирует ошибку компиляции:
zh_cn: 这不会产生编译错误。

source: To have a complete understanding of the 'let' keyword, <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/"> ES6: &lsquo;let&rsquo; keyword to declare variable in JavaScript</a></em> will help.
es: Para tener una comprensi&oacute;n completa de la palabra clave 'let', <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/">ES6: la palabra clave 'let' para declarar variable en JavaScript</a></em> ayudar&aacute;.
ja: 「let」キーワードを完全に理解するには、 <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/">ES6：JavaScriptで変数を宣言する「let」キーワード</a></em>が役立ちます。
ko: 'let'키워드를 완전히 이해하려면 <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/">ES6 : JavaScript에서 변수를 선언하는 'let'키워드</a></em> 가 도움이됩니다.
ru: Чтобы получить полное представление о ключевом слове let, <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/">поможет</a></em> ключевое слово <em>ES6: let для объявления переменной в JavaScript</em> .
zh_cn: 为了全面了解'let'关键字， <em><a href="http://www.codingeek.com/tutorials/javascript/es6-let-keyword-to-declare-variable-in-javascript/">ES6：'let'关键字在JavaScript中声明变量</a></em>将很有帮助。

source: To understand the difference, consider the following code:
es: Para entender la diferencia,considere el siguiente código:
ja: この違いを理解するために、次のコードを考えてみましょう。
ko: 차이점을 이해하려면 다음 코드를 고려하십시오.
ru: Чтобы понять разницу,рассмотрим следующий код:
zh_cn: 为了理解其中的区别,可以考虑以下代码。

source: Today, however, that is definitely not the case. In fact, we need actually to ask ourselves whether it's safe to use the <code>let</code> statement. The answer to that question depends on your environment:
es: Hoy, sin embargo, ese definitivamente no es el caso. De hecho, debemos preguntarnos si es seguro usar la declaraci&oacute;n <code>let</code> . La respuesta a esa pregunta depende de su entorno:
ja: しかし、今日はそうではありません。 実際、 <code>let</code> ステートメントを使用しても安全かどうかを自問する必要があります。 その質問に対する答えは、環境によって異なります。
ko: 그러나 오늘날에는 그렇지 않습니다. 사실, <code>let</code> 문을 사용하는 것이 안전한지 실제로 자문 해보아야합니다. 해당 질문에 대한 답변은 환경에 따라 다릅니다.
ru: Сегодня, однако, это определенно не так. На самом деле нам нужно спросить себя, безопасно ли использовать оператор <code>let</code> . Ответ на этот вопрос зависит от вашей среды:
zh_cn: 但是，今天绝对不是这种情况。 实际上，我们实际上需要自问，使用 <code>let</code> 语句是否安全。 该问题的答案取决于您的环境：

source: Use <code>let</code> over <code>var</code> whenever you can because it is simply scoped more specific. This reduces potential naming conflicts which can occur when dealing with a large number of variables. <code>var</code> can be used when you want a global variable explicitly to be on the <code>window</code> object (always consider carefully if this is really necessary).
es: Use <code>let</code> over <code>var</code> siempre que pueda porque simplemente tiene un alcance m&aacute;s espec&iacute;fico. Esto reduce los posibles conflictos de nombres que pueden ocurrir cuando se trata con una gran cantidad de variables. <code>var</code> se puede usar cuando desea que una variable global est&eacute; expl&iacute;citamente en el objeto de la <code>window</code> (siempre considere cuidadosamente si esto es realmente necesario).
ja: 単にスコープがより具体的であるため、可能な場合は常に <code>let</code> over <code>var</code> を使用してください。 これにより、多数の変数を処理するときに発生する可能性のある、名前の競合の可能性が減少します。 <code>var</code> は、グローバル変数を明示的に <code>window</code> オブジェクトに配置する場合に使用できます（これが本当に必要な場合は常に注意深く検討してください）。
ko: 간단하게 범위가 지정되므로 <code>let</code> over <code>var</code> 를 사용하십시오. 이는 많은 변수를 처리 할 때 발생할 수있는 잠재적 인 이름 충돌을 줄입니다. <code>var</code> 는 전역 변수를 명시 적으로 <code>window</code> 객체에 배치하려고 할 때 사용할 수 있습니다 (실제로 필요한 경우 항상 신중하게 고려하십시오).
ru: Используйте <code>let</code> over <code>var</code> всякий раз, когда можете, потому что это просто более определенная область. Это уменьшает потенциальные конфликты именования, которые могут возникнуть при работе с большим количеством переменных. <code>var</code> можно использовать, если вы хотите, чтобы глобальная переменная явно находилась в объекте <code>window</code> (всегда тщательно продумывайте, действительно ли это необходимо).
zh_cn: 尽可能使用 <code>let</code> over <code>var</code> ,因为它的作用域更加具体。 这样可以减少在处理大量变量时可能发生的命名冲突。 当您希望将全局变量显式地放在 <code>window</code> 对象上时，可以使用 <code>var</code> （如果确实需要，请务必仔细考虑）。

source: Variable declared using <code>const</code> can't be re-assigned.
es: La variable declarada con <code>const</code> no se puede reasignar.
ja: <code>const</code> を使用して宣言された変数は再割り当てできません。
ko: <code>const</code> 를 사용하여 선언 된 변수는 재 할당 할 수 없습니다.
ru: Переменная, объявленная с использованием <code>const</code> , не может быть переназначена.
zh_cn: 使用 <code>const</code> 声明的变量无法重新分配。

source: Variables declared by <strong>let</strong> have as their scope the block in which they are defined, as well as in any contained sub-blocks. In this way, <strong>let</strong> works very much like <strong>var</strong>. The main difference is that the scope of a <strong>var</strong> variable is the entire enclosing function:
es: Las variables declaradas por <strong>let</strong> tienen como alcance el bloque en el que est&aacute;n definidas, as&iacute; como en cualquier subbloque contenido. De esta manera, <strong>deja que</strong> funcione de manera muy similar a la <strong>var</strong> . La principal diferencia es que el alcance de una variable <strong>var</strong> es toda la funci&oacute;n de cierre:
ja: <strong>let</strong>によって宣言された変数は、そのスコープとして、それらが定義されているブロックと、それに含まれているサブブロックを持っています。 このように、 <strong>let</strong>は<strong>varと</strong>非常によく似ています。 主な違いは、 <strong>var</strong>変数のスコープがそれを囲む関数全体であることです。
ko: <strong>let에</strong> 의해 선언 된 변수는 포함 된 하위 블록뿐만 아니라 자신이 정의 된 블록을 해당 범위로 갖습니다. 이런 식으로 <strong>var</strong> 과 매우 유사 <strong>하게</strong> 작동합니다. 가장 큰 차이점은 <strong>var</strong> 변수의 범위가 전체 둘러싸는 함수라는 것입니다.
ru: Переменные, объявленные с помощью <strong>let,</strong> имеют в качестве области действия блок, в котором они определены, а также в любых вложенных субблоках. Таким образом, <strong>пусть</strong> работает очень похоже на <strong>var</strong> . Основное отличие состоит в том, что область действия переменной <strong>var</strong> - это вся включающая функция:
zh_cn: <strong>let</strong>声明的变量的范围是定义它们的块以及任何包含的子块。 这样， <strong>让我们的</strong>工作非常像<strong>var</strong> 。 主要区别在于<strong>var</strong>变量的范围是整个封闭函数：

source: Variables declared using <code>let</code> inside a block can't be accessed outside that block.
es: No se puede acceder a las variables declaradas usando <code>let</code> dentro de un bloque fuera de ese bloque.
ja: ブロック内で <code>let</code> を使用して宣言された変数は、そのブロック外ではアクセスできません。
ko: 블록 내부에서 <code>let</code> 을 사용하여 선언 된 변수는 해당 블록 외부에서 액세스 할 수 없습니다.
ru: Переменные, объявленные с использованием <code>let</code> внутри блока, не могут быть доступны вне этого блока.
zh_cn: 在块内使用 <code>let</code> 声明的变量不能在该块外访问。

source: Variables declared using the <code>let</code> keyword are block-scoped, which means that they are available only in the <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">block</a> in which they were declared.
es: Las variables declaradas con la palabra clave <code>let</code> tienen un alcance de bloque, lo que significa que solo est&aacute;n disponibles en el <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">bloque</a> en el que se declararon.
ja: <code>let</code> キーワードを使用して宣言された変数はブロックスコープです。つまり、変数は宣言された<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">ブロック</a>でのみ使用できます。
ko: <code>let</code> 키워드를 사용하여 선언 된 변수는 블록 범위이므로 선언 된 <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">블록</a> 에서만 사용할 수 있습니다.
ru: Переменные, объявленные с использованием ключевого слова <code>let</code> , имеют вид блока, что означает, что они доступны только в <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">блоке,</a> в котором они были объявлены.
zh_cn: 使用 <code>let</code> 关键字声明的变量是块作用域的，这意味着它们仅在声明它们的<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/block">块</a>中可用。
