Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: However, you cannot reference the variable declared with let or const until it is declared. If you try to use it before it is declared, then an exception will be raised during the Execution Phase of the Execution Context. Now the variable will still be in memory, courtesy of the Creation Phase of the Execution Context, but the Engine will not allow you to use it:
es: Sin embargo,no se puede hacer referencia a la variable declarada con let o const hasta que sea declarada.Si intentas usarla antes de que sea declarada,entonces se planteará una excepción durante la fase de ejecución del contexto de ejecución.Ahora la variable seguirá en la memoria,cortesía de la Fase de Creación del Contexto de Ejecución,pero la Máquina no le permitirá usarla:
ja: ただし、let や const で宣言された変数が宣言されるまでは参照することはできません。宣言される前に使用しようとすると、実行コンテキストの実行フェーズで例外が発生します。これで、実行コンテキストの作成フェーズのおかげで変数はメモリ内に残りますが、エンジンはそれを使用することを許可しません。
ko: 그러나 let 또는 const로 선언 된 변수는 선언 될 때까지 참조 할 수 없습니다. 선언하기 전에 사용하려고하면 실행 컨텍스트의 실행 단계에서 예외가 발생합니다. 이제 변수는 실행 컨텍스트의 생성 단계에 의해 여전히 메모리에 남아 있지만 엔진에서 사용할 수는 없습니다.
ru: Однако,вы не можете ссылаться на переменную,объявленную с помощью allow или const,пока она не будет объявлена.Если вы попытаетесь использовать ее до того,как она будет объявлена,то исключение будет поднято во время фазы выполнения контекста выполнения.Теперь переменная все еще будет в памяти,благодаря фазе создания контекста выполнения,но движок не позволит вам ее использовать:
zh_cn: 但是,在声明之前,你不能引用用let或const声明的变量。如果你试图在声明之前使用它,那么在执行上下文的执行阶段就会出现异常。现在,这个变量仍然会在内存中,因为在执行上下文的创建阶段,但引擎将不允许你使用它。

source: I think people will start using let here after so that they will have similar scoping in JavaScript like other languages, Java, C#, etc.
es: Creo que la gente comenzará a usar let here after para tener un alcance similar en JavaScript como otros lenguajes,Java,C#,etc.
ja: 他の言語、Java、C#などのように、JavaScriptでも同じようなスコープを持つように、人々はここでletを使い始めると思います。
ko: 사람들은 다른 언어, Java, C # 등과 같은 JavaScript에서 비슷한 범위를 갖도록 let을 사용하기 시작할 것이라고 생각합니다.
ru: Я думаю,что люди начнут использовать let после этого,так что у них будет такая же область применения JavaScript,как и у других языков,Java,C#,и т.д..
zh_cn: 我想以后人们会在这里开始使用let,这样他们就会像其他语言一样,在JavaScript中也会有类似于Java、C#等语言的scoping。

source: I think the terms and most of the examples are a bit overwhelming, The main issue i had personally with the difference is understanding what a "Block" is. At some point i realized, a block would be any curly brackets except for <code>IF</code> statement. an opening bracket <code>{</code> of a function or loop will define a new block, anything defined with <code>let</code> within it, will not be available after the closing bracket <code>}</code> of the same thing (function or loop); With that in mind, it was easier to understand:
es: Creo que los t&eacute;rminos y la mayor&iacute;a de los ejemplos son un poco abrumadores. El problema principal que tuve personalmente con la diferencia es entender qu&eacute; es un "Bloque". En alg&uacute;n momento me di cuenta de que un bloque ser&iacute;a cualquier llave, excepto la declaraci&oacute;n <code>IF</code> . un par&eacute;ntesis de apertura <code>{</code> de una funci&oacute;n o bucle definir&aacute; un nuevo bloque, cualquier cosa definida con <code>let</code> dentro de &eacute;l, no estar&aacute; disponible despu&eacute;s del corchete de cierre <code>}</code> de la misma cosa (funci&oacute;n o bucle); Con eso en mente, fue m&aacute;s f&aacute;cil de entender:
ja: 私は用語とほとんどの例は少し圧倒的だと思います、私が個人的に違いを持っ​​ていた主な問題は、「ブロック」が何であるかを理解することです。 ある時点で、 <code>IF</code> ステートメント以外のブロックは中かっこになります。 <code>{</code> 関数またはループの開始ブラケット{は、新しいブロックを定義します。その中で <code>let</code> を使用して定義されたものはすべて、同じもの（関数またはループ）の終了ブラケット <code>}</code> の後には使用できません。 これを念頭に置くと、理解しやすくなりました。
ko: 나는 용어와 대부분의 예제가 약간 압도적이라고 생각한다. 내가 개인적으로 차이점을 가지고 있었던 주요 문제는 "블록"이 무엇인지 이해하는 것이다. 어느 시점에서, 블록은 <code>IF</code> 문을 제외하고 중괄호가 될 것입니다. 함수 나 루프의 여는 괄호 <code>{</code> 는 새로운 블록을 정의 할 것이며, 그 안에 <code>let</code> 으로 정의 된 것은 똑같은 것 (함수 또는 루프)의 닫는 괄호 뒤에 사용할 수 없습니다; 이를 염두에두고 이해하기가 더 쉬워졌습니다.
ru: Я думаю, что термины и большинство примеров немного ошеломляют. Основная проблема, с которой я столкнулся лично, - это понимание, что такое &laquo;Блок&raquo;. В какой-то момент я понял, что блоком будут любые фигурные скобки, кроме оператора <code>IF</code> . открывающая скобка <code>{</code> функции или цикла определит новый блок, все, что определено с помощью <code>let</code> внутри него, не будет доступно после закрывающей скобки <code>}</code> того же самого элемента (функции или цикла); Имея это в виду, было легче понять:
zh_cn: 我认为术语和大多数示例有点让人不知所措。我个人与之不同的主要问题是了解什么是&ldquo;阻止&rdquo;。 在某种程度上，我意识到，一个块将是除 <code>IF</code> 语句外的任何花括号。 函数或循环的右括号 <code>{</code> 将定义一个新块，其中用 <code>let</code> 定义的任何内容，在同一事物（函数或循环）的右括号之后将不可用； 考虑到这一点，更容易理解：

source: I want to link these keywords to the Execution Context, because the Execution Context is important in all of this. The Execution Context has two phases: a Creation Phase and Execution Phase. In addition, each Execution Context has a Variable Environment and Outer Environment (its Lexical Environment).
es: Quiero vincular estas palabras clave al Contexto de Ejecución,porque el Contexto de Ejecución es importante en todo esto.El Contexto de Ejecución tiene dos fases:una fase de creación y una fase de ejecución.Además,cada Contexto de Ejecución tiene un Entorno Variable y un Entorno Exterior (su Entorno Lógico).
ja: これらのキーワードを実行コンテキストにリンクさせたいと思います。実行コンテキストには、作成フェーズと実行フェーズの2つのフェーズがあります。また、各実行コンテキストには、変数環境と外部環境(そのレキシカル環境)があります。
ko: 실행 컨텍스트가이 모든 것에서 중요하기 때문에 이러한 키워드를 실행 컨텍스트에 연결하려고합니다. 실행 컨텍스트에는 작성 단계와 실행 단계의 두 단계가 있습니다. 또한 각 실행 컨텍스트에는 가변 환경 및 외부 환경 (Lexical Environment)이 있습니다.
ru: Я хочу связать эти ключевые слова с Контекстом выполнения,потому что Контекст выполнения важен во всем этом.Контекст выполнения имеет две фазы:фазу создания и фазу выполнения.Кроме того,каждый контекст выполнения имеет переменное окружение и внешнее окружение (его лексическое окружение).
zh_cn: 我想把这些关键词和执行上下文联系起来,因为执行上下文在这一切中很重要。Execution Context有两个阶段:创建阶段和执行阶段。此外,每个执行上下文都有一个变量环境和外部环境(它的词法环境)。

source: I've heard it that it's described as a "local" variable, but I'm still not quite sure how it behaves differently than the <code>var</code> keyword.
es: He o&iacute;do que se describe como una variable "local", pero todav&iacute;a no estoy muy seguro de c&oacute;mo se comporta de manera diferente a la palabra clave <code>var</code> .
ja: 「ローカル」変数として記述されていると聞きましたが、それが <code>var</code> キーワードとどのように異なる動作をするのかはまだよくわかりません。
ko: 나는 그것이 "local"변수라고 묘사되어 있다고 들었지만, 여전히 그것이 <code>var</code> 키워드와 어떻게 다르게 행동하는지는 확실하지 않습니다.
ru: Я слышал, что она описывается как &laquo;локальная&raquo; переменная, но я все еще не совсем уверен, как она ведет себя иначе, чем ключевое слово <code>var</code> .
zh_cn: 我听说它被描述为&ldquo;局部&rdquo;变量，但是我仍然不太确定它的行为与 <code>var</code> 关键字有何不同。

source: If I read the specs right then <code>let</code><strong>thankfully</strong> can also be leveraged to avoid <a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">self invoking functions</a> used to simulate private only members - <em>a popular design pattern that decreases code readability, complicates debugging, that adds no real code protection or other benefit - except maybe satisfying someone's desire for semantics, so stop using it. /rant</em>
es: Si leo las especificaciones correctamente, <strong>afortunadamente</strong> tambi&eacute;n se puede aprovechar para evitar <a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">las funciones de invocaci&oacute;n autom&aacute;tica que se</a> utilizan para simular solo miembros privados: <em>un patr&oacute;n de dise&ntilde;o popular que disminuye la legibilidad del c&oacute;digo, complica la depuraci&oacute;n, que no agrega protecci&oacute;n de c&oacute;digo real u otro beneficio, excepto que tal vez sea satisfactorio el deseo de alguien por la sem&aacute;ntica, as&iacute; que deja de usarlo.</em> <em>/despotricar</em>
ja: 仕様を正しく読んだ場合は <code>let</code> <strong>ありがたい</strong>ことに、プライベートのみのメンバーをシミュレートするために使用される<a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">自己呼び出し機能</a>を回避するために活用することもできます。 <em>意味論に対する誰かの欲望なので、それの使用をやめてください。</em> <em>/ rant</em>
ko: 사양을 올바르게 읽으면 개인적으로 만 멤버를 시뮬레이션하는 데 사용되는 <a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">자체 호출 기능</a> 을 피하기 위해 <strong>감사하게도</strong> 활용할 수 있습니다- <em>코드 가독성을 낮추고 디버깅을 복잡하게 만드는 인기있는 디자인 패턴-만족스러운 경우를 제외하고는 실제 코드 보호 또는 기타 이점을 추가하지 않습니다. 의미론에 대한 누군가의 욕망은 사용을 중단하십시오.</em> <em>/ rant</em>
ru: Если я читаю спецификации правильно, то, к <strong>счастью,</strong> можно также использовать возможности, чтобы избежать <a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">самовозвратных функций,</a> используемых для имитации закрытых элементов - <em>популярный шаблон проектирования, который уменьшает читабельность кода, усложняет отладку, не добавляет никакой реальной защиты кода или других преимуществ - кроме, возможно, удовлетворительного чье-то желание семантики, так что прекратите его использовать.</em> <em>/ напыщенная</em>
zh_cn: 如果我没看错规范，那么<strong>值得庆幸的</strong>是，也可以利用它来避免用于模拟仅私有成员的<a href="https://stackoverflow.com/questions/592396/what-is-the-purpose-of-a-self-executing-function-in-javascript#592414">自调用函数</a> - <em>一种流行的设计模式，它降低了代码的可读性，使调试复杂化，没有增加任何实际的代码保护或其他好处-也许令人满意某人对语义的渴望，因此请停止使用它。</em> <em>/ rant</em>

source: If you use <code>let</code> instead of <code>var</code> in a loop, with each iteration you get a new variable. That means that you can safely use a closure inside a loop.
es: Si usa <code>let</code> en lugar de <code>var</code> en un bucle, con cada iteraci&oacute;n obtendr&aacute; una nueva variable. Eso significa que puede usar un cierre de forma segura dentro de un bucle.
ja: ループで <code>var</code> の代わりに <code>let</code> を使用すると、反復ごとに新しい変数が取得されます。 つまり、ループ内でクロージャを安全に使用できます。
ko: 루프에서 <code>var</code> 대신 <code>let</code> 대신 let 을 사용하면 각 반복마다 새로운 변수가 생깁니다. 즉, 루프 내부에서 클로저를 안전하게 사용할 수 있습니다.
ru: Если вы используете в цикле <code>let</code> вместо <code>var</code> , с каждой итерацией вы получаете новую переменную. Это означает, что вы можете безопасно использовать замыкание внутри цикла.
zh_cn: 如果在循环中使用 <code>let</code> 而不是 <code>var</code> ，则每次迭代都会获得一个新变量。 这意味着您可以安全地在循环内使用闭包。

source: If you want to have an immutable object, you should use <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"><code>Object.freeze()</code></a>.
es: Si desea tener un objeto inmutable, debe usar <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"> <code>Object.freeze()</code> </a> .
ja: 不変オブジェクトが必要な場合は、 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"> <code>Object.freeze()</code> </a>を使用する必要があります。
ko: 불변의 객체를 가지려면 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"> <code>Object.freeze()</code> </a> 를 사용해야합니다.
ru: Если вы хотите иметь неизменный объект, вы должны использовать <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"> <code>Object.freeze()</code> </a> .
zh_cn: 如果要拥有一个不变的对象，则应使用<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze"> <code>Object.freeze()</code> </a> 。

source: If you're writing client-side JavaScript code and don't use a transpiler, you need to consider browser support.
es: Si estás escribiendo código JavaScript del lado del cliente y no usas un transpilador,debes considerar el soporte del navegador.
ja: クライアントサイドの JavaScript コードを書いていて、トランスパイラを使用していない場合は、ブラウザのサポートを考慮する必要があります。
ko: 클라이언트 측 JavaScript 코드를 작성 중이고 트랜스 파일러를 사용하지 않는 경우 브라우저 지원을 고려해야합니다.
ru: Если вы пишете JavaScript-код на клиентской стороне и не используете транспайлер,то вам необходимо учесть поддержку браузера.
zh_cn: 如果你正在编写客户端的JavaScript代码,并且没有使用转码器,你需要考虑浏览器的支持。

source: If you're writing client-side JavaScript code and use a Node based transpiler (like the <a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>traceur shell script</strong></a> or <a href="https://babeljs.io/"><strong>Babel</strong></a>), you can safely use the <code>let</code> statement. And because your browser will only know about the transpiled code, performance drawbacks should be limited.
es: Si est&aacute; escribiendo c&oacute;digo JavaScript del lado del cliente y usa un transpilador basado en Nodo (como el <a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>script de shell traceur</strong></a> o <a href="https://babeljs.io/"><strong>Babel</strong></a> ), puede usar de manera segura la declaraci&oacute;n <code>let</code> . Y debido a que su navegador solo sabr&aacute; sobre el c&oacute;digo transpilado, los inconvenientes de rendimiento deben ser limitados.
ja: クライアント側のJavaScriptコードを記述していて、ノードベースのトランスパイラー（ <a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>traceurシェルスクリプト</strong></a>や<a href="https://babeljs.io/"><strong>Babelなど</strong></a> ）を使用している場合は、 <code>let</code> ステートメントを安全に使用できます。 また、ブラウザーはトランスパイルされたコードのみを認識するため、パフォーマンスの低下は制限されます。
ko: 클라이언트 측 JavaScript 코드를 작성하고 <a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>traceur 쉘 스크립트</strong></a> 또는 <a href="https://babeljs.io/"><strong>Babel</strong></a> 과 같은 노드 기반 변환기를 사용하는 경우 <code>let</code> 문을 안전하게 사용할 수 있습니다. 브라우저는 변환 된 코드에 대해서만 알기 때문에 성능 단점이 제한되어야합니다.
ru: Если вы пишете код JavaScript на стороне клиента и используете транспортер на основе Node (например, <a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>скрипт оболочки traceur</strong></a> или <a href="https://babeljs.io/"><strong>Babel</strong></a> ), вы можете смело использовать оператор <code>let</code> . А поскольку ваш браузер будет знать только о переданном коде, недостатки производительности должны быть ограничены.
zh_cn: 如果您正在编写客户端JavaScript代码并使用基于Node的编译器（例如<a href="https://github.com/google/traceur-compiler/wiki/Compiling-Offline"><strong>traceur shell脚本</strong></a>或<a href="https://babeljs.io/"><strong>Babel</strong></a> ），则可以安全地使用 <code>let</code> 语句。 并且由于您的浏览器仅会了解已转译的代码，因此应限制性能方面的弊端。

source: If you're writing client-side JavaScript code and use a browser based transpiler (like <a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a> or <a href="https://github.com/babel/babel-standalone"><strong>babel-standalone</strong></a>), you can safely use the <code>let</code> statement, however your code is likely to be anything but optimal with respect to performance.
es: Si est&aacute; escribiendo c&oacute;digo JavaScript del lado del cliente y usa un transpilador basado en navegador (como <a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a> o <a href="https://github.com/babel/babel-standalone"><strong>babel-standalone</strong></a> ), puede usar de manera segura la declaraci&oacute;n <code>let</code> , sin embargo, es probable que su c&oacute;digo sea todo menos &oacute;ptimo con respecto al rendimiento.
ja: クライアント側のJavaScriptコードを記述していて、ブラウザーベースのトランスパイラー（ <a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a>や<a href="https://github.com/babel/babel-standalone"><strong>babel-standaloneなど</strong></a> ）を使用している場合は、 <code>let</code> ステートメントを安全に使用できますが、コードはパフォーマンスに関して最適ではない可能性があります。
ko: 클라이언트 측 JavaScript 코드를 작성하고 <a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a> 또는 <a href="https://github.com/babel/babel-standalone"><strong>babel-standalone</strong></a> 과 같은 브라우저 기반 변환기를 사용하는 경우 <code>let</code> 문을 안전하게 사용할 수 있지만 코드는 성능 측면에서 최적 일 수 있습니다.
ru: Если вы пишете код JavaScript на стороне клиента и используете браузер-транспортер (например, <a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a> или <a href="https://github.com/babel/babel-standalone"><strong>babel-standalone</strong></a> ), вы можете смело использовать оператор <code>let</code> , однако ваш код, вероятно, будет не оптимальным с точки зрения производительности.
zh_cn: 如果您正在编写客户端JavaScript代码并使用基于浏览器的编译器（例如<a href="https://github.com/google/traceur-compiler"><strong>Traceur</strong></a>或<a href="https://github.com/babel/babel-standalone"><strong>babel-standalone</strong></a> ），则可以安全地使用 <code>let</code> 语句，但是就性能而言，代码可能不是最佳选择。

source: If you're writing server-side JavaScript code (<a href="https://nodejs.org/en/"><strong>Node.js</strong></a>), you can safely use the <code>let</code> statement.
es: Si est&aacute; escribiendo c&oacute;digo JavaScript del lado del servidor ( <a href="https://nodejs.org/en/"><strong>Node.js</strong></a> ), puede usar de manera segura la declaraci&oacute;n <code>let</code> .
ja: サーバーサイドJavaScriptコード（ <a href="https://nodejs.org/en/"><strong>Node.js</strong></a> ）を記述している場合は、 <code>let</code> ステートメントを安全に使用できます。
ko: 서버 측 JavaScript 코드 ( <a href="https://nodejs.org/en/"><strong>Node.js</strong></a> )를 작성하는 경우 <code>let</code> 문을 안전하게 사용할 수 있습니다.
ru: Если вы пишете код JavaScript на стороне сервера ( <a href="https://nodejs.org/en/"><strong>Node.js</strong></a> ), вы можете смело использовать оператор <code>let</code> .
zh_cn: 如果要编写服务器端JavaScript代码（ <a href="https://nodejs.org/en/"><strong>Node.js</strong></a> ），则可以安全地使用 <code>let</code> 语句。

source: In JavaScript we often use variables at a significantly later time than when they are created. When we demonstrate this by delaying the output with a closure passed to <code>setTimeout</code>:
es: En JavaScript, a menudo utilizamos variables en un tiempo significativamente m&aacute;s tarde que cuando se crean. Cuando demostramos esto retrasando la salida con un cierre pasado a <code>setTimeout</code> :
ja: JavaScriptでは、多くの場合、変数が作成されたときよりもかなり遅い時間に変数を使用します。 <code>setTimeout</code> に渡されたクロージャーで出力を遅らせることでこれを実証すると：
ko: JavaScript에서는 종종 변수가 생성 될 때보 다 훨씬 나중에 변수를 사용합니다. <code>setTimeout</code> 에 전달 된 클로저를 사용하여 출력을 지연시켜이를 보여줄 때 :
ru: В JavaScript мы часто используем переменные значительно позже, чем когда они создаются. Когда мы продемонстрируем это путем задержки вывода с закрытием, переданным в <code>setTimeout</code> :
zh_cn: 在JavaScript中，我们通常在比创建变量晚得多的时间使用变量。 当我们通过传递给 <code>setTimeout</code> 的闭包来延迟输出来证明这一点时：

source: In contrast, the same example with <code>var</code> parses and runs without throwing any exceptions.
es: Por el contrario, el mismo ejemplo con <code>var</code> analiza y se ejecuta sin lanzar ninguna excepci&oacute;n.
ja: 対照的に、 <code>var</code> を使用した同じ例は、例外をスローせずに解析および実行されます。
ko: 반대로 <code>var</code> 와 동일한 예제는 예외를 throw하지 않고 구문 분석하고 실행합니다.
ru: Напротив, тот же самый пример с <code>var</code> анализирует и запускает без исключения.
zh_cn: 相反，具有 <code>var</code> 的同一示例在不引发任何异常的情况下进行分析和运行。

source: In contrast, the same example with <code>var</code> works.
es: En contraste, el mismo ejemplo con <code>var</code> funciona.
ja: 対照的に、 <code>var</code> を使用した同じ例は機能します。
ko: 반대로 <code>var</code> 와 동일한 예제가 작동합니다.
ru: Напротив, тот же пример с <code>var</code> работает.
zh_cn: 相反，使用 <code>var</code> 的相同示例起作用。

source: In my both examples I have a function <code>myfunc</code>. <code>myfunc</code> contains a variable <code>myvar</code> equals to 10. In my first example I check if <code>myvar</code> equals to 10 (<code>myvar==10</code>) . If yes, I agian declare a variable <code>myvar</code> (now I have two myvar variables)using <code>var</code> keyword and assign it a new value (20). In next line I print its value on my console. After the conditional block I again print the value of <code>myvar</code> on my console. If you look at the output of <code>myfunc</code>, <code>myvar</code> has value equals to 20.
es: En mis dos ejemplos tengo una funci&oacute;n <code>myfunc</code> . <code>myfunc</code> contiene una variable <code>myvar</code> igual a 10. En mi primer ejemplo <code>myvar</code> si myvar es igual a 10 ( <code>myvar==10</code> ). En caso afirmativo, declaro una variable <code>myvar</code> (ahora tengo dos variables myvar) usando la palabra clave <code>var</code> y le asigno un nuevo valor (20). En la siguiente l&iacute;nea imprimo su valor en mi consola. Despu&eacute;s del bloque condicional, <code>myvar</code> nuevamente el valor de myvar en mi consola. Si observa la salida de <code>myfunc</code> , <code>myvar</code> tiene un valor igual a 20.
ja: 私の両方の例では、関数 <code>myfunc</code> があります。 <code>myfunc</code> には、 <code>myvar</code> が10に等しい変数が含まれています。最初の例では、 <code>myvar</code> が10（ <code>myvar==10</code> ）に等しいかどうかを確認します。 はいの場合、アギアンは <code>var</code> キーワードを使用して変数 <code>myvar</code> （現在は2つのmyvar変数を持っています）を宣言し、 それに新しい値（20）を割り当てます。 次の行で、その値をコンソールに出力します。 条件付きブロックの後、再び <code>myvar</code> の値をコンソールに出力します。 <code>myfunc</code> の出力を見ると 、 <code>myvar</code> の値は20です。
ko: 두 예제 모두에서 <code>myfunc</code> 함수가 있습니다. <code>myfunc</code> 는 <code>myvar</code> 가 10 인 변수를 포함합니다. 첫 번째 예에서 <code>myvar</code> 가 10 ( <code>myvar==10</code> )인지 확인합니다. 그렇다면 agian은 <code>var</code> 키워드를 사용하여 변수 <code>myvar</code> (이제 두 개의 myvar 변수가 있음)를 선언하고 새로운 값을 할당합니다 (20). 다음 줄에서는 콘솔에 값을 인쇄합니다. 조건부 블록 후에 다시 콘솔에 <code>myvar</code> 값을 인쇄합니다. <code>myfunc</code> 의 출력을 보면 <code>myvar</code> 의 값은 20입니다.
ru: В обоих моих примерах у меня есть функция <code>myfunc</code> . <code>myfunc</code> содержит переменную <code>myvar</code> ,равную 10. В моем первом примере я проверяю, равно ли <code>myvar</code> 10 ( <code>myvar==10</code> ). Если да, я объявляю переменную <code>myvar</code> (теперь у меня есть две переменные myvar), используя ключевое слово <code>var</code> , и присваиваю ей новое значение (20). В следующей строке я печатаю его значение на моей консоли. После условного блока я снова печатаю значение <code>myvar</code> на моей консоли. Если вы посмотрите на вывод <code>myfunc</code> , <code>myvar</code> имеет значение, равное 20.
zh_cn: 在我的两个示例中，我都有一个函数 <code>myfunc</code> 。 <code>myfunc</code> 包含变量 <code>myvar</code> 等于10。在第一个示例中，我检查 <code>myvar</code> 是否等于10（ <code>myvar==10</code> ）。 如果是，我会使用 <code>var</code> 关键字声明一个变量 <code>myvar</code> （现在有两个myvar变量），并为其分配一个新值（20）。 在下一行中，我在控制台上打印其值。 在条件块之后，我再次在控制台上打印 <code>myvar</code> 的值。 如果查看 <code>myfunc</code> 的输出，则 <code>myvar</code> 的值等于20。

source: In practice, there are a number of useful consequences of the difference in scope:
es: En la práctica,la diferencia de alcance tiene varias consecuencias útiles:
ja: 実際には、範囲の違いによる有用な結果がいくつかあります。
ko: 실제로 범위 차이로 인해 여러 가지 유용한 결과가 있습니다.
ru: На практике разница в масштабах имеет ряд полезных последствий:
zh_cn: 在实践中,范围的不同会带来一些有用的后果。

source: In strict mode, <code>var</code> will let you re-declare the same variable in the same scope while <code>let</code> raises a SyntaxError.
es: En modo estricto, <code>var</code> le permitir&aacute; volver a declarar la misma variable en el mismo &aacute;mbito, mientras que <code>let</code> generar un SyntaxError.
ja: strictモードでは、 <code>var</code> を使用すると、同じスコープ内で同じ変数を再宣言できますが、 <code>let</code> はSyntaxErrorを発生させます。
ko: 엄격 모드에서 <code>var</code> 를 사용하면 동일한 범위에서 동일한 변수를 다시 선언 할 <code>let</code> 있고 SyntaxError가 발생합니다.
ru: В строгом режиме <code>var</code> позволит вам повторно объявить одну и ту же переменную в той же области, в то время как <code>let</code> вызывает SyntaxError.
zh_cn: 在严格模式下， <code>var</code> 使您可以在同一范围内重新声明相同的变量，而 <code>let</code> 则引发SyntaxError。

source: Initializer is required
es: Se requiere un inicializador
ja: イニシャライザが必要
ko: 이니셜 라이저가 필요합니다
ru: Требуется инициализатор
zh_cn: 需要使用初始化器

source: Inside a block
es: Dentro de un bloque
ja: ブロックの中
ko: 블록 내부
ru: Внутри блока
zh_cn: 在一个街区内
