Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Variables declared with <code>let</code> in loops can be referenced only inside that loop.
es: Las variables declaradas con bucles <code>let</code> in solo se pueden referenciar dentro de ese bucle.
ja: <code>let</code> inループで宣言された変数は、そのループ内でのみ参照できます。
ko: <code>let</code> in 루프로 선언 된 변수는 해당 루프 내에서만 참조 할 수 있습니다.
ru: На переменные, объявленные с помощью циклов <code>let</code> in, можно ссылаться только внутри этого цикла.
zh_cn: 用 <code>let</code> in循环声明的变量只能在该循环内部引用。

source: What are the differences? When should <code>let</code> be used over <code>var</code>?
es: &iquest;Cu&aacute;les son las diferencias? &iquest;Cu&aacute;ndo deber&iacute;a <code>let</code> usar sobre <code>var</code> ?
ja: 違いは何ですか？ いつ <code>var</code> で使用 <code>let</code> べきですか？
ko: 차이점은 무엇입니까? 언제 <code>var</code> 이상 사용해야합니까?
ru: В чем различия? Когда следует использовать over <code>var</code> ?
zh_cn: 有什么区别？ 什么时候应该在 <code>var</code> 上使用？

source: What's the difference between <code>let</code> and <code>var</code>?
es: &iquest;Cu&aacute;l es la diferencia entre <code>let</code> y <code>var</code> ?
ja: <code>let</code> と <code>var</code> の違いは何ですか？
ko: <code>let</code> 과 <code>var</code> 의 차이점은 무엇입니까?
ru: В чем разница между <code>let</code> и <code>var</code> ?
zh_cn: <code>let</code> 和 <code>var</code> 有什么区别？

source: What's the difference between using “let” and “var”
es: ¿Cuál es la diferencia entre usar "let" y "var"
ja: let "と "var "の違いは?
ko: "let"과 "var"의 차이점은 무엇입니까
ru: В чем разница между использованием "let" и "var".
zh_cn: 使用 "let "和 "var "有什么区别?

source: When the first function <code>testVar</code> gets called the variable foo, declared with <code>var</code>, is still accessible outside the <code>if</code> statement. This variable <code>foo</code> would be available <strong>everywhere</strong> within the scope of the <code>testVar</code><strong>function</strong>.
es: Cuando se llama a la primera funci&oacute;n <code>testVar</code> , la variable foo, declarada con <code>var</code> , todav&iacute;a es accesible fuera de la instrucci&oacute;n <code>if</code> . Esta variable <code>foo</code> estar&iacute;a disponible en <strong>todas partes</strong> dentro del alcance de la <strong>funci&oacute;n</strong> <code>testVar</code> .
ja: 最初の関数 <code>testVar</code> が呼び出されたときに、 <code>var</code> で宣言された変数fooは、 <code>if</code> ステートメントの外部から引き続きアクセスできます。 この変数 <code>foo</code> は、 <code>testVar</code> <strong>関数の</strong>スコープ内の<strong>どこでも</strong>使用でき<strong>ます</strong> 。
ko: 첫 번째 함수 <code>testVar</code> 가 호출 될 때 <code>var</code> 로 선언 된 변수 foo는 <code>if</code> 문 외부에서 여전히 액세스 할 수 있습니다. 이 변수 <code>foo</code> 는 <code>testVar</code> <strong>함수</strong> 의 범위 내 <strong>어디에서나</strong> 사용할 수 <strong>있습니다</strong> .
ru: Когда первая функция <code>testVar</code> вызывается, переменная foo, объявленная с помощью <code>var</code> , все еще доступна вне оператора <code>if</code> . Эта переменная <code>foo</code> будет доступна <strong>везде</strong> в рамках <strong>функции</strong> <code>testVar</code> .
zh_cn: 当第一个函数 <code>testVar</code> 被调用时，使用 <code>var</code> 声明的变量foo仍然可以在 <code>if</code> 语句之外访问。 在 <code>testVar</code> <strong>函数</strong>范围内的<strong>任何地方</strong>都可以使用此变量 <code>foo</code> 。

source: When the second function <code>testLet</code> gets called the variable bar, declared with <code>let</code>, is only accessible inside the <code>if</code> statement. Because variables declared with <code>let</code> are <strong>block scoped</strong> (where a block is the code between curly brackets e.g <code>if{}</code> , <code>for{}</code>, <code>function{}</code>).
es: Cuando la segunda funci&oacute;n <code>testLet</code> se llama barra variable, declarada con <code>let</code> , solo es accesible dentro de la instrucci&oacute;n <code>if</code> . Debido a que las variables declaradas con <code>let</code> tienen <strong>un alcance de bloque</strong> (donde un bloque es el c&oacute;digo entre llaves, por ejemplo, <code>if{}</code> , <code>for{}</code> , <code>function{}</code> ).
ja: 2番目の関数 <code>testLet</code> が呼び出されたとき、 <code>let</code> で宣言された変数barは <code>if</code> ステートメント内でのみアクセスできます。 <code>let</code> で宣言された変数は<strong>ブロックスコープ</strong> （ブロックは中括弧の間のコードです。たとえば <code>if{}</code> 、 <code>for{}</code> 、 <code>function{}</code> ）です。
ko: 두 번째 함수 <code>testLet</code> 이 get으로 선언 된 변수 막대를 호출하면 <code>if</code> 문 내에서만 액세스 할 수 있습니다. <code>let</code> 으로 선언 된 변수는 <strong>블록 범위가 지정</strong> 되므로 <strong>블록</strong> 은 중괄호 사이의 코드입니다 (예 : <code>if{}</code> , <code>for{}</code> , <code>function{}</code> ).
ru: Когда <code>testLet</code> вторая функция testLet, переменная bar, объявленная с помощью <code>let</code> , становится доступной только внутри оператора <code>if</code> . Поскольку переменные, объявленные с помощью <code>let</code> , имеют <strong>область видимости блока</strong> (где блок - это код в фигурных скобках, например, <code>if{}</code> , <code>for{}</code> , <code>function{}</code> ).
zh_cn: 当第二个函数 <code>testLet</code> 被调用时，用 <code>let</code> 声明的变量bar只能在 <code>if</code> 语句内部访问。 因为用 <code>let</code> 声明的变量是<strong>块范围的</strong> （块是大括号之间的代码，例如 <code>if{}</code> ， <code>for{}</code> ， <code>function{}</code> ）。

source: When used inside a block, let limits the variable's scope to that block. Note the difference between <strong>var</strong> whose scope is inside the function where it is declared.
es: Cuando se usa dentro de un bloque, permite limitar el alcance de la variable a ese bloque. Tenga en cuenta la diferencia entre <strong>var</strong> cuyo &aacute;mbito est&aacute; dentro de la funci&oacute;n donde se declara.
ja: ブロック内で使用する場合、変数のスコープをそのブロックに制限します。 スコープが宣言されている関数内にある<strong>var</strong>の違いに注意してください。
ko: 블록 안에서 사용될 때 변수의 범위를 해당 블록으로 제한하십시오. 범위가 선언 된 함수 내에 범위가있는 <strong>var</strong> 의 차이점에 유의하십시오.
ru: При использовании внутри блока let ограничивает область действия переменной этим блоком. Обратите внимание на разницу между <strong>var</strong> , область действия которого находится внутри функции, в которой она объявлена.
zh_cn: 在块内使用时，让该变量的作用域限制在该块内。 请注意<strong>var</strong>之间的区别， <strong>var</strong>的范围在声明它的函数内部。

source: When you need a block level deceleration you can go with let and const instead of var.
es: Cuando necesites una desaceleración a nivel de bloque puedes ir con let and const en lugar de var.
ja: ブロックレベルの減速が必要な場合は、var の代わりに let や const を使うことができます。
ko: 블록 레벨 감속이 필요한 경우 var 대신 let 및 const를 사용할 수 있습니다.
ru: Когда вам нужно замедление уровня блока,вы можете использовать let и const вместо var.
zh_cn: 当你需要块级减速时,你可以用let和const代替var。

source: Whereas <code>hfoo</code>, defined by <code>var</code> is initially in the <strong>global scope</strong>, but again when we declare it inside the <code>if clause</code>, it considers the global scope hfoo, although var has been used again to declare it. And when we re-assign its value we see that the global scope hfoo is also affected. This is the primary difference.
es: Mientras que <code>hfoo</code> , definido por <code>var</code> est&aacute; inicialmente en el <strong>alcance global</strong> , pero nuevamente cuando lo declaramos dentro de la <code>if clause</code> , considera el alcance global hfoo, aunque var se ha utilizado nuevamente para declararlo. Y cuando reasignamos su valor, vemos que el alcance global hfoo tambi&eacute;n se ve afectado. Esta es la principal diferencia.
ja: <code>var</code> で定義された <code>hfoo</code> は最初は<strong>グローバルスコープ</strong>にありますが、 <code>if clause</code> 内で宣言すると、varを使用して宣言されていますが、グローバルスコープhfooが考慮されます。 そして、その値を再割り当てすると、グローバルスコープhfooも影響を受けることがわかります。 これが主な違いです。
ko: <code>var</code> 에 의해 정의 된 <code>hfoo</code> 는 처음에 <strong>전역 범위</strong> 에있는 반면, <code>if clause</code> 에서 선언 할 때 전역 범위 hfoo를 고려하지만 var가 다시 선언하는 데 사용되었습니다. 그리고 우리가 그 값을 다시 할당 할 때 우리는 전역 범위 hfoo도 영향을 받는다는 것을 알 수 있습니다. 이것이 주요 차이점입니다.
ru: Принимая во внимание, что <code>hfoo</code> , определенный <code>var</code> , изначально находится в <strong>глобальной области видимости</strong> , но, опять же, когда мы объявляем его внутри предложения <code>if clause</code> , он рассматривает глобальную область действия hfoo, хотя var снова использовался для его объявления. И когда мы переназначаем его значение, мы видим, что глобальная область действия hfoo также затронута. Это основная разница.
zh_cn: 而由 <code>var</code> 定义的 <code>hfoo</code> 最初位于<strong>全局范围内</strong> ，但是当我们在 <code>if clause</code> 声明它时，它仍然考虑全局范围hfoo，尽管再次使用var声明了它。 当我们重新分配它的值时，我们看到全局范围hfoo也受到了影响。 这是主要区别。

source: Which results in counting [0, 7].
es: Lo que resulta en el conteo [0,7].
ja: その結果、[0,7]を数えることになります。
ko: 계산 결과는 [0, 7]입니다.
ru: Что приводит к счету [0,7].
zh_cn: 其结果是计数[0,7]。

source: While variables declared with <code>var</code> keyword are "hoisted" to the top of the block which means they are accessible in their enclosing scope even before they are declared:
es: Si bien las variables declaradas con la palabra clave <code>var</code> se "alzan" en la parte superior del bloque, lo que significa que son accesibles en su alcance incluso antes de que se declaren:
ja: <code>var</code> キーワードで宣言された変数はブロックの先頭に「巻き上げ」られますが、宣言される前であっても、それらの囲みスコープでアクセスできます。
ko: <code>var</code> 키워드로 선언 된 변수는 블록 상단에 "상승"되어 있지만 선언하기 전에도 포함 범위에서 액세스 할 수 있습니다.
ru: В то время как переменные, объявленные с ключевым словом <code>var</code> , &laquo;подняты&raquo; в верхнюю часть блока, что означает, что они доступны в своей области охвата даже до того, как они объявлены:
zh_cn: 尽管使用 <code>var</code> 关键字声明的变量被&ldquo;提升&rdquo;到块的顶部，这意味着即使在声明它们之前，也可以在其封闭范围内访问它们：

source: With a variable defined with var, if the Engine cannot find the variable in the current Execution Context's Variable Environment, then it will go up the scope chain (the Outer Environment) and check the Outer Environment's Variable Environment for the variable. If it cannot find it there, it will continue searching the Scope Chain. This is not the case with let and const.
es: Con una variable definida con var,si la Máquina no puede encontrar la variable en el Entorno Variable del Contexto de Ejecución actual,entonces subirá por la cadena de alcance (el Entorno Exterior)y buscará la variable en el Entorno Variable del Entorno Exterior.Si no la encuentra allí,continuará buscando en la cadena de alcance.Este no es el caso de let and const.
ja: var で定義された変数で、現在の実行コンテキストの変数環境でその変数が見つからない場合、エンジンはスコープ チェーン (外部環境)をさかのぼり、外部環境の変数環境でその変数をチェックします。もしそこに変数が見つからなければ、スコープチェーンの検索を続けます。これは let や const の場合とは異なります。
ko: var로 정의 된 변수를 사용하면 엔진이 현재 실행 컨텍스트의 변수 환경에서 변수를 찾을 수 없으면 범위 체인 (외부 환경)으로 이동하여 변수에 대한 외부 환경의 변수 환경을 확인합니다. 찾을 수 없으면 스코프 체인을 계속 검색합니다. let과 const는 그렇지 않습니다.
ru: С переменной,определенной с помощью var,если движок не может найти переменную в текущем окружении переменной контекста выполнения,то он пойдет вверх по цепочке scope (Внешнее окружение)и проверит для переменной Внешнее окружение переменной.Если он не может найти ее там,то продолжит поиск в Scope Chain.Это не так в случае с Allow и const.
zh_cn: 对于一个用var定义的变量,如果引擎在当前执行上下文的变量环境中找不到该变量,那么它就会在范围链(外部环境)中寻找该变量。如果在那里找不到,它将继续在范围链中搜索。而let和const的情况就不是这样。

source: With this approach errors present in JavaScript are getting removed.
es: Con este enfoque se eliminan los errores presentes en JavaScript.
ja: この方法では、JavaScriptに存在するエラーを除去しています。
ko: 이 접근 방식으로 JavaScript에 존재하는 오류가 제거됩니다.
ru: При таком подходе ошибки,присутствующие в JavaScript,удаляются.
zh_cn: 通过这种方法,JavaScript中存在的错误会被删除。

source: You always must specify a value when declaring a variable using <code>const</code>.
es: Siempre debe especificar un valor al declarar una variable usando <code>const</code> .
ja: <code>const</code> を使用して変数を宣言するときは、常に値を指定する必要があります。
ko: <code>const</code> 를 사용하여 변수를 선언 할 때는 항상 값을 지정해야합니다.
ru: Вы всегда должны указывать значение при объявлении переменной с помощью <code>const</code> .
zh_cn: 使用 <code>const</code> 声明变量时，必须始终指定一个值。

source: You can't declare the same variable multiple times using <code>let</code>. You also can't declare a variable using <code>let</code> with the same identifier as another variable which was declared using <code>var</code>.
es: No puede declarar la misma variable varias veces usando <code>let</code> . Tampoco puede declarar una variable usando <code>let</code> con el mismo identificador que otra variable que se declar&oacute; usando <code>var</code> .
ja: <code>let</code> を使用して同じ変数を複数回宣言することはできません。 また、変数を <code>let</code> <code>var</code> を使用して宣言された別の変数と同じ識別子でletを使用して宣言することもできません。
ko: <code>let</code> 을 사용하여 동일한 변수를 여러 번 선언 할 수 없습니다. <code>var</code> 를 사용하여 선언 된 다른 변수와 동일한 식별자를 사용하여 <code>let</code> 을 사용하여 변수를 선언 할 수도 없습니다.
ru: Вы не можете объявить одну и ту же переменную несколько раз, используя <code>let</code> . Вы также не можете объявить переменную, используя <code>let</code> с тем же идентификатором, что и другая переменная, которая была объявлена ​​с помощью <code>var</code> .
zh_cn: 您不能使用 <code>let</code> 多次声明相同的变量。 您也不能使用 <code>let</code> 声明变量，该变量具有与另一个使用 <code>var</code> 声明的变量相同的标识符。

source: e.g. It scopes to the enclosing block, They don't exist before they're declared, etc.
es: p.ej.Alcanza el bloque de cierre,no existen antes de ser declarados,etc.
ja: 例:囲んでいるブロックにスコープする、宣言される前には存在しない、など。
ko: 예를 들어, 그것은 블록을 둘러싸고, 선언되기 전에 존재하지 않습니다.
ru: Например,он охватывает ограждающий блок,их не существует до объявления,и т.д.
zh_cn: 例如:它的作用域到包围块,它们在被声明之前是不存在的等等。

source: let is a part of es6. These functions will explain the difference in easy way.
es: Vamos a ser parte de ESO.Estas funciones explicarán la diferencia de manera fácil.
ja: let は es6 の一部です。これらの関数の違いを簡単に説明します。
ko: let은 es6의 일부입니다. 이러한 기능을 통해 차이점을 쉽게 설명 할 수 있습니다.
ru: давайте будем частью 6-го сезона.Эти функции легко объяснят разницу.
zh_cn: let是es6的一部分。这些功能将用简单的方法来解释其区别。

source: let vs var. It's all about <strong>scope</strong>.
es: let vs var. Se trata de <strong>alcance</strong> .
ja: 対変数をしましょう。 すべては<strong>スコープ</strong>についてです。
ko: let vs var. <strong>범위</strong> 에 관한 것입니다.
ru: пусть против вар. Все дело в <strong>сфере</strong> .
zh_cn: 让vs var。 这一切都与<strong>范围</strong>有关。

source: one of the most famous interview questions on scope also can suffice the exact use of <code>let</code> and <code>var</code> as below;
es: Una de las preguntas de entrevista m&aacute;s famosas sobre el alcance tambi&eacute;n puede ser suficiente para el uso exacto de <code>let</code> y <code>var</code> como se muestra a continuaci&oacute;n;
ja: スコープに関する最も有名なインタビューの質問の1つでも、以下のように <code>let</code> と <code>var</code> を正確に使用できます。
ko: 범위에서 가장 유명한 인터뷰 질문 중 하나는 다음과 같이 <code>let</code> 및 <code>var</code> 의 정확한 사용으로 충분할 수 있습니다.
ru: один из самых известных вопросов об интервью также может быть достаточным для точного использования <code>let</code> и <code>var</code> , как показано ниже;
zh_cn: 关于范围的最著名的访谈问题之一也可以满足 <code>let</code> 和 <code>var</code> 的确切用法，如下所示；

source: variables with <code>let</code><strong>don't</strong> get hoisted:
es: Las variables con <code>let</code> <strong>no</strong> se izan:
ja: <code>let</code> を使用 <strong>した</strong>変数は巻き上げられ<strong>ません</strong> 。
ko: <code>let</code> 변수는 게양 <strong>되지 않습니다</strong> :
ru: переменные с <code>let</code> <strong>not</strong> получить:
zh_cn: <code>let</code> <strong>不要</strong>挂起变量：

source: variables with <code>var</code><strong>do</strong> get hoisted:
es: las variables con <code>var</code> se alzan:
ja: <code>var</code> を持つ変数は巻き上げられます：
ko: <code>var</code> 변수는 게양됩니다 :
ru: Переменные с переменной <strong>действительно</strong> поднимаются:
zh_cn: 带有 <code>var</code> 的变量<strong>确实</strong>被吊起：
