Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Inside a function
es: Dentro de una función
ja: 機能の内部
ko: 함수 내부
ru: Внутри функции
zh_cn: 内部功能

source: Inside a function (but outside of a block), <code>let</code> has the same scope as <code>var</code>.
es: Dentro de una funci&oacute;n (pero fuera de un bloque), <code>let</code> tiene el mismo alcance que <code>var</code> .
ja: 関数の内部（ただしブロックの外部）では、 <code>let</code> のスコープは <code>var</code> と同じです。
ko: 함수 내부 (하지만 블록 외부)는 <code>var</code> 와 동일한 범위를 갖습니다.
ru: Внутри функции (но вне блока) область <code>let</code> имеет ту же область, что и <code>var</code> .
zh_cn: 在函数内部（但在块外部）， <code>let</code> 具有与 <code>var</code> 相同的作用域。

source: Inside a loop
es: Dentro de un bucle
ja: ループ内
ko: 루프 내부
ru: Внутри петли
zh_cn: 循环内

source: Is it safe to use <code>let</code> today?
es: &iquest;Es seguro usar <code>let</code> hoy?
ja: <code>let</code> を今日使用しても安全ですか？
ko: 오늘 <code>let</code> 을 사용해도 안전한가요?
ru: Безопасно ли использовать сегодня?
zh_cn: 今天使用 <code>let</code> 安全吗？

source: It also appears that, at least in Visual Studio 2015, TypeScript 1.5, "var" allows multiple declarations of the same variable name in a block, and "let" doesn't.
es: También parece que,al menos en Visual Studio 2015,TypeScript 1.5,"var" permite múltiples declaraciones del mismo nombre de la variable en un bloque,y "let" no.
ja: また、少なくともVisual Studio 2015,TypeScript 1.5では、"var "はブロック内の同じ変数名の複数宣言を許可し、"let "は許可しないようです。
ko: 또한 적어도 Visual Studio 2015, TypeScript 1.5에서 "var"은 블록에 동일한 변수 이름을 여러 번 선언 할 수 있지만 "let"은 그렇지 않습니다.
ru: Также оказывается,что,по крайней мере,в Visual Studio 2015,TypeScript 1.5,"var" позволяет несколько объявлений одного и того же имени переменной в блоке,а "let"-нет.
zh_cn: 看来,至少在Visual Studio 2015、TypeScript 1.5中,"var "也允许在一个块中对同一个变量名进行多次声明,而 "let "不允许。

source: Loops with closures
es: Lazos con cierres
ja: クローズアップされたループ
ko: 클로저가있는 루프
ru: Петли с затворами
zh_cn: 带封闭装置的环路

source: Main difference is scoping rules. Variables declared by <code>var</code> keyword are scoped to the immediate function body (hence the function scope) while <code>let</code> variables are scoped to the immediate <em>enclosing</em> block denoted by <code>{ }</code> (hence the block scope).
es: La principal diferencia son las reglas de alcance. Las variables declaradas por la palabra clave <code>var</code> tienen un alcance en el cuerpo de la funci&oacute;n inmediata (de ah&iacute; el alcance de la funci&oacute;n) mientras <code>let</code> variables tienen un alcance en el bloque de <em>cierre</em> inmediato denotado por <code>{ }</code> (de ah&iacute; el alcance del bloque).
ja: 主な違いはスコーピングルールです。 <code>var</code> キーワードで宣言された変数のスコープは、直接の関数本体（つまり、関数スコープ）ですが <code>let</code> 変数のスコープは、 <code>{ }</code> 示される直接の<em>囲み</em>ブロック（つまり、ブロックスコープ）です。
ko: 주요 차이점은 범위 지정 규칙입니다. <code>var</code> 키워드로 선언 된 변수는 직접 함수 본문 (따라서 함수 범위)에 범위가 지정되는 반면 <code>let</code> 변수는 <code>{ }</code> (블록 범위)로 표시되는 즉시 <em>둘러싸는</em> 블록에 범위가 지정됩니다.
ru: Основное отличие заключается в правилах определения объема. Переменные, объявленные ключевым словом <code>var</code> , попадают в область непосредственного тела функции (отсюда область действия функции), а переменные <code>let</code> - в область непосредственного <em>включения,</em> обозначенную <code>{ }</code> (отсюда область действия блока).
zh_cn: 主要区别是作用域规则。 <code>var</code> 关键字声明的变量的作用域范围是立即函数主体（因此作用域），而 <code>let</code> 变量的作用域范围由 <code>{ }</code> 表示的直接<em>封闭</em>块（因此块作用域）。

source: May the following two functions show the difference:
es: Que las siguientes dos funciones muestren la diferencia:
ja: 次の2つの関数で違いがわかりますように。
ko: 다음 두 함수가 차이점을 보여주기를 바랍니다.
ru: Пусть следующие две функции покажут разницу:
zh_cn: 愿以下两种功能的区别。

source: No re-assigning
es: No hay reasignación
ja: 再指定なし
ko: 재 할당 없음
ru: Нет перепрофилирования
zh_cn: 没有重新分配

source: No re-declaring
es: No hay que volver a declarar
ja: 再宣言なし
ko: 다시 선언하지 않음
ru: Никаких повторных деклараций
zh_cn: 不需重新申报

source: Note that it doesn't mean that the value is immutable. Its properties still can be changed.
es: Tengan en cuenta que eso no significa que el valor sea inmutable.Sus propiedades aún pueden ser cambiadas.
ja: 値が不変という意味ではないことに注意してください。そのプロパティはまだ変更可能です。
ko: 값이 변경 불가능하다는 의미는 아닙니다. 여전히 속성을 변경할 수 있습니다.
ru: Обратите внимание,что это не значит,что значение незыблемо.Его свойства все еще могут быть изменены.
zh_cn: 注意,这并不意味着这个值是不可更改的。它的属性仍然是可以改变的。

source: Note that only Mozilla and Chrome browsers support it. IE, Safari, and potentially others don't.
es: Ten en cuenta que sólo los navegadores Mozilla y Chrome lo soportan.IE,Safari y potencialmente otros no lo hacen.
ja: MozillaとChromeブラウザだけがサポートしていることに注意してください。IE、Safari、および潜在的に他のブラウザは対応していません。
ko: Mozilla 및 Chrome 브라우저 만 지원합니다. IE, Safari 및 잠재적으로 다른 사람들은 그렇지 않습니다.
ru: Обратите внимание,что его поддерживают только браузеры Mozilla и Chrome.IE,Safari и,возможно,другие нет.
zh_cn: 注意,只有Mozilla和Chrome浏览器支持它。IE、Safari和其他浏览器可能不支持。

source: Now I think there is better scoping of variables to a block of statements using <code>let</code>:
es: Ahora creo que hay un mejor alcance de las variables para un bloque de declaraciones usando <code>let</code> :
ja: 今私は <code>let</code> を使用してステートメントのブロックに変数のより良いスコープがあると思います：
ko: 이제 <code>let</code> 을 사용하여 문장 블록에 변수 범위를 더 잘 지정한다고 생각합니다.
ru: Теперь я думаю, что есть лучшая область видимости переменных для блока операторов, использующего <code>let</code> :
zh_cn: 现在，我认为使用 <code>let</code> 更好地将变量的作用域范围限定为语句块：

source: Now, image mixing the two behaviors and you'll probably see why it's not recommended to mix the newer <code>let</code> and <code>const</code> with the older <code>var</code> in the same script. Doing so can result is some spectacularly confusing code.
es: Ahora, mezcla im&aacute;genes de los dos comportamientos y probablemente ver&aacute;s por qu&eacute; no se recomienda mezclar el <code>let</code> y <code>const</code> m&aacute;s nuevo con el <code>var</code> m&aacute;s antiguo en el mismo script. Hacerlo puede resultar en un c&oacute;digo espectacularmente confuso.
ja: ここで、2つの動作を混在させた画像を見ると、同じスクリプトで新しい <code>let</code> と <code>const</code> を古い変数と混在させることが推奨されない理由がわかるでしょう。 これを行うと、コードが非常に混乱する可能性があります。
ko: 이제 두 가지 동작을 이미지로 혼합하면 동일한 스크립트에서 최신 <code>let</code> 과 <code>const</code> 를 이전 <code>var</code> 와 혼합하지 않는 것이 좋습니다. 그렇게하면 결과적으로 혼란스러운 코드가 생길 수 있습니다.
ru: Теперь смешайте два поведения, и вы, вероятно, поймете, почему не рекомендуется смешивать более новые <code>let</code> и <code>const</code> со старыми <code>var</code> в одном и том же сценарии. Это может привести к некоторому удивительно запутанному коду.
zh_cn: 现在，对两种行为进行图像混合，您可能会明白为什么不建议在同一脚本中将较新的 <code>let</code> 和 <code>const</code> 与较旧的 <code>var</code> 混合使用。 这样做可能会导致一些令人困惑的代码。

source: Only counts [0, 1].
es: Sólo cuenta [0,1].
ja: 0,1]のみをカウントします。
ko: [0, 1] 만 계산합니다.
ru: Считается только [0,1].
zh_cn: 只算[0,1]。

source: People had to create immediately invoked functions to capture correct value from the loops but that was also hairy.
es: La gente tenía que crear inmediatamente funciones invocadas para capturar el valor correcto de los bucles,pero eso también era peliagudo.
ja: 人々はループから正しい値を取り込むために、すぐに呼び出される関数を作らなければなりませんでしたが、それもまた毛むくじゃらでした。
ko: 사람들은 루프에서 올바른 값을 캡처하기 위해 즉시 호출 된 함수를 만들어야했지만 머리카락도 많았습니다.
ru: Людям приходилось сразу же создавать вызываемые функции для захвата корректных значений из циклов,но это тоже было волосато.
zh_cn: 人们不得不创建立即调用的函数来捕获循环中的正确值,但这也是毛毛的。

source: People with not a clear understanding about scoping in JavaScript used to make the mistake earlier.
es: La gente que no tiene una comprensión clara del alcance en JavaScript solía cometer el error antes.
ja: JavaScriptのscopingをよく理解していない人は、先ほどの間違いを利用していました。
ko: JavaScript의 범위 지정에 대해 명확하게 이해하지 못하는 사람들은 실수를 일찍 저 지르 곤했습니다.
ru: Люди с непонятным пониманием области применения JavaScript,которые раньше ошибались.
zh_cn: 对JavaScript中的Scoping不甚了解的人,以前都会犯这样的错误。

source: Previously there were only two scopes in JavaScript, i.e. functional and global. With '<code>let</code>' keyword JavaScript has now introduced <code>block-level</code> variables.
es: Anteriormente solo hab&iacute;a dos &aacute;mbitos en JavaScript, es decir, funcional y global. Con la palabra clave ' <code>let</code> ', JavaScript ahora ha introducido variables a <code>block-level</code> .
ja: 以前は、JavaScriptにはスコープが2つしかありませんでした。 ' <code>let</code> 'キーワードを使用すると、JavaScriptに <code>block-level</code> 変数が導入されました。
ko: 이전에는 JavaScript에서 기능과 전역의 두 가지 범위 만있었습니다. ' <code>let</code> '키워드를 사용하면 JavaScript에서 <code>block-level</code> 변수가 도입되었습니다.
ru: Ранее в JavaScript было только две области действия: функциональная и глобальная. С помощью ключевого слова <code>let</code> в JavaScript появились переменные <code>block-level</code> .
zh_cn: 以前，JavaScript中只有两个作用域，即功能性和全局性。 现在，使用' <code>let</code> '关键字，JavaScript引入了 <code>block-level</code> 变量。

source: Refer to <em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6 In Depth: let and const</a></em> to understand it better.
es: Consulte <em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6 en profundidad: let y const</a></em> para comprenderlo mejor.
ja: <em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6の</a></em>詳細<em>：letとconst</em>を参照してください。
ko: <em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6 In Depth : let 및 const</a></em> 를 참조하여 더 잘 이해하십시오.
ru: Обратитесь к <em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6 In Depth: пусть и const,</a></em> чтобы понять это лучше.
zh_cn: 请参阅<em><a href="https://hacks.mozilla.org/2015/07/es6-in-depth-let-and-const/">ES6深度：let和const</a></em>可以更好地理解它。

source: Scoping rules
es: Reglas de alcance
ja: スコーピングルール
ko: 범위 지정 규칙
ru: Основные положения
zh_cn: 范围界定规则

source: See '<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">Emulating private interfaces</a>'
es: Consulte ' <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">Emulaci&oacute;n de interfaces privadas</a> '
ja: 「 <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">プライベートインターフェイス</a>のエミュレート 」を参照してください
ko: ' <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">개인 인터페이스 에뮬레이션</a> '을 참조하십시오.
ru: Смотрите &laquo; <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">Эмуляция частных интерфейсов</a> &raquo;.
zh_cn: 请参阅&ldquo; <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Statements/let#Emulating_private_interfaces">模拟专用接口</a> &rdquo;

source: See my example below, and note how the lion (let) variable acts differently in the two console.logs; it becomes out of scope in the 2nd console.log.
es: Vea mi ejemplo a continuación,y observe cómo la variable león (let)actúa de forma diferente en los dos console.logs;queda fuera de alcance en el 2º console.log.
ja: 以下の私の例を見てください。そして、lion (let)変数が 2 つの console.log でどのように異なる動作をしているかに注意してください。
ko: 아래의 예를보고 lion (let) 변수가 두 console.logs에서 어떻게 다르게 작동하는지 참고하십시오. 두 번째 console.log에서 범위를 벗어납니다.
ru: Смотрите мой пример ниже,и обратите внимание на то,как переменная lion (let)действует по-разному в двух консольных логах;она выходит из-под контроля во 2-м консольном лог-файле.
zh_cn: 请看我下面的例子,注意lion (let)变量在两个console.log中的作用是如何不同的,它在第二个console.log中变得不在范围内。

source: So the difference is very simple i.e its scope.
es: Así que la diferencia es muy simple,es decir,su alcance.
ja: だから、違いは非常に単純なすなわちその範囲です。
ko: 따라서 그 차이는 매우 간단합니다. 즉 범위입니다.
ru: Так что разница очень проста,т.е.ее масштабы.
zh_cn: 所以区别很简单,就是它的范围。

source: Some hacks with <code>let</code>:
es: Algunos hacks con <code>let</code> :
ja: <code>let</code> を使ったハック：
ko: <code>let</code> 으로 해킹하기 :
ru: Некоторые взломы с <code>let</code> :
zh_cn: <code>let</code> 的一些技巧：

source: Some people would argue that in the future we'll ONLY use let statements and that var statements will become obsolete. JavaScript guru <a href="https://twitter.com/getify"><strong>Kyle Simpson</strong></a> wrote <a href="https://davidwalsh.name/for-and-against-let"><strong>a very elaborate article on why he believes that won't be the case</strong></a>.
es: Algunas personas argumentan que en el futuro SOLO usaremos declaraciones let y que las declaraciones var se volver&aacute;n obsoletas. El gur&uacute; de JavaScript <a href="https://twitter.com/getify"><strong>Kyle Simpson</strong></a> escribi&oacute; <a href="https://davidwalsh.name/for-and-against-let"><strong>un art&iacute;culo muy elaborado sobre por qu&eacute; cree que ese no ser&aacute; el caso</strong></a> .
ja: 一部の人々は、将来的にはletステートメントのみを使用し、varステートメントは廃止されると主張するでしょう。 JavaScriptの第一人者である<a href="https://twitter.com/getify"><strong>カイル・シンプソン</strong></a>は<a href="https://davidwalsh.name/for-and-against-let"><strong>、彼がそうではないと信じる理由について非常に精巧な記事を</strong></a>書きまし<strong>た</strong> 。
ko: 어떤 사람들은 미래에 let 문만 사용할 것이며 var 문은 더 이상 사용되지 않을 것이라고 주장합니다. 자바 스크립트 전문가 <a href="https://twitter.com/getify"><strong>카일 심슨 (Kyle Simpson)</strong></a> 은 <a href="https://davidwalsh.name/for-and-against-let"><strong>왜 그렇지 않다고 믿는지에 대해 매우 정교한 기사를</strong></a> 썼습니다.
ru: Некоторые люди утверждают, что в будущем мы будем использовать ТОЛЬКО операторы let, а операторы var станут устаревшими. Гуру JavaScript <a href="https://twitter.com/getify"><strong>Кайл Симпсон</strong></a> написал <a href="https://davidwalsh.name/for-and-against-let"><strong>очень сложную статью о том, почему он считает, что это не так</strong></a> .
zh_cn: 有人会说，将来我们只会使用let语句，而var语句将变得过时。 JavaScript专家<a href="https://twitter.com/getify"><strong>凯尔&bull;辛普森</strong></a> （ <strong>Kyle Simpson）</strong>写<a href="https://davidwalsh.name/for-and-against-let"><strong>了一篇非常详细的文章，阐述了为什么他认为情况并非如此</strong></a> 。

source: Specifically, this outputs:
es: Específicamente,esto produce:
ja: 具体的には、これを出力します。
ko: 구체적으로 다음과 같이 출력됩니다.
ru: В частности,это выходит:
zh_cn: 具体来说,这种输出。

source: Take a look at this example from <a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">another stackoverflow question</a>:
es: Eche un vistazo a este ejemplo de <a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">otra pregunta de stackoverflow</a> :
ja: <a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">別のstackoverflowの質問</a>からこの例を見てみましょう：
ko: <a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">다른 stackoverflow 질문</a> 에서이 예제를 살펴보십시오.
ru: Взгляните на этот пример из <a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">другого вопроса stackoverflow</a> :
zh_cn: 看一下<a href="https://stackoverflow.com/questions/750486/javascript-closure-inside-loops-simple-practical-example">另一个stackoverflow问题的</a>示例：

source: Temporal dead zone
es: Zona muerta temporal
ja: 時間的不感帯
ko: 일시적 데드 존
ru: Временно мертвая зона
zh_cn: 时空死亡区

source: The <code>click</code> handler callback does not need the <code>hugeData</code> variable at all. Theoretically, after <code>process(..)</code> runs, the huge data structure <code>hugeData</code> could be garbage collected. However, it's possible that some JS engine will still have to keep this huge structure, since the <code>click</code> function has a closure over the entire scope.
es: La devoluci&oacute;n de llamada del controlador de <code>click</code> no necesita la variable <code>hugeData</code> en absoluto. Te&oacute;ricamente, despu&eacute;s de que <code>process(..)</code> ejecuta el proceso (..) , la gran estructura de datos <code>hugeData</code> podr&iacute;a ser recogida de basura. Sin embargo, es posible que algunos motores JS a&uacute;n tengan que mantener esta enorme estructura, ya que la funci&oacute;n de <code>click</code> tiene un cierre en todo el alcance.
ja: <code>click</code> ハンドラーコールバックは <code>hugeData</code> 変数をまったく必要としません。 理論的には、 <code>process(..)</code> 実行後、巨大なデータ構造 <code>hugeData</code> がガベージコレクションされる可能性があります。 ただし、 <code>click</code> 関数はスコープ全体にクロージャを持っているため、一部のJSエンジンはこの巨大な構造を維持する必要がある可能性があります 。
ko: <code>click</code> 핸들러 콜백에는 <code>hugeData</code> 변수가 전혀 필요하지 않습니다. 이론적으로 <code>process(..)</code> 가 실행 된 후 <code>hugeData</code> 구조체 hugeData 는 가비지 수집 될 수 있습니다. 그러나 <code>click</code> 기능이 전체 범위에 걸쳐 폐쇄되어 있기 때문에 일부 JS 엔진은 여전히이 거대한 구조를 유지해야 할 수도 있습니다.
ru: <code>hugeData</code> обработчика щелчков вообще не нужна переменная largeData . Теоретически, после <code>hugeData</code> <code>process(..)</code> огромная структура данных огромный_данных может быть собрана сборщиком мусора. Тем не менее, возможно, что некоторый движок JS все еще должен будет сохранять эту огромную структуру, поскольку функция <code>click</code> имеет замыкание по всей области видимости.
zh_cn: <code>click</code> 处理程序回调完全不需要 <code>hugeData</code> 变量。 从理论上讲，在 <code>process(..)</code> 运行之后，可以对巨大的数据结构 <code>hugeData</code> 进行垃圾回收。 但是，某些JS引擎仍可能必须保留这种庞大的结构，因为 <code>click</code> 函数在整个作用域内都是封闭的。

source: The <code>gfoo</code>, defined by <code>let</code> initially is in the <strong>global scope</strong>, and when we declare <code>gfoo</code> again inside the <code>if clause</code> its <strong><em>scope changed</em></strong> and when a new value is assigned to the variable inside that scope it <strong>does not affect</strong> the global scope.
es: El <code>gfoo</code> , definido por <code>let</code> inicialmente est&aacute; en el <strong>alcance global</strong> , y cuando declaramos <code>gfoo</code> nuevamente dentro de la <code>if clause</code> su <strong><em>alcance cambi&oacute;</em></strong> y cuando se asigna un nuevo valor a la variable dentro de ese alcance, <strong>no afecta</strong> el alcance global.
ja: 最初に <code>let</code> によって定義された <code>gfoo</code> は<strong>グローバルスコープ</strong>にあり、 <code>if clause</code> 内で <code>gfoo</code> を再び宣言すると、 <strong><em>スコープが変更され</em></strong> 、その<strong><em>スコープ</em></strong>内の変数に新しい値が割り当てられても、グローバルスコープに<strong>は影響しません</strong> 。
ko: <code>let</code> 에 의해 처음 정의 된 <code>gfoo</code> 는 <strong>전역 범위</strong> 에 있으며 <code>if clause</code> 에서 <code>gfoo</code> 를 다시 선언 하면 해당 <strong><em>범위가 변경</em></strong> 되고 해당 <strong><em>범위</em></strong> 내의 변수에 새 값이 할당되면 전역 범위에 <strong>영향을 미치지 않습니다</strong> .
ru: <code>gfoo</code> , определенный с помощью <code>let</code> initial , находится в <strong>глобальной области видимости</strong> , и когда мы снова объявляем <code>gfoo</code> в <code>if clause</code> его <strong><em>область видоизменяется,</em></strong> и когда новое значение присваивается переменной внутри этой области видимости, это <strong>не влияет</strong> на глобальную область видимости.
zh_cn: 由 <code>let</code> 定义的 <code>gfoo</code> 最初位于<strong>全局范围内</strong> ，当我们在 <code>if clause</code> 再次声明 <code>gfoo</code> 时，其<strong><em>范围已更改，</em></strong>并且向该范围内的变量分配了新值时，它<strong>不会影响</strong>全局范围。

source: The <code>let</code> keyword attaches the variable declaration to the scope of whatever block (commonly a <code>{ .. }</code> pair) it's contained in. In other words,<code>let</code> implicitly hijacks any block's scope for its variable declaration.
es: La palabra clave <code>let</code> adjunta la declaraci&oacute;n de variable al alcance de cualquier bloque (com&uacute;nmente un par <code>{ .. }</code> ) en el que se encuentra. En otras palabras, <code>let</code> secuestra impl&iacute;citamente el alcance de cualquier bloque para su declaraci&oacute;n de variable.
ja: <code>let</code> キーワードは、変数宣言を、それが含まれているブロック（通常は <code>{ .. }</code> ペア）のスコープにアタッチします。つまり、 <code>let</code> は、変数宣言のためにブロックのスコープを暗黙的にハイジャックします。
ko: <code>let</code> 키워드는 변수 선언을 포함하는 모든 블록 (일반적으로 <code>{ .. }</code> 쌍)의 범위에 변수 선언을 첨부합니다. 즉, 변수 선언을 위해 블록의 범위를 암시 적으로 빼냅니다.
ru: Ключевое слово <code>let</code> присоединяет объявление переменной к области действия любого блока (обычно пары <code>{ .. }</code> ), в котором он содержится. Другими словами, <code>let</code> неявно перехватывает область действия любого блока для его объявления переменной.
zh_cn: <code>let</code> 关键字将变量声明附加到它所包含的任何块（通常是一对 <code>{ .. }</code> 对）的范围。换句话说， <code>let</code> 隐式劫持了任何块的变量声明范围。

source: The accepted answer is missing a point:
es: La respuesta aceptada no tiene sentido:
ja: 受け入れられた答えは、ポイントが抜けている。
ko: 수락 된 답변에 요점이 없습니다.
ru: Принятый ответ не имеет смысла:
zh_cn: 接受的答案是缺少一个点。

source: The below shows how 'let' and 'var' are different in the scope:
es: A continuación se muestra cómo "dejar" y "var" son diferentes en el ámbito:
ja: let'と'var'がスコープの中でどのように違うのかを示しています。
ko: 아래는 'let'과 'var'이 범위에서 어떻게 다른지 보여줍니다.
ru: Ниже показано,как 'let' и 'var' различаются в области видимости:
zh_cn: 下图显示了 "let "和 "var "在范围中的区别。

source: The below table summarize the difference between var, let and const
es: En el siguiente cuadro se resume la diferencia entre var,let y const
ja: 以下の表は var,let と const の違いをまとめたものです。
ko: 아래 표는 var, let 및 const의 차이점을 요약 한 것입니다
ru: В нижеследующей таблице приведена краткая информация о разнице между var,let и const
zh_cn: 下表总结了var、let和const之间的区别。

source: The difference is in the <a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">scope</a> of the variables declared with each.
es: La diferencia est&aacute; en el <a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">alcance</a> de las variables declaradas con cada uno.
ja: 違いは、それぞれで宣言された変数の<a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">スコープ</a>にあります。
ko: 차이점은 각각 선언 된 변수의 <a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">범위</a> 에 있습니다.
ru: Разница заключается в <a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">объеме</a> переменных, объявленных с каждой.
zh_cn: 不同之处在于每个变量声明的变量的<a href="https://en.wikipedia.org/wiki/Variable_(computer_science)#Scope_and_extent">范围</a> 。

source: The difference is scoping. <code>var</code> is scoped to the nearest <strong>function block</strong> and <code>let</code> is scoped to the <strong>nearest enclosing block</strong>, which can be smaller than a function block. Both are global if outside any block.Lets see an example:
es: La diferencia es el alcance. <code>var</code> se limita al <strong>bloque de funciones</strong> m&aacute;s cercano y <code>let</code> se limita al <strong>bloque de cierre m&aacute;s cercano</strong> , que puede ser m&aacute;s peque&ntilde;o que un bloque de funciones. Ambos son globales si est&aacute;n fuera de cualquier bloque. Veamos un ejemplo:
ja: 違いはスコープです。 <code>var</code> のスコープは最も近い<strong>関数ブロックで</strong> 、 <code>let</code> のスコープは<strong>最も近い囲みブロックです</strong> 。これは関数ブロックよりも小さい場合があります。 いずれかのブロックの外側にある場合、どちらもグローバルです。例を見てみましょう。
ko: 차이점은 범위입니다. <code>var</code> 는 가장 가까운 <strong>기능 블록</strong> 으로 범위가 지정되고 <code>let</code> 은 <strong>가장 가까운 둘러싸는 블록으로</strong> 범위가 지정되며 기능 블록보다 작을 수 있습니다. 블록 외부에있는 경우 둘 다 전역입니다.
ru: Разница в том, <code>var</code> ограничен ближайшим <strong>функциональным блоком,</strong> а <code>let</code> ограничен <strong>ближайшим включающим блоком</strong> , который может быть меньше функционального блока. Оба являются глобальными, если находятся вне какого-либо блока. Давайте посмотрим на пример:
zh_cn: 区别在于范围。 <code>var</code> 的作用域是最近的<strong>功能块，</strong>而 <code>let</code> 的作用域是<strong>最近的封闭块</strong> ，它可以小于功能块。 如果在任何块之外，两者都是全局的。让我们看一个例子：
