Repository: rueisnom/feedback
Catalog: xlf/76/20/11/762011.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As you can see the <code>var j</code> variable is still having a value outside of the for loop scope (Block Scope), but the <code>let i</code> variable is undefined outside of the for loop scope.
es: Como puede ver, la variable <code>var j</code> todav&iacute;a tiene un valor fuera del alcance del bucle for (Alcance del bloque), pero la variable <code>let i</code> no est&aacute; definida fuera del alcance del bucle for.
ja: ご覧のとおり、 <code>var j</code> 変数はforループスコープ（ブロックスコープ）の外に値を持っていますが、 <code>let i</code> 変数はforループスコープの外では未定義です。
ko: 보시다시피 <code>var j</code> 변수는 여전히 for 루프 범위 (블록 범위) 외부에 값이 있지만, <code>let i</code> 변수는 for 루프 범위 외부에서 정의되지 않습니다.
ru: Как видите, переменная <code>var j</code> по-прежнему имеет значение вне области цикла for (Block Scope), но переменная <code>let i</code> не определена вне области цикла for.
zh_cn: 如您所见， <code>var j</code> 变量的值仍在for循环范围（Block Scope）之外，但在for循环范围之外， <code>let i</code> 变量未定义。

source: At the top level (outside of a function)
es: En el nivel superior (fuera de una función)
ja: トップレベル(機能の外側)で
ko: 최상위 수준 (함수 외부)
ru: На верхнем уровне (вне функции)
zh_cn: 在顶层(功能外)

source: At the top level of programs and functions, <strong>let</strong>, unlike <strong>var</strong>, does not create a property on the global object. For example:
es: En el nivel superior de programas y funciones, <strong>let</strong> , a diferencia de <strong>var</strong> , no crea una propiedad en el objeto global. Por ejemplo:
ja: プログラムと関数のトップレベルでは、 <strong>let</strong>は、 <strong>var</strong>とは異なり、グローバルオブジェクトにプロパティを作成しません。 例えば：
ko: <strong>var</strong> 과 달리 프로그램과 함수의 최상위 수준에서는 전역 객체에 속성을 만들지 않습니다. 예를 들면 다음과 같습니다.
ru: На верхнем уровне программ и функций <strong>пусть</strong> , в отличие от <strong>var</strong> , не создается свойство глобального объекта. Например:
zh_cn: 在程序和函数的顶层， <strong>let</strong>与<strong>var</strong>不同，不会在全局对象上创建属性。 例如：

source: At the top level, <code>let</code>, unlike <code>var</code>, does not create a property on the global object:
es: En el nivel superior, <code>let</code> , a diferencia de <code>var</code> , no crea una propiedad en el objeto global:
ja: トップレベルで <code>let</code> 、 <code>var</code> とは異なり、 letはグローバルオブジェクトにプロパティを作成しません。
ko: 최상위 레벨에서 <code>let</code> 은 <code>var</code> 와 달리 전역 객체에 대한 속성을 만들지 않습니다.
ru: На верхнем уровне <code>let</code> , в отличие от <code>var</code> , не создает свойства глобального объекта:
zh_cn: 在顶层， <code>let</code> 与 <code>var</code> 不同，不会在全局对象上创建属性：

source: At the top level, variables declared using <code>let</code> don't create properties on the global object.
es: En el nivel superior, las variables declaradas con <code>let</code> no crean propiedades en el objeto global.
ja: トップレベルでは、 <code>let</code> を使用して宣言された変数は、グローバルオブジェクトにプロパティを作成しません。
ko: 최상위 수준을 사용하여 선언 된 변수는 전역 객체에 대한 속성을 만들지 않습니다.
ru: На верхнем уровне переменные, объявленные с помощью <code>let</code> , не создают свойств для глобального объекта.
zh_cn: 在顶层，使用 <code>let</code> 声明的变量不会在全局对象上创建属性。

source: Because <code>let</code> create a new lexical environment with those names for a) the initialiser expression b) each iteration (previosly to evaluating the increment expression), more details are <a href="https://stackoverflow.com/a/30900289/3011380">here</a>.
es: Debido a <code>let</code> creemos un nuevo entorno l&eacute;xico con esos nombres para a) la expresi&oacute;n inicializadora b) cada iteraci&oacute;n (antes de evaluar la expresi&oacute;n de incremento), hay m&aacute;s detalles <a href="https://stackoverflow.com/a/30900289/3011380">aqu&iacute;</a> .
ja: a）イニシャライザ式b）各反復（以前はインクリメント式を評価するため）の名前で新しい字句環境を作成するため、詳細は<a href="https://stackoverflow.com/a/30900289/3011380">ここにあります</a> 。
ko: a) 이니셜 라이저 표현식 b) 각 반복 (이전에는 증분 표현식을 평가하기위한)에 대한 이름으로 새 어휘 환경을 작성 <a href="https://stackoverflow.com/a/30900289/3011380">하십시오</a> . 자세한 내용은 여기에 있습니다 .
ru: Поскольку <code>let</code> создадим новую лексическую среду с этими именами для а) выражения инициализатора б) каждой итерации (прежде всего для вычисления выражения приращения), <a href="https://stackoverflow.com/a/30900289/3011380">здесь</a> есть больше подробностей.
zh_cn: 因为 <code>let</code> 用a）初始化程序表达式b）每次迭代（以前是对增量表达式求值）的名称创建一个新的词法环境，所以<a href="https://stackoverflow.com/a/30900289/3011380">这里有</a>更多详细信息。

source: Because of <a href="https://stackoverflow.com/q/33198849/3853934">the temporal dead zone</a>, variables declared using <code>let</code> can't be accessed before they are declared. Attempting to do so throws an error.
es: Debido a <a href="https://stackoverflow.com/q/33198849/3853934">la zona muerta temporal</a> , no se puede acceder a las variables declaradas usando <code>let</code> antes de que se declaren. Intentar hacerlo arroja un error.
ja: <a href="https://stackoverflow.com/q/33198849/3853934">一時的なデッドゾーン</a>があるため、 <code>let</code> を使用して宣言された変数は、宣言されるまでアクセスできません。 そうしようとすると、エラーがスローされます。
ko: <a href="https://stackoverflow.com/q/33198849/3853934">일시적인 데드 존</a> 때문에 <code>let</code> 을 사용하여 선언 된 변수는 선언하기 전에 액세스 할 수 없습니다. 그렇게하려고하면 오류가 발생합니다.
ru: Из-за <a href="https://stackoverflow.com/q/33198849/3853934">временной мертвой зоны</a> переменные, объявленные с использованием <code>let</code> , не могут быть доступны до их объявления. Попытка сделать это выдает ошибку.
zh_cn: 由于存在<a href="https://stackoverflow.com/q/33198849/3853934">临时死区</a> ，因此在声明之前无法访问使用 <code>let</code> 声明的变量。 尝试这样做会引发错误。

source: Block scope
es: Bloquear el alcance
ja: ブロックスコープ
ko: 블록 범위
ru: Блочный прицел
zh_cn: 块范围

source: Block scope of <code>let</code> is useful relates to closures and garbage collection to reclaim memory. Consider,
es: El alcance de bloque de <code>let</code> es &uacute;til en relaci&oacute;n con los cierres y la recolecci&oacute;n de basura para recuperar memoria. Considerar,
ja: <code>let</code> のブロックスコープは、メモリを再利用するためのクロージャーとガベージコレクションに関連しています。 考えて、
ko: <code>let</code> 의 블록 범위는 메모리를 회수하기위한 클로저 및 가비지 수집과 관련이 있습니다. 치다,
ru: Область действия блока <code>let</code> полезна, связана с замыканиями и сборкой мусора для освобождения памяти. Рассматривать,
zh_cn: <code>let</code> 的块范围与关闭和垃圾回收有关，可以回收内存。 考虑，

source: Code above demonstrates a classic JavaScript closure problem. Reference to the <code>i</code> variable is being stored in the click handler closure, rather than the actual value of <code>i</code>.
es: El c&oacute;digo anterior muestra un problema cl&aacute;sico de cierre de JavaScript. La referencia a la variable <code>i</code> se almacena en el cierre del controlador de clics, en lugar del valor real de <code>i</code> .
ja: 上記のコードは、古典的なJavaScriptクロージャの問題を示しています。 <code>i</code> 変数への参照は、 iの実際の値ではなく、クリックハンドラークロージャーに格納されています。
ko: 위 코드는 전형적인 JavaScript 클로저 문제를 보여줍니다. <code>i</code> 변수에 대한 참조는 실제 <code>i</code> 값이 아닌 클릭 핸들러 클로저에 저장됩니다.
ru: Код выше демонстрирует классическую проблему закрытия JavaScript. Ссылка на переменную <code>i</code> хранится в закрытии обработчика щелчка, а не на фактическое значение <code>i</code> .
zh_cn: 上面的代码演示了经典的JavaScript关闭问题。 对 <code>i</code> 变量的引用存储在单击处理程序闭包中，而不是 <code>i</code> 的实际值中。

source: Consequently, <code>let</code> variables are less likely to cause problems when used in large programs or when independently-developed frameworks are combined in new and unexpected ways.
es: En consecuencia, es menos probable <code>let</code> variables causen problemas cuando se usan en programas grandes o cuando los marcos desarrollados independientemente se combinan de formas nuevas e inesperadas.
ja: したがって、変数を大きなプログラムで使用したり、独自に開発したフレームワークを予期しない方法で組み合わせたりすると、問題が発生する可能性が低くなります。
ko: 따라서 큰 프로그램에서 사용하거나 독립적으로 개발 된 프레임 워크를 새롭고 예기치 않은 방식으로 결합 할 때 변수가 문제를 일으킬 가능성이 줄어 듭니다.
ru: Следовательно, <code>let</code> переменные с меньшей вероятностью будут вызывать проблемы при использовании в больших программах или когда независимо разработанные структуры объединяются новыми и неожиданными способами.
zh_cn: 因此，当在大型程序中使用或以新的出乎意料的方式组合独立开发的框架时， <code>let</code> 变量不太可能引起问题。

source: Creating global object property
es: Creación de la propiedad del objeto global
ja: グローバルオブジェクトプロパティの作成
ko: 전역 객체 속성 생성
ru: Создание глобального свойства объекта
zh_cn: 创建全局对象属性

source: Don't let this happen to you. Use a linter.
es: No dejes que esto te pase a ti.Usa un forro.
ja: こんなことにならないように リンターを使いましょう。
ko: 이런 일이 일어나지 않도록하십시오. 린터를 사용하십시오.
ru: Не позволяй этому случиться с тобой.Используй подкладку.
zh_cn: 不要让这种事发生在你身上。用打火机。

source: During the Creation Phase of an Execution Context, var, let and const will still store its variable in memory with an undefined value in the Variable Environment of the given Execution Context. The difference is in the Execution Phase. If you use reference a variable defined with var before it is assigned a value, it will just be undefined. No exception will be raised.
es: Durante la fase de creación de un contexto de ejecución,var,let y const seguirán almacenando su variable en la memoria con un valor indefinido en el entorno variable del contexto de ejecución dado.La diferencia está en la Fase de Ejecución.Si usas como referencia una variable definida con var antes de que se le asigne un valor,simplemente será indefinida.No se planteará ninguna excepción.
ja: 実行コンテキストの作成フェーズでは、var,let,const は、与えられた実行コンテキストの変数環境に未定義の値を持つ変数をメモリに格納したままになります。違いは実行フェーズにあります。var で定義された変数に値が代入される前に参照を使用した場合、その変数は未定義のままになります。例外は発生しません。
ko: 실행 컨텍스트의 생성 단계 동안 var, let 및 const는 주어진 실행 컨텍스트의 변수 환경에서 정의되지 않은 값으로 변수를 메모리에 저장합니다. 차이점은 실행 단계에 있습니다. var에 정의 된 변수에 값을 할당하기 전에 reference를 사용하면 정의되지 않습니다. 예외는 발생하지 않습니다.
ru: На этапе создания контекста выполнения var,let и const будет по-прежнему хранить свою переменную в памяти с неопределенным значением в переменной окружения данного контекста выполнения.Разница заключается в фазе выполнения.Если вы используете ссылку на переменную,определенную с помощью var до того,как ей присвоено значение,она будет просто неопределенной.Исключение не будет поднято.
zh_cn: 在Execution Context的创建阶段,var、let和const仍然会在给定的Execution Context的Variable Environment中以未定义的值在内存中存储其变量。区别在于执行阶段。如果你在给var定义的变量赋值之前使用引用,它将只是未定义。不会产生异常。

source: ECMAScript 6 introduced <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">the <code>let</code> statement</a>.
es: ECMAScript 6 introdujo <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">la declaraci&oacute;n <code>let</code> </a> .
ja: ECMAScript 6 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">は <code>let</code> ステートメントを</a>導入しました 。
ko: ECMAScript 6 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">은 <code>let</code> 문을</a> 도입 했습니다 .
ru: ECMAScript 6 представил <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">оператор <code>let</code> </a> .
zh_cn: ECMAScript 6引入<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let">了 <code>let</code> 语句</a> 。

source: ES6 also introduces the const keyword for declaring variables. const is also block scoped. The difference between let and const is that const variables need to be declared using an initializer, or it will generate an error.
es: ES6 también introduce la palabra clave const para declarar las variables.const también tiene un alcance de bloque.La diferencia entre let y const es que las variables const necesitan ser declaradas usando un inicializador,o se generará un error.
ja: ES6 では、変数を宣言するための const キーワードも導入されています。letとconstの違いは、const変数はイニシャライザを使って宣言する必要があり、そうしないとエラーが発生することです。
ko: 또한 ES6에는 변수 선언을위한 const 키워드가 도입되었습니다. const도 블록 범위입니다. let과 const의 차이점은 const 변수를 이니셜 라이저를 사용하여 선언해야한다는 점입니다. 그렇지 않으면 오류가 발생합니다.
ru: ES6 также вводит ключевое слово const для объявления переменных.const также является блоком scoped.Разница между allow и const заключается в том,что переменные const должны быть объявлены с помощью инициализатора,иначе это спровоцирует ошибку.
zh_cn: ES6还引入了const关键字来声明变量,const也是块范围化的。let和const的区别在于,const变量需要使用初始化器进行声明,否则会产生错误。

source: ES6 introduced two new keyword(<strong>let</strong> and <strong>const</strong>) alternate to <strong>var</strong>.
es: ES6 introdujo dos nuevas palabras clave ( <strong>let</strong> y <strong>const</strong> ) alternativas a <strong>var</strong> .
ja: ES6では、 <strong>varの</strong>代わりに2つの新しいキーワード（ <strong>let</strong>および<strong>const</strong> ）が導入されました。
ko: ES6는 <strong>var</strong> 대신 새로운 두 키워드 ( <strong>let</strong> 과 <strong>const</strong> )를 도입했습니다.
ru: ES6 представил два новых ключевых слова ( <strong>let</strong> и <strong>const</strong> ), альтернативных <strong>var</strong> .
zh_cn: ES6引入了两个新的关键字（ <strong>let</strong>和<strong>const</strong> ）替代<strong>var</strong> 。

source: Every single click handler will refer to the same object because there&rsquo;s only one counter object which holds 6 so you get six on each click.
es: Cada controlador de un solo clic se referir&aacute; al mismo objeto porque solo hay un objeto de contador que contiene 6, por lo que obtienes seis en cada clic.
ja: 6を保持するカウンターオブジェクトが1つしかないため、各クリックハンドラーは同じオブジェクトを参照するため、各クリックで6になります。
ko: 모든 단일 클릭 핸들러는 6을 보유하는 카운터 오브젝트가 하나만 있으므로 각 클릭마다 6 개를 가져 오기 때문에 동일한 오브젝트를 참조합니다.
ru: Каждый обработчик одного клика будет ссылаться на один и тот же объект, потому что есть только один встречный объект, который содержит 6, поэтому вы получаете шесть на каждый клик.
zh_cn: 每个单击处理程序都将引用相同的对象，因为只有一个计数器对象包含6个，因此每次单击将获得6个。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: For an up-to-date overview of which browsers support the <code>let</code> statement at the time of your reading this answer, see <a href="http://caniuse.com/#search=let"><strong>this <code>Can I Use</code> page</strong></a>.
es: Para obtener una descripci&oacute;n actualizada de los navegadores que admiten la declaraci&oacute;n <code>let</code> al momento de leer esta respuesta, consulte <a href="http://caniuse.com/#search=let"><strong>esta p&aacute;gina <code>Can I Use</code> </strong></a> ?
ja: この回答を読んだ時点で、どのブラウザが <code>let</code> ステートメントをサポートしているかについての最新の概要については、 <a href="http://caniuse.com/#search=let"><strong>この <code>Can I Use</code> ページを参照してください</strong></a> 。
ko: 이 답변을 읽을 당시의 <code>let</code> 문을 지원하는 브라우저에 대한 최신 개요는 <a href="http://caniuse.com/#search=let"><strong>이 <code>Can I Use</code> 페이지를 참조하십시오</strong></a> .
ru: Актуальный обзор того, какие браузеры поддерживают оператор <code>let</code> на момент прочтения этого ответа, см. <a href="http://caniuse.com/#search=let"><strong> <code>Can I Use</code> странице &laquo; Могу ли я использовать&raquo;</strong></a> .
zh_cn: 有关在阅读此答案时哪些浏览器支持 <code>let</code> 语句的最新概述，请参见<a href="http://caniuse.com/#search=let"><strong> <code>Can I Use</code> 页面</strong></a> 。

source: Function VS block scope:
es: Función VS bloquear el alcance:
ja: 関数VSブロックスコープ。
ko: 기능 VS 블록 범위 :
ru: Функция VS блок область действия:
zh_cn: 函数VS块范围。

source: Getter and setter with <code>let</code>:
es: Getter y setter con <code>let</code> :
ja: <code>let</code> を使用したゲッターとセッター：
ko: <code>let</code> : getter 및 setter :
ru: Метод получения и установки с помощью <code>let</code> :
zh_cn: 用 <code>let</code> 的 getter和setter：

source: Global <code>let</code> doesn't get attached to <code>window</code>:
es: Let global no se adjunta a la <code>window</code> :
ja: グローバル <code>let</code> は <code>window</code> にアタッチされません：
ko: 전역 <code>let</code> 이 <code>window</code> 연결되지 않습니다.
ru: Глобальный <code>let</code> не привязывается к <code>window</code> :
zh_cn: 全局 <code>let</code> 不会附加到 <code>window</code> ：

source: Global <code>let</code> variables are not added to the global <code>window</code> object.
es: Las variables globales <code>let</code> no se agregan al objeto de <code>window</code> global.
ja: グローバル <code>let</code> 変数はグローバル <code>window</code> オブジェクトに追加されません。
ko: 전역 <code>let</code> 변수는 전역 <code>window</code> 객체에 추가되지 않습니다.
ru: Глобальные переменные <code>let</code> не добавляются в объект глобального <code>window</code> .
zh_cn: 全局 <code>let</code> 变量不会添加到全局 <code>window</code> 对象。

source: Here is an example for the difference between the two (support just started for chrome):
es: Aquí hay un ejemplo de la diferencia entre ambos (el soporte acaba de empezar para el cromo):
ja: ここでは、両者の違いを例に挙げてみます(クロームではサポートが始まったばかりです)。
ko: 다음은이 둘의 차이점에 대한 예입니다 (Chrome에 대한 지원 시작).
ru: Вот пример разницы между ними (поддержка только что запущена для хрома):
zh_cn: 下面是一个例子来说明两者之间的区别(刚刚开始支持chrome)。

source: Here's an <a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">explanation of the <code>let</code> keyword</a> with some examples.
es: Aqu&iacute; hay una <a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">explicaci&oacute;n de la palabra clave <code>let</code> </a> con algunos ejemplos.
ja: 以下に、いくつかの例を示し<a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">た <code>let</code> キーワードの説明を</a>示します。
ko: 다음 <a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">은 <code>let</code> 키워드</a> 에 대한 예입니다.
ru: Вот <a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">объяснение ключевого слова <code>let</code> </a> с некоторыми примерами.
zh_cn: 下面是一些示例<a href="https://developer.mozilla.org/en/New_in_JavaScript_1.7#Block_scope_with_let">的 <code>let</code> 关键字</a>说明。

source: Here's an example to add on to what others have already written. Suppose you want to make an array of functions, <code>adderFunctions</code>, where each function takes a single Number argument and returns the sum of the argument and the function's index in the array. Trying to generate <code>adderFunctions</code> with a loop using the <code>var</code> keyword won't work the way someone might na&iuml;vely expect:
es: Aqu&iacute; hay un ejemplo para agregar a lo que otros ya han escrito. Suponga que desea hacer una matriz de funciones, <code>adderFunctions</code> , donde cada funci&oacute;n toma un solo argumento de N&uacute;mero y devuelve la suma del argumento y el &iacute;ndice de la funci&oacute;n en la matriz. Intentar generar <code>adderFunctions</code> con un bucle usando la palabra clave <code>var</code> no funcionar&aacute; de la manera que alguien podr&iacute;a esperar ingenuamente:
ja: これは、他の人がすでに書いたものに追加する例です。 関数の配列 <code>adderFunctions</code> を作成するとします。各関数は1つのNumber引数を取り、引数と関数のインデックスの配列の合計を返します。 <code>var</code> キーワードを使用してループで <code>adderFunctions</code> を生成しようとしても、誰かが単純に期待するようには機能しません。
ko: 다음은 다른 사람들이 이미 작성한 내용을 추가하는 예입니다. <code>adderFunctions</code> 함수의 배열을 만들고 싶다고 가정합니다. 여기서 각 함수는 단일 숫자 인수를 사용하고 인수와 함수의 색인의 합계를 배열로 리턴합니다. <code>var</code> 키워드를 사용하여 루프로 <code>adderFunctions</code> 을 생성하려고하면 누군가가 순진하게 기대하는 방식으로 작동하지 않습니다.
ru: Вот пример, чтобы добавить к тому, что уже написали другие. Предположим, вы хотите создать массив функций <code>adderFunctions</code> , где каждая функция принимает один аргумент Number и возвращает сумму аргумента и индекс функции в массиве. Попытка сгенерировать <code>adderFunctions</code> с помощью цикла с использованием ключевого слова <code>var</code> не будет работать так, как кто-то может наивно ожидать:
zh_cn: 这是一个示例，可以补充其他人已经写的内容。 假设您要创建一个函数数组 <code>adderFunctions</code> ，其中每个函数都使用一个Number参数，并返回参数和该函数在数组中的索引的和。 尝试使用 <code>var</code> 关键字通过循环生成 <code>adderFunctions</code> 不能像某些人天真的期望的那样起作用：

source: Here, we can see that our variable <code>j</code> is only known in the first for loop, but not before and after. Yet, our variable <code>i</code> is known in the entire function.
es: Aqu&iacute;, podemos ver que nuestra variable <code>j</code> solo se conoce en el primer bucle for, pero no antes y despu&eacute;s. Sin embargo, nuestra variable <code>i</code> es conocida en toda la funci&oacute;n.
ja: ここで、変数 <code>j</code> は最初のforループでのみ認識され、前後では認識されないことがわかります。 しかし、変数 <code>i</code> は関数全体で知られています。
ko: 여기서 변수 <code>j</code> 는 첫 번째 for 루프에서만 알려져 있지만 이전과 이후는 알 수 없습니다. 그러나 변수 <code>i</code> 는 전체 기능으로 알려져 있습니다.
ru: Здесь мы видим, что наша переменная <code>j</code> известна только в первом цикле for, но не до и после. Тем не менее, наша переменная <code>i</code> известна во всей функции.
zh_cn: 在这里，我们可以看到我们的变量 <code>j</code> 仅在第一个for循环中已知，而在之前和之后都不知道。 但是，我们的变量 <code>i</code> 在整个函数中是已知的。

source: Hoisting is not supported using <code>let</code>.
es: La elevaci&oacute;n no es compatible con <code>let</code> .
ja: 巻き上げは <code>let</code> を使用してサポートされていません。
ko: <code>let</code> 을 사용하여 게양이 지원되지 않습니다.
ru: Подъем не поддерживается с помощью <code>let</code> .
zh_cn: 使用 <code>let</code> 不支持吊装。

source: How to keep track of browser support
es: Cómo hacer un seguimiento del soporte de los navegadores
ja: ブラウザの対応状況を把握する方法
ko: 브라우저 지원을 추적하는 방법
ru: Как отслеживать поддержку браузера
zh_cn: 如何跟踪浏览器的支持情况

source: However it's worth noting that <code>let</code> is only a part of newer Javascript implementations and has varying degrees of <a href="http://caniuse.com/#search=let">browser support</a>.
es: Sin embargo, vale la pena se&ntilde;alar que <code>let</code> es solo una parte de las nuevas implementaciones de Javascript y tiene diferentes grados de <a href="http://caniuse.com/#search=let">compatibilidad con el navegador</a> .
ja: ただし、 <code>let</code> は新しいJavascript実装の一部にすぎず、 <a href="http://caniuse.com/#search=let">ブラウザのサポートの</a>度合いがさまざまであることは注目に値します。
ko: 그러나 <code>let</code> 은 최신 Javascript 구현의 일부일 뿐이며 다양한 <a href="http://caniuse.com/#search=let">브라우저 지원</a> 수준을 가지고 있습니다.
ru: Однако стоит отметить, что <code>let</code> является лишь частью более новых реализаций Javascript и имеет различную степень <a href="http://caniuse.com/#search=let">поддержки браузера</a> .
zh_cn: 但是，值得注意的是， <code>let</code> 只是较新的Javascript实现的一部分，并且具有不同程度的<a href="http://caniuse.com/#search=let">浏览器支持</a> 。

source: However, replace <code>var</code> with <code>let</code>
es: Sin embargo, reemplace <code>var</code> con <code>let</code>
ja: ただし、 <code>var</code> を <code>let</code> に置き換えます
ko: 그러나 <code>var</code> 를 <code>let</code> 으로 바꾸 십시오.
ru: Однако замените <code>var</code> на <code>let</code>
zh_cn: 但是，用 <code>let</code> 替换 <code>var</code>

source: However, the block scope can make this huge data structure to garbage collected.
es: Sin embargo,el alcance del bloque puede convertir esta enorme estructura de datos en basura recolectada.
ja: しかし、ブロックスコープは、この巨大なデータ構造をガベージコレクションにすることができます。
ko: 그러나 블록 범위는이 거대한 데이터 구조를 가비지 수집으로 만들 수 있습니다.
ru: Однако блок-объект может превратить эту огромную структуру данных в мусор.
zh_cn: 但是,块的范围可以让这个庞大的数据结构变成垃圾收集。

source: However, we can try again using the <code>let</code> keyword:
es: Sin embargo, podemos intentarlo nuevamente usando la palabra clave <code>let</code> :
ja: ただし、 <code>let</code> キーワードを使用して再試行できます。
ko: 그러나 <code>let</code> 키워드를 사용하여 다시 시도 할 수 있습니다.
ru: Однако мы можем повторить попытку, используя ключевое слово <code>let</code> :
zh_cn: 但是，我们可以使用 <code>let</code> 关键字再试一次：
