Repository: rueisnom/feedback
Catalog: xlf/70/57/9/70579.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The attribute, if specified, must have a value that is a set of space-separated tokens representing the various classes that the element belongs to.
es: El atributo,si se especifica,debe tener un valor que sea un conjunto de fichas separadas por el espacio que representen las diversas clases a las que pertenece el elemento.
ja: 属性が指定されている場合,その属性は,要素が属する様々なクラスを表すスペースで区切られたトークンの集合である値を持たなければならない。
ko: 지정된 경우 속성에는 요소가 속하는 다양한 클래스를 나타내는 공백으로 구분 된 토큰 세트 값이 있어야합니다.
ru: Атрибут,если он указан,должен иметь значение,которое представляет собой набор разделенных пробелами лексем,представляющих различные классы,к которым принадлежит элемент.
zh_cn: 如果指定的属性,其值必须是一组由空格分隔的令牌组成,代表该元素所属的不同类别。

source: The classes that an HTML element has assigned to it consists of all the classes returned when the value of the class attribute is split on spaces. (Duplicates are ignored.)
es: Las clases que un elemento HTML le ha asignado están compuestas por todas las clases devueltas cuando el valor del atributo de la clase se divide en espacios.(Los duplicados se ignoran).
ja: HTML要素に割り当てられたクラスは、class属性の値がスペースで分割されたときに返されるすべてのクラスで構成される。(重複は無視されます)。
ko: HTML 요소가 할당 한 클래스는 class 속성 값이 공백으로 분할 될 때 반환 된 모든 클래스로 구성됩니다. 중복은 무시됩니다.
ru: Классы,назначенные HTML-элементу,состоят из всех классов,возвращаемых при разбиении значения атрибута класса на пробелы.(Дубликаты игнорируются).
zh_cn: 一个HTML元素分配给它的类包括当类属性的值被分割成空格时返回的所有类。(重复的类会被忽略)。

source: The id attribute is case sensitive in <a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML</a>.
es: El atributo id es sensible a may&uacute;sculas y min&uacute;sculas en <a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML</a> .
ja: <a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML</a>ではid属性は大文字と小文字を区別します 。
ko: id 속성은 <a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML</a> 에서 대소 문자를 구분합니다.
ru: Атрибут id чувствителен к регистру в <a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML</a> .
zh_cn: 在<a href="https://www.w3.org/TR/xhtml1/diffs.html#h-4.2">XHTML中</a> ，id属性区分大小写。

source: The rest of the identifier can contain $, _, U+200C zero width non-joiner, U+200D zero width joiner, or any symbol with the Unicode derived core property ID_Continue.
es: El resto del identificador puede contener $,_,U+200C zero width non-joiner,U+200D zero width joiner,o cualquier símbolo con la propiedad central derivada de Unicode ID_Continue.
ja: 識別子の残りの部分には、$、_、U+200C ゼロ幅の非ジョイナー、U+200D ゼロ幅のジョイナー、または Unicode 派生コアプロパティ ID_Continue を持つ任意のシンボルを含めることができます。
ko: 식별자의 나머지 부분에는 $, _, U + 200C 제로 너비 비조 인자, U + 200D 제로 너비 조이너 또는 유니 코드 파생 핵심 속성 ID_Continue가있는 기호가 포함될 수 있습니다.
ru: Остальной идентификатор может содержать $,_,U+200C нулевой ширины,U+200D нулевой ширины соединителя,или любой символ с Unicode производным основным свойством ID_Continue.
zh_cn: 其余的标识符可以包含$、_、U+200C零宽度非连接符、U+200D零宽度连接符、U+200D零宽度连接符或任何具有Unicode派生核心属性ID_Continue的符号。

source: The rules about ID content in HTML5 are (apart from being unique):
es: Las reglas sobre el contenido de identificación en HTML5 son (aparte de ser únicas):
ja: HTML5におけるIDコンテンツに関するルールは(ユニークであることとは別に)。
ko: HTML5의 ID 내용에 대한 규칙은 다음과 같습니다 (고유 한 것 제외).
ru: Правила о содержимом идентификаторов в HTML5 (кроме того,что они уникальны):
zh_cn: HTML5中关于ID内容的规则是(除了唯一性之外)。

source: The value must be unique amongst all the IDs in the element&rsquo;s home subtree and must contain at least one character. The value must not contain any space characters.
es: El valor debe ser &uacute;nico entre todos los ID en el sub&aacute;rbol de inicio del elemento y debe contener al menos un car&aacute;cter. El valor no debe contener caracteres de espacio.
ja: 値は、要素のホームサブツリー内のすべてのIDの中で一意である必要があり、少なくとも1つの文字を含んでいる必要があります。 値にスペース文字を含めることはできません。
ko: 값은 요소의 홈 서브 트리에있는 모든 ID 중에서 고유해야하며 하나 이상의 문자를 포함해야합니다. 값은 공백 문자를 포함하지 않아야합니다.
ru: Значение должно быть уникальным среди всех идентификаторов в домашнем поддереве элемента и должно содержать хотя бы один символ. Значение не должно содержать пробелов.
zh_cn: 该值在元素的主子树中的所有ID中必须是唯一的，并且必须包含至少一个字符。 该值不得包含任何空格字符。

source: The value must be unique amongst all the IDs in the element's home subtree and must contain at least one character. The value must not contain any space characters.
es: El valor debe ser único entre todas las identificaciones en el subárbol de origen del elemento y debe contener al menos un carácter.El valor no debe contener ningún espacio.
ja: この値は、要素のホームサブツリーにあるすべてのIDの中で一意でなければならず、少なくとも1文字を含んでいなければなりません。この値にはスペース文字を含んではいけません。
ko: 값은 요소의 홈 서브 트리에있는 모든 ID 중에서 고유해야하며 하나 이상의 문자를 포함해야합니다. 값은 공백 문자를 포함하지 않아야합니다.
ru: Значение должно быть уникальным среди всех идентификаторов в домашнем поддереве элемента и содержать,по крайней мере,один символ.Значение не должно содержать пробелов.
zh_cn: 该值必须在元素的主子树中的所有ID中是唯一的,并且必须至少包含一个字符。该值必须不包含任何空格字符。

source: There are no additional restrictions on the tokens authors can use in the class attribute, but authors are encouraged to use values that describe the nature of the content, rather than values that describe the desired presentation of the content.
es: No hay restricciones adicionales sobre las fichas que los autores pueden utilizar en el atributo de clase,pero se alienta a los autores a que utilicen valores que describan la naturaleza del contenido,en lugar de valores que describan la presentación deseada del contenido.
ja: class属性で作者が使用できるトークンには追加の制限はありませんが、作者は、コンテンツの望ましい表現を記述する値ではなく、コンテンツの性質を記述する値を使用することが推奨されます。
ko: 작성자가 클래스 속성에서 사용할 수있는 토큰에 대한 추가 제한은 없지만 저자는 원하는 컨텐츠 표현을 설명하는 값보다는 컨텐츠의 특성을 설명하는 값을 사용하도록 권장됩니다.
ru: Дополнительных ограничений на токены,которые авторы могут использовать в атрибуте класса,нет,но авторам предлагается использовать значения,описывающие природу контента,а не значения,описывающие желаемое представление контента.
zh_cn: 对作者可以在类属性中使用的令牌没有额外的限制,但鼓励作者使用描述内容的性质的值,而不是描述内容所需表现形式的值。

source: There must not be multiple elements in a document that have the same id value.
es: No debe haber múltiples elementos en un documento que tengan el mismo valor de identificación.
ja: 文書内には、同じid値を持つ複数の要素があってはなりません。
ko: 문서에 동일한 id 값을 갖는 여러 요소가 없어야합니다.
ru: В документе не должно быть нескольких элементов,имеющих одно и то же значение id.
zh_cn: 一个文档中不能有多个元素具有相同的id值。

source: This is the <strong>W3</strong> spec about ID (fr&aring;n MDN):
es: Esta es la especificaci&oacute;n <strong>W3</strong> sobre ID (de MDN):
ja: これはIDに関する<strong>W3</strong>仕様です（MDNから）。
ko: 이것은 ID에 관한 <strong>W3</strong> 사양입니다 (fr&aring;n MDN).
ru: Это спецификация <strong>W3</strong> об ID (от MDN):
zh_cn: 这是有关ID（frnn MDN）的<strong>W3</strong>规范：

source: This opens the door for valid use cases such as using accented characters. It also gives us plenty of more ammo to shoot ourselves in the foot with, since you can now use id values that will cause problems with both CSS and JavaScript unless you&rsquo;re really careful.
es: Esto abre la puerta a casos de uso v&aacute;lidos, como el uso de caracteres acentuados. Tambi&eacute;n nos da mucha m&aacute;s munici&oacute;n para dispararnos en el pie, ya que ahora puede usar valores de identificaci&oacute;n que causar&aacute;n problemas con CSS y JavaScript a menos que sea realmente cuidadoso.
ja: これは、アクセント付き文字の使用などの有効な使用例への扉を開きます。 また、本当に注意しない限り、CSSとJavaScriptの両方で問題を引き起こすid値を使用できるようになったので、足元を撃つための弾薬がたくさんあります。
ko: 악센트 문자 사용과 같은 유효한 사용 사례를위한 문이 열립니다. 또한 실제로주의를 기울이지 않으면 CSS와 JavaScript 모두에 문제를 일으킬 수있는 id 값을 사용할 수 있기 때문에 많은 양의 탄약을 얻을 수 있습니다.
ru: Это открывает двери для допустимых вариантов использования, таких как использование акцентированных символов. Это также дает нам еще больше боеприпасов, с которыми вы можете стрелять себе в ногу, поскольку теперь вы можете использовать значения идентификаторов, которые вызовут проблемы как с CSS, так и с JavaScript, если вы действительно не будете осторожны.
zh_cn: 这为诸如用重音符号的有效用例打开了大门。 这也给我们带来了更多弹药，因为您现在可以使用id值，除非您非常小心，否则它将导致CSS和JavaScript出现问题。

source: To reference an id with a period in it you need to use a backslash. Not sure if its the same for hyphens or underscores. For example: HTML
es: Para hacer referencia a una identificación con un punto en ella necesitas usar una barra invertida.No estoy seguro de que sea lo mismo para los guiones o los subrayados.Por ejemplo:HTML
ja: ピリオドを含むidを参照するにはバックスラッシュを使う必要があります。ハイフンやアンダースコアも同じかどうかはわかりません。例えば HTML
ko: 마침표가있는 ID를 참조하려면 백 슬래시를 사용해야합니다. 하이픈이나 밑줄이 같은지 확실하지 않습니다. 예를 들어 : HTML
ru: Для ссылки на идентификатор с периодом в нем необходимо использовать обратный слеш.Не уверен,будет ли он одинаковым для дефисов или символов подчеркивания.Например:HTML
zh_cn: 要引用带句号的id,你需要使用反斜线。不知道连字符和下划线是否一样。比如说 HTML

source: U+0009 CHARACTER TABULATION (tab)
es: TABLA DE CARACTERES U+0009 (tab)
ja: U+0009 キャラクタ集計(タブ)
ko: U + 0009 문자 탭 (탭)
ru: U+0009 ТАБУЛЯЦИЯ ХАРАКТЕРА (табл.)
zh_cn: U+0009字符表(标签)

source: U+000A LINE FEED (LF)
es: ALIMENTACIÓN DE LÍNEA U+000A (LF)
ja: U+000Aラインフィード(LF)
ko: U + 000A 라인 피드 (LF)
ru: U+000A ЛИНЕЙНАЯ ПОДАЧА (ЛФ)
zh_cn: u+000a 线路进给 (LF)

source: U+000C FORM FEED (FF)
es: ALIMENTACIÓN EN FORMA DE U+000C (FF)
ja: u+000c フォームフィード(FF)
ko: U + 000C 양식 공급 (FF)
ru: U+000C ФОРМА КОРМА (FF)
zh_cn: u+000c表格进料(FF)

source: U+000D CARRIAGE RETURN (CR)
es: U+000D RETORNO DE CARRO (CR)
ja: u+000d キャリッジリターン(cr)
ko: U + 000D 캐리지 리턴 (CR)
ru: U+000D ВОЗВРАТ КАРЕТКИ (CR)
zh_cn: u+000d 回车 (cr)

source: U+0020 SPACE
ja: U+0020 スペース
ko: U + 0020 공간
ru: ПРОСТРАНСТВО U+0020

source: Using characters except <code>ASCII letters and digits, '_', '-' and '.'</code> may cause compatibility problems, as they weren't allowed in <code>HTML 4</code>. Though this restriction has been lifted in <code>HTML 5</code>, an ID should start with a letter for compatibility.
es: Usando caracteres excepto <code>ASCII letters and digits, '_', '-' and '.'</code> puede causar problemas de compatibilidad, ya que no estaban permitidos en <code>HTML 4</code> . Aunque esta restricci&oacute;n se ha eliminado en <code>HTML 5</code> , una identificaci&oacute;n debe comenzar con una letra por compatibilidad.
ja: <code>ASCII letters and digits, '_', '-' and '.'</code> 以外の文字を使用する <code>HTML 4</code> では許可されていなかったため、互換性の問題が発生する可能性があります 。 この制限は <code>HTML 5</code> で解除されましたが、互換性のためにIDは文字で始める必要があります。
ko: <code>ASCII letters and digits, '_', '-' and '.'</code> 제외한 문자 사용 <code>HTML 4</code> 에서 허용되지 않았기 때문에 호환성 문제가 발생할 수 있습니다. <code>HTML 5</code> 에서는이 제한이 해제되었지만 ID는 호환성을 위해 문자로 시작해야합니다.
ru: Использование символов, кроме <code>ASCII letters and digits, '_', '-' and '.'</code> может вызвать проблемы совместимости, так как они не были разрешены в <code>HTML 4</code> . Хотя это ограничение было снято в <code>HTML 5</code> , идентификатор должен начинаться с буквы для совместимости.
zh_cn: 使用除 <code>ASCII letters and digits, '_', '-' and '.'</code> 之外的其他字符，&ldquo; _&rdquo;，&ldquo;-&rdquo;和&ldquo;。&rdquo;。 可能会导致兼容性问题，因为 <code>HTML 4</code> 不允许这样做。 尽管在 <code>HTML 5</code> 中已经取消了此限制，但是出于兼容性考虑，ID应该以字母开头。

source: What are valid values for the id attribute in HTML
es: ¿Cuáles son los valores válidos para el atributo id en HTML?
ja: HTML の id 属性に有効な値は何ですか?
ko: HTML에서 id 속성에 유효한 값은 무엇입니까
ru: Каковы допустимые значения для атрибута id в HTML
zh_cn: HTML中的id属性的有效值是什么?

source: When creating the <code>id</code> attributes for HTML elements, what rules are there for the value?
es: Al crear los atributos de <code>id</code> entificaci&oacute;n para elementos HTML, &iquest;qu&eacute; reglas hay para el valor?
ja: HTML要素の <code>id</code> 属性を作成するとき、値にはどのような規則がありますか？
ko: HTML 요소에 대한 <code>id</code> 속성을 만들 때 값에 어떤 규칙이 있습니까?
ru: При создании атрибутов <code>id</code> для элементов HTML, какие правила существуют для значения?
zh_cn: 为HTML元素创建 <code>id</code> 属性时，该值有哪些规则？

source: Which is really saying, "the element with an id of 'my', a class of 'cool' and the 'thing' pseudo-selector" in CSS-speak.
es: Lo que en realidad es decir,"el elemento con una identificación de 'mi',una clase de 'cool' y la 'cosa' pseudo-selector" en el lenguaje CSS.
ja: これは、CSSで言うところの「'my'というidと'cool'というclassと'that'という擬似セレクタを持つ要素」ということになります。
ko: CSS-speak에서 "id가 ​​'my'인 클래스, 'cool'클래스 및 'thing'pseudo-selector '라는 요소입니다.
ru: Что на самом деле означает "элемент с id 'мой',класс 'круто' и 'вещь' псевдо-селектор' в CSS-языке.
zh_cn: 这真的是说,"这个元素的id为'my',类为'cool'的元素和'thing'的伪选择器",用CSS口语来说,就是 "这个元素的id为'my',类为'cool',类为'thing'的伪选择器"。

source: Working with colons and periods needs a bit more work but you can do it as the following example shows.
es: El trabajo con los cólones y los períodos requiere un poco más de trabajo,pero se puede hacer como se muestra en el siguiente ejemplo.
ja: コロンとピリオドを使った作業はもう少し大変ですが、次の例に示すようにできます。
ko: 콜론과 마침표로 작업하려면 약간 더 많은 작업이 필요하지만 다음 예제와 같이 수행 할 수 있습니다.
ru: Работа с двоеточиями и периодами требует немного больше работы,но вы можете сделать это,как показывает следующий пример.
zh_cn: 处理冒号和句号需要多做一些工作,但你可以做到,如下例所示。

source: You can simplify your development tasks by strictly sticking to a naming convention. For example, if you limit yourself entirely to lower-case characters and always separate words with either hyphens or underscores (but not both, pick one and never use the other), then you have an easy-to-remember pattern. You will never wonder "was it <code>firstName</code> or <code>FirstName</code>?" because you will always know that you should type <code>first_name</code>. Prefer camel case? Then limit yourself to that, no hyphens or underscores, and always, consistently use either upper-case or lower-case for the first character, don't mix them.
es: Puede simplificar sus tareas de desarrollo siguiendo estrictamente una convenci&oacute;n de nomenclatura. Por ejemplo, si se limita completamente a caracteres en min&uacute;sculas y siempre separa las palabras con guiones o guiones bajos (pero no con ambos, elija uno y nunca use el otro), entonces tiene un patr&oacute;n f&aacute;cil de recordar. Nunca se preguntar&aacute; "&iquest;fue <code>FirstName</code> o FirstName ?" porque siempre sabr&aacute;s que debes escribir <code>first_name</code> . &iquest;Prefieres el caso del camello? Luego, lim&iacute;tese a eso, sin guiones ni guiones bajos, y siempre, use consistentemente may&uacute;sculas o min&uacute;sculas para el primer car&aacute;cter, no las mezcle.
ja: 命名規則に厳密に従うことにより、開発タスクを簡略化できます。 たとえば、完全に小文字に制限し、常に単語をハイフンまたはアンダースコアで区切る場合（両方ではなく、一方を選択し、もう一方を使用しないこと）、覚えやすいパターンになります。 「 <code>firstName</code> または <code>FirstName</code> でしたか？」 これは、 <code>first_name</code> と入力する必要があることを常に知っているためです。 キャメルケースが好きですか？ 次に、ハイフンやアンダースコアを使用しないでください。常に、最初の文字に大文字または小文字を常に使用し、混在させないでください。
ko: 명명 규칙을 엄격하게 준수하여 개발 작업을 단순화 할 수 있습니다. 예를 들어, 자신을 소문자로 제한하고 항상 하이픈이나 밑줄로 단어를 구분하면 (두 가지가 아닌 하나를 선택하고 다른 단어는 사용하지 마십시오) 기억하기 쉬운 패턴이 있습니다. " <code>firstName</code> 또는 <code>FirstName</code> 이었습니까?" 항상 <code>first_name</code> 을 입력해야한다는 것을 알기 때문입니다. 낙타를 선호하십니까? 그런 다음 하이픈이나 밑줄을 사용하지 말고 항상 첫 문자에 대문자 나 소문자를 사용하십시오. 혼합하지 마십시오.
ru: Вы можете упростить задачи разработки, строго придерживаясь соглашения об именах. Например, если вы полностью ограничиваетесь символами нижнего регистра и всегда разделяете слова либо дефисами, либо подчеркиванием (но не обоими, выбираете одно и никогда не используете другое), тогда у вас есть легко запоминающийся шаблон. Вы никогда не задаетесь вопросом "было ли это <code>firstName</code> или <code>FirstName</code> ?" потому что вы всегда будете знать, что вы должны ввести <code>first_name</code> . Предпочитаете случай с верблюдом? Затем ограничьте себя этим, без дефисов и подчеркиваний, и всегда, последовательно используйте прописные или строчные буквы для первого символа, не смешивайте их.
zh_cn: 您可以严格遵守命名约定来简化开发任务。 例如，如果您将自己完全限制为小写字母，并且始终用连字符或下划线将单词分开（但不能同时使用连字符或下划线），那么您将拥有一个易于记忆的模式。 您将永远不会怀疑&ldquo;是 <code>firstName</code> 还是 <code>FirstName</code> ？&rdquo; 因为您将永远知道应该键入 <code>first_name</code> 。 喜欢骆驼案吗？ 然后限制自己，不要使用连字符或下划线，并且始终对第一个字符使用大写或小写，请勿混用。

source: You can technically use colons and periods in id/name attributes, but I would strongly suggest avoiding both.
es: Técnicamente se pueden usar colones y puntos en los atributos de los nombres de identificación,pero yo sugeriría encarecidamente que se eviten ambos.
ja: 技術的にはidname属性でコロンとピリオドを使用することができますが、両方を使用しないことを強くお勧めします。
ko: 기술적으로 id / name 속성에 콜론과 마침표를 사용할 수 있지만 둘 다 피하는 것이 좋습니다.
ru: Технически вы можете использовать двоеточия и точки в атрибутах idname,но я настоятельно рекомендую избегать и того,и другого.
zh_cn: 在技术上,你可以在idname属性中使用冒号和句号,但我强烈建议避免这两个属性。

source: You may have many ID's, but all must have a unique value.
es: Puede que tengas muchas identificaciones,pero todas deben tener un valor único.
ja: 多くのIDを持っているかもしれませんが、すべてのIDは一意の値を持っていなければなりません。
ko: ID가 많을 수 있지만 모두 고유 한 값을 가져야합니다.
ru: У вас может быть много удостоверений личности,но все они должны иметь уникальную ценность.
zh_cn: 你可能有很多ID,但都必须有一个独特的价值。

source: alphabets-&gt; caps &amp; small
es: alfabetos-&gt; may&uacute;sculas y peque&ntilde;os
ja: アルファベット-&gt;大文字と小文字
ko: 알파벳-&gt; 모자 및 작은
ru: алфавиты-&gt; колпачки и маленькие
zh_cn: 字母-&gt;大写和小

source: but avoid using of <code># : . * !</code> symbols
es: pero evite usar <code># : . * !</code> *! s&iacute;mbolos
ja: ただし、 <code># : . * !</code> 使用は避けてください。 *！ シンボル
ko: 그러나 <code># : . * !</code> 사용하지 마십시오 . *! 기호
ru: но избегайте использования <code># : . * !</code> *! символы
zh_cn: 但是避免使用 <code># : . * !</code> *！ 符号

source: but one should avoid <code>:</code> and <code>.</code> beacause:
es: pero uno debe evitar <code>:</code> y <code>.</code> porque:
ja: しかし、1つは避けてください <code>:</code> および 理由：
ko: 그러나 피해야합니다 <code>:</code> 및 <code>.</code> beacause :
ru: но следует избегать <code>:</code> и <code>.</code> обусловлено:
zh_cn: 但应该避免 <code>:</code> <code>.</code> 因为：

source: case sensitive
es: caso sensible
ja: 大文字小文字を区別する
ko: 대소 문자 구분
ru: зависящий от конкретных условий
zh_cn: 大小写

source: digits-&gt; 0-9
es: d&iacute;gitos-&gt; 0-9
ja: 数字-&gt; 0-9
ko: 숫자-&gt; 0-9
ru: цифры-&gt; 0-9
zh_cn: 数字-&gt; 0-9

source: for <code>HTML5</code>
es: para <code>HTML5</code>
ja: <code>HTML5</code> の場合
ko: <code>HTML5</code> 용
ru: для <code>HTML5</code>
zh_cn: 用于 <code>HTML5</code>

source: gets rid of the additional restrictions on the id attribute <a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">see here</a>. The only requirements left (apart from being unique in the document) are:
es: se deshace de las restricciones adicionales en el atributo id, <a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">ver aqu&iacute;</a> . Los &uacute;nicos requisitos restantes (adem&aacute;s de ser &uacute;nicos en el documento) son:
ja: id属性に対する追加の制限を取り除き<a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">ます</a> 。 ここを参照してください 。 残された唯一の要件（ドキュメント内で一意であることを除いて）は次のとおりです。
ko: id 속성에 대한 추가 제한을 제거 <a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">하려면 here을 참조하십시오</a> . 문서에서 고유하지 않은 유일한 요구 사항은 다음과 같습니다.
ru: избавиться от дополнительных ограничений на атрибут id <a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">смотрите здесь</a> . Единственные оставшиеся требования (кроме уникальности в документе):
zh_cn: 摆脱了对id属性的其他限制， <a href="http://www.w3.org/TR/2011/WD-html5-20110525/elements.html#the-id-attribute">请参见此处</a> 。 剩下的唯一要求（除了在文档中是唯一的）是：

source: it can&rsquo;t contain any space characters.
es: No puede contener caracteres de espacio.
ja: スペース文字を含めることはできません。
ko: 공백 문자를 포함 할 수 없습니다.
ru: он не может содержать пробелов.
zh_cn: 它不能包含任何空格字符。

source: it is use for HTML5 ...
es: se utiliza para HTML5 ...
ja: HTML5に使用されています。
ko: 그것은 HTML5에 사용됩니다 ...
ru: он используется для HTML5 ...
zh_cn: 它是用于HTML5 ....

source: jQuery <strong>does</strong> handle any valid ID name. You just need to escape metacharacters (i.e., dots, semicolons, square brackets...). It's like saying that JavaScript has a problem with quotes only because you can't write
es: jQuery maneja cualquier nombre de identificaci&oacute;n v&aacute;lido. Solo necesita escapar de los metacaracteres (es decir, puntos, punto y coma, corchetes ...). Es como decir que JavaScript tiene un problema con las comillas solo porque no puedes escribir
ja: jQuery <strong>は</strong>有効なID名を処理します。 メタ文字（つまり、ドット、セミコロン、角括弧...）をエスケープする必要があるだけです。 それはあなたが書くことができないという理由だけでJavaScriptが引用符に問題があると言っているようなものです
ko: jQuery <strong>는</strong> 유효한 ID 이름을 처리합니다. 메타 문자 (예 : 점, 세미콜론, 대괄호 등)를 이스케이프하면됩니다. JavaScript는 쓸 수 없기 때문에 따옴표에만 문제가 있다고 말하는 것과 같습니다.
ru: JQuery обрабатывает любое допустимое имя ID. Вам просто нужно экранировать метасимволы (то есть точки, точки с запятой, квадратные скобки ...). Это все равно что сказать, что JavaScript имеет проблему с кавычками только потому, что вы не можете написать
zh_cn: jQuery <strong>会</strong>处理任何有效的ID名称。 您只需要转义元字符（即点，分号，方括号...）。 就像说JavaScript的引号有问题只是因为您无法编写

source: must be at least one character long
es: debe tener al menos un carácter de largo
ja: 一文字以上の長さでなければなりません
ko: 1 자 이상이어야합니다
ru: должен быть не менее одного персонажа
zh_cn: 至少要有一个字长

source: must be unique in the document
es: debe ser único en el documento
ja: はドキュメント内で一意でなければなりません。
ko: 문서에서 고유해야합니다
ru: должен быть уникальным в документе
zh_cn: 必须是文件中唯一的

source: must contain at least one character
es: debe contener al menos un personaje
ja: 少なくとも一文字を含む必要があります
ko: 하나 이상의 문자를 포함해야합니다
ru: должен содержать как минимум один символ
zh_cn: 必须包含至少一个字符

source: must not contain any space characters
es: no debe contener ningún espacio
ja: スペース文字を含んではいけません。
ko: 공백 문자를 포함해서는 안됩니다
ru: не должны содержать пробелов
zh_cn: 不得含有任何空格字符

source: must not contain any space characters:
es: no debe contener ningún espacio:
ja: スペース文字を含んではいけません。
ko: 공백 문자를 포함하지 않아야합니다.
ru: не должны содержать пробелов:
zh_cn: 不得包含任何空格字符。

source: not allowed spaces
es: espacios no permitidos
ja: ふかくうスペース
ko: 허용되지 않는 공백
ru: недопустимые площади
zh_cn: 不允许空格

source: not started with numbers or a hyphen followed by a digit
es: no comienza con números o un guión seguido de un dígito
ja: テンプレ
ko: 숫자 나 하이픈으로 시작하지 않고 숫자
ru: не начинается с цифр или дефиса,за которым следует цифра.
zh_cn: 非号子

source: special chars-&gt; ':', '-', '_', '.'
es: caracteres especiales-&gt; ':', '-', '_', '.'
ja: 特殊文字-&gt; '：'、 '-'、 '_'、 '。'
ko: 특수 문자-&gt; ':', '-', '_', '.'
ru: специальные символы-&gt; ':', '-', '_', '.'
zh_cn: 特殊字符-&gt;'：'，'-'，'_'，'。'

source: the format should be either starting from '.' or an alphabet, followed by either of the special chars of more alphabets or numbers. the value of the id field must not end at an '_'.
es: el formato debe comenzar con '.' o un alfabeto,seguido de cualquiera de los caracteres especiales de más alfabetos o números.el valor del campo id no debe terminar en un '_'.
ja: で始まるか、アルファベットで始まり、それ以上のアルファベットか数字の特殊文字のいずれかが続く形式でなければなりません。
ko: 형식은 '.'에서 시작해야합니다. 또는 알파벳 다음에 더 많은 알파벳 또는 숫자의 특수 문자 중 하나가옵니다. id 필드의 값은 '_'로 끝나서는 안됩니다.
ru: формат должен начинаться либо с '.',либо с алфавита,за которым следует одна из специальных диаграмм большего количества алфавитов или чисел.значение поля id не должно заканчиваться на '_'.
zh_cn: 格式应该从'.'开始,或者是一个英文字母,后面是多个字母或数字的特殊字符。

source: the value must contain at least one character (can&rsquo;t be empty)
es: el valor debe contener al menos un car&aacute;cter (no puede estar vac&iacute;o)
ja: 値には少なくとも1つの文字が含まれている必要があります（空にすることはできません）
ko: 값은 하나 이상의 문자를 포함해야합니다 (비워 둘 수 없음)
ru: значение должно содержать хотя бы один символ (не может быть пустым)
zh_cn: 该值必须至少包含一个字符（不能为空）
