Repository: rueisnom/feedback
Catalog: xlf/70/57/9/70579.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3</strong></a> - global attributes (<code>id</code>)
es: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3</strong></a> - atributos globales ( <code>id</code> )
ja: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3-</strong></a>グローバル属性（ <code>id</code> ）
ko: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3-</strong></a> 전역 속성 ( <code>id</code> )
ru: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3</strong></a> - глобальные атрибуты ( <code>id</code> )
zh_cn: <a href="http://www.w3.org/TR/html-markup/global-attributes.html#common.attrs.id"><strong>W3-</strong></a>全局属性（ <code>id</code> ）

source: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a> atribute (<code>id</code>)
es: Atributo <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a> ( <code>id</code> )
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a>属性（ <code>id</code> ）
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a> 속성 ( <code>id</code> )
ru: Атрибут <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a> ( <code>id</code> )
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes#id"><strong>MDN</strong></a>属性（ <code>id</code> ）

source: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a> is even more permissive, saying only that an id must contain at least one character and may not contain any space characters.
es: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a> es a&uacute;n m&aacute;s permisivo, solo dice que una identificaci&oacute;n debe contener al menos un car&aacute;cter y no puede contener ning&uacute;n espacio.
ja: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a>はさらに許容度が高く、IDには少なくとも1つの文字を含める必要があり、スペース文字を含めることはできません。
ko: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a> 는 ID가 적어도 하나의 문자를 포함해야하며 공백 문자를 포함해서는 안된다고 말하는 것이 더 관대합니다.
ru: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a> является еще более допустимым, говоря только о том, что идентификатор должен содержать хотя бы один символ и не может содержать пробелов.
zh_cn: <a href="https://www.w3.org/TR/html5/dom.html#the-id-attribute">HTML 5</a>更为宽容，只说一个id必须至少包含一个字符，并且不得包含任何空格字符。

source: <strong>3.2.5.1 The <code>id</code> attribute</strong>
es: <strong>3.2.5.1 El atributo <code>id</code> </strong>
ja: <strong>3.2.5.1 <code>id</code> 属性</strong>
ko: <strong>3.2.5.1 <code>id</code> 속성</strong>
ru: <strong>3.2.5.1 Атрибут <code>id</code> </strong>
zh_cn: <strong>3.2.5.1 <code>id</code> 属性</strong>

source: <strong>3.2.5.7 The <code>class</code> attribute</strong>
es: <strong>3.2.5.7 El atributo de <code>class</code> </strong>
ja: <strong>3.2.5.7 <code>class</code> 属性</strong>
ko: <strong>3.2.5.7 <code>class</code> 속성</strong>
ru: <strong>3.2.5.7 Атрибут <code>class</code> </strong>
zh_cn: <strong>3.2.5.7 <code>class</code> 属性</strong>

source: <strong>4.1.3 Characters and case</strong>
es: <strong>4.1.3 Personajes y caso</strong>
ja: <strong>4.1.3文字とケース</strong>
ko: <strong>4.1.3 문자와 대소 문자</strong>
ru: <strong>4.1.3 Персонажи и регистр</strong>
zh_cn: <strong>4.1.3字符和大小写</strong>

source: <strong><em>However, it is invalid in CSS:</em></strong>
es: <strong><em>Sin embargo, no es v&aacute;lido en CSS:</em></strong>
ja: <strong><em>ただし、CSSでは無効です。</em></strong>
ko: <strong><em>그러나 CSS에서는 유효하지 않습니다.</em></strong>
ru: <strong><em>Тем не менее, это недопустимо в CSS:</em></strong>
zh_cn: <strong><em>但是，在CSS中无效：</em></strong>

source: <strong>ID</strong> should start with <strong>{A-Z}</strong> or <strong>{a-z}</strong> you can Add <strong>Digits, period, hyphen, underscore, colons.</strong>
es: <strong>La identificaci&oacute;n</strong> debe comenzar con <strong>{AZ}</strong> o <strong>{az}</strong> , puede agregar <strong>d&iacute;gitos, punto, gui&oacute;n, gui&oacute;n bajo, dos puntos.</strong>
ja: <strong>ID</strong>は<strong>{AZ}</strong>または<strong>{az}で</strong>始まる必要があります。 <strong>数字、ピリオド、ハイフン、アンダースコア、コロンを</strong>追加できます<strong>。</strong>
ko: <strong>ID</strong> 는 <strong>{AZ}</strong> 또는 <strong>{az}로</strong> 시작해야하며 <strong>숫자, 마침표, 하이픈, 밑줄, 콜론을</strong> 추가 할 수 있습니다 <strong>.</strong>
ru: <strong>Идентификатор</strong> должен начинаться с <strong>{AZ}</strong> или <strong>{az},</strong> вы можете добавить <strong>цифры, точку, дефис, подчеркивание, двоеточие.</strong>
zh_cn: <strong>ID</strong>应该以<strong>{AZ}</strong>或<strong>{az}</strong> <strong>开头，</strong>您可以添加<strong>数字，句点，连字符，下划线和冒号。</strong>

source: <strong>W3C References</strong>
es: <strong>Referencias W3C</strong>
ja: <strong>W3Cリファレンス</strong>
ko: <strong>W3C 참조</strong>
ru: <strong>W3C Ссылки</strong>
zh_cn: <strong>W3C参考</strong>

source: A common mistake is to use an ID that starts with a digit.
es: Un error común es usar una identificación que comienza con un dígito.
ja: よくある間違いは、数字で始まるIDを使うことです。
ko: 일반적인 실수는 숫자로 시작하는 ID를 사용하는 것입니다.
ru: Обычная ошибка заключается в использовании идентификатора,который начинается с цифры.
zh_cn: 一个常见的错误是使用一个以数字开头的ID。

source: A now very obscure problem was that at least one browser, Netscape 6, <a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">incorrectly treated id attribute values as case-sensitive</a>. That meant that if you had typed <code>id="firstName"</code> in your HTML (lower-case 'f') and <code>#FirstName { color: red }</code> in your CSS (upper-case 'F'), that buggy browser would have failed to set the element's color to red. At the time of this edit, April 2015, I hope you aren't being asked to support Netscape 6. Consider this a historical footnote.
es: Un problema ahora muy oscuro era que al menos un navegador, Netscape 6, <a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">trataba incorrectamente los valores de los atributos de id como may&uacute;sculas y min&uacute;sculas</a> . Eso significaba que si hubiera escrito <code>id="firstName"</code> en su HTML (min&uacute;scula 'f') y <code>#FirstName { color: red }</code> en su CSS (may&uacute;scula 'F'), ese navegador defectuoso no hubiera podido establece el color del elemento en rojo. En el momento de esta edici&oacute;n, abril de 2015, espero que no se te pida que apoyes Netscape 6. Considera esto como una nota al pie hist&oacute;rica.
ja: 現在、非常にあいまいな問題は、少なくとも1つのブラウザー、Netscape 6が<a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">id属性値を大文字と小文字を区別するものとして誤って処理すること</a>でした。 つまり、HTMLに <code>id="firstName"</code> （小文字の 'f'）を <code>#FirstName { color: red }</code> し、CSS（大文字の 'F'）に#FirstName {color：red}を入力した場合、バグのあるブラウザは要素の色を赤に設定します。 この編集の時点で、2015年4月に、Netscape 6をサポートするように求められていないことを願っています。これは歴史的な脚注と考えてください。
ko: 현재 매우 모호한 문제는 하나 이상의 브라우저 (Netscape 6) <a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">가 id 속성 값을 대소 문자를 구분하는 것으로 잘못 취급</a> 했다는 것입니다. 즉, HTML (소문자 'f')에 <code>id="firstName"</code> 을 입력하고 CSS (대문자 'F')에 <code>#FirstName { color: red }</code> 를 입력했다면 버그가있는 브라우저는 실패했을 것입니다 요소의 색상을 빨간색으로 설정하십시오. 2015 년 4 월이 편집 당시에는 Netscape 6을 지원하라는 요청을받지 않기를 바랍니다.이 내용을 역사적 각주로 간주하십시오.
ru: Теперь очень непонятная проблема заключалась в том, что по крайней мере один браузер, Netscape 6, <a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">неправильно обрабатывал значения атрибутов id как регистрозависимые</a> . Это означало, что если бы вы ввели <code>id="firstName"</code> в HTML ( <code>#FirstName { color: red }</code> f) и #FirstName {color: red} в CSS ( прописная буква F), этот браузер с ошибками не смог бы установите цвет элемента на красный. Во время этого редактирования, в апреле 2015 года, я надеюсь, что вас не просят поддержать Netscape 6. Считайте, что это историческая сноска.
zh_cn: 现在一个非常模糊的问题是，至少一个浏览器Netscape 6 <a href="https://developer.mozilla.org/en-US/docs/Case_Sensitivity_in_class_and_id_Names">错误地将id属性值视为区分大小写</a> 。 这意味着，如果您在HTML中输入 <code>id="firstName"</code> （小写字母'f'），而在CSS中 <code>#FirstName { color: red }</code> （大写字母'F'），则该多虫浏览器将无法将元素的颜色设置为红色。 在进行此编辑（2015年4月）时，希望您不会被要求支持Netscape6。请考虑一下这是一个历史脚注。

source: A unique identifier for the element.
es: Un identificador único para el elemento.
ja: 要素の一意の識別子。
ko: 요소의 고유 식별자입니다.
ru: Уникальный идентификатор элемента.
zh_cn: 该元素的唯一标识符。

source: Also in <strong>JS</strong> it is Hard to select these ID's. So you should use first four ID's As preferred by many developer around and if it's necessary than you can use last two also.
es: Tambi&eacute;n en <strong>JS</strong> es dif&iacute;cil seleccionar estos ID. Por lo tanto, debe usar los primeros cuatro ID Seg&uacute;n lo prefieran muchos desarrolladores y, si es necesario, tambi&eacute;n puede usar los dos &uacute;ltimos.
ja: また、 <strong>JS</strong>では、これらのIDを選択するのは困難です。 したがって、最初の4つのIDを使用する必要があります。多くの開発者が好むように、必要であれば、最後の2つも使用できます。
ko: 또한 <strong>JS</strong> 에서는 이러한 ID를 선택하기가 어렵습니다. 따라서 많은 개발자가 선호하는 것처럼 처음 네 개의 ID를 사용해야하며 필요한 경우 마지막 두 개의 ID도 사용할 수 있습니다.
ru: Также в <strong>JS</strong> трудно выбрать эти идентификаторы. Таким образом, вы должны использовать первые четыре идентификатора, как предпочитают многие разработчики, и, если это необходимо, вы также можете использовать два последних.
zh_cn: 同样在<strong>JS中</strong> ，很难选择这些ID。 因此，您应该使用前四个ID作为许多开发人员的首选，如果有必要，还可以使用后两个ID。

source: Also, never forget that an ID is unique. Once used, the ID value may not appear again anywhere in the document.
es: Además,nunca olvides que una identificación es única.Una vez utilizado,el valor de la identificación puede no volver a aparecer en ninguna parte del documento.
ja: また、IDは一意であることを忘れないでください。一度使用されたID値は、ドキュメント内のどこにも二度と表示されないことがあります。
ko: 또한 ID가 고유하다는 것을 잊지 마십시오. 사용한 후에는 ID 값이 문서의 어느 곳에도 다시 나타나지 않을 수 있습니다.
ru: Кроме того,никогда не забывайте,что удостоверение личности уникально.После использования значение ID может больше нигде не появляться в документе.
zh_cn: 另外,千万不要忘记,ID是唯一的。一旦使用,该ID值可能不会再出现在文档中的任何地方。

source: Also, spaces are not allowed, if provided, they are treated as different values, which is not valid in case of the id attributes.
es: Además,los espacios no están permitidos,si se proporcionan,se tratan como valores diferentes,lo que no es válido en el caso de los atributos de identificación.
ja: また、スペースが指定されている場合は別の値として扱われるため、id属性の場合は無効です。
ko: 또한 공백은 제공되는 경우 허용되지 않으며 다른 값으로 취급되므로 id 속성의 경우 유효하지 않습니다.
ru: Кроме того,пробелы не допускаются,если они предусмотрены,они рассматриваются как различные значения,что не допустимо в случае атрибутов id.
zh_cn: 另外,空格是不允许的,如果提供了,则作为不同的值处理,这在id属性的情况下是无效的。

source: Any <strong>Alpha-numeric value</strong> and "<strong>-</strong>" and "<strong>_</strong>" is valid. But, you should <em>start the id name</em> with any character between <strong>A-Z</strong> or <strong>a-z</strong>.
es: Cualquier <strong>valor alfanum&eacute;rico</strong> y " <strong>-</strong> " y " <strong>_</strong> " es v&aacute;lido. Pero, debe <em>comenzar el nombre de identificaci&oacute;n</em> con cualquier car&aacute;cter entre <strong>AZ</strong> o <strong>az</strong> .
ja: 任意<strong>の英数字値</strong> 、および「 <strong>-</strong> 」と「 <strong>_</strong> 」が有効です。 ただし、 <em>ID名</em>は<strong>AZ</strong>または<strong>azの</strong>間の任意の文字で<em>始める</em>必要があります。
ko: <strong>영숫자 값</strong> 과 " <strong>-</strong> "및 " <strong>_</strong> "가 유효합니다. 그러나 <strong>AZ</strong> 또는 <strong>az</strong> 사이의 문자로 <em>id 이름</em> 을 <em>시작</em> 해야합니다.
ru: Любые <strong>буквенно-цифровые значения,</strong> а также " <strong>-</strong> " и " <strong>_</strong> " действительны. Но <em>имя идентификатора</em> следует <em>начинать</em> с любого символа между <strong>AZ</strong> или <strong>az</strong> .
zh_cn: 任何<strong>字母数字值</strong>以及&ldquo; <strong>-</strong> &rdquo;和&ldquo; <strong>_</strong> &rdquo;均有效。 但是，您应该以<strong>AZ</strong>或<strong>az</strong>之间的任何字符<em>开头id名称</em> 。

source: Any string, with the following restrictions:
es: Cualquier cuerda,con las siguientes restricciones:
ja: 任意の文字列。
ko: 다음 제한이있는 모든 문자열 :
ru: Любая строка,со следующими ограничениями:
zh_cn: 任何字符串,但有以下限制:

source: As a purely practical matter, you may want to avoid certain characters. Periods, colons and '#' have special meaning in CSS selectors, so you will have to escape those characters using a <a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">backslash in CSS</a> or a double backslash in a <a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">selector string passed to jQuery</a>. Think about how often you will have to escape a character in your stylesheets or code before you go crazy with periods and colons in ids.
es: Como cuesti&oacute;n puramente pr&aacute;ctica, es posible que desee evitar ciertos personajes. Los puntos, los dos puntos y '#' tienen un significado especial en los selectores CSS, por lo que tendr&aacute; que escapar de esos caracteres utilizando una <a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">barra invertida en CSS</a> o una barra invertida doble en una <a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">cadena de selector pasada a jQuery</a> . Piensa en la frecuencia con la que tendr&aacute;s que escapar de un personaje en tus hojas de estilo o c&oacute;digo antes de volverte loco con puntos y dos puntos en los identificadores.
ja: 純粋に実用的な問題として、特定の文字を避けたい場合があります。 ピリオド、コロン、 '＃'はCSSセレクターで特別な意味を持つため<a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">、CSSのバックスラッシュ</a>または<a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">jQueryに渡されるセレクター文字列の</a>ダブルバックスラッシュを使用して、これらの文字をエスケープする必要があります。 IDにピリオドとコロンを使用する前に、スタイルシートまたはコードで文字をエスケープする必要がある頻度を考えてください。
ko: 순전히 실질적인 문제로 특정 문자를 피할 수 있습니다. 마침표, 콜론 및 '#'은 CSS 선택기에서 특별한 의미를 가지므로 <a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">CSS</a> 의 백 슬래시 또는 <a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">jQuery에 전달</a> 된 선택기 문자열 의 이중 백 슬래시를 사용하여 해당 문자를 이스케이프해야합니다. ID에 마침표와 콜론이 생기기 전에 스타일 시트 나 코드에서 캐릭터를 이스케이프해야하는 빈도를 생각하십시오.
ru: В качестве чисто практического вопроса вы можете избегать определенных персонажей. Точки, двоеточия и '#' имеют особое значение в селекторах CSS, поэтому вам придется экранировать эти символы, используя <a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">обратную косую черту в CSS</a> или двойную обратную косую черту в <a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">строке селектора, передаваемой в jQuery</a> . Подумайте о том, как часто вам придется избегать символа в ваших таблицах стилей или коде, прежде чем сходить с ума от точек и двоеточий в идентификаторах.
zh_cn: 从纯粹的实践出发，您可能要避免使用某些字符。 在CSS选择器中，句号，冒号和'＃'具有特殊含义，因此您必须<a href="http://www.w3.org/TR/CSS2/syndata.html#value-def-identifier">在CSS中</a>使用反斜杠或在<a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-select-an-element-by-an-id-that-has-characters-used-in-css-notation/">传递给jQuery</a>的选择器字符串中使用双反斜杠来转义这些字符。 想一想，在迷上句号和ID中的冒号之前，必须多久在样式表或代码中转义一个字符。

source: As of HTML5, the only restrictions on the value of an ID are:
es: A partir de HTML5,las únicas restricciones sobre el valor de una identificación son:
ja: HTML5の時点では、IDの値に制限があるだけです。
ko: HTML5 기준으로 ID 값에 대한 유일한 제한 사항은 다음과 같습니다.
ru: Начиная с HTML5,единственными ограничениями на значение ID являются:
zh_cn: 从HTML5开始,对ID值的唯一限制是。

source: At least one character, no spaces.
es: Al menos un personaje,sin espacios.
ja: 最低1文字、スペースなし。
ko: 공백이없는 하나 이상의 문자.
ru: По крайней мере,один персонаж,без пробелов.
zh_cn: 至少有一个角色,没有空格。

source: But Even Though You can Make ID with Colons(:) or period(.) It is hard for <strong>CSS</strong> to use these ID as Selector. Mainly when you want to Use Pseudo elements (:before,:after).
es: Pero a pesar de que puede hacer ID con dos puntos (:) o punto (.) Es dif&iacute;cil para <strong>CSS</strong> usar estos ID como Selector. Principalmente cuando quieres usar Pseudo elementos (: before,: after).
ja: ただし、コロン（:)またはピリオド（。）を使用してIDを作成することはできますが、 <strong>CSS</strong>がこれらのIDをセレクターとして使用することは困難です。 主に、疑似要素（：before、：after）を使用する場合。
ko: 그러나 콜론 (:) 또는 마침표 (.)로 ID를 만들 수는 있지만 <strong>CSS</strong> 에서 이러한 ID를 선택기로 사용하기는 어렵습니다. 주로 의사 요소 (: before, : after)를 사용하려는 경우
ru: Но даже при том, что вы можете сделать ID с помощью двоеточий (:) или точка (.) <strong>CSS</strong> трудно использовать эти идентификаторы в качестве селектора. В основном, когда вы хотите использовать псевдоэлементы (: before,: after).
zh_cn: 但是，即使您可以使用冒号（:)或period（。）来创建ID，对于<strong>CSS来说</strong> ，也很难将这些ID用作选择器。 主要是当您想使用伪元素（：before，：after）时。

source: But jquery seems to have problems with colons so it might be better to avoid them.
es: Pero jquery parece tener problemas con los cólones,así que sería mejor evitarlos.
ja: ただ、jqueryはコロンに問題があるようなので、コロンは避けた方がいいかもしれません。
ko: 그러나 jquery는 콜론에 문제가있는 것으로 보이므로 피하는 것이 좋습니다.
ru: Но,похоже,что у Джекри есть проблемы с толстой кишкой,так что,возможно,лучше их избегать.
zh_cn: 但jquery似乎对冒号有问题,所以最好避免使用冒号。

source: EDIT: d'oh! Beaten to the button, again!
es: EDITORIAL:d'oh! ¡Golpeado hasta el botón,otra vez!
ja: EDIT:d'oh! またしてもボタンを叩かれた!
ko: 편집 : 아! 버튼에 다시 맞았다!
ru: ЭДИТ:d'oh! Снова избит до потери пуговицы!
zh_cn: EDIT:d'oh! 又被打到按钮了!

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: For <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4</a>, the answer is technically:
es: Para <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4</a> , la respuesta es t&eacute;cnicamente:
ja: <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4の</a>場合、答えは技術的には次のとおりです。
ko: <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4</a> 의 경우 대답은 기술적으로 다음과 같습니다.
ru: Для <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4</a> ответ технически:
zh_cn: 对于<a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4</a> ，技术上的答案是：

source: For example, an ID could be labelled "a.b:c" and referenced in the style sheet as #a.b:c but as well as being the id for the element, it could mean id "a", class "b", pseudo-selector "c". Best to avoid the confusion and stay away from using . and : altogether.
es: Por ejemplo,una identificación podría ser etiquetada "a.b:c" y referenciada en la hoja de estilo como #a.b:c pero además de ser la identificación del elemento,podría significar la identificación "a",clase "b",pseudo-sector "c".Es mejor evitar la confusión y no usar.y:en conjunto.
ja: 例えば、IDは "a.b:c "とラベル付けされ、スタイルシートでは#a.b:cとして参照されますが、要素のIDであるだけでなく、id "a"、クラス "b"、擬似セレクタ "c "を意味することもあります。混乱を避け、.と:の使用を完全に避けるのがベストです。
ko: 예를 들어, ID는 "ab : c"로 레이블이 지정되고 스타일 시트에서 #ab : c로 참조 될 수 있지만 요소의 id 일뿐만 아니라 id "a", 클래스 "b", 의사- 선택기 "c". 혼동을 피하고 사용하지 않는 것이 가장 좋습니다. 그리고 : 모두.
ru: Например,ID может обозначаться "a.b:c" и упоминаться в таблице стилей как #a.b:c,но помимо того,что он является id для элемента,он может означать id "a",класс "b",псевдо-селектор "c".Лучше всего избежать путаницы и держаться подальше от использования.и:вообще.
zh_cn: 例如,一个ID可以被标记为 "a.b:c",并在样式表中引用为#a.b:c,但除了是元素的id外,它还可以表示id "a",类 "b",伪选择器 "c"。最好的办法是避免混淆,不要使用 .和 :。

source: For example, the HTML declaration <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> is valid. You can select that element in CSS as <code>#first\.name</code> and in jQuery like so: <code>$('#first\\.name').</code> But if you forget the backslash, <code>$('#first.name')</code>, you will have a perfectly valid selector looking for an element with id <code>first</code> and also having class <code>name</code>. This is a bug that is easy to overlook. You might be happier in the long run choosing the id <code>first-name</code> (a hyphen rather than a period), instead.
es: Por ejemplo, la declaraci&oacute;n HTML <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> es v&aacute;lida. Puede seleccionar ese elemento en CSS como <code>#first\.name</code> y en jQuery as&iacute;: <code>$('#first\\.name').</code> Name '). Pero si olvida la barra invertida, <code>$('#first.name')</code> , tendr&aacute; un selector perfectamente v&aacute;lido que busca <code>first</code> un elemento con id y tambi&eacute;n tiene un <code>name</code> clase. Este es un error que es f&aacute;cil de pasar por alto. En su lugar, podr&iacute;a ser m&aacute;s feliz eligiendo el <code>first-name</code> identificaci&oacute;n (un gui&oacute;n en lugar de un punto).
ja: たとえば、HTML宣言 <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> は有効です。 CSSでその要素を <code>#first\.name</code> として、jQueryで次のように選択できます： <code>$('#first\\.name').</code> ＃first \\。name'）。 しかし、バックスラッシュ <code>$('#first.name')</code> を忘れた場合、完全に有効なセレクターがあり、 <code>first</code> IDを持つ要素を探し、クラス <code>name</code> も持っています。 これは見落としやすいバグです。 代わりに、長期的にはidの <code>first-name</code> （ピリオドではなくハイフン）を選択した方が幸せな場合があります。
ko: 예를 들어 HTML 선언 <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> 이 유효합니다. CSS에서 <code>#first\.name</code> 으로 jQuery에서 <code>$('#first\\.name').</code> 과 같은 요소를 선택할 수 있습니다 . 그러나 백 슬래시 <code>$('#first.name')</code> 을 잊어 버린 경우 id가 <code>first</code> 있고 클래스 <code>name</code> 있는 요소를 찾는 완벽하게 유효한 선택기가 있습니다. 간과하기 쉬운 버그입니다. 대신 id <code>first-name</code> (마침표 대신 하이픈)을 선택하면 장기적으로 더 행복 할 수 있습니다.
ru: Например, HTML-объявление <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> допустимо. Вы можете выбрать этот элемент в CSS как <code>#first\.name</code> и в jQuery следующим образом: <code>$('#first\\.name').</code> Name '). Но если вы забудете обратную косую черту, <code>$('#first.name')</code> , у вас будет совершенно корректный селектор, который <code>first</code> ищет элемент с идентификатором, а также <code>name</code> класса. Это ошибка, которую легко не заметить. Возможно, в конечном итоге вы будете более счастливы, выбрав вместо имени имя id (дефис, а не точка).
zh_cn: 例如，HTML声明 <code>&lt;div id="first.name"&gt;&lt;/div&gt;</code> 是有效的。 您可以在CSS中选择该元素作为 <code>#first\.name</code> ，在jQuery中选择该元素： <code>$('#first\\.name').</code> 但是，如果您忘记了反斜杠 <code>$('#first.name')</code> ，则将有一个非常有效的选择器，该选择器首先查找id为id的元素，并且还具有class <code>name</code> 。 这是一个容易忽略的错误。 从长远来看，您可能会更快乐，而是选择id <code>first-name</code> （连字符而不是句点）。

source: For example, the following ID is valid in HTML5:
es: Por ejemplo,el siguiente ID es válido en HTML5:
ja: 例えば、HTML5では以下のIDが有効です。
ko: 예를 들어 다음 ID는 HTML5에서 유효합니다.
ru: Например,в HTML5 действителен следующий идентификатор:
zh_cn: 例如,下面的ID在HTML5中是有效的。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: From the <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4 specification</a>:
es: De la <a href="http://www.w3.org/TR/html4/types.html#type-id">especificaci&oacute;n HTML 4</a> :
ja: <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4仕様から</a> ：
ko: <a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4 사양에서</a> :
ru: Из <a href="http://www.w3.org/TR/html4/types.html#type-id">спецификации HTML 4</a> :
zh_cn: 根据<a href="http://www.w3.org/TR/html4/types.html#type-id">HTML 4规范</a> ：

source: From the CSS2.1 spec:
es: De la especificación CSS2.1:
ja: CSS2.1仕様より。
ko: CSS2.1 스펙에서 :
ru: Из спецификации CSS2.1
zh_cn: 来自CSS2.1规范。
