Repository: rueisnom/feedback
Catalog: xlf/70/57/9/70579.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: use hyphen "-" (underscore "_" can also use but not good for seo) for long CSS class or Id rule names
es: usar el guión "-" (el subrayado "_" también se puede usar pero no es bueno para seo)para nombres largos de clase CSS o de reglas de identificación
ja: 長いCSSクラスやIdルール名にはハイフン「-」(アンダースコア「_」も使用できますが、SEOのためには良くありません)を使用してください。
ko: 긴 CSS 클래스 또는 ID 규칙 이름에 하이픈 "-"(밑줄 "_"은 seo를 사용할 수 있지만 seo에는 적합하지 않음)을 사용하십시오.
ru: использовать дефис "-" (подчеркивание "_" может также использоваться,но не подходит для seo)для длинных имен классов CSS или правил Id
zh_cn: 对于较长的CSS类或Id规则名称,使用连字符"-"(下划线"_"也可以使用,但不利于SEO)。

source: using ID selectors is faster than using class selectors
es: El uso de selectores de identificación es más rápido que el uso de selectores de clase.
ja: クラスセレクタを使うよりも ID セレクタを使った方が速い
ko: ID 선택기를 사용하는 것이 클래스 선택기를 사용하는 것보다 빠릅니다.
ru: использование селекторов идентификаторов быстрее,чем использование селекторов классов.
zh_cn: 使用ID选择器比使用类选择器更快。

source: values can be : [a-z],[A-Z],[0-9],[* _ : -]
es: los valores pueden ser..:a-z,a-z,0-9,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z,a-z.
ja: の値は次のようになります。a-z],[A-Z],[0-9],[*_:-]です。
ko: 값은 다음과 같습니다. [az], [AZ], [0-9], [* _ :-]
ru: значения могут быть:[a-z],[A-Z],[0-9],[*_:-].
zh_cn: 值可以是:[a-z],[A-Z],[0-9],[*_:-]

source: we can add id with any tag.
es: podemos añadir una identificación con cualquier etiqueta.
ja: IDは任意のタグで追加することができます。
ko: 모든 태그로 id를 추가 할 수 있습니다.
ru: мы можем добавить id с любой меткой.
zh_cn: 我们可以用任何标签添加id。
