Repository: rueisnom/feedback
Catalog: xlf/70/57/9/70579.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: From the HTML 4 spec...
es: De las especificaciones de HTML 4...
ja: HTML 4の仕様から...。
ko: HTML 4 사양에서 ...
ru: Из спецификации HTML 4...
zh_cn: 从HTML 4规范中.....

source: HTML5: Permitted Values for ID &amp; Class Attributes
es: HTML5: valores permitidos para ID y atributos de clase
ja: HTML5：IDおよびクラス属性に許可される値
ko: HTML5 : ID 및 클래스 속성에 허용되는 값
ru: HTML5: допустимые значения для идентификаторов и атрибутов классов
zh_cn: HTML5：ID和类属性的允许值

source: Hyphens, underscores, periods, colons, numbers and letters are all valid for use with CSS and JQuery. The following should work but it must be unique throughout the page and also must start with a letter [A-Za-z].
es: Guiones,subrayados,puntos,dos puntos,números y letras son todos válidos para su uso con CSS y JQuery.Lo siguiente debe funcionar pero debe ser único en toda la página y también debe comenzar con una letra [A-Za-z].
ja: ハイフン、アンダースコア、ピリオド、コロン、数字、文字はすべてCSSとJQueryで使用できます。次のものは動作するはずですが、ページ全体で一意である必要があり、また、文字 [A-Za-z]で始まる必要があります。
ko: 하이픈, 밑줄, 마침표, 콜론, 숫자 및 문자는 모두 CSS 및 JQuery와 함께 사용할 수 있습니다. 다음은 작동하지만 페이지 전체에서 고유해야하며 문자 [A-Za-z]로 시작해야합니다.
ru: Дефисы,подчеркивания,точки,двоеточия,цифры и буквы действительны для использования с CSS и JQuery.Следующее должно работать,но оно должно быть уникальным по всей странице,а также должно начинаться с буквы [A-Za-z].
zh_cn: 连字符、下划线、句号、冒号、数字和字母都可以在CSS和JQuery中使用。下面的内容应该可以使用,但它必须是整个页面中唯一的,并且必须以字母[A-Za-z]开头。

source: ID allows alphanumeric and special characters
es: La identificación permite caracteres alfanuméricos y especiales
ja: IDは英数字と特殊文字が可能
ko: ID는 영숫자와 특수 문자를 허용합니다
ru: ID позволяет вводить буквенно-цифровые и специальные символы
zh_cn: ID允许字母数字和特殊字符

source: ID and NAME tokens must begin with a letter ([A-Za-z]) and may be followed by any number of letters, digits ([0-9]), hyphens ("-"), underscores ("_"), colons (":"), and periods (".").
es: Las fichas de ID y NOMBRE deben comenzar con una letra ([A-Za-z])y pueden ir seguidas de cualquier número de letras,dígitos ([0-9]),guiones ("-"),subrayados ("_"),dos puntos (":")y puntos (".").
ja: IDとNAMEトークンは文字([A-Za-z])で始まり、その後に任意の数の文字、数字([0-9])、ハイフン("-")、アンダースコア("_")、コロン(":")、ピリオド("...)を付けることができます。
ko: ID 및 NAME 토큰은 문자 ([A-Za-z])로 시작해야하며 문자, 숫자 ([0-9]), 하이픈 ( "-"), 밑줄 ( "_") 뒤에 올 수 있습니다. , 콜론 ( ":") 및 마침표 ( ".")
ru: ID и ФАМИЛИЯ должны начинаться с буквы ([A-Za-z]),за которой может следовать любое количество букв,цифр ([0-9]),дефисов ("-"),знаков подчеркивания ("_"),двоеточий (":")и точек (".").
zh_cn: ID 和 NAME 令牌必须以字母([[A-Za-z])开头,后面可以有任意数量的字母、数字([[0-9])、连字符("-")、下划线("_")、冒号(":")和句号(".")。

source: ID should match:
es: La identificación debería coincidir:
ja: IDは一致するはずです。
ko: 아이디는 다음과 같아야합니다.
ru: Идентификатор должен совпадать:
zh_cn: 身份证应该符合。

source: IDs are best suited for naming parts of your layout so should not give same name for ID and class
es: Las identificaciones son las más adecuadas para nombrar partes de su diseño,por lo que no deben dar el mismo nombre para la identificación y la clase.
ja: ID はレイアウトの各部分の名前付けに最適なので、ID とクラスを同じ名前にしてはいけません。
ko: ID는 레이아웃의 일부를 명명하는 데 가장 적합하므로 ID와 클래스의 이름을 동일하게 지정해서는 안됩니다.
ru: IDs лучше всего подходят для именования частей макета,поэтому не должны давать одно и то же имя для ID и класса
zh_cn: ID最适合用于命名你的布局中的部分,所以ID和类的名称不应相同。

source: If a rule has an ID selector as its key selector, don&rsquo;t add the tag name to the rule. Since IDs are unique, adding a tag name would slow down the matching process needlessly.
es: Si una regla tiene un selector de ID como su selector de clave, no agregue el nombre de la etiqueta a la regla. Como los ID son &uacute;nicos, agregar un nombre de etiqueta ralentizar&iacute;a innecesariamente el proceso de coincidencia.
ja: ルールのキーセレクターとしてIDセレクターがある場合は、ルールにタグ名を追加しないでください。 IDは一意であるため、タグ名を追加すると、マッチングプロセスが不必要に遅くなります。
ko: 규칙에 ID 선택기가 키 선택기로 있으면 태그 이름을 규칙에 추가하지 마십시오. ID는 고유하기 때문에 태그 이름을 추가하면 일치 프로세스가 불필요하게 느려집니다.
ru: Если правило имеет селектор идентификатора в качестве ключевого селектора, не добавляйте имя тега в правило. Поскольку идентификаторы уникальны, добавление имени тега замедлит процесс сопоставления без необходимости.
zh_cn: 如果规则将ID选择器作为其键选择器，请不要将标签名称添加到规则中。 由于ID是唯一的，因此添加标签名称会不必要地减慢匹配过程。

source: If you give an element the id "my.cool:thing", your CSS selector will look like this:
es: Si le das a un elemento el id "my.cool:thing",tu selector CSS se verá así:
ja: 要素に "my.cool:that "というidを与えると、CSSセレクタは以下のようになります。
ko: 요소에 id "my.cool:thing"을 지정하면 CSS 선택기는 다음과 같습니다.
ru: Если вы дадите элементу id "my.cool:thing",ваш CSS-селектор будет выглядеть так:
zh_cn: 如果你给一个元素的id为 "my.cool:thing",你的CSS选择器会是这样的。

source: In CSS (and several JavaScript libraries like jQuery), both the period and the colon have special meaning and you will run into problems if you're not careful. Periods are class selectors and colons are pseudo-selectors (eg., ":hover" for an element when the mouse is over it).
es: En CSS (y varias librerías de JavaScript como jQuery),tanto el período como el colon tienen un significado especial y te encontrarás con problemas si no tienes cuidado.Los períodos son selectores de clase y los dos puntos son pseudos-selectores (por ejemplo,":hover" para un elemento cuando el ratón está sobre él).
ja: CSS(およびjQueryのようないくつかのJavaScriptライブラリ)では、ピリオドとコロンの両方に特別な意味があり、注意しないと問題が発生します。ピリオドはクラスのセレクタであり、コロンは擬似セレクタです(例えば、マウスが要素の上に乗ったときに「:hover」と表示されます)。
ko: CSS (및 jQuery와 같은 여러 JavaScript 라이브러리)에서 마침표와 콜론은 모두 특별한 의미가 있으므로주의하지 않으면 문제가 발생할 수 있습니다. 마침표는 클래스 선택기이며 콜론은 의사 선택기입니다 (예 : 마우스가 위에있을 때 요소의 ": 호버").
ru: В CSS (и некоторых библиотеках JavaScript,таких как jQuery)и период,и двоеточие имеют особое значение,и вы столкнетесь с проблемами,если не будете осторожны.Периоды-это селекторы классов,а двоеточия-это псевдо-селекторы (например,":наведите курсор" на элемент,когда он находится над ним).
zh_cn: 在CSS(以及jQuery等几个JavaScript库)中,句号和冒号都有特殊的含义,如果你不小心就会遇到问题。句号是类选择器,而冒号是伪选择器(例如,当鼠标移到一个元素的上方时,":hover "表示该元素)。

source: In CSS, <em>identifiers</em> (including element names, classes, and IDs in selectors) can contain only the characters [a-zA-Z0-9] and ISO 10646 characters U+00A0 and higher, plus the hyphen (-) and the underscore (_); <strong><em>they cannot start with a digit, two hyphens, or a hyphen followed by a digit</em></strong>.
es: En CSS, los <em>identificadores</em> (incluidos los nombres de elementos, clases e ID en los selectores) pueden contener solo los caracteres [a-zA-Z0-9] y los caracteres ISO 10646 U + 00A0 y superiores, m&aacute;s el gui&oacute;n (-) y el gui&oacute;n bajo ( _); <strong><em>no pueden comenzar con un d&iacute;gito, dos guiones o un gui&oacute;n seguido de un d&iacute;gito</em></strong> .
ja: CSSでは、 <em>識別子</em> （セレクターの要素名、クラス、IDを含む）には、文字[a-zA-Z0-9]とISO 10646文字U + 00A0以上、およびハイフン（-）とアンダースコア（ _）; <strong><em>数字、2つのハイフン、またはハイフンの後に数字を続けることはできません</em></strong> 。
ko: CSS에서 <em>식별자</em> (선택자에 요소 이름, 클래스 및 ID 포함)에는 문자 [a-zA-Z0-9] 및 ISO 10646 문자 U + 00A0 이상과 하이픈 (-) 및 밑줄 ( _); <strong><em>숫자, 하이픈 2 개 또는 하이픈 다음에 숫자로 시작할 수 없습니다</em></strong> .
ru: В CSS <em>идентификаторы</em> (включая имена элементов, классы и идентификаторы в селекторах) могут содержать только символы [a-zA-Z0-9] и символы ISO 10646 U + 00A0 и выше, плюс дефис (-) и символ подчеркивания ( _); <strong><em>они не могут начинаться с цифры, двух дефисов или дефиса, за которым следует цифра</em></strong> .
zh_cn: 在CSS中， <em>标识符</em> （包括选择器中的元素名称，类和ID）只能包含字符[a-zA-Z0-9]和ISO 10646字符U + 00A0及更高版本，以及连字符（-）和下划线（ _）; <strong><em>他们不能以数字，两个连字符或以数字开头的连字符开头</em></strong> 。

source: In ES2015, identifiers must start with $, _, or any symbol with the Unicode derived core property ID_Start.
es: En ES2015,los identificadores deben comenzar con $,_,o cualquier símbolo con la propiedad ID_Start del núcleo derivado de Unicode.
ja: ES2015 では、識別子は $、_、または Unicode 派生コアプロパティ ID_Start を持つ任意の記号で始まる必要があります。
ko: ES2015에서 식별자는 $, _ 또는 유니 코드 파생 핵심 속성 ID_Start가있는 기호로 시작해야합니다.
ru: В ES2015 идентификаторы должны начинаться с $,_или любого символа с производным от ядра свойством ID_Start.
zh_cn: 在ES2015中,标识符必须以$、_或任何具有Unicode派生核心属性ID_Start的符号开头。

source: In HTML
es: En HTML
ja: HTMLでは
ko: HTML에서
ru: В HTML
zh_cn: 在HTML中

source: In HTML 4, ID values must begin with a letter, which can then be followed only by letters, digits, hyphens, underscores, colons and periods.
es: En HTML 4,los valores de identificación deben comenzar con una letra,que luego puede ser seguida sólo por letras,dígitos,guiones,subrayados,dos puntos y puntos.
ja: HTML 4では、ID値は文字で始めなければならず、文字、数字、ハイフン、アンダースコア、コロン、ピリオドのみが続くことができます。
ko: HTML 4에서 ID 값은 문자로 시작해야하며 문자, 숫자, 하이픈, 밑줄, 콜론 및 마침표 만 뒤에 올 수 있습니다.
ru: В HTML 4 значения ID должны начинаться с буквы,за которой могут следовать только буквы,цифры,дефисы,подчеркивания,двоеточия и точки.
zh_cn: 在HTML 4中,ID值必须以字母开头,然后只能用字母、数字、连字符、下划线、冒号和句号跟随。

source: In HTML5 these are valid:
es: En HTML5 son válidos:
ja: HTML5では、これらは有効です。
ko: HTML5에서는 유효합니다 :
ru: В HTML5 они действительны:
zh_cn: 在HTML5中,这些都是有效的。

source: In HTML5, the id attribute can be used on any HTML element and In HTML 4.01, the id attribute cannot be used with: <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>
es: En HTML5, el atributo id se puede usar en cualquier elemento HTML y en HTML 4.01, el atributo id no se puede usar con: <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>
ja: HTML5では、id属性は任意のHTML要素で使用できます。HTML4.01では、id属性は <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>
ko: HTML5에서는 id 속성을 모든 HTML 요소에 사용할 수 있으며 HTML 4.01에서는 id 속성을 <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>
ru: В HTML5 атрибут id можно использовать с любым элементом HTML, а в HTML 4.01 атрибут id нельзя использовать с: <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>
zh_cn: 在HTML5中，id属性可以在任何HTML元素上使用，在HTML 4.01中，id属性不能与以下属性一起使用： <code>&lt;base&gt;, &lt;head&gt;, &lt;html&gt;, &lt;meta&gt;, &lt;param&gt;, &lt;script&gt;, &lt;style&gt;, and &lt;title&gt;.</code>

source: In most cases you may be able to escape characters in contexts where they have restrictions or special meaning.
es: En la mayoría de los casos se puede escapar de los personajes en contextos donde tienen restricciones o un significado especial.
ja: ほとんどの場合、制限や特別な意味を持つ文脈では、文字をエスケープすることができるかもしれません。
ko: 대부분의 경우 제한이나 특별한 의미가있는 상황에서 문자를 이스케이프 처리 할 수 ​​있습니다.
ru: В большинстве случаев вы можете избежать символов в ситуациях,когда они имеют ограничения или особый смысл.
zh_cn: 在大多数情况下,你可能会在有限制或特殊意义的语境中转义字符。

source: In practice many sites use <code>id</code> attributes starting with numbers, even though this is technically not valid HTML.
es: En la pr&aacute;ctica, muchos sitios usan atributos de <code>id</code> entificaci&oacute;n que comienzan con n&uacute;meros, a pesar de que t&eacute;cnicamente no es HTML v&aacute;lido.
ja: 実際には、これは技術的に有効なHTMLではないにもかかわらず、多くのサイトが数字で始まる <code>id</code> 属性を使用しています。
ko: 실제로 많은 사이트는 기술적으로 유효한 HTML이 아니지만 숫자로 시작하는 <code>id</code> 속성을 사용합니다.
ru: На практике многие сайты используют атрибуты <code>id</code> , начинающиеся с цифр, хотя это технически недопустимый HTML.
zh_cn: 实际上，尽管从技术上讲这不是有效的HTML，但是许多站点都使用以数字开头的 <code>id</code> 属性。

source: It appears that although colons (:) and periods (.) are valid in the HTML spec, they are invalid as id selectors in <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSS</a> so probably best avoided if you intend to use them for that purpose.
es: Parece que aunque los dos puntos (:) y los puntos (.) Son v&aacute;lidos en la especificaci&oacute;n HTML, no son v&aacute;lidos como selectores de identificaci&oacute;n en <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSS,</a> por lo que probablemente sea mejor evitarlos si tiene la intenci&oacute;n de usarlos para ese prop&oacute;sito.
ja: コロン（:)とピリオド（。）はHTML仕様では有効ですが、 <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSSの</a> IDセレクターとしては無効であるため、それらをその目的で使用する場合はおそらく避けるのが最善です。
ko: 콜론 (:)과 마침표 (.)는 HTML 스펙에서 유효하지만 <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSS</a> 에서 ID 선택 자로 유효하지 않으므로 해당 목적으로 사용하려는 경우 피하는 것이 가장 좋습니다.
ru: Похоже, что хотя двоеточия (:) и точки (.) Действительны в спецификации HTML, они недопустимы в качестве селекторов идентификаторов в <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSS,</a> поэтому лучше их избегать, если вы собираетесь использовать их для этой цели.
zh_cn: 看来，尽管冒号（:)和句点（。）在HTML规范中有效，但它们在<a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-identifier">CSS中</a>作为id选择器无效，因此，如果打算将它们用作此目的，最好避免使用。

source: Just bear in mind that using numbers, punctuation or special characters in the value of an ID may cause trouble in other contexts (e.g., CSS, JavaScript, regex).
es: Sólo hay que tener en cuenta que el uso de números,puntuación o caracteres especiales en el valor de un ID puede causar problemas en otros contextos (por ejemplo,CSS,JavaScript,regex).
ja: ただ、ID の値に数字や句読点、特殊文字を使用すると、他のコンテキスト (CSS、JavaScript、regex など)で問題が発生する可能性があることに注意してください。
ko: ID 값에 숫자, 문장 부호 또는 특수 문자를 사용하면 다른 컨텍스트 (예 : CSS, JavaScript, 정규식)에서 문제가 발생할 수 있습니다.
ru: Просто имейте в виду,что использование чисел,знаков препинания или специальных символов в значении ID может вызвать проблемы в других контекстах (например,CSS,JavaScript,regex).
zh_cn: 请记住,在ID的值中使用数字、标点符号或特殊字符可能会在其他语境下(如CSS、JavaScript、regex)造成麻烦。

source: Keeping in mind that ID must be unique, ie. there must not be multiple elements in a document that have the same id value.
es: Teniendo en cuenta que la identificación debe ser única,es decir,no debe haber múltiples elementos en un documento que tengan el mismo valor de identificación.
ja: IDは一意でなければならないことを念頭に置いてください。つまり、ドキュメント内に同じid値を持つ複数の要素があってはなりません。
ko: ID는 고유해야합니다. 동일한 id 값을 가진 문서에 여러 요소가 없어야합니다.
ru: Помните,что ID должен быть уникальным,т.е.в документе не должно быть нескольких элементов,имеющих одно и то же значение ID.
zh_cn: 记住,ID必须是唯一的,即一个文档中不能有多个元素具有相同的id值。

source: May contain <code>-</code> (hyphen), <code>_</code> (underscore), <code>:</code> (colon) and <code>.</code> (period)
es: Puede contener <code>-</code> (gui&oacute;n), <code>_</code> (gui&oacute;n bajo),: (dos puntos) y <code>.</code> (per&iacute;odo)
ja: <code>-</code> （ハイフン）、 <code>_</code> （アンダースコア）、 <code>:</code> (コロン）、. （限目）
ko: <code>-</code> (하이픈), <code>_</code> (밑줄), <code>:</code> ( 콜론) 및을 포함 할 수 <code>.</code> (기간)
ru: Может содержать <code>-</code> (дефис), <code>_</code> (подчеркивание),: (двоеточие) и <code>.</code> (Период)
zh_cn: 可能包含 <code>-</code> （连字符）， <code>_</code> （下划线）， <code>:</code> (冒号）和 <code>.</code> （期）

source: More info:
es: Más información:
ja: 詳細はこちら
ko: 더 많은 정보:
ru: Больше информации:
zh_cn: 更多信息。

source: Must Start with A-Z or a-z characters
es: Debe comenzar con los caracteres de la A a la Z o de la A a la Z
ja: A-Zまたはa-z文字で始まる必要があります。
ko: AZ 또는 az 문자로 시작해야합니다
ru: Должны начинаться с символов A-Z или a-z.
zh_cn: 必须以A-Z或a-Z字符开头

source: No spaces, must begin with at least a char from a to z and 0 to 9.
es: Sin espacios,debe comenzar con al menos un carácter de la a a la z y de la 0 a la 9.
ja: スペースがなく、少なくともaからzまでの文字と0から9までの文字で始まる必要があります。
ko: 공백이 없으며 a부터 z까지, 0에서 9까지의 문자로 시작해야합니다.
ru: Без пробелов,должен начинаться как минимум с символа char от a до z и от 0 до 9.
zh_cn: 没有空格,必须至少以a到z和0到9之间的char开头。

source: Note: There are no other restrictions on what form an ID can take; in particular, IDs can consist of just digits, start with a digit, start with an underscore, consist of just punctuation, etc.
es: Nota:No hay otras restricciones en cuanto a la forma que puede adoptar una identificación;en particular,las identificaciones pueden consistir sólo en dígitos,comenzar con un dígito,comenzar con un guión bajo,consistir sólo en puntuación,etc.
ja: 特に、IDは数字だけで構成されていたり、数字で始まっていたり、アンダースコアで始まっていたり、句読点だけで構成されていたりと、他にも制限はありません。
ko: 참고 : ID가 취할 수있는 양식에는 다른 제한이 없습니다. 특히 ID는 숫자로만 구성되고, 숫자로 시작하고, 밑줄로 시작하고, 구두점만으로 구성 될 수 있습니다.
ru: Примечание:Нет никаких других ограничений на то,какую форму может принять ID;в частности,ID может состоять только из цифр,начинаться с цифры,начинаться с подчеркивания,состоять только из знаков препинания и т.д.
zh_cn: 注:对于ID的形式没有其他限制;特别是,ID可以由数字组成、以数字开头、以下划线开头、仅由标点符号组成等。

source: On the other hand, there is the class-element. Just like ID, it can appear many times, but the value may be used over and over again.
es: Por otro lado,está el elemento de clase.Al igual que la identificación,puede aparecer muchas veces,pero el valor puede ser usado una y otra vez.
ja: 一方、class-elementというものがあります。IDと同様に何度も出現しますが、値が何度も使われる可能性があります。
ko: 반면에 클래스 요소가 있습니다. ID와 마찬가지로 여러 번 나타날 수 있지만 값은 계속해서 사용될 수 있습니다.
ru: С другой стороны,есть класс-элемент.Как и ID,он может появляться много раз,но значение может использоваться снова и снова.
zh_cn: 另一方面,还有一个类元素。就像ID一样,它可以出现很多次,但是这个值可能会被反复使用。

source: Read about: <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https://mathiasbynens.be/notes/javascript-identifiers-es6</a>
es: Lea sobre: <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https://mathiasbynens.be/notes/javascript-identifiers-es6</a>
ja: について読む： <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https</a> : //mathiasbynens.be/notes/javascript-identifiers-es6
ko: <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https://mathiasbynens.be/notes/javascript-identifiers-es6</a> 에 대해 읽어보십시오.
ru: Читайте о: <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https://mathiasbynens.be/notes/javascript-identifiers-es6</a>
zh_cn: 了解更多信息： <a href="https://mathiasbynens.be/notes/javascript-identifiers-es6">https</a> : //mathiasbynens.be/notes/javascript-identifiers-es6

source: Selectors in jQuery API (see bottom note)
es: Selectores en jQuery API (ver nota inferior)
ja: jQuery API のセレクタ (下のメモを参照)
ko: jQuery API의 선택기 (아래 참고 참조)
ru: Селекторы в jQuery API (см.примечание внизу)
zh_cn: jQuery API中的选择器(见底部说明

source: Similar rules apply to classes (except for the uniqueness, of course).
es: Se aplican reglas similares a las clases (excepto por la singularidad,por supuesto).
ja: クラスにも同様のルールが適用されます(もちろん独自性は除きます)。
ko: 비슷한 규칙이 수업에 적용됩니다 (물론 고유성을 제외하고).
ru: Аналогичные правила применимы и к классам (за исключением,конечно,уникальности).
zh_cn: 类似的规则也适用于班级(当然,唯一性除外)。

source: Since <em>ES2015</em> we can as well use -almost- all <strong>unicode characters</strong> for ID's, if the document charset is set to UTF8.
es: Desde <em>ES2015 tambi&eacute;n</em> podemos usar -casi- todos los <strong>caracteres unicode</strong> para los ID, si el conjunto de caracteres del documento est&aacute; configurado en UTF8.
ja: <em>ES2015</em>以降、ドキュメントの文字セットがUTF8に設定されている場合は、IDにほとんどすべての<strong>Unicode文字</strong>を使用することもできます。
ko: <em>ES2015</em> 이후로 문서 문자셋이 UTF8로 설정되면 ID에 거의 모든 <strong>유니 코드 문자</strong> 를 사용할 수 있습니다.
ru: Начиная с <em>ES2015,</em> мы также можем использовать почти все <strong>символы</strong> Юникода для идентификаторов, если кодировка документа установлена ​​в UTF8.
zh_cn: 从<em>ES2015开始</em> ，如果文档字符集设置为UTF8，我们<em>几乎</em>也可以将所有<strong>Unicode字符</strong>用作ID。

source: So the value can be all digits, just one digit, just punctuation characters, include special characters, whatever. Just no whitespace. This is very different from HTML4.
es: Así que el valor puede ser todos los dígitos,sólo un dígito,sólo caracteres de puntuación,incluir caracteres especiales,lo que sea.Sólo que sin espacios en blanco.Esto es muy diferente de HTML4.
ja: そのため、値はすべての数字でも、一桁でも、句読点のみでも、特殊文字を含んでも、何でも構いません。空白がないだけです。これは HTML4 とは大きく異なります。
ko: 따라서 값은 모든 숫자, 한 자릿수, 문장 부호 문자 일 수 있으며 특수 문자를 포함 할 수 있습니다. 공백이 없습니다. 이것은 HTML4와는 매우 다릅니다.
ru: Таким образом,значение может быть все цифры,только одна цифра,только знаки препинания,включать специальные символы,что угодно.Только без пробелов.Это очень отличается от HTML4.
zh_cn: 因此,值可以是所有的数字,只需一个数字,只需一个标点符号,包括特殊字符,什么都可以。只是没有空格。这和HTML4有很大的区别。

source: Stick to A-Z of any case, numbers, underscores and hyphens. And as said above, make sure your ids are unique.
es: Apéguese a la A-Z de cualquier caso,números,subrayados y guiones.Y como se dijo anteriormente,asegúrense de que sus identificaciones sean únicas.
ja: 任意のケース、数字、アンダースコア、ハイフンのA-Zに固執する。そして、上記のように、あなたのIDがユニークであることを確認してください。
ko: 모든 경우, 숫자, 밑줄 및 하이픈을 AZ에 충실하십시오. 위에서 말했듯이 ID가 고유해야합니다.
ru: Придерживайтесь A-Z любого регистра,чисел,знаков подчеркивания и дефисов.И,как было сказано выше,убедитесь,что ваши идентификаторы уникальны.
zh_cn: 坚持使用A-Z的任何大小写、数字、下划线和连字符。如上所述,确保你的ID是唯一的。

source: Strictly it should match
es: Estrictamente debería coincidir
ja: 厳密には一致しなければならない
ko: 엄밀히 일치해야합니다
ru: Строго говоря,он должен соответствовать
zh_cn: 严格来说,它应该符合

source: Test out here: <a href="https://mothereff.in/js-variables">https://mothereff.in/js-variables</a>
es: Prueba aqu&iacute;: <a href="https://mothereff.in/js-variables">https://mothereff.in/js-variables</a>
ja: ここでテストしてください： <a href="https://mothereff.in/js-variables">https</a> : //mothereff.in/js-variables
ko: 여기에서 테스트하십시오 : <a href="https://mothereff.in/js-variables">https://mothereff.in/js-variables</a>
ru: Проверьте здесь: <a href="https://mothereff.in/js-variables">https://mothereff.in/js-variables</a>
zh_cn: 在这里测试： <a href="https://mothereff.in/js-variables">https</a> : //mothereff.in/js-variables

source: That should be your first concern.
es: Esa debería ser tu primera preocupación.
ja: それが第一の関心事のはずです。
ko: 그것이 첫 번째 관심사입니다.
ru: Это должно быть твоей первой заботой.
zh_cn: 这应该是你首先关心的问题。

source: The <a href="http://www.w3.org/html/wg/html5/#id">HTML 5 draft specification</a> loosens up the rules for the <code>id</code> and <code>name</code> attributes: they are now just opaque strings which cannot contain spaces.
es: La <a href="http://www.w3.org/html/wg/html5/#id">especificaci&oacute;n borrador de HTML 5</a> afloja las reglas para los atributos de <code>id</code> entificaci&oacute;n y <code>name</code> : ahora son solo cadenas opacas que no pueden contener espacios.
ja: <a href="http://www.w3.org/html/wg/html5/#id">HTML 5ドラフト仕様で</a>は、 <code>id</code> 属性と <code>name</code> 属性の規則が緩和されています。これらは、スペースを含むことができない単なる不透明な文字列になっています。
ko: <a href="http://www.w3.org/html/wg/html5/#id">HTML 5 초안 사양</a> 은 <code>id</code> 및 <code>name</code> 속성에 대한 규칙을 완화합니다. 이제 공백을 포함 할 수없는 불투명 한 문자열입니다.
ru: Черновая <a href="http://www.w3.org/html/wg/html5/#id">спецификация HTML 5</a> ослабляет правила для атрибутов <code>id</code> и <code>name</code> : теперь они представляют собой просто непрозрачные строки, которые не могут содержать пробелов.
zh_cn: <a href="http://www.w3.org/html/wg/html5/#id">HTML 5规范草案</a>放宽了 <code>id</code> 和 <code>name</code> 属性的规则：它们现在只是不透明的字符串，不能包含空格。

source: The <code>id</code> attribute specifies its element's unique identifier (ID).
es: El atributo <code>id</code> especifica el identificador &uacute;nico (ID) de su elemento.
ja: <code>id</code> 属性は、要素の一意の識別子（ID）を指定します。
ko: <code>id</code> 속성은 요소의 고유 식별자 (ID)를 지정합니다.
ru: Атрибут <code>id</code> указывает уникальный идентификатор своего элемента (ID).
zh_cn: <code>id</code> 属性指定其元素的唯一标识符（ID）。
