Repository: rueisnom/feedback
Catalog: xlf/33/22/89/332289.*.001.xlf
Languages: es, ja, zh_cn

source: The <code>figsize</code> tuple accepts inches so if you want to set it in centimetres you have to divide them by 2.54 have a look to <a href="https://stackoverflow.com/questions/14708695/specify-figure-size-in-centimeter-in-matplotlib">this question</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">tupla de </font></font> <code>figsize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> acepta pulgadas, por lo que si desea establecerla en cent&iacute;metros, debe dividirla por 2.54 eche un vistazo a </font></font><a href="https://stackoverflow.com/questions/14708695/specify-figure-size-in-centimeter-in-matplotlib"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta pregunta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>figsize</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは2.54でそれらを分割する必要がありセンチでそれを設定したい場合に見ていてタプルはインチを受け入れ</font></font><a href="https://stackoverflow.com/questions/14708695/specify-figure-size-in-centimeter-in-matplotlib"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、この質問を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font> <code>figsize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元组接受英寸所以，如果你想将其设置成你必须2.54分他们厘米，看一下</font></font><a href="https://stackoverflow.com/questions/14708695/specify-figure-size-in-centimeter-in-matplotlib"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The Figure class then uses this as the default value for one of its arguments.
es: La clase Figure usa entonces esto como valor por defecto para uno de sus argumentos.
ja: そして、Figure クラスはこれを引数の 1 つのデフォルト値として使用します。
zh_cn: 然后Figure类将此作为其参数之一的默认值。

source: The first link in Google for <code>'matplotlib figure size'</code> is <a href="http://www.scipy.org/Cookbook/Matplotlib/AdjustingImageSize">AdjustingImageSize</a> (<a href="https://webcache.googleusercontent.com/search?q=cache:5oqjjm8c8UMJ:https://scipy.github.io/old-wiki/pages/Cookbook/Matplotlib/AdjustingImageSize.html+&amp;cd=2&amp;hl=en&amp;ct=clnk&amp;gl=fr">Google cache of the page</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El primer enlace en Google para </font></font> <code>'matplotlib figure size'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><a href="http://www.scipy.org/Cookbook/Matplotlib/AdjustingImageSize"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AdjustingImageSize</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://webcache.googleusercontent.com/search?q=cache:5oqjjm8c8UMJ:https://scipy.github.io/old-wiki/pages/Cookbook/Matplotlib/AdjustingImageSize.html+&amp;cd=2&amp;hl=en&amp;ct=clnk&amp;gl=fr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cach&eacute; de Google de la p&aacute;gina</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>'matplotlib figure size'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に関するGoogleの最初のリンク</font><font style="vertical-align: inherit;">は</font></font><a href="http://www.scipy.org/Cookbook/Matplotlib/AdjustingImageSize"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AdjustingImageSize</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://webcache.googleusercontent.com/search?q=cache:5oqjjm8c8UMJ:https://scipy.github.io/old-wiki/pages/Cookbook/Matplotlib/AdjustingImageSize.html+&amp;cd=2&amp;hl=en&amp;ct=clnk&amp;gl=fr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ページのGoogleキャッシュ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）です。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Google中</font></font> <code>'matplotlib figure size'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的第一个链接</font><font style="vertical-align: inherit;">是</font></font><a href="http://www.scipy.org/Cookbook/Matplotlib/AdjustingImageSize"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AdjustingImageSize</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><a href="https://webcache.googleusercontent.com/search?q=cache:5oqjjm8c8UMJ:https://scipy.github.io/old-wiki/pages/Cookbook/Matplotlib/AdjustingImageSize.html+&amp;cd=2&amp;hl=en&amp;ct=clnk&amp;gl=fr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">页面的Google缓存</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: The following seems to work:
es: Lo siguiente parece funcionar:
ja: 以下のようなことができるようです。
zh_cn: 下面的方法似乎是可行的。

source: The module comments and the actual output differ.
es: Los comentarios del módulo y la salida real difieren.
ja: モジュールのコメントと実際の出力は異なります。
zh_cn: 该模块的注释和实际输出不同。

source: Then you can use:
es: Entonces puedes usar:
ja: ならば使えばいい。
zh_cn: 那么你可以使用。

source: There is also this workaround in case you want to change the size without using the figure environment. So in case you are using <a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html"><code>plt.plot()</code></a> for example, you can set a tuple with width and height.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n existe esta soluci&oacute;n alternativa en caso de que desee cambiar el tama&ntilde;o sin utilizar el entorno de la figura. </font><font style="vertical-align: inherit;">Entonces, en caso de que est&eacute; usando </font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html"> <code>plt.plot()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por ejemplo, puede establecer una tupla con ancho y alto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Figure環境を使用せずにサイズを変更したい場合に備えて、この回避策もあります。</font><font style="vertical-align: inherit;">したがって、</font><font style="vertical-align: inherit;">たとえば</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html"> <code>plt.plot()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用している場合は</font><font style="vertical-align: inherit;">、幅と高さのタプルを設定できます。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您想在不使用图形环境的情况下更改大小，也可以使用此解决方法。</font><font style="vertical-align: inherit;">因此，</font><font style="vertical-align: inherit;">例如，</font><font style="vertical-align: inherit;">如果您使用的是</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html"> <code>plt.plot()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则可以设置一个具有宽度和高度的元组。</font></font>

source: These will also immediately update your canvas, but only in Matplotlib 2.2.0 and newer.
es: Estos también actualizarán inmediatamente su lienzo,pero sólo en Matplotlib 2.2.0 y más reciente.
ja: また、これらはキャンバスをすぐに更新しますが、Matplotlib 2.2.0以降でのみ更新されます。
zh_cn: 这些也会立即更新您的画布,但仅在Matplotlib 2.2.0和更新版本中才会更新。

source: This is very useful when you plot inline (e.g. with IPython Notebook). As @asamaier noticed is preferable to not put this statement in the same cell of the imports statements.
es: Esto es muy útil cuando se traza en línea (por ejemplo,con el Cuaderno de IPython).Como @asamaier notó es preferible no poner esta declaración en la misma celda de las declaraciones de importación.
ja: これはインラインでプロットするときに非常に便利です(例:IPython Notebookで)。Asamaier氏が気づいたように、このステートメントはインポートステートメントの同じセルに置かない方が良いでしょう。
zh_cn: 当你在线绘图时,这一点非常有用(比如用IPython Notebook)。正如 @asamaier 所注意到的那样,最好不要把这个语句放在同一个单元格的导入语句中。

source: This makes the figure's width 5 inches, and its height 10 <b>inches</b>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto hace que el ancho de la figura sea de 5 pulgadas y su altura de 10 </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pulgadas</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、図の幅は5インチ、高さは10 </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インチになり</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这使图形的宽度为5英寸，高度为10 </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">英寸</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: This might also help: <a href="http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html">http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto tambi&eacute;n podr&iacute;a ayudar: </font></font><a href="http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これも役立つかもしれません：</font><a href="http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这也可能有帮助：</font><a href="http://matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//matplotlib.1069221.n5.nabble.com/Resizing-figure-windows-td11424.html</font></font>

source: This resizes the figure immediately even after the figure has been drawn (at least using Qt4Agg/TkAgg - but not MacOSX - with matplotlib 1.4.0):
es: Esto redimensiona la figura inmediatamente después de haberla dibujado (al menos usando Qt4AggTkAgg-pero no MacOSX-con matplotlib 1.4.0):
ja: これは、図が描画された直後でも図のサイズを変更します (少なくとも Qt4AggTkAgg を使用していますが、MacOSX ではなく、matplotlib 1.4.0 を使用しています)。
zh_cn: 即使是在画完图之后,也会立即调整图形的大小(至少在使用Qt4AggTkAgg--但不是MacOSX--使用matplotlib 1.4.0的matplotlib)。

source: This works well for me:
es: Esto funciona bien para mí:
ja: これは私にはよく効きます。
zh_cn: 这对我来说效果很好。

source: To increase size of your figure N times you need to insert this just before your pl.show():
es: Para aumentar el tamaño de tu figura N veces necesitas insertar esto justo antes de tu pl.show():
ja: 図のサイズを N 倍にするには、 pl.show()の直前にこれを挿入する必要があります。
zh_cn: 要将数字的大小增加N倍,你需要在pl.show()之前插入这个。

source: To propagate the size change to an existing gui window add <code>forward=True</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para propagar el cambio de tama&ntilde;o a una ventana GUI existente, agregue </font></font> <code>forward=True</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サイズの変更を既存のGUIウィンドウに反映するには、</font> <code>forward=True</code> を<font style="vertical-align: inherit;">追加</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">します。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要将大小更改传播到现有的gui窗口，请添加</font></font> <code>forward=True</code>

source: Try commenting out the <code>fig = ...</code> line
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intenta comentar la </font><font style="vertical-align: inherit;">l&iacute;nea </font></font> <code>fig = ...</code> <font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"></font> <code>fig = ...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行を</font><font style="vertical-align: inherit;">コメント化してみてください</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试注释掉</font></font> <code>fig = ...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行</font></font>

source: Two notes:
es: Dos notas:
ja: 2つの音符。
zh_cn: 两项注意:

source: USING plt.rcParams
es: UTILIZANDO plt.rcParams
ja: plt.rcParamsを使用する
zh_cn: 使用 plt.rcParams

source: You can also use:
es: También puedes usar:
ja: 使うこともできます。
zh_cn: 你也可以使用。

source: You can simply use (from <a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html">matplotlib.figure.Figure</a>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simplemente puede usar (de </font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matplotlib.figure.Figure</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは簡単に使用できます（</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matplotlib.figure.Figure</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">）：</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以简单地使用（来自</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matplotlib.figure.Figure</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: You need to set the figure size before you plot.
es: Necesitas establecer el tamaño de la figura antes de trazarla.
ja: プロットする前に図のサイズを設定する必要があります。
zh_cn: 你需要先设定人物尺寸,然后再进行绘图。

source: You need to specify <code>forward=True</code> explicitly in order to live-update your canvas in versions older than what is specified above. Note that the <code>set_figwidth</code> and <code>set_figheight</code> functions don&rsquo;t support the <code>forward</code> parameter in versions older than Matplotlib 1.5.0.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debe especificar </font></font> <code>forward=True</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> expl&iacute;citamente para actualizar en vivo su lienzo en versiones anteriores a las especificadas anteriormente. </font><font style="vertical-align: inherit;">Tenga en cuenta que las </font><font style="vertical-align: inherit;">funciones </font></font> <code>set_figwidth</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>set_figheight</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no admiten el </font><font style="vertical-align: inherit;">par&aacute;metro de </font></font> <code>forward</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en versiones anteriores a Matplotlib 1.5.0.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上で指定したものより古いバージョンでキャンバスをライブ更新するには、</font></font> <code>forward=True</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明示的に</font><font style="vertical-align: inherit;">指定する必要があります</font><font style="vertical-align: inherit;">。</font></font> <code>set_figwidth</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>set_figheight</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数は</font><font style="vertical-align: inherit;">、Matplotlib 1.5.0より</font></font> <code>forward</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バージョンで</font><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">forward</font><font style="vertical-align: inherit;">パラメーターを</font><font style="vertical-align: inherit;">サポートしない</font><font style="vertical-align: inherit;">ことに注意してください</font><font style="vertical-align: inherit;">。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您需要</font><font style="vertical-align: inherit;">明确</font><font style="vertical-align: inherit;">指定</font></font> <code>forward=True</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">才能实时更新比上面指定的版本更早的画布。</font><font style="vertical-align: inherit;">请注意，在</font><font style="vertical-align: inherit;">Matplotlib 1.5.0之前的版本</font><font style="vertical-align: inherit;">中，</font></font> <code>set_figwidth</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>set_figheight</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数不支持</font></font> <code>forward</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数。</font></font>

source: where <code>df</code> is a Pandas dataframe. Or, to use existing figure or axes
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">donde </font></font> <code>df</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un marco de datos de Pandas. </font><font style="vertical-align: inherit;">O, para usar figuras o ejes existentes</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、</font></font> <code>df</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はPandasデータフレームです。</font><font style="vertical-align: inherit;">または、既存のFigureまたはAxesを使用するには</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其中</font></font> <code>df</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是熊猫数据框。</font><font style="vertical-align: inherit;">或者，使用现有图形或轴</font></font>
