Repository: rueisnom/feedback
Catalog: xlf/33/22/89/332289.*.001.xlf
Languages: es, ja, zh_cn

source: <a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html#matplotlib.pyplot.figure">figure</a> tells you the call signature:
es: <a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html#matplotlib.pyplot.figure"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la figura</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> le indica la firma de la llamada:</font></font>
ja: <a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html#matplotlib.pyplot.figure"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">図</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、呼び出しの署名を示しています。</font></font>
zh_cn: <a href="https://matplotlib.org/api/_as_gen/matplotlib.pyplot.figure.html#matplotlib.pyplot.figure"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该图</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">告诉您呼叫签名：</font></font>

source: <a href="https://stackoverflow.com/questions/335896/how-to-complete-this-python-function-to-save-in-the-same-folder#336001">This answer</a> allows easily to combine all three images in one image file to see the difference in sizes.
es: <a href="https://stackoverflow.com/questions/335896/how-to-complete-this-python-function-to-save-in-the-same-folder#336001"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permite combinar f&aacute;cilmente las tres im&aacute;genes en un archivo de imagen para ver la diferencia de tama&ntilde;o.</font></font>
ja: <a href="https://stackoverflow.com/questions/335896/how-to-complete-this-python-function-to-save-in-the-same-folder#336001"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この答え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">により、3つの画像すべてを1つの画像ファイルに簡単に結合して、サイズの違いを確認できます。</font></font>
zh_cn: <a href="https://stackoverflow.com/questions/335896/how-to-complete-this-python-function-to-save-in-the-same-folder#336001"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过此答案，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以轻松地将所有三个图像合并到一个图像文件中，以查看大小的差异。</font></font>

source: <code>fig.set_figwidth(val)</code> or <code>fig.set_figheight(val)</code>
es: <code>fig.set_figwidth(val)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>fig.set_figheight(val)</code>
ja: <code>fig.set_figwidth(val)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>fig.set_figheight(val)</code>
zh_cn: <code>fig.set_figwidth(val)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>fig.set_figheight(val)</code>

source: <code>figure(figsize=(1,1))</code> would create an inch-by-inch image, which would be 80-by-80 pixels unless you also give a different dpi argument.
es: <code>figure(figsize=(1,1))</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> crear&iacute;a una imagen de pulgada por pulgada, que ser&iacute;a de 80 por 80 p&iacute;xeles a menos que tambi&eacute;n proporcione un argumento de dpi diferente.</font></font>
ja: <code>figure(figsize=(1,1))</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、インチ</font><font style="vertical-align: inherit;">ごとの</font><font style="vertical-align: inherit;">画像を作成します。これは、別のdpi引数も指定しない限り、80&times;80ピクセルになります。</font></font>
zh_cn: <code>figure(figsize=(1,1))</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将创建一英寸一英寸的图像，该图像将为80&times;80像素，除非您还指定了不同的dpi参数。</font></font>

source: <strong>Deprecation note:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota de desuso:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非推奨のメモ：</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">弃用说明：</font></font></strong>

source: After changing the current size, it might occur that you have to fine tune the <em>subplot layout</em>. You can do that in the figure window GUI, or by means of the command <a href="https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.subplots_adjust.html">subplots_adjust</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Despu&eacute;s de cambiar el tama&ntilde;o actual, puede ocurrir que tenga que ajustar el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dise&ntilde;o de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la </font><em><font style="vertical-align: inherit;">subtrama</font></em><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Puede hacerlo en la GUI de la ventana de figura, o mediante el comando </font></font><a href="https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.subplots_adjust.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subplots_adjust</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在のサイズを変更した後、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブプロットレイアウト</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を微調整する必要がある場合があり</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは、FigureウィンドウのGUIで、またはコマンド</font><a href="https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.subplots_adjust.html"><font style="vertical-align: inherit;">subplots_adjustを</font></a><font style="vertical-align: inherit;">使用して行うことができます。</font></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改当前大小后，可能需要微调</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子图布局</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您可以在图形窗口GUI中执行此操作，也可以通过命令</font></font><a href="https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.subplots_adjust.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subplots_adjust来执行此操作</font></font></a>

source: Another option, to use the rc() function in matplotlib (the unit is inch)
es: Otra opción,usar la función rc()en matplotlib (la unidad es en pulgadas)
ja: 別のオプションとして、matplotlib の rc()関数を使用することもできます(単位はインチです)。
zh_cn: 另一个选择,使用matplotlib中的rc()函数(单位为英寸)。

source: As of Matplotlib 2.0.0, changes to your canvas will be visible immediately, as the <code>forward</code> keyword <a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_size_inches">defaults to <code>True</code></a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de Matplotlib 2.0.0, los cambios en su lienzo ser&aacute;n visibles de inmediato, ya que la </font><font style="vertical-align: inherit;">palabra clave de </font></font> <code>forward</code> <font style="vertical-align: inherit;"></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_size_inches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">defecto es </font></font> <code>True</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Matplotlib 2.0.0以降、</font></font> <code>forward</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーワードの</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_size_inches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デフォルトは</font></font> <code>True</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なので、キャンバスへの変更はすぐに表示さ</font><font style="vertical-align: inherit;">れ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从Matplotlib 2.0.0开始，对画布的更改将立即可见，因为</font></font> <code>forward</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关键字</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_size_inches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">默认为</font></font> <code>True</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: As per the <a href="https://matplotlib.org/faq/usage_faq.html#matplotlib-pyplot-and-pylab-how-are-they-related">official Matplotlib guide</a>, usage of the <code>pylab</code> module is no longer recommended. Please consider using the <code>matplotlib.pyplot</code> module instead, as described by <a href="https://stackoverflow.com/a/41717533">this other answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Seg&uacute;n la </font></font><a href="https://matplotlib.org/faq/usage_faq.html#matplotlib-pyplot-and-pylab-how-are-they-related"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gu&iacute;a oficial de Matplotlib</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font><font style="vertical-align: inherit;">ya no se recomienda el </font><font style="vertical-align: inherit;">uso del </font><font style="vertical-align: inherit;">m&oacute;dulo </font></font> <code>pylab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Considere usar el </font><font style="vertical-align: inherit;">m&oacute;dulo </font></font> <code>matplotlib.pyplot</code> en su<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar, como se describe en </font></font><a href="https://stackoverflow.com/a/41717533"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta otra respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://matplotlib.org/faq/usage_faq.html#matplotlib-pyplot-and-pylab-how-are-they-related"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">公式のMatplotlibガイド</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に従って、</font></font> <code>pylab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モジュールの</font><font style="vertical-align: inherit;">使用は</font><font style="vertical-align: inherit;">推奨されなくなりました。</font><a href="https://stackoverflow.com/a/41717533"><font style="vertical-align: inherit;">この別の回答で</font></a><font style="vertical-align: inherit;">説明されているように、代わりに</font></font> <code>matplotlib.pyplot</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モジュールの</font><font style="vertical-align: inherit;">使用を検討してください</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="https://matplotlib.org/faq/usage_faq.html#matplotlib-pyplot-and-pylab-how-are-they-related"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">官方Matplotlib指南</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">不再建议</font><font style="vertical-align: inherit;">使用</font></font> <code>pylab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模块。</font><font style="vertical-align: inherit;">请考虑改用</font></font> <code>matplotlib.pyplot</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模块，如</font></font><a href="https://stackoverflow.com/a/41717533"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该其他答案所述</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Conversion to cm
es: Conversión a cm
ja: cmへの変換
zh_cn: 换算成厘米

source: For Older Versions
es: Para versiones más antiguas
ja: 古いバージョンの場合
zh_cn: 对于旧版本

source: For example,
es: Por ejemplo,
ja: 例えば
zh_cn: 例如:

source: Generalizing and simplifying psihodelia's answer. If you want to change the current size of the figure by a factor <code>sizefactor</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Generalizando y simplificando la respuesta de psihodelia. </font><font style="vertical-align: inherit;">Si desea cambiar el tama&ntilde;o actual de la figura por un factor de </font> <code>sizefactor</code> <font style="vertical-align: inherit;"> factor</font></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サイホデリアの答えを一般化し、簡略化します。</font><font style="vertical-align: inherit;">Figureの現在のサイズを係数</font> <code>sizefactor</code> <font style="vertical-align: inherit;">で変更する場合</font></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">概括和简化psihodelia的答案。</font><font style="vertical-align: inherit;">如果要通过系数</font> <code>sizefactor</code> <font style="vertical-align: inherit;">更改图形的当前大小</font></font><font style="vertical-align: inherit;"></font>

source: Here's a test script from the above page. It creates <code>test[1-3].png</code> files of different sizes of the same image:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay un script de prueba de la p&aacute;gina anterior. </font><font style="vertical-align: inherit;">Crea </font><font style="vertical-align: inherit;">archivos de </font></font> <code>test[1-3].png</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de diferentes tama&ntilde;os de la misma imagen:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のページのテストスクリプトを次に示します。</font><font style="vertical-align: inherit;">これは、作成し</font></font> <code>test[1-3].png</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じ画像の異なるサイズのファイル：</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是上一页的测试脚本。</font><font style="vertical-align: inherit;">它会创建</font><font style="vertical-align: inherit;">同一图像的不同大小的</font></font> <code>test[1-3].png</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文件：</font></font>

source: How do you change the size of figure drawn with matplotlib?
es: ¿Cómo se cambia el tamaño de la figura dibujada con matplotlib?
ja: matplotlibで描いた図のサイズを変更するには?
zh_cn: 如何用matplotlib改变所画图形的大小?

source: How do you change the size of figures drawn with matplotlib
es: ¿Cómo se cambia el tamaño de las figuras dibujadas con matplotlib
ja: matplotlibで描いた図形のサイズを変更する方法
zh_cn: 如何改变用matplotlib绘制的数字的大小

source: If you want to change the default settings, you could do the following:
es: Si desea cambiar la configuración predeterminada,puede hacer lo siguiente:
ja: 初期設定を変更したい場合は、以下のようにします。
zh_cn: 如果你想改变默认设置,可以进行以下操作。

source: If you want to just <a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_figheight">change the width <strong>or</strong> height</a> instead of both, you can use
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si solo desea </font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_figheight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cambiar el ancho </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">o la</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> altura en</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de ambos, puede usar</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_figheight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">幅</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高さ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を両方ではなく</font><font style="vertical-align: inherit;">単に</font><font style="vertical-align: inherit;">変更し</font><font style="vertical-align: inherit;">たい場合</font><font style="vertical-align: inherit;">は、</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您只想</font></font><a href="https://matplotlib.org/api/_as_gen/matplotlib.figure.Figure.html?highlight=set%20size%20inches#matplotlib.figure.Figure.set_figheight"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改宽度</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高度</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是两者，则可以使用</font></font>

source: If you've already got the figure created you can quickly do this:
es: Si ya tienes la figura creada,puedes hacer esto rápidamente:
ja: すでにフィギュアを作成している場合は、これをすぐに行うことができます。
zh_cn: 如果你已经制作好了人物,就可以快速完成这个任务。

source: In case you're looking for a way to change the figure size in <strong>Pandas</strong>, you could do e.g.:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En caso de que est&eacute; buscando una manera de cambiar el tama&ntilde;o de la figura en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede hacer, por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">図のサイズを変更する方法を探している場合は、次のように</font><font style="vertical-align: inherit;">できます。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您正在寻找一种方法来更改</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的图形大小</font><font style="vertical-align: inherit;">，可以执行例如：</font></font>

source: It also works well with ipython notebook.
es: También funciona bien con el cuaderno de ipython.
ja: ipythonノートとの相性も良いです。
zh_cn: 它与ipython笔记本的配合也很好。

source: Please try a simple code as following:
es: Por favor,intente un código simple como el siguiente:
ja: 以下のような簡単なコードを試してみてください。
zh_cn: 请尝试使用以下简单的代码。

source: Since Matplotlib <a href="https://github.com/matplotlib/matplotlib/issues/1369">isn't able</a> to use the metric system natively, if you want to specify the size of your figure in a reasonable unit of length such as centimeters, you can do the following (code from <a href="https://stackoverflow.com/a/22787457/395857">gns-ank</a>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como Matplotlib </font></font><a href="https://github.com/matplotlib/matplotlib/issues/1369"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no puede</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usar el sistema m&eacute;trico de forma nativa, si desea especificar el tama&ntilde;o de su figura en una unidad razonable de longitud, como cent&iacute;metros, puede hacer lo siguiente (c&oacute;digo de </font></font><a href="https://stackoverflow.com/a/22787457/395857"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gns-ank</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Matplotlib </font></font><a href="https://github.com/matplotlib/matplotlib/issues/1369"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メトリックシステムをネイティブに使用</font><font style="vertical-align: inherit;">できない</font><font style="vertical-align: inherit;">ため</font><font style="vertical-align: inherit;">、図のサイズをセンチメートルなどの適切な長さの単位で指定したい場合は、次のようにします（</font></font><a href="https://stackoverflow.com/a/22787457/395857"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gns-ankの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コード</font><font style="vertical-align: inherit;">）。</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于Matplotlib </font></font><a href="https://github.com/matplotlib/matplotlib/issues/1369"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本地使用公制，因此，如果要以合理的长度单位（例如厘米）指定图形的大小，则可以执行以下操作（来自</font></font><a href="https://stackoverflow.com/a/22787457/395857"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gns-ank的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码</font><font style="vertical-align: inherit;">）：</font></font>
