Repository: rueisnom/feedback
Catalog: xlf/34/81/70/348170.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: so, you will be in the previous state. Specified will be again in untracked list (previous state).
es: así que,estarás en el estado anterior.Especificado estará de nuevo en la lista de no rastreados (estado anterior).
ja: で指定されているので、前の状態になります。指定した場合は、再び未追跡リスト(前の状態)になります。
ko: 따라서 이전 상태에있게됩니다. 지정되지 않은 목록에 다시 지정됩니다 (이전 상태).
ru: так что ты будешь в прежнем состоянии.Указанное снова будет в неопознанном списке (в предыдущем состоянии).
zh_cn: 所以,你将在之前的状态。指定将再次在未跟踪的列表中(以前的状态)。

source: to add parts of files.
es: para añadir partes de archivos.
ja: を使用して、ファイルのパーツを追加します。
ko: 파일의 일부를 추가합니다.
ru: чтобы добавить части файлов.
zh_cn: 以添加部分文件。

source: to remove everything and start again. Didn't work though, because while <code>add .</code> is recursive, turns out <code>rm</code> needs <code>-r</code> to recurse. Sigh.
es: para eliminar todo y comenzar de nuevo. Sin embargo, no funcion&oacute;, porque si bien <code>add .</code> es recursivo, resulta que <code>rm</code> necesita <code>-r</code> para recurrir. Suspiro.
ja: すべてを削除してやり直します。 しかし、動作しませんでした <code>add .</code> 再帰的で、 <code>rm</code> が <code>-r</code> を再帰的に実行する必要があることが判明しました。 はぁ。
ko: 모든 것을 제거하고 다시 시작하십시오. <code>add .</code> 동안 때문에 작동하지 않았습니다 . 재귀 적이며, 재귀하기 위해 <code>rm</code> 필요 <code>-r</code> 을 나타냅니다. 한숨.
ru: удалить все и начать заново. Не сработало, потому что, хотя <code>add .</code> является рекурсивным, оказывается, <code>rm</code> нуждается в <code>-r</code> для рекурсии. Вздох.
zh_cn: 删除所有内容，然后重新开始。 不过没有用，因为在 <code>add .</code> 是递归的，结果表明 <code>rm</code> 需要 <code>-r</code> 来递归。 叹。

source: which will remove it from the current index (the "about to be committed" list) without changing anything else.
es: que lo eliminará del índice actual (la lista de "a punto de comprometerse")sin cambiar nada más.
ja: これは、他に何も変更せずに現在のインデックス("about to be committed" リスト)から削除します。
ko: 다른 것을 변경하지 않고 현재 색인 ( "커밋 예정"목록)에서 제거합니다.
ru: который удалит его из текущего индекса (списка "скоро будет зафиксирован"),не изменяя ничего другого.
zh_cn: 会将其从当前索引("即将提交 "列表)中删除,而不会改变其他任何东西。

source: will "un-add" everything you've added from your current directory recursively
es: "des-añadirá" todo lo que has añadido de tu directorio actual de forma recursiva
ja: は現在のディレクトリから再帰的に追加したものをすべて "元に戻す "ことができます。
ko: 현재 디렉토리에서 추가 한 모든 내용을 재귀 적으로 "추가 취소"합니다.
ru: будет рекурсивно "распаковывать" все,что вы добавили из вашей текущей директории.
zh_cn: 将递归地 "取消 "你从当前目录中添加的所有内容。

source: without any file name to unstage all due changes. This can come in handy when there are too many files to be listed one by one in a reasonable amount of time.
es: sin ningún nombre de archivo para desentrañar todos los cambios debidos.Esto puede ser útil cuando hay demasiados archivos para enumerarlos uno por uno en un tiempo razonable.
ja: を使用して、ファイル名を指定せずに、すべての変更をアンステージすることができます。これは、ファイルが多すぎて妥当な時間内に一つずつリストアップするのが難しい場合に便利です。
ko: 파일 이름이 없어서 모든 변경 사항을 취소 할 수 있습니다. 합리적인 시간에 하나씩 나열 할 파일이 너무 많을 때 유용합니다.
ru: без указания имени файла,чтобы отменить все необходимые изменения.Это может пригодиться,когда слишком много файлов,чтобы их можно было перечислить по одному в течение разумного периода времени.
zh_cn: 没有任何文件名的情况下,取消了所有到期的更改。当文件太多,无法在合理的时间内逐一列出时,这个功能就会派上用场。
