Repository: rueisnom/feedback
Catalog: xlf/34/81/70/348170.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Git will tell you what is staged, etc., including instructions on how to unstage:
es: Git te dirá lo que se escenifica,etc.,incluyendo instrucciones sobre cómo desescenificar:
ja: Gitでは、ステージの解除方法なども含めて、何がステージされているのかを教えてくれます。
ko: Git은 스테이지를 해제하는 방법에 대한 지시 사항을 포함하여 스테이지 등을 알려줍니다.
ru: Git расскажет вам,что такое инсценировка и т.д.,включая инструкции по нестабильности:
zh_cn: Git会告诉你什么是阶段性的等等,包括如何解除阶段性的指示。

source: Going into interactive add to undo your add (the commands typed at git here are "r" (revert), "1" (first entry in the list revert shows), 'return' to drop out of revert mode, and "q" (quit):
es: Entrar en add interactivo para deshacer tu add (los comandos escritos en git aquí son "r" (revertir),"1" (primera entrada de la lista que muestra revertir),"return" para salir del modo revertir,y "q" (salir):
ja: 追加を元に戻すためにインタラクティブaddに入る(ここでgitで入力したコマンドは「r」(revert)、「1」(リストの最初のエントリがrevertで表示される)、revertモードからドロップアウトするための「return」、そして「q」(quit)です。
ko: 대화식 add로 들어가서 add 명령을 취소하려면 (git에 입력 한 명령은 "r"(revert), "1"(목록 revert가 표시되는 첫 번째 항목), 'return'을 눌러 되돌리기 모드에서 빠져 나오고, "q") (떠나다):
ru: Переходим к интерактивному добавлению,чтобы отменить добавление (команды,набранные в git'е:"r" (revert),"1" (первая запись в списке возвращается),"return",чтобы выйти из режима возврата,и "q" (quit):
zh_cn: 进入交互式添加来撤销你的添加(这里在git键入的命令是 "r"(还原),"1"(列表中的第一个条目还原显示),"return "退出还原模式,"q"(退出)。

source: Here's a way to avoid this vexing problem when you start a new project:
es: Aquí hay una manera de evitar este problema molesto cuando empiezas un nuevo proyecto:
ja: 新しいプロジェクトを始めるときに、このつらつらした問題を回避する方法をご紹介します。
ko: 새 프로젝트를 시작할 때이 문제를 피하는 방법은 다음과 같습니다.
ru: Вот способ избежать этой досадной проблемы при запуске нового проекта:
zh_cn: 这里有一个方法,当你开始一个新项目时,可以避免这个烦人的问题。

source: How do I undo 'git add' before commit
es: ¿Cómo deshago el 'git add' antes de comprometerme?
ja: コミット前に 'git add' を元に戻すにはどうすればいいですか?
ko: 커밋하기 전에 'git add'를 실행 취소하는 방법
ru: Как мне отменить "git add" перед коммитом.
zh_cn: 提交前如何撤销 "git add"?

source: I created a new file and added it to Git. Then I unstaged it using the Sourcetree GUI. This is the result:
es: He creado un nuevo archivo y lo he añadido a Git.Luego lo descompuse usando la interfaz gráfica de Sourcetree.Este es el resultado:
ja: 新しいファイルを作成してGitに追加しました。それからSourcetree GUIを使ってアンステージしました。その結果がこれです。
ko: 새 파일을 만들어 Git에 추가했습니다. 그런 다음 Sourcetree GUI를 사용하여 스테이지를 해제했습니다. 결과는 다음과 같습니다.
ru: Я создал новый файл и добавил его в Git.Затем я размонтировал его,используя Sourcetree GUI.Вот результат:
zh_cn: 我创建了一个新文件并将其添加到Git中。然后,我使用Sourcetree GUI解压了它。结果是这样的。

source: I find Git does a pretty good job of nudging me to do the right thing in situations like this.
es: Encuentro que Git hace un buen trabajo al empujarme a hacer lo correcto en situaciones como esta.
ja: このような状況で正しいことをするように、Gitは私を後押ししてくれます。
ko: 나는 Git이 이런 상황에서 옳은 일을하도록 방해하는 꽤 좋은 일을한다는 것을 알았다.
ru: Я нахожу,что Гит делает довольно хорошую работу,подталкивая меня делать правильные вещи в таких ситуациях,как эта.
zh_cn: 我发现在这种情况下,Git的工作做得相当不错,可以引导我做正确的事情。

source: I found this great little post that actually adds the Git command (well, an alias) for <code>git unadd</code>: see <em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em> for details or..
es: Encontr&eacute; esta peque&ntilde;a publicaci&oacute;n que realmente agrega el comando Git (bueno, un alias) para <code>git unadd</code> : vea <em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em> para m&aacute;s detalles o ...
ja: 私は実際に <code>git unadd</code> のGitコマンド（まあ、エイリアス）を追加するこの素晴らしい小さな投稿を見つけました。詳細については<em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em>を参照してください。
ko: 실제로 <code>git unadd</code> 에 대한 Git 명령 (별명)을 추가하는이 위대한 작은 게시물을 발견했습니다. 자세한 내용은 <em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em> 를 참조하십시오.
ru: Я нашел этот замечательный небольшой пост, который фактически добавляет команду Git (ну, алиас) для <code>git unadd</code> : подробности смотрите в <em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em> или ..
zh_cn: 我发现了这篇很棒的小文章，实际上为 <code>git unadd</code> 添加了Git命令（还有一个别名）：有关详细信息，请参见<em><a href="https://blog.pivotal.io/labs/labs/git-unadd">git unadd</a></em> 。

source: I have created the steps in the image below in more details for you, including all steps which may happen in these cases:
es: He creado los pasos en la imagen de abajo con más detalles para usted,incluyendo todos los pasos que pueden suceder en estos casos:
ja: このような場合に起こりうるすべてのステップを含めて、下の画像のステップをあなたのために詳細に作成しました。
ko: 아래 이미지에서 이러한 경우에 발생할 수있는 모든 단계를 포함하여 자세한 내용을 아래 단계에서 만들었습니다.
ru: Я создал шаги на изображении ниже в деталях для вас,включая все шаги,которые могут произойти в этих случаях:
zh_cn: 我在下面的图片中为您详细介绍了创建步骤,包括这些情况下可能发生的所有步骤。

source: I have not yet run <code>git commit</code>. Is there a way to undo this, so these files won't be included in the commit?
es: Todav&iacute;a no he ejecutado <code>git commit</code> . &iquest;Hay alguna manera de deshacer esto, por lo que estos archivos no se incluir&aacute;n en la confirmaci&oacute;n?
ja: まだ <code>git commit</code> を実行していません。 これを元に戻す方法はあるので、これらのファイルはコミットに含まれませんか？
ko: 아직 <code>git commit</code> 을 실행하지 않았습니다. 이것을 취소 할 수있는 방법이 있습니까? 그래서이 파일들은 커밋에 포함되지 않습니까?
ru: Я еще не запускал <code>git commit</code> . Есть ли способ отменить это, чтобы эти файлы не были включены в коммит?
zh_cn: 我还没有运行 <code>git commit</code> 。 有一种方法可以撤消此操作，以便这些文件不会包含在提交中？

source: I mistakenly added files to Git using the command:
es: Añadí por error archivos a Git usando el comando:
ja: コマンドを使って間違ってGitにファイルを追加してしまいました。
ko: 명령을 사용하여 실수로 Git에 파일을 추가했습니다.
ru: Я ошибочно добавил файлы в Git с помощью команды:
zh_cn: 我错误地使用命令将文件添加到Git中。

source: I mistakenly added files using the command...
es: Añadí por error los archivos usando el comando...
ja: 間違ってコマンドを使ってファイルを追加してしまいました...。
ko: 명령을 사용하여 실수로 파일을 추가했습니다 ...
ru: Я ошибочно добавил файлы с помощью команды...
zh_cn: 我错误地使用命令添加文件.....

source: I proceed to use
es: Procedo a usar
ja: を使用するように進みます。
ko: 사용을 진행합니다
ru: Я приступаю к использованию
zh_cn: 我继续使用

source: I zipped up everything to a safe place before trusting <code>git help rm</code> about the <code>--cached</code> not destroying anything (and what if I misspelled it).
es: Compr&eacute; todo en un lugar seguro antes de confiar en que la <code>git help rm</code> de <code>--cached</code> no se destruya nada (y qu&eacute; pasa si lo escrib&iacute; mal).
ja: <code>--cached</code> が何も破壊しないことについて <code>git help rm</code> を信頼する前に、すべてを安全な場所に圧縮しました（スペルを間違えた場合はどうなりますか）。
ko: <code>git help rm</code> 을 신뢰하기 전에 모든 것을 안전한 장소에 압축했습니다.
ru: Я заархивировал все в безопасное место, прежде чем доверять <code>git help rm</code> о том, что <code>--cached</code> ничего не уничтожает (и что, если я его неправильно написал).
zh_cn: 在信任 <code>git help rm</code> 关于 <code>--cached</code> 不会破坏任何内容（以及我拼错的内容该怎么办）之前，我将所有内容压缩到一个安全的地方。

source: If <code>&lt;file&gt;</code> was <strong>already tracked</strong>, <code>git add</code><strong>saves the current content</strong> (snapshot, version) to the cache. In Git, this action is still called <strong>add</strong>, (not mere <em>update</em> it), because two different versions (snapshots) of a file are regarded as two different items: hence, we are indeed adding a new item to the cache, to be eventually committed later.
es: Si <strong>ya se realiz&oacute; el seguimiento de</strong> <code>&lt;file&gt;</code> , <code>git add</code> <strong>guarda el contenido actual</strong> (instant&aacute;nea, versi&oacute;n) en la memoria cach&eacute;. En Git, esta acci&oacute;n todav&iacute;a se llama <strong>agregar</strong> , (no solo <em>actualizarla</em> ), porque dos versiones diferentes (instant&aacute;neas) de un archivo se consideran dos elementos diferentes: por lo tanto, de hecho, estamos agregando un nuevo elemento a la memoria cach&eacute;, para ser eventualmente comprometido despu&eacute;s.
ja: <code>&lt;file&gt;</code> が<strong>すでに追跡されている</strong>場合、 <code>git add</code> <strong>は現在のコンテンツ</strong> （スナップショット、バージョン）をキャッシュに<strong>保存し</strong>ます。 Gitでは、ファイルの2つの異なるバージョン（スナップショット）が2つの異なるアイテムと見なされるため、このアクションは引き続き<strong>add</strong>と呼ばれます（単なる<em>更新</em>ではありません）。したがって、最終的に、新しいアイテムをキャッシュに追加しています。後でコミット。
ko: <code>&lt;file&gt;</code> 이 <strong>이미 추적 된</strong> 경우 <code>git add</code> <strong>는 현재 컨텐츠</strong> (스냅 샷, 버전)를 캐시에 저장합니다. Git에서는 파일의 두 가지 버전 (스냅 샷)이 두 개의 다른 항목으로 간주되므로이 작업을 여전히 <strong>add</strong> 라고 <strong>합니다</strong> (따라서 <em>업데이트</em> 하지 않음). 따라서 실제로 캐시에 새 항목을 추가하여 결국에는 나중에 약속했다.
ru: Если <code>&lt;file&gt;</code> <strong>уже отслежен</strong> , <code>git add</code> <strong>сохраняет текущий контент</strong> (снимок, версия) в кеш. В Git это действие по-прежнему называется <strong>добавлением</strong> (а не просто <em>обновлением</em> ), поскольку две разные версии (снимки) файла рассматриваются как два разных элемента: следовательно, мы действительно добавляем новый элемент в кэш, чтобы в конечном итоге совершено позже.
zh_cn: 如果 <code>&lt;file&gt;</code> <strong>已经</strong>被<strong>跟踪</strong> ， <code>git add</code> <strong>会将当前内容</strong> （快照，版本）保存到缓存中。 在Git中，此操作仍称为<strong>add</strong> ，（不仅仅是<em>更新</em>它），因为文件的两个不同版本（快照）被视为两个不同的项目：因此，我们的确在缓存中添加了一个新项目，最终以后提交。

source: If <code>&lt;file&gt;</code> was <strong>not previously tracked</strong>, <code>git add</code><strong>adds it to the cache</strong>, with its current content.
es: Si <strong>no se realiz&oacute; un seguimiento previo de</strong> <code>&lt;file&gt;</code> , <code>git add</code> lo <strong>agrega al cach&eacute;</strong> , con su contenido actual.
ja: <code>&lt;file&gt;</code> が<strong>以前に追跡さ</strong>れて<strong>いなかった</strong>場合、 <code>git add</code> <strong>はそれを</strong>現在のコンテンツとともに<strong>キャッシュに</strong> 追加し <strong>ます</strong> 。
ko: <code>&lt;file&gt;</code> 이 <strong>이전에 추적되지 않은</strong> 경우 <code>git add</code> <strong>는</strong> 현재 컨텐츠와 함께이를 <strong>캐시에</strong> 추가 <strong>합니다</strong> .
ru: Если <code>&lt;file&gt;</code> <strong>ранее не отслеживался</strong> , <code>git add</code> <strong>добавляет его в кеш</strong> с его текущим содержимым.
zh_cn: 如果 <code>&lt;file&gt;</code> <strong>先前未被跟踪</strong> ，则 <code>git add</code> <strong>将其</strong>及其当前内容<strong>添加到缓存中</strong> 。

source: If you type:
es: Si escribes a máquina:
ja: タイプすれば
ko: 입력하면 :
ru: Если ты набираешь:
zh_cn: 如果你输入。

source: If you're on your initial commit and you can't use <code>git reset</code>, just declare "Git bankruptcy" and delete the <code>.git</code> folder and start over
es: Si est&aacute; en su confirmaci&oacute;n inicial y no puede usar <code>git reset</code> , simplemente declare "bancarrota Git" y elimine la carpeta <code>.git</code> y comience nuevamente
ja: 最初のコミット時に <code>git reset</code> を使用できない場合は、「Git破産」を宣言して <code>.git</code> フォルダーを削除し、最初からやり直してください。
ko: 초기 커밋에 있고 <code>git reset</code> 을 사용할 수 없다면 "Git 파산"을 선언하고 <code>.git</code> 폴더를 삭제하고 다시 시작하십시오.
ru: Если вы выполняете первоначальный коммит и не можете использовать <code>git reset</code> , просто объявите &laquo;Git bankruptcy&raquo;, удалите папку <code>.git</code> и начните сначала.
zh_cn: 如果您是首次提交，则不能使用 <code>git reset</code> ，只需声明&ldquo; Git破产&rdquo;并删除 <code>.git</code> 文件夹并重新开始

source: In Sourcetree you can do this easily via the GUI. You can check which command Sourcetree uses to unstage a file.
es: En Sourcetree puedes hacer esto fácilmente a través de la interfaz gráfica de usuario.Puedes comprobar qué comando utiliza Sourcetree para desensamblar un archivo.
ja: Sourcetree では GUI から簡単に行うことができます。Sourcetree がどのコマンドを使ってファイルをアンステージするかを確認することができます。
ko: Sourcetree에서는 GUI를 통해이를 쉽게 수행 할 수 있습니다. 소스 트리에서 파일을 언 스테이지하는 데 사용하는 명령을 확인할 수 있습니다.
ru: В Sourcetree это легко сделать с помощью графического интерфейса.Вы можете проверить,какую команду использует Sourcetree для нестабилизации файла.
zh_cn: 在Sourcetree中,你可以通过GUI轻松完成这个操作。你可以检查Sourcetree使用哪条命令来解压一个文件。

source: In light of this, the question is slightly ambiguous:
es: A la luz de esto,la pregunta es ligeramente ambigua:
ja: このことを考えると、やや曖昧な質問になってしまいます。
ko: 이것에 비추어, 질문은 약간 모호합니다.
ru: В свете этого вопрос несколько двусмысленен:
zh_cn: 有鉴于此,这个问题略显含糊。

source: In old versions of Git, the above commands are equivalent to <code>git reset HEAD &lt;file&gt;</code> and <code>git reset HEAD</code> respectively, and will fail if <code>HEAD</code> is undefined (because you haven't yet made any commits in your repository) or ambiguous (because you created a branch called <code>HEAD</code>, which is a stupid thing that you shouldn't do). This <a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">was changed in Git 1.8.2</a>, though, so in modern versions of Git you can use the commands above even prior to making your first commit:
es: En versiones anteriores de Git, los comandos anteriores son equivalentes a <code>git reset HEAD &lt;file&gt;</code> y <code>git reset HEAD</code> respectivamente, y fallar&aacute;n si <code>HEAD</code> no est&aacute; definido (porque a&uacute;n no ha realizado ninguna confirmaci&oacute;n en su repositorio) o ambiguo (porque cre&oacute; una rama llamada <code>HEAD</code> , que es algo est&uacute;pido que no debes hacer). Sin embargo, esto <a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">se cambi&oacute; en Git 1.8.2</a> , por lo que en las versiones modernas de Git puede usar los comandos anteriores incluso antes de realizar su primera confirmaci&oacute;n:
ja: Gitの古いバージョンでは、上記のコマンドはそれぞれ <code>git reset HEAD &lt;file&gt;</code> および <code>git reset HEAD</code> と同等であり、 <code>HEAD</code> が未定義の場合（リポジトリでまだコミットを行っていないため）またはあいまいな場合（ため） <code>HEAD</code> と呼ばれるブランチを作成しましたが、これはあなたがしてはいけない愚かなことです）。 ただし、これ<a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">はGit 1.8.2</a>で変更されたため、最新バージョンのGitでは 、最初のコミットを行う前でも上記のコマンドを使用できます。
ko: 이전 버전의 Git에서 위의 명령은 <code>git reset HEAD &lt;file&gt;</code> 및 <code>git reset HEAD</code> 와 각각 동일하며 <code>HEAD</code> 가 정의되지 않았거나 (저장소에서 커밋하지 않았기 때문에) HEAD 가 정의되지 않은 경우 (실제로 커밋하지 않았기 때문에) 실패합니다. <code>HEAD</code> 라는 브랜치를 만들었습니다. 그러나 이것은 <a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">Git 1.8.2에서 변경</a> 되었으므로 최신 버전의 Git에서는 처음 커밋하기 전에도 위 명령을 사용할 수 있습니다.
ru: В старых версиях Git приведенные выше команды эквивалентны <code>git reset HEAD &lt;file&gt;</code> и <code>git reset HEAD</code> соответственно и завершатся неудачей, если <code>HEAD</code> не определен (потому что вы еще не сделали никаких коммитов в своем хранилище) или неоднозначными (потому что вы создал ветку под названием <code>HEAD</code> , а это глупость, которую вы не должны делать). Это <a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">было изменено в Git 1.8.2</a> , поэтому в современных версиях Git вы можете использовать приведенные выше команды даже до того, как сделать первый коммит:
zh_cn: 在旧版本的Git中，上述命令分别等效于 <code>git reset HEAD &lt;file&gt;</code> 和 <code>git reset HEAD</code> ，如果 <code>HEAD</code> 未定义（因为尚未在存储库中进行任何提交）或模棱两可（因为创建了一个名为 <code>HEAD</code> 的分支，这是愚蠢的事情，您不应该这样做）。 不过， <a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/RelNotes/1.8.2.txt#n179">在Git 1.8.2中对此进行了更改</a> ，因此在现代版本的Git中，甚至可以在进行首次提交之前使用上述命令：

source: It further turns out that there's <a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">a bug logged</a> against the unhelpfulness of this in the mailing list.
es: Resulta que hay <a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">un error registrado</a> contra la inutilidad de esto en la lista de correo.
ja: さらに、これの役に立たないことに対してメーリングリストに<a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">バグが記録さ</a>れていることがわかりました。
ko: 또한 메일 링리스트에 도움이되지 않는 <a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">버그가 기록</a> 되어 있습니다.
ru: Кроме того, выясняется, что в списке рассылки <a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">зафиксирована ошибка</a> против этой бесполезности.
zh_cn: 事实证明，在邮件列表中有<a href="http://kerneltrap.org/mailarchive/git/2008/2/13/846664/thread">一个</a>针对此问题的日志记录了一个错误 。

source: It turns out that this is because the HEAD ref (branch?) doesn't exist until after the first commit. That is, you'll run into the same beginner's problem as me if your workflow, like mine, was something like:
es: Resulta que esto es porque el árbitro CABEZA (rama?)no existe hasta después del primer compromiso.Es decir,te encontrarás con el mismo problema de principiante que yo si tu flujo de trabajo,como el mío,fuera algo así como:
ja: これは、最初のコミットの後まで HEAD ref (ブランチ?)が存在しないからだとわかりました。つまり、もしあなたのワークフローが私のようなものであれば、私と同じような初心者の問題に遭遇することになるでしょう。
ko: HEAD ref (branch?)는 첫 번째 커밋 이후까지 존재하지 않기 때문입니다. 즉, 내 워크 플로가 다음과 같은 경우 초보자와 같은 문제가 발생합니다.
ru: Оказывается,это потому,что ссылка на HEAD (ветка?)существует только после первого коммита.То есть,вы столкнётесь с той же проблемой новичка,что и я,если ваш рабочий процесс,как и мой:
zh_cn: 事实证明,这是因为head ref(分支?也就是说,如果你的工作流程和我一样,你会遇到和我一样的新手问题。

source: It will reset your head with that specified file. so, if your head doesn't have it means, it will simply reset it.
es: Te reiniciará la cabeza con ese archivo especificado.Así que,si tu cabeza no tiene los medios,simplemente la reiniciará.
ja: 指定したファイルで頭をリセットしてくれるので、頭にファイルがない場合は単純にリセットしてくれます。
ko: 지정된 파일로 머리를 재설정합니다. 따라서 머리에 의미가 없으면 간단히 재설정합니다.
ru: Он сбросит вашу голову с этим указанным файлом.так что,если ваша голова не имеет этого средства,он просто сбросит его.
zh_cn: 它将重置你的头像与指定的文件,所以,如果你的头像没有它的意思,它将简单地重置它。

source: Just type <code>git reset</code> it will revert back and it is like you never typed <code>git add .</code> since your last commit. Make sure you have committed before.
es: Simplemente escriba <code>git reset</code> , se revertir&aacute; y es como si nunca hubiera escrito <code>git add .</code> desde tu &uacute;ltimo compromiso. Aseg&uacute;rese de haberse comprometido antes.
ja: <code>git reset</code> と入力するだけで元に戻り、 <code>git add .</code> 入力したことはありません。 あなたの最後のコミット以来。 以前にコミットしたことを確認してください。
ko: 그냥 <code>git reset</code> 을 입력하면 되돌릴 것이고 <code>git add .</code> 입력하지 않은 것과 같습니다 . 마지막 커밋 이후. 전에 커밋했는지 확인하십시오.
ru: Просто наберите <code>git reset</code> , он вернется обратно, и вы как будто никогда не вводили <code>git add .</code> с вашего последнего коммита. Убедитесь, что вы совершили ранее.
zh_cn: 只需输入 <code>git reset</code> ,它就会还原，就像您从未输入 <code>git add .</code> 自上次提交以来。 确保您之前已作出承诺。

source: Let's recall first what <code>git add &lt;file&gt;</code> actually does:
es: Recordemos primero qu&eacute; hace realmente <code>git add &lt;file&gt;</code> :
ja: 最初に <code>git add &lt;file&gt;</code> が実際に行うことを思い出してみましょう：
ko: <code>git add &lt;file&gt;</code> 이 실제로 무엇을하는지 먼저 생각해 보자 :
ru: Давайте сначала вспомним, что на самом деле делает <code>git add &lt;file&gt;</code> :
zh_cn: 让我们首先回顾一下 <code>git add &lt;file&gt;</code> 的实际作用：

source: Maybe Git has evolved since you posted your question.
es: Tal vez Git ha evolucionado desde que publicó su pregunta.
ja: もしかしたら、あなたが質問を投稿した時からGitは進化しているのかもしれません。
ko: 아마 Git은 질문을 게시 한 후 진화했을 것입니다.
ru: Может быть,Гит эволюционировал с тех пор,как ты задал свой вопрос.
zh_cn: 也许自从你发布问题后,Git已经进化了。

source: Note that if you fail to specify a revision then you have to include a separator. Example from my console:
es: Tengan en cuenta que si no especifican una revisión,entonces tienen que incluir un separador.Ejemplo de mi consola:
ja: リビジョンの指定に失敗した場合は、区切り文字を含めなければならないことに注意してください。私のコンソールからの例です。
ko: 개정을 지정하지 않으면 구분 기호를 포함해야합니다. 내 콘솔의 예 :
ru: Заметьте,что если вы не укажете ревизию,то вы должны включить разделитель.Пример с моей консоли:
zh_cn: 注意,如果你没有指定一个版本,那么你必须包含一个分隔符。我的控制台中的例子。

source: Note the warnings elsewhere here - <code>git rm</code> deletes your local working copy of the file, but <em>not</em> if you use <strong>--cached</strong>. Here's the result of <code>git help rm</code>:
es: Tenga en cuenta las advertencias en otro lugar aqu&iacute;: <code>git rm</code> elimina su copia de trabajo local del archivo, pero <em>no</em> si usa <strong>--cached</strong> . Aqu&iacute; est&aacute; el resultado de <code>git help rm</code> :
ja: ここの他の場所の警告に注意してください <code>git rm</code> はファイルのローカルの作業コピーを削除しますが、-- cachedを使用する場合は削除し<em>ません</em> 。 <code>git help rm</code> の結果は次のとおりです。
ko: 다른 곳의 경고 <code>git rm</code> 은 파일의 로컬 작업 복사본을 삭제하지만 <strong>--cached</strong> 를 사용하는 경우는 삭제 <em>하지 않습니다</em> . <code>git help rm</code> 의 결과는 다음과 같습니다.
ru: Обратите внимание на предупреждения в другом месте здесь - <code>git rm</code> удаляет вашу локальную рабочую копию файла, но <em>не</em> если вы используете <strong>--cached</strong> . Вот результат работы <code>git help rm</code> :
zh_cn: 请注意此处其他地方的警告 <code>git rm</code> 删除文件的本地工作副本，但如果使用<strong>--cached则</strong> <em>不会</em>删除。 这是 <code>git help rm</code> 的结果：

source: Note: <strong>checkout</strong> changes the code in the files and moves to the last updated (committed) state. <strong>reset</strong> doesn't change the codes; it just resets the header.
es: Nota: el <strong>pago</strong> cambia el c&oacute;digo de los archivos y pasa al &uacute;ltimo estado actualizado (comprometido). <strong>restablecer</strong> no cambia los c&oacute;digos; solo restablece el encabezado.
ja: 注： <strong>チェックアウト</strong>により、ファイル内のコードが変更され、最後に更新された（コミットされた）状態に移行します。 <strong>リセット</strong>はコードを変更しません。 ヘッダーをリセットするだけです。
ko: 참고 : <strong>체크 아웃</strong> 은 파일의 코드를 변경하고 마지막으로 업데이트 된 (커밋 된) 상태로 이동합니다. <strong>reset</strong> 은 코드를 변경하지 않습니다. 그냥 헤더를 재설정합니다.
ru: Примечание: <strong>checkout</strong> изменяет код в файлах и переходит в последнее обновленное (подтвержденное) состояние. <strong>сброс</strong> не меняет коды; это просто сбрасывает заголовок.
zh_cn: 注意： <strong>检出会</strong>更改文件中的代码，并移至上次更新（提交）状态。 <strong>重置</strong>不会更改代码； 它只是重置标题。

source: Now I want to undo this add, before commit, <code>git reset newFile.txt</code>:
es: Ahora quiero deshacer este complemento, antes de confirmar, <code>git reset newFile.txt</code> :
ja: この追加を元に戻したいので、コミットする前に <code>git reset newFile.txt</code> ：
ko: 이제 커밋 전에 <code>git reset newFile.txt</code> 추가를 취소하고 싶습니다.
ru: Теперь я хочу отменить это добавление перед коммитом, <code>git reset newFile.txt</code> :
zh_cn: 现在我想撤消此添加，在提交之前， <code>git reset newFile.txt</code> ：

source: Now create a .gitignore file (even if it's empty).
es: Ahora crea un archivo .gitignore (aunque esté vacío).
ja: ここで、.gitignoreファイルを作成します(空であっても構いません)。
ko: 이제 비어있는 경우에도 .gitignore 파일을 만듭니다.
ru: Теперь создайте файл .gitignore (даже если он пустой).
zh_cn: 现在创建一个.gitignore文件(即使它是空的)。

source: Now you can
es: Ahora puedes
ja: 今、あなたはすることができます。
ko: 지금 당신은 할 수 있습니다
ru: Теперь ты можешь
zh_cn: 现在,你可以

source: Now, you can try:
es: Ahora,puedes intentarlo:
ja: さあ、やってみてください。
ko: 이제 시도해 볼 수 있습니다 :
ru: Теперь ты можешь попробовать:
zh_cn: 现在,你可以试试了。
