Repository: rueisnom/feedback
Catalog: xlf/34/81/70/348170.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "git reset" (without options or parameters) used to error out when you do not have any commits in your history, but it now gives you an empty index (to match non-existent commit you are not even on).
es: "git reset" (sin opciones ni parámetros)utilizado para dar error cuando no tienes ninguna confirmación en tu historial,pero ahora te da un índice vacío (para coincidir con una confirmación inexistente en la que ni siquiera estás).
ja: "git reset" (オプションやパラメータを指定せずに)は、履歴にコミットがない場合にエラーになっていましたが、今では空のインデックスを返してくれます (存在しないコミットにマッチするように)。
ko: 히스토리에 커밋이 없을 때 오류를 발생시키는 데 사용되는 "git reset"(옵션 또는 매개 변수 없음)이 있지만 현재 존재하지 않는 커밋과 일치하지 않는 빈 인덱스를 제공합니다.
ru: "git reset" (без опций и параметров),используемый для ошибки,когда у вас нет никаких коммитов в истории,но теперь он даёт вам пустой индекс (чтобы соответствовать несуществующему коммиту,на котором вы даже не находитесь).
zh_cn: "git reset" (没有选项或参数)以前在你的历史记录中没有任何提交的时候会出错,但现在它给你一个空的索引(匹配你不存在的提交)。

source: (Git version 1.7.5.4)
es: (Git versión 1.7.5.4)
ja: (Git バージョン 1.7.5.4)
ko: (Git 버전 1.7.5.4)
ru: (Git версия 1.7.5.4)
zh_cn: (Git版本1.7.5.4)

source: (to undo my entire initial add), only to get this (not so) helpful message:
es: (para deshacer toda mi adición inicial),sólo para obtener este (no tan)útil mensaje:
ja: (最初の追加をすべて元に戻すために)、この(それほどではありませんが)参考になるメッセージを得るためだけに。
ko: (전체 초기 추가를 실행 취소하려면) 유용한 메시지 만 표시하십시오.
ru: (чтобы отменить все мое первоначальное добавление),только для того,чтобы получить это (не очень)полезное сообщение:
zh_cn: 撤消我的整个初始添加),只得到这个(不那么)有用的消息。

source: --cached Use this option to unstage and remove paths only from the index. Working tree files, whether modified or not, will be left.
es: --caché Use esta opción para despejar y eliminar rutas sólo del índice.Se dejarán los archivos del árbol de trabajo,modificados o no.
ja: --cached このオプションを使って、ステージを解除してインデックスからパスのみを削除します。作業木ファイルは、変更されているかどうかに関わらず、残されます。
ko: --cached이 옵션을 사용하면 인덱스에서만 경로를 준비 해제하고 제거 할 수 있습니다. 작업 트리 파일은 수정 여부에 관계없이 남아 있습니다.
ru: -кэшировать Используйте этот параметр для нестабильной работы и удаления путей только из индекса.Рабочие файлы дерева,независимо от того,модифицированы они или нет,будут оставлены.
zh_cn: --cached 使用这个选项,只在索引中取消缓存并删除路径。工作树文件,无论是否修改,都将被留下。

source: ... lots of crap scrolls by ...
es: ...un montón de pergaminos de mierda por ...
ja: くだらない巻物が多い
ko: ... 많은 쓰레기 스크롤 ...
ru: ...много мусорных свитков...
zh_cn: ..............大量的垃圾卷轴被......

source: <code>git add myfile.txt</code> # This will add your file into the to-be-committed list
es: <code>git add myfile.txt</code> # Esto agregar&aacute; su archivo a la lista de compromisos
ja: <code>git add myfile.txt</code> ＃これにより、ファイルがコミットされるリストに追加されます
ko: <code>git add myfile.txt</code> # 커밋 할 목록에 파일을 추가합니다
ru: <code>git add myfile.txt</code> # Это добавит ваш файл в список коммитов
zh_cn: <code>git add myfile.txt</code> ＃这会将您的文件添加到待提交列表中

source: <code>git add</code> is just an easier-to-type alias for <code>git stage</code>
es: <code>git add</code> es solo un alias m&aacute;s f&aacute;cil de escribir para la <code>git stage</code>
ja: <code>git add</code> は <code>git stage</code> タイプしやすいエイリアスです
ko: <code>git add</code> 는 <code>git stage</code> 에 대한 유형 지정이 쉬운 별칭입니다.
ru: <code>git add</code> - простой псевдоним для <code>git stage</code>
zh_cn: <code>git add</code> 只是 <code>git stage</code> 易于使用的别名

source: <code>git add</code><strong>cannot be undone</strong> - safely, in general.
es: <code>git add</code> <strong>no se puede deshacer</strong> , de manera segura, en general.
ja: <code>git add</code> <strong>は元に戻すことはできません</strong> -一般的には安全です。
ko: <code>git add</code> <strong>는</strong> 일반적으로 안전하게 <strong>취소 할 수 없습니다</strong> .
ru: <code>git add</code> <strong>нельзя отменить</strong> - безопасно, в общем.
zh_cn: <code>git add</code> <strong>无法撤消</strong> -通常来说<strong>是</strong>安全的。

source: <code>git remove</code> or <code>git rm</code> can be used for this, with the <code>--cached</code> flag. Try:
es: <code>git remove</code> o <code>git rm</code> pueden usarse para esto, con la bandera <code>--cached</code> . Tratar:
ja: <code>--cached</code> フラグを指定すると、 <code>git remove</code> または <code>git rm</code> を使用できます。 試してください：
ko: 이를 위해 <code>--cached</code> 플래그와 함께 <code>git remove</code> 또는 <code>git rm</code> 을 사용할 수 있습니다. 시험:
ru: Для этого можно использовать <code>git remove</code> или <code>git rm</code> с флагом <code>--cached</code> . Пытаться:
zh_cn: 可以使用 <code>git remove</code> 或 <code>git rm</code> ，带有 <code>--cached</code> 标志。 尝试：

source: <code>git status</code> will tell you if the file was a <strong>new file</strong> or <strong>modified</strong>:
es: <code>git status</code> le dir&aacute; si el archivo era <strong>nuevo</strong> o <strong>modificado</strong> :
ja: <code>git status</code> は、ファイルが<strong>新しいファイルである</strong>か、 <strong>変更され</strong>たかを通知します。
ko: <code>git status</code> 는 파일이 <strong>새 파일</strong> 인지 또는 <strong>수정</strong> 되었는지 알려줍니다.
ru: <code>git status</code> сообщит вам, был ли файл <strong>новым</strong> или <strong>измененным</strong> :
zh_cn: <code>git status</code> 会告诉您该文件是<strong>新文件</strong>还是已<strong>修改的</strong> <strong>文件</strong> ：

source: <em>Update</em> (what follows is my attempt to clear some confusion that can arise from the most upvoted answers):
es: <em>Actualizaci&oacute;n</em> (lo que sigue es mi intento de aclarar alguna confusi&oacute;n que pueda surgir de las respuestas m&aacute;s votadas):
ja: <em>更新</em> （以下は、最も投票された回答から生じる可能性のある混乱を解消するための私の試みです）：
ko: <em>업데이트</em> (다음은 가장 많이 답변 된 답변에서 발생할 수있는 혼란을 없애려는 나의 시도입니다) :
ru: <em>Обновление</em> (то, что следует, является моей попыткой очистить некоторую путаницу, которая может возникнуть из наиболее проголосовавших ответов):
zh_cn: <em>更新</em> （以下是我尝试清除最受好评的答案可能引起的一些混淆）：

source: <strong>For a specific file:</strong>
es: <strong>Para un archivo espec&iacute;fico:</strong>
ja: <strong>特定のファイルの場合：</strong>
ko: <strong>특정 파일의 경우 :</strong>
ru: <strong>Для конкретного файла:</strong>
zh_cn: <strong>对于特定文件：</strong>

source: <strong>For all added files:</strong>
es: <strong>Para todos los archivos agregados:</strong>
ja: <strong>追加されたすべてのファイル：</strong>
ko: <strong>추가 된 모든 파일 :</strong>
ru: <strong>Для всех добавленных файлов:</strong>
zh_cn: <strong>对于所有添加的文件：</strong>

source: <strong>If in doubt, use</strong>
es: <strong>En caso de duda, use</strong>
ja: <strong>疑わしい場合は、</strong>
ko: <strong>확실하지 않은 경우</strong>
ru: <strong>Если сомневаетесь, используйте</strong>
zh_cn: <strong>如有疑问，请使用</strong>

source: <strong>Note: Recent Git versions (1.8.4.x) have changed this message:</strong>
es: <strong>Nota: Las versiones recientes de Git (1.8.4.x) han cambiado este mensaje:</strong>
ja: <strong>注：最近のGitバージョン（1.8.4.x）では、このメッセージが変更されています。</strong>
ko: <strong>참고 : 최근 Git 버전 (1.8.4.x)에서이 메시지가 변경되었습니다.</strong>
ru: <strong>Примечание: последние версии Git (1.8.4.x) изменили это сообщение:</strong>
zh_cn: <strong>注意：最新的Git版本（1.8.4.x）更改了此消息：</strong>

source: <strong>Undo</strong> a file which has already been added is quite easy using Git. For resetting <code>myfile.txt</code>, which have already been added, use:
es: <strong>Deshacer</strong> un archivo que ya se ha agregado es bastante f&aacute;cil con Git. Para restablecer <code>myfile.txt</code> , que ya se han agregado, use:
ja: すでに追加されているファイルを<strong>元に戻すのは</strong> 、Gitを使用すると非常に簡単です。 追加済みの <code>myfile.txt</code> をリセットするには、次を使用します。
ko: Git을 사용하면 이미 추가 된 파일을 <strong>취소</strong> 할 수 있습니다. 이미 추가 된 <code>myfile.txt</code> 를 재설정하려면 다음을 사용하십시오.
ru: <strong>Отменить</strong> файл, который уже был добавлен, довольно просто с помощью Git. Для сброса <code>myfile.txt</code> , который уже был добавлен, используйте:
zh_cn: 使用Git <strong>撤消</strong>已经添加的文件非常容易。 要重置已添加的 <code>myfile.txt</code> ，请使用：

source: <strong>Warning:</strong> if you do <code>git rm --cached file</code> on a file that was <strong>modified</strong> (a file that existed before in the repository), then the file will be removed on <code>git commit</code>! It will still exist in your file system, but if anybody else pulls your commit, the file will be deleted from their work tree.
es: <strong>Advertencia:</strong> si hace <code>git rm --cached file</code> en un archivo que fue <strong>modificado</strong> (un archivo que exist&iacute;a antes en el repositorio), &iexcl;entonces el archivo se eliminar&aacute; en <code>git commit</code> ! Todav&iacute;a existir&aacute; en su sistema de archivos, pero si alguien m&aacute;s retira su confirmaci&oacute;n, el archivo se eliminar&aacute; de su &aacute;rbol de trabajo.
ja: <strong>警告：</strong> <strong>変更され</strong>たファイル（以前にリポジトリに存在していたファイル）に対して <code>git rm --cached file</code> を実行すると、そのファイルは <code>git commit</code> 時に削除されます！ それはまだファイルシステムに存在しますが、他の誰かがコミットをプルした場合、ファイルは作業ツリーから削除されます。
ko: <strong>경고 :</strong> <strong>수정 된</strong> 파일 (리포지토리에 존재했던 <code>git rm --cached file</code> 에서 git rm --cached 파일 을 수행하면 파일은 <code>git commit</code> 에서 제거됩니다! 파일 시스템에는 여전히 존재하지만 다른 사람이 커밋을 가져 오면 파일이 작업 트리에서 삭제됩니다.
ru: <strong>Предупреждение:</strong> если вы выполните <code>git rm --cached file</code> для файла, который был <strong>изменен</strong> (файл, существовавший ранее в хранилище), то этот файл будет удален при выполнении <code>git commit</code> ! Он все еще будет существовать в вашей файловой системе, но если кто-нибудь еще извлечет ваш коммит, файл будет удален из их рабочего дерева.
zh_cn: <strong>警告：</strong>如果对<strong>修改</strong>过的文件（仓库中之前存在的文件）执行 <code>git rm --cached file</code> ，则该文件将在 <code>git commit</code> 时删除！ 它仍将存在于您的文件系统中，但是如果其他人拉您的提交，该文件将从他们的工作树中删除。

source: <strong>What you did before:</strong>
es: <strong>Lo que hiciste antes:</strong>
ja: <strong>以前に行ったこと：</strong>
ko: <strong>당신이 전에 한 일 :</strong>
ru: <strong>Что вы делали раньше:</strong>
zh_cn: <strong>您之前做了什么：</strong>

source: <strong>What you want:</strong>
es: <strong>Lo que quieras:</strong>
ja: <strong>あなたが欲しいもの：</strong>
ko: <strong>당신이 원하는 것 :</strong>
ru: <strong>Что вы хотите:</strong>
zh_cn: <strong>你想要什么：</strong>

source: <sup> * (Edit: the above is practically correct, but still there can be some slightly hackish/convoluted ways for recovering changes that were staged, but not committed and then overwritten - see the comments by Johannes Matokic and iolsmit) </sup>
es: <sup>* (Editar: lo anterior es pr&aacute;cticamente correcto, pero a&uacute;n puede haber algunas formas un poco hackeadas / complicadas para recuperar los cambios que se organizaron, pero no se cometieron y luego se sobrescribieron; vea los comentarios de Johannes Matokic e iolsmit)</sup>
ja: <sup>*（編集：上記は実質的に正しいですが、ステージングされたがコミットされずに上書きされた変更を回復するための少しハック/複雑な方法がまだある可能性があります-Johannes Matokicとiolsmitによるコメントを参照してください）</sup>
ko: <sup>* (편집 : 위의 내용은 실제로 정확하지만 단계적이지만 커밋되지 않은 다음 변경 사항을 복구하는 약간의 해킹 / 복잡한 방법이있을 수 있습니다-Johannes Matokic 및 iolsmit의 의견 참조)</sup>
ru: <sup>* (Редактировать: вышеупомянутое практически правильно, но все же могут быть несколько хакерские / запутанные способы восстановления изменений, которые были поставлены, но не зафиксированы, а затем перезаписаны - см. Комментарии Йоханнеса Матокича и iolsmit)</sup>
zh_cn: <sup>*（编辑：以上内容实际上是正确的，但仍可能有一些稍作修改/令人费解的方法来恢复已上演但未提交但随后被覆盖的更改-请参阅Johannes Matokic和iolsmit的评论）</sup>

source: =&gt; fatal: Failed to resolve 'HEAD' as a valid ref.
es: =&gt; fatal: no se pudo resolver 'HEAD' como una referencia v&aacute;lida.
ja: =&gt; fatal： 'HEAD'を有効な参照として解決できませんでした。
ko: =&gt; 치명적인 : 'HEAD'를 유효한 참조로 해결하지 못했습니다.
ru: =&gt; fatal: Не удалось разрешить 'HEAD' в качестве действительного ссылки.
zh_cn: =&gt;致命：无法将&ldquo; HEAD&rdquo;解析为有效的引用。

source: =&gt; Damn, I didn't want to add all of that.
es: =&gt; Maldici&oacute;n, no quer&iacute;a agregar todo eso.
ja: =&gt;くそー、私はそれをすべて追加したくありませんでした。
ko: =&gt; 젠장, 나는 그 모든 것을 추가하고 싶지 않았습니다.
ru: =&gt; Черт, я не хотел добавлять все это.
zh_cn: =&gt;该死，我不想添加所有这些内容。

source: =&gt; find Stack Overflow - yay
es: =&gt; encontrar desbordamiento de pila - yay
ja: =&gt;スタックオーバーフローを検索-はい
ko: =&gt; 스택 오버플로 찾기-예
ru: =&gt; найти переполнение стека - ууу
zh_cn: =&gt;查找堆栈溢出-是

source: Adding the file you didn't want:
es: Añadiendo el archivo que no querías:
ja: 欲しくなかったファイルを追加しました。
ko: 원하지 않는 파일 추가 :
ru: Добавление файла,который тебе не нужен:
zh_cn: 添加你不想要的文件。

source: After you staged unwanted file(s), to undo, you can do <code>git reset</code>. <code>Head</code> is head of your file in the local and the last parameter is the name of your file.
es: Despu&eacute;s de organizar los archivos no deseados, para deshacer, puede hacer <code>git reset</code> . <code>Head</code> es la cabeza de su archivo en el local y el &uacute;ltimo par&aacute;metro es el nombre de su archivo.
ja: 不要なファイルをステージングした後、元に戻すには、 <code>git reset</code> を実行できます。 <code>Head</code> はローカルでのファイルのヘッドであり、最後のパラメーターはファイルの名前です。
ko: 원하지 않는 파일을 준비한 후 실행 취소하려면 <code>git reset</code> 을 수행 할 수 있습니다. <code>Head</code> 는 로컬의 파일 헤드이며 마지막 매개 변수는 파일 이름입니다.
ru: После того, как вы поставили ненужные файлы, чтобы отменить их, вы можете выполнить <code>git reset</code> . <code>Head</code> - это заголовок вашего файла в локальной сети, а последний параметр - это имя вашего файла.
zh_cn: 暂存不需要的文件后，要撤消，可以执行 <code>git reset</code> 。 <code>Head</code> 是本地文件的头，最后一个参数是文件名。

source: An addition to the accepted answer, if your mistakenly-added file was huge, you'll probably notice that, even after removing it from the index with '<code>git reset</code>', it still seems to occupy space in the <code>.git</code> directory.
es: Adem&aacute;s de la respuesta aceptada, si su archivo agregado por error fue enorme, probablemente notar&aacute; que, incluso despu&eacute;s de eliminarlo del &iacute;ndice con ' <code>git reset</code> ', todav&iacute;a parece ocupar espacio en el directorio <code>.git</code> .
ja: 受け入れられた回答に加えて、誤って追加したファイルが大きい場合、 ' <code>git reset</code> 'を使用してインデックスから削除した後でも、 <code>.git</code> ディレクトリのスペースを占有しているように見えることにおそらく気付くでしょう。
ko: 수락 된 답변 외에도 실수로 추가 된 파일이 <code>git reset</code> ' git reset '을 사용하여 색인에서 파일을 제거한 후에도 여전히 <code>.git</code> 디렉토리의 공간을 차지하는 것으로 보입니다.
ru: В дополнение к принятому ответу, если ваш ошибочно добавленный файл был огромным, вы, вероятно, заметите, что даже после удаления его из индекса с помощью &laquo; <code>git reset</code> &raquo; он все равно занимает место в каталоге <code>.git</code> .
zh_cn: 除了已接受的答案之外，如果错误添加的文件很大，您可能会注意到，即使使用' <code>git reset</code> '将其从索引中删除后，它似乎仍会占据 <code>.git</code> 目录中的空间。

source: And finally, we have new commands:
es: Y finalmente,tenemos nuevos comandos:
ja: そして、最後に新しいコマンドを用意しました。
ko: 마지막으로 새로운 명령이 있습니다.
ru: И,наконец,у нас появились новые команды:
zh_cn: 最后,我们还有新的命令。

source: And that the correct solution was right there in the Git status output (which, yes, I glossed over as 'crap)
es: Y que la solución correcta estaba ahí mismo en la salida de estado del Git (que,sí,pasé por alto como 'mierda')
ja: そして、正しい解決策はGitのステータス出力の中にありました。
ko: 그리고 올바른 해결책은 Git 상태 출력에 있습니다 (예, 나는 '쓰레기'로 빛났습니다)
ru: И что правильное решение было прямо там,в выводе состояния Git'а (которое,да,я проглядел как 'дерьмо').
zh_cn: 而正确的解决方案就在Git状态输出中(是的,我把它当作 "垃圾 "掩盖了)。

source: And the solution indeed is to use <code>git rm --cached FILE</code>.
es: Y la soluci&oacute;n es usar <code>git rm --cached FILE</code> .
ja: そして実際の解決策は <code>git rm --cached FILE</code> を使用することです。
ko: 그리고 해결책은 실제로 <code>git rm --cached FILE</code> 을 사용하는 것입니다.
ru: И решение действительно заключается в использовании <code>git rm --cached FILE</code> .
zh_cn: 解决方案的确是使用 <code>git rm --cached FILE</code> 。

source: And we could also run <code>git reset HEAD &lt;file&gt;</code>. This is in general preferable, because it works in both scenarios: it also does the undo when we wrongly added a version of an already tracked item.
es: Y tambi&eacute;n podr&iacute;amos ejecutar <code>git reset HEAD &lt;file&gt;</code> . En general, esto es preferible, porque funciona en ambos escenarios: tambi&eacute;n deshace cuando agregamos err&oacute;neamente una versi&oacute;n de un elemento ya rastreado.
ja: そして <code>git reset HEAD &lt;file&gt;</code> を実行することもできます 。 これは、両方のシナリオで機能するため、一般的に望ましい方法です。既に追跡されているアイテムのバージョンを誤って追加した場合にも、元に戻すことができます。
ko: 그리고 <code>git reset HEAD &lt;file&gt;</code> 을 실행할 수도 있습니다. 이는 두 시나리오에서 모두 작동하기 때문에 일반적으로 바람직합니다. 이미 추적 된 항목의 버전을 잘못 추가 한 경우 실행 취소도 수행합니다.
ru: И мы также можем запустить <code>git reset HEAD &lt;file&gt;</code> . В целом это предпочтительнее, потому что это работает в обоих сценариях: оно также отменяет действия, когда мы ошибочно добавили версию уже отслеженного элемента.
zh_cn: 我们还可以运行 <code>git reset HEAD &lt;file&gt;</code> 。 通常，这是可取的，因为它在两种情况下都有效：当我们错误地添加已跟踪项目的版本时，它也可以撤消操作。

source: Another advantage of this method is that if you run into line-ending troubles later and need to refresh all your files, it's easy:
es: Otra ventaja de este método es que si tienes problemas de fin de línea más tarde y necesitas refrescar todos tus archivos,es fácil:
ja: この方法のもう一つの利点は、後になってラインエンディングのトラブルに遭遇して、すべてのファイルをリフレッシュする必要がある場合、それは簡単です。
ko: 이 방법의 또 다른 장점은 나중에 줄 끝 문제가 발생하여 모든 파일을 새로 고치면 쉽다는 것입니다.
ru: Еще одним преимуществом этого метода является то,что если вы позже столкнетесь с проблемами при работе со строками и вам понадобится обновить все ваши файлы,то это будет просто:
zh_cn: 这种方法的另一个好处是,如果你在以后遇到行结束的问题,需要刷新所有的文件时,很容易。

source: As per many of the other answers, you can use <code>git reset</code>
es: Seg&uacute;n muchas de las otras respuestas, puede usar <code>git reset</code>
ja: 他の多くの回答と同様に、 <code>git reset</code> を使用できます
ko: 다른 많은 답변에 따라 <code>git reset</code> 을 사용할 수 있습니다
ru: Как и во многих других ответах, вы можете использовать <code>git reset</code>
zh_cn: 根据许多其他答案，您可以使用 <code>git reset</code>

source: Because it does the expected thing in both cases.
es: Porque hace lo que se espera en ambos casos.
ja: どちらの場合も期待通りのことをするからです。
ko: 두 경우 모두 예상되는 작업을 수행하기 때문입니다.
ru: Потому что в обоих случаях он делает то,что от него ожидают.
zh_cn: 因为它在这两种情况下都做了预期的事情。

source: But there are two caveats.
es: Pero hay dos advertencias.
ja: しかし、2つの注意点があります。
ko: 그러나 두 가지 경고가 있습니다.
ru: Но есть два предостережения.
zh_cn: 但有两点要注意。

source: Changed a file and used <code>git add .</code>, or <code>git add &lt;file&gt;</code>.
es: Cambi&oacute; un archivo y us&oacute; <code>git add .</code> , o <code>git add &lt;file&gt;</code> .
ja: ファイルを変更し、 <code>git add .</code> を使用しました。 、または <code>git add &lt;file&gt;</code> 。
ko: 파일을 변경하고 <code>git add .</code> 또는 <code>git add &lt;file&gt;</code> .
ru: Поменял файл и использовал <code>git add .</code> или <code>git add &lt;file&gt;</code> .
zh_cn: 更改文件并使用 <code>git add .</code> 或 <code>git add &lt;file&gt;</code> 。

source: Check out that initial commit. This will remove all your files.
es: Mira ese compromiso inicial.Esto eliminará todos tus archivos.
ja: 最初のコミットを確認してください。これですべてのファイルが削除されます。
ko: 초기 커밋을 확인하십시오. 모든 파일이 제거됩니다.
ru: Проверьте этот первоначальный коммит.Это удалит все ваши файлы.
zh_cn: 检查出初始提交。这将删除你所有的文件。

source: Choose option 3 to un add files. In my case I often want to add more than one file, and with interactive mode you can use numbers like this to add files. This will take all but 4: 1, 2, 3, and 5
es: Elija la opción 3 para desagregar los archivos.En mi caso,a menudo quiero añadir más de un archivo,y con el modo interactivo puedes usar números como este para añadir archivos.Esto tomará todo menos 4:1,2,3,y 5
ja: オプション3を選択してファイルの追加を解除します。私の場合、複数のファイルを追加したいことが多いのですが、インタラクティブモードではこのように数字を使ってファイルを追加することができます。これは4以外のすべてのファイルを取ります:1,2,3,5
ko: 옵션 3을 선택하여 파일을 추가 해제하십시오. 제 경우에는 종종 두 개 이상의 파일을 추가하고 싶습니다. 대화식 모드에서는 이와 같은 숫자를 사용하여 파일을 추가 할 수 있습니다. 4 : 1, 2, 3 및 5를 제외한 모든 시간이 걸립니다.
ru: Выберите опцию 3,чтобы распаковать файлы.В моем случае я часто хочу добавить более одного файла,и с помощью интерактивного режима вы можете использовать такие числа для добавления файлов.Это займет все,кроме 4:1,2,3 и 5.
zh_cn: 选择选项3来取消添加文件。在我的情况下,我经常想添加多个文件,用交互模式可以用数字这样的方式来添加文件。这将需要除4之外的所有文件:1、2、3和5。

source: Commit your .gitignore file.
es: Comete tu archivo .gitignore.
ja: .gitignore ファイルをコミットします。
ko: .gitignore 파일을 커밋하십시오.
ru: Запишите свой файл .gitignore.
zh_cn: 提交你的.gitignore文件。

source: Create the main directory for your new project.
es: Crea el directorio principal para tu nuevo proyecto.
ja: 新しいプロジェクトのメインディレクトリを作成します。
ko: 새 프로젝트의 기본 디렉토리를 작성하십시오.
ru: Создайте основной каталог для вашего нового проекта.
zh_cn: 为你的新项目创建主目录。

source: First: There is (as pointed out in the answer) only one scenario in which <code>git reset HEAD</code> doesn't work, but <code>git rm --cached</code> does: a new repository (no commits). But, really, this a practically irrelevant case.
es: Primero: hay (como se se&ntilde;ala en la respuesta) solo un escenario en el que <code>git reset HEAD</code> no funciona, pero <code>git rm --cached</code> s&iacute;: un nuevo repositorio (sin confirmaciones). Pero, realmente, este es un caso pr&aacute;cticamente irrelevante.
ja: 最初：（回答で指摘されているように） <code>git reset HEAD</code> が機能しないシナリオは1つだけですが、 <code>git rm --cached</code> は機能します：新しいリポジトリ（コミットなし）。 しかし、実際には、これは実際には無関係なケースです。
ko: 첫 번째 : <code>git reset HEAD</code> 가 작동하지 않지만 <code>git rm --cached</code> 가 수행하는 시나리오는 하나뿐입니다 (커밋 없음). 그러나 실제로 이것은 실제로 관련이없는 경우입니다.
ru: Первое: существует (как указано в ответе) только один сценарий, в котором <code>git reset HEAD</code> не работает, но <code>git rm --cached</code> делает: новый репозиторий (без коммитов). Но на самом деле это практически неактуальный случай.
zh_cn: 第一：（在答案中指出）只有一种情况，其中 <code>git reset HEAD</code> 不起作用，但是 <code>git rm --cached</code> 起作用：一个新的存储库（无提交）。 但是，实际上，这是一个无关紧要的案例。

source: Git has commands for every action imaginable, but it needs extensive knowledge to get things right and because of that it is counter-intuitive at best...
es: Git tiene comandos para todas las acciones imaginables,pero necesita un amplio conocimiento para hacer las cosas bien y por eso es contraintuitivo en el mejor de los casos...
ja: Git には想像できるすべてのアクションのためのコマンドがありますが、物事を正しく進めるためには広範な知識が必要で、せいぜい直観的ではありません...。
ko: 힘내 상상할 수있는 모든 행동에 대한 명령을 가지고 있지만, 물건을 올바르게 얻기 위해서는 광범위한 지식이 필요하며 그로 인해 반 직관적입니다 ...
ru: У Git'а есть команды для каждого действия,которое только можно вообразить,но он нуждается в обширных знаниях,чтобы всё исправить,и поэтому он в лучшем случае контр-интуитивно понятен...
zh_cn: Git对每一个能想到的动作都有命令,但它需要大量的知识来完成,正因为如此,它最多只能说是反其道而行之。

source: Git makes it really hard to do <code>git reset</code> if you don't have any commits. If you create a tiny initial commit just for the sake of having one, after that you can <code>git add -A</code> and <code>git reset</code> as many times as you want in order to get everything right.
es: Git hace que sea realmente dif&iacute;cil hacer <code>git reset</code> si no tienes ninguna confirmaci&oacute;n. Si creas un peque&ntilde;o commit inicial solo por el hecho de tener uno, despu&eacute;s de eso puedes <code>git add -A</code> y <code>git reset</code> tantas veces como quieras para que todo salga bien.
ja: コミットがない場合、 <code>git reset</code> はgit resetを実行することを本当に難しくします。 コミットするためだけに小さな初期コミットを作成した場合、その後、すべてを正しくするために <code>git add -A</code> と <code>git reset</code> を何度でも実行できます。
ko: Git은 커밋이 없으면 <code>git reset</code> 을 실제로하기가 어렵습니다. 하나만 가지고 작은 초기 커밋을 만들면 모든 것을 올바르게 얻기 위해 원하는만큼 <code>git add -A</code> 및 <code>git reset</code> 을 할 수 있습니다.
ru: Git сильно затрудняет <code>git reset</code> если у вас нет коммитов. Если вы создаете крошечный начальный коммит только ради его наличия, после этого вы можете <code>git add -A</code> и <code>git reset</code> столько раз, сколько вы хотите, чтобы все было правильно.
zh_cn: 如果您没有任何提交，Git使得进行 <code>git reset</code> 真的很困难。 如果您只是为了拥有一个而创建一个微小的初始提交，那么您可以根据需要进行 <code>git add -A</code> 和 <code>git reset</code> 多次，以使所有操作正确。

source: Git staging files
es: Los archivos de la puesta en escena de Git
ja: Git のステージングファイル
ko: 힘내 준비 파일
ru: Файлы Git-стадий
zh_cn: Git分期文件
