Repository: rueisnom/feedback
Catalog: xlf/34/81/70/348170.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Of course, this is not very critical if we just follow the usual lazy workflow of doing 'git add' only for adding new files (case 1), and we update new contents via the commit, <code>git commit -a</code> command.
es: Por supuesto, esto no es muy cr&iacute;tico si solo seguimos el flujo de trabajo perezoso habitual de hacer 'git add' solo para agregar nuevos archivos (caso 1), y actualizamos nuevos contenidos a trav&eacute;s del comando commit, <code>git commit -a</code> .
ja: もちろん、新しいファイルを追加するためだけに 'git add'を実行するという通常の遅延ワークフロー（ケース1）に従い、commit、 <code>git commit -a</code> コマンドを使用して新しいコンテンツを更新する場合、これはそれほど重要ではありません。
ko: 물론 새 파일을 추가하기 위해 'git add'를 수행하는 일반적인 게으른 워크 플로우를 따르고 (case 1) commit, <code>git commit -a</code> 명령을 통해 새 내용을 업데이트하는 경우 이것은 중요하지 않습니다.
ru: Конечно, это не очень важно, если мы просто следуем обычному ленивому рабочему процессу выполнения 'git add' только для добавления новых файлов (случай 1), и мы обновляем новое содержимое с помощью команды commit, <code>git commit -a</code> .
zh_cn: 当然，如果我们仅遵循通常的懒惰工作流程（仅用于添加新文件）进行&ldquo; git add&rdquo;（案例1），然后通过commit <code>git commit -a</code> 命令更新新内容，这并不是很关键。

source: Okay, now I'm back to where I started. Next time I'm going to use <code>-n</code> to do a dry run and see what will be added:
es: Bien, ahora estoy de vuelta a donde empec&eacute;. La pr&oacute;xima vez <code>-n</code> para hacer una ejecuci&oacute;n en seco y ver qu&eacute; se agregar&aacute;:
ja: さて、今は始めたところに戻っています。 次回は <code>-n</code> を使用して予行演習を行い、何が追加されるかを確認します。
ko: 이제 시작한 곳으로 돌아갑니다. 다음 번에는 <code>-n</code> 을 사용하여 드라이 런을 수행하고 추가 할 내용을 확인합니다.
ru: Хорошо, теперь я вернулся к тому, с чего начал. В следующий раз я собираюсь использовать <code>-n</code> , чтобы выполнить пробный прогон и посмотреть, что будет добавлено:
zh_cn: 好的，现在我回到了起点。 下次，我将使用 <code>-n</code> 进行空运行并查看将添加的内容：

source: Personally I use even shorter aliases:
es: Personalmente uso alias aún más cortos:
ja: 個人的にはもっと短いエイリアスを使っています。
ko: 개인적으로 나는 더 짧은 별칭을 사용합니다.
ru: Лично я использую еще более короткие псевдонимы:
zh_cn: 就我个人而言,我用的是更短的别名。

source: Pity there is no <code>git unstage</code> nor <code>git unadd</code> commands. The relevant one is harder to guess or remember, but it is pretty obvious:
es: L&aacute;stima que no haya <code>git unstage</code> ni <code>git unadd</code> . El relevante es m&aacute;s dif&iacute;cil de adivinar o recordar, pero es bastante obvio:
ja: 残念 <code>git unstage</code> 、 <code>git unadd</code> コマンドやgit unaddコマンドはありません。 関連するものを推測したり覚えたりするのは難しいですが、それはかなり明白です：
ko: <code>git unstage</code> 은 git unstage 또는 <code>git unadd</code> 명령이 없습니다. 관련있는 것은 추측하거나 기억하기가 어렵지만 매우 분명합니다.
ru: Жаль, что нет <code>git unstage</code> и <code>git unadd</code> . Соответствующий труднее угадать или запомнить, но он довольно очевиден:
zh_cn: 可惜没有 <code>git unadd</code> 或git unadd命令。 相关的难以猜测或记住，但很明显：

source: Quite opposite to this command is,
es: Todo lo contrario a este comando es,
ja: このコマンドとは真逆です。
ko: 이 명령과는 정반대입니다.
ru: Совсем напротив этой команды,
zh_cn: 与此命令截然相反的是:

source: Remove <code>&lt;file&gt;</code> from index and versioning, keeping the un-versioned file with changes in working copy:
es: Elimine <code>&lt;file&gt;</code> del &iacute;ndice y el control de versiones, manteniendo el archivo sin versi&oacute;n con cambios en la copia de trabajo:
ja: <code>&lt;file&gt;</code> をインデックスとバージョン管理から削除し、バージョン管理されていないファイルを作業コピーの変更とともに保持します。
ko: 버전이없는 파일을 작업 사본의 변경 사항과 함께 유지하면서 색인 및 버전 관리에서 <code>&lt;file&gt;</code> 을 제거하십시오.
ru: Удалите <code>&lt;file&gt;</code> из индекса и управления версиями, сохранив файл без версии с изменениями в рабочей копии:
zh_cn: 从索引和版本控制中删除 <code>&lt;file&gt;</code> ，保留未版本化的文件以及工作副本中的更改：

source: Remove <code>&lt;file&gt;</code> from working copy and versioning completely:
es: Elimine <code>&lt;file&gt;</code> de la copia de trabajo y el control de versiones por completo:
ja: 作業コピーとバージョン管理から <code>&lt;file&gt;</code> を完全に削除します 。
ko: 작업 사본 및 버전 관리에서 <code>&lt;file&gt;</code> 을 완전히 제거하십시오.
ru: Удалите <code>&lt;file&gt;</code> из рабочей копии и полностью версионируйте:
zh_cn: 从工作副本和版本中完全删除 <code>&lt;file&gt;</code> ：

source: Remove the file from the index, but keep it versioned and left with uncommitted changes in working copy:
es: Elimine el archivo del índice,pero manténgalo versionado y déjelo con cambios no comprometidos en la copia de trabajo:
ja: インデックスからファイルを削除しますが、バージョンを保持し、作業コピーにコミットされていない変更を残しておきます。
ko: 색인에서 파일을 제거하되 작업 사본에서 커밋되지 않은 변경 사항을 유지하고 버전을 유지하십시오.
ru: Удалите файл из индекса,но сохраните его версию и оставьте с нефиксированными изменениями в рабочей копии:
zh_cn: 将该文件从索引中删除,但保持版本化,并在工作拷贝中留下未签署的修改。

source: Reset the file to the last state from HEAD, undoing changes and removing them from the index:
es: Reajustar el archivo al último estado de HEAD,deshacer los cambios y eliminarlos del índice:
ja: ファイルをHEADから最後の状態にリセットし、変更を元に戻してインデックスから削除します。
ko: 변경 사항을 취소하고 색인에서 제거하여 HEAD에서 파일을 마지막 상태로 재설정하십시오.
ru: Сброс файла в последнее состояние из HEAD,отмена изменений и удаление их из индекса:
zh_cn: 将文件从HEAD重置为最后的状态,撤销更改并从索引中删除。

source: Run <code>git init</code>.
es: Ejecute <code>git init</code> .
ja: <code>git init</code> を実行します 。
ko: <code>git init</code> 을 실행하십시오.
ru: Запустите <code>git init</code> .
zh_cn: 运行 <code>git init</code> 。

source: Second: Be aware that <code>git reset HEAD</code> can't magically recover the previously cached file contents, it just resynchronises it from the HEAD. If our misguided <code>git add</code> overwrote a previous staged uncommitted version, we can't recover it. That's why, strictly speaking, we cannot undo [*].
es: Segundo: tenga en cuenta que <code>git reset HEAD</code> no puede recuperar m&aacute;gicamente el contenido del archivo previamente almacenado en cach&eacute;, solo lo vuelve a sincronizar desde HEAD. Si nuestro <code>git add</code> equivocado agrega sobrescribi&oacute; una versi&oacute;n previa no confirmada, no podemos recuperarla. Por eso, estrictamente hablando, no podemos deshacer [*].
ja: 2番目： <code>git reset HEAD</code> は以前にキャッシュされたファイルの内容を魔法のように回復できないことに注意してください。HEADから再同期するだけです。 私たちの誤った <code>git add</code> が以前のステージングされたコミットされていないバージョンを上書きした場合、それを回復することはできません。 そのため、厳密に言えば、元に戻すことはできません[*]。
ko: 둘째 : <code>git reset HEAD</code> 는 이전에 캐시 된 파일 내용을 마술처럼 복구 할 수 없으며 HEAD에서 다시 동기화합니다. 잘못 안내 된 <code>git add</code> 가 이전의 단계적 커밋되지 않은 버전을 덮어 쓴 경우 복구 할 수 없습니다. 그렇기 때문에 엄밀히 말하면 [*]를 취소 할 수 없습니다.
ru: Второе: помните, что <code>git reset HEAD</code> не может волшебным образом восстановить ранее кэшированное содержимое файла, он просто ресинхронизирует его из HEAD. Если наш неверный <code>git add</code> перезаписал предыдущую готовую незафиксированную версию, мы не сможем ее восстановить. Вот почему, строго говоря, мы не можем отменить [*].
zh_cn: 其次：请注意 <code>git reset HEAD</code> 不能神奇地恢复以前缓存的文件内容，它只是与HEAD重新同步。 如果我们误导的 <code>git add</code> 覆盖了先前暂存的未提交版本，我们将无法恢复它。 因此，严格来说，这是我们不能撤消[*]的原因。

source: So, which is the real <strong>undo</strong> of <code>git add</code>?
es: Entonces, &iquest;cu&aacute;l es el verdadero <strong>deshacer</strong> de <code>git add</code> ?
ja: それで、どれが <code>git add</code> の本当の<strong>取り消し</strong>ですか？
ko: 그래서 <code>git add</code> 의 실제 <strong>실행 취소</strong> 는 무엇입니까?
ru: Итак, что же является настоящей <strong>отменой</strong> <code>git add</code> ?
zh_cn: 那么，哪个是 <code>git add</code> 的真正<strong>撤消</strong> ？

source: Sourcetree uses <code>reset</code> to unstage new files.
es: Sourcetree usa <code>reset</code> para desestabilizar nuevos archivos.
ja: Sourcetreeは、 <code>reset</code> を使用して新しいファイルのステージングを解除します。
ko: 소스 트리는 <code>reset</code> 을 사용하여 새 파일을 스테이지 해제 합니다.
ru: Sourcetree использует <code>reset</code> для удаления новых файлов.
zh_cn: Sourcetree使用 <code>reset</code> 取消登台新文件。

source: Strictly speaking, and if I'm not mistaken: <strong>none</strong>.
es: Estrictamente hablando, y si no me equivoco: <strong>ninguno</strong> .
ja: 厳密に言えば、そして私が誤解していないのであれば： <strong>なし</strong> 。
ko: 엄밀히 말하면, 내가 실수하지 않으면 : <strong>none</strong> .
ru: Строго говоря, и если я не ошибаюсь: <strong>нет</strong> .
zh_cn: 严格来说，如果我没有记错的话： <strong>没有</strong> 。

source: Suppose I add the file accidentally, <code>git add newFile.txt</code>:
es: Supongamos que agrego el archivo accidentalmente, <code>git add newFile.txt</code> :
ja: 誤ってファイルを追加したとし <code>git add newFile.txt</code> 、 git add newFile.txt ：
ko: 실수로 파일을 추가한다고 가정하고 <code>git add newFile.txt</code> :
ru: Предположим, я добавил файл случайно, <code>git add newFile.txt</code> :
zh_cn: 假设我不小心添加了文件， <code>git add newFile.txt</code> ：

source: Suppose I create a new file, <code>newFile.txt</code>:
es: Supongamos que creo un nuevo archivo, <code>newFile.txt</code> :
ja: 新しいファイル <code>newFile.txt</code> を作成するとします。
ko: 새 파일 <code>newFile.txt</code> 를 작성한다고 가정하십시오.
ru: Предположим, я создаю новый файл <code>newFile.txt</code> :
zh_cn: 假设我创建一个新文件 <code>newFile.txt</code> ：

source: That's it! Here's your proof, showing that "foo" is back on the untracked list:
es: ¡Eso es! Aquí está tu prueba,mostrando que "foo" está de nuevo en la lista de no rastreados:
ja: これだよ! これが証拠です。"foo "が追跡されていないリストに戻ってきたことを示しています。
ko: 그게 다야! 다음은 "foo"가 추적되지 않은 목록에 있음을 보여주는 증거입니다.
ru: Вот так! Вот ваше доказательство,показывающее,что "фу" снова в списке неисправленных:
zh_cn: 就是这样!这是你的证据,显示 "Foo "又回到了未追踪名单上。

source: The OP's scenario seems to be the first one (untracked file), we want the "undo" to remove the file (not just the current contents) from the tracked items. <strong>If</strong> this is the case, then it's ok to run <code>git rm --cached &lt;file&gt;</code>.
es: El escenario del OP parece ser el primero (archivo no rastreado), queremos que el "deshacer" elimine el archivo (no solo el contenido actual) de los elementos rastreados. <strong>Si</strong> este es el caso, entonces est&aacute; bien ejecutar <code>git rm --cached &lt;file&gt;</code> .
ja: OPのシナリオは最初のシナリオ（追跡されていないファイル）のようです。「元に戻す」で追跡されているアイテムからファイル（現在のコンテンツだけでなく）を削除します。 <strong>この場合</strong>は、 <code>git rm --cached &lt;file&gt;</code> を実行しても問題ありません 。
ko: OP의 시나리오는 첫 번째 (추적되지 않은 파일) 것으로 보이며, "실행 취소"를 사용하여 추적 된 항목에서 파일 (현재 내용이 아닌)을 제거하려고합니다. <strong>이 경우</strong> <code>git rm --cached &lt;file&gt;</code> 을 실행해도 됩니다 .
ru: Похоже, что сценарий OP является первым (неотслеживаемый файл), мы хотим, чтобы &laquo;отмена&raquo; удаляла файл (а не только текущее содержимое) из отслеживаемых элементов. <strong>Если</strong> это так, тогда можно запустить <code>git rm --cached &lt;file&gt;</code> .
zh_cn: OP的情况似乎是第一个（未跟踪的文件），我们希望&ldquo;撤消&rdquo;从跟踪的项目中删除文件（而不仅仅是当前内容）。 <strong>如果</strong>是这种情况，那么可以运行 <code>git rm --cached &lt;file&gt;</code> 。

source: The question is not clearly posed. The reason is that <code>git add</code> has two meanings:
es: La pregunta no est&aacute; claramente planteada. La raz&oacute;n es que <code>git add</code> tiene dos significados:
ja: 質問は明確に提起されていません。 その理由は、 <code>git add</code> には2つの意味があるためです。
ko: 문제는 명확하게 제기되지 않습니다. 그 이유는 <code>git add</code> 에는 두 가지 의미가 있습니다.
ru: Вопрос не четко поставлен. Причина в том, что <code>git add</code> имеет два значения:
zh_cn: 这个问题没有明确提出。 原因是 <code>git add</code> 具有两个含义：

source: Then check out your most recent commit again. This will retrieve fresh copies of your files, using your current line-ending settings.
es: Entonces comprueba tu compromiso más reciente de nuevo.Esto recuperará copias nuevas de tus archivos,usando tu configuración de fin de línea actual.
ja: そして、最新のコミットをもう一度確認してください。これにより、現在の改行設定を使用してファイルの新しいコピーを取得します。
ko: 그런 다음 가장 최근 커밋을 다시 확인하십시오. 현재 줄 끝 설정을 사용하여 파일의 새로운 사본을 검색합니다.
ru: Тогда проверь еще раз свой последний коммит.Это позволит получить свежие копии ваших файлов,используя текущие настройки завершения строки.
zh_cn: 然后再次检查你最近的提交。这将检索到您的文件的新副本,使用您当前的行尾设置。

source: There is also interactive mode:
es: También hay un modo interactivo:
ja: インタラクティブモードもあります。
ko: 대화식 모드도 있습니다.
ru: Существует также интерактивный режим:
zh_cn: 还有互动模式。

source: This command will unstash your changes:
es: Este comando liberará sus cambios:
ja: このコマンドを実行すると、変更した内容を公開しなくなります。
ko: 이 명령은 변경 사항을 해제합니다.
ru: Эта команда отменит ваши изменения:
zh_cn: 这个命令将解除你的更改。

source: This is needed since <code>git reset --hard HEAD</code> won't work with single files.
es: Esto es necesario ya que <code>git reset --hard HEAD</code> no funcionar&aacute; con archivos individuales.
ja: <code>git reset --hard HEAD</code> は単一ファイルでは機能しないため、これが必要です。
ko: 이것은 <code>git reset --hard HEAD</code> 가 단일 파일에서 작동하지 않기 때문에 필요합니다.
ru: Это необходимо, поскольку <code>git reset --hard HEAD</code> не будет работать с отдельными файлами.
zh_cn: 这是必需的，因为 <code>git reset --hard HEAD</code> 不适用于单个文件。

source: This is nothing to be worried about; the file is indeed still in the repository, but only as a "loose object". It will not be copied to other repositories (via clone, push), and the space will be eventually reclaimed - though perhaps not very soon. If you are anxious, you can run:
es: Esto no es nada de lo que preocuparse;el archivo está,en efecto,todavía en el repositorio,pero sólo como un "objeto suelto".No será copiado a otros repositorios (vía clon,push),y el espacio será eventualmente reclamado-aunque quizás no muy pronto.Si estás ansioso,puedes correr:
ja: このファイルは確かにまだリポジトリに残っていますが、"ルーズオブジェクト "としてだけです。このファイルは他のリポジトリにコピーされることはなく (クローンやプッシュで)、最終的にはスペースは確保されます。不安な方は実行してみてください。
ko: 이것은 걱정할 것이 없습니다. 파일은 실제로 저장소에 있지만 "느슨한 오브젝트"로만 존재합니다. 복제, 푸시를 통해 다른 리포지토리에 복사되지 않으며 결국 공간은 곧 재생됩니다. 불안한 경우 다음을 실행할 수 있습니다.
ru: Беспокоиться не о чем;файл действительно все еще находится в репозитории,но только как "свободный объект".Он не будет скопирован в другие репозитории (через клон,push),и место в конечном итоге будет восстановлено-хотя,возможно,не очень скоро.Если вы беспокоитесь,то можете бежать:
zh_cn: 这没什么好担心的,这个文件确实还在存储库中,但只是作为一个 "松散的对象"。它不会被复制到其他版本库中(通过克隆、推送),空间最终会被收回--尽管可能不会很快。如果你很着急,可以运行。

source: This process is called <em>staging</em>. So the most natural command to <em>stage</em> the changes (changed files) is the obvious one:
es: Este proceso se llama <em>puesta en escena</em> . Entonces, el comando m&aacute;s natural para <em>organizar</em> los cambios (archivos modificados) es el obvio:
ja: このプロセスは<em>ステージング</em>と呼ばれます。 したがって、変更（変更されたファイル）を<em>ステージング</em>するための最も自然なコマンドは明白なものです。
ko: 이 프로세스를 <em>준비</em> 라고합니다. 따라서 변경 사항을 변경하는 가장 자연스러운 명령 (변경된 파일)은 다음과 같습니다.
ru: Этот процесс называется <em>постановкой</em> . Таким образом, наиболее естественная команда для внесения изменений (измененные файлы) является очевидной:
zh_cn: 此过程称为<em>暂存</em> 。 因此，进行更改（更改的文件）的最自然的命令是显而易见的命令：

source: This should be what you are looking for.
es: Esto debería ser lo que estás buscando.
ja: これはあなたが探しているもののはずです。
ko: 이것은 당신이 찾고있는 것이어야합니다.
ru: Это должно быть то,что ты ищешь.
zh_cn: 这应该就是你要找的东西。

source: To choose a sequence, just type 1-5 to take all from 1 to 5.
es: Para elegir una secuencia,sólo hay que teclear 1-5 para tomar todo de 1 a 5.
ja: シーケンスを選択するには、1から5までのすべてを取るために1-5と入力するだけです。
ko: 순서를 선택하려면 1-5를 입력하여 1에서 5까지를 모두 취하십시오.
ru: Чтобы выбрать последовательность,просто введите 1-5,чтобы взять все от 1 до 5.
zh_cn: 要选择一个序列,只需输入1-5就可以从1到5中全部取数。

source: To clarify: <code>git add</code> moves changes from the current working directory to the <em>staging area</em> (index).
es: Para aclarar: <code>git add</code> mueve los cambios del directorio de trabajo actual al <em>&aacute;rea de preparaci&oacute;n</em> (&iacute;ndice).
ja: 明確にするために： <code>git add</code> は、変更を現在の作業ディレクトリから<em>ステージング領域</em> （インデックス）に移動します。
ko: 명확히하기 위해 : <code>git add</code> 는 현재 작업 디렉토리에서 <em>스테이징 영역</em> (인덱스)으로 변경 사항을 이동합니다.
ru: Чтобы уточнить: <code>git add</code> перемещает изменения из текущего рабочего каталога в <em>область подготовки</em> (индекс).
zh_cn: 需要说明的是： <code>git add</code> 将更改从当前工作目录移动到<em>暂存区</em> （索引）。

source: To remove new files from the staging area (and only in case of a new file), as suggested above:
es: Para eliminar los nuevos archivos de la zona de montaje (y sólo en caso de un nuevo archivo),como se ha sugerido anteriormente:
ja: 上で提案したように、ステージングエリアから新しいファイルを削除するには(新しいファイルがある場合のみ)。
ko: 위에서 제안한대로 준비 영역에서 새 파일을 제거하려면 (새 파일의 경우에만) :
ru: Удалять новые файлы из инсценировочной зоны (и только в случае нового файла),как предлагалось выше:
zh_cn: 要将新文件从暂存区中删除(而且只在新文件的情况下),如上文建议。

source: To reset every file in a particular folder (and its subfolders), you can use the following command:
es: Para restablecer cada archivo de una carpeta en particular (y sus subcarpetas),puede utilizar el siguiente comando:
ja: 特定のフォルダ(およびそのサブフォルダ)内のすべてのファイルをリセットするには、次のコマンドを使用します。
ko: 특정 폴더 (및 해당 하위 폴더)의 모든 파일을 재설정하려면 다음 명령을 사용할 수 있습니다.
ru: Для сброса каждого файла в определенной папке (и ее вложенных папках)можно воспользоваться следующей командой:
zh_cn: 要重置特定文件夹中的每个文件(及其子文件夹),可以使用以下命令。

source: To undo <code>git add</code>, use:
es: Para deshacer <code>git add</code> , use:
ja: <code>git add</code> を元に戻すには 、次のコマンドを使用します。
ko: <code>git add</code> 를 실행 취소하려면 다음을 사용하십시오.
ru: Чтобы отменить <code>git add</code> , используйте:
zh_cn: 要撤消 <code>git add</code> ，请使用：

source: Unstaging files [08/12/15 10:43] git -c diff.mnemonicprefix=false -c core.quotepath=false -c credential.helper=sourcetree reset -q -- path/to/file/filename.java
es: Archivos sin preparar [081215 10:43]git -c diff.mnemonicprefix=falso -c core.quotepath=falso -c credential.helper=sourcetree reset -q --pathtofilefilename.java
ja: ファイルのアンステージ [081215 10:43]git -c diff.mnemonicprefix=false -c core.quotepath=false -c credential.helper=sourcetree reset -q --pathtofilefilename.java
ko: 준비 파일 [08/12/15 10:43] git -c diff.mnemonicprefix = false -c core.quotepath = false -c credential.helper = sourcetree reset -q-경로 /to/file/filename.java
ru: Удаление файлов [081215 10:43]git -c diff.mnemonicprefix=false -c core.quotepath=false -c credential.helper=sourcetree reset -q --pathtofilefilename.java

source: Use <code>git add -i</code> to remove just-added files from your upcoming commit. Example:
es: Use <code>git add -i</code> para eliminar archivos reci&eacute;n agregados de su pr&oacute;xima confirmaci&oacute;n. Ejemplo:
ja: <code>git add -i</code> ばかりのファイルを次のコミットから削除するには、 git add -iを使用します。 例：
ko: 다음 커밋에서 방금 추가 한 파일을 제거하려면 <code>git add -i</code> 를 사용하십시오. 예:
ru: Используйте <code>git add -i</code> , чтобы удалить только что добавленные файлы из вашего предстоящего коммита. Пример:
zh_cn: 使用 <code>git add -i</code> 从您即将提交的提交中删除刚添加的文件。 例：

source: Use rm --cached only for new files accidentally added.
es: Use rm --caché sólo para los nuevos archivos añadidos accidentalmente.
ja: rm --cached は誤って追加された新しいファイルのためだけに使用します。
ko: 실수로 추가 한 새 파일에 대해서만 rm --cached를 사용하십시오.
ru: Используйте rm --cached только для случайно добавленных новых файлов.
zh_cn: 只对意外添加的新文件使用 rm --cached。

source: Use the <code>*</code> command to handle multiple files at a time:
es: Use el comando <code>*</code> para manejar m&uacute;ltiples archivos a la vez:
ja: <code>*</code> コマンドを使用して、一度に複数のファイルを処理します。
ko: 한 번에 여러 파일을 처리하려면 <code>*</code> 명령을 사용하십시오.
ru: Используйте команду <code>*</code> для обработки нескольких файлов одновременно:
zh_cn: 使用 <code>*</code> 命令一次处理多个文件：

source: We can easily create an alias for this:
es: Podemos crear fácilmente un alias para esto:
ja: そのためのエイリアスを簡単に作ることができます。
ko: 이에 대한 별칭을 쉽게 만들 수 있습니다.
ru: Мы легко можем создать для этого псевдоним:
zh_cn: 对此,我们可以很容易地建立一个别名。

source: When I was new to this, I first tried
es: Cuando era nuevo en esto,intenté por primera vez
ja: 初めての時は、最初に試したのは
ko: 내가 이것을 처음 접했을 때, 나는 처음 시도했다
ru: Когда я был новичком в этом деле,я впервые попробовал
zh_cn: 当我刚开始做这个的时候,我第一次尝试过

source: Will remove a file named filename.txt from the current index, the "about to be committed" area, without changing anything else.
es: Eliminará un archivo llamado filename.txt del índice actual,el área "a punto de ser comprometido",sin cambiar nada más.
ja: 現在のインデックス、"about to be committed" エリアから filename.txt という名前のファイルを、他に何も変更せずに削除します。
ko: 다른 것을 변경하지 않고 현재 색인에서 "약속 예정"영역의 filename.txt라는 파일을 제거합니다.
ru: Удалит файл с именем filename.txt из текущего индекса,область "вот-вот будет зафиксирована",ничего больше не меняя.
zh_cn: 将从当前索引中删除一个名为 filename.txt 的文件,即 "即将被提交 "区域,而不改变其他任何东西。

source: You can also use
es: También puedes usar
ja: また、以下のような使い方もできます。
ko: 당신은 또한 사용할 수 있습니다
ru: Вы также можете использовать
zh_cn: 你也可以使用

source: You can undo <code>git add</code> before commit with
es: Puede deshacer <code>git add</code> antes de confirmar con
ja: コミット <code>git add</code> 前にgit addを取り消すことができます
ko: 커밋하기 전에 <code>git add</code> 명령을 취소 할 수 있습니다
ru: Вы можете отменить <code>git add</code> перед фиксацией
zh_cn: 您可以在提交之前撤消 <code>git add</code>

source: You can use
es: Puedes usar
ja: を使用することができます。
ko: 당신이 사용할 수있는
ru: Вы можете использовать
zh_cn: 你可以使用

source: You want:
es: Tú quieres:
ja: 欲しいんだろ?
ko: 당신이 원하는 :
ru: Ты хочешь:
zh_cn: 你想要的。

source: adding a <strong>modified</strong> file to the staging area, then undo with <code>git reset HEAD file</code>.
es: agregando un archivo <strong>modificado</strong> al &aacute;rea de preparaci&oacute;n, luego deshaga con el <code>git reset HEAD file</code> .
ja: <strong>変更された</strong>ファイルをステージング領域に追加し、 <code>git reset HEAD file</code> で元に戻します 。
ko: 스테이징 영역에 <strong>수정 된</strong> 파일을 추가 한 다음 <code>git reset HEAD file</code> 을 사용 하여 실행 취소 하십시오 .
ru: добавив <strong>измененный</strong> файл в область подготовки, затем отмените его с помощью <code>git reset HEAD file</code> .
zh_cn: 将一个<strong>修改过的</strong>文件添加到暂存区，然后使用 <code>git reset HEAD file</code> 撤消。

source: adding a <strong>new file</strong> to the staging area, then undo with <code>git rm --cached file</code>.
es: agregar un <strong>nuevo archivo</strong> al &aacute;rea de preparaci&oacute;n, luego deshacer con <code>git rm --cached file</code> .
ja: ステージング領域に<strong>新しいファイル</strong>を追加してから、 <code>git rm --cached file</code> で元に戻します 。
ko: 준비 영역에 <strong>새 파일</strong> 을 추가 한 다음 <code>git rm --cached file</code> 으로 실행 취소 하십시오 .
ru: добавив <strong>новый файл</strong> в область подготовки, затем <code>git rm --cached file</code> .
zh_cn: 将一个<strong>新文件</strong>添加到暂存区，然后使用 <code>git rm --cached file</code> 撤消。

source: and remove all the files manually or by selecting all of them and clicking on the <em>unstage from commit</em> button.
es: y elimine todos los archivos manualmente o seleccion&aacute;ndolos y haciendo clic en el bot&oacute;n <em>Unstage from commit</em> .
ja: そして、すべてのファイルを手動で削除するか、それらのすべてを選択して、[ <em>コミット解除</em> ]ボタン<em>を</em>クリックします。
ko: 수동으로 또는 모든 파일을 선택하고 <em>커밋</em> 에서 <em>언 스테이지</em> 버튼을 클릭하여 모든 파일을 제거하십시오.
ru: и удалите все файлы вручную или, выбрав их все и нажав на кнопку <em>unstatage from commit</em> .
zh_cn: 并手动删除所有文件，或选择所有文件并单击&ldquo; <em>从提交</em>取消<em>登台&rdquo;</em>按钮。

source: cd to my great new project directory to try out Git, the new hotness
es: cd a mi nuevo directorio de proyectos para probar Git,el nuevo atractivo
ja: 新しいプロジェクトディレクトリに cd して、新しいホットな Git を試してみました。
ko: 내 새 프로젝트 디렉토리로 이동하여 Git을 시험해 보자.
ru: cd к моему большому новому каталогу проекта,чтобы попробовать Git,новую горячую штучку.
zh_cn: cd到我的新项目目录中去尝试一下Git,新的热门项目目录。

source: git checkout .
es: ...en la caja del git...
ru: git-кассация .

source: git checkout my_file.txt
ko: 자식 체크 아웃 my_file.txt
ru: git-проверка my_file.txt

source: git reset .
ru: git-обновление .
zh_cn: git重置。

source: git reset my_file.txt
ko: 자식 재설정 my_file.txt
ru: git сбросил my_file.txt

source: google "undo git add"
ko: 구글 "실행 취소 git add"
ru: Google "отменить git-добавление"
zh_cn: 谷歌 "撤消git添加"
