Repository: rueisnom/feedback
Catalog: xlf/30/65/83/306583.*.001.xlf
Languages: es, ja, ko, ru

source: <strong>1 find():</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 encontrar ():</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 find（）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 찾기 () :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 найти ():</font></font></strong>

source: <strong>2 children():</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 ni&ntilde;os():</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2人の子供（）：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어린이 2 명 () :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 детей ():</font></font></strong>

source: Also this should work:
es: También esto debería funcionar:
ja: また、これもうまくいくはずです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 이것은 작동해야합니다.</font></font>
ru: Также это должно сработать:

source: And the below is if you don't have reference to <code>$(this)</code> and you want to reference <code>img</code> available within a <code>div</code> from other function.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y lo siguiente es si no tiene referencia a </font></font> <code>$(this)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y desea hacer referencia a </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> disponible dentro de un </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de otra funci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、以下は</font></font> <code>$(this)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">への参照がなく</font><font style="vertical-align: inherit;">、他の関数から</font> <code>div</code> <font style="vertical-align: inherit;">内で利用可能な</font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を参照したい場合です</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래는 </font></font> <code>$(this)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 참조가없고 </font><font style="vertical-align: inherit;">다른 함수 </font><font style="vertical-align: inherit;">의 </font> <code>div</code> <font style="vertical-align: inherit;"> 내에서 사용 가능한 </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 참조하려는 경우 </font><font style="vertical-align: inherit;">입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И ниже, если у вас нет ссылки на </font></font> <code>$(this)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вы хотите сослаться на </font></font> <code>img</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> доступный в </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из другой функции.</font></font>

source: But if your div contain more img element like below
es: Pero si tu submarino contiene más elementos de imagen como los de abajo...
ja: しかし、あなたの div に以下のようなより多くの img 要素が含まれている場合
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 div에 아래와 같은 img 요소가 더 있으면</font></font>
ru: Но если ваш дайв содержит больше элементов img,как показано ниже.

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент

source: Here's a functional code, you can run it (it's a simple demonstration).
es: Aquí hay un código funcional,puedes ejecutarlo (es una simple demostración).
ja: ここに関数的なコードがありますので、それを実行してみてください(簡単なデモです)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 기능 코드입니다. 실행할 수 있습니다 (간단한 설명입니다).</font></font>
ru: Вот функциональный код,его можно запустить (это простая демонстрация).

source: Hope it helps!
es: ¡Espero que ayude!
ja: 役に立つことを願っています
ko: 그것이 도움이되기를 바랍니다!
ru: Надеюсь,это поможет!

source: How can I get the child <code>img</code> using a selector?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo puedo hacer que el ni&ntilde;o </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> use un selector?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セレクターを使用し</font><font style="vertical-align: inherit;">て子</font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">取得するにはどうすればよい</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선택기를 사용하여 </font><font style="vertical-align: inherit;">자식 </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">얻는 방법은 </font><font style="vertical-align: inherit;">무엇입니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу получить ребенка </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью селектора?</font></font>

source: How to get the children of the $(this) selector
es: Cómo conseguir que los niños del selector de $(esto)
ja: セレクタ$(this)の子を取得する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ (this) 선택기의 자식을 얻는 방법</font></font>
ru: Как достать детей из селектора $(этого).

source: I have a layout similar to this:
es: Tengo un diseño similar a este:
ja: 似たようなレイアウトをしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 비슷한 레이아웃이 있습니다.</font></font>
ru: У меня есть схема,похожая на эту:

source: If the imgs you desire are <strong>only</strong> direct descendants of the clicked element, you can also use <a href="http://api.jquery.com/children"><code>.children()</code></a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si las im&aacute;genes que desea son </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> descendientes directos del elemento seleccionado, tambi&eacute;n puede usar </font></font><a href="http://api.jquery.com/children"> <code>.children()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要なimgが</font><font style="vertical-align: inherit;">クリックされた要素の直接の子孫</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみである</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合は、.children </font></font><a href="http://api.jquery.com/children"> <code>.children()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用することもできます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 원하는 imgs 인 경우 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에만</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클릭 된 요소의 직계 후손, 당신은 또한 사용할 수 있습니다 </font></font><a href="http://api.jquery.com/children"> <code>.children()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если ГИМ вы желаете являются </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">только</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> прямыми потомками щелкнутого элемента, вы можете также использовать </font></font><a href="http://api.jquery.com/children"> <code>.children()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: If you need to get the first <code>img</code> that's down exactly one level, you can do
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si usted necesita para obtener la primera </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que es exactamente un nivel, puede hacerlo</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ちょうど1レベル下の</font><font style="vertical-align: inherit;">最初の</font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を取得する必要がある場合</font><font style="vertical-align: inherit;">は、</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정확히 한 수준 아래로 </font><font style="vertical-align: inherit;">첫 번째 </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">가져와야</font><font style="vertical-align: inherit;"> 할 경우</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам нужно получить первый </font></font> <code>img</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который опускается ровно на один уровень, вы можете сделать</font></font>

source: If you want specific img element you can write like this
es: Si quieres un elemento de imagen específico puedes escribir así
ja: 特定のimg要素が欲しい場合は、このように書くことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">특정 img 요소를 원한다면 다음과 같이 쓸 수 있습니다</font></font>
ru: Если вам нужен определенный элемент img,вы можете написать так.

source: If your DIV tag is immediately followed by the IMG tag, you can also use:
es: Si tu etiqueta DIV es seguida inmediatamente por la etiqueta IMG,también puedes usar:
ja: divタグの直後にimgタグがついている場合は、それを利用することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DIV 태그 바로 뒤에 IMG 태그가 오는 경우 다음을 사용할 수도 있습니다.</font></font>
ru: Если за вашим DIV-тегом сразу же следует IMG-тег,вы также можете его использовать:

source: The <em>direct</em> children is
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los </font><font style="vertical-align: inherit;">ni&ntilde;os </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">directos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子供であります</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">직접</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아이들은</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">прямых</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> детей</font></font>

source: The jQuery constructor accepts a 2nd parameter called <a href="http://api.jquery.com/jQuery/#jQuery-selector-context"><code>context</code></a> which can be used to override the context of the selection.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El constructor jQuery acepta un segundo par&aacute;metro llamado </font></font><a href="http://api.jquery.com/jQuery/#jQuery-selector-context"> <code>context</code> o</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que puede usarse para anular el contexto de la selecci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQueryコンストラクターは</font><font style="vertical-align: inherit;">、選択範囲のコンテキストをオーバーライドするために使用できる</font></font><a href="http://api.jquery.com/jQuery/#jQuery-selector-context"> <code>context</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という2番目のパラメーターを受け入れ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 생성자는 </font></font><a href="http://api.jquery.com/jQuery/#jQuery-selector-context"> <code>context</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라는 두 번째 매개 변수를 </font><font style="vertical-align: inherit;">사용합니다.이 </font><font style="vertical-align: inherit;">매개 변수 </font><font style="vertical-align: inherit;">는 선택 컨텍스트를 재정의하는 데 사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Конструктор jQuery принимает 2-й параметр, называемый </font></font><a href="http://api.jquery.com/jQuery/#jQuery-selector-context"> <code>context</code> ,</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который можно использовать для переопределения контекста выбора.</font></font>

source: This example shows a general idea that how you can find actual object within parent object. You can use classes to differentiate your child object. That is easy and fun. i.e.
es: Este ejemplo muestra una idea general de cómo se puede encontrar un objeto real dentro de un objeto padre.Puede utilizar clases para diferenciar el objeto hijo.Esto es fácil y divertido,por ejemplo
ja: この例は、親オブジェクトの中から実際のオブジェクトを見つける方法の一般的な考え方を示しています。クラスを使って子オブジェクトを区別することができます。これは簡単で楽しいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 예제는 부모 개체 내에서 실제 개체를 찾는 방법에 대한 일반적인 아이디어를 보여줍니다. </font><font style="vertical-align: inherit;">클래스를 사용하여 자식 개체를 구별 할 수 있습니다. </font><font style="vertical-align: inherit;">쉽고 재미 있습니다. </font><font style="vertical-align: inherit;">즉</font></font>
ru: Этот пример показывает общую идею о том,как можно найти реальный объект внутри родительского объекта.Вы можете использовать классы для дифференциации объекта вашего ребенка.Это просто и весело.Т.е.

source: To find an element, use a <code>.find()</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para encontrar un elemento, use un </font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素を見つけるには、</font></font> <code>.find()</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요소를 찾으려면 </font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы найти элемент, используйте </font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: To get the <code>div</code>, I've got this selector:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para obtener el </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , tengo este selector:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を取得するに</font><font style="vertical-align: inherit;">は、次のセレクターを使用します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 얻으려면 </font><font style="vertical-align: inherit;">이 선택기가 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы получить </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , у меня есть этот селектор:</font></font>

source: To keep your code safe, use a <code>.each()</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para mantener su c&oacute;digo seguro, use un </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードを安全に保つには、</font></font> <code>.each()</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드를 안전하게 유지하려면 </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы сохранить ваш код в безопасности, используйте </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Try this code:
es: Intenta con este código:
ja: このコードを試してみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 코드를 사용해보십시오 :</font></font>
ru: Попробуй этот код:

source: Using <code>.find()</code> and <code>.each()</code> together prevents null reference errors in the case of 0 <code>&lt;img&gt;</code> elements while also allowing for handling of multiple <code>&lt;img&gt;</code> elements.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El uso de </font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> juntos evita errores de referencia nulos en el caso de 0 </font><font style="vertical-align: inherit;">elementos </font></font> <code>&lt;img&gt;</code> al<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiempo que permite el manejo de m&uacute;ltiples </font><font style="vertical-align: inherit;">elementos </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>.each()</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">共に0の場合にはnull参照エラーを防止する</font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、複数の取り扱いを可能にしながら要素</font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함께 0 인 경우 null 참조 오류를 방지 </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다중의 취급을 허용하면서 요소 </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요소.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>.find()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использование </font><font style="vertical-align: inherit;">.find ()</font><font style="vertical-align: inherit;"> и </font></font> <code>.each()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предотвращает ошибки нулевых ссылок в случае 0 </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> элементов, а также позволяет обрабатывать несколько </font><font style="vertical-align: inherit;">элементов </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Ways to refer to a child in jQuery. I summarized it in the following jQuery:
es: Formas de referirse a un niño en jQuery.Lo resumí en el siguiente jQuery:
ja: jQueryで子を参照する方法。以下のjQueryにまとめてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery에서 자식을 참조하는 방법 </font><font style="vertical-align: inherit;">다음 jQuery에 요약했습니다.</font></font>
ru: Способы обращения к ребенку в jQuery.Я резюмировал это в следующем jQuery:

source: When you click the DIV you get the image from some different methods, in this situation "this" is the DIV.
es: Cuando haces clic en el DIV obtienes la imagen de algunos métodos diferentes,en esta situación "esto" es el DIV.
ja: DIVをクリックすると、いくつかの異なる方法で画像が表示されますが、この状況では "これ "がDIVです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DIV를 클릭하면 몇 가지 다른 방법으로 이미지가 표시됩니다.이 상황에서 "this"는 DIV입니다.</font></font>
ru: Когда вы нажимаете на DIV,вы получаете изображение из некоторых различных методов,в этой ситуации "это" DIV.
