Repository: rueisnom/feedback
Catalog: xlf/30/65/83/306583.*.001.xlf
Languages: es, ja, ko, ru

source: Which is the same as using <a href="http://api.jquery.com/find"><code>.find()</code></a> like this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo cual es lo mismo que usar </font></font><a href="http://api.jquery.com/find"> <code>.find()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> as&iacute;:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、次の</font><font style="vertical-align: inherit;">ように</font></font><a href="http://api.jquery.com/find"> <code>.find()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用するのと同じ</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 </font></font><a href="http://api.jquery.com/find"> <code>.find()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 것과 </font><font style="vertical-align: inherit;">같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Что аналогично использованию </font></font><a href="http://api.jquery.com/find"> <code>.find()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> следующим образом:</font></font>

source: Without knowing the ID of the DIV I think you could select the IMG like this:
es: Sin saber el ID del DIV creo que podrías seleccionar el IMG así:
ja: DIVのIDがわからなければ、こんな感じでIMGを選択できると思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DIV의 ID를 모르면 다음과 같이 IMG를 선택할 수 있다고 생각합니다.</font></font>
ru: Не зная ID DIV,я думаю,что вы могли бы выбрать IMG вот так:

source: You can do this as below :
es: Puede hacerlo como se indica a continuación:
ja: これは以下のように行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래와 같이 할 수 있습니다 :</font></font>
ru: Вы можете сделать это,как показано ниже:

source: You can find all img element of parent div like below
es: Puedes encontrar todos los elementos de imagen de los padres como abajo
ja: 以下のような親divのすべてのimg要素を見つけることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래처럼 부모 div의 모든 img 요소를 찾을 수 있습니다</font></font>
ru: Вы можете найти все элементы img родительского div,как показано ниже.

source: You can use <a href="http://api.jquery.com/child-selector/">Child Selecor</a> to reference the child elements available within the parent.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font><a href="http://api.jquery.com/child-selector/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Child Selecor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para hacer referencia a los elementos secundarios disponibles dentro del elemento primario.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは使用することができます</font></font><a href="http://api.jquery.com/child-selector/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子供Selecorを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">親内で利用可能な子要素を参照するために。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://api.jquery.com/child-selector/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Child Selecor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 상위에서 사용 가능한 하위 요소를 참조 </font><font style="vertical-align: inherit;">할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font><a href="http://api.jquery.com/child-selector/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Child Selecor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для ссылки на дочерние элементы, доступные в родительском </font><font style="vertical-align: inherit;">элементе</font><font style="vertical-align: inherit;"> .</font></font>

source: You can use either of the following methods:
es: Puede utilizar cualquiera de los siguientes métodos:
ja: 以下のいずれかの方法を使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 방법 중 하나를 사용할 수 있습니다.</font></font>
ru: Вы можете использовать любой из следующих методов:

source: You can use find or children as above code. For more visit Children <a href="http://api.jquery.com/children/">http://api.jquery.com/children/</a> and Find <a href="http://api.jquery.com/find/">http://api.jquery.com/find/</a>. See example <a href="http://jsfiddle.net/lalitjs/Nx8a6/">http://jsfiddle.net/lalitjs/Nx8a6/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar find o children como el c&oacute;digo anterior. </font><font style="vertical-align: inherit;">Para obtener m&aacute;s informaci&oacute;n, visite </font></font><a href="http://api.jquery.com/children/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/children/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y encuentre </font></font><a href="http://api.jquery.com/find/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/find/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ver ejemplo </font></font><a href="http://jsfiddle.net/lalitjs/Nx8a6/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/lalitjs/Nx8a6/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のコードのように、findまたはchildrenを使用できます。</font><font style="vertical-align: inherit;">詳細については、Children </font></font><a href="http://api.jquery.com/children/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/children/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">およびFind </font></font><a href="http://api.jquery.com/find/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/find/を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧</font><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例を参照してください</font></font><a href="http://jsfiddle.net/lalitjs/Nx8a6/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/lalitjs/Nx8a6/</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위 코드와 같이 find 또는 children을 사용할 수 있습니다. </font><font style="vertical-align: inherit;">더 방문을 위해 아이들은 </font></font><a href="http://api.jquery.com/children/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/children/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 찾기 </font></font><a href="http://api.jquery.com/find/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/find/을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">예를 참조하십시오 </font></font><a href="http://jsfiddle.net/lalitjs/Nx8a6/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/lalitjs/Nx8a6/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать find или children, как указано выше. </font><font style="vertical-align: inherit;">Для получения дополнительной информации посетите Дети </font></font><a href="http://api.jquery.com/children/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/children/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и найдите </font></font><a href="http://api.jquery.com/find/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://api.jquery.com/find/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Смотрите пример </font></font><a href="http://jsfiddle.net/lalitjs/Nx8a6/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/lalitjs/Nx8a6/</font></font></a>

source: You could also use
es: También podrías usar
ja: また、以下のような使い方もできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 또한 사용할 수 있습니다</font></font>
ru: Вы также можете использовать

source: You could use
es: Podrías usar
ja: を使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 사용할 수 있습니다</font></font>
ru: Вам бы не помешало

source: You may have 0 to many <code>&lt;img&gt;</code> tags inside of your <code>&lt;div&gt;</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede tener de 0 a muchas </font><font style="vertical-align: inherit;">etiquetas </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de su </font></font> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;">内に</font><font style="vertical-align: inherit;">0個から多数の</font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ</font><font style="vertical-align: inherit;">を含めることができ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;"> 내에 </font><font style="vertical-align: inherit;">0에서 많은 </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그 </font><font style="vertical-align: inherit;">가있을 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У вас может быть от 0 до многих </font><font style="vertical-align: inherit;">тегов </font></font> <code>&lt;img&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри вашего </font></font> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Your div contain only one img element. So for this below is right
es: Su div contiene sólo un elemento de img.Así que para esto abajo es correcto
ja: あなたの div には img 要素が 1 つしか含まれていません。そのため、以下のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">div에는 하나의 img 요소 만 포함되어 있습니다. </font><font style="vertical-align: inherit;">이 아래에 맞습니다</font></font>
ru: В вашем дайве есть только один элемент img.Так что для этого ниже правильно

source: and more specific as:
es: y más específico como:
ja: とより具体的に。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보다 구체적으로 :</font></font>
ru: и более конкретно,как:

source: and would like to use a jQuery selector to select the child <code>img</code> inside the <code>div</code> on click.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y me gustar&iacute;a usar un selector jQuery para seleccionar el </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> secundario </font><font style="vertical-align: inherit;">dentro del </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al hacer clic.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、jQueryセレクターを使用して、</font><font style="vertical-align: inherit;">クリック時に</font> <code>div</code> <font style="vertical-align: inherit;">内の</font><font style="vertical-align: inherit;">子</font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を選択</font><font style="vertical-align: inherit;">します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery 선택기를 사용하여 </font><font style="vertical-align: inherit;">클릭시 </font> <code>div</code> <font style="vertical-align: inherit;"> 내부의 </font><font style="vertical-align: inherit;">자식 </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 선택하고 싶습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и хотел бы использовать селектор jQuery для выбора дочернего </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по щелчку.</font></font>

source: jQuery's <code>each</code> is one option:
es: <font style="vertical-align: inherit;"></font> <code>each</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> jQuery </font><font style="vertical-align: inherit;">es una opci&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQueryの</font></font> <code>each</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が1つのオプションです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery는 </font></font> <code>each</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하나의 옵션입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У </font></font> <code>each</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> jQuery </font><font style="vertical-align: inherit;">есть один вариант:</font></font>

source: then you can't use upper code to find alt value of second img element. So you can try this:
es: entonces no puedes usar el código superior para encontrar el valor alt del segundo elemento img.Así que puedes probar esto:
ja: の場合、2番目のimg要素のalt値を見つけるために上位コードを使用することはできません。そこで、次のようにしてみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 상위 코드를 사용하여 두 번째 img 요소의 대체 값을 찾을 수 없습니다. </font><font style="vertical-align: inherit;">그래서 당신은 이것을 시도 할 수 있습니다 :</font></font>
ru: то вы не сможете использовать верхний код для поиска значения alt второго img элемента.Так что вы можете попробовать это:

source: which would return all <code>img</code>s that are descendants of the <code>div</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">que devolver&iacute;a todos los </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s que son descendientes del </font></font> <code>div</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font> <code>div</code> の<font style="vertical-align: inherit;">子孫である</font><font style="vertical-align: inherit;">すべての</font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を返します</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>div</code> 의<font style="vertical-align: inherit;"> 자손 인 </font><font style="vertical-align: inherit;">모든 </font></font> <code>img</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 반환합니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">который вернет все </font></font> <code>img</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> S , </font><font style="vertical-align: inherit;">которые являются потомками </font></font> <code>div</code>
