Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: In order to reject dangling ones like <code>ringo</code>, we have to parse the output of the shell built-in <code>alias</code> command and recurse into them (<code>command -v</code> isn't a superior to <code>alias</code> here.) There isn't any portable solution for it, and even a Bash-specific solution is rather tedious.
ja: <font style="vertical-align: inherit;"></font> <code>ringo</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ようなぶら下がっているものを拒否するに</font><font style="vertical-align: inherit;">は、シェルの組み込み</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">の出力を解析して</font><font style="vertical-align: inherit;">再帰する必要があります（</font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font><font style="vertical-align: inherit;">ここで</font><font style="vertical-align: inherit;">は</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも優れていません</font><font style="vertical-align: inherit;">。）ポータブルな解決策はありません。 、そしてBash固有のソリューションでさえ、かなり退屈です。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ringo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같이 매달려있는 것을 거부 </font><font style="vertical-align: inherit;">하려면 셸 내장 </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">의 출력을 구문 분석 </font><font style="vertical-align: inherit;">하고 다시 재귀해야합니다 ( </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 우월하지 않습니다 </font><font style="vertical-align: inherit;">). 심지어 Bash 전용 솔루션조차 다소 지루합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы отклонить висячие сообщения типа </font></font> <code>ringo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , нам нужно проанализировать выходные данные встроенной </font><font style="vertical-align: inherit;">команды </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> оболочки </font><font style="vertical-align: inherit;">и выполнить их повторение ( </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> здесь не превосходит </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Переносимого решения для этого не существует. и даже Bash-специфичное решение довольно утомительно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了拒绝像</font></font> <code>ringo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样的</font><font style="vertical-align: inherit;">悬空项</font><font style="vertical-align: inherit;">，我们必须解析shell内置的</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">的输出，</font><font style="vertical-align: inherit;">然后将其递归到其中（</font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在此不优于</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。）没有任何可移植的解决方案，甚至Bash特定的解决方案也相当繁琐。</font></font>

source: It depends on whether you want to know whether it exists in one of the directories in the <code>$PATH</code> variable or whether you know the absolute location of it. If you want to know if it is in the <code>$PATH</code> variable, use
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それが</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数の</font><font style="vertical-align: inherit;">ディレクトリの1つに存在するかどうか、</font><font style="vertical-align: inherit;">またはその絶対的な場所を知っ</font><font style="vertical-align: inherit;">ているかどうかによって異なります</font><font style="vertical-align: inherit;">。</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数</font><font style="vertical-align: inherit;">にあるかどうかを知りたい場合は、</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font><font style="vertical-align: inherit;">의 디렉토리 중 하나에 존재 </font><font style="vertical-align: inherit;">하는지 또는 절대 위치 </font><font style="vertical-align: inherit;">를 알고 있는지 여부에 따라 다릅니다 </font><font style="vertical-align: inherit;">. </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font><font style="vertical-align: inherit;">에 있는지 알고 싶다면</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это зависит от того, хотите ли вы узнать, существует ли он в одном из каталогов в </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или знаете ли вы его абсолютное местоположение. </font><font style="vertical-align: inherit;">Если вы хотите узнать, находится ли она в </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используйте</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这取决于您是否想知道它是否存在于</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量</font><font style="vertical-align: inherit;">的目录之一中，</font><font style="vertical-align: inherit;">或者您是否知道它的绝对位置。</font><font style="vertical-align: inherit;">如果您想知道它是否在</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量中，请使用</font></font>

source: It returns 0 if the executable is found and returns 1 if it's not found or not executable:
ja: 実行可能ファイルが見つかった場合は0を返し、見つからない場合や実行可能ファイルでない場合は1を返します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실행 파일이 발견되면 0을, 실행 파일이 없거나 실행 파일이 아닌 경우 1을 리턴합니다.</font></font>
ru: Возвращает 0,если исполняемый файл найден,и 1,если он не найден или не исполняемый:
zh_cn: 如果找到可执行文件,则返回0,如果没有找到或无法执行,则返回1。

source: It seems like it should be easy, but it's been stumping me.
ja: 簡単なはずなんだけど、ずっとつまずいていた。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">쉬워야 할 것 같지만 저를 짓밟고있었습니다.</font></font>
ru: Похоже,это должно быть легко,но это меня озадачивает.
zh_cn: 看上去应该很简单,但却让我很纠结。

source: It uses shell builtins and programs' echo status to standard output and nothing to standard error. On the other hand, if a command is not found, it echos status only to standard error.
ja: シェルビルトインやプログラムのエコー状態を標準出力に、標準エラーには何も出力しません。一方、コマンドが見つからない場合は、標準エラーにのみステータスをエコーします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">쉘 내장 및 프로그램의 에코 상태를 표준 출력에 사용하고 표준 오류에는 아무것도 사용하지 않습니다. </font><font style="vertical-align: inherit;">반면, 명령을 찾을 수 없으면 표준 오류로만 상태를 에코합니다.</font></font>
ru: Он использует сборки оболочки и эхо-статус программ на стандартный вывод и ничего на стандартную ошибку.С другой стороны,если команда не найдена,она эхо-статус только до стандартной ошибки.
zh_cn: 它使用shell内建程序和程序的状态回声到标准输出,而没有任何状态回声到标准错误。另一方面,如果没有找到一个命令,它只将状态回波到标准错误。

source: It was previously mentioned at: <em><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/2075386#2075386">How can I check if a program exists from a Bash script?</a></em>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それは以前に言及されました：</font></font><em><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/2075386#2075386"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プログラムがBashスクリプトから存在するかどうかを確認するにはどうすればよいですか？</font></font></a></em>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">: 그것은 이전에 언급 한 </font></font><em><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/2075386#2075386"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그램이 배쉬 스크립트에서 존재하는 경우 내가 확인할 수 있습니까?</font></font></a></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ранее было упомянуто в: </font></font><em><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/2075386#2075386"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу проверить, существует ли программа из сценария Bash?</font></font></a></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">先前在以下位置提到过：</font></font><em><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/2075386#2075386"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如何检查Bash脚本中是否存在程序？</font></font></a></em>

source: It's a more trustworthy check that the program runs than merely looking at PATH directories and file permissions.
ja: 単にPATHディレクトリやファイルのパーミッションを見ているだけよりも、プログラムが実行されているかどうかを確認する方が信頼性が高いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단순히 PATH 디렉토리와 파일 권한을 보는 것보다 프로그램을 실행하는 것이 더 신뢰할만한 검사입니다.</font></font>
ru: Это более надежная проверка того,что программа работает,чем просто просмотр каталогов PATH и файловых разрешений.
zh_cn: 这比单纯看PATH目录和文件权限更值得信赖的检查程序运行情况。

source: Many operating systems have a <code>which</code> that <strong>doesn't even set an exit status</strong>, meaning the <code>if which foo</code> won't even work there and will <strong>always</strong> report that <code>foo</code> exists, even if it doesn't (note that some POSIX shells appear to do this for <code>hash</code> too).
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くのオペレーティングシステムは持って</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こと</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も、終了ステータスを設定していない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という意味、</font></font> <code>if which foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そこでも動作しませんとなり</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、常に</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのレポート</font></font> <code>foo</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、いくつかのPOSIXシェルが行うように見えることに注意してください（そうでない場合であっても、存在していますこれも</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用です</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 운영 체제가 가지고 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심지어 종료 상태를 설정하지 않습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의미, </font></font> <code>if which foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도가 작동하지 않을 것이며 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그보고 </font></font> <code>foo</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 (주 일부 POSIX 쉘이 할 나타나는하지 않는 경우에도, 존재를 이 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Многие операционные системы имеют </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , что </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">даже не установлен статус выхода</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то есть , </font></font> <code>if which foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не будет работать даже там и будет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всегда</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сообщать , </font><font style="vertical-align: inherit;">что </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> существует, даже если он не (заметим , </font><font style="vertical-align: inherit;">что некоторые POSIX оболочки появляются делать это </font><font style="vertical-align: inherit;">тоже </font><font style="vertical-align: inherit;">для </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">许多操作系统有一个</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">认为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">甚至不设置退出状态</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这意味着</font></font> <code>if which foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">甚至不会在那里工作，并会</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始终</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">报告</font></font> <code>foo</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">存在，即使它没有（注意，一些POSIX外壳表面上做这也用于</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: Many operating systems make <code>which</code> do custom and evil stuff like change the output or even hook into the package manager.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くのオペレーティングシステムは作る</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変更のようなパッケージマネージャへの出力、あるいはフックをカスタムし、邪悪なものを行います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 운영 체제 </font><font style="vertical-align: inherit;">는 출력을 변경하거나 패키지 관리자에 연결하는 것과 같이 사용자 지정 및 악의적 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 작업 </font><font style="vertical-align: inherit;">을</font><font style="vertical-align: inherit;"> 수행합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Многие операционные системы делают </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> то нестандартное и плохое, например, изменяют вывод или даже подключаются к менеджеру пакетов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">许多操作系统使得</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做定制和邪恶的东西，比如修改输出，甚至勾入包管理器。</font></font>

source: My setup for a <a href="https://duckduckgo.com/html/?q=Wikipedia%20exitting">Debian</a> server:
ja: <font style="vertical-align: inherit;"></font><a href="https://duckduckgo.com/html/?q=Wikipedia%20exitting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーバーの</font><font style="vertical-align: inherit;">私のセットアップ</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://duckduckgo.com/html/?q=Wikipedia%20exitting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데비안</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서버 </font><font style="vertical-align: inherit;">설정 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Моя настройка для </font><font style="vertical-align: inherit;">сервера </font></font><a href="https://duckduckgo.com/html/?q=Wikipedia%20exitting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的</font></font><a href="https://duckduckgo.com/html/?q=Wikipedia%20exitting"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debian</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">服务器</font><font style="vertical-align: inherit;">设置</font><font style="vertical-align: inherit;">：</font></font>

source: Note that a solution like this will unconditionally reject <code>alias ls='ls -F'</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このような解決策は無条件に</font></font> <code>alias ls='ls -F'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">拒否することに注意してください</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이와 같은 솔루션은 </font></font> <code>alias ls='ls -F'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 무조건 거부합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что подобное решение безоговорочно отклонит </font></font> <code>alias ls='ls -F'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，这样的解决方案将无条件拒绝</font></font> <code>alias ls='ls -F'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Note: <code>type</code> is POSIX compliant, but <code>type -P</code> is not.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はPOSIXに準拠していますが、</font></font> <code>type -P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">準拠して</font><font style="vertical-align: inherit;">いません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 POSIX 호환이지만 </font></font> <code>type -P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 아닙니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание: </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соответствует POSIX, а </font></font> <code>type -P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - нет.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符合POSIX，但</font></font> <code>type -P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font><font style="vertical-align: inherit;">兼容</font><font style="vertical-align: inherit;">。</font></font>

source: Of course the drawbacks are that some programs can be heavy to start and some don't have a <code>--version</code> option to immediately (and successfully) exit.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もちろん、欠点としては、起動するのが重いプログラムもあれば</font><font style="vertical-align: inherit;">、すぐに（そして正常に）終了</font><font style="vertical-align: inherit;">する</font></font> <code>--version</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプション</font><font style="vertical-align: inherit;">がないプログラムもあり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 단점은 일부 프로그램이 시작하기에 무거울 수 있고 일부는 </font><font style="vertical-align: inherit;">즉시 (및 성공적으로) 종료 </font><font style="vertical-align: inherit;">하는 </font></font> <code>--version</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 옵션 </font><font style="vertical-align: inherit;">이 없다는 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Конечно, недостатки заключаются в том, что некоторые программы могут быть тяжелыми для запуска, а некоторые не имеют </font><font style="vertical-align: inherit;">опции </font></font> <code>--version</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для немедленного (и успешного) выхода.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当然，缺点是有些程序启动起来很</font></font> <code>--version</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而有些程序没有</font><font style="vertical-align: inherit;">--version</font><font style="vertical-align: inherit;">选项可以立即（并成功）退出。</font></font>
