Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: If the <code>dummy</code> command is not found, Bash exits with the following error...
ja: <font style="vertical-align: inherit;"></font> <code>dummy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドが見つからない</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、Bashは次のエラーで終了します...</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우 </font></font> <code>dummy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 발견되지 않는, 다음과 같은 오류와 배쉬 종료 ...</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font></font> <code>dummy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> команда не найдена, Bash завершается со следующей ошибкой ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font><font style="vertical-align: inherit;">找不到</font></font> <code>dummy</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令，则Bash退出并显示以下错误...</font></font>

source: If there isn't any external <code>type</code> command available (as taken for granted <a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/6205510#6205510">here</a>), we can use POSIX compliant <code>env -i sh -c 'type cmd 1&gt;/dev/null 2&gt;&amp;1'</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/6205510#6205510"><font style="vertical-align: inherit;">ここ</font></a><font style="vertical-align: inherit;">で当然とされて</font><font style="vertical-align: inherit;">いるように</font><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">使用可能な</font><font style="vertical-align: inherit;">外部</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">がない場合は</font><font style="vertical-align: inherit;">、POSIX準拠の</font> <code>env -i sh -c 'type cmd 1&gt;/dev/null 2&gt;&amp;1'</code> <font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 가능한 </font><font style="vertical-align: inherit;">외부 </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">이없는 경우 </font><font style="vertical-align: inherit;">( </font></font><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/6205510#6205510"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 부여 </font><font style="vertical-align: inherit;">된대로</font><font style="vertical-align: inherit;"> ) POSIX 호환 </font></font> <code>env -i sh -c 'type cmd 1&gt;/dev/null 2&gt;&amp;1'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если нет никакой </font><font style="vertical-align: inherit;">доступной команды </font><font style="vertical-align: inherit;">внешнего </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (как само собой разумеющееся </font></font><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/6205510#6205510"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), мы можем использовать POSIX-совместимый </font></font> <code>env -i sh -c 'type cmd 1&gt;/dev/null 2&gt;&amp;1'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果没有</font><font style="vertical-align: inherit;">可用的</font><font style="vertical-align: inherit;">外部</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令（</font></font><a href="https://stackoverflow.com/questions/592620/how-can-i-check-if-a-program-exists-from-a-bash-script/6205510#6205510"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已视为理所当然</font><font style="vertical-align: inherit;">），我们可以使用POSIX兼容的</font></font> <code>env -i sh -c 'type cmd 1&gt;/dev/null 2&gt;&amp;1'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: If you check for program existence, you are probably going to run it later anyway. Why not try to run it in the first place?
ja: プログラムの存在を確認しても、どうせ後で実行することになるでしょう。そもそも実行してみてはどうでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그램이 있는지 확인하면 나중에 실행하게 될 것입니다. </font><font style="vertical-align: inherit;">처음부터 실행 해 보지 않겠습니까?</font></font>
ru: Если вы проверите существование программы,то,скорее всего,вы все равно запустите ее позже.Почему бы не попробовать запустить ее в первую очередь?
zh_cn: 如果检查程序的存在,反正以后很可能是要运行它。为什么一开始就不尝试运行它呢?

source: If you guys/gals can't get the things in answers here to work and are pulling hair out of your back, try to run the same command using <code>bash -c</code>. Just look at this somnambular delirium. This is what really happening when you run $(sub-command):
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もしあなたたちがここで答えにあるものを機能させることができず、背中から髪を引っ張っているなら、</font></font> <code>bash -c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使って同じコマンドを実行してみてください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この陰鬱なせん妄を見てください。</font><font style="vertical-align: inherit;">これは、$（サブコマンド）を実行したときに実際に起こっていることです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">남자 / 여자가 여기에있는 답변을 얻지 못하고 머리카락을 등에서 빼내는 경우 </font></font> <code>bash -c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 동일한 명령을 실행하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 somnambular 섬망을보십시오. </font><font style="vertical-align: inherit;">이것은 $ (sub-command)를 실행할 때 실제로 일어나는 일입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы, ребята, не можете получить ответы на вопросы, приведенные здесь, в ответ и пытаетесь убрать волосы со спины, попробуйте выполнить ту же команду, используя </font></font> <code>bash -c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Просто посмотрите на этот сомнамбулярный бред. </font><font style="vertical-align: inherit;">Вот что действительно происходит, когда вы запускаете $ (подкоманда):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您无法在这里得到答案的答案，并且无法将头发拉出，请尝试使用</font></font> <code>bash -c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运行相同的命令</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">看看这个so骨so妄。</font><font style="vertical-align: inherit;">这是在运行$（子命令）时真正发生的情况：</font></font>

source: If your hash bang is <code>/bin/sh</code> then you should care about what POSIX says. <code>type</code> and <code>hash</code>'s exit codes aren't terribly well defined by POSIX, and <code>hash</code> is seen to exit successfully when the command doesn't exist (haven't seen this with <code>type</code> yet). <code>command</code>'s exit status is well defined by POSIX, so that one is probably the safest to use.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハッシュバンが</font></font> <code>/bin/sh</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、</font><font style="vertical-align: inherit;">POSIXの内容に注意する必要があります。</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の終了コードはPOSIXでは明確に定義されておらず、</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はコマンドが存在しない場合に正常に終了するように見えます（</font></font> <code>type</code> では<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まだ確認されていません）。 </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の終了ステータスはPOSIXによって明確に定義されているため、おそらく最も安全に使用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시 뱅이 </font></font> <code>/bin/sh</code> 인<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우 POSIX의 기능에주의해야합니다. </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 종료 코드는 POSIX에 의해 잘 정의 </font><font style="vertical-align: inherit;">되지 않았으며, 명령이 존재하지 않을 때 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 성공적으로 종료되는 것으로 보입니다 ( </font><font style="vertical-align: inherit;">아직 </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아직 </font><font style="vertical-align: inherit;">보이지 </font><font style="vertical-align: inherit;">않음). </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 종료 상태는 POSIX에 의해 잘 정의되어 있으므로 사용하기에 가장 안전합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если ваш хэш-bang - </font></font> <code>/bin/sh</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вам следует позаботиться о том, что говорит POSIX. </font><font style="vertical-align: inherit;">Коды выхода </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не очень хорошо определены в POSIX, и </font><font style="vertical-align: inherit;">считается, что </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> успешно завершается, когда команда не существует (еще не видел этого с </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> статус выхода &laquo;сек хорошо определяется POSIX, так что один, вероятно , </font><font style="vertical-align: inherit;">является самым </font><font style="vertical-align: inherit;">безопасным для использования.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您的哈希爆炸是</font></font> <code>/bin/sh</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">那么您应该注意POSIX所说的内容。</font><font style="vertical-align: inherit;">POSIX不能很好地定义</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的退出代码，并且</font><font style="vertical-align: inherit;">当命令不存在时，可以看到</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">成功退出（还没有在</font></font> <code>type</code> 上<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">看到</font><font style="vertical-align: inherit;">）。 </font><font style="vertical-align: inherit;">POSIX很好地定义了</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的退出状态，因此，使用它可能是最安全的。</font></font>

source: If your script uses <code>bash</code> though, POSIX rules don't really matter anymore and both <code>type</code> and <code>hash</code> become perfectly safe to use. <code>type</code> now has a <code>-P</code> to search just the <code>PATH</code> and <code>hash</code> has the side-effect that the command's location will be hashed (for faster lookup next time you use it), which is usually a good thing since you probably check for its existence in order to actually use it.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スクリプトが</font></font> <code>bash</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用している場合でも</font><font style="vertical-align: inherit;">、POSIXルールはもはや重要ではなく、</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方</font><font style="vertical-align: inherit;">を使用しても完全に安全になります。</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font> <code>PATH</code> <font style="vertical-align: inherit;">のみを検索</font><font style="vertical-align: inherit;">する</font></font> <code>-P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">あり、</font> <code>hash</code> <font style="vertical-align: inherit;">はコマンドの場所がハッシュされるという副作用があります（次回の使用時にルックアップを高速化するため）。これは通常、おそらくその存在を確認するので良いことです。実際に使用するための注文。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스크립트가 </font></font> <code>bash</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하는 경우 </font><font style="vertical-align: inherit;">POSIX 규칙은 더 이상 중요하지 않으며 </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 모두 </font><font style="vertical-align: inherit;">사용하기에 안전합니다. </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 </font> <code>PATH</code> <font style="vertical-align: inherit;"> 만 검색 </font><font style="vertical-align: inherit;">하는 </font></font> <code>-P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">있고 </font> <code>hash</code> <font style="vertical-align: inherit;"> 에는 명령 위치가 해시 될 부작용이 있습니다 (다음에 사용할 때 더 빨리 조회하기 위해). 실제로 사용하십시오.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако, если ваш сценарий использует </font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , правила POSIX больше не имеют значения, и оба </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> становятся совершенно безопасными для использования. </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теперь есть </font></font> <code>-P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для поиска только </font></font> <code>PATH</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а у </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> есть побочный эффект, заключающийся в том, что расположение команды будет хэшировано (для более быстрого поиска в следующий раз, когда вы ее используете), что обычно хорошо, так как вы, вероятно, проверяете ее существование в Для того, чтобы на самом деле использовать его.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您的脚本使用</font></font> <code>bash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则POSIX规则不再重要，</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变得非常安全。</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在具有</font></font> <code>-P</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来仅搜索</font></font> <code>PATH</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有副作用，即将对命令的位置进行哈希处理（以便下次使用时可以更快地查找），这通常是一件好事，因为您可能在其中检查了它的存在。以便实际使用它。</font></font>

source: In addition, this will fail if the command you are looking for has been defined as an alias.
ja: さらに、探しているコマンドがエイリアスとして定義されている場合は失敗します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 찾고있는 명령이 별명으로 정의 된 경우 실패합니다.</font></font>
ru: Кроме того,это будет неудачно,если команда,которую вы ищете,была определена как псевдоним.
zh_cn: 此外,如果你要找的命令被定义为别名,这将失败。

source: In case you want to check if a program exists <strong>and is really a program, not a Bash built-in command</strong>, then <code>command</code>, <code>type</code> and <code>hash</code> are not appropriate for testing as they all return 0 exit status for built-in commands.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プログラムが存在し</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、実際にプログラムであり、Bash組み込みコマンド</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font><strong><font style="vertical-align: inherit;">ない</font></strong><font style="vertical-align: inherit;">かどうかを確認する場合、</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はすべて組み込みコマンドの終了ステータス0を返すため、テストには適していません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그램이 존재하는 경우 경우에 당신은 확인하고 싶은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정말 배쉬가 내장 명령 프로그램이 아닌</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 다음 </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령에 내장 위해 그들이 모든 반환 0 종료 상태를 테스트하기 위해 적절한되지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите проверить, существует ли программа </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и является ли она программой, а не встроенной командой Bash</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не подходят для тестирования, так как все они возвращают 0 для состояния завершения встроенных команд.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要检查某个程序是否存在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且确实是一个程序，而不是Bash内置命令</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不适合测试，因为它们都返回内置命令的0退出状态。</font></font>
