Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: This script runs <code>hash</code> and then checks if the exit code of the most recent command, the value stored in <code>$?</code>, is equal to <code>1</code>. If <code>hash</code> doesn't find <code>foo</code>, the exit code will be <code>1</code>. If <code>foo</code> is present, the exit code will be <code>0</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このスクリプトは</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">実行し</font><font style="vertical-align: inherit;">、最新のコマンドの終了コード、</font></font> <code>$?</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">保存されている値をチェックし</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">は</font></font> <code>1</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等しい</font><font style="vertical-align: inherit;">。</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font> <code>foo</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つけられない</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、終了コードは</font></font> <code>1</code> になり<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">場合</font></font> <code>foo</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">存在し、終了コードになります</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 스크립트는 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 실행 </font><font style="vertical-align: inherit;">한 다음 가장 최근 명령의 종료 코드 ( </font></font> <code>$?</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 저장된 값)를 확인합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">, </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 같습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">경우 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 찾을 수없는 </font></font> <code>foo</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 종료 코드가 될 것입니다 </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">경우 </font></font> <code>foo</code> 는이<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 존재, 종료 코드가 될 것입니다 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот скрипт запускает </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем проверяет, хранится ли код завершения самой последней команды, значение хранится в </font></font> <code>$?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, равен </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не находит </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , код выхода будет </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> присутствует, код выхода будет </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该脚本运行</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后检查最新命令的退出代码是否存储在</font></font> <code>$?</code> 中。<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，等于</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找不到</font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则退出代码为</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果</font><font style="vertical-align: inherit;">存在</font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则退出代码将为</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: This will tell according to the location if the program exist or not:
ja: これは、プログラムが存在するかどうかを場所に応じて教えてくれます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그램이 존재하는지 여부에 따라 위치에 따라 알려줍니다.</font></font>
ru: Это покажет в зависимости от местоположения,существует программа или нет:
zh_cn: 这个会根据位置来判断程序是否存在。

source: To mimic Bash's <code>type -P cmd</code>, we can use the POSIX compliant <code>env -i type cmd 1&gt;/dev/null 2&gt;&amp;1</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bashの</font></font> <code>type -P cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を模倣</font><font style="vertical-align: inherit;">するには、POSIX準拠の</font></font> <code>env -i type cmd 1&gt;/dev/null 2&gt;&amp;1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash의 </font></font> <code>type -P cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 모방하기 위해 </font><font style="vertical-align: inherit;">POSIX 호환 </font></font> <code>env -i type cmd 1&gt;/dev/null 2&gt;&amp;1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы имитировать Bash </font></font> <code>type -P cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы можем использовать POSIX-совместимый </font></font> <code>env -i type cmd 1&gt;/dev/null 2&gt;&amp;1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要模拟Bash的</font></font> <code>type -P cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我们可以使用POSIX兼容的</font></font> <code>env -i type cmd 1&gt;/dev/null 2&gt;&amp;1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: To use <code>hash</code>, <a href="https://stackoverflow.com/questions/592620/check-if-a-program-exists-from-a-bash-script/677212#677212">as @lhunath suggests</a>, in a Bash script:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用する</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><a href="https://stackoverflow.com/questions/592620/check-if-a-program-exists-from-a-bash-script/677212#677212"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@lhunathが示唆するように</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bashスクリプトでは、：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용하려면 </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="https://stackoverflow.com/questions/592620/check-if-a-program-exists-from-a-bash-script/677212#677212"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@lhunath에서 알 수 있듯이</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배쉬 스크립트 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы использовать </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><a href="https://stackoverflow.com/questions/592620/check-if-a-program-exists-from-a-bash-script/677212#677212"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">как предполагает @lhunath</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , в скрипте Bash:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要</font><font style="vertical-align: inherit;">在Bash脚本中</font><font style="vertical-align: inherit;">使用</font><a href="https://stackoverflow.com/questions/592620/check-if-a-program-exists-from-a-bash-script/677212#677212"><font style="vertical-align: inherit;">@lhunath建议的</font></a></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，请</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">执行以下操作</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Try using:
ja: 使ってみてください。
ko: 다음을 사용하십시오.
ru: Попробуй использовать:
zh_cn: 试着使用。

source: Use Bash builtins if you can:
ja: できればBashのビルドインを使いましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가능한 경우 Bash 내장을 사용하십시오.</font></font>
ru: Используйте Bash builtins,если можете:
zh_cn: 如果可以的话,使用Bash内建程序。

source: Why care?
ja: なぜ気にする?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 신경써?</font></font>
ru: Какая разница?
zh_cn: 为什么要在意?

source: otherwise use
ja: さもなければ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇지 않으면 사용</font></font>
ru: иное использование
zh_cn: 否则就用

source: to have process executed. For this the parent folder of one_folder must be in <em>$PATH</em>. But when you try to hash this command, it will always succeed:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロセスを実行させる。</font><font style="vertical-align: inherit;">このため、one_folderの親フォルダーは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ PATHに</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なければなりません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、このコマンドをハッシュしようとすると、常に成功します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로세스가 실행되도록합니다. </font><font style="vertical-align: inherit;">이를 위해 one_folder의 상위 폴더는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ PATH에</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있어야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나이 명령을 해시하려고하면 항상 성공합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чтобы процесс был выполнен. </font><font style="vertical-align: inherit;">Для этого родительская папка one_folder должна быть в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ PATH</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но когда вы попытаетесь хешировать эту команду, она всегда будет успешной:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">执行流程。</font><font style="vertical-align: inherit;">为此，one_folder的父文件夹必须位于</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">$ PATH中</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，当您尝试哈希此命令时，它将始终成功：</font></font>
