Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Also note that if a non-executable file with the same name as the executable exists earlier in <code>$PATH</code>, dash returns the former, even though the latter would be executed. This is a bug and is in violation of the POSIX standard. [<a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=874264">Bug report</a>] [<a href="http://pubs.opengroup.org/onlinepubs/009696899/utilities/command.html">Standard</a>]
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、実行可能ファイルと同じ名前の非実行可能ファイルが</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前に存在する場合</font><font style="vertical-align: inherit;">、後者は実行されますが、ダッシュは前者を返します。</font><font style="vertical-align: inherit;">これはバグであり、POSIX標準に違反しています。</font><font style="vertical-align: inherit;">[ </font></font><a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=874264"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バグレポート</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] [ </font></font><a href="http://pubs.opengroup.org/onlinepubs/009696899/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 실행 파일과 동일한 이름을 가진 실행 파일이 아닌 파일이 </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일찍 존재 </font><font style="vertical-align: inherit;">하면 대시 </font><font style="vertical-align: inherit;">파일이 실행 </font><font style="vertical-align: inherit;">되더라도 대시가 전자를 반환합니다. </font><font style="vertical-align: inherit;">이것은 버그이며 POSIX 표준을 위반합니다. </font><font style="vertical-align: inherit;">[ </font></font><a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=874264"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버그 리포트</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] [ </font></font><a href="http://pubs.opengroup.org/onlinepubs/009696899/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также обратите внимание, что если в </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ранее не существует исполняемого файла с тем же именем, что и у исполняемого файла </font><font style="vertical-align: inherit;">, то он возвращает первый, даже если последний будет выполнен. </font><font style="vertical-align: inherit;">Это ошибка, которая нарушает стандарт POSIX. </font><font style="vertical-align: inherit;">[ </font></font><a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=874264"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Отчет об ошибке</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] [ </font></font><a href="http://pubs.opengroup.org/onlinepubs/009696899/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стандарт</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还要注意，如果</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之前存在与可执行文件同名的不可执行文件</font><font style="vertical-align: inherit;">，则dash会返回前者，即使后者将被执行。</font><font style="vertical-align: inherit;">这是一个错误，并且违反了POSIX标准。</font><font style="vertical-align: inherit;">[ </font></font><a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=874264"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误报告</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ] [ </font></font><a href="http://pubs.opengroup.org/onlinepubs/009696899/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]</font></font>

source: As a simple example, here's a function that runs <code>gdate</code> if it exists, otherwise <code>date</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">簡単な例として、</font><font style="vertical-align: inherit;">存在する場合</font><font style="vertical-align: inherit;">は</font></font> <code>gdate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行</font><font style="vertical-align: inherit;">し、存在しない場合は</font></font> <code>date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行する関数を次に示し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 예를 들어, 다음은 </font></font> <code>gdate</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있으면 </font><font style="vertical-align: inherit;">실행하는 함수입니다 </font><font style="vertical-align: inherit;">. 그렇지 않으면 </font></font> <code>date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В качестве простого примера, вот функция, которая запускает </font></font> <code>gdate</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если она существует, в противном случае </font></font> <code>date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为一个简单的示例，这是一个运行</font></font> <code>gdate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的函数（</font><font style="vertical-align: inherit;">如果存在），否则运行</font></font> <code>date</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: As you can see from the above, a "0" answer from the query means the package is not installed. This is a function of "grep" - a "0" means a match was found, a "1" means no match was found.
ja: 上で見たように、クエリの答えが "0 "の場合はパッケージがインストールされていないことを意味します。これは "grep" の機能です-"0" は一致するものが見つかったことを意味し、"1" は一致するものが見つからなかったことを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위에서 볼 수 있듯이 쿼리에서 "0"응답은 패키지가 설치되지 않았 음을 의미합니다. </font><font style="vertical-align: inherit;">이것은 "grep"의 기능입니다. "0"은 일치 항목이 발견되었음을 의미하고 "1"은 일치 항목이 발견되지 않음을 의미합니다.</font></font>
ru: Как видно из вышеизложенного,ответ "0" из запроса означает,что пакет не установлен.Это функция "grep"-"0" означает,что найдено совпадение,"1" означает,что совпадение не найдено.
zh_cn: 从上图中可以看出,查询结果为 "0 "表示没有安装该软件包。这是 "grep "的一个函数--"0 "表示找到了匹配,"1 "表示没有找到匹配。

source: Assuming you are already <a href="https://sipb.mit.edu/doc/safe-shell/">following safe shell practices</a>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたがすでに</font></font><a href="https://sipb.mit.edu/doc/safe-shell/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">安全なシェル慣行に従っ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ていると仮定します</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 </font></font><a href="https://sipb.mit.edu/doc/safe-shell/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안전한 쉘 관행을 따르고</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있다고 가정합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предполагая, что вы уже </font></font><a href="https://sipb.mit.edu/doc/safe-shell/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">соблюдаете правила безопасной оболочки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设您已经</font></font><a href="https://sipb.mit.edu/doc/safe-shell/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遵循安全的shell做法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: At least on <a href="https://en.wikipedia.org/wiki/Mac_OS_X_Snow_Leopard">Mac OS X v10.6.8</a> (Snow&nbsp;Leopard) using Bash 4.2.24(2) <code>command -v ls</code> does not match a moved <code>/bin/ls-temp</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">少なくとも</font></font><a href="https://en.wikipedia.org/wiki/Mac_OS_X_Snow_Leopard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mac OS X v10.6.8</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（Snow Leopard）では、Bash 4.2.24（2）</font></font> <code>command -v ls</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">と、移動した</font></font> <code>/bin/ls-temp</code> と<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一致しません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 4.2.24 (2) </font> <code>command -v ls</code> <font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하는 </font></font><a href="https://en.wikipedia.org/wiki/Mac_OS_X_Snow_Leopard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mac OS X v10.6.8</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Snow Leopard) </font><font style="vertical-align: inherit;">에서 이동 된 </font> <code>/bin/ls-temp</code> <font style="vertical-align: inherit;"> 와 일치하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">По крайней мере, в </font></font><a href="https://en.wikipedia.org/wiki/Mac_OS_X_Snow_Leopard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mac OS X 10.6.8</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Snow Leopard) с использованием Bash 4.2.24 (2) </font></font> <code>command -v ls</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не соответствует перемещенному </font></font> <code>/bin/ls-temp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">至少在</font></font><a href="https://en.wikipedia.org/wiki/Mac_OS_X_Snow_Leopard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mac OS X v10.6.8</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（Snow Leopard）上，使用Bash 4.2.24（2）</font></font> <code>command -v ls</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与移动的</font></font> <code>/bin/ls-temp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不匹配</font><font style="vertical-align: inherit;">。</font></font>

source: Avoid <code>which</code>. Not only is it an external process you're launching for doing very little (meaning builtins like <code>hash</code>, <code>type</code> or <code>command</code> are way cheaper), you can also rely on the builtins to actually do what you want, while the effects of external commands can easily vary from system to system.
ja: <font style="vertical-align: inherit;"></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">避ける</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">非常に少ないことを実行するために起動している外部プロセスであるだけでなく（</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などのビルトインがはるかに安価であることを</font><font style="vertical-align: inherit;">意味し</font><font style="vertical-align: inherit;">ます）、ビルトインに依存して実際に必要なことを実行できますが、外部コマンドの影響は可能ですシステムごとに簡単に異なります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 피하십시오 </font><font style="vertical-align: inherit;">. </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 같은 내장 기능 </font><font style="vertical-align: inherit;">이 훨씬 저렴 </font><font style="vertical-align: inherit;">하다는 것을 의미하기 위해 시작하는 외부 프로세스 일뿐 만 아니라 내장 </font><font style="vertical-align: inherit;">명령</font><font style="vertical-align: inherit;"> 을 사용하여 실제로 원하는 것을 수행 할 수 있으며 외부 명령의 효과는 시스템마다 쉽게 다를 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Избегайте </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Мало того, что это внешний процесс, который вы запускаете для выполнения очень мало (то есть встроенные </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font><font style="vertical-align: inherit;">такие как </font><font style="vertical-align: inherit;">хэш</font><font style="vertical-align: inherit;"> , </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , намного дешевле), вы также можете полагаться на встроенные функции, которые действительно делают то, что вы хотите, в то время как эффекты внешних команд могут легко варьироваться от системы к системе.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">避免</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">它不仅是您为执行很少工作而启动的外部进程（意味着像</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样的</font><font style="vertical-align: inherit;">内建</font><font style="vertical-align: inherit;">函数</font><font style="vertical-align: inherit;">要便宜得多），还可以依靠内建函数实际执行所需的操作，而外部命令的效果却可以随系统而异。</font></font>

source: Command <code>-v</code> works fine if the POSIX_BUILTINS option is set for the <code>&lt;command&gt;</code> to test for, but it can fail if not. (It has worked for me for years, but I recently ran into one where it didn't work.)
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font></font> <code>-v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、テスト</font><font style="vertical-align: inherit;">する</font></font> <code>&lt;command&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">POSIX_BUILTINSオプションが設定されている場合は正常に機能しますが</font><font style="vertical-align: inherit;">、そうでない場合は失敗する可能性があります。</font><font style="vertical-align: inherit;">（それは私にとって何年も働いていましたが、私は最近それがうまくいかなかったものに遭遇しました。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">POSIX_BUILTINS 옵션이 </font> <code>&lt;command&gt;</code> 에<font style="vertical-align: inherit;"> 대해 테스트되도록 </font><font style="vertical-align: inherit;">설정되어 있으면 </font></font> <code>-v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">이 제대로 작동 </font><font style="vertical-align: inherit;">하지만 그렇지 않으면 실패 할 수 있습니다. </font><font style="vertical-align: inherit;">(수년 동안 저에게 효과가 있었지만 최근에는 작동하지 않는 곳에 왔습니다.)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Команда </font></font> <code>-v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работает нормально, если для параметра </font></font> <code>&lt;command&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> установлена ​​опция POSIX_BUILTINS </font><font style="vertical-align: inherit;">, но в противном случае она может завершиться ошибкой. </font><font style="vertical-align: inherit;">(Это работало для меня годами, но недавно я столкнулся с тем, где это не сработало.)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果为</font> <code>&lt;command&gt;</code> <font style="vertical-align: inherit;">设置了POSIX_BUILTINS选项</font><font style="vertical-align: inherit;">以进行测试，则</font><font style="vertical-align: inherit;">命令</font></font> <code>-v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以正常</font><font style="vertical-align: inherit;">工作，但如果未设置则可能失败。</font><font style="vertical-align: inherit;">（它对我有用了很多年，但是最近我遇到了一个不起作用的地方。）</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Command <code>command</code> is POSIX compliant. See here for its specification: <em><a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/command.html">command - execute a simple command</a></em>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はPOSIXに準拠しています。</font><font style="vertical-align: inherit;">仕様についてはこちらをご覧ください：</font></font><em><a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド-簡単なコマンドを実行します</font></font></a></em>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명령 </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 POSIX를 준수합니다. </font><font style="vertical-align: inherit;">사양은 여기를 참조하십시오 : </font></font><em><a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">command-간단한 명령을 실행합니다</font></font></a></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Командная </font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является POSIX-совместимой. </font><font style="vertical-align: inherit;">Смотрите здесь для его спецификации: </font></font><em><a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">команда - выполнить простую команду</font></font></a></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font></font> <code>command</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符合POSIX。</font><font style="vertical-align: inherit;">有关其规格，请参见此处：</font></font><em><a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/command.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令-执行一个简单的命令</font></font></a></em>

source: Expanding on @lhunath's and @GregV's answers, here's the code for the people who want to easily put that check inside an <code>if</code> statement:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@lhunathと@GregVの答えを拡張して、</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">内にそのチェックを簡単に入れたい人のためのコードを次に示します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@lhunath 및 @GregV의 답변을 확장하여 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문 </font><font style="vertical-align: inherit;">안에 해당 확인을 쉽게 넣기를 원하는 사람들을위한 코드는 다음과 </font><font style="vertical-align: inherit;">같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Расширяя ответы @ lhunath и @ GregV, вот код для людей, которые хотят легко поместить эту проверку в оператор </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">扩展@lhunath和@GregV的答案，这是那些想要轻松地将检查放在</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句中</font><font style="vertical-align: inherit;">的人的代码</font><font style="vertical-align: inherit;">：</font></font>

source: First. It can give you completely different output.
ja: 最初に 全く違う出力を出すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저. </font><font style="vertical-align: inherit;">완전히 다른 출력을 줄 수 있습니다.</font></font>
ru: Сначала.Это может дать вам совершенно другой результат.
zh_cn: 首先。它可以给你完全不同的输出。

source: For Bash specific environments:
ja: Bash特有の環境のため。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 특정 환경의 경우 :</font></font>
ru: Для особых условий Бэша:
zh_cn: 针对Bash的特定环境。
