Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Of course, only the last one is problematic (no offence to Ringo!). But all of them are valid <code>alias</code>es from the point of view of <code>command -v</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もちろん、最後の1つだけが問題です（Ringoに害はありません！）。</font><font style="vertical-align: inherit;">しかし、それらはすべて、</font> <code>command -v</code> <font style="vertical-align: inherit;">の観点から</font><font style="vertical-align: inherit;">は有効な</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론, 마지막 것만 문제가 있습니다 (Ringo에 대한 위반은 없습니다!). </font><font style="vertical-align: inherit;">그러나 이들 모두는 </font> <code>command -v</code> <font style="vertical-align: inherit;"> 의 관점에서 </font><font style="vertical-align: inherit;">유효한 </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Конечно, проблематично только последнее (без обид на Ринго!). </font><font style="vertical-align: inherit;">Но все они являются действительными </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с точки зрения </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当然，只有最后一个是有问题的（林戈没有冒犯！）。</font><font style="vertical-align: inherit;">但是</font><font style="vertical-align: inherit;">从</font> <code>command -v</code> <font style="vertical-align: inherit;">的角度来看，</font><font style="vertical-align: inherit;">它们都是有效的</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: POSIX compatible:
ja: POSIXに対応しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">POSIX 호환 :</font></font>
ru: совместимость с POSIX:
zh_cn: POSIX兼容。

source: Plus you can get some useful result from your program, such as its version.
ja: さらに、あなたのプログラムのバージョンなど、あなたのプログラムからいくつかの有用な結果を得ることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 프로그램과 같은 버전에서 유용한 결과를 얻을 수 있습니다.</font></font>
ru: Кроме того,вы можете получить полезный результат от своей программы,например,ее версию.
zh_cn: 加上你可以从你的程序中得到一些有用的结果,比如说它的版本。

source: Sample output:
ja: サンプル出力。
ko: 샘플 출력 :
ru: Вывод образца:
zh_cn: 样品输出。

source: Second. It can give you no output at all.
ja: 第二に 全く出力が出ないこともあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘째. </font><font style="vertical-align: inherit;">전혀 출력을 줄 수 없습니다.</font></font>
ru: Во-вторых.Это может вообще не дать никакого результата.
zh_cn: 其次。它可以让你完全没有输出。

source: See: <em><a href="https://stackoverflow.com/questions/1298066/check-if-an-apt-get-package-is-installed-and-then-install-it-if-its-not-on-linu/54239534#54239534">Check if an apt-get package is installed and then install it if it's not on Linux</a></em>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照：</font></font><em><a href="https://stackoverflow.com/questions/1298066/check-if-an-apt-get-package-is-installed-and-then-install-it-if-its-not-on-linu/54239534#54239534"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">apt-getパッケージがインストールされているかどうかを確認し、Linuxにインストールされていない場合はインストールしてください</font></font></a></em>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">: 참조 </font></font><em><a href="https://stackoverflow.com/questions/1298066/check-if-an-apt-get-package-is-installed-and-then-install-it-if-its-not-on-linu/54239534#54239534"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">apt-get을 패키지가 설치되어 있는지 확인하고 리눅스 아니라면 다음 설치</font></font></a></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">См .: </font></font><em><a href="https://stackoverflow.com/questions/1298066/check-if-an-apt-get-package-is-installed-and-then-install-it-if-its-not-on-linu/54239534#54239534"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте, установлен ли пакет apt-get, а затем установите его, если он не в Linux.</font></font></a></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请参阅：</font></font><em><a href="https://stackoverflow.com/questions/1298066/check-if-an-apt-get-package-is-installed-and-then-install-it-if-its-not-on-linu/54239534#54239534"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查是否已安装apt-get软件包，如果不在Linux上，请先安装它</font></font></a></em>

source: Since it tests for three things: path, existence and execution permission.
ja: パス、存在、実行許可の3つをテストするので。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경로, 존재 및 실행 권한의 세 가지를 테스트하기 때문에.</font></font>
ru: Поскольку он проверяет три вещи:путь,существование и разрешение на исполнение.
zh_cn: 因为它要测试三点:路径、存在和执行权限。

source: So, don't use <code>which</code>. Instead use one of these:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は使用しないでください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">代わりに次のいずれかを使用してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font></font> <code>which</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하지 마십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">대신 다음 중 하나를 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так что не используйте </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вместо этого используйте один из них:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，请勿使用</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">而是使用以下之一：</font></font>

source: The <code>which</code> command might be useful. <a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?which">man which</a>
ja: <font style="vertical-align: inherit;"></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドが便利かもしれません。</font></font><a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?which"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">男は</font></font></a>
ko: <font style="vertical-align: inherit;"></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 유용 할 수 있습니다. </font></font><a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?which"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 남자</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Команда </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может быть полезной. </font></font><a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?which"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">человек, который</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令可能是有用的。</font></font><a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?which"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">哪个</font></font></a>

source: The executable check is needed because bash returns a non-executable file if no executable file with that name is found in <code>$PATH</code>.
ja: <font style="vertical-align: inherit;"></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その名前の実行可能ファイルが見つからない場合、bashは非実行可能ファイルを返すため、実行可能チェックが必要です</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 해당 이름의 실행 파일이 없으면 bash가 실행 파일이 아닌 파일을 반환하므로 실행 파일 검사가 필요합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверка исполняемого файла необходима, потому что bash возвращает неисполняемый файл, если в </font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> найден исполняемый файл с таким именем </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要执行可执行检查，因为如果在</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找不到具有该名称的可执行文件，则bash返回一个非可执行文件</font><font style="vertical-align: inherit;">。</font></font>

source: The following is a portable way to check whether a command exists in <code>$PATH</code><em>and</em> is executable:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のコマンドが存在するかどうかをチェックするための移植性のある方法である</font></font> <code>$PATH</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実行可能です：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 명령에 존재하는지 여부를 확인하는 휴대용 방법입니다 </font></font> <code>$PATH</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">및</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 실행입니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ниже представлен переносимый способ проверить, существует ли команда в </font></font> <code>$PATH</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является ли она исполняемой:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下是检查命令在</font></font> <code>$PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否存在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可执行</font><font style="vertical-align: inherit;">的便携式方法</font><font style="vertical-align: inherit;">：</font></font>

source: The hash-variant has one pitfall: On the command line you can for example type in
ja: ハッシュ変数には1つの落とし穴があります。コマンドラインでは、例えば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시 변형에는 하나의 함정이 있습니다. 명령 행에서 예를 들어</font></font>
ru: Хэш-вариант имеет один подводный камень:В командной строке вы можете,например,напечатать
zh_cn: 哈希变量有一个缺陷。在命令行中,你可以在命令行中键入

source: The nice thing about <code>which</code> is that it figures out if the executable is available in the environment that <code>which</code> is run in - it saves a few problems...
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いいところ</font><font style="vertical-align: inherit;">実行ファイルがその環境で利用可能な場合には割り出しということです</font> <code>which</code> <font style="vertical-align: inherit;">中で実行されます-それはいくつかの問題が保存されます...</font></font> <code>which</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">좋은 점에 대해 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 실행 파일이있는 환경에서 사용할 수있는 경우가 파악한다는 것입니다 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 실행 - 그것은 몇 가지 문제를 저장 ...</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хорошая вещь о </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является то , </font><font style="vertical-align: inherit;">что он выясняет , </font><font style="vertical-align: inherit;">если исполняемый файл доступен в среде, </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выполняется в - это экономит несколько проблем ...</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这种做法的好处关于</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就是它计算出如果可执行文件是在该环境中可用</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在运行-这样可以节省一些问题...</font></font>

source: The redirection to <code>/dev/null/</code> in the first example suppresses the output of the <code>which</code> program.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初の例の</font></font> <code>/dev/null/</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">へのリダイレクト</font><font style="vertical-align: inherit;">は、</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プログラムの</font><font style="vertical-align: inherit;">出力を抑制します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 예에서 </font></font> <code>/dev/null/</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 </font><font style="vertical-align: inherit;">의 리디렉션 </font><font style="vertical-align: inherit;">은 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로그램 </font><font style="vertical-align: inherit;">의 출력을 억제합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Перенаправление на </font></font> <code>/dev/null/</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в первом примере подавляет вывод </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> программы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第一个示例中</font><font style="vertical-align: inherit;">，重定向到</font></font> <code>/dev/null/</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抑制了</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序</font><font style="vertical-align: inherit;">的输出</font><font style="vertical-align: inherit;">。</font></font>

source: There are a ton of options here, but I was surprised no quick one-liners. This is what I used at the beginning of my scripts:
ja: ここにはたくさんのオプションがありますが、私は驚いたことにクイックワンライナーがありませんでした。これは私がスクリプトの最初に使ったものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에는 많은 옵션이 있지만 빠른 원 라이너가 없다는 것에 놀랐습니다. </font><font style="vertical-align: inherit;">이것은 스크립트 시작 부분에서 사용한 것입니다.</font></font>
ru: Здесь много вариантов,но я удивился,что нет быстрых однослойных.Это то,что я использовал в начале своих сценариев:
zh_cn: 这里有一吨的选项,但我很惊讶没有快速的单行本。这是我在脚本开始的时候用的。

source: This assumes the command can be invoked in such a way that it does (almost) nothing, like reporting its version or showing help.
ja: これは、コマンドのバージョンを報告したり、ヘルプを表示したりするなど、何もしない(ほとんど)方法でコマンドを呼び出すことができることを前提としています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 버전을보고하거나 도움말을 표시하는 것과 같이 (거의) 아무것도하지 않는 방식으로 명령을 호출 할 수 있다고 가정합니다.</font></font>
ru: Это предполагает,что команда может быть вызвана таким образом,что она (почти)ничего не делает,например,сообщает о своей версии или показывает помощь.
zh_cn: 这假设该命令可以以这样的方式被调用,它(几乎)什么也不做,比如报告它的版本或显示帮助。

source: This is based on the selected answer here and another source.
ja: これは、ここで選択された答えと別のソースに基づいています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 선택한 답변과 다른 출처를 기반으로합니다.</font></font>
ru: Это основано на выбранном здесь ответе и другом источнике.
zh_cn: 这是根据这里选择的答案和另一个来源的答案。

source: This is more useful and less verbose than the other <code>command -v</code> (and similar) answers because the error message is auto generated and also contains a relevant line number.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エラーメッセージは自動生成され、関連する行番号も含まれているため、</font><font style="vertical-align: inherit;">これは他の</font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（および同様の）の回答</font><font style="vertical-align: inherit;">よりも便利で冗長ではありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오류 메시지가 자동으로 생성되고 관련 행 번호가 포함되어 있기 때문에 </font><font style="vertical-align: inherit;">다른 </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (및 유사한) 응답 </font><font style="vertical-align: inherit;">보다 유용하고 덜 장황합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это более полезно и менее многословно, чем </font><font style="vertical-align: inherit;">ответы </font><font style="vertical-align: inherit;">других </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (и аналогичных), поскольку сообщение об ошибке генерируется автоматически и также содержит соответствующий номер строки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是比其他</font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（及类似</font><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">）答案</font><font style="vertical-align: inherit;">更有用且更省时的方法，</font><font style="vertical-align: inherit;">因为该错误消息是自动生成的，并且还包含相关的行号。</font></font>
