Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: (Minor side-note: some will suggest <code>2&gt;&amp;-</code> is the same <code>2&gt;/dev/null</code> but shorter &ndash; <em>this is untrue</em>. <code>2&gt;&amp;-</code> closes FD 2 which causes an <strong>error</strong> in the program when it tries to write to stderr, which is very different from successfully writing to it and discarding the output (and dangerous!))
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（副次的注意：</font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は同じ</font></font> <code>2&gt;/dev/null</code> である<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が、これよりも短い</font><font style="vertical-align: inherit;">ことを示唆する人もい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは正しくあり</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません</font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> FD 2を閉じ</font><font style="vertical-align: inherit;">、プログラムがstderrに書き込もうとすると</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エラー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が発生し</font><strong><font style="vertical-align: inherit;">ます。</font></strong><font style="vertical-align: inherit;">、正常に書き込み、出力を破棄することとは非常に異なります（そして危険です！））</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(부 사이드 참고 일부 제안한다 </font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동일 </font></font> <code>2&gt;/dev/null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -, 짧은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 사실이다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 발생 FD 2 폐쇄 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오류</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 열려진에 기록하려고 할 때, 프로그램의 , 성공적으로 쓰고 출력을 버리는 것과 매우 다릅니다 (그리고 위험합니다!)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Незначительное замечание: некоторые предложат </font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> это то же самое </font></font> <code>2&gt;/dev/null</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> но короче - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это неверно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> закрывает FD 2, что вызывает </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ошибку</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в программе, когда она пытается записать в stderr , что сильно отличается от успешной записи в него и отбрасывания вывода (и опасно!))</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（次要侧面说明：一些将建议</font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是相同的</font></font> <code>2&gt;/dev/null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但较短的- </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是不真实的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 </font></font> <code>2&gt;&amp;-</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关闭FD 2，其导致一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时，它试图写入到stderr在程序，与成功写入并丢弃输出有很大不同（很危险！）</font></font>

source: <code>&amp;&gt; /dev/null</code> redirects <a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_error_(stderr)">standard error</a> and <a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_.28stdout.29">standard output</a> from <code>hash</code> so that it doesn't appear onscreen and <code>echo &gt;&amp;2</code> writes the message to standard error.
ja: <code>&amp;&gt; /dev/null</code> <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_error_(stderr)"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準エラー</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_.28stdout.29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準出力</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">リダイレクト</font><font style="vertical-align: inherit;">して、画面に表示されないようにし、</font></font> <code>echo &gt;&amp;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でメッセージを標準エラーに書き込みます。</font></font>
ko: <code>&amp;&gt; /dev/null</code> <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_error_(stderr)"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준 오류</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font> <code>hash</code> </font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_.28stdout.29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준 출력</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">재지 정하여 </font><font style="vertical-align: inherit;">화면에 표시되지 않고 </font> <code>echo &gt;&amp;2</code> <font style="vertical-align: inherit;"> 가 메시지를 표준 오류에 기록합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <code>&amp;&gt; /dev/null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> перенаправляет </font></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_error_(stderr)"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стандартную ошибку</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_.28stdout.29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стандартный вывод</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы он не отображался на экране, а </font></font> <code>echo &gt;&amp;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> записывает сообщение в стандартную ошибку.</font></font>
zh_cn: <code>&amp;&gt; /dev/null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重定向</font></font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_error_(stderr)"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准错误</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font><font style="vertical-align: inherit;">来自</font> <code>hash</code> </font><a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_.28stdout.29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准输出</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">以便它不会出现在屏幕上，并且</font> <code>echo &gt;&amp;2</code> <font style="vertical-align: inherit;">将消息写入标准错误。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <code>command -v foo</code>: works with Z shell, Bash, Dash, but not ash (BusyBox) (<code>-ash: command: not found</code>).
ja: <code>command -v foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：Zシェル、Bash、Dashでは機能しますが、ashでは機能しません（BusyBox）（- </font></font> <code>-ash: command: not found</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>
ko: <code>command -v foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Z shell, Bash, Dash와 함께 작동하지만 ash (BusyBox)에서는 작동하지 않습니다 ( </font></font> <code>-ash: command: not found</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <code>command -v foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : работает с оболочкой Z, Bash, Dash, но не с пеплом (BusyBox) ( </font></font> <code>-ash: command: not found</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <code>command -v foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：与Z shell，Bash，Dash一起使用，但不适用于ash（BusyBox）（- </font></font> <code>-ash: command: not found</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: <code>type -p foo</code>: it appears to work with Z shell, Bash and ash (<a href="https://en.wikipedia.org/wiki/BusyBox">BusyBox</a>), but not Dash (it interprets <code>-p</code> as an argument).
ja: <code>type -p foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：Zシェル、Bash、およびash（</font></font><a href="https://en.wikipedia.org/wiki/BusyBox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BusyBox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）では機能しますが、Dashでは機能しません（</font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を引数として</font><font style="vertical-align: inherit;">解釈</font><font style="vertical-align: inherit;">します）。</font></font>
ko: <code>type -p foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Z 쉘, Bash 및 ash ( </font></font><a href="https://en.wikipedia.org/wiki/BusyBox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BusyBox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )와 작동하지만 Dash ( </font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 인수로 </font><font style="vertical-align: inherit;">해석) </font><font style="vertical-align: inherit;">와는</font><font style="vertical-align: inherit;"> 작동하지 않는 것으로 보입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <code>type -p foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : он работает с оболочкой Z, Bash и ash ( </font></font><a href="https://en.wikipedia.org/wiki/BusyBox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BusyBox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), но не с Dash (интерпретирует </font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в качестве аргумента).</font></font>
zh_cn: <code>type -p foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：它似乎可与Z shell，Bash和ash（</font></font><a href="https://en.wikipedia.org/wiki/BusyBox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BusyBox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）一起使用，但不适用于Dash（它将</font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解释</font><font style="vertical-align: inherit;">为参数）。</font></font>

source: <strong><code>hash foo 2&gt;/dev/null</code></strong>: works with Z shell (Zsh), Bash, <a href="https://en.wikipedia.org/wiki/Almquist_shell#dash:_Ubuntu,_Debian_and_POSIX_compliance_of_Linux_distributions">Dash</a> and <a href="https://en.wikipedia.org/wiki/Almquist_shell">ash</a>.
ja: <strong> <code>hash foo 2&gt;/dev/null</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：Zシェル（Zsh）、Bash、</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell#dash:_Ubuntu,_Debian_and_POSIX_compliance_of_Linux_distributions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ashで動作し</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <strong> <code>hash foo 2&gt;/dev/null</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Z shell (Zsh), Bash,</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell#dash:_Ubuntu,_Debian_and_POSIX_compliance_of_Linux_distributions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 함께 작동합니다</font><font style="vertical-align: inherit;">.</font></font>
ru: <strong> <code>hash foo 2&gt;/dev/null</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : работает с Z shell (Zsh), Bash,</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell#dash:_Ubuntu,_Debian_and_POSIX_compliance_of_Linux_distributions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong> <code>hash foo 2&gt;/dev/null</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：与Z shell（Zsh），Bash，</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell#dash:_Ubuntu,_Debian_and_POSIX_compliance_of_Linux_distributions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Dash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://en.wikipedia.org/wiki/Almquist_shell"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ash一起使用</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong>Check for multiple dependencies and inform status to end users</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数の依存関係をチェックし、ステータスをエンドユーザーに通知する</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 종속성을 확인하고 최종 사용자에게 상태를 알리십시오.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте наличие нескольких зависимостей и сообщите статус конечным пользователям.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查多个依赖项并将状态通知最终用户</font></font></strong>

source: <strong>Check if some <code>apt</code> packages are installed with <code>dpkg -s</code> and install them otherwise</strong>.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いくつかの</font></font> <code>apt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージが</font></font> <code>dpkg -s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でインストール</font><font style="vertical-align: inherit;">されている</font><font style="vertical-align: inherit;">かどうかを確認し、</font><font style="vertical-align: inherit;">そうでない場合はインストールします</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 </font></font> <code>apt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지가 </font></font> <code>dpkg -s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font><font style="vertical-align: inherit;">함께 설치되어 </font><font style="vertical-align: inherit;">있는지 확인 </font><font style="vertical-align: inherit;">하고 그렇지 않으면 설치하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте, установлены ли некоторые </font><font style="vertical-align: inherit;">пакеты </font></font> <code>apt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью </font></font> <code>dpkg -s</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и установите их в противном случае</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查</font> <code>dpkg -s</code> <font style="vertical-align: inherit;">是否安装了</font><font style="vertical-align: inherit;">一些</font></font> <code>apt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">软件包，</font><font style="vertical-align: inherit;">否则安装它们</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Adjust the <code>10</code> to the maximum command length. It is not automatic, because I don't see a non-verbose POSIX way to do it: <em><a href="https://stackoverflow.com/questions/6602732/realign-columns-of-file-in-bash">How can I align the columns of a space separated table in Bash?</a></em>
ja: <font style="vertical-align: inherit;"></font> <code>10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を最大コマンド長に</font><font style="vertical-align: inherit;">調整し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">冗長でないPOSIXの方法が見当たらないため、自動ではありません。 </font></font><em><a href="https://stackoverflow.com/questions/6602732/realign-columns-of-file-in-bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スペースで区切られたテーブルの列をBashで整列するにはどうすればよいですか？</font></font></a></em>
ko: <font style="vertical-align: inherit;"></font> <code>10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 최대 명령 길이로 </font><font style="vertical-align: inherit;">조정하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">자세한 POSIX 방법이 보이지 않기 때문에 자동이 아닙니다 </font></font><em><a href="https://stackoverflow.com/questions/6602732/realign-columns-of-file-in-bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.Bash에서 공백으로 구분 된 테이블의 열을 어떻게 정렬 할 수 있습니까?</font></font></a></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Отрегулируйте </font></font> <code>10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> до максимальной длины команды. </font><font style="vertical-align: inherit;">Это не автоматически, потому что я не вижу невербального POSIX способа сделать это: </font></font><em><a href="https://stackoverflow.com/questions/6602732/realign-columns-of-file-in-bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу выровнять столбцы разделенной пробелами таблицы в Bash?</font></font></a></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font> <code>10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调整为</font><font style="vertical-align: inherit;">最大命令长度。</font><font style="vertical-align: inherit;">它不是自动的，因为我看不到非冗长的POSIX方法： </font></font><em><a href="https://stackoverflow.com/questions/6602732/realign-columns-of-file-in-bash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如何在Bash中对齐以空格分隔的表的列？</font></font></a></em>

source: Also note that <code>builtin</code> is not available with ash and Dash.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font> <code>builtin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はashおよびDashでは使用できない</font><font style="vertical-align: inherit;">ことに注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font><font style="vertical-align: inherit;">ash 및 Dash에는 </font></font> <code>builtin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기능을 사용할 수 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также обратите внимание, что </font></font> <code>builtin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не доступен с пеплом и чертой.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另请注意，</font><font style="vertical-align: inherit;">ash和Dash不提供</font></font> <code>builtin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功能。</font></font>
