Repository: rueisnom/feedback
Catalog: xlf/59/26/20/592620.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: For example <code>apache2</code>. So this was my solution:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font></font> <code>apache2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">これが私の解決策でした：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font></font> <code>apache2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">그래서 이것은 내 해결책이었습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например </font></font> <code>apache2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Так что это было мое решение:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如</font></font> <code>apache2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">所以这是我的解决方案：</font></font>

source: For example, there is the <strong>time</strong> program which offers more features than the <strong>time</strong> built-in command. To check if the program exists, I would suggest using <code>which</code> as in the following example:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">time</font></strong><font style="vertical-align: inherit;">組み込みコマンド</font><font style="vertical-align: inherit;">よりも多くの機能を提供</font><font style="vertical-align: inherit;">する</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">time</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プログラムがあります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">プログラムが存在するかどうかを確認するに</font><font style="vertical-align: inherit;">は、次の例のように</font> <code>which</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用することをお勧めし</font><font style="vertical-align: inherit;">ます。</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font><strong><font style="vertical-align: inherit;">시간</font></strong><font style="vertical-align: inherit;"> 내장 명령 </font><font style="vertical-align: inherit;">보다 더 많은 기능을 제공 </font><font style="vertical-align: inherit;">하는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시간</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로그램이 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">프로그램이 존재하는지 확인하려면 </font><font style="vertical-align: inherit;">다음 예제와 같이 </font> <code>which</code> <font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하는</font><font style="vertical-align: inherit;"> 것이 좋습니다 </font><font style="vertical-align: inherit;">.</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, есть </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">время</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> программа , </font><font style="vertical-align: inherit;">которая предоставляет больше возможностей , </font><font style="vertical-align: inherit;">чем </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">время</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> встроенного команды. </font><font style="vertical-align: inherit;">Чтобы проверить, существует ли программа, я бы предложил использовать </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как в следующем примере:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，有一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时间</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序，它提供了比</font><font style="vertical-align: inherit;">内置</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时间</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">更多的功能</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">要检查该程序是否存在，建议</font><font style="vertical-align: inherit;">在以下示例中</font><font style="vertical-align: inherit;">使用</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序</font><font style="vertical-align: inherit;">：</font></font>

source: For those interested, none of the methodologies in previous answers work if you wish to detect an installed library. I imagine you are left either with physically checking the path (potentially for header files and such), or something like this (if you are on a Debian-based distribution):
ja: 興味のある方のために、インストールされたライブラリを検出したい場合、以前の回答にある方法論はどれも機能しません。物理的にパスをチェックするか (ヘッダファイルなどの可能性もあります)、または (Debian ベースのディストリビューションを使用している場合)このような方法をとるしかないと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관심있는 사람들을 위해 설치된 라이브러리를 감지하려는 경우 이전 답변의 방법 중 어느 것도 작동하지 않습니다. </font><font style="vertical-align: inherit;">경로를 물리적으로 검사하거나 (헤더 파일 등의 가능성이있는) 또는 이와 비슷한 것 (Debian 기반 배포판 인 경우)이 남아 있다고 생각합니다.</font></font>
ru: Для тех,кто интересуется,ни одна из методик в предыдущих ответах не работает,если вы хотите обнаружить установленную библиотеку.Я полагаю,что вам остаётся либо физически проверить путь (потенциально для заголовочных файлов и тому подобное),либо что-то в этом роде (если вы находитесь в дистрибутиве,основанном на Debian):
zh_cn: 对于那些有兴趣的人来说,如果你想检测已安装的库,前面的答案中的方法都不起作用。我想,你只能通过物理检查路径 (可能是头文件之类的),或者像这样的方法 (如果你是基于 Debian 的发行版)。

source: From the Bash manpage under <a href="http://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html">Conditional Expressions</a>:
ja: <font style="vertical-align: inherit;"></font><a href="http://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">条件式の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bashマンページから</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조건식</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아래의 Bash 맨 페이지에서 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Из справочной страницы Bash в разделе </font></font><a href="http://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Условные выражения</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="http://www.gnu.org/software/bash/manual/html_node/Bash-Conditional-Expressions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">条件表达式</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下的Bash联机帮助页中</font><font style="vertical-align: inherit;">：</font></font>

source: Here's an example of how it's used (from my <code>.bash_profile</code>.)
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これがどのように使用されるかの例</font></font> <code>.bash_profile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（私の</font><font style="vertical-align: inherit;">.bash_profile</font><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 사용 방법의 예입니다 ( </font></font> <code>.bash_profile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример того, как он используется (из моего </font></font> <code>.bash_profile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是一个用法示例（来自我的</font></font> <code>.bash_profile</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Here's how to use it:
ja: その使い方をご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 방법은 다음과 같습니다.</font></font>
ru: Вот как им пользоваться:
zh_cn: 下面就说说如何使用它。

source: How can I check if a program exists from a Bash script
ja: Bashスクリプトからプログラムが存在するかどうかを確認する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 스크립트에서 프로그램이 있는지 확인하는 방법</font></font>
ru: Как проверить,существует ли программа из скрипта Bash.
zh_cn: 如何从Bash脚本中检查程序是否存在?

source: How would I validate that a program exists, in a way that will either return an error and exit, or continue with the script?
ja: エラーを返して終了するか、スクリプトを続行するかのいずれかの方法で、プログラムが存在することを検証するにはどうすればよいでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오류를 반환하고 종료하거나 스크립트를 계속 진행하는 방식으로 프로그램이 존재하는지 어떻게 확인합니까?</font></font>
ru: Как я могу подтвердить существование программы таким образом,что она либо вернет ошибку и выйдет,либо продолжит работу со скриптом?
zh_cn: 我如何验证一个程序的存在,以一种要么返回错误并退出,要么继续执行脚本的方式?

source: I agree with lhunath to discourage use of <code>which</code>, and his solution is perfectly valid <em>for Bash users</em>. However, to be more portable, <code>command -v</code> shall be used instead:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はの使用阻止するlhunathに同意</font><font style="vertical-align: inherit;">し、彼のソリューションは、完全に有効です</font><em><font style="vertical-align: inherit;">Bashのユーザーのため</font></em><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ただし、移植性を高める</font><font style="vertical-align: inherit;">ために、代わりに</font> <code>command -v</code> <font style="vertical-align: inherit;">を使用する必要があります。</font></font> <code>which</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 lhunath가 </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것을 사용하지 않는 것에 동의 </font><font style="vertical-align: inherit;">하며 그의 솔루션은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 사용자에게</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 완벽하게 유효 </font><em><font style="vertical-align: inherit;">합니다</font></em><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그러나 이식성을 높이려면 </font><font style="vertical-align: inherit;">대신 </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я согласен с lhunath воздерживаться от использования </font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и его решение совершенно справедливо </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">для пользователей Bash</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Однако для большей переносимости </font><font style="vertical-align: inherit;">вместо </font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> следует использовать </font><font style="vertical-align: inherit;">команду -v</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我同意不鼓励使用</font></font> <code>which</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，他的解决方案</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对Bash用户</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全有效</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，为了更便于移植，</font><font style="vertical-align: inherit;">应使用</font></font> <code>command -v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替：</font></font>

source: I find the following to be more failproof:
ja: 私は以下のような方が失敗しないと思っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 다음이 더 내결함성이 있음을 발견했다.</font></font>
ru: Я нахожу следующее более отказоустойчивым:
zh_cn: 我觉得下面这句话比较防不胜防。

source: I had the problem when multiple packages contained the same name.
ja: 複数のパッケージに同じ名前が含まれている場合に問題が発生していました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 패키지에 동일한 이름이 포함되어있을 때 문제가 발생했습니다.</font></font>
ru: У меня была проблема,когда несколько пакетов содержали одно и то же имя.
zh_cn: 我遇到过这样的问题,当多个包裹包含同一个名称时,我就会遇到这样的问题。

source: I had to check if Git was installed as part of deploying our <a href="https://en.wikipedia.org/wiki/Continuous_integration">CI</a> server. My final Bash script was as follows (Ubuntu server):
ja: <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Continuous_integration"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CI</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーバー</font><font style="vertical-align: inherit;">のデプロイの一部としてGitがインストールされているかどうかを確認する必要がありました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">私の最終的なBashスクリプトは次のとおりです（Ubuntuサーバー）。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://en.wikipedia.org/wiki/Continuous_integration"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CI</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서버 </font><font style="vertical-align: inherit;">배포의 일부로 Git이 설치되어 있는지 확인해야했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">마지막 Bash 스크립트는 다음과 같습니다 (Ubuntu 서버).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я должен был проверить, был ли Git установлен как часть развертывания нашего </font></font><a href="https://en.wikipedia.org/wiki/Continuous_integration"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CI-</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сервера. </font><font style="vertical-align: inherit;">Мой последний сценарий Bash был следующим (сервер Ubuntu):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我必须检查是否在部署</font></font><a href="https://en.wikipedia.org/wiki/Continuous_integration"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CI</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">服务器</font><font style="vertical-align: inherit;">时安装了Git </font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我最后的Bash脚本如下（Ubuntu服务器）：</font></font>

source: I have a function defined in my .bashrc that makes this easier.
ja: 私の.bashrcには、これを簡単にする関数が定義されています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 .bashrc 에이 기능을 쉽게 정의 할 수있는 함수가 있습니다.</font></font>
ru: У меня есть функция,определенная в моем .bashrc,которая делает это проще.
zh_cn: 我在我的.bashrc中定义了一个函数,这样做更容易。

source: I never did get the previous answers to work on the box I have access to. For one, <code>type</code> has been installed (doing what <a href="https://en.wikipedia.org/wiki/More_(command)"><code>more</code></a> does). So the builtin directive is needed. This command works for me:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私がアクセスできるボックスで作業するために以前の答えを得ることはありませんでした。</font><font style="vertical-align: inherit;">1つは、</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がインストールされていることです（</font></font><a href="https://en.wikipedia.org/wiki/More_(command)"> <code>more</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しています）。</font><font style="vertical-align: inherit;">したがって、組み込みディレクティブが必要です。</font><font style="vertical-align: inherit;">このコマンドは私にとってはうまくいきます：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 액세스 할 수있는 상자에서 이전 답변을 얻지 못했습니다. </font><font style="vertical-align: inherit;">하나, </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 설치되었습니다 ( </font></font><a href="https://en.wikipedia.org/wiki/More_(command)"> <code>more</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일을 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">따라서 내장 지시문이 필요합니다. </font><font style="vertical-align: inherit;">이 명령은 저에게 효과적입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я никогда не получал предыдущие ответы, чтобы работать на коробке, к которой у меня есть доступ. </font><font style="vertical-align: inherit;">Для одного </font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> был установлен (делает то, что делает </font></font><a href="https://en.wikipedia.org/wiki/More_(command)"> <code>more</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Так что встроенная директива необходима. </font><font style="vertical-align: inherit;">Эта команда работает для меня:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我从来没有得到以前的答案才能在我可以访问的盒子上工作。</font><font style="vertical-align: inherit;">首先，</font><font style="vertical-align: inherit;">已经安装了</font></font> <code>type</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（执行</font></font><a href="https://en.wikipedia.org/wiki/More_(command)"> <code>more</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">操作）。</font><font style="vertical-align: inherit;">因此需要内置指令。</font><font style="vertical-align: inherit;">此命令对我有用：</font></font>

source: I second the use of "command -v". E.g. like this:
ja: 私は "command -v "の使用に賛成です。例えばこんな感じ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째로 "command -v"명령을 사용했습니다. </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다.</font></font>
ru: Я поддерживаю использование "команды -v".Например,вот так:
zh_cn: 我同意使用 "命令-v"。比如说,像这样。

source: I use this, because it's very easy:
ja: とても簡単なので使っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우 간단하기 때문에 이것을 사용합니다.</font></font>
ru: Я использую это,потому что это очень просто:
zh_cn: 我用的是这个,因为它很简单。

source: I'd say there isn't any portable and 100% reliable way due to dangling <code>alias</code>es. For example:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ぶら下がっている</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> esの</font><font style="vertical-align: inherit;">ため、ポータブルで100％信頼できる方法はないと思います</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例えば：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매달려있는 </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 인해 휴대용 및 100 % 신뢰할 수있는 방법이 없다고 말하고 싶습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я бы сказал, что нет никакого портативного и 100% надежного способа из-за висячих </font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我想说由于</font></font> <code>alias</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font><font style="vertical-align: inherit;">悬而未决，没有任何可移植且100％可靠的方式</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例如：</font></font>
