Repository: rueisnom/feedback
Catalog: xlf/37/96/92/7/3796927.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: With version 2.13 of Git and later, <code>--recurse-submodules</code> can be used instead of <code>--recursive</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con la versi&oacute;n 2.13 de Git y versiones posteriores, </font><font style="vertical-align: inherit;">se pueden usar </font></font> <code>--recurse-submodules</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gitのバージョン2.13以降では、</font></font> <code>--recurse-submodules</code> <font style="vertical-align: inherit;"></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代わりに</font><font style="vertical-align: inherit;">--recurse </font><font style="vertical-align: inherit;">-submodules</font><font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나중에 망할 놈의 버전 2.13으로 </font></font> <code>--recurse-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대신 사용할 수 있습니다 </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С версией 2.13 Git и более поздними версиями </font></font> <code>--recurse-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> можно использовать вместо </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在Git 2.13及更高版本中，</font><font style="vertical-align: inherit;">可以使用</font></font> <code>--recurse-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: You can initiate fetching the submodule using multiple threads, in parallel.
es: Puedes iniciar la búsqueda del submódulo usando múltiples hilos,en paralelo.
ja: 複数のスレッドを使って、並列にサブモジュールの取得を開始することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 스레드를 병렬로 사용하여 서브 모듈 가져 오기를 시작할 수 있습니다.</font></font>
ru: Вы можете инициировать загрузку субмодуля,используя несколько потоков,параллельно.
zh_cn: 你可以使用多个线程并行地发起取子模块。

source: You can use the <code>--recursive</code> flag when cloning a repository. This parameter forces git to clone all defined submodules in the repository.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar el </font><font style="vertical-align: inherit;">indicador </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cuando </font><font style="vertical-align: inherit;">clona</font><font style="vertical-align: inherit;"> un repositorio. </font><font style="vertical-align: inherit;">Este par&aacute;metro obliga a git a clonar todos los subm&oacute;dulos definidos en el repositorio.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リポジトリのクローンを作成するときに</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグ</font><font style="vertical-align: inherit;">を使用でき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">このパラメーターにより、gitはリポジトリー内のすべての定義済みサブモジュールのクローンを作成します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">저장소를 복제 할 때 </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그를 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 매개 변수는 git이 저장소에 정의 된 모든 하위 모듈을 복제하도록합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font><font style="vertical-align: inherit;">флаг </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> при клонировании репозитория. </font><font style="vertical-align: inherit;">Этот параметр заставляет git клонировать все определенные подмодули в хранилище.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">克隆存储库时，</font><font style="vertical-align: inherit;">可以使用</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志。</font><font style="vertical-align: inherit;">此参数强制git克隆存储库中所有已定义的子模块。</font></font>

source: You can use this command to clone your repo with all the submodules:
es: Puedes usar este comando para clonar tu repo con todos los submódulos:
ja: このコマンドを使って、すべてのサブモジュールを含むレポをクローンすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 명령을 사용하여 모든 하위 모듈과 함께 repo를 복제 할 수 있습니다.</font></font>
ru: Вы можете использовать эту команду для клонирования вашего репо со всеми субмодулями:
zh_cn: 你可以用这个命令来克隆你的repo和所有的子模块。

source: You have to do two things before a submodule will be filled:
es: Tienes que hacer dos cosas antes de que se llene un submódulo:
ja: サブモジュールが埋まる前に、2つのことをしなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 모듈을 채우기 전에 다음 두 가지를 수행해야합니다.</font></font>
ru: Вы должны сделать две вещи,прежде чем субмодуль будет заполнен:
zh_cn: 你必须做两件事,然后才会有一个子模块被填充。

source: [Quick Answer]
es: [Respuesta rápida]
ja: [クイックアンサー]
ko: [빠른 답변]
ru: [Быстрый ответ]
zh_cn: [快速回答]
