Repository: rueisnom/feedback
Catalog: xlf/37/96/92/7/3796927.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: For example, <a href="http://github.com/cwolves/sequelize/tree/master/lib/">http://github.com/cwolves/sequelize/tree/master/lib/</a>, <code>nodejs-mysql-native</code> is pointing at an external git submodule, but when I checkout the <code>sequelize</code> project, that folder is empty.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, </font></font><a href="http://github.com/cwolves/sequelize/tree/master/lib/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://github.com/cwolves/sequelize/tree/master/lib/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>nodejs-mysql-native</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; apuntando a un subm&oacute;dulo git externo, pero cuando </font></font> <code>sequelize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la compra del </font><font style="vertical-align: inherit;">proyecto de </font><font style="vertical-align: inherit;">secuenciaci&oacute;n</font><font style="vertical-align: inherit;"> , esa carpeta est&aacute; vac&iacute;a.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font></font><a href="http://github.com/cwolves/sequelize/tree/master/lib/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font> <code>nodejs-mysql-native</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、</font><font style="vertical-align: inherit;">nodejs-mysql-native</font><font style="vertical-align: inherit;">は外部gitサブモジュールを指し</font><font style="vertical-align: inherit;">ていますが</font><font style="vertical-align: inherit;">、</font></font> <code>sequelize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロジェクト</font><font style="vertical-align: inherit;">をチェックアウトすると</font><font style="vertical-align: inherit;">、そのフォルダーは空です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font></font><a href="http://github.com/cwolves/sequelize/tree/master/lib/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://github.com/cwolves/sequelize/tree/master/lib/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>nodejs-mysql-native</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 외부 git 하위 모듈을 가리키고 있지만 </font></font> <code>sequelize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로젝트를 </font><font style="vertical-align: inherit;">체크 아웃하면 </font><font style="vertical-align: inherit;">해당 폴더가 비어 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, </font></font><a href="http://github.com/cwolves/sequelize/tree/master/lib/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://github.com/cwolves/sequelize/tree/master/lib/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>nodejs-mysql-native</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> указывает на внешний подмодуль git, но когда я </font></font> <code>sequelize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> проект </font><font style="vertical-align: inherit;">sequelize</font><font style="vertical-align: inherit;"> , эта папка пуста.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，</font></font><a href="http://github.com/cwolves/sequelize/tree/master/lib/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font> <code>nodejs-mysql-native</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指向外部git子模块，但是当我检出</font></font> <code>sequelize</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">项目时，该文件夹为空。</font></font>

source: For instances:
es: Por ejemplo:
ja: インスタンスのために
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어:</font></font>
ru: В некоторых случаях:
zh_cn: 对于案例:

source: Generate SSH Key
es: Generar la clave SSH
ja: SSH 鍵の生成
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SSH 키 생성</font></font>
ru: Сгенерировать ключ SSH
zh_cn: 生成SSH密钥

source: Git 2.23 (Q3 2019): if you want to clone <em>and</em> update the submodules to their latest revision:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 2.23 (Q3 2019): si desea clonar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> actualizar los subm&oacute;dulos a su &uacute;ltima revisi&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gitの2.23（Q3 2019）：クローンを作成する場合</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、最新のリビジョンにサブモジュールを更新します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 2.23 (2019 년 3 분기) : </font><font style="vertical-align: inherit;">서브 모듈을 </font><font style="vertical-align: inherit;">복제 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하고</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 최신 버전으로 업데이트 </font><font style="vertical-align: inherit;">하려는 경우 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 2.23 (Q3 2019): если вы хотите клонировать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обновить подмодули до их последней версии:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 2.23（Q3 2019）：如果要克隆</font><font style="vertical-align: inherit;">子模块</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并将其</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新为最新版本，请执行以下操作：</font></font>

source: How to “git clone” including submodules
es: Cómo "git clon" incluyendo submódulos
ja: サブモジュールを含む「git clone」の方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 모듈을 포함한&ldquo;git clone&rdquo;방법</font></font>
ru: Как "git-клонировать" в том числе субмодули
zh_cn: 如何 "git克隆 "包括子模块

source: I had the same problem for a GitHub repository. My account was missing SSH Key. The process is
es: Tuve el mismo problema para un depósito de GitHub.A mi cuenta le faltaba la clave SSH.El proceso es
ja: 私はGitHubリポジトリで同じ問題を抱えていました。私のアカウントにはSSHキーがありませんでした。プロセスは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub 리포지토리에 대해 동일한 문제가있었습니다. </font><font style="vertical-align: inherit;">내 계정에 SSH 키가 없습니다. </font><font style="vertical-align: inherit;">과정은</font></font>
ru: У меня была такая же проблема с репозиторием GitHub.В моем аккаунте отсутствовал ключ SSH.Процесс
zh_cn: 我在 GitHub 仓库中也遇到了同样的问题。我的账户丢失了SSH密钥。过程是

source: I think you can go with 3 steps:
es: Creo que puedes ir con tres pasos:
ja: 3ステップで行けると思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 당신이 3 단계로 갈 수 있다고 생각합니다.</font></font>
ru: Думаю,ты можешь сделать три шага:
zh_cn: 我想你可以用3个步骤。

source: I'm trying to put a submodule into a repo. The problem is that when I clone the parent repo, the submodule folder is entirely empty.
es: Estoy tratando de poner un submódulo en un repo.El problema es que cuando clono el repo padre,la carpeta del submódulo está completamente vacía.
ja: サブモジュールをレポに入れようとしています。問題は、親レポをクローンしたときにサブモジュールのフォルダが完全に空っぽになってしまうことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하위 모듈을 리포지토리에 넣으려고합니다. </font><font style="vertical-align: inherit;">문제는 부모 저장소를 복제 할 때 하위 모듈 폴더가 완전히 비어 있다는 것입니다.</font></font>
ru: Я пытаюсь поместить субмодуль в репо.Проблема в том,что когда я клонирую родительское repo,папка субмодуля полностью пуста.
zh_cn: 我试图将一个子模块放到一个repo中。问题是,当我克隆父版的repo时,子模块的文件夹完全是空的。

source: If <code>--recursive</code> is specified, this command will recurse into the registered submodules, and update any nested submodules within.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si </font><font style="vertical-align: inherit;">se especifica </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , este comando se repetir&aacute; en los subm&oacute;dulos registrados y actualizar&aacute; los subm&oacute;dulos anidados.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が指定されている</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、このコマンドは登録されたサブモジュールに再帰し、ネストされたサブモジュールを更新します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우 </font></font> <code>--recursive</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지정되어,이 명령은 등록 된 서브 모듈로 재귀 적 및 내에서 중첩 된 서브 모듈을 업데이트합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font><font style="vertical-align: inherit;">указан параметр </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , эта команда вернется в зарегистрированные подмодули и обновит все вложенные подмодули внутри.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font><font style="vertical-align: inherit;">指定了</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则此命令将递归到已注册的子模块中，并更新其中的任何嵌套子模块。</font></font>

source: If it is a new project simply you can do like this :
es: Si es un nuevo proyecto,simplemente puedes hacerlo así:
ja: それは単に新しいプロジェクトである場合は、このように行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새로운 프로젝트라면 간단히 다음과 같이 할 수 있습니다.</font></font>
ru: Если это новый проект,то просто так можно сделать:
zh_cn: 如果它是一个新项目,你可以这样做。

source: If it is already installed than :
es: Si ya está instalado que :
ja: 既にインストールされている場合は .
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 설치된 경우 :</font></font>
ru: Если он уже установлен,то :
zh_cn: 如果已经安装好了,那就比.NET的安装要好。

source: If you have added the submodule in a branch make sure that you add it to the clone command.
es: Si has añadido el submódulo en una rama asegúrate de que lo añades al comando de clonación.
ja: ブランチにサブモジュールを追加した場合は、必ず clone コマンドに追加してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분기에 하위 모듈을 추가 한 경우 복제 명령에 하위 모듈을 추가해야합니다.</font></font>
ru: Если вы добавили субмодуль в ветку,убедитесь,что вы добавили его в команду клона.
zh_cn: 如果你在一个分支中添加了子模块,请确保将其添加到克隆命令中。

source: If you just want to clone them at their recorded SHA1:
es: Si sólo quieres clonarlos en su SHA1 grabado:
ja: 記録されたSHA1でクローンを作成するだけならば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기록 된 SHA1에서 복제하려는 경우 :</font></font>
ru: Если ты просто хочешь клонировать их на их записанном SHA1:
zh_cn: 如果你只是想在他们记录的SHA1处克隆他们。

source: If your submodule was added in a branch be sure to include it in your clone command...
es: Si su submódulo fue agregado en una rama asegúrese de incluirlo en su comando de clonación...
ja: サブモジュールがブランチに追加された場合は、必ず clone コマンドにそれを含めてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하위 모듈이 분기에 추가 된 경우 복제 명령에 하위 모듈을 포함시켜야합니다.</font></font>
ru: Если ваш субмодуль был добавлен в ветку,обязательно включите его в команду клона...
zh_cn: 如果你的子模块被添加到分支中,请务必将其包含在你的克隆命令中。

source: Is there any way to make it so that <code>git clone parent_repo</code> actually puts data in the submodule folder?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Hay alguna manera de hacerlo para que </font></font> <code>git clone parent_repo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> realmente ponga datos en la carpeta del subm&oacute;dulo?</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>git clone parent_repo</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際にサブモジュールフォルダーにデータを配置する</font><font style="vertical-align: inherit;">ようにする方法はあり</font><font style="vertical-align: inherit;">ますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 그것을 만드는 그 어떤 방법이 </font></font> <code>git clone parent_repo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서브 모듈 폴더에 실제로 풋 데이터는?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть ли способ сделать так, чтобы </font></font> <code>git clone parent_repo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> фактически </font><font style="vertical-align: inherit;">помещал</font><font style="vertical-align: inherit;"> данные в папку субмодуля?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有什么方法可以使</font></font> <code>git clone parent_repo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上将数据放入子模块文件夹中吗？</font></font>

source: It actually passes <code>--no-fetch</code> to <code>git submodule update</code> as well on the grounds they the submodule has only just been cloned, so fetching from the remote again only serves to slow things down.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En realidad, pasa </font></font> <code>--no-fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n porque el subm&oacute;dulo acaba de ser clonado, por lo que recuperarlo desde el control remoto solo sirve para ralentizar las cosas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際には</font></font> <code>--no-fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に渡し</font><font style="vertical-align: inherit;">ますが、これはサブモジュールが複製されたばかりであるため、リモートからのフェッチは速度を低下させるだけです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 </font> <code>git submodule update</code> <font style="vertical-align: inherit;"> 가 복제 된 이유만으로 </font></font> <code>--no-fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> to </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git 서브 모듈 업데이트</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">전달하므로</font><font style="vertical-align: inherit;"> 원격에서 다시 가져 오면 속도가 느려집니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он фактически передает </font></font> <code>--no-fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также на том основании, что этот подмодуль только что был клонирован, так что выборка с пульта снова только замедляет процесс.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上，它</font><font style="vertical-align: inherit;">也会</font><font style="vertical-align: inherit;">通过</font></font> <code>--no-fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来</font><font style="vertical-align: inherit;">传递</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因为它们只是刚刚克隆了子模块，因此再次从远程获取仅会减慢速度。</font></font>

source: It automatically pulls in the submodule data assuming you have already added the submodules to the parent project.
es: Extrae automáticamente los datos de los submódulos suponiendo que ya ha añadido los submódulos al proyecto padre.
ja: すでに親プロジェクトにサブモジュールを追加していると仮定して、サブモジュールのデータを自動的に取り込みます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 서브 모듈을 상위 프로젝트에 추가했다고 가정하면 서브 모듈 데이터를 자동으로 가져옵니다.</font></font>
ru: Он автоматически втягивает данные подмодуля,предполагая,что вы уже добавили подмодули в родительский проект.
zh_cn: 假设你已经将子模块添加到父项目中,它会自动拉入子模块数据。

source: Or if you have already cloned the project, you can use:
es: O si ya ha clonado el proyecto,puede utilizarlo:
ja: または、すでにプロジェクトのクローンを作成している場合には、使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 이미 프로젝트를 복제 한 경우 다음을 사용할 수 있습니다.</font></font>
ru: Или,если вы уже клонировали проект,вы можете использовать:
zh_cn: 或者如果你已经克隆了项目,你可以使用。

source: Original answer 2010
es: Respuesta original 2010
ja: オリジナルアンサー2010
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원문 답변 2010</font></font>
ru: Первоначальный ответ 2010
zh_cn: 2010年的原始答案

source: Run <code>git submodule init</code> and <code>git submodule update</code> to fetch submodules in already cloned repository.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejecute </font></font> <code>git submodule init</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para recuperar subm&oacute;dulos en un repositorio ya clonado.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>git submodule init</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">実行</font><font style="vertical-align: inherit;">して、すでに複製されたリポジトリー内のサブモジュールをフェッチします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실행 </font></font> <code>git submodule init</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이미 복제 된 저장소에 서브 모듈을 가져올 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Запустите </font></font> <code>git submodule init</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>git submodule update</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить подмодули в уже клонированном репозитории.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运行</font></font> <code>git submodule init</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来获取已经克隆的存储库中的子模块。</font></font>

source: See <a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/">Working with git submodules recursively</a> for the init part.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Consulte </font></font><a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Trabajar con subm&oacute;dulos git de forma recursiva</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la parte init.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">initパートについては、</font></font><a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">再帰的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">gitサブモジュール</font><font style="vertical-align: inherit;">を操作するをご覧ください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">초기화 부분에 대해서는 </font></font><a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git 서브 모듈을 재귀 적으로 작업하기를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">См. </font></font><a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Работа с субмодулями git рекурсивно</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для части инициализации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关</font><font style="vertical-align: inherit;">init部分，</font><font style="vertical-align: inherit;">请参见</font></font><a href="http://cemerick.com/2009/09/28/working-with-git-submodules-recursively/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">递归使用git子模块</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
