Repository: rueisnom/feedback
Catalog: xlf/37/96/92/7/3796927.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: See <a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4">commit 4c69101</a> (19 May 2019) by <a href="https://github.com/">Ben Avison (``)</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ver </font></font><a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit 4c69101</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (19 de mayo de 2019) por </font></font><a href="https://github.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ben Avison (``)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><a href="https://github.com/"><font style="vertical-align: inherit;">Ben Avison（ ``）</font></a><font style="vertical-align: inherit;">による</font></font><a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コミット4c69101</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（19 May 2019）を</font><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="https://github.com/"><font style="vertical-align: inherit;">Ben Avison (``)의 </font></a></font><a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit 4c69101</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (2019 5 May 19)을 </font><font style="vertical-align: inherit;">참조하십시오 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">См. </font></font><a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Коммит 4c69101</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (19 мая 2019 г.) </font></font><a href="https://github.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Бена Ависона (``)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参见</font><a href="https://github.com/"><font style="vertical-align: inherit;">Ben Avison（``）</font></a></font><a href="https://github.com/git/git/commit/4c6910163ab59f334becca39f5a83d3b7a622df4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交4c69101</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2019年5月19日</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: See <strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"><code>git submodule</code> explained</a></strong> for more.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vea el </font></font><strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"> <code>git submodule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> explicado</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para m&aacute;s informaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細</font><strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"><font style="vertical-align: inherit;">については</font></a></strong><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">説明さ</font></strong><font style="vertical-align: inherit;">れている</font></font><strong> <code>git submodule</code> <font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 </font></font><strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"> <code>git submodule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설명</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">См. </font></font><strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"> <code>git submodule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объяснил</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> больше.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">见</font></font><strong><a href="http://longair.net/blog/2010/06/02/git-submodules-explained/"> <code>git submodule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解释</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更多。</font></font>

source: See below.
es: Ver abajo.
ja: 以下を参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래를 참조하십시오.</font></font>
ru: См.ниже.
zh_cn: 见下文。

source: Source: <a href="http://www.infoq.com/news/2016/03/git28-released">http://www.infoq.com/news/2016/03/git28-released</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font><a href="http://www.infoq.com/news/2016/03/git28-released"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.infoq.com/news/2016/03/git28-released</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出典：</font><a href="http://www.infoq.com/news/2016/03/git28-released"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.infoq.com/news/2016/03/git28-released</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 : </font></font><a href="http://www.infoq.com/news/2016/03/git28-released"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.infoq.com/news/2016/03/git28-released</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="http://www.infoq.com/news/2016/03/git28-released"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.infoq.com/news/2016/03/git28-released</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">资料来源：</font><a href="http://www.infoq.com/news/2016/03/git28-released"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//www.infoq.com/news/2016/03/git28-released</font></font>

source: Submodules parallel fetch aims at reducing the time required to fetch a repositories and all of its related submodules by enabling the fetching of multiple repositories at once. This can be accomplished by using the new --jobs option, e.g.:
es: La búsqueda paralela de submódulos tiene por objeto reducir el tiempo necesario para buscar un depósito y todos sus submódulos conexos,permitiendo la búsqueda de varios depósitos a la vez.Esto puede lograrse utilizando la nueva opción --jobs,por ejemplo:
ja: サブモジュールの並列フェッチは、複数のリポジトリを一度にフェッチできるようにすることで、リポジトリとそれに関連するすべてのサブモジュールをフェッチするのに必要な時間を短縮することを目的としています。これは新しい --jobs オプションを使うことで実現できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 모듈 병렬 페치는 한 번에 여러 리포지토리를 페치 할 수 있도록하여 리포지토리 및 모든 관련 서브 모듈을 페치하는 데 필요한 시간을 줄이는 것을 목표로합니다. </font><font style="vertical-align: inherit;">다음과 같은 새로운 --jobs 옵션을 사용하면됩니다.</font></font>
ru: Параллельная выборка подмодулей направлена на сокращение времени,необходимого для выборки репозиториев и всех связанных с ними подмодулей,за счет включения возможности выборки нескольких репозиториев одновременно.Этого можно добиться с помощью новой опции --jobs,например:
zh_cn: 子模块并行提取的目的是减少提取一个存储库和所有相关的子模块所需的时间,因为它可以同时提取多个存储库。这可以通过使用新的 --jobs 选项来实现,例如:。

source: That means:
es: Eso significa:
ja: ということです。
ko: 그 의미는:
ru: Это значит:
zh_cn: 这意味着:

source: Then, you can clone the repository with submodules (<code>git clone --recursive YOUR-GIT-REPO-URL</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Luego, puede clonar el repositorio con subm&oacute;dulos ( </font></font> <code>git clone --recursive YOUR-GIT-REPO-URL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、サブモジュールでリポジトリを複製できます（</font></font> <code>git clone --recursive YOUR-GIT-REPO-URL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 하위 모듈을 사용하여 저장소를 복제 할 수 있습니다 ( </font></font> <code>git clone --recursive YOUR-GIT-REPO-URL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Затем вы можете клонировать репозиторий с подмодулями ( </font></font> <code>git clone --recursive YOUR-GIT-REPO-URL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后，您可以使用子模块克隆存储库（</font></font> <code>git clone --recursive YOUR-GIT-REPO-URL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>

source: This patch rectifies this situation.
es: Este parche rectifica esta situación.
ja: このパッチはこの状況を修正します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 패치는이 상황을 수정합니다.</font></font>
ru: Этот патч исправляет эту ситуацию.
zh_cn: 这个补丁纠正了这种情况。

source: Try this for including submodules in git repository.
es: Intenta esto para incluir submódulos en el depósito de git.
ja: gitリポジトリにサブモジュールを含める場合は、これを試してみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자식 저장소에 하위 모듈을 포함 시키려면 이것을 시도하십시오.</font></font>
ru: Попробуйте включить субмодули в git-репозиторий.
zh_cn: 在git仓库中包含子模块时,可以试试这个。

source: Try this.
es: Pruebe esto.
ja: これを試してみてください。
ko: 이 시도.
ru: Попробуй это.
zh_cn: 试试这个。

source: Try this:
es: Pruebe esto:
ja: これを試してみてください。
ko: 이 시도:
ru: Попробуй это:
zh_cn: 试试这个。

source: Update 2016, with git 2.8: see "<a href="https://stackoverflow.com/a/34762036/6309">How to speed up / parallelize downloads of git submodules using <code>git clone --recursive</code>?</a>"
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizaci&oacute;n 2016, con git 2.8: consulte " </font></font><a href="https://stackoverflow.com/a/34762036/6309"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo acelerar / paralelizar descargas de subm&oacute;dulos </font></font> <code>git clone --recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando </font><font style="vertical-align: inherit;">git clone --recursive</font><font style="vertical-align: inherit;"> ?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gitの2.8で、2016年を更新します。参照「</font></font><a href="https://stackoverflow.com/a/34762036/6309"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どのように使用/ gitのサブモジュールの並列化ダウンロードをスピードアップするために</font></font> <code>git clone --recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git 2.8로 2016 업데이트 : " </font><a href="https://stackoverflow.com/a/34762036/6309"> <code>git clone --recursive</code> 를</a></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하위 모듈의 다운로드 속도를 높이거나 병렬화하는 방법 </font><font style="vertical-align: inherit;">?</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновление 2016 с git 2.8: см. &laquo; </font></font><a href="https://stackoverflow.com/a/34762036/6309"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как ускорить / распараллелить загрузку подмодулей </font></font> <code>git clone --recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с помощью </font><font style="vertical-align: inherit;">git clone --recursive</font><font style="vertical-align: inherit;"> ?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用git 2.8更新2016：请参阅&ldquo; </font></font><a href="https://stackoverflow.com/a/34762036/6309"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如何使用</font></font> <code>git clone --recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加快/并行化git子模块的下载</font><font style="vertical-align: inherit;">？</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;</font></font>

source: When using <code>git clone --recurse-submodules</code> there was previously no way to pass a <code>--remote</code> switch to the implicit <code>git submodule update</code> command for any use case where you want the submodules to be checked out on their remote-tracking branch rather than with the SHA-1 recorded in the superproject.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al usar </font></font> <code>git clone --recurse-submodules</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> anteriormente no hab&iacute;a forma de pasar un </font><font style="vertical-align: inherit;">interruptor </font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al </font><font style="vertical-align: inherit;">comando </font><font style="vertical-align: inherit;">impl&iacute;cito </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cualquier caso de uso en el que desea que los subm&oacute;dulos se verifiquen en su rama de seguimiento remoto en lugar de con el SHA-1 grabado en el superproyecto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用する場合は</font></font> <code>git clone --recurse-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">渡しする方法以前にありませんでした</font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">暗黙的にスイッチを</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはサブモジュールが自分のリモート追跡ブランチ上ではなくて、チェックアウトしたい任意のユースケースのためのコマンドは、スーパープロジェクトに記録されたSHA-1。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용하는 경우 </font></font> <code>git clone --recurse-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패스 할 수있는 방법이 이전에 없었다 </font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 암시로 전환 </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 서브 모듈은보다 오히려 자신의 원격 추적 분기에 체크 아웃하고자하는 모든 사용 사례에 대한 명령을 수퍼 프로젝트에 기록 된 SHA-1.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При использовании </font></font> <code>git clone --recurse-submodules</code> <font style="vertical-align: inherit;"></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ранее не было возможности передать </font><font style="vertical-align: inherit;">ключ </font><font style="vertical-align: inherit;">--remote</font><font style="vertical-align: inherit;"> команде неявного </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">submodule</font><font style="vertical-align: inherit;"> для любого случая использования, когда вы хотите, чтобы субмодули были извлечены в их ветви удаленного отслеживания, а не с помощью SHA-1, записанный в суперпроекте.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当使用</font></font> <code>git clone --recurse-submodules</code> 时<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">对于您希望子模块在其远程跟踪分支而不是通过它们检出的任何用例，</font><font style="vertical-align: inherit;">以前无法将</font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开关</font><font style="vertical-align: inherit;">传递</font><font style="vertical-align: inherit;">给隐式</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令。记录在超级项目中的SHA-1。</font></font>

source: With version 1.6.5 of Git and later, you can use:
es: Con la versión 1.6.5 de Git y posteriores,puedes usar:
ja: Gitのバージョン1.6.5以降では
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 버전 1.6.5 이상에서는 다음을 사용할 수 있습니다.</font></font>
ru: Вы можете использовать Git версии 1.6.5 и более поздних:
zh_cn: 使用Git的1.6.5及以后的版本,你可以使用。

source: With version 1.6.5 of git and later, you can do this automatically by cloning the super-project with the <code>&ndash;-recursive</code> option:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con la versi&oacute;n 1.6.5 de git y posteriores, puede hacer esto autom&aacute;ticamente clonando el superproyecto con la </font><font style="vertical-align: inherit;">opci&oacute;n </font></font> <code>&ndash;-recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git以降のバージョン1.6.5では、</font></font> <code>&ndash;-recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプションを使用</font><font style="vertical-align: inherit;">してスーパープロジェクトを複製することで、これを自動的に行うことができ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git 버전 1.6.5 이상에서는 </font></font> <code>&ndash;-recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 옵션을 </font><font style="vertical-align: inherit;">사용하여 수퍼 프로젝트를 복제하여 자동으로이를 수행 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В git версии 1.6.5 и выше вы можете сделать это автоматически, клонировав супер-проект с </font><font style="vertical-align: inherit;">опцией </font></font> <code>&ndash;-recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在git 1.6.5及更高版本中，您可以通过使用</font></font> <code>&ndash;-recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选项</font><font style="vertical-align: inherit;">克隆超级项目来自动执行此操作</font><font style="vertical-align: inherit;">：</font></font>

source: With version 1.9 of Git up until version 2.12 (<code>-j</code> flag only available in version 2.8+):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con la versi&oacute;n 1.9 de Git hasta la versi&oacute;n 2.12 (el </font><font style="vertical-align: inherit;">indicador </font></font> <code>-j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo est&aacute; disponible en la versi&oacute;n 2.8+):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バージョン2.12までのバージョン1.9のGit（</font></font> <code>-j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグはバージョン2.8+でのみ使用可能）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버전 2.12까지 버전 1.9의 Git up ( </font></font> <code>-j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그는 버전 2.8 이상에서만 사용 가능) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С Git версии 1.9 до версии 2.12 ( </font><font style="vertical-align: inherit;">флаг </font></font> <code>-j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> доступен только в версии 2.8+):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从1.9版的Git升级到2.12版（</font></font> <code>-j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志仅在2.8+版中可用）：</font></font>
