Repository: rueisnom/feedback
Catalog: xlf/37/96/92/7/3796927.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <code>clone</code>: add <code>--remote-submodules</code> flag
es: <code>clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : add </font></font> <code>--remote-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> flag</font></font>
ja: <code>clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font> <code>--remote-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグを</font><font style="vertical-align: inherit;">追加し</font><font style="vertical-align: inherit;">ます</font></font>
ko: <code>clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font> <code>--remote-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그 </font><font style="vertical-align: inherit;">추가</font></font>
ru: <code>clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : добавить </font></font> <code>--remote-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> флаг</font></font>
zh_cn: <code>clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：添加</font></font> <code>--remote-submodules</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志</font></font>

source: <em>late answer</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">respuesta tard&iacute;a</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遅い答え</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">늦게 대답</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">поздний ответ</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">迟来的答案</font></font></em>

source: <sup>(Merged by <a href="https://github.com/gitster">Junio C Hamano -- <code>gitster</code> --</a> in <a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90">commit 9476094</a>, 17 Jun 2019)</sup>
es: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Fusionada por </font></font><a href="https://github.com/gitster"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Junio ​​C Hamano - </font></font> <code>gitster</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font></font><a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">commit 9476094</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 17 jun 2019)</font></font></sup>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（合併により</font></font><a href="https://github.com/gitster"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Junio C浜野- </font></font> <code>gitster</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">9476094コミット</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2019年6月、17）</font></font></sup>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(의해 병합 </font></font><a href="https://github.com/gitster"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Junio C 하마노 - </font></font> <code>gitster</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font></font><a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">9,476,094 커밋</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2,019 17 유월)을</font></font></sup>
ru: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Объединено с </font></font><a href="https://github.com/gitster"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Junio ​​C Hamano - </font></font> <code>gitster</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">коммите 9476094</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 17 июня 2019 г.)</font></font></sup>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（通过合并</font></font><a href="https://github.com/gitster"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JUNIO&Ccedil;滨野- </font></font> <code>gitster</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="https://github.com/git/git/commit/94760948f17e1902e071172677e0615da6e03d90"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提交9476094</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，2019年6月17日）</font></font></sup>

source: <sup>Editor&rsquo;s note: <code>-j8</code> is an optional performance optimization that became available in version 2.8, and fetches up to 8 submodules at a time in parallel &mdash; see <code>man git-clone</code>.</sup>
es: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota del editor: </font></font> <code>-j8</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una optimizaci&oacute;n de rendimiento opcional que estuvo disponible en la versi&oacute;n 2.8, y obtiene hasta 8 subm&oacute;dulos a la vez en paralelo - vea </font></font> <code>man git-clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></sup>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集者注：</font></font> <code>-j8</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオプションのパフォーマンス最適化であり、バージョン2.8で使用可能になり、一度に最大8つのサブモジュールを同時にフェッチします</font><font style="vertical-align: inherit;">。mangit </font></font> <code>man git-clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font></sup>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집자 주 : </font></font> <code>-j8</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 2.8 버전에서 사용할 수있는 선택적 성능 최적화이며 한 번에 최대 8 개의 하위 모듈을 병렬로 가져옵니다 ( </font></font> <code>man git-clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조) </font><font style="vertical-align: inherit;">.</font></font></sup>
ru: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание редактора: </font></font> <code>-j8</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это дополнительная оптимизация производительности, которая стала доступной в версии 2.8 и позволяет одновременно получать до 8 субмодулей одновременно - см. </font></font> <code>man git-clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></sup>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编者注：</font></font> <code>-j8</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是可选的性能优化，已在2.8版中提供，并且可以一次并行获取多达8 </font><font style="vertical-align: inherit;">个子</font><font style="vertical-align: inherit;">模块-请参阅</font></font> <code>man git-clone</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></sup>

source: According to Git team, this can substantially speed up updating repositories that contain many submodules. When using --recurse-submodules without the new --jobs option, Git will fetch submodules one by one.
es: Según el equipo de Git,esto puede acelerar sustancialmente la actualización de los repositorios que contienen muchos submódulos.Al usar --recursar-submódulos sin la nueva opción --jobs,Git obtendrá submódulos uno a uno.
ja: Gitチームによると、これにより多くのサブモジュールを含むリポジトリの更新を大幅に高速化できるとのことです。新しい --jobs オプションをつけずに --recurse-submodules を使うと、Git はサブモジュールをひとつずつ取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 팀에 따르면, 이것은 많은 서브 모듈을 포함하는 저장소 업데이트 속도를 크게 높일 수 있습니다. </font><font style="vertical-align: inherit;">새로운 --jobs 옵션없이 --recurse-submodules를 사용하면 Git은 서브 모듈을 하나씩 가져옵니다.</font></font>
ru: По мнению команды Git'а,это может существенно ускорить обновление репозиториев,содержащих множество субмодулей.При использовании --recurse-submodules без опции --jobs,Git будет получать субмодули по одному.
zh_cn: 根据Git团队的说法,这可以大大加快更新包含许多子模块的版本库的速度。当使用 --recurse-submodules 而不使用新的 --jobs 选项时,Git 将逐一获取子模块。

source: Adding a new SSH key to your GitHub account
es: Añadiendo una nueva clave de SSH a tu cuenta de GitHub
ja: GitHub アカウントに新しい SSH 鍵を追加する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GitHub 계정에 새 SSH 키 추가</font></font>
ru: Добавление нового SSH-ключа к вашей учетной записи GitHub
zh_cn: 给你的GitHub账户添加一个新的SSH密钥

source: After cloning the parent repo (which contained some submodule repo), do as the following:
es: Después de clonar el repo padre (que contenía algún repo submódulo),haga lo siguiente:
ja: 親レポ(サブモジュールレポが含まれていた)をクローンした後、以下のようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상위 리포지토리 (일부 하위 모듈 리포지토리 포함)를 복제 한 후 다음과 같이하십시오.</font></font>
ru: После клонирования родительского репо (в котором содержалось некоторое субмодульное репо)сделайте следующее:
zh_cn: 在克隆了父版的repo(其中包含一些子模块repo)后,按以下方法进行。

source: After cloning, sometimes submodules branches may be changed, so run this command after it:
es: Después de la clonación,a veces las ramas de los submódulos pueden ser cambiadas,así que ejecuta este comando después de ella:
ja: クローンした後、サブモジュールのブランチが変更されることがあるので、そのあとにこのコマンドを実行します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복제 후 때때로 하위 모듈 분기가 변경 될 수 있으므로 다음 명령을 실행하십시오.</font></font>
ru: После клонирования иногда могут изменяться ветки субмодулей,поэтому выполните эту команду после него:
zh_cn: 克隆后,有时子模块分支可能会发生变化,所以在它之后运行这个命令。

source: All submodules which are cloned will use the status of the submodule&rsquo;s remote-tracking branch to update the submodule, rather than the superproject&rsquo;s recorded SHA-1. Equivalent to passing <code>--remote</code> to <code>git submodule update</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Todos los subm&oacute;dulos que se clonan utilizar&aacute;n el estado de la rama de seguimiento remoto del subm&oacute;dulo para actualizar el subm&oacute;dulo, en lugar del SHA-1 registrado del superproyecto. </font><font style="vertical-align: inherit;">Equivalente a pasar </font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複製されるすべてのサブモジュールは、スーパープロジェクトの記録されたSHA-1ではなく、サブモジュールのリモート追跡ブランチのステータスを使用してサブモジュールを更新します。</font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に渡すのと</font><font style="vertical-align: inherit;">同じ</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복제 된 모든 하위 모듈은 수퍼 프로젝트의 기록 된 SHA-1이 아니라 하위 모듈의 원격 추적 분기 상태를 사용하여 하위 모듈을 업데이트합니다. </font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> to </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 동일합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Все клонированные субмодули будут использовать состояние ветки удаленного отслеживания субмодуля для обновления субмодуля, а не записанного SHA-1 суперпроекта. </font><font style="vertical-align: inherit;">Эквивалентно передаче </font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">submodule</font><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">克隆的所有子模块将使用子模块的远程跟踪分支的状态来更新子模块，而不是超级项目的已记录SHA-1。</font><font style="vertical-align: inherit;">等效于将</font></font> <code>--remote</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">传递</font><font style="vertical-align: inherit;">给</font></font> <code>git submodule update</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: As <a href="https://stackoverflow.com/users/49505/joschi">joschi</a> mentions in the comments, <strong><a href="http://git-scm.com/docs/git-submodule"><code>git submodule</code></a></strong> now supports the <code>--recursive</code> option (Git1.6.5 and more).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como </font></font><a href="https://stackoverflow.com/users/49505/joschi"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">joschi</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> menciones en los comentarios, </font></font><strong><a href="http://git-scm.com/docs/git-submodule"> <code>git submodule</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ahora es compatible con la </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> opci&oacute;n (Git1.6.5 y m&aacute;s).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のよう</font></font><a href="https://stackoverflow.com/users/49505/joschi"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">joschiは</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コメントで言及し、</font></font><strong><a href="http://git-scm.com/docs/git-submodule"> <code>git submodule</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サポートするようになりまし</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプション（Git1.6.5およびそれ以上）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주석에서 </font></font><a href="https://stackoverflow.com/users/49505/joschi"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">joschi가</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 언급 </font><font style="vertical-align: inherit;">했듯이 </font></font><strong><a href="http://git-scm.com/docs/git-submodule"> <code>git submodule</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이제 </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 옵션 (Git1.6.5 이상)을 </font><font style="vertical-align: inherit;">지원합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как </font></font><a href="https://stackoverflow.com/users/49505/joschi"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Joschi</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> упоминает в комментариях, </font></font><strong><a href="http://git-scm.com/docs/git-submodule"> <code>git submodule</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теперь поддерживает </font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вариант (Git1.6.5 и больше).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如</font></font><a href="https://stackoverflow.com/users/49505/joschi"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">joschi</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在评论中提到的那样，</font></font><strong><a href="http://git-scm.com/docs/git-submodule"> <code>git submodule</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在支持</font></font> <code>--recursive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选项（Git1.6.5及更高版本）。</font></font>

source: As I just spent a whole hour fiddling around with a friend: Even if you have Admin rights on BitBucket, always clone the ORIGINAL repository and use the password of the one who owns the repo. Annoying to find out that you ran into this minetrap :P
es: Como acabo de pasar una hora entera jugueteando con un amigo:Aunque tengas derechos de administrador en BitBucket,siempre clona el repositorio ORIGINAL y usa la contraseña del dueño del repositorio.Es molesto saber que te has topado con esta mina trampa :P
ja: 私は友人と一緒に丸一時間をいじくり回していました。BitBucketの管理者権限を持っていても、常にオリジナルのリポジトリをクローンして、レポを所有している人のパスワードを使うようにしてください。あなたがこのミニトラップに遭遇したことを発見するのは腹立たしいです :P
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방금 친구와 함께 시간을 보냈습니다. BitBucket에 대한 관리자 권한이 있더라도 항상 원본 리포지토리를 복제하고 리포지토리를 소유 한 사람의 암호를 사용하십시오. </font><font style="vertical-align: inherit;">이 광산 함정에 부딪쳤다는 것을 짜증나게 : P</font></font>
ru: Так как я только что провел целый час,возясь с другом:Даже если у вас есть права администратора на BitBucket,всегда клонируйте ORIGINAL репозиторий и используйте пароль того,кто владеет репо.Раздражает,что вы наткнулись на этот minetrap :P
zh_cn: 因为我刚刚花了整整一个小时的时间和一个朋友一起摆弄。即使你在BitBucket上有管理员权限,也一定要克隆ORIGINAL版本库,并使用拥有该版本库的人的密码。发现自己遇到了这个雷区,很烦人:P

source: Even better, with Git 2.23 (Q3 2019), you can clone and checkout the submodule to their tracking branch in one command!
es: Aún mejor,con Git 2.23 (Q3 2019),puedes clonar y comprobar el submódulo a su rama de seguimiento en un solo comando!
ja: さらに良いことに、Git 2.23 (Q3 2019)では、1つのコマンドでサブモジュールをクローンして、それらのトラッキングブランチにチェックアウトすることができます!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 2.23 (Q3 2019)을 사용하면 하나의 명령으로 하위 모듈을 추적 지점에 복제하고 체크 아웃 할 수 있습니다!</font></font>
ru: А ещё лучше-с помощью Git 2.23 (Q3 2019)вы можете клонировать и проверять подмодуль в их отслеживающую ветку одной командой!
zh_cn: 更棒的是,在Git 2.23(2019年Q3)中,你可以在一个命令中克隆并签出子模块到它们的跟踪分支!

source: For already cloned repos, or older Git versions, use:
es: Para reposiciones ya clonadas,o versiones antiguas de Git,usa:
ja: すでにクローンされているレポや古いバージョンのGitについては、以下のようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 복제 된 repos 또는 이전 Git 버전의 경우 다음을 사용하십시오.</font></font>
ru: Для уже клонированных репозиториев или старых версий Git'а используйте:
zh_cn: 对于已经克隆的版本,或者旧版本的Git,使用:
