Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Emphasis mine.)
es: (Énfasis mío.)
ja: (私が強調します)
ru: (Акцент мой.)
zh_cn: (强调是我的)。

source: <a href="http://php.net/sha1">SHA1</a> and a salt should suffice (depending, naturally, on whether you are coding something for <a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository">Fort Knox</a> or a login system for your shopping list) for the foreseeable future. If SHA1 isn't good enough for you, use <a href="http://php.net/manual/en/function.hash.php">SHA256</a>.
es: <a href="http://php.net/sha1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y una sal deber&iacute;an ser suficientes (dependiendo, naturalmente, de si est&aacute; codificando algo para </font></font><a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fort Knox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o un sistema de inicio de sesi&oacute;n para su lista de compras) en el futuro previsible. Si SHA1 no es lo suficientemente bueno para usted, use </font></font><a href="http://php.net/manual/en/function.hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA256</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <a href="http://php.net/sha1">SHA1</a>とソルトで十分なはずです（当然、 <a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository">Fort Knox</a>用にコーディングするか、ショッピングリスト用のログインシステムにコーディングするかによって異なります）。 SHA1では不十分な場合は、 <a href="http://php.net/manual/en/function.hash.php">SHA256を</a>使用してください 。
ko: 가까운 미래에는 <a href="http://php.net/sha1">SHA1</a> 과 소금이 충분해야합니다 (당연히 <a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository">Fort Knox</a> 용 코드를 코딩하는지 또는 쇼핑 목록을위한 로그인 시스템에 따라). SHA1이 충분하지 않으면 <a href="http://php.net/manual/en/function.hash.php">SHA256을</a> 사용하십시오.
ru: <a href="http://php.net/sha1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и соли должно хватить (в зависимости, естественно, от того, кодируете ли вы что-нибудь для </font></font><a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fort Knox</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или систему входа в список покупок) в обозримом будущем. Если SHA1 недостаточно хорош для вас, используйте </font></font><a href="http://php.net/manual/en/function.hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA256</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 在可预见的将来， <a href="http://php.net/sha1">SHA1</a>和一种盐就足够了（自然而然地取决于您是为<a href="http://en.wikipedia.org/wiki/United_States_Bullion_Depository">Fort Knox</a>编码还是为购物清单输入登录系统）。 如果SHA1对您来说不够好，请使用<a href="http://php.net/manual/en/function.hash.php">SHA256</a> 。

source: <a href="http://xkcd.com/936/">Entropy</a>. (Not that I fully subscribe to Randall's viewpoint.)
es: <a href="http://xkcd.com/936/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entrop&iacute;a</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(No es que me suscriba completamente al punto de vista de Randall).</font></font>
ja: <a href="http://xkcd.com/936/">エントロピー</a> 。 （私がRandallの視点に完全に同意しているわけではありません。）
ko: <a href="http://xkcd.com/936/">엔트로피</a> . (난 랜달의 관점에 전적으로 동의하지는 않는다.)
ru: <a href="http://xkcd.com/936/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Энтропия</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(Не то чтобы я полностью разделяю точку зрения Рэндалла.)</font></font>
zh_cn: <a href="http://xkcd.com/936/">熵</a> 。 （并不是我完全赞同兰德尔的观点。）

source: <a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919">excellent answer</a> with more about why <code>password_hash()</code> or <code>phpass</code> are the best way to go.
es: <a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Excelente respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con m&aacute;s informaci&oacute;n sobre por qu&eacute; </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>phpass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son la mejor manera de hacerlo.</font></font>
ja: <code>password_hash()</code> または <code>phpass</code> が最適な方法である理由についての詳しい<a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919">回答</a> 。
ko: <code>password_hash()</code> 또는 <code>phpass</code> 가 가장 좋은 방법 인 이유에 대한 <a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919">훌륭한 답변</a> .
ru: <a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">отличный ответ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с более подробной информацией о том, почему </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>phpass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - лучший путь.</font></font>
zh_cn: 关于为何 <code>password_hash()</code> 或 <code>phpass</code> 是最佳方式的更多信息，这是一个<a href="https://stackoverflow.com/questions/1581610/how-can-i-store-my-users-passwords-safely/1581919#1581919">很好的答案</a> 。

source: <a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/">good blog article</a> giving recommmended 'work factors' (number of iterations) for main algorithms including bcrypt, scrypt and PBKDF2.
es: <a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buen art&iacute;culo de blog que</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ofrece "factores de trabajo" recomendados (n&uacute;mero de iteraciones) para los algoritmos principales, incluidos bcrypt, scrypt y PBKDF2.</font></font>
ja: bcrypt、scrypt、PBKDF2などの主要なアルゴリズムに推奨される「作業係数」（反復回数）を示す<a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/">優れたブログ記事</a> 。
ko: bcrypt, scrypt 및 PBKDF2를 포함한 주요 알고리즘에 대해 권장되는 '작업 요소'(반복 횟수)를 제공하는 <a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/">좋은 블로그 기사</a> .
ru: <a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">хорошая статья в блоге,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержащая рекомендуемые &laquo;рабочие факторы&raquo; (количество итераций) для основных алгоритмов, включая bcrypt, scrypt и PBKDF2.</font></font>
zh_cn: <a href="https://www.nccgroup.trust/us/about-us/newsroom-and-events/blog/2015/march/enough-with-the-salts-updates-on-secure-password-schemes/">一篇不错的博客文章</a> ，为bcrypt，scrypt和PBKDF2等主要算法提供了建议的&ldquo;工作因子&rdquo;（迭代次数）。

source: <code>password_get_info()</code> - returns information about the given hash
es: <code>password_get_info()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - devuelve informaci&oacute;n sobre el hash dado</font></font>
ja: <code>password_get_info()</code> -指定されたハッシュに関する情報を返します
ko: <code>password_get_info()</code> -주어진 해시에 대한 정보를 반환
ru: <code>password_get_info()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - возвращает информацию о данном хеше</font></font>
zh_cn: <code>password_get_info()</code> -返回有关给定哈希的信息

source: <code>password_hash()</code> - creates a password hash
es: <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - crea un hash de contrase&ntilde;a</font></font>
ja: <code>password_hash()</code> -パスワードハッシュを作成する
ko: <code>password_hash()</code> -비밀번호 해시를 만듭니다.
ru: <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - создает хеш пароля</font></font>
zh_cn: <code>password_hash()</code> -创建密码哈希

source: <code>password_needs_rehash()</code> - checks if the given hash matches the given options. Useful to check if the hash conforms to your current technique/cost scheme allowing you to rehash if necessary
es: <code>password_needs_rehash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : comprueba si el hash dado coincide con las opciones dadas. </font><font style="vertical-align: inherit;">&Uacute;til para verificar si el hash se ajusta a su esquema actual de t&eacute;cnica / costo, lo que le permite volver a repetir si es necesario</font></font>
ja: <code>password_needs_rehash()</code> -指定されたハッシュが指定されたオプションと一致するかどうかを確認します。 ハッシュが現在の手法/コストスキームに準拠しているかどうかを確認するのに役立ち、必要に応じてハッシュを再作成できます。
ko: <code>password_needs_rehash()</code> -주어진 해시가 주어진 옵션과 일치하는지 확인합니다. 해시가 현재 기술 / 비용 체계를 준수하는지 확인하여 필요한 경우 다시 해시 할 수 있습니다.
ru: <code>password_needs_rehash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - проверяет, соответствует ли данный хеш заданным параметрам. </font><font style="vertical-align: inherit;">Полезно, чтобы проверить, соответствует ли хеш вашей текущей схеме техники / стоимости, позволяя вам при необходимости перефразировать</font></font>
zh_cn: <code>password_needs_rehash()</code> -检查给定的哈希值是否与给定的选项匹配。 有用的检查哈希是否符合您当前的技术/成本方案，允许您在必要时重新哈希

source: <code>password_verify()</code> - verifies that a password matches a hash
es: <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : verifica que una contrase&ntilde;a coincida con un hash</font></font>
ja: <code>password_verify()</code> -パスワードがハッシュと一致することを確認する
ko: <code>password_verify()</code> -암호가 해시와 일치하는지 확인
ru: <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - проверяет, что пароль соответствует хешу</font></font>
zh_cn: <code>password_verify()</code> -验证密码是否与哈希匹配

source: <em>Related questions that don't quite cover my question:</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Preguntas relacionadas que no cubren mi pregunta:</font></font></em>
ja: <em>私の質問を完全にカバーしない関連質問：</em>
ko: <em>내 질문에 잘 맞지 않는 관련 질문 :</em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Связанные вопросы, которые не совсем охватывают мой вопрос:</font></font></em>
zh_cn: <em>尚未完全涵盖我的问题的相关问题：</em>

source: <em>USERS CREATING PASSWORDS</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">USUARIOS QUE CREAN CONTRASE&Ntilde;AS</font></font></em>
ja: <em>パスワードを作成するユーザー</em>
ko: <em>비밀번호를 만드는 사용자</em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ПОЛЬЗОВАТЕЛИ, СОЗДАЮЩИЕ ПАРОЛИ</font></font></em>
zh_cn: <em>用户创建密码</em>

source: <strong>DISCLAIMER</strong>: This answer was written in 2008.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DESCARGO DE RESPONSABILIDAD</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Esta respuesta fue escrita en 2008.</font></font>
ja: <strong>免責事項</strong> ：この回答は2008年に書かれました。
ko: <strong>면책 조항</strong> :이 답변은 2008 년에 작성되었습니다.
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Этот ответ был написан в 2008 году.</font></font>
zh_cn: <strong>免责声明</strong> ：该答案写于2008年。

source: <strong>Quick self-test:</strong> what is password stretching and how many iterations should you use? If you don't know the answer, you should use <code>password_hash()</code>, as password stretching is now a critical feature of password mechanisms due to much faster CPUs and the use of <a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/">GPUs and FPGAs</a> to crack passwords at rates of <a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches">billions of guesses per second</a> (with GPUs).
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Autocomprobaci&oacute;n r&aacute;pida:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &iquest;qu&eacute; es el estiramiento de contrase&ntilde;a y cu&aacute;ntas iteraciones debe usar? </font><font style="vertical-align: inherit;">Si no sabe la respuesta, debe usar </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , ya que el estiramiento de contrase&ntilde;a ahora es una caracter&iacute;stica cr&iacute;tica de los mecanismos de contrase&ntilde;a debido a CPU mucho m&aacute;s r&aacute;pidas y el uso de </font></font><a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GPU y FPGA</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para descifrar contrase&ntilde;as a tasas de </font></font><a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">miles de millones de conjeturas por segundo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (con GPU).</font></font>
ja: <strong>クイックセルフテスト：</strong>パスワードストレッチングとは何ですか？また、何回反復する必要がありますか？ 答えがわからない場合は、 <code>password_hash()</code> を使用する必要があります。これは、CPUの高速化と、 <a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/">GPUおよびFPGA</a>を使用<a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches">して1秒あたり数十億回の推測</a>でパスワードを解読するため、パスワードメカニズムの重要な機能であるためです。 （GPUを使用）。
ko: <strong>빠른 자체 테스트 :</strong> 비밀번호 확장이란 무엇이며 얼마나 많은 반복을 사용해야합니까? 답을 모른다면 <code>password_hash()</code> 사용해야 합니다. 암호 확장은 이제 훨씬 더 빠른 CPU와 <a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/">GPU 및 FPGA</a> 를 사용하여 <a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches">초당 수십억 번의 추측으로</a> 암호를 해독하기 때문에 암호 메커니즘의 중요한 기능이므로 암호를 사용해야합니다. (GPU 포함).
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Быстрая самопроверка:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что такое растяжение пароля и сколько итераций следует использовать? </font><font style="vertical-align: inherit;">Если вы не знаете ответа, вам следует использовать </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поскольку расширение пароля теперь является критически важной функцией механизмов паролей из-за гораздо более быстрых процессоров и использования </font></font><a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">графических процессоров и FPGA</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для взлома паролей со скоростью </font></font><a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">миллиардов угаданий в секунду.</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (с графическими процессорами).</font></font>
zh_cn: <strong>快速自我测试：</strong>什么是密码扩展？您应该使用多少次迭代？ 如果您不知道答案，则应使用 <code>password_hash()</code> ，因为由于CPU的运行速度更快以及使用<a href="http://blog.crackpassword.com/2012/07/accelerating-password-recovery-the-addition-of-fpga/">GPU和FPGA</a>以<a href="http://en.wikipedia.org/wiki/Password_cracking#Time_needed_for_password_searches">每秒数十亿次猜测的速度</a>破解密码，所以密码扩展现在是密码机制的关键功能。 （使用GPU）。

source: <strong>See also:</strong>
es: <strong>Ver tambi&eacute;n:</strong>
ja: <strong>以下も参照してください。</strong>
ko: <strong>또한보십시오:</strong>
ru: <strong>Смотрите также:</strong>
zh_cn: <strong>也可以看看：</strong>

source: <strong>THINGS TO REMEMBER</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COSAS PARA RECORDAR</font></font></strong>
ja: <strong>覚えておくべきこと</strong>
ko: <strong>기억해야 할 것들</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ТО, ЧТО НУЖНО ЗАПОМНИТЬ</font></font></strong>
zh_cn: <strong>谨记</strong>

source: A lot has been said about Password encryption for PHP, most of which is very good advice, but before you even start the process of using PHP for password encryption make sure you have the following implemented or ready to be implemented.
es: Se ha hablado mucho sobre la encriptación de contraseñas para PHP,la mayoría de las cuales son muy buenos consejos,pero antes de empezar el proceso de usar PHP para la encriptación de contraseñas asegúrese de tener lo siguiente implementado o listo para ser implementado.
ja: PHP のパスワード暗号化については多くのことが言われていますが、そのほとんどは非常に良いアドバイスです。
ko: PHP의 암호 암호화에 대해 많은 의견이 있었지만 대부분의 경우 좋은 조언이지만 암호 암호화에 PHP를 사용하기 전에 다음을 구현하거나 구현할 준비가되었는지 확인하십시오.
ru: Много было сказано о шифровании паролей для PHP,большинство из которых является очень хорошим советом,но еще до того,как вы начнете процесс использования PHP для шифрования паролей,убедитесь,что у вас есть следующие возможности или они готовы к использованию.
zh_cn: 关于PHP的密码加密,已经说了很多,其中大部分都是非常好的建议,但是在开始使用PHP进行密码加密之前,请确保你已经实现或准备好了以下内容。

source: A much shorter and safer answer - <strong>don't write your own password mechanism at all</strong>, use a tried and tested mechanism.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una respuesta mucho m&aacute;s corta y segura: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no escriba su propio mecanismo de contrase&ntilde;a</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , use un mecanismo probado.</font></font>
ja: はるかに短くて安全な答え- <strong>独自のパスワードメカニズムをまったく作成せず</strong> 、実証済みのメカニズムを使用<strong>してください</strong> 。
ko: 훨씬 짧고 안전한 답변- <strong>비밀번호 메커니즘을 전혀 쓰지 말고</strong> 검증 된 메커니즘을 사용하십시오.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Гораздо более короткий и безопасный ответ - </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не пишите свой собственный механизм паролей вообще</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используйте проверенный и проверенный механизм.</font></font>
zh_cn: 更简短，更安全的答案- <strong>根本不要编写自己的密码机制</strong> ，而要使用经过考验的机制。

source: Also make the user create a secure password, it is simple and should always be done, the user will be grateful for it in the end.
es: También hacer que el usuario cree una contraseña segura,es simple y debe hacerse siempre,el usuario lo agradecerá al final.
ja: また、ユーザーが安全なパスワードを作成するように、それは簡単であり、常に行われるべきである、ユーザーは最終的にはそれのために感謝されます。
ko: 또한 사용자가 보안 암호를 만들도록하십시오. 간단하고 항상 수행해야하며 결국 사용자에게 감사드립니다.
ru: Также заставьте пользователя создать безопасный пароль,это просто и должно быть сделано всегда,в конце концов пользователь будет благодарен за это.
zh_cn: 同时让用户创建一个安全密码,这很简单,应该经常做,到最后用户会很感激。

source: Also, double-hashing is generally regarded as bad method, because it diminishes the result space. All popular hashes are fixed-length. Thus, you can have only a finite values of this fixed length, and the results become less varied. This <em>could</em> be regarded as another form of salting, but I wouldn't recommend it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, el doble hashing generalmente se considera un mal m&eacute;todo, ya que disminuye el espacio resultante. </font><font style="vertical-align: inherit;">Todos los hashes populares son de longitud fija. </font><font style="vertical-align: inherit;">Por lo tanto, solo puede tener valores finitos de esta longitud fija, y los resultados se vuelven menos variados. </font><font style="vertical-align: inherit;">Esto </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">podr&iacute;a</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> considerarse como otra forma de salaz&oacute;n, pero no lo recomendar&iacute;a.</font></font>
ja: また、ダブルハッシュは結果スペースを減少させるため、一般に悪い方法と見なされます。 すべての一般的なハッシュは固定長です。 したがって、この固定長の有限値のみを持つことができ、結果のばらつきは少なくなります。 これ<em>は</em>別の形の塩漬けと見なす<em>こと</em>も<em>でき</em>ますが、お勧めしません。
ko: 또한 이중 해싱은 일반적으로 결과 공간이 줄어들 기 때문에 잘못된 방법으로 간주됩니다. 모든 인기있는 해시는 고정 길이입니다. 따라서이 고정 길이의 유한 값만 가질 수 있으며 결과의 변동이 줄어 듭니다. 이것은 다른 형태의 소금으로 간주 <em>될</em> 수 있지만 권장하지는 않습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, двойное хеширование обычно считается плохим методом, потому что оно уменьшает пространство результата. </font><font style="vertical-align: inherit;">Все популярные хэши имеют фиксированную длину. </font><font style="vertical-align: inherit;">Таким образом, вы можете иметь только конечные значения этой фиксированной длины, и результаты станут менее разнообразными. </font><font style="vertical-align: inherit;">Это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">можно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> рассматривать как еще одну форму посола, но я бы не рекомендовал это.</font></font>
zh_cn: 同样，双重哈希通常被认为是不好的方法，因为它会减少结果空间。 所有流行的哈希都是固定长度的。 因此，您只能具有此固定长度的有限值，并且结果的变化也较少。 这<em>可以</em>被视为另一种盐腌形式，但我不建议这样做。
