Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Don't mix <a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html">bcrypt and with the <em>raw</em> output of hash()</a>, either use hex output or base64_encode it. (This applies to any input that may have a rogue <code>\0</code> in it, which can seriously weaken security.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No mezcle </font></font><a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bcrypt y con la </font><font style="vertical-align: inherit;">salida sin </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">procesar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , use la salida hexadecimal o base64_encode. </font><font style="vertical-align: inherit;">(Esto se aplica a cualquier entrada que pueda tener un p&iacute;caro </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo que puede debilitar seriamente la seguridad).</font></font>
ja: <a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html">bcryptとhash（）の<em>生の</em>出力を</a>混在させないでください。16進出力を使用するか、base64_encodeを使用してください。 （これは、不正な <code>\0</code> れている可能性のあるすべての入力に適用され、セキュリティが著しく低下する可能性があります。）
ko: <a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html">bcrypt와 hash ()의 <em>원시</em> 출력을</a> 혼합하지 마십시오. 16 진수 출력 또는 base64_encode를 사용하십시오. (이는 불량 <code>\0</code> 을 가질 수있는 모든 입력에 적용되며, 이는 보안을 심각하게 약화시킬 수 있습니다.)
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Не смешивайте </font></font><a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bcrypt и с </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">необработанным</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выводом hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , либо используйте шестнадцатеричный вывод, либо base64_encode. </font><font style="vertical-align: inherit;">(Это относится к любому входу, который может содержать мошенничество </font></font> <code>\0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , что может серьезно ослабить безопасность.)</font></font>
zh_cn: 不要将<a href="http://blog.ircmaxell.com/2015/03/security-issue-combining-bcrypt-with.html">bcrypt与hash（）的<em>原始</em>输出</a>混合使用，请使用十六进制输出或base64_encode对其进行编码。 （这适用于其中可能包含流氓 <code>\0</code> 任何输入，这会严重削弱安全性。）

source: Don't strip or escape HTML and special characters in the password.
es: No elimine o escape el HTML y los caracteres especiales de la contraseña.
ja: パスワードのHTMLや特殊文字を剥がしたり、エスケープしたりしないでください。
ko: 비밀번호에서 HTML 및 특수 문자를 제거하거나 이스케이프 처리하지 마십시오.
ru: Не удаляйте и не удаляйте HTML и специальные символы из пароля.
zh_cn: 不要在密码中剥离或转义HTML和特殊字符。

source: EDIT: I just realised that this is mentioned briefly in Robert K's answer. I'll leave this answer here since I think it provides a bit more information about how it works and the ease of use it provides for those who don't know security.
es: Me acabo de dar cuenta de que esto se menciona brevemente en la respuesta de Robert K.Dejaré esta respuesta aquí ya que creo que proporciona un poco más de información sobre cómo funciona y la facilidad de uso que ofrece a los que no conocen la seguridad.
ja: EDIT:今気がついたのですが、Robert Kさんの回答の中でこのことが簡単に触れられています。この回答は、セキュリティを知らない人のために、その仕組みや使いやすさについて、もう少し詳しい情報を提供してくれると思うので、ここに残しておきます。
ko: 편집 : 나는 이것이 Robert K의 대답에 간략하게 언급되어 있음을 깨달았습니다. 이 답변은 작동 방식과 보안을 모르는 사람들에게 제공하는 사용 편의성에 대해 조금 더 많은 정보를 제공한다고 생각하므로 여기에 남겨 두겠습니다.
ru: ЭДИТ:Я только что поняла,что об этом кратко упоминается в ответе Роберта К.Я оставлю этот ответ здесь,так как думаю,что он дает немного больше информации о том,как он работает,и о простоте использования,которую он обеспечивает для тех,кто не знает безопасности.
zh_cn: EDIT:我刚刚意识到,在Robert K的回答中提到了这个问题。我把这个答案留在这里,因为我认为它提供了更多关于它的工作原理和它为不懂安全的人提供的易用性的信息。

source: Finally, no matter the security measures you take nothing is 100% secure, the more advanced the technology to protect becomes the more advanced the attacks become. But following these steps will make your site more secure and far less desirable for attackers to go after.
es: Finalmente,no importa las medidas de seguridad que tomes,nada es 100% seguro,cuanto más avanzada sea la tecnología para proteger,más avanzados serán los ataques.Pero seguir estos pasos hará que su sitio sea más seguro y mucho menos deseable para los atacantes.
ja: 最後に、どのようなセキュリティ対策を講じても、100%安全なものはありません。しかし、これらのステップに従うことで、あなたのサイトはより安全になり、攻撃者にとってははるかに望ましくないものになります。
ko: 마지막으로, 아무 것도 취하지 않는 보안 조치가 100 % 안전하더라도 보호하는 기술이 향상 될수록 공격이 더욱 발전합니다. 그러나이 단계를 따르면 사이트를보다 안전하고 안전하게 공격자가 방문하는 것이 훨씬 바람직하지 않게됩니다.
ru: Наконец,неважно,какие меры безопасности вы не принимаете,они на 100% безопасны,но чем более продвинутая технология защиты,тем более продвинутыми становятся атаки.Но выполнение этих шагов сделает ваш сайт более безопасным и гораздо менее желательным для злоумышленников.
zh_cn: 最后,无论你采取什么安全措施都不是100%安全的,保护技术越先进,攻击就会变得越先进。但遵循这些步骤,会让你的网站更安全,也更不容易被攻击者盯上。

source: Follow the same guidelines as with all good passwords. Also don't reuse the same password on any SERVER or DB accounts on the same system.
es: Sigue las mismas pautas que con todas las buenas contraseñas.Tampoco reutilices la misma contraseña en ninguna cuenta de SERVIDOR o BD en el mismo sistema.
ja: すべての良いパスワードと同じガイドラインに従ってください。また、同じシステム上のサーバーやDBアカウントで同じパスワードを再利用しないでください。
ko: 모든 올바른 비밀번호와 동일한 지침을 따르십시오. 또한 동일한 시스템의 SERVER 또는 DB 계정에서 동일한 비밀번호를 재사용하지 마십시오.
ru: Следуйте тем же рекомендациям,что и для всех хороших паролей.Также не используйте один и тот же пароль на любых учетных записях SERVER или DB в одной и той же системе.
zh_cn: 遵循与所有好的密码相同的准则。另外,不要在同一系统中的任何SERVER或DB账户上重复使用相同的密码。

source: For all that is good in the world do not use the username admin, root or something similar. Also if you are on a unix based system DO NOT make the root account login accessible, it should always be sudo only.
es: Por todo lo que es bueno en el mundo no uses el nombre de usuario admin,root o algo similar.También si estás en un sistema basado en Unix NO hagas accesible el acceso a la cuenta de root,siempre debe ser sólo sudo.
ja: 世界のすべての良いことのために、ユーザー名をadmin、root、またはそれに似たものを使用しないでください。また、Unixベースのシステムを使用している場合は、rootアカウントのログインにアクセスできるようにしないでください。
ko: 세계에서 좋은 모든 사용자 이름 admin, root 또는 이와 유사한 것을 사용하지 마십시오. 또한 유닉스 기반 시스템을 사용하는 경우 루트 계정 로그인에 액세스 할 수 없도록 설정하면 항상 sudo 전용이어야합니다.
ru: Для всего хорошего в мире не используйте имя пользователя admin,root или что-то подобное.Также,если вы используете unix,НЕ делайте логин учетной записи root доступным,он всегда должен быть только sudo.
zh_cn: 对于世界上所有的好东西,不要使用admin、root或类似的用户名。另外,如果你是基于unix系统,请不要让root账户登录,应该只用sudo。

source: For example, you can <a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/">crack all 8-character Windows passwords in 6 hours</a> using 25 GPUs installed in 5 desktop PCs. This is brute-forcing i.e. enumerating and checking <em>every 8-character Windows password</em>, including special characters, and is not a dictionary attack. That was in 2012, as of 2018 you could use fewer GPUs, or crack faster with 25 GPUs.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, puede </font></font><a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">descifrar todas las contrase&ntilde;as de Windows de 8 caracteres en 6 horas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando 25 GPU instaladas en 5 PC de escritorio. </font><font style="vertical-align: inherit;">Esto es forzado, es decir, enumerar y verificar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cada contrase&ntilde;a de Windows de 8 caracteres</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , incluidos los caracteres especiales, y no es un ataque de diccionario. </font><font style="vertical-align: inherit;">Eso fue en 2012, a partir de 2018, podr&iacute;a usar menos GPU o agrietarse m&aacute;s r&aacute;pido con 25 GPU.</font></font>
ja: たとえば、5台のデスクトップPCにインストールされた25個のGPUを使用<a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/">すると、8文字のWindowsパスワードすべてを6時間で解読</a>できます。 これはブルートフォースです。つまり、特殊文字を含む<em>すべての8文字のWindowsパスワードを</em>列挙およびチェックするものであり、辞書攻撃ではありません。 それは2012年のことでしたが、2018年の時点で、使用するGPUの数を減らすか、25のGPUでクラックを高速化できました。
ko: 예를 들어, 5 대의 데스크탑 PC에 설치된 25 개의 GPU를 사용하여 <a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/">6 시간 안에 8 자의 Windows 암호를 모두 해독</a> 할 수 있습니다. 이는 특수 문자를 포함하여 <em>모든 8 자 Windows 암호를</em> 열거하고 확인하는 무차별 강제이며 사전 공격이 아닙니다. 2018 년 기준으로, 2018 년 현재 GPU를 더 적게 사용하거나 25 개의 GPU로 더 빨리 크랙 할 수 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, вы можете </font></font><a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">взломать все 8-символьные пароли Windows за 6 часов,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используя 25 графических процессоров, установленных на 5 настольных ПК. </font><font style="vertical-align: inherit;">Это перебор, то есть перечисление и проверка </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">каждого 8-символьного пароля Windows</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , включая специальные символы, и это не атака по словарю. </font><font style="vertical-align: inherit;">Это было в 2012 году, по состоянию на 2018 год вы могли использовать меньше графических процессоров или быстрее взломать 25 графических процессоров.</font></font>
zh_cn: 例如，您可以使用5台台式计算机中安装的25个GPU <a href="http://arstechnica.com/security/2012/12/25-gpu-cluster-cracks-every-standard-windows-password-in-6-hours/">在6小时内破解所有8个字符的Windows密码</a> 。 这是蛮横的，即枚举和检查<em>每个8个字符的Windows密码</em> （包括特殊字符），而不是字典攻击。 那是在2012年，到2018年，您可以使用更少的GPU，或者使用25个GPU更快地破解。

source: Future Practices
es: Prácticas futuras
ja: 今後の実践
ko: 미래의 관행
ru: Будущие практики
zh_cn: 今后的做法

source: Google says SHA256 is available to PHP.
es: Google dice que SHA256 está disponible para PHP.
ja: Googleによると、PHPではSHA256が利用可能だそうです。
ko: 구글은 SHA256이 PHP에서 사용 가능하다고 말합니다.
ru: Google говорит,что SHA256 доступен для PHP.
zh_cn: 谷歌表示,SHA256对PHP是可用的。

source: Here is a PHP class that creates a hash and salt for a password easily
es: Aquí hay una clase PHP que crea un hash y sal para una contraseña fácilmente
ja: パスワードのハッシュとソルトを簡単に作成するPHPクラスは以下の通りです。
ko: 다음은 비밀번호에 쉽게 해시와 솔트를 생성하는 PHP 클래스입니다.
ru: Вот класс PHP,который легко создает хэш и соль для пароля.
zh_cn: 这里有一个PHP类,可以为密码创建一个散列和盐,很容易就能创建一个密码的散列和盐

source: How would you implement salted passwords in Tomcat 5.5
es: ¿Cómo implementarías las contraseñas saladas en Tomcat 5.5
ja: Tomcat 5.5で塩漬けパスワードを実装するには?
ko: Tomcat 5.5에서 소금에 절인 암호를 어떻게 구현 하시겠습니까?
ru: Как бы вы реализовали соленые пароли в Tomcat 5.5?
zh_cn: 如何在Tomcat 5.5中实现盐化密码?

source: I almost can't imagine this situation anymore. <a href="http://www.openwall.com/phpass/">PHPASS</a> supports PHP 3.0.18 through 5.3, so it is usable on almost every installation imaginable&mdash;and should be used if you don't <em>know for certain</em> that your environment supports bcrypt.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ya casi no puedo imaginar esta situaci&oacute;n. </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPASS es</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> compatible con PHP 3.0.18 a 5.3, por lo que se puede utilizar en casi todas las instalaciones imaginables, y debe usarse si no </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sabe con certeza</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que su entorno es compatible con bcrypt.</font></font>
ja: このような状況はもうほとんど想像できません。 <a href="http://www.openwall.com/phpass/">PHPASS</a>はPHP 3.0.18から5.3をサポートしているため、考えられるほとんどすべてのインストールで使用できます。また、環境がbcryptをサポートしている<em>か</em>どうか不明な場合に使用してください。
ko: 나는 더 이상이 상황을 거의 상상할 수 없다. <a href="http://www.openwall.com/phpass/">PHPASS</a> 는 PHP 3.0.18부터 5.3까지 지원하므로 상상할 수있는 거의 모든 설치에서 사용할 수 있으며 환경에서 bcrypt를 지원하는지 <em>확실</em> 하지 않은 경우 사용해야합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я почти не могу представить эту ситуацию больше. </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPASS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поддерживает PHP 3.0.18&ndash;5.3, поэтому его можно использовать практически во всех возможных установках, и его следует использовать, если вы точно не </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">знаете,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что ваша среда поддерживает bcrypt.</font></font>
zh_cn: 我几乎无法想象这种情况了。 <a href="http://www.openwall.com/phpass/">PHPASS</a>支持PHP 3.0.18到5.3，因此几乎可以在所有可以想到的安装中使用它-如果<em>不确定</em>您的环境是否支持bcrypt，则应使用它。

source: I changed my mind about using bcrypt when I learned that bcrypt only uses blowfish's key schedule, with a variable cost mechanism. The latter lets you increase the cost to brute-force a password by increasing blowfish's already expensive key schedule.
es: Cambié de opinión sobre el uso de bcrypt cuando me enteré de que bcrypt sólo utiliza el programa clave de blowfish,con un mecanismo de costo variable.Este último te permite aumentar el costo de forzar una contraseña incrementando la ya costosa programación de claves de blowfish.
ja: bcryptを使おうと思っていたのですが、bcryptはblowfishのキースケジュールのみを使用しており、可変コストの仕組みを持っていることを知ってからは、bcryptを使おうと思っていました。後者では、blowfish の既に高価なキースケジュールを増やすことで、パスワードをブルートフォースするためのコストを増やすことができます。
ko: 나는 bcrypt가 가변 비용 메커니즘과 함께 복어의 주요 일정 만 사용한다는 것을 알았을 때 bcrypt 사용에 대한 마음을 바꿨습니다. 후자는 복어의 이미 비싼 키 일정을 늘려 암호를 무차별 처리하는 비용을 증가시킵니다.
ru: Я передумал использовать bcrypt,когда узнал,что bcrypt использует только расписание клавиш blowfish,с механизмом переменной стоимости.Последний позволяет увеличить стоимость перебора пароля путем увеличения и без того дорогостоящего расписания клавиш blowfish.
zh_cn: 当我了解到bcrypt只使用blowfish的密钥计划表时,我改变了使用bcrypt的想法,因为bcrypt只使用blowfish的密钥计划表,而且有一个可变成本机制。后者可以让你通过增加Blowfish本来就很贵的密钥计划表来增加密码的成本。

source: I found perfect topic on this matter here: <a href="https://crackstation.net/hashing-security.htm">https://crackstation.net/hashing-security.htm</a>, I wanted you to get benefit from it, here is source code also that provided prevention against time-based attack also.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Encontr&eacute; un tema perfecto sobre este asunto aqu&iacute;: </font></font><a href="https://crackstation.net/hashing-security.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://crackstation.net/hashing-security.htm</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , quer&iacute;a que se beneficiara de &eacute;l, aqu&iacute; tambi&eacute;n est&aacute; el c&oacute;digo fuente que tambi&eacute;n proporciona prevenci&oacute;n contra ataques basados ​​en el tiempo.</font></font>
ja: 私はこの問題に関する完璧なトピックをここで見つけました： <a href="https://crackstation.net/hashing-security.htm">https</a> : //crackstation.net/hashing-security.htm 、あなたはそれから利益を得てほしかった、これはまた時間ベースの攻撃に対する防止を提供したソースコードでもあります。
ko: <a href="https://crackstation.net/hashing-security.htm">https://crackstation.net/hashing-security.htm</a> 에서이 문제에 대한 완벽한 주제를 찾았습니다. 여기서 이점을 얻고 싶었습니다. 시간 기반 공격에 대한 예방도 제공하는 소스 코드도 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я нашел идеальную тему по этому вопросу здесь: </font></font><a href="https://crackstation.net/hashing-security.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://crackstation.net/hashing-security.htm</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я хотел, чтобы вы получили от этого выгоду, вот также исходный код, который обеспечил защиту от атак на основе времени.</font></font>
zh_cn: 我在这里找到了关于此问题的完美话题： <a href="https://crackstation.net/hashing-security.htm">https</a> : //crackstation.net/hashing-security.htm ，我希望您能从中受益，这里的源代码也提供了针对基于时间的攻击的防护。

source: I highly suggest reading the documentation for the <a href="http://us.php.net/crypt">crypt function</a> if you want to understand how to use bcrypt, or finding yourself a <a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021">good</a><a href="https://gist.github.com/1070401">wrapper</a> or use something like <a href="http://www.openwall.com/phpass/">PHPASS</a> for a more legacy implementation. I recommend a minimum of 12 rounds of bcrypt, if not 15 to 18.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Le recomiendo leer la documentaci&oacute;n de la </font></font><a href="http://us.php.net/crypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">funci&oacute;n cripta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si desea comprender c&oacute;mo usar bcrypt, o encontrar un </font></font><a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buen </font></font></a><a href="https://gist.github.com/1070401"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">contenedor</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o usar algo como </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPASS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para una implementaci&oacute;n m&aacute;s heredada. </font><font style="vertical-align: inherit;">Recomiendo un m&iacute;nimo de 12 rondas de bcrypt, si no de 15 a 18.</font></font>
ja: bcryptの使用方法を理解したい場合や、 <a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021">優れた</a> <a href="https://gist.github.com/1070401">ラッパーを</a>見つけたり、よりレガシーな実装に<a href="http://www.openwall.com/phpass/">PHPASSの</a>ようなものを使用したりする場合は、 <a href="http://us.php.net/crypt">crypt関数の</a>ドキュメントを読むことを強くお勧めします。 15から18ではないにしても、最低12ラウンドのbcryptをお勧めします。
ko: bcrypt를 사용하는 방법을 이해하거나 <a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021">좋은</a> <a href="https://gist.github.com/1070401">래퍼를</a> 찾거나보다 기존 구현을 위해 <a href="http://www.openwall.com/phpass/">PHPASS</a> 와 같은 것을 사용하려면 <a href="http://us.php.net/crypt">crypt 함수에</a> 대한 설명서를 읽는 것이 좋습니다. 15 ~ 18이 아닌 경우 최소 12 라운드의 bcrypt를 권장합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я настоятельно рекомендую прочитать документацию по </font></font><a href="http://us.php.net/crypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">функции crypt,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы хотите понять, как использовать bcrypt, или найти себе </font></font><a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">хорошую </font></font></a><a href="https://gist.github.com/1070401"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обертку,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или использовать что-то вроде </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHPASS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для более унаследованной реализации. </font><font style="vertical-align: inherit;">Я рекомендую минимум 12 раундов bcrypt, если не 15-18.</font></font>
zh_cn: 我强烈建议您阅读<a href="http://us.php.net/crypt">crypt函数</a>的文档，如果您想了解如何使用bcrypt，或者为自己找到一个<a href="https://stackoverflow.com/questions/4795385/how-do-you-use-bcrypt-for-hashing-passwords-in-php/6337021#6337021">好的</a> <a href="https://gist.github.com/1070401">包装器，</a>或者将类似<a href="http://www.openwall.com/phpass/">PHPASS的</a>东西用于更传统的实现。 我建议至少12轮bcrypt，如果不是15到18。
