Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: So far as I've been able to tell, making the world's best password is a Catch-22. Either its not memorable, too predictable, too short, too many unicode characters (hard to type on a Windows/Mobile device), too long, etc. No password is truly good enough for our purposes, so we must protect them as though they were in Fort Knox.
es: Por lo que he podido ver,hacer la mejor contraseña del mundo es un Catch-22.O bien no es memorable,es demasiado predecible,es demasiado corta,tiene demasiados caracteres unicode (difíciles de escribir en un dispositivo WindowsMobile),es demasiado larga,etc.Ninguna contraseña es lo suficientemente buena para nuestros propósitos,así que debemos protegerlas como si estuvieran en Fort Knox.
ja: 私の知る限りでは、世界最高のパスワードを作ることはキャッチー22です。記憶に残らない、予測しやすい、短すぎる、ユニコード文字が多すぎる(WindowsMobile端末では入力しにくい)、長すぎる、などなど。どんなパスワードも私たちの目的には本当に十分に良いものではないので、フォートノックスのようにそれらを保護しなければなりません。
ko: 내가 알 수있는 한, 세계 최고의 암호를 만드는 것은 Catch-22입니다. 기억하기 어렵고, 예측 가능하고, 짧고, 너무 많은 유니 코드 문자 (Windows / 모바일 장치에서 입력하기 어렵다), 너무 길다. 암호가 실제로 목적에 충분하지 않으므로 암호를 보호해야합니다. 포트 녹스에있었습니다.
ru: Насколько я могу судить,сделать лучший в мире пароль-это Catch-22.Либо он не запоминается,либо слишком предсказуем,либо слишком короток,либо слишком много символов юникода (сложно набрать на устройстве WindowsMobile),слишком длинен и т.д.Ни один пароль не является по-настоящему хорошим для наших целей,поэтому мы должны защищать их так,как будто они находятся в Форт Ноксе.
zh_cn: 到目前为止,就我所知,制作世界上最好的密码是一个Catch-22。要么是它不容易记住,太可预测,太短,太多unicode字符(在WindowsMobile设备上很难输入),太长等等。没有一个密码是真正适合我们的目的,所以我们必须像在诺克斯堡一样保护它们。

source: The API exposes four functions:
es: El API expone cuatro funciones:
ja: APIは4つの関数を公開しています。
ko: API는 다음과 같은 네 가지 기능을 제공합니다.
ru: API раскрывает четыре функции:
zh_cn: 该 API 暴露了四个函数。

source: The computational power required to actually <em>crack</em> a hashed password doesn't exist. The only way for computers to "crack" a password is to recreate it and simulate the hashing algorithm used to secure it. The speed of the hash is linearly related to its ability to be brute-forced. Worse still, most hash algorithms can be easily parallelized to perform even faster. This is why costly schemes like bcrypt and scrypt are so important.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La potencia de c&aacute;lculo requerida para </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">descifrar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una contrase&ntilde;a hash no existe. La &uacute;nica forma en que las computadoras pueden "descifrar" una contrase&ntilde;a es recrearla y simular el algoritmo de hash utilizado para protegerla. La velocidad del hash est&aacute; relacionada linealmente con su capacidad de ser forzado por la fuerza bruta. Peor a&uacute;n, la mayor&iacute;a de los algoritmos hash se pueden paralelizar f&aacute;cilmente para funcionar a&uacute;n m&aacute;s r&aacute;pido. Es por eso que los esquemas costosos como bcrypt y scrypt son tan importantes.</font></font>
ja: ハッシュされたパスワードを実際に<em>解読</em>するために必要な計算能力は存在しません。 コンピューターがパスワードを「解読」する唯一の方法は、パスワードを再作成して、パスワードを保護するために使用されるハッシュアルゴリズムをシミュレートすることです。 ハッシュの速度は、ブルートフォースされる能力と線形的に関連しています。 さらに悪いことに、ほとんどのハッシュアルゴリズムは簡単に並列化してさらに高速に実行できます。 これが、bcryptやscryptなどのコストのかかるスキームが非常に重要である理由です。
ko: 실제로 해시 된 암호를 <em>해독</em> 하는 데 필요한 계산 능력은 존재하지 않습니다. 컴퓨터가 암호를 "크래킹"하는 유일한 방법은 암호를 다시 작성하고 보안에 사용되는 해싱 알고리즘을 시뮬레이션하는 것입니다. 해시의 속도는 무차별 강제 기능과 선형으로 관련됩니다. 더 나쁜 것은 여전히 ​​대부분의 해시 알고리즘을 쉽게 병렬화하여 더 빠르게 수행 할 수 있다는 것입니다. 이것이 bcrypt 및 scrypt와 같은 비용이 많이 드는 구성표가 중요한 이유입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вычислительная мощность, необходимая для </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">взлома</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> хешированного пароля, не существует. Единственный способ &laquo;взломать&raquo; пароль для компьютеров - это воссоздать его и смоделировать алгоритм хеширования, используемый для его защиты. Скорость хэша линейно связана с его способностью к грубому принуждению. Хуже того, большинство алгоритмов хеширования можно легко распараллелить, чтобы они работали еще быстрее. Вот почему такие дорогостоящие схемы, как bcrypt и scrypt, так важны.</font></font>
zh_cn: 实际<em>破解</em>散列密码所需的计算能力不存在。 计算机&ldquo;破解&rdquo;密码的唯一方法是重新创建密码并模拟用于保护密码的哈希算法。 哈希的速度与其被强行使用的能力成线性关系。 更糟糕的是，大多数哈希算法可以很容易地并行化以更快地执行。 这就是为什么像bcrypt和scrypt这样的昂贵方案如此重要的原因。

source: The hashing mechanism must be available in PHP
es: El mecanismo de hashing debe estar disponible en PHP
ja: ハッシュ化の仕組みは PHP で利用可能なものでなければなりません。
ko: 해싱 메커니즘은 PHP에서 사용할 수 있어야합니다
ru: Механизм хеширования должен быть доступен в PHP
zh_cn: 散列机制在PHP中必须是可用的

source: The idea of a salt is to throw the hashing results off balance, so to say. It is known, for example, that the MD5-hash of an empty string is <code>d41d8cd98f00b204e9800998ecf8427e</code>. So, if someone with good enough a memory would see that hash and know that it's the hash of an empty string. But if the string is salted (say, with the string "<code>MY_PERSONAL_SALT</code>"), the hash for the 'empty string' (i.e. "<code>MY_PERSONAL_SALT</code>") becomes <code>aeac2612626724592271634fb14d3ea6</code>, hence non-obvious to backtrace. What I'm trying to say, that it's better to use <em>any</em> salt, than not to. Therefore, it's not too much of an importance to know <em>which</em> salt to use.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La idea de una sal es desequilibrar los resultados del hash, por as&iacute; decirlo. Se sabe, por ejemplo, que el hash MD5 de una cadena vac&iacute;a es </font></font> <code>d41d8cd98f00b204e9800998ecf8427e</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Entonces, si alguien con una memoria lo suficientemente buena ver&iacute;a ese hash y sabr&iacute;a que es el hash de una cadena vac&iacute;a. Pero si la cadena est&aacute; salada (digamos, con la cadena " </font></font> <code>MY_PERSONAL_SALT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "), el hash para la 'cadena vac&iacute;a' (es decir, " </font></font> <code>MY_PERSONAL_SALT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ") se convierte en </font></font> <code>aeac2612626724592271634fb14d3ea6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo tanto, no es obvio para retroceder. Lo que estoy tratando de decir, que es mejor usar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cualquier</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sal, de no hacerlo. Por lo tanto, no es demasiado importante saber </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">qu&eacute;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sal usar.</font></font>
ja: ソルトの考え方は、言うまでもなく、ハッシュ結果のバランスを崩すことです。 たとえば、空の文字列のMD5ハッシュは <code>d41d8cd98f00b204e9800998ecf8427e</code> であることがわかっています。 したがって、十分なメモリを持つ誰かがそのハッシュを見て、それが空の文字列のハッシュであることを知っている場合。 ただし、文字列が <code>MY_PERSONAL_SALT</code> ている場合（たとえば、文字列「 MY_PERSONAL_SALT 」を使用）、「空の文字列」（つまり「 <code>MY_PERSONAL_SALT</code> 」）のハッシュは <code>aeac2612626724592271634fb14d3ea6</code> になるため 、バックトレースがわかりにくくなります。 私が言おうとしていることは、使用<em>する</em>より塩を使用<em>する</em>方が良いということです。 したがって、使用する塩を知ることはそれほど重要ではありません。
ko: 소금의 아이디어는 해싱 결과를 균형에서 벗어나게하는 것입니다. 예를 들어, 빈 문자열의 MD5 해시는 <code>d41d8cd98f00b204e9800998ecf8427e</code> 인 것으로 알려져 있습니다. 따라서 충분한 메모리를 가진 사람이 해시를보고 빈 문자열의 해시임을 알 수 있습니다. 그러나 문자열이 솔트 된 경우 (예 : 문자열 " <code>MY_PERSONAL_SALT</code> "로) '빈 문자열'에 대한 해시 (예 : " <code>MY_PERSONAL_SALT</code> ")는 <code>aeac2612626724592271634fb14d3ea6</code> 이되므로 역 추적에는 명백하지 않습니다. 내가 말하려는 것은 소금을 사용 <em>하지</em> 않는 것보다 낫다는 것입니다. 그러므로 <em>어떤</em> 소금을 사용해야하는지 아는 것은 그리 중요하지 않습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Идея соли состоит в том, чтобы вывести из равновесия результаты хеширования. Например, известно, что MD5-хэш пустой строки имеет вид </font></font> <code>d41d8cd98f00b204e9800998ecf8427e</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Итак, если кто-то с достаточно хорошей памятью увидит этот хэш и узнает, что это хэш пустой строки. Но если строка соленая (скажем, со строкой &laquo; </font></font> <code>MY_PERSONAL_SALT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;), хеш для &laquo;пустой строки&raquo; (т. </font></font> <code>MY_PERSONAL_SALT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &laquo; </font><font style="vertical-align: inherit;">MY_PERSONAL_SALT</font><font style="vertical-align: inherit;"> &raquo;) становится </font></font> <code>aeac2612626724592271634fb14d3ea6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , следовательно, не является очевидным для </font><font style="vertical-align: inherit;">обратной</font><font style="vertical-align: inherit;"> трассировки. Что я пытаюсь сказать, что лучше использовать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">любую</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соль, чем не делать этого. Поэтому не так уж важно знать, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">какую</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соль использовать.</font></font>
zh_cn: 可以这么说，加盐的想法是使散列结果失去平衡。 例如，已知空字符串的 <code>d41d8cd98f00b204e9800998ecf8427e</code> 哈希为d41d8cd98f00b204e9800998ecf8427e 。 因此，如果一个内存足够好的人会看到该哈希，并且知道它是一个空字符串的哈希。 但是，如果字符串是盐腌的（例如，使用字符串&ldquo; <code>MY_PERSONAL_SALT</code> &rdquo;），则&ldquo;空字符串&rdquo;（即&ldquo; <code>MY_PERSONAL_SALT</code> &rdquo;）的哈希将变为 <code>aeac2612626724592271634fb14d3ea6</code> ，因此对于回溯而言并不明显。 我要说的是，使用<em>任何</em>盐比不使用盐更好。 因此，知道使用<em>哪种</em>盐并不是太重要。

source: The objective behind hashing passwords is simple: preventing malicious access to user accounts by compromising the database. So the goal of password hashing is to deter a hacker or cracker by costing them too much time or money to calculate the plain-text passwords. And time/cost are the best deterrents in your arsenal.
es: El objetivo de las contraseñas hash es simple:prevenir el acceso malicioso a las cuentas de los usuarios comprometiendo la base de datos.Así que el objetivo del hashing de contraseñas es disuadir a un hacker o cracker costándole demasiado tiempo o dinero para calcular las contraseñas de texto plano.Y el coste del tiempo es el mejor elemento disuasorio de su arsenal.
ja: パスワードのハッシュ化の目的は単純で、データベースを侵害することでユーザーアカウントへの悪意のあるアクセスを防ぐことです。つまり、パスワードハッシュの目的は、平文のパスワードを計算するために多くの時間やコストをかけることで、ハッカーやクラッカーを抑止することです。そして、タイムコストはあなたの武器庫の中で最高の抑止力となります。
ko: 암호 해싱의 목표는 간단합니다. 데이터베이스를 손상시켜 사용자 계정에 악의적으로 액세스하는 것을 방지합니다. 따라서 비밀번호 해싱의 목표는 일반 텍스트 비밀번호를 계산하기 위해 너무 많은 시간이나 비용을 들여 해커 나 크래커를 막는 것입니다. 그리고 시간 / 비용은 당신의 무기고에서 최고의 억제력입니다.
ru: Цель хэширования паролей проста:предотвратить злонамеренный доступ к учетным записям пользователей путем компрометации базы данных.Таким образом,цель хэширования паролей состоит в том,чтобы отпугнуть хакера или взломщика,потратив на это слишком много времени или денег,чтобы вычислить пароли из чистого текста.А затраты времени являются лучшим сдерживающим фактором в вашем арсенале.
zh_cn: 散列密码背后的目的很简单,就是防止用户账户被恶意入侵数据库。所以,密码散列的目的是为了震慑黑客或破解者,让他们花费太多时间或金钱来计算明文密码,从而达到威慑的目的。而时间成本是你的武器库中最好的威慑手段。

source: The returned hash could be stored in database as it is. Sample use for generating hash is:
es: El hachís devuelto podría almacenarse en la base de datos tal como está.El uso de la muestra para generar el hash es:
ja: 返されたハッシュはそのままデータベースに保存することができます。ハッシュを生成するための利用例は以下の通りです。
ko: 반환 된 해시는 그대로 데이터베이스에 저장 될 수 있습니다. 해시 생성을위한 샘플 사용은 다음과 같습니다.
ru: Возвращаемый хэш может быть сохранен в базе данных как есть.Пример использования для генерации хэша:
zh_cn: 返回的哈希值可以被存储在数据库中。生成散列的示例用途是:

source: The theory of the answer is still a good read though.
es: Sin embargo,la teoría de la respuesta sigue siendo una buena lectura.
ja: 答えの理論はともかく、読み応えがある。
ko: 대답의 이론은 여전히 ​​잘 읽습니다.
ru: Хотя теория ответа все еще хорошо прочитана.
zh_cn: 理论上的答案虽然还是很好读的。

source: Then have a separate user account for you that is not stored anywhere on the server, not even in the application.
es: Entonces tenga una cuenta de usuario separada para usted que no esté almacenada en ningún lugar del servidor,ni siquiera en la aplicación.
ja: そして、あなたのために、サーバー上のどこにも保存されていない、アプリケーションの中にも保存されていない別のユーザーアカウントを持っています。
ko: 그런 다음 응용 프로그램에서도 서버의 어느 곳에도 저장되지 않은 별도의 사용자 계정이 있어야합니다.
ru: Тогда у вас будет отдельная учетная запись пользователя,которая нигде не хранится на сервере,даже в приложении.
zh_cn: 然后为你拥有一个独立的用户账户,这个账户不存储在服务器上的任何地方,甚至不在应用程序中。

source: There are a lot of good hashing functions out there (<code>password_hash</code>, <code>hash</code>, etc...) but you need to select a good algorithm for the hash to be effective. (bcrypt and ones similar to it are decent algorithms.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay muchas buenas funciones de hash ( </font></font> <code>password_hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc.), pero debe seleccionar un buen algoritmo para que el hash sea efectivo. </font><font style="vertical-align: inherit;">(bcrypt y otros similares son algoritmos decentes).</font></font>
ja: 多くの優れたハッシュ関数（ <code>password_hash</code> 、 <code>hash</code> など）がありますが、ハッシュを効果的にするには、優れたアルゴリズムを選択する必要があります。 （bcryptとそれに似たものはまともなアルゴリズムです。）
ko: 거기에는 좋은 해싱 함수가 많이 있지만 ( <code>password_hash</code> , <code>hash</code> 등 ...) 해시 를 적용하려면 좋은 알고리즘을 선택해야합니다. (bcrypt와 비슷한 알고리즘은 괜찮은 알고리즘입니다.)
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует множество хороших хеш-функций ( </font></font> <code>password_hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>hash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д.), Но вам нужно выбрать хороший алгоритм, чтобы хеш был эффективным. </font><font style="vertical-align: inherit;">(bcrypt и подобные ему являются достойными алгоритмами.)</font></font>
zh_cn: 那里有很多好的哈希函数（ <code>password_hash</code> ， <code>hash</code> 等），但是您需要选择一个好的哈希算法才能使哈希有效。 （bcrypt及其类似的算法是不错的算法。）

source: There are actually <a href="http://gdataonline.com/seekhash.php">websites that do just this</a> - you can feed it a (md5) hash, and it spits out a known plaintext that generates that particular hash. If you would get access to a database that stores plain md5-hashes, it would be trivial for you to enter the hash for the admin to such a service, and log in. But, if the passwords were salted, such a service would become ineffective.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En realidad, hay </font></font><a href="http://gdataonline.com/seekhash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sitios web que hacen exactamente esto</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : puede alimentarlo con un hash (md5), y escupe un texto plano conocido que genera ese hash en particular. </font><font style="vertical-align: inherit;">Si tuviera acceso a una base de datos que almacena hash md5 simples, ser&iacute;a trivial que ingrese el hash para el administrador de dicho servicio e inicie sesi&oacute;n. Pero, si las contrase&ntilde;as fueran saladas, dicho servicio se convertir&iacute;a ineficaz.</font></font>
ja: 実際に<a href="http://gdataonline.com/seekhash.php">これを行うウェブサイト</a>があります-（md5）ハッシュをフィードすることができ、特定のハッシュを生成する既知の平文を吐き出します。 プレーンなmd5ハッシュを格納するデータベースにアクセスする場合、管理者がそのようなサービスにハッシュを入力してログインするのは簡単です。しかし、パスワードがソルトされている場合、そのようなサービスは次のようになります。効果がない。
ko: 실제로이 <a href="http://gdataonline.com/seekhash.php">작업을 수행하는 웹 사이트가</a> 있습니다-(md5) 해시를 제공 할 수 있으며 해당 해시를 생성하는 알려진 평문을 뱉어냅니다. 일반 md5 해시를 저장하는 데이터베이스에 액세스하는 경우 관리자가 해당 서비스에 대한 해시를 입력하고 로그인하는 것이 쉽지 않을 것입니다. 그러나 암호가 소금에 절인 경우 이러한 서비스는 효과적인.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На самом деле, есть </font></font><a href="http://gdataonline.com/seekhash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сайты, которые делают именно это</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - вы можете передать ему хэш (md5), и он выплевывает известный открытый текст, который генерирует этот конкретный хеш. </font><font style="vertical-align: inherit;">Если бы вы получили доступ к базе данных, в которой хранятся простые md5-хэши, для вас было бы тривиально ввести хеш для администратора для такой службы и войти в систему. Но если бы пароли были засолены, такая служба стала бы неэффективны.</font></font>
zh_cn: 实际上<a href="http://gdataonline.com/seekhash.php">，</a>有一些网站可以做到这一点 -您可以向其提供（md5）哈希，它会吐出一个生成该哈希的已知明文。 如果您可以访问存储纯md5-哈希的数据库，那么对于管理员来说，输入此类服务的哈希值并登录就不那么容易了。但是，如果密码过盐，则该服务将变成无效的。

source: There are also many rainbow table attacks on Windows passwords that run on ordinary CPUs and are very fast. All this is because Windows <em>still</em><a href="https://superuser.com/a/118279/90231">doesn't salt or stretch</a> its passwords, <a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/">even in Windows 10</a> - don't make the same mistake as Microsoft did!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n hay muchos ataques de tabla de arco iris en las contrase&ntilde;as de Windows que se ejecutan en CPU normales y son muy r&aacute;pidos. </font><font style="vertical-align: inherit;">Todo esto se debe a que Windows </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todav&iacute;a </font></font></em><a href="https://superuser.com/a/118279/90231"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no le da sal ni estira</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sus contrase&ntilde;as, </font></font><a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">incluso en Windows 10</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : &iexcl;no cometa el mismo error que Microsoft!</font></font>
ja: 通常のCPUで実行され、非常に高速なWindowsパスワードへの多数のレインボーテーブル攻撃もあります。 これはすべて<a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/">、Windows 10</a>であっても、Windowsがパスワードを<a href="https://superuser.com/a/118279/90231">ソルトしたり引き伸ばしたり</a>しないためです。Microsoftの場合と同じミスをしないでください。
ko: 일반 CPU에서 실행되며 매우 빠른 Windows 암호에 대한 레인보우 테이블 공격이 많이 있습니다. <a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/">Windows 10에서도</a> Windows가 <em>여전히</em> 암호를 변경 <a href="https://superuser.com/a/118279/90231">하거나 확장하지</a> 않기 때문입니다. Microsoft와 같은 실수를하지 마십시오!
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует также множество атак &laquo;радужных таблиц&raquo; на пароли Windows, которые выполняются на обычных процессорах и очень быстры. </font><font style="vertical-align: inherit;">Все это потому, что Windows </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">до сих пор </font></font></em><a href="https://superuser.com/a/118279/90231"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не искажает и не растягивает</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> свои пароли, </font></font><a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">даже в Windows 10</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - не делайте ту же ошибку, что и Microsoft!</font></font>
zh_cn: 在普通CPU上运行的Windows密码也有很多彩虹表攻击，而且攻击速度非常快。 这是因为<a href="https://www.guidingtech.com/61991/cracking-windows-10-password-prevent/">即使在Windows 10中</a> ，Windows <em>仍然</em> <a href="https://superuser.com/a/118279/90231">不会加盐或扩展</a>其密码-不要犯与Microsoft相同的错误！

source: There's a longer discussion of password entropy on the <a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password">Crypto StackExchange</a> site. A good Google search will also turn up a lot of results.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay una discusi&oacute;n m&aacute;s larga sobre la entrop&iacute;a de contrase&ntilde;as en el </font><font style="vertical-align: inherit;">sitio </font></font><a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Crypto StackExchange</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Una buena b&uacute;squeda en Google tambi&eacute;n arrojar&aacute; muchos resultados.</font></font>
ja: <a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password">Crypto StackExchange</a>サイトには、パスワードエントロピーに関するより長い議論があります。 優れたGoogle検索でも多くの結果が表示されます。
ko: <a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password">Crypto StackExchange</a> 사이트에서 암호 엔트로피에 대한 자세한 설명이 있습니다. 좋은 Google 검색은 많은 결과를 낳습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На </font><font style="vertical-align: inherit;">сайте </font></font><a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Crypto StackExchange</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> обсуждается вопрос об энтропии </font><font style="vertical-align: inherit;">паролей</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Хороший поиск в Google также даст много результатов.</font></font>
zh_cn: 在<a href="https://crypto.stackexchange.com/questions/374/how-should-i-calculate-the-entropy-of-a-password">Crypto StackExchange</a>站点上，关于密码熵的讨论已经很长时间了。 良好的Google搜索也会带来很多结果。
