Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Interestingly, in living out this nightmare, I learned A LOT I didn&rsquo;t know about password cracking, storage, and complexity. <em>I&rsquo;ve come to appreciate why password storage is ever so much more important than password complexity. If you don&rsquo;t know how your password is stored, then all you really can depend upon is complexity.</em> This might be common knowledge to password and crypto pros, but for the average InfoSec or Web Security expert, I highly doubt it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Curiosamente, al vivir esta pesadilla, aprend&iacute; MUCHO que no sab&iacute;a sobre el descifrado de contrase&ntilde;as, el almacenamiento y la complejidad. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He llegado a apreciar por qu&eacute; el almacenamiento de contrase&ntilde;as es mucho m&aacute;s importante que la complejidad de las contrase&ntilde;as. </font><font style="vertical-align: inherit;">Si no sabe c&oacute;mo se almacena su contrase&ntilde;a, entonces todo de lo que realmente puede depender es de la complejidad. </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto podr&iacute;a ser de conocimiento com&uacute;n para contrase&ntilde;as y profesionales de cifrado, pero para el experto promedio de InfoSec o Web Security, lo dudo mucho.</font></font>
ja: 興味深いことに、この悪夢を乗り越えて、パスワードの解読、保存、複雑さについては知らなかったたくさんのことを学びました。 <em>パスワードの保存が、パスワードの複雑さよりもはるかに重要である理由を理解するようになりました。</em> <em>パスワードの保存方法がわからない場合は、複雑さだけが信頼できます。</em> これは、パスワードと暗号の専門家にとっては一般的な知識かもしれませんが、平均的なInfoSecまたはWebセキュリティの専門家にとっては、私は非常に疑っています。
ko: 흥미롭게도,이 악몽을 극복하면서 암호 해독, 저장 및 복잡성에 대해 몰랐던 많은 것을 배웠습니다. <em>암호 저장이 암호 복잡성보다 훨씬 중요한 이유에 대해 알게되었습니다.</em> <em>암호가 어떻게 저장되는지 모르는 경우 복잡 할 수 있습니다.</em> 이것은 암호 및 암호 전문가에게는 일반적인 지식 일 수 있지만 일반적인 InfoSec 또는 웹 보안 전문가에게는 의심의 여지가 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Интересно, что, живя в этом кошмаре, я узнал много, чего не знал о взломе паролей, хранении и сложности. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я понял, почему хранение паролей намного важнее, чем сложность пароля. </font><font style="vertical-align: inherit;">Если вы не знаете, как хранится ваш пароль, то все, на что вы действительно можете рассчитывать - это сложность. </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это может быть общеизвестно для паролей и крипто-профессионалов, но для среднего специалиста по InfoSec или веб-безопасности я в этом сильно сомневаюсь.</font></font>
zh_cn: 有趣的是，在摆脱这场噩梦的过程中，我学到了很多我不知道的有关密码破解，存储和复杂性的信息。 <em>我已经开始欣赏为什么密码存储比密码复杂性重要得多了。</em> <em>如果您不知道密码的存储方式，那么您真正可以依靠的仅仅是复杂性。</em> 这可能是密码和加密专家的常识，但是对于普通的InfoSec或Web安全专家而言，我对此表示高度怀疑。

source: It can use salt (in this case, are all salts equally good? Is there any way to generate good salts?)
es: Puede usar sal (en este caso,¿todas las sales son igualmente buenas? ¿Hay alguna manera de generar sales buenas?)
ja: 塩を使うことができます(この場合、全ての塩は同じように良い塩なのでしょうか?良い塩を生成する方法はありますか?)
ko: 소금을 사용할 수 있습니다 (이 경우 모든 소금이 똑같이 좋습니까? 좋은 소금을 생성하는 방법이 있습니까?)
ru: Он может использовать соль (в данном случае,все ли соли одинаково хороши? Есть ли способ генерировать хорошие соли?)
zh_cn: 它可以用盐(这种情况下,是不是所有的盐都一样好?有没有什么方法可以产生好的盐?)

source: It is currently said that MD5 is partially unsafe. Taking this into consideration, I'd like to know which mechanism to use for password protection.
es: Actualmente se dice que el MD5 es parcialmente inseguro.Teniendo esto en cuenta,me gustaría saber qué mecanismo utilizar para la protección de la contraseña.
ja: 現在、MD5は部分的に安全性が低いと言われています。それを考慮して、パスワード保護にどのような仕組みを使えばいいのか知りたいですね。
ko: 현재 MD5는 부분적으로 안전하지 않다고합니다. 이것을 고려하여 암호 보호에 사용할 메커니즘을 알고 싶습니다.
ru: В настоящее время утверждается,что MD5 частично небезопасен.Учитывая это,хотелось бы знать,какой механизм использовать для парольной защиты.
zh_cn: 目前有人说MD5部分不安全。考虑到这一点,我想知道密码保护用什么机制?

source: It must be safe
es: Debe ser seguro
ja: それは安全でなければなりません
ko: 안전해야합니다
ru: Это должно быть безопасно
zh_cn: 一定是安全的

source: It only supports BCRYPT for now, but it aims to be easily extended to include other password hashing techniques and because the technique and cost is stored as part of the hash, changes to your prefered hashing technique/cost will not invalidate current hashes, the framework will automagically, use the correct technique/cost when validating. It also handles generating a "secure" salt if you do not explicitly define your own.
es: Por ahora sólo soporta BCRYPT,pero pretende ser fácilmente ampliado para incluir otras técnicas de hash de contraseñas y debido a que la técnica y el coste se almacenan como parte del hash,los cambios en su técnica de hash preferida no invalidarán los hashes actuales,el marco utilizará automáticamente el coste técnico correcto al validar.También se encarga de generar una sal "segura" si no define explícitamente la suya propia.
ja: 今のところBCRYPTのみをサポートしていますが、他のパスワードハッシュ技術を含むように簡単に拡張できることを目指しており、技術とコストがハッシュの一部として保存されているため、あなたが好むハッシュテクニックの変更が現在のハッシュを無効にすることはありません。また、明示的に独自のソルトを定義しない場合は、「安全な」ソルトの生成も処理します。
ko: 현재는 BCRYPT 만 지원하지만 다른 암호 해싱 기술을 포함하도록 쉽게 확장하는 것이 목표이며 기술과 비용이 해시의 일부로 저장되므로 원하는 해싱 기술 / 비용을 변경해도 현재 해시, 프레임 워크가 무효화되지 않습니다. 자동으로 검증 할 때 올바른 기술 / 비용을 사용합니다. 또한 명시 적으로 자신을 정의하지 않은 경우 "보안"소금 생성을 처리합니다.
ru: Пока что она поддерживает только BCRYPT,но ее цель-легко расширить и включить в нее другие техники хэширования паролей,а так как техника и стоимость сохраняются как часть хэша,то изменения в предложенной Вами технике хэширования не сделают недействительными текущие хэши,рамки будут автоматически использовать правильную технику хэширования при валидации.Кроме того,он обрабатывает "безопасную" соль,если Вы не определили свою собственную соль.
zh_cn: 它目前只支持BCRYPT,但它的目标是很容易扩展到包括其他的密码散列技术,由于技术和成本作为散列的一部分存储在散列中,所以改变你喜欢的散列技术和成本不会使当前的散列失效,框架在验证时将自动使用正确的技术成本。如果你没有明确地定义自己的盐,它还可以处理生成一个 "安全的 "盐。

source: Jeremiah Grossman, CTO of Whitehat Security, <a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/">stated on White Hat Security blog</a> after a recent password recovery that required brute-force breaking of his password protection:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jeremiah Grossman, CTO de Whitehat Security, </font></font><a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">declar&oacute; en el blog de White Hat Security</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> despu&eacute;s de una reciente recuperaci&oacute;n de contrase&ntilde;a que requiri&oacute; la ruptura de su protecci&oacute;n de contrase&ntilde;a por fuerza bruta:</font></font>
ja: Whitehat SecurityのCTOであるJeremiah Grossman <a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/">がWhite Hat Securityのブログ</a>で、パスワード保護のブルートフォースでの破壊を必要とする最近のパスワード回復について述べています。
ko: Whitehat Security의 CTO 인 Jeremiah Grossman은 최근 비밀번호 복구 후 비밀번호 보호를 무차별 적으로 차단해야하는 <a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/">White Hat Security 블로그에</a> 다음과 같이 언급했습니다 .
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иеремия Гроссман, технический директор Whitehat Security, </font></font><a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">заявил в блоге White Hat Security</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> после недавнего восстановления пароля, которое требовало взлома его защиты паролем:</font></font>
zh_cn: Whitehat Security的首席技术官Jeremiah Grossman在最近的密码恢复后要求在蛮力破解他的密码保护之后， <a href="https://www.whitehatsec.com/blog/cracking-aes-256-dmgs-and-epic-self-pwnage/">在White Hat Security博客上说。</a>

source: Lastly: I am not a cryptographer. Whatever I've said is my opinion, but I happen to think it's based on good ol' common sense ... and lots of reading. Remember, be as paranoid as possible, make things as hard to intrude as possible, and then, if you are still worried, contact a white-hat hacker or cryptographer to see what they say about your code/system.
es: Por último:no soy un criptógrafo.Lo que he dicho es mi opinión,pero creo que se basa en el viejo sentido común...y en mucha lectura.Recuerda,sé lo más paranoico posible,haz las cosas lo más difícil de entrometerte,y luego,si todavía estás preocupado,contacta con un hacker o criptógrafo de sombrero blanco para ver qué dicen de tu sistema de códigos.
ja: 最後に:私は暗号学者ではありません。私が言ったことはすべて私の意見ですが、それは古き良き常識に基づいていると思います。できるだけ被害妄想的になり、できるだけ侵入されにくいようにし、それでも心配なら、ホワイトハットのハッカーや暗号学者に連絡して、あなたのコードシステムについて彼らが何と言っているか確認してください。
ko: 마지막으로 : 나는 암호 전문가가 아닙니다. 내가 말한 것은 내 의견이지만, 그것이 좋은 상식과 많은 독서에 근거한다고 생각합니다. 가능한 한 편집증을 가지고 가능한 한 침입을 어렵게 한 다음, 여전히 걱정이된다면 화이트 햇 해커 나 암호 전문가에게 연락하여 코드 / 시스템에 대해 어떻게 말하는지 확인하십시오.
ru: Наконец:я не криптограф.Что бы я ни говорил,это мое мнение,но я думаю,что оно основано на здравом смысле...и большом количестве чтения.Помните,будьте как можно более параноидальным,делайте вещи как можно сложнее,а затем,если вы все еще беспокоитесь,свяжитесь с белым хакером или криптографом,чтобы увидеть,что они говорят о вашей кодовой системе.
zh_cn: 最后:我不是一个密码学家。无论我说的是什么,都是我的观点,但我恰好认为这是基于良好的常识......和大量的阅读。请记住,尽可能的偏执,尽可能的让事情尽可能的难于入侵,然后,如果你仍然担心,请联系白帽黑客或密码学家,看看他们对你的密码系统怎么说。

source: Like always DO NOT make this root or something similar.
es: Como siempre NO HAGA esta raíz o algo similar.
ja: いつものように、この根っこのようなものを作ってはいけません。
ko: 항상이 루트 나 비슷한 것을 만들지 마십시오.
ru: Как всегда,НЕ делайте этот корень или что-то подобное.
zh_cn: 像往常一样不要做这个根或类似的东西。

source: More explanation is available at- <a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/">http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay m&aacute;s explicaciones disponibles en: </font></font><a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/</font></font></a>
ja: 詳細については、 <a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/">http：</a> //www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/をご覧ください。
ko: 자세한 설명은 <a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/">http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/에서 확인할</a> 수 있습니다 .
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Более подробное объяснение доступно на </font></font><a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/</font></font></a>
zh_cn: 有关更多说明，请访问<a href="http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/">http://www.pivotalsecurity.com/blog/password-hashing-salt-should-it-be-random/</a>

source: Most programmers just don't have the expertise to write crypto related code safely without introducing vulnerabilities.
es: La mayoría de los programadores no tienen la experiencia para escribir código relacionado con el cifrado de forma segura sin introducir vulnerabilidades.
ja: ほとんどのプログラマーは、脆弱性を導入せずに安全に暗号関連のコードを書くための専門知識を持っていないだけです。
ko: 대부분의 프로그래머에게는 취약점을 도입하지 않고 암호화 관련 코드를 안전하게 작성할 수있는 전문 지식이 없습니다.
ru: Большинство программистов просто не имеют опыта,чтобы безопасно писать криптографический код без введения уязвимостей.
zh_cn: 大多数程序员只是没有专业知识来安全地写出与密码相关的代码而不引入漏洞。

source: NEVER EVER store a password in your DB, instead store the hash and unique salt, I will explain why later.
es: NUNCA guardes una contraseña en tu base de datos,en su lugar guarda el hachís y la sal única,te explicaré por qué más tarde.
ja: 決してあなたのDBにパスワードを格納することはありません、代わりにハッシュとユニークな塩を格納し、私は後で理由を説明します。
ko: 절대로 DB에 암호를 저장하지 말고 해시와 고유 한 소금을 저장하지 마십시오. 나중에 이유를 설명하겠습니다.
ru: НИКОГДА не храните пароль в своей БД,вместо того,чтобы хранить хэш и уникальную соль,я объясню почему позже.
zh_cn: 永远不要在你的数据库中存储密码,而要存储哈希和唯一的盐,我稍后会解释为什么。

source: Never email a password to your user <em>except when they have lost theirs, and you sent a temporary one.</em>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nunca env&iacute;e una contrase&ntilde;a por correo electr&oacute;nico a su usuario, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">excepto cuando haya perdido la suya, y usted haya enviado una temporal.</font></font></em>
ja: ユーザーがパスワードを<em>紛失して、一時的な</em>パスワードを送信した場合<em>を除い</em>て、ユーザーにパスワードを電子メールで送信しないでください<em>。</em>
ko: 비밀번호를 <em>분실 한 경우를 제외하고</em> 사용자에게 비밀번호를 이메일로 보내지 말고 <em>임시</em> 비밀번호를 <em>보냈습니다.</em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Никогда </font><em><font style="vertical-align: inherit;">не отправляйте</font></em><font style="vertical-align: inherit;"> пароль пользователю по электронной почте, за </font><em><font style="vertical-align: inherit;">исключением случаев, когда он потерял свой, и вы отправили временный</font></em><font style="vertical-align: inherit;"> пароль </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font></em>
zh_cn: <em>除非</em>用户忘记了密码， <em>否则</em>切勿将密码通过电子邮件发送给您的用户<em>，而是您发送了一个临时</em>密码<em>。</em>

source: Never hash passwords with <a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/">SHA1</a> or MD5 or even SHA256! <a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/">Modern crackers</a> can exceed 60 and 180 billion hashes/second (respectively).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Nunca hash contrase&ntilde;as con </font></font><a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o MD5 o incluso SHA256! </font></font><a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las galletas modernas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pueden superar los 60 y 180 mil millones de hashes / segundo (respectivamente).</font></font>
ja: <a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/">SHA1</a>またはMD5、さらにはSHA256でパスワードをハッシュしないでください！ <a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/">現代のクラッカー</a>は、（それぞれ）60および1,800億ハッシュ/秒を超える可能性があります。
ko: <a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/">SHA1</a> 또는 MD5 또는 심지어 SHA256으로 비밀번호를 해시하지 마십시오! <a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/">현대 크래커</a> 는 (각각) 초당 60-180 억 해시를 초과 할 수 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Никогда не хэшируйте пароли с </font></font><a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или MD5 или даже с SHA256! </font></font><a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Современные взломщики</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> могут превышать 60 и 180 миллиардов хэшей в секунду (соответственно).</font></font>
zh_cn: 切勿使用<a href="http://arstechnica.com/security/2012/12/oh-great-new-attack-makes-some-password-cracking-faster-easier-than-ever/">SHA1</a>或MD5甚至SHA256哈希密码！ <a href="http://securityledger.com/new-25-gpu-monster-devours-passwords-in-seconds/">现代饼干</a>可以分别超过60和1800亿个哈希/秒。

source: Never store your user's password in plain-text.
es: Nunca almacene la contraseña de su usuario en texto plano.
ja: ユーザーのパスワードを平文で保存しないでください。
ko: 사용자의 비밀번호를 일반 텍스트로 저장하지 마십시오.
ru: Никогда не храните пароль пользователя в открытом виде.
zh_cn: 不要将用户的密码存储在纯文本中。

source: Never, ever log passwords in any manner.
es: Nunca,nunca registres las contraseñas de ninguna manera.
ja: どんな方法であれ、パスワードをログに記録することは絶対にしてはいけません。
ko: 절대 어떤 식 으로든 비밀번호를 기록하지 마십시오.
ru: Никогда,никогда не запоминайте пароли.
zh_cn: 永远不要以任何方式记录密码。

source: No matter how good your encryption is if you don't properly secure the server that runs the PHP and DB all your efforts are worthless. Most servers function relatively the same way, they have ports assigned to allow you to access them remotely either through ftp or shell. Make sure that you change the default port of which ever remote connection you have active. By not doing this you in effect have made the attacker do one less step in accessing your system.
es: No importa lo buena que sea tu encriptación si no aseguras adecuadamente el servidor que ejecuta el PHP y la DB,todos tus esfuerzos son inútiles.La mayoría de los servidores funcionan relativamente de la misma manera,tienen puertos asignados para permitirte acceder a ellos remotamente ya sea a través de ftp o shell.Asegúrate de cambiar el puerto por defecto de cualquier conexión remota que tengas activa.Al no hacer esto,en efecto,has hecho que el atacante haga un paso menos para acceder a tu sistema.
ja: いくら暗号化が優れていても、PHPやDBを実行しているサーバを適切に保護しなければ、あなたの努力は無意味です。ほとんどのサーバは比較的同じように機能しています。リモート接続を有効にしている場合は、デフォルトのポートを変更するようにしてください。これをしないことで、事実上、攻撃者がシステムにアクセスするためのステップを一つ減らしたことになります。
ko: PHP와 DB를 실행하는 서버를 제대로 보호하지 않으면 암호화 성능이 아무리 우수하더라도 모든 노력이 가치가 없습니다. 대부분의 서버는 상대적으로 동일한 방식으로 작동하며, 포트는 ftp 또는 셸을 통해 원격으로 액세스 할 수 있도록 할당되어 있습니다. 원격 연결이 활성화 된 기본 포트를 변경해야합니다. 이 작업을 수행하지 않으면 침입자가 시스템에 액세스 할 때 한 단계 더 적은 작업을 수행하게됩니다.
ru: Как бы хорошо ни было ваше шифрование,если вы не обеспечиваете должную защиту сервера,на котором работают PHP и БД,все ваши усилия ничего не стоят.Большинство серверов работают относительно одинаково,им назначены порты,позволяющие вам получить к ним удаленный доступ либо через ftp,либо через оболочку командной строки.Убедитесь,что вы изменили порт по умолчанию,на котором когда-либо было установлено удаленное соединение.Не сделав этого,вы фактически заставили злоумышленника сделать на один шаг меньше для доступа к вашей системе.
zh_cn: 无论你的加密技术有多好,如果你没有正确地保护运行PHP和DB的服务器,那么你所有的努力都是徒劳的。大多数服务器的功能相对来说都是一样的,它们有指定的端口,允许你通过ftp或shell远程访问。请确保你改变你的远程连接的默认端口。如果你不这样做,你实际上是让攻击者在访问你的系统时少了一个步骤。

source: Note that even though the default hashing algorithm may change, old hashes will continue to verify just fine because the algorithm used is stored in the hash and <code>password_verify()</code> picks up on it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que a pesar de que el algoritmo de hash predeterminado puede cambiar, los hashes antiguos continuar&aacute;n verific&aacute;ndose bien porque el algoritmo utilizado se almacena en el hash y </font></font> <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> detecta.</font></font>
ja: デフォルトのハッシュアルゴリズムは変更される可能性がありますが、使用されるアルゴリズムはハッシュに格納され、 <code>password_verify()</code> がそれを選択するため、古いハッシュは引き続き問題なく検証されます 。
ko: 기본 해싱 알고리즘이 변경 될 수 있지만 사용 된 알고리즘이 해시에 저장되고 <code>password_verify()</code> 선택하기 때문에 이전 해시는 계속해서 잘 확인됩니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что, хотя алгоритм хеширования по умолчанию может измениться, старые хэши будут продолжать проверяться очень хорошо, потому что используемый алгоритм хранится в хеш-коде, и </font></font> <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> забирает его.</font></font>
zh_cn: 请注意，即使默认的哈希算法可能会更改，但由于使用的算法存储在哈希中，并且 <code>password_verify()</code> 会继续使用，因此旧哈希仍会继续验证得很好。

source: ONE WAY HASHING!!!!!!!, Never hash a password in a way that it can be reversed, Hashes should be one way, meaning you don't reverse them and compare them to the password, you instead hash the entered password the same way and compare the two hashes. This means that even if an attacker gets access to the DB he doesn't know what the actually password is, just its resulting hash. Which means more security for your users in the worst possible scenario.
es: Nunca hagas un hash de una contraseña de manera que pueda ser revertida,los hash deben ser de una manera,lo que significa que no los inviertas y los compares con la contraseña,sino que hagas un hash de la contraseña introducida de la misma manera y compares los dos hash.Esto significa que aunque un atacante acceda a la base de datos,no sabe cuál es la contraseña real,sólo el hash resultante.Lo que significa más seguridad para sus usuarios en el peor de los casos.
ja: ONE WAY HASHING! 逆引きできるような方法でパスワードをハッシュしてはいけません。ハッシュはワンウェイであるべきです。これは、たとえ攻撃者がDBにアクセスしたとしても、実際のパスワードが何であるかはわからず、その結果のハッシュだけがわかることを意味します。つまり、最悪のシナリオでもユーザーの安全性を高めることができます。
ko: 단방향 해싱 !!!!!!!, 비밀번호를 되돌릴 수있는 방식으로 비밀번호를 해시하지 마십시오. 해시는 비밀번호를 반대로 바꾸지 않고 비밀번호와 비교하지 않고 비밀번호를 해시하지 않아야한다는 것을 의미합니다. 같은 방법으로 두 해시를 비교하십시오. 즉, 침입자가 DB에 액세스하더라도 실제 암호가 무엇인지 모르고 결과 해시 만 알 수 있습니다. 이는 최악의 시나리오에서 사용자에게 더 많은 보안을 의미합니다.
ru: НИКОГДА НЕ ХЭШИРОВАТЬ!!!!,Никогда не хэшируйте пароль таким образом,чтобы его можно было перевернуть,Хэш должен быть одним из способов,то есть Вы не перевернете их и не сравните с паролем,вместо этого Вы хэшируете введенный пароль таким же способом и сравниваете два хэша.Это означает,что даже если злоумышленник получит доступ к БД,он не знает,что такое на самом деле пароль,а только его результирующий хэш.Что означает большую безопасность для ваших пользователей в худшем из возможных сценариев.
zh_cn: 单向散列! 这意味着,即使攻击者获得了数据库的访问权限,他也不知道实际的密码是什么,只是知道它的哈希值。这就意味着在最坏的情况下,你的用户可以得到更多的安全保障。
