Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Older PHP versions: OpenWall's <a href="http://www.openwall.com/phpass/">phpass</a> library is much better than most custom code - used in WordPress, Drupal, etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Versiones PHP m&aacute;s antiguas: la </font><font style="vertical-align: inherit;">biblioteca </font><font style="vertical-align: inherit;">phpass de </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OpenWall</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es mucho mejor que la mayor&iacute;a de los c&oacute;digos personalizados, utilizados en WordPress, Drupal, etc.</font></font>
ja: 古いバージョンのPHP：OpenWallの<a href="http://www.openwall.com/phpass/">phpass</a>ライブラリは、ほとんどのカスタムコードよりもはるかに優れています-WordPress 、Drupalなどで使用されます。
ko: 이전 PHP 버전 : OpenWall의 <a href="http://www.openwall.com/phpass/">phpass</a> 라이브러리는 WordPress, Drupal 등에 사용되는 대부분의 사용자 정의 코드보다 훨씬 낫습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Старые версии PHP: </font><font style="vertical-align: inherit;">библиотека </font><font style="vertical-align: inherit;">phpass </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OpenWall</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> намного лучше, чем большинство других пользовательских кодов - используется в WordPress, Drupal и т. Д.</font></font>
zh_cn: 较旧的PHP版本：OpenWall的<a href="http://www.openwall.com/phpass/">phpass</a>库比大多数自定义代码要好得多-在WordPress，Drupal等中使用。

source: One of the most common mistakes in hashing is that hashes are not unique to the users. This is mainly because salts are not uniquely generated.
es: Uno de los errores más comunes en el hash es que el hash no es exclusivo de los usuarios.Esto se debe principalmente a que las sales no se generan de forma exclusiva.
ja: ハッシュ化の最も一般的な間違いの1つは、ハッシュが利用者に一意ではないということです。これは主に塩が一意に生成されないためです。
ko: 해싱에서 가장 일반적인 실수 중 하나는 해시가 사용자에게 고유하지 않다는 것입니다. 이것은 주로 소금이 고유하게 생성되지 않기 때문입니다.
ru: Одна из наиболее распространенных ошибок в хэшировании заключается в том,что хэши не являются уникальными для пользователей.В основном это связано с тем,что соли не являются уникальными.
zh_cn: 散列中最常见的错误之一是,散列不是用户唯一的。这主要是因为散列不是唯一生成的。

source: P.s. for last 2 steps you can use your own algorithm... but be sure that you can generate this hashed password in the future when you need to authorize user...
es: P.D.para los últimos 2 pasos puedes usar tu propio algoritmo...pero asegúrate de que puedes generar esta contraseña hashada en el futuro cuando necesites autorizar al usuario...
ja: P.s.最後の2つのステップでは、独自のアルゴリズムを使用することができます...しかし、将来、ユーザーを認証する必要がある場合には、このハッシュ化されたパスワードを生成できることを確認してください。
ko: 마지막 2 단계의 PS는 자신의 알고리즘을 사용할 수 있지만 나중에 사용자에게 권한을 부여해야 할 때이 해시 암호를 생성 할 수 있는지 확인하십시오 ...
ru: P.s.для последних двух шагов вы можете использовать свой собственный алгоритм...но будьте уверены,что вы сможете сгенерировать этот хэшированный пароль в будущем при необходимости авторизации пользователя...
zh_cn: P.s.s.对于最后两步,你可以使用你自己的算法...........但要确保你可以在将来需要授权用户的时候生成这个散列密码......

source: PHP 5.5 or higher: <a href="http://php.net/manual/en/function.password-hash.php">password_hash()</a> is good quality and part of PHP core.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.5 o superior: </font></font><a href="http://php.net/manual/en/function.password-hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es de buena calidad y forma parte del n&uacute;cleo de PHP.</font></font>
ja: PHP 5.5以降： <a href="http://php.net/manual/en/function.password-hash.php">password_hash（）</a>は良質でPHPコアの一部です。
ko: PHP 5.5 이상 : <a href="http://php.net/manual/en/function.password-hash.php">password_hash ()</a> 는 좋은 품질이며 PHP 코어의 일부입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 5.5 или выше: </font></font><a href="http://php.net/manual/en/function.password-hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> хорошего качества и является частью ядра PHP.</font></font>
zh_cn: PHP 5.5或更高版本： <a href="http://php.net/manual/en/function.password-hash.php">password_hash（）</a>是高质量的，并且是PHP核心的一部分。

source: Password entropy is <a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/">approximated</a> easily. Using the full range of ascii characters (roughly 96 typeable characters) yields an entropy of 6.6 per character, which at 8 characters for a password is still too low (52.679 bits of entropy) for future security. But the good news is: longer passwords, and passwords with unicode characters, really increase the entropy of a password and make it harder to crack.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La entrop&iacute;a de contrase&ntilde;a se </font></font><a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aproxima</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> f&aacute;cilmente. </font><font style="vertical-align: inherit;">El uso de la gama completa de caracteres ascii (aproximadamente 96 caracteres que se pueden escribir) produce una entrop&iacute;a de 6.6 por car&aacute;cter, que con 8 caracteres para una contrase&ntilde;a sigue siendo demasiado baja (52.679 bits de entrop&iacute;a) para seguridad futura. </font><font style="vertical-align: inherit;">Pero la buena noticia es que las contrase&ntilde;as m&aacute;s largas y las contrase&ntilde;as con caracteres Unicode realmente aumentan la entrop&iacute;a de una contrase&ntilde;a y hacen que sea m&aacute;s dif&iacute;cil descifrarla.</font></font>
ja: パスワードエントロピーは簡単に<a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/">概算</a>できます。 全範囲のASCII文字（約96文字の入力可能文字）を使用すると、1文字あたり6.6のエントロピーが得られますが、パスワードの8文字では、将来のセキュリティのためにまだ低すぎます（52.679ビットのエントロピー）。 しかし、朗報です。長いパスワード、およびUnicode文字を含むパスワードは、パスワードのエントロピーを実際に増加させ、解読を困難にします。
ko: 암호 엔트로피는 쉽게 <a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/">근사</a> 됩니다. 전체 범위의 ASCII 문자 (대략 96 자 입력 가능 문자)를 사용하면 문자 당 6.6의 엔트로피가 생성되며, 암호의 경우 8 자에서 미래 보안을 위해 여전히 너무 낮습니다 (52.679 비트의 엔트로피) 그러나 좋은 소식은 더 긴 암호와 유니 코드 문자가있는 암호는 실제로 암호의 엔트로피를 높이고 해독하기가 더 어렵다는 것입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Энтропия пароля </font><font style="vertical-align: inherit;">легко </font></font><a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">аппроксимируется</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Использование полного диапазона символов ascii (примерно 96 набираемых символов) дает энтропию 6,6 на символ, что при 8 символах для пароля все еще слишком мало (52,679 бит энтропии) для будущей безопасности. </font><font style="vertical-align: inherit;">Но есть и хорошая новость: более длинные пароли и пароли с символами Юникода действительно увеличивают энтропию пароля и усложняют его взлом.</font></font>
zh_cn: 密码熵很容易<a href="https://ritcyberselfdefense.wordpress.com/2011/09/24/how-to-calculate-password-entropy/">近似</a> 。 使用全部范围的ascii字符（大约96个可键入字符），每个字符的熵为6.6，而对于8个字符的密码，它的熵仍然太低（52.679位熵），对于将来的安全性而言。 但好消息是：更长的密码以及带有unicode字符的密码，确实增加了密码的熵并使其更难以破解。

source: Passwords should always be salted before hashed. Salting adds a random string to the password so similar passwords don't appear the same in the DB. However if the salt is not unique to each user (ie: you use a hard coded salt) than you pretty much have made your salt worthless. Because once an attacker figures out one password salt he has the salt for all of them.
es: Las contraseñas siempre deben ser saladas antes de ser lavadas.La saladura añade una cadena aleatoria a la contraseña para que no aparezcan contraseñas similares en la base de datos.Sin embargo,si la sal no es única para cada usuario (es decir,si usas una sal con código duro),entonces prácticamente no tienes valor para la sal.Porque una vez que un atacante descubre una contraseña de sal,tiene la sal para todas ellas.
ja: パスワードは必ずハッシュ化する前に塩漬けにしなければなりません。ソルトすることでパスワードにランダムな文字列が追加されるので、似たようなパスワードが DB で同じように表示されることはありません。しかし、もしソルトが各ユーザに固有のものでない場合(例えばハードコード化されたソルトを使用している場合など)は、ソルトの価値がなくなってしまいます。なぜなら、一度攻撃者が一つのパスワードソルトを見つけ出したら、全てのパスワードのソルトを手に入れてしまうからです。
ko: 비밀번호는 해시하기 전에 항상 소금에 절 여야합니다. Salting은 암호에 임의의 문자열을 추가하므로 DB에서 유사한 암호가 동일하게 표시되지 않습니다. 그러나 소금이 각 사용자에게 고유하지 않은 경우 (즉, 하드 코딩 된 소금을 사용하는 경우) 소금을 무가치하게 만든 것보다 많이 사용합니다. 일단 공격자가 하나의 암호 소금을 알아 내기 때문에 모든 암호 소금이 있습니다.
ru: Пароли всегда должны быть солеными перед хэшированием.Соль добавляет к паролю случайную строку,чтобы похожие пароли не выглядели одинаковыми в БД.Однако,если соль не уникальна для каждого пользователя (т.е.вы используете жестко закодированную соль),то вы практически сделали вашу соль бесполезной.Потому что как только злоумышленник вычислит одну соль для пароля,у него будет соль для всех паролей.
zh_cn: 在进行散列前,密码应该先进行加盐处理。加盐会在密码中添加一个随机的字符串,这样类似的密码就不会在数据库中出现相同的密码。但是,如果盐分不是每个用户的唯一性(即:你使用的是硬编码的盐分),那么你的盐分就基本没有价值了。因为一旦攻击者知道了一个密码盐,他就会知道所有的密码盐。

source: Providing the <code>PASSWORD_DEFAULT</code> instructs PHP to use the default hashing algorithm of the installed version of PHP. Exactly which algorithm that means is intended to change over time in future versions, so that it will always be one of the strongest available algorithms.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Proporcionar </font></font> <code>PASSWORD_DEFAULT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> indica a PHP que use el algoritmo de hash predeterminado de la versi&oacute;n instalada de PHP. </font><font style="vertical-align: inherit;">Exactamente qu&eacute; algoritmo significa que est&aacute; destinado a cambiar con el tiempo en futuras versiones, por lo que siempre ser&aacute; uno de los algoritmos m&aacute;s fuertes disponibles.</font></font>
ja: <code>PASSWORD_DEFAULT</code> を指定すると、インストールされているバージョンのPHPのデフォルトのハッシュアルゴリズムを使用するようにPHPに指示されます。 正確にはどのアルゴリズムが将来のバージョンで時間の経過とともに変更されることを意図しているため、常に最も強力なアルゴリズムの1つになります。
ko: <code>PASSWORD_DEFAULT</code> 를 제공하면 설치된 PHP 버전의 기본 해싱 알고리즘을 사용하도록 PHP에 지시합니다. 정확히 어떤 알고리즘을 의미하는지는 이후 버전에서 시간이 지남에 따라 변경되어 항상 가장 강력한 알고리즘 중 하나가 될 것입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предоставление </font></font> <code>PASSWORD_DEFAULT</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> указывает PHP на использование алгоритма хеширования по умолчанию установленной версии PHP. </font><font style="vertical-align: inherit;">Какой именно этот алгоритм предназначен для изменения со временем в будущих версиях, так что он всегда будет одним из самых сильных доступных алгоритмов.</font></font>
zh_cn: 提供 <code>PASSWORD_DEFAULT</code> 可以指示PHP使用已安装版本的PHP的默认哈希算法。 确切地说，哪种算法打算在将来的版本中随着时间的推移而改变，因此它将始终是最强大的可用算法之一。
