Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Recently I had a discussion whether password hashes salted with random bits are more secure than the one salted with guessable or known salts. Let&rsquo;s see: If the system storing password is compromised as well as the system which stores the random salt, the attacker will have access to hash as well as salt, so whether the salt is random or not, doesn&rsquo;t matter. The attacker will can generate pre-computed rainbow tables to crack the hash. Here comes the interesting part- it is not so trivial to generate pre-computed tables. Let us take example of WPA security model. Your WPA password is actually never sent to Wireless Access Point. Instead, it is hashed with your SSID (the network name- like Linksys, Dlink etc). A very good explanation of how this works is here. In order to retrieve password from hash, you will need to know the password as well as salt (network name). Church of Wifi has already pre-computed hash tables which has top 1000 SSIDs and about 1 million passwords. The size is of all tables is about 40 GB. As you can read on their site, someone used 15 FGPA arrays for 3 days to generate these tables. Assuming victim is using the SSID as &ldquo;a387csf3&Prime; and password as &ldquo;123456&Prime;, will it be cracked by those tables? No! .. it cannot. Even if the password is weak, the tables don&rsquo;t have hashes for SSID a387csf3. This is the beauty of having random salt. It will deter crackers who thrive upon pre-computed tables. Can it stop a determined hacker? Probably not. But using random salts does provide additional layer of defense. While we are on this topic, let us discuss additional advantage of storing random salts on a separate system. Scenario #1 : Password hashes are stored on system X and salt values used for hashing are stored on system Y. These salt values are guessable or known (e.g. username) Scenario#2 : Password hashes are stored on system X and salt values used for hashing are stored on system Y. These salt values are random. In case system X has been compromised, as you can guess, there is a huge advantage of using random salt on a separate system (Scenario #2) . The attacker will need to guess addition values to be able to crack hashes. If a 32 bit salt is used, 2^32= 4,294,967,296 (about 4.2 billion) iterations will can be required for each password guessed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Recientemente tuve una discusi&oacute;n sobre si los hashes de contrase&ntilde;as salados con bits aleatorios son m&aacute;s seguros que el que se ha salado con sales adivinables o conocidas. Veamos: si el sistema que almacena la contrase&ntilde;a se ve comprometido y el sistema que almacena la sal aleatoria, el atacante tendr&aacute; acceso a hash y sal, por lo que no importa si la sal es aleatoria o no. El atacante puede generar tablas de arco iris precalculadas para descifrar el hash. Aqu&iacute; viene la parte interesante: no es tan trivial generar tablas precalculadas. Tomemos un ejemplo del modelo de seguridad WPA. Su contrase&ntilde;a WPA nunca se env&iacute;a al punto de acceso inal&aacute;mbrico. En cambio, est&aacute; codificado con su SSID (el nombre de la red como Linksys, Dlink, etc.). Una muy buena explicaci&oacute;n de c&oacute;mo funciona esto est&aacute; aqu&iacute;. Para recuperar la contrase&ntilde;a del hash,Necesitar&aacute; conocer la contrase&ntilde;a y la sal (nombre de la red). Church of Wifi ya ha precalculado las tablas hash que tienen los mejores 1000 SSID y aproximadamente 1 mill&oacute;n de contrase&ntilde;as. El tama&ntilde;o de todas las tablas es de unos 40 GB. Como puede leer en su sitio, alguien us&oacute; 15 matrices FGPA durante 3 d&iacute;as para generar estas tablas. Suponiendo que la v&iacute;ctima est&eacute; usando el SSID como "a387csf3" y la contrase&ntilde;a como "123456", &iquest;ser&aacute;n descifradas por esas tablas? &iexcl;No! .. no puede. Incluso si la contrase&ntilde;a es d&eacute;bil, las tablas no tienen hashes para SSID a387csf3. Esta es la belleza de tener sal al azar. Disuadir&aacute; a los crackers que prosperan en tablas precalculadas. &iquest;Puede detener a un hacker determinado? Probablemente no. Pero el uso de sales aleatorias proporciona una capa adicional de defensa. Mientras estamos en este tema,Discutamos una ventaja adicional de almacenar sales aleatorias en un sistema separado. Escenario n. &deg; 1: los valores hash de contrase&ntilde;a se almacenan en el sistema X y los valores de sal utilizados para el hash se almacenan en el sistema Y. Estos valores de sal son adivinables o conocidos (por ejemplo, nombre de usuario) Escenario n. &deg; 2: los valores hash de contrase&ntilde;a se almacenan en el sistema X y los valores sal se utilizan para el hash se almacena en el sistema Y. Estos valores de sal son aleatorios. En caso de que el sistema X se haya visto comprometido, como puede adivinar, existe una gran ventaja de usar sal aleatoria en un sistema separado (Escenario # 2). El atacante deber&aacute; adivinar los valores de suma para poder descifrar los hash. Si se usa una sal de 32 bits, se requerir&aacute;n 2 ^ 32 = 4,294,967,296 (aproximadamente 4,2 mil millones) de iteraciones para cada contrase&ntilde;a adivinada.Los valores de contrase&ntilde;a se almacenan en el sistema X y los valores de sal utilizados para el hash se almacenan en el sistema Y. Estos valores de sal son adivinables o conocidos (por ejemplo, nombre de usuario) Escenario # 2: Los valores de contrase&ntilde;a se almacenan en el sistema X y los valores de sal utilizados para el hash se almacenan en sistema Y. Estos valores de sal son aleatorios. En caso de que el sistema X se haya visto comprometido, como puede adivinar, existe una gran ventaja de usar sal aleatoria en un sistema separado (Escenario # 2). El atacante deber&aacute; adivinar los valores de suma para poder descifrar los hash. Si se usa una sal de 32 bits, se requerir&aacute;n 2 ^ 32 = 4,294,967,296 (aproximadamente 4,2 mil millones) de iteraciones para cada contrase&ntilde;a adivinada.Los valores de contrase&ntilde;a se almacenan en el sistema X y los valores de sal utilizados para el hash se almacenan en el sistema Y. Estos valores de sal son adivinables o conocidos (por ejemplo, nombre de usuario) Escenario # 2: Los valores de contrase&ntilde;a se almacenan en el sistema X y los valores de sal utilizados para el hash se almacenan en sistema Y. Estos valores de sal son aleatorios. En caso de que el sistema X se haya visto comprometido, como puede adivinar, existe una gran ventaja de usar sal aleatoria en un sistema separado (Escenario # 2). El atacante deber&aacute; adivinar los valores de suma para poder descifrar los hash. Si se usa una sal de 32 bits, se requerir&aacute;n 2 ^ 32 = 4,294,967,296 (aproximadamente 4,2 mil millones) de iteraciones para cada contrase&ntilde;a adivinada.Estos valores de sal son aleatorios. En caso de que el sistema X se haya visto comprometido, como puede adivinar, existe una gran ventaja de usar sal aleatoria en un sistema separado (Escenario # 2). El atacante deber&aacute; adivinar los valores de suma para poder descifrar los hash. Si se usa una sal de 32 bits, se requerir&aacute;n 2 ^ 32 = 4,294,967,296 (aproximadamente 4,2 mil millones) de iteraciones para cada contrase&ntilde;a adivinada.Estos valores de sal son aleatorios. En caso de que el sistema X se haya visto comprometido, como puede adivinar, existe una gran ventaja de usar sal aleatoria en un sistema separado (Escenario # 2). El atacante deber&aacute; adivinar los valores de suma para poder descifrar los hash. Si se usa una sal de 32 bits, se requerir&aacute;n 2 ^ 32 = 4,294,967,296 (aproximadamente 4,2 mil millones) de iteraciones para cada contrase&ntilde;a adivinada.</font></font>
ja: 最近、ランダムビットでソルトされたパスワードハッシュが、推測可能なソルトまたは既知のソルトでソルトされたものよりも安全かどうかについて話し合いました。 見てみましょう：パスワードを保存するシステムとランダムなソルトを保存するシステムが侵害された場合、攻撃者はソルトだけでなくハッシュにもアクセスできるため、ソルトがランダムかどうかは関係ありません。 攻撃者は、事前に計算されたレインボーテーブルを生成してハッシュをクラックすることができます。 ここで興味深い部分があります。事前に計算されたテーブルを生成することはそれほど簡単ではありません。 WPAセキュリティモデルの例を見てみましょう。 WPAパスワードが実際にワイヤレスアクセスポイントに送信されることはありません。 代わりに、SSID（Linksys、Dlinkなどのネットワーク名）でハッシュされます。 これがどのように機能するかについての非常に良い説明がここにあります。 ハッシュからパスワードを取得するには、パスワードとソルト（ネットワーク名）を知っている必要があります。 Church of Wifiは、上位1000のSSIDと約100万のパスワードを持つハッシュテーブルを事前に計算しています。 すべてのテーブルのサイズは約40 GBです。 あなたのサイトで読むことができるように、誰かが15のFGPAアレイを3日間使用してこれらのテーブルを生成しました。 被害者がSSIDを「a387csf3」、パスワードを「123456」として使用しているとすると、これらのテーブルによってクラックされますか？ 番号！ .. できない。 パスワードが弱い場合でも、テーブルにはSSID a387csf3のハッシュがありません。 これが無作為な塩の美しさです。 事前に計算されたテーブルで成功するクラッカーを阻止します。 断固としたハッカーを止めることはできますか？ おそらく違います。 しかし、ランダムな塩を使用すると、追加の防御層が提供されます。 このトピックについて説明しますが、ランダムな塩を別のシステムに保存することのさらなる利点について説明します。 シナリオ＃1：パスワードハッシュはシステムXに格納され、ハッシュに使用されるソルト値はシステムYに格納されます。これらのソルト値は推測可能または既知（例：ユーザー名）シナリオ＃2：パスワードハッシュはシステムXに格納され、ソルト値はハッシュはシステムYに格納されます。これらのソルト値はランダムです。 ご想像のとおり、システムXが侵害された場合、別のシステムでランダムソルトを使用することには大きなメリットがあります（シナリオ＃2）。 攻撃者は、ハッシュをクラックするために追加の値を推測する必要があります。 32ビットのソルトを使用する場合、推測されたパスワードごとに2 ^ 32 = 4,294,967,296（約42億）の反復が必要になる可能性があります。
ko: 최근에 무작위 비트로 소금에 절인 암호 해시가 추측 가능하거나 알려진 소금으로 소금에 절인 암호 해시보다 더 안전한지에 대한 토론이있었습니다. 보자 : 무작위 소금을 저장하는 시스템뿐만 아니라 암호를 저장하는 시스템이 손상되면 공격자는 소금이 무작위이든 아니든 상관없이 해시와 소금에 액세스 할 수 있습니다. 공격자는 미리 계산 된 레인보우 테이블을 생성하여 해시를 해독 할 수 있습니다. 흥미로운 부분이 있습니다. 미리 계산 된 테이블을 생성하는 것은 그리 쉬운 일이 아닙니다. WPA 보안 모델을 예로 들어 보겠습니다. WPA 암호는 실제로 무선 액세스 포인트로 전송되지 않습니다. 대신 SSID (Linksys, Dlink 등의 네트워크 이름)로 해시됩니다. 이것이 어떻게 작동하는지에 대한 아주 좋은 설명이 여기 있습니다. 해시에서 비밀번호를 검색하려면 비밀번호와 솔트 (네트워크 이름)를 알아야합니다. Church of Wifi는 이미 1000 개의 상위 SSID와 약 1 백만 개의 암호를 가진 사전 계산 된 해시 테이블을 가지고 있습니다. 모든 테이블의 크기는 약 40GB입니다. 사이트에서 읽을 수 있듯이 누군가가 3 일 동안 15 개의 FGPA 어레이를 사용하여 이러한 테이블을 생성했습니다. 피해자가 SSID를 "a387csf3"로 사용하고 암호를 "123456"으로 사용한다고 가정하면 해당 테이블에 의해 크랙됩니까? 아니! .. 그럴 순 없어. 암호가 약하더라도 테이블에 SSID a387csf3에 대한 해시가 없습니다. 이것이 무작위 소금의 아름다움입니다. 사전 계산 테이블에서 번성하는 크래커를 막을 것입니다. 결정된 해커를 막을 수 있습니까? 아마 아닙니다. 그러나 무작위 소금을 사용하면 추가적인 방어 층이 제공됩니다. 우리가이 주제에있는 동안, 임의의 소금을 별도의 시스템에 저장하는 추가 이점에 대해 논의 해 보자. 시나리오 # 1 : 비밀번호 해시는 시스템 X에 저장되고 해싱에 사용 된 솔트 값은 시스템 Y에 저장됩니다. 이러한 솔트 값은 추측 가능하거나 알려져 있습니다 (예 : 사용자 이름) 시나리오 # 2 : 비밀번호 해시는 시스템 X에 저장되며 솔트 값은 해싱은 시스템 Y에 저장됩니다. 이러한 솔트 값은 임의적입니다. 추측 할 수 있듯이 시스템 X가 손상된 경우 별도의 시스템 (시나리오 # 2)에서 랜덤 솔트를 사용하면 큰 이점이 있습니다. 공격자는 해시를 해독 할 수 있도록 추가 값을 추측해야합니다. 32 비트 솔트를 사용하는 경우 추측되는 각 비밀번호마다 2 ^ 32 = 4,294,967,296 (약 42 억 건)의 반복이 필요할 수 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недавно я обсуждал вопрос о том, являются ли хеши паролей со случайными битами более безопасными, чем хэши с вероятными или известными солями. Давайте посмотрим: если система, хранящая пароль, скомпрометирована так же, как и система, которая хранит случайную соль, злоумышленник будет иметь доступ к хешу, а также к соли, так что, является ли соль случайной или нет, не имеет значения. Атакующий может генерировать предварительно вычисленные радужные таблицы, чтобы взломать хеш. Здесь возникает интересная часть - это не так тривиально генерировать предварительно вычисленные таблицы. Давайте рассмотрим пример модели безопасности WPA. Ваш пароль WPA фактически никогда не отправляется беспроводной точке доступа. Вместо этого он хэшируется с вашим SSID (сетевое имя, такое как Linksys, Dlink и т. Д.). Очень хорошее объяснение того, как это работает, здесь. Чтобы восстановить пароль из хэша,вам нужно будет знать как пароль, так и соль (имя сети). Church of Wifi уже предварительно вычислил хеш-таблицы, которые имеют 1000 лучших SSID и около 1 миллиона паролей. Размер всех таблиц составляет около 40 ГБ. Как вы можете прочитать на их сайте, кто-то использовал 15 массивов FGPA в течение 3 дней для генерации этих таблиц. Предполагая, что жертва использует SSID в качестве &laquo;a387csf3&raquo; и пароль в качестве &laquo;123456&raquo;, будут ли они взломаны этими таблицами? Нет! .. оно не может. Даже если пароль слабый, в таблицах нет хэшей для SSID a387csf3. Это красота наличия случайной соли. Это будет сдерживать взломщиков, которые процветают на предварительно вычисленных столах Может ли это остановить решительного хакера? Возможно нет. Но использование случайных солей обеспечивает дополнительный уровень защиты. Пока мы на эту тему,давайте обсудим дополнительное преимущество хранения случайных солей в отдельной системе. Сценарий # 1: хеши паролей хранятся в системе X, а значения соли, используемые для хеширования, хранятся в системе Y. Эти солт-значения являются предположительными или известными (например, имя пользователя). Сценарий # 2: хеши паролей хранятся в системе X, а значения соли используются для хеширование хранится в системе Y. Эти значения соли являются случайными. Как вы можете догадаться, если система X была скомпрометирована, то использование случайной соли в отдельной системе дает огромное преимущество (сценарий № 2). Атакующий должен будет угадать дополнительные значения, чтобы иметь возможность взломать хэши. Если используется 32-битная соль, для каждого угаданного пароля может потребоваться 2 ^ 32 = 4 294 967 296 (около 4,2 миллиарда) итераций.Хеши паролей хранятся в системе X, а значения солей, используемые для хеширования, хранятся в системе Y. Эти солт-значения являются предположительными или известными (например, имя пользователя) Сценарий # 2: Хеши паролей хранятся в системе X, а значения солей, используемых для хеширования, сохраняются в Система Y. Эти значения соли являются случайными. Как вы можете догадаться, если система X была скомпрометирована, то использование случайной соли в отдельной системе дает огромное преимущество (сценарий № 2). Атакующий должен будет угадать дополнительные значения, чтобы иметь возможность взломать хэши. Если используется 32-битная соль, для каждого угаданного пароля может потребоваться 2 ^ 32 = 4 294 967 296 (около 4,2 миллиарда) итераций.Хеши паролей хранятся в системе X, а значения солей, используемые для хеширования, хранятся в системе Y. Эти солт-значения являются предположительными или известными (например, имя пользователя) Сценарий # 2: Хеши паролей хранятся в системе X, а значения солей, используемых для хеширования, сохраняются в Система Y. Эти значения соли являются случайными. Как вы можете догадаться, если система X была скомпрометирована, то использование случайной соли в отдельной системе дает огромное преимущество (сценарий № 2). Атакующий должен будет угадать дополнительные значения, чтобы иметь возможность взломать хэши. Если используется 32-битная соль, для каждого угаданного пароля может потребоваться 2 ^ 32 = 4 294 967 296 (около 4,2 миллиарда) итераций.Эти значения соли являются случайными. Как вы можете догадаться, если система X была скомпрометирована, то использование случайной соли в отдельной системе дает огромное преимущество (сценарий № 2). Атакующий должен будет угадать дополнительные значения, чтобы иметь возможность взломать хэши. Если используется 32-битная соль, для каждого угаданного пароля может потребоваться 2 ^ 32 = 4 294 967 296 (около 4,2 миллиарда) итераций.Эти значения соли являются случайными. Как вы можете догадаться, если система X была скомпрометирована, то использование случайной соли в отдельной системе дает огромное преимущество (сценарий № 2). Атакующий должен будет угадать дополнительные значения, чтобы иметь возможность взломать хэши. Если используется 32-битная соль, для каждого угаданного пароля может потребоваться 2 ^ 32 = 4 294 967 296 (около 4,2 миллиарда) итераций.</font></font>
zh_cn: 最近，我讨论了用随机位加盐的密码散列是否比用可猜测或已知盐加盐的密码散列更安全。 让我们看看：如果存储密码的系统以及存储随机盐的系统遭到破坏，则攻击者将可以访问哈希和盐，因此盐是否是随机的都没有关系。 攻击者可以生成预先计算的彩虹表来破解哈希。 有趣的部分来了-生成预计算表并不是那么简单。 让我们以WPA安全模型为例。 实际上，您的WPA密码永远不会发送到Wireless Access Point。 而是使用您的SSID（网络名称，如Linksys，Dlink等）对它进行哈希处理。 这是一个很好的解释。 为了从哈希中检索密码，您将需要知道密码以及盐（网络名称）。 Wifi教堂已经预先计算了哈希表，该哈希表具有前1000个SSID和大约一百万个密码。 所有表的大小约为40 GB。 在您的网站上可以看到，有人使用15个FGPA阵列3天来生成这些表。 假设受害者使用的SSID为&ldquo; a387csf3&rdquo;，密码为&ldquo; 123456&rdquo;，那么这些表会破解它吗？ 没有！ .. 这不可以。 即使密码很弱，表也没有SSID a387csf3的哈希值。 这是无盐的美丽。 它将阻止在预计算表上蓬勃发展的饼干用户。 它可以阻止坚定的黑客吗？ 可能不是。 但是使用随机盐确实可以提供额外的防御层。 当我们处于这个主题上时，让我们讨论将随机盐存储在单独系统上的其他优点。 方案1：密码哈希存储在系统X上，用于哈希的盐值存储在系统Y。这些盐值是可猜测的或已知的（例如，用户名）方案2：密码哈希存储在系统X上，并且盐值用于哈希存储在系统Y中。这些盐值是随机的。 如您所料，如果系统X遭到破坏，则在单独的系统上使用随机盐具有巨大的优势（方案2）。 攻击者将需要猜测附加值才能破解哈希。 如果使用32位盐，则每个猜测的密码将需要2 ^ 32 = 4,294,967,296（约42亿）次迭代。

source: Reset everyone's passwords when the database is compromised.
es: Restablecer las contraseñas de todos cuando la base de datos se vea comprometida.
ja: データベースが漏洩した場合、全員のパスワードをリセットします。
ko: 데이터베이스가 손상되면 모든 사람의 비밀번호를 재설정하십시오.
ru: Сброс всех паролей,когда база данных взломана.
zh_cn: 当数据库遭到破坏时,重置每个人的密码。

source: SHA1 is now also considered somewhat compromised, but to a far lesser degree than MD5. By using a salt (any salt), you're preventing the use of a generic <a href="http://en.wikipedia.org/wiki/Rainbow_table">rainbow table</a> to attack your hashes (some people have even had success using Google as a sort of rainbow table by searching for the hash). An attacker could conceivably generate a rainbow table using your salt, so that's why you should include a user-specific salt. That way, they will have to generate a rainbow table for each and every record in your system, not just one for your entire system! With that type of salting, even MD5 is decently secure.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1 ahora tambi&eacute;n se considera algo comprometido, pero en un grado mucho menor que MD5. Al usar una sal (cualquier sal), evitas el uso de una </font></font><a href="http://en.wikipedia.org/wiki/Rainbow_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tabla de arco iris</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> gen&eacute;rica </font><font style="vertical-align: inherit;">para atacar tus hashes (algunas personas incluso han tenido &eacute;xito al usar Google como una especie de tabla de arco iris al buscar el hash). Un atacante podr&iacute;a generar una tabla de arco iris usando su sal, por eso debe incluir una sal espec&iacute;fica del usuario. De esa manera, tendr&aacute;n que generar una tabla de arco iris para todos y cada uno de los registros de su sistema, &iexcl;no solo uno para todo el sistema! Con ese tipo de salaz&oacute;n, incluso el MD5 es decentemente seguro.</font></font>
ja: SHA1は現在やや危険にさらされていると考えられていますが、MD5よりもはるかに劣っています。 ソルト（任意のソルト）を使用することで、一般的な<a href="http://en.wikipedia.org/wiki/Rainbow_table">レインボーテーブル</a>を使用してハッシュを攻撃するのを防ぐことができます（ハッシュを検索して、Googleを一種のレインボーテーブルとして使用することに成功した人もいます）。 攻撃者はおそらくソルトを使用してレインボーテーブルを生成する可能性があるため、ユーザー固有のソルトを含める必要があります。 そうすれば、システム全体の1つではなく、システム内のすべてのレコードについてレインボーテーブルを生成する必要があります。 そのタイプのソルティングを使用すると、MD5でもかなり安全です。
ko: SHA1은 이제 다소 손상되었지만 MD5보다 훨씬 낮은 수준으로 간주됩니다. 소금 (모든 소금)을 사용하면 해시를 공격하기 위해 일반 <a href="http://en.wikipedia.org/wiki/Rainbow_table">레인보우 테이블</a> 을 사용하지 못하게됩니다 (일부 사람들은 해시를 검색하여 일종의 레인보우 테이블로 Google을 사용하는 경우도있었습니다). 공격자는 소금을 사용하여 무지개 테이블을 생성 할 수 있으므로 사용자 별 소금을 포함시켜야합니다. 이렇게하면 전체 시스템에 대한 것이 아니라 시스템의 모든 레코드에 대해 레인보우 테이블을 생성해야합니다! 이러한 유형의 염분을 사용하면 MD5조차도 상당히 안전합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SHA1 теперь также считается несколько скомпрометированным, но в гораздо меньшей степени, чем MD5. Используя соль (любую соль), вы предотвращаете использование универсальной </font></font><a href="http://en.wikipedia.org/wiki/Rainbow_table"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">радужной таблицы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для атаки на ваши хэши (некоторые люди даже добились успеха, используя Google как своего рода радужную таблицу при поиске хеша). Злоумышленник может сгенерировать радужную таблицу, используя вашу соль, поэтому вы должны добавить соль, специфичную для пользователя. Таким образом, им придется генерировать радужную таблицу для каждой записи в вашей системе, а не только для всей вашей системы! При таком типе посола даже MD5 прилично безопасен.</font></font>
zh_cn: 现在也认为SHA1受到了一定影响，但程度要比MD5小得多。 通过使用盐（任何盐），您可以防止使用通用的<a href="http://en.wikipedia.org/wiki/Rainbow_table">彩虹表</a>来攻击您的哈希（有些人甚至通过搜索哈希将Google用作一种彩虹表已获得成功）。 可以想象，攻击者可能会使用您的盐生成彩虹表，因此这就是为什么您应该包含用户特定的盐的原因。 这样，他们将不得不为系统中的每个记录生成一个彩虹表，而不仅仅是整个系统的一个！ 使用这种类型的盐腌，即使MD5也相当安全。

source: Secure hash and salt for PHP passwords
es: Asegurar el hash y la sal para las contraseñas PHP
ja: PHP パスワード用の安全なハッシュとソルト
ko: PHP 암호를위한 안전한 해시 및 솔트
ru: Безопасный хэш и соль для паролей PHP
zh_cn: PHP密码的安全散列和盐

source: Secure methods of storing keys, passwords for asp.net
es: Métodos seguros de almacenamiento de claves,contraseñas para asp.net
ja: asp.net のキー、パスワードの安全な保存方法
ko: asp.net의 안전한 키 저장 방법
ru: Безопасные методы хранения ключей,паролей для asp.net
zh_cn: asp.net的密钥和密码的安全存储方法

source: Simple Password Encryption
es: Cifrado con contraseña simple
ja: 簡単なパスワード暗号化
ko: 간단한 비밀번호 암호화
ru: Простое шифрование пароля
zh_cn: 简单的密码加密

source: Since then, PHP has given us <a href="http://php.net/manual/en/function.password-hash.php"><code>password_hash</code></a> and <a href="http://php.net/manual/en/function.password-verify.php"><code>password_verify</code></a> and, since their introduction, they are the recommended password hashing &amp; checking method.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde entonces, PHP nos ha proporcionado </font></font><a href="http://php.net/manual/en/function.password-hash.php"> <code>password_hash</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="http://php.net/manual/en/function.password-verify.php"> <code>password_verify</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y, desde su introducci&oacute;n, son el m&eacute;todo recomendado de comprobaci&oacute;n y comprobaci&oacute;n de contrase&ntilde;as.</font></font>
ja: それ以来、PHPから<a href="http://php.net/manual/en/function.password-hash.php"> <code>password_hash</code> </a>と<a href="http://php.net/manual/en/function.password-verify.php"> <code>password_verify</code> </a>が提供されており、それらが導入されて以来、これらは推奨されるパスワードハッシュおよびチェック方式です。
ko: 그 이후로, PHP는 우리에게 <a href="http://php.net/manual/en/function.password-hash.php"> <code>password_hash</code> </a> 와 <a href="http://php.net/manual/en/function.password-verify.php"> <code>password_verify</code> 를</a> 주었으며, 소개 된 이후로 권장되는 암호 해싱 및 검사 방법입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С тех пор PHP предоставил нам </font></font><a href="http://php.net/manual/en/function.password-hash.php"> <code>password_hash</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://php.net/manual/en/function.password-verify.php"> <code>password_verify</code> ,</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и с момента их появления они являются рекомендуемым методом хеширования и проверки паролей.</font></font>
zh_cn: 从那时起，PHP就给了我们<a href="http://php.net/manual/en/function.password-hash.php"> <code>password_hash</code> </a>和<a href="http://php.net/manual/en/function.password-verify.php"> <code>password_verify</code> ,</a>并且自从引入以来，它们就是推荐的密码哈希和检查方法。
