Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Also, should I store two fields in the database (one using MD5 and another one using SHA, for example)? Would it make it safer or unsafer?
es: Además,¿debo almacenar dos campos en la base de datos (uno usando MD5 y otro usando SHA,por ejemplo)? ¿Lo haría más seguro o inseguro?
ja: また、データベースに2つのフィールド(1つはMD5を使用して、もう1つはSHAを使用して、例えば)を格納した方がいいのでしょうか?その方が安全でしょうか、それとも安全ではないでしょうか?
ko: 또한 데이터베이스에 두 개의 필드 (예 : MD5를 사용하는 필드와 SHA를 사용하는 필드)를 저장해야합니까? 더 안전하거나 안전하지 않습니까?
ru: Также следует ли хранить два поля в базе данных (одно с использованием MD5,а другое с использованием SHA,например)? Будет ли это безопаснее или небезопаснее?
zh_cn: 另外,我是否应该在数据库中存储两个字段(例如一个使用MD5,另一个使用SHA)?这样做会更安全还是不安全?

source: Always have your application have its own account to access the DB, and only give it the privileges it will need.
es: Siempre que su aplicación tenga su propia cuenta para acceder a la BD,y sólo le dé los privilegios que necesitará.
ja: 常にアプリケーションに独自のアカウントを持たせてDBにアクセスさせ、必要な権限だけを与えるようにしましょう。
ko: 응용 프로그램은 항상 DB에 액세스하기 위해 자신의 계정을 가지고 있어야하며 필요한 권한 만 부여하십시오.
ru: У вашего приложения всегда есть своя учетная запись для доступа к БД,и оно должно обладать только теми привилегиями,которые ему потребуются.
zh_cn: 始终让你的应用程序有自己的账户来访问DB,并且只给它所需要的权限。

source: Another reason that you want a good, robust hash on a user accounts is to give you enough time to change all the passwords in the system. If your database is compromised you will need enough time to at <em>least</em> lock the system down, if not change every password in the database.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Otra raz&oacute;n por la que desea un hash bueno y robusto en las cuentas de un usuario es para darle tiempo suficiente para cambiar todas las contrase&ntilde;as en el sistema. </font><font style="vertical-align: inherit;">Si su base de datos se ve comprometida, necesitar&aacute; tiempo suficiente para al </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">menos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bloquear el sistema, si no cambia cada contrase&ntilde;a en la base de datos.</font></font>
ja: ユーザーアカウントに適切で堅牢なハッシュが必要なもう1つの理由は、システム内のすべてのパスワードを変更するのに十分な時間を与えるためです。 データベースが危険にさらされている場合、データベースのすべてのパスワードを変更しない場合でも、 <em>少なくとも</em>システムをロックダウンするのに十分な時間が必要です。
ko: 사용자 계정에서 강력하고 강력한 해시를 원하는 또 다른 이유는 시스템의 모든 암호를 변경할 수있는 충분한 시간을 제공하기 위해서입니다. 데이터베이스가 손상된 경우 데이터베이스의 모든 비밀번호를 변경하지 않으면 시스템을 잠그는 데 충분한 시간이 필요합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Еще одна причина, по которой вам нужен хороший и надежный хэш для учетных записей пользователей, - это предоставление вам достаточно времени для изменения всех паролей в системе. </font><font style="vertical-align: inherit;">Если ваша база данных взломана, вам понадобится достаточно времени, чтобы хотя </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">бы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заблокировать систему, если не поменять каждый пароль в базе данных.</font></font>
zh_cn: 您想要对用户帐户进行良好而可靠的哈希处理的另一个原因是，给您足够的时间来更改系统中的所有密码。 如果您的数据库遭到破坏，您将需要足够的时间<em>至少</em>锁定系统，如果不更改数据库中的每个密码。

source: As of PHP 5.5, PHP has simple, secure functions for hashing and verifying passwords, <a href="http://php.net/manual/en/function.password-hash.php">password_hash()</a> and <a href="http://php.net/manual/en/function.password-verify.php">password_verify()</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de PHP 5.5, PHP tiene funciones simples y seguras para cifrar y verificar contrase&ntilde;as, </font></font><a href="http://php.net/manual/en/function.password-hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="http://php.net/manual/en/function.password-verify.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_verify ()</font></font></a>
ja: PHP 5.5以降、PHPにはパスワードのハッシュ化と検証のためのシンプルで安全な関数、 <a href="http://php.net/manual/en/function.password-hash.php">password_hash（）</a>と<a href="http://php.net/manual/en/function.password-verify.php">password_verify（）が</a>あります。
ko: PHP 5.5부터 PHP는 암호 해시 및 확인을위한 간단하고 안전한 함수, <a href="http://php.net/manual/en/function.password-hash.php">password_hash ()</a> 및 <a href="http://php.net/manual/en/function.password-verify.php">password_verify ()를 가지고 있습니다.</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с PHP 5.5, PHP имеет простые, безопасные функции для хеширования и проверки паролей, </font></font><a href="http://php.net/manual/en/function.password-hash.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_hash ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://php.net/manual/en/function.password-verify.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">password_verify ()</font></font></a>
zh_cn: 从PHP 5.5开始，PHP具有简单，安全的功能，用于哈希和验证密码， <a href="http://php.net/manual/en/function.password-hash.php">password_hash（）</a>和<a href="http://php.net/manual/en/function.password-verify.php">password_verify（）</a>

source: At the moment these functions accept the PASSWORD_BCRYPT and PASSWORD_DEFAULT password constants, which are synonymous at the moment, the difference being that PASSWORD_DEFAULT "may change in newer PHP releases when newer, stronger hashing algorithms are supported." Using PASSWORD_DEFAULT and password_needs_rehash() on login (and rehashing if necessary) should ensure that your hashes are reasonably resilient to brute-force attacks with little to no work for you.
es: Por el momento estas funciones aceptan las constantes de contraseña PASSWORD_BCRYPT y PASSWORD_DEFAULT,que son sinónimos por el momento,la diferencia es que PASSWORD_DEFAULT "puede cambiar en nuevas versiones de PHP cuando se soportan algoritmos de hashing más nuevos y más fuertes".Usar PASSWORD_DEFAULT y password_needs_rehash()en el inicio de sesión (y el rehashecho si es necesario)debería asegurar que sus hashes son razonablemente resistentes a los ataques de fuerza bruta con poco o ningún trabajo para usted.
ja: 現時点では、これらの関数はパスワード定数 PASSWORD_BCRYPT および PASSWORD_DEFAULT を受け付けており、これらは同義です。ログイン時にPASSWORD_DEFAULTとpassword_needs_rehash()を使用することで(必要に応じて再ハッシュを行うことで)、ハッシュはブルートフォース攻撃に耐えられるようになります。
ko: 현재이 함수는 PASSWORD_BCRYPT 및 PASSWORD_DEFAULT 비밀번호 상수를 허용합니다. 이는 현재 동의어이며, PASSWORD_DEFAULT는 "보다 새롭고 강력한 해싱 알고리즘이 지원 될 때 최신 PHP 릴리스에서 변경 될 수 있습니다." 로그인시 PASSWORD_DEFAULT 및 password_needs_rehash ()를 사용하고 (필요한 경우 리 해싱) 해시가 거의 또는 전혀 작동하지 않는 무차별 대입 공격에 합리적으로 탄력성을 갖도록해야합니다.
ru: На данный момент эти функции принимают константы паролей PASSWORD_BCRYPT и PASSWORD_DEFAULT,которые на данный момент являются синонимами,с той лишь разницей,что PASSWORD_DEFAULT "может меняться в новых релизах PHP,когда поддерживаются более новые,более сильные алгоритмы хэширования".Использование PASSWORD_DEFAULT и password_needs_rehash()при входе в систему (и,при необходимости,перепрошивание)должно гарантировать,что ваши хэши достаточно устойчивы к атакам перебором и малоэффективны.
zh_cn: 目前,这些函数接受 PASSWORD_BCRYPT 和 PASSWORD_DEFAULT 两种密码常数,它们是目前的同义词,不同的是 PASSWORD_DEFAULT "在较新的 PHP 版本中,当支持较新的、更强的散列算法时,PASSWORD_DEFAULT 可能会改变。在登录时使用 PASSWORD_DEFAULT 和 password_needs_rehash()(如果有必要的话,可以重新进行散列)应该可以确保你的散列算法对蛮力攻击有一定的抵抗力,而且几乎不需要你做任何工作。

source: Average practices
es: Prácticas promedio
ja: 平均的な実践
ko: 평균 관행
ru: Средние практики
zh_cn: 平均做法

source: Bcrypt and <a href="http://www.tarsnap.com/scrypt.html">scrypt</a> are the current best practices. <a href="http://www.tarsnap.com/scrypt.html">Scrypt</a> will be better than bcrypt in time, but it hasn't seen adoption as a standard by Linux/Unix or by webservers, and hasn't had in-depth reviews of its algorithm posted yet. But still, the future of the algorithm does look promising. If you are working with Ruby there is an <a href="http://rubygems.org/gems/scrypt">scrypt gem</a> that will help you out, and Node.js now has its own <a href="https://npmjs.org/package/scrypt">scrypt</a> package. You can use Scrypt in PHP either via the <a href="https://pecl.php.net/package/scrypt">Scrypt</a> extension or the <a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md">Libsodium</a> extension (both are available in PECL).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bcrypt y </font></font><a href="http://www.tarsnap.com/scrypt.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son las mejores pr&aacute;cticas actuales. </font></font><a href="http://www.tarsnap.com/scrypt.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&aacute; mejor que bcrypt a tiempo, pero no ha visto la adopci&oacute;n como est&aacute;ndar por Linux / Unix o por servidores web, y a&uacute;n no ha publicado revisiones en profundidad de su algoritmo. Pero a&uacute;n as&iacute;, el futuro del algoritmo parece prometedor. Si est&aacute; trabajando con Ruby, hay una </font></font><a href="http://rubygems.org/gems/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gema de scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que lo ayudar&aacute;, y Node.js ahora tiene su propio </font><font style="vertical-align: inherit;">paquete de </font></font><a href="https://npmjs.org/package/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Puede usar Scrypt en PHP a trav&eacute;s de la </font><font style="vertical-align: inherit;">extensi&oacute;n </font></font><a href="https://pecl.php.net/package/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o la </font><font style="vertical-align: inherit;">extensi&oacute;n </font></font><a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Libsodium</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (ambos est&aacute;n disponibles en PECL).</font></font>
ja: Bcryptと<a href="http://www.tarsnap.com/scrypt.html">scrypt</a>は現在のベストプラクティスです。 <a href="http://www.tarsnap.com/scrypt.html">Scrypt</a>は時間の経過とともにbcryptよりも優れていますが、Linux / UnixやWebサーバーによる標準としての採用は見られておらず、アルゴリズムの詳細なレビューはまだ投稿されていません。 しかし、それでも、アルゴリズムの将来は有望に見えます。 Rubyを使用している場合は、それを支援する<a href="http://rubygems.org/gems/scrypt">scrypt gem</a>があり、Node.jsには独自の<a href="https://npmjs.org/package/scrypt">scrypt</a>パッケージがあります。 PHPでScryptを使用するには、 <a href="https://pecl.php.net/package/scrypt">Scrypt</a>拡張機能または<a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md">Libsodium</a>拡張機能を使用します（どちらもPECLで使用できます）。
ko: Bcrypt와 <a href="http://www.tarsnap.com/scrypt.html">Scrypt</a> 는 현재 모범 사례입니다. <a href="http://www.tarsnap.com/scrypt.html">Scrypt</a> 는 시간에 비해 bcrypt보다 낫지 만 Linux / Unix 또는 웹 서버에서 표준으로 채택하지 않았으며 아직 알고리즘에 대한 심층적 인 검토를하지 않았습니다. 그러나 여전히 알고리즘의 미래는 유망 해 보입니다. Ruby로 작업하는 경우 도움이되는 <a href="http://rubygems.org/gems/scrypt">scrypt gem</a> 이 있으며 Node.js에는 자체 <a href="https://npmjs.org/package/scrypt">scrypt</a> 패키지가 있습니다. <a href="https://pecl.php.net/package/scrypt">Scrypt</a> 확장 또는 <a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md">Libsodium</a> 확장을 통해 PHP에서 Scrypt를 사용할 수 있습니다 (둘 다 PECL에서 사용 가능).
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bcrypt и </font></font><a href="http://www.tarsnap.com/scrypt.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это лучшие практики. </font></font><a href="http://www.tarsnap.com/scrypt.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет лучше, чем bcrypt во времени, но он не видел принятия в качестве стандарта Linux / Unix или веб-серверами и еще не опубликовал подробные обзоры своего алгоритма. Но все же будущее алгоритма выглядит многообещающим. Если вы работаете с Ruby </font><font style="vertical-align: inherit;">, вам поможет </font></font><a href="http://rubygems.org/gems/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt Gem</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и теперь у Node.js есть собственный </font><font style="vertical-align: inherit;">пакет </font></font><a href="https://npmjs.org/package/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Вы можете использовать Scrypt в PHP либо через </font></font><a href="https://pecl.php.net/package/scrypt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Scrypt</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> расширения или </font></font><a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Libsodium</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> расширения (оба доступны в PECL).</font></font>
zh_cn: Bcrypt和<a href="http://www.tarsnap.com/scrypt.html">scrypt</a>是当前的最佳实践。 <a href="http://www.tarsnap.com/scrypt.html">Scrypt</a>在时间上会比bcrypt更好，但是它尚未被Linux / Unix或Web服务器视为采用标准，并且尚未对其算法进行深入审查。 但是，该算法的未来看起来确实很有希望。 如果您使用Ruby，那么有一个<a href="http://rubygems.org/gems/scrypt">scrypt gem</a>可以为您提供帮助，而Node.js现在拥有自己的<a href="https://npmjs.org/package/scrypt">scrypt</a>包。 您可以通过<a href="https://pecl.php.net/package/scrypt">Scrypt</a>扩展或<a href="https://paragonie.com/book/pecl-libsodium/read/07-password-hashing.md">Libsodium</a>扩展（在PECL中都可用）在PHP中使用Scrypt。

source: Best practices
es: Las mejores prácticas
ja: ベストプラクティス
ko: 모범 사례
ru: Передовые методы
zh_cn: 最佳做法

source: But suppose that you cannot use bcrypt or PHPASS at all. What then?
es: Pero supongamos que no puedes usar bcrypt o PHPASS en absoluto.¿Entonces qué?
ja: しかし、仮に bcrypt や PHPASS が全く使えないとします。その場合はどうすればいいのでしょうか?
ko: 그러나 bcrypt 또는 PHPASS를 전혀 사용할 수 없다고 가정하십시오. 그럼 뭐야?
ru: Но предположим,что вы вообще не можете использовать bcrypt или PHPASS.Что тогда?
zh_cn: 但假设你根本无法使用bcrypt或PHPASS。那怎么办?

source: By default it used strongest available encryption that is implemented in Phpass, which is <code>bcrypt</code> and falls back to other encryptions down to MD5 to provide backward compatibility to frameworks like Wordpress.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por defecto, utiliz&oacute; el cifrado m&aacute;s fuerte disponible que se implementa en Phpass, que es </font></font> <code>bcrypt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font><font style="vertical-align: inherit;">recurre </font><font style="vertical-align: inherit;">a otros cifrados hasta MD5 para proporcionar compatibilidad con versiones anteriores de marcos como Wordpress.</font></font>
ja: デフォルトでは、Phpassに実装されている使用可能な最も強力な暗号化を使用しました。これは <code>bcrypt</code> であり、他の暗号化からMD5にフォールバックして、Wordpressなどのフレームワークに下位互換性を提供します。
ko: 기본적으로 Phpass에서 구현 된 가장 강력한 암호화를 사용했습니다.이 암호는 <code>bcrypt</code> 이며 다른 암호화로 MD5로 대체 되어 Wordpress와 같은 프레임 워크와의 호환성을 제공합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">По умолчанию он использовал самое надежное из доступных шифрований, которое реализовано в Phpass, который является </font></font> <code>bcrypt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и использует другие шифрования вплоть до MD5, чтобы обеспечить обратную совместимость с фреймворками, такими как Wordpress.</font></font>
zh_cn: 默认情况下，它使用Phpass中实现的最强大的可用加密，该加密是 <code>bcrypt</code> 并回退到MD5的其他加密，以向与Wordpress等框架兼容。

source: Coming in PHP 5.5 is a <a href="http://php.net/manual/en/ref.password.php">full password protection library</a> that abstracts away any pains of working with bcrypt. While most of us are stuck with PHP 5.2 and 5.3 in most common environments, especially shared hosts, @ircmaxell has built a <a href="https://github.com/ircmaxell/password_compat">compatibility layer</a> for the coming API that is backward compatible to PHP 5.3.7.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pr&oacute;ximamente en PHP 5.5 hay una </font></font><a href="http://php.net/manual/en/ref.password.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">biblioteca de protecci&oacute;n de contrase&ntilde;a completa</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que abstrae cualquier molestia de trabajar con bcrypt. </font><font style="vertical-align: inherit;">Si bien la mayor&iacute;a de nosotros estamos atrapados con PHP 5.2 y 5.3 en los entornos m&aacute;s comunes, especialmente los hosts compartidos, @ircmaxell ha creado una </font></font><a href="https://github.com/ircmaxell/password_compat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">capa de compatibilidad</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la pr&oacute;xima API que es compatible con PHP 5.3.7.</font></font>
ja: PHP 5.5で登場するのは、bcryptでの作業の苦痛を取り除く<a href="http://php.net/manual/en/ref.password.php">完全なパスワード保護ライブラリ</a>です。 私たちのほとんどは、ほとんどの一般的な環境、特に共有ホストでPHP 5.2と5.3を使い続けていますが、@ ircmaxellは、PHP 5.3.7と下位互換性のあるAPIの<a href="https://github.com/ircmaxell/password_compat">互換性レイヤー</a>を構築しています。
ko: PHP 5.5는 <a href="http://php.net/manual/en/ref.password.php">완전한 암호 보호 라이브러리</a> 로, bcrypt 작업의 어려움을 없애줍니다. @ircmaxell은 대부분의 일반적인 환경, 특히 공유 호스트에서 PHP 5.2 및 5.3을 사용하고 있지만 @ircmaxell은 PHP 5.3.7과 호환되는 향후 API에 대한 <a href="https://github.com/ircmaxell/password_compat">호환성 계층</a> 을 구축했습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В PHP 5.5 появилась </font></font><a href="http://php.net/manual/en/ref.password.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">библиотека</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font><font style="vertical-align: inherit;">полной защитой паролем,</font><font style="vertical-align: inherit;"> которая избавляет от любых трудностей при работе с bcrypt. </font><font style="vertical-align: inherit;">Хотя большинство из нас придерживаются PHP 5.2 и 5.3 в большинстве распространенных сред, особенно на общих хостах, @ircmaxell создал </font></font><a href="https://github.com/ircmaxell/password_compat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">уровень совместимости</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для предстоящего API, который обратно совместим с PHP 5.3.7.</font></font>
zh_cn: PHP 5.5中引入了一个<a href="http://php.net/manual/en/ref.password.php">完整的密码保护库</a> ，该库抽象了使用bcrypt的所有麻烦。 虽然我们大多数人在最常见的环境（尤其是共享主机）中都坚持使用PHP 5.2和5.3，但是@ircmaxell为即将到来的API构建了一个<a href="https://github.com/ircmaxell/password_compat">兼容层</a> ，该层向后兼容PHP 5.3.7。

source: Cryptography Recap &amp; Disclaimer
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Resumen de criptograf&iacute;a y descargo de responsabilidad</font></font>
ja: 暗号の要約と免責事項
ko: 암호화 요약 및 면책
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Криптография Резюме и отказ от ответственности</font></font>
zh_cn: 密码学回顾与免责声明

source: Don't limit the length of a password. If your users want a sentence with supercalifragilisticexpialidocious in it, don't prevent them from using it.
es: No limite la longitud de una contraseña.Si sus usuarios quieren una frase con supercalifragilisticexpialidocious en ella,no les impida usarla.
ja: パスワードの長さを制限しないでください。あなたのユーザーがsupercalifragilagilisticexpialidociousを含む文章を欲しがっているなら、それを使用することを妨げないようにしましょう。
ko: 비밀번호 길이를 제한하지 마십시오. 사용자가 supercalifragilisticexpialidocious가 포함 된 문장을 원한다면 사용하지 마십시오.
ru: Не ограничивайте длину пароля.Если ваши пользователи хотят,чтобы в предложении было суперкалифрагилисционистское предложение,не мешайте им его использовать.
zh_cn: 不要限制密码的长度。如果你的用户想让你的用户在里面有一句话是超级califragilisticexpialidocious,不要阻止他们使用。

source: Don't limit what characters users can enter for passwords. Only idiots do this.
es: No limite los caracteres que los usuarios pueden introducir para las contraseñas.Sólo los idiotas hacen esto.
ja: パスワードにユーザーが入力できる文字数を制限しないでください。こんなことをするのはバカだけ。
ko: 사용자가 비밀번호로 입력 할 수있는 문자를 제한하지 마십시오. 바보 만이 일을합니다.
ru: Не ограничивайте,какие символы пользователи могут вводить для паролей.Это делают только идиоты.
zh_cn: 不要限制用户可以输入的密码字符。只有白痴才会这样做。
