Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This question, <a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once">Is &ldquo;double hashing&rdquo; a password less secure than just hashing it once?</a> suggests that hashing multiple times may be a good idea, whereas <a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904">How to implement password protection for individual files?</a> suggests using salt.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta pregunta, </font></font><a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;es "doble hashing" una contrase&ntilde;a menos segura que simplemente hacerlo una vez? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sugiere que el hashing varias veces puede ser una buena idea, mientras que </font></font><a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo implementar la protecci&oacute;n con contrase&ntilde;a para archivos individuales? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sugiere usar sal.</font></font>
ja: この質問は、 <a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once">「ダブルハッシュ」は1回だけハッシュするよりも安全性が低いですか。</a> 複数のハッシュを作成することは良い考えかもしれないが、 <a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904">個々のファイルにパスワード保護を実装する方法は？</a> 塩の使用を提案しています。
ko: 이 질문 <a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once">은 "이중 해싱"이 비밀번호를 한 번 해시하는 것보다 덜 안전합니까?</a> <a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904">개별 파일에 대한 암호 보호를 구현</a> 하는 방법 은 있지만 여러 번 해싱하는 것이 좋습니다 . 소금 사용을 제안합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот вопрос, </font></font><a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является ли &laquo;двойное хеширование&raquo; паролем менее безопасным, чем однократное хеширование? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предполагает, что хэширование несколько раз может быть хорошей идеей, тогда как </font></font><a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">как реализовать защиту паролем для отдельных файлов? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предлагает использовать соль.</font></font>
zh_cn: 这个问题， <a href="https://stackoverflow.com/questions/348109/is-double-hashing-a-password-less-secure-than-just-hashing-it-once">&ldquo;双哈希&rdquo;密码是否比仅哈希一次密码安全？</a> 建议多次散列可能是一个好主意，而<a href="https://stackoverflow.com/questions/55862/how-to-implement-password-protection-for-individual-files#55904">如何对单个文件实施密码保护？</a> 建议使用盐。

source: Though the question has been answered, I just want to reiterate that salts used for hashing should be random and not like email address as suggested in first answer.
es: Aunque la pregunta ya ha sido respondida,sólo quiero reiterar que las sales utilizadas para el hashing deben ser aleatorias y no como la dirección de correo electrónico como se sugiere en la primera respuesta.
ja: 質問には答えられていますが、ハッシュ化に使われる塩はランダムで、最初の回答で示唆されたようなメールアドレスのようなものではないことを再確認しておきたいと思います。
ko: 질문에 대한 답변이 있지만 해싱에 사용되는 솔트는 무작위이며 첫 번째 답변에서 제안한 이메일 주소와 같지 않아야한다는 점을 반복하고 싶습니다.
ru: Хотя на вопрос был дан ответ,я просто хочу повторить,что соли,используемые для хеширования,должны быть случайными и не похожими на электронный адрес,как было предложено в первом ответе.
zh_cn: 虽然这个问题已经回答了,但我只想重申一下,用于散列的盐分应该是随机的,而不是像第一个答案中建议的电子邮件地址那样。

source: To verify password, one can use:
es: Para verificar la contraseña,se puede usar:
ja: パスワードを確認するには、次のようにします。
ko: 비밀번호를 확인하기 위해 다음을 사용할 수 있습니다.
ru: Для проверки пароля можно использовать:
zh_cn: 要验证密码,可以使用以下方法。

source: Try an implementation of <a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard">PDKBF2</a> with the <a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256">maximum number of rounds</a> that your environment/application/user-perception can tolerate. The lowest number I'd recommend is 2500 rounds. Also, make sure to use <a href="http://php.net/hash_hmac">hash_hmac()</a> if it is available to make the operation harder to reproduce.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pruebe una implementaci&oacute;n de </font></font><a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PDKBF2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con el </font></font><a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n&uacute;mero m&aacute;ximo de rondas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que su entorno / aplicaci&oacute;n / percepci&oacute;n del usuario puede tolerar. </font><font style="vertical-align: inherit;">El n&uacute;mero m&aacute;s bajo que recomendar&iacute;a es de 2500 rondas. </font><font style="vertical-align: inherit;">Adem&aacute;s, aseg&uacute;rese de usar </font></font><a href="http://php.net/hash_hmac"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">hash_hmac ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si est&aacute; disponible para hacer que la operaci&oacute;n sea m&aacute;s dif&iacute;cil de reproducir.</font></font>
ja: 環境/アプリケーション/ユーザーの知覚が許容できる<a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256">最大ラウンド数</a>で<a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard">PDKBF2</a>の実装を試してください。 私がお勧めする最低数は2500ラウンドです。 また、操作の再現が困難な場合は、 <a href="http://php.net/hash_hmac">hash_hmac（）</a>を使用してください 。
ko: 환경 / 응용 프로그램 / 사용자 인식이 허용 할 수있는 <a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256">최대 라운드 수로</a> <a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard">PDKBF2</a> 를 구현해보십시오. 내가 추천하는 가장 낮은 숫자는 2500 라운드입니다. 또한 조작을 재현하기 어렵게 만들 수있는 경우 <a href="http://php.net/hash_hmac">hash_hmac ()</a> 를 사용해야합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попробуйте реализовать </font></font><a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PDKBF2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font><a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">максимальным количеством раундов,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которое может выдержать ваша среда / приложение / восприятие пользователя. </font><font style="vertical-align: inherit;">Наименьшее число, которое я бы порекомендовал - 2500 раундов. </font><font style="vertical-align: inherit;">Кроме того, обязательно используйте </font></font><a href="http://php.net/hash_hmac"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">hash_hmac (),</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если он доступен, чтобы сделать операцию труднее воспроизвести.</font></font>
zh_cn: 尝试以您的环境/应用程序/用户感知可以容忍的<a href="https://security.stackexchange.com/questions/3959/recommended-of-iterations-when-using-pkbdf2-sha256">最大回合数来</a>实现<a href="http://www.itnewb.com/tutorial/Encrypting-Passwords-with-PHP-for-Storage-Using-the-RSA-PBKDF2-Standard">PDKBF2</a> 。 我建议的最低数量是2500发。 另外，请确保使用<a href="http://php.net/hash_hmac">hash_hmac（）（</a>如果可用）以使操作难以重现。

source: Use PBKDF2 if you cannot use either bcrypt or scrypt, with SHA2 hashes.
es: Usa PBKDF2 si no puedes usar ni bcrypt ni scrypt,con hashes SHA2.
ja: SHA2 ハッシュで bcrypt と scrypt のどちらも使用できない場合は PBKDF2 を使用します。
ko: SHA2 해시와 함께 bcrypt 또는 scrypt를 사용할 수없는 경우 PBKDF2를 사용하십시오.
ru: Используйте PBKDF2,если вы не можете использовать ни bcrypt,ни scrypt,с SHA2 хэшами.
zh_cn: 如果你不能使用bcrypt或scrypt,使用PBKDF2,使用SHA2散列的方式。

source: Use scrypt when you can; bcrypt if you cannot.
es: Use scrypt cuando pueda;bcrypt si no puede.
ja: できれば scrypt を使い、できなければ bcrypt を使います。
ko: 가능하면 scrypt를 사용하십시오. 당신이 할 수 없다면 bcrypt.
ru: Используйте шифрование,когда можете;шифрование,если не можете.
zh_cn: 能用scrypt的时候就用scrypt,不能用的时候就用bcrypt。

source: What makes a <em>good</em> password anyway?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Qu&eacute; hace una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buena</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contrase&ntilde;a de todos modos?</font></font>
ja: とにかく<em>良い</em>パスワードを作るものは何ですか？
ko: 어쨌든 <em>좋은</em> 암호는 무엇입니까?
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Что делает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">хороший</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пароль в любом случае?</font></font>
zh_cn: 无论如何，什么才是<em>好的</em>密码？

source: What's the difference between SHA and MD5 in PHP
es: ¿Cuál es la diferencia entre SHA y MD5 en PHP
ja: PHPにおけるSHAとMD5の違いは?
ko: PHP에서 SHA와 MD5의 차이점은 무엇입니까
ru: В чем разница между SHA и MD5 в PHP.
zh_cn: PHP中的SHA和MD5有什么区别?

source: When <code>password_hash()</code> is used, it generates a random salt and includes it in the outputted hash (along with the the cost and algorithm used.) <code>password_verify()</code> then reads that hash and determines the salt and encryption method used, and verifies it against the provided plaintext password.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando </font><font style="vertical-align: inherit;">se utiliza </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , genera una sal aleatoria y la incluye en el hash de salida (junto con el costo y el algoritmo utilizado). </font></font> <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lee ese hash y determina el m&eacute;todo de sal y cifrado utilizado, y lo verifica contra la contrase&ntilde;a de texto sin formato proporcionada.</font></font>
ja: <code>password_hash()</code> が使用されると、ランダムなソルトが生成され、出力されたハッシュに（使用されるコストとアルゴリズムとともに）含まれ <code>password_verify()</code> 、そのハッシュを読み取り、使用されるソルトと暗号化方式を決定し、それを照合します。提供された平文パスワード。
ko: <code>password_hash()</code> 를 사용하면 임의의 솔트를 생성하고이를 사용 된 비용 및 알고리즘과 함께 출력 된 해시에 포함합니다. <code>password_verify()</code> 는 해당 해시를 읽고 사용 된 솔트 및 암호화 방법을 결정하여이를 검증합니다. 제공된 일반 텍스트 비밀번호
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда </font></font> <code>password_hash()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется, он генерирует случайную соль и включает его в выводимый хэш (наряду с ценой и используемого алгоритма.) </font></font> <code>password_verify()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем считывает , </font><font style="vertical-align: inherit;">что хэш и определяет способ соли и шифрования , </font><font style="vertical-align: inherit;">используемый, и проверяет его против предоставленный незашифрованный пароль.</font></font>
zh_cn: 使用 <code>password_hash()</code> 时 ，它将生成一个随机盐，并将其包含在输出的哈希中（连同使用的成本和算法。） <code>password_verify()</code> 然后读取该哈希，并确定所使用的盐和加密方法，并针对它进行验证提供的纯文本密码。

source: When hashing speed is the key, the slower the more resistant to Brute Force attacks.
es: Cuando la clave está en la velocidad,cuanto más lenta,más resistente a los ataques de la Fuerza Bruta.
ja: ハッシュスピードが重要な場合は、遅い方がブルートフォース攻撃に強くなります。
ko: 해싱 속도가 핵심 일 때는 Brute Force 공격에 대한 내성이 느릴수록 느려집니다.
ru: Когда ключевым моментом является скорость хеширования,чем медленнее,тем более устойчивы к атакам с применением грубой силы.
zh_cn: 当哈希速度是关键,越慢越能抵抗蛮力攻击。

source: When you create a salt make sure it is unique to the password it is salting, then store both the completed hash and salt in your DB. What this will do is make it so that an attacker will have to individually crack each salt and hash before they can gain access. This means a lot more work and time for the attacker.
es: Cuando crees una sal,asegúrate de que es única para la contraseña que está salando,luego guarda tanto el hash completo como la sal en tu base de datos.Lo que esto hará es que un atacante tendrá que romper individualmente cada sal y hachís antes de poder acceder.Esto significa mucho más trabajo y tiempo para el atacante.
ja: ソルトを作成する際には、ソルトを作成するパスワードに固有のものであることを確認し、完成したハッシュとソルトの両方をDBに保存してください。これは、攻撃者がアクセスする前に、それぞれのソルトとハッシュを個別にクラックしなければならないことを意味します。これは、攻撃者にとってより多くの作業と時間を意味します。
ko: 솔트를 생성 할 때 솔트가 암호에 고유한지 확인한 다음 완성 된 해시와 솔트를 DB에 저장하십시오. 이것이하는 일은 공격자가 접근하기 전에 각각의 소금과 해시를 개별적으로 해독해야하는 것입니다. 이는 공격자에게 더 많은 작업과 시간을 의미합니다.
ru: Когда вы создаете соль,убедитесь,что она уникальна для пароля,который она посолила,затем сохраните и готовый хэш,и соль в вашей БД.Это позволит злоумышленнику взломать каждый соль и хэш по отдельности,прежде чем получить доступ к нему.Это означает гораздо больше работы и времени для атакующего.
zh_cn: 当你创建一个盐时,确保它是唯一的盐,然后将完成的散列和盐都存储在你的数据库中。这样做会使攻击者必须单独破解每个盐和散列,然后才能获得访问权限。这意味着攻击者需要花费更多的工作和时间。

source: Why hash passwords anyway?
es: ¿Por qué tienes contraseñas de todos modos?
ja: なぜパスワードをハッシュ化するの?
ko: 어쨌든 암호를 해시해야하는 이유는 무엇입니까?
ru: Зачем вообще хэш-пароли?
zh_cn: 为什么要用散列密码呢?

source: You cannot possibly foresee all threats or avenues of attack, and so you must make your best effort to protect your users <strong>up front</strong>. If you do not, then you might even miss the fact that you were attacked until it's too late... <em>and you're liable</em>. To avoid that situation, act paranoid to begin with. Attack your own software (internally) and attempt to steal user credentials, or modify other user's accounts or access their data. If you don't test the security of your system, then you cannot blame anyone but yourself.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No es posible prever todas las amenazas o v&iacute;as de ataque, por lo que debe hacer su mejor esfuerzo para proteger a sus usuarios </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">por adelantado</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si no lo hace, incluso podr&iacute;a perderse el hecho de que fue atacado hasta que sea demasiado tarde ... </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y usted es responsable</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Para evitar esa situaci&oacute;n, act&uacute;a paranoico para empezar. </font><font style="vertical-align: inherit;">Ataque su propio software (internamente) e intente robar credenciales de usuario, o modificar las cuentas de otros usuarios o acceder a sus datos. </font><font style="vertical-align: inherit;">Si no prueba la seguridad de su sistema, no puede culpar a nadie m&aacute;s que a usted mismo.</font></font>
ja: すべての脅威や攻撃の経路を予測することはできないため、ユーザーを事前に保護するために最善を尽くす必要があります。 そうしないと、手遅れになるまで攻撃されたという事実を見逃す可能性が<em>あります</em> ... <em>そしてあなたは責任を負い</em>ます。 そのような状況を回避するには、まずは偏執狂的に行動します。 自分のソフトウェアを（内部で）攻撃し、ユーザーの資格情報を盗んだり、他のユーザーのアカウントを変更したり、データにアクセスしたりします。 システムのセキュリティをテストしない場合は、自分以外の誰のせいにもできません。
ko: 모든 위협이나 공격의 경로를 예견 할 수는 없으므로 사용자를 먼저 보호해야합니다. 그렇지 않으면 너무 늦을 때까지 공격을 받았다는 사실을 놓칠 수도 있습니다. 그러한 상황을 피하려면 먼저 편집증을 행동하십시오. 자신의 소프트웨어를 내부적으로 공격하고 사용자 자격 증명을 도용하거나 다른 사용자의 계정을 수정하거나 데이터에 액세스하십시오. 시스템의 보안을 테스트하지 않으면 자신 외에 다른 사람을 비난 할 수 없습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы не можете , </font><font style="vertical-align: inherit;">возможно , </font><font style="vertical-align: inherit;">предвидеть все угрозы и пути атак, и поэтому вы должны сделать ваши лучшие усилия , </font><font style="vertical-align: inherit;">чтобы защитить пользователей </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">фронт</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если вы этого не сделаете, то вы можете даже упустить тот факт, что на вас напали, пока не стало слишком поздно ... </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и вы несете ответственность</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Чтобы избежать этой ситуации, начните действовать параноиком. </font><font style="vertical-align: inherit;">Атакуйте свое собственное программное обеспечение (внутренне) и пытайтесь украсть учетные данные пользователя или изменить учетные записи других пользователей или получить доступ к их данным. </font><font style="vertical-align: inherit;">Если вы не проверяете безопасность своей системы, вы не можете винить никого, кроме себя.</font></font>
zh_cn: 您可能无法预见所有威胁或攻击途径，因此必须尽最大努力来保护用户。 如果您不这样做，那么您甚至可能会错过被攻击的事实，直到为时已晚... <em>您</em>才有<em>责任</em> 。 为了避免这种情况，首先要采取偏执的态度。 （内部）攻击您自己的软件，并尝试窃取用户凭据，或修改其他用户的帐户或访问其数据。 如果您不测试系统的安全性，那么您就不能怪任何人。

source: You should definitely use a salt. I'd recommend using random bytes (and not restrict yourself to characters and numbers). As usually, the longer you choose, the safer, slower it gets. 64 bytes ought to be fine, i guess.
es: Definitivamente deberías usar una sal.Recomendaría usar bytes aleatorios (y no restringirse a caracteres y números).Como siempre,cuanto más tiempo elijas,más seguro y lento será.64 bytes deberían estar bien,supongo.
ja: 絶対にソルトを使った方がいい ランダムバイト(文字や数字に限定しない)を使うのがいいと思います。いつものように、長ければ長いほど安全で遅くなります。64バイトでいいんじゃないかな。
ko: 반드시 소금을 사용해야합니다. 임의의 바이트를 사용하는 것이 좋습니다 (문자와 숫자로 제한하지 마십시오). 일반적으로 더 오래 선택할수록 더 안전하고 느려집니다. 64 바이트는 괜찮을 것 같습니다.
ru: Тебе определенно стоит использовать соль.Я бы рекомендовал использовать случайные байты (и не ограничивать себя символами и цифрами).Как обычно,чем дольше вы выбираете,тем безопаснее,медленнее.64 байта должны быть в порядке,я думаю.
zh_cn: 你一定要用盐。我建议用随机字节(不要限制在字符和数字上)。因为通常情况下,你选择的时间越长,越安全,速度越慢。我想64字节应该没问题吧。

source: You tell your users to make good passwords to avoid getting hacked, do the same. What is the point in going through all the effort of locking your front door when you have the backdoor wide open.
es: Dile a tus usuarios que hagan buenas contraseñas para evitar ser hackeados,haz lo mismo.¿Qué sentido tiene hacer el esfuerzo de cerrar la puerta principal cuando tienes la puerta trasera abierta de par en par?
ja: ハッキングされないように良いパスワードを作るようにユーザーに言っていますが、同じようにしましょう。バックドアが大きく開いているときに、玄関のドアをロックするためのすべての努力を経ることに何の意味がありますか?
ko: 해킹 당하지 않도록 사용자에게 올바른 비밀번호를 만들도록 지시하십시오. 백도어를 넓게 열었을 때 현관 문을 잠그는 모든 노력을 기울이는 요점은 무엇입니까?
ru: Вы говорите пользователям делать хорошие пароли,чтобы избежать взлома,делайте то же самое.Какой смысл проходить через все усилия по блокировке входной двери,когда задняя дверь широко открыта.
zh_cn: 你告诉你的用户要做好密码,避免被黑客入侵,同样的道理。当你的后门大开的时候,你又何必费尽心思的把前门锁起来。

source: also we need the hash I`m using sha512 it is the best and it is in php
es: También necesitamos el hachís.Estoy usando sha512,es el mejor y está en php.
ja: また、我々はハッシュを必要としています私は最高のsha512を使用して、それはphpにある
ko: 또한 우리는 sha512를 사용하는 해시가 필요합니다. 최고이며 PHP입니다.
ru: Также нам нужен хэш,который я использую sha512,он лучший и он на php.
zh_cn: 我们还需要哈希值,我用的是sha512,它是最好的,而且是在php中。

source: and for authorize we will use same steps...
es: y para autorizarlo usaremos los mismos pasos...
ja: 認証には同じ手順を使用します...
ko: 승인을 위해 동일한 단계를 사용합니다 ...
ru: и для разрешения мы будем использовать те же меры...
zh_cn: 而对于授权,我们将使用同样的步骤......

source: it is the best way to safe our clients passwords...
es: ...es la mejor manera de asegurar las contraseñas de nuestros clientes...
ja: それは私たちのクライアントのパスワードを安全にするための最良の方法です...
ko: 고객 비밀번호를 보호하는 가장 좋은 방법입니다 ...
ru: это лучший способ сохранить пароли наших клиентов...
zh_cn: 这是保护客户密码安全的最好方法......

source: now we need to save in database our $hash_psw variable value and $salt variable
es: ahora necesitamos guardar en la base de datos nuestro valor de la variable $hash_psw y la variable $salt
ja: 今、私たちは$hash_psw変数の値と$salt変数をデータベースに保存する必要があります。
ko: 이제 $ hash_psw 변수 값과 $ salt 변수를 데이터베이스에 저장해야합니다
ru: теперь нам нужно сохранить в базе данных значение переменной $hash_psw и переменной $salt.
zh_cn: 现在我们需要将$hash_psw变量的值和$salt变量保存到数据库中。

source: ok in the fitsy we need salt salt must be unique so let generate it
es: ok en el fitsy necesitamos la sal debe ser única así que dejemos que se genere
ja: 仝それにしても、このようなことになってしまったのですね......
ko: 맞습니다. 소금 소금이 필요합니다. 소금 소금은 독특해야합니다.
ru: Хорошо,если нам нужна соль,она должна быть уникальной,так что пусть она генерируется.
zh_cn: 好吧,在配合的时候,我们需要盐,盐必须是唯一的,所以让我们产生它

source: so now we can use this functions to generate safe password
es: así que ahora podemos usar estas funciones para generar una contraseña segura
ja: これで、安全なパスワードを生成するためにこの関数を使うことができるようになりました。
ko: 이제이 기능을 사용하여 안전한 비밀번호를 생성 할 수 있습니다.
ru: так что теперь мы можем использовать эти функции для генерации безопасного пароля.
zh_cn: 所以现在我们可以用这个函数来生成安全密码了
