Repository: rueisnom/feedback
Catalog: xlf/40/16/56/401656.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I just want to point out that PHP 5.5 includes a <a href="http://www.php.net/manual/en/ref.password.php">password hashing API</a> that provides a wrapper around <code>crypt()</code>. This API significantly simplifies the task of hashing, verifying and rehashing password hashes. The author has also released a <a href="https://github.com/ircmaxell/password_compat">compatibility pack</a> (in the form of a single password.php file that you simply <code>require</code> to use), for those using PHP 5.3.7 and later and want to use this right now.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Solo quiero se&ntilde;alar que PHP 5.5 incluye una </font></font><a href="http://www.php.net/manual/en/ref.password.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">API de hash de contrase&ntilde;a</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que proporciona un contenedor alrededor de </font></font> <code>crypt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esta API simplifica significativamente la tarea de hash, verificaci&oacute;n y rehash hashes de contrase&ntilde;as. </font><font style="vertical-align: inherit;">El autor tambi&eacute;n ha lanzado un </font></font><a href="https://github.com/ircmaxell/password_compat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">paquete de compatibilidad</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (en forma de un &uacute;nico archivo password.php que simplemente </font></font> <code>require</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usar), para aquellos que usan PHP 5.3.7 y versiones posteriores y desean usarlo ahora mismo.</font></font>
ja: PHP 5.5には、 <code>crypt()</code> のラッパーを提供する<a href="http://www.php.net/manual/en/ref.password.php">パスワードハッシュAPI</a>が含まれていることを指摘しておきます 。 このAPIは、パスワードハッシュのハッシュ、検証、および再ハッシュのタスクを大幅に簡略化します。 また、PHP 5.3.7以降を使用していて、今すぐ使用したいユーザー向けに、 <a href="https://github.com/ircmaxell/password_compat">互換パック</a> （単一のpassword.phpファイルの形式で使用するだけ）もリリースしました。
ko: PHP 5.5에 <code>crypt()</code> 주위에 래퍼를 제공하는 <a href="http://www.php.net/manual/en/ref.password.php">암호 해싱 API</a> 가 포함되어 있음을 지적하고 싶습니다. 이 API는 암호 해시 해시, 확인 및 재해시 작업을 크게 단순화합니다. 필자는 PHP 5.3.7 이상을 사용하는 사용자를 <code>require</code> <a href="https://github.com/ircmaxell/password_compat">호환성 팩</a> (단일 사용하기 만하면되는 단일 password.php 파일의 형태)을 출시했으며 지금이 기능을 사용하려고합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я просто хочу отметить, что PHP 5.5 включает </font></font><a href="http://www.php.net/manual/en/ref.password.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">API хеширования паролей,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который предоставляет обертку для </font></font> <code>crypt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Этот API-интерфейс значительно упрощает задачу хеширования, проверки и перефразирования хэшей паролей. </font><font style="vertical-align: inherit;">Автор также выпустил </font></font><a href="https://github.com/ircmaxell/password_compat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">пакет совместимости</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (в виде одного файла password.php, который вам просто </font></font> <code>require</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) для тех, кто использует PHP 5.3.7 и более поздние версии и хочет использовать его прямо сейчас.</font></font>
zh_cn: 我只想指出，PHP 5.5包含一个<a href="http://www.php.net/manual/en/ref.password.php">密码哈希API</a> ，该API为 <code>crypt()</code> 提供了包装器。 该API大大简化了哈希，验证和重新哈希密码哈希的任务。 作者还发布了一个<a href="https://github.com/ircmaxell/password_compat">兼容包</a> （以您只 <code>require</code> 使用的单个password.php文件的形式），适用于使用PHP 5.3.7及更高版本并希望立即使用此功能的用户。

source: I usually use SHA1 and salt with the user ID (or some other user-specific piece of information), and sometimes I additionally use a constant salt (so I have 2 parts to the salt).
es: Normalmente utilizo SHA1 y sal con la identificación del usuario (o algún otro dato específico del usuario),y a veces utilizo adicionalmente una sal constante (por lo que tengo 2 partes de la sal).
ja: 私は通常、SHA1とソルトをユーザーID(または他のユーザー固有の情報)と一緒に使用しています。
ko: 나는 보통 사용자 ID (또는 다른 사용자 특정 정보)와 함께 SHA1과 소금을 사용하고 때로는 일정한 소금을 사용합니다 (따라서 소금에 2 부분이 있습니다).
ru: Обычно я использую SHA1 и соль с идентификатором пользователя (или какую-либо другую специфическую для пользователя информацию),а иногда я дополнительно использую постоянную соль (поэтому у меня есть 2 части к соли).
zh_cn: 我通常使用SHA1和盐与用户ID(或其他一些特定于用户的信息),有时我还会额外使用一个恒定的盐(所以我有2个部分的盐)。

source: I would not store the password hashed in two different ways, because then the system is at least as weak as the weakest of the hash algorithms in use.
es: No almacenaría el hash de la contraseña de dos maneras diferentes,porque entonces el sistema es al menos tan débil como el más débil de los algoritmos de hash en uso.
ja: 私はハッシュ化されたパスワードを2つの異なる方法で保存することはありません。なぜならば、システムは少なくとも使用中のハッシュアルゴリズムの中で最も弱いものと同じくらい弱いからです。
ko: 암호 해시를 두 가지 방법으로 저장하지 않을 것입니다. 시스템이 사용중인 해시 알고리즘 중 가장 약한 것보다 약하기 때문입니다.
ru: Я бы не стал хранить хэшированный пароль двумя разными способами,потому что тогда система как минимум так же слаба,как и самые слабые из используемых хэш-алгоритмов.
zh_cn: 我不会用两种不同的方式来存储密码的哈希算法,因为这样的话,系统至少和目前使用的哈希算法一样弱。

source: I'm using <a href="http://www.openwall.com/phpass/">Phpass</a> which is a simple one-file PHP class that could be implemented very easily in nearly every PHP project. See also <a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4">The H</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Estoy usando </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Phpass,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que es una clase PHP simple de un archivo que podr&iacute;a implementarse muy f&aacute;cilmente en casi todos los proyectos PHP. </font><font style="vertical-align: inherit;">Ver tambi&eacute;n </font></font><a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El H</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: 私は<a href="http://www.openwall.com/phpass/">Phpass</a>を使用しています。これは、ほぼすべてのPHPプロジェクトで非常に簡単に実装できる単純な1ファイルのPHPクラスです。 <a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4">H</a>も参照してください。
ko: 필자는 거의 모든 PHP 프로젝트에서 매우 쉽게 구현할 수있는 간단한 단일 파일 PHP 클래스 인 <a href="http://www.openwall.com/phpass/">Phpass</a> 를 사용하고 있습니다. <a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4">H</a> 참조.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использую </font></font><a href="http://www.openwall.com/phpass/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Phpass</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - простой </font><font style="vertical-align: inherit;">однофайловый</font><font style="vertical-align: inherit;"> PHP-класс, который можно очень легко реализовать практически в каждом PHP-проекте. </font><font style="vertical-align: inherit;">Смотрите также </font></font><a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Н</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 我正在使用<a href="http://www.openwall.com/phpass/">Phpass</a> ，这是一个简单的单文件PHP类，几乎可以在每个PHP项目中轻松实现。 另请参见<a href="http://www.h-online.com/security/features/Storing-passwords-in-uncrackable-form-1255576.html?page=4">H。</a>

source: I'm using PHP. I want a safe and fast password encryption system. Hashing a password a million times may be safer, but also slower. How to achieve a good balance between speed and safety? Also, I'd prefer the result to have a constant number of characters.
es: Estoy usando PHP.Quiero un sistema de cifrado de contraseñas seguro y rápido.Tener una contraseña un millón de veces puede ser más seguro,pero también más lento.¿Cómo lograr un buen equilibrio entre velocidad y seguridad? Además,prefiero que el resultado tenga un número constante de caracteres.
ja: PHPを使っている。安全で高速なパスワード暗号化システムが欲しい。パスワードを100万回ハッシュした方が安全かもしれませんが、速度も遅くなります。速度と安全性を両立させるにはどうすればいいのでしょうか?また、結果の文字数が一定の方がいいですね。
ko: PHP를 사용하고 있습니다. 안전하고 빠른 비밀번호 암호화 시스템을 원합니다. 암호를 백만 번 해싱하는 것이 더 안전하지만 느려질 수 있습니다. 속도와 안전의 균형을 잘 유지하는 방법은 무엇입니까? 또한 결과가 일정한 수의 문자를 갖는 것을 선호합니다.
ru: Я использую PHP.Я хочу безопасную и быструю систему шифрования паролей.Хранение пароля миллион раз может быть безопаснее,но и медленнее.Как достичь хорошего баланса между скоростью и безопасностью? Также,я бы предпочел,чтобы результат был с постоянным количеством символов.
zh_cn: 我使用的是PHP。我想要一个安全、快速的密码加密系统。对密码进行无数次的哈希特化可能更安全,但也比较慢。如何在速度和安全之间取得一个很好的平衡?另外,我希望结果是字符数不变。

source: Ideally you want your DB and APPLICATION on separate servers. This is not always possible due to cost, but it does allow for some safety as the attacker will have to go through two steps to fully access the system.
es: Lo ideal sería que su BD y su APLICACIÓN estuvieran en servidores separados.Esto no siempre es posible debido al costo,pero permite cierta seguridad ya que el atacante tendrá que pasar por dos pasos para acceder completamente al sistema.
ja: 理想的には、別のサーバ上のDBとアプリケーションが欲しいです。これはコストのために常に可能というわけではありませんが、攻撃者がシステムに完全にアクセスするために2つのステップを経なければならないので、ある程度の安全性は確保されています。
ko: DB와 APPLICATION을 별도의 서버에 두는 것이 이상적입니다. 비용 때문에 항상 가능한 것은 아니지만 공격자가 시스템에 완전히 액세스하려면 두 단계를 거쳐야하기 때문에 약간의 안전이 허용됩니다.
ru: В идеале вы хотите,чтобы ваши БД и ПРИЛОЖЕНИЕ были на разных серверах.Это не всегда возможно из-за стоимости,но это позволяет обеспечить некоторую безопасность,поскольку злоумышленнику придется пройти через два шага,чтобы получить полный доступ к системе.
zh_cn: 理想情况下,你希望你的数据库和应用程序在不同的服务器上。由于成本原因,这并不总是可行的,但它确实可以保证一定的安全性,因为攻击者必须经过两个步骤才能完全访问系统。

source: If the user is creating a password through the frontend that means it has to be sent to the server. This opens up a security issue because that means the unencrypted password is being sent to the server and if a attacker is able to listen and access that all your security in PHP is worthless. ALWAYS transmit the data SECURELY, this is done through SSL, but be weary even SSL is not flawless (OpenSSL's Heartbleed flaw is an example of this).
es: Si el usuario está creando una contraseña a través del frontend eso significa que tiene que ser enviada al servidor.Esto abre un problema de seguridad porque eso significa que la contraseña no encriptada está siendo enviada al servidor y si un atacante es capaz de escuchar y acceder que toda su seguridad en PHP no vale nada.SIEMPRE transmite los datos de forma SEGURA,esto se hace a través de SSL,pero ten cuidado,incluso el SSL no es perfecto (la falla de Heartbleed de OpenSSL es un ejemplo de esto).
ja: ユーザーがフロントエンドでパスワードを作成している場合、それはサーバーに送信されなければならないことを意味します。これは、暗号化されていないパスワードがサーバーに送信されることを意味するので、セキュリティ上の問題が発生します。もし攻撃者がそれを聞いてアクセスすることができれば、PHPのセキュリティは無意味になります。データは常に安全に送信するようにしましょう。これはSSLを使って行われますが、SSLであっても完璧ではないことに注意してください (OpenSSLのHeartbleedの欠陥がその例です)。
ko: 사용자가 프론트 엔드를 통해 비밀번호를 작성하는 경우 서버로 비밀번호를 보내야합니다. 이것은 암호화되지 않은 암호가 서버로 전송되고 공격자가 PHP의 모든 보안을 듣고 쓸 수 없다면 보안 문제를 야기합니다. 항상 데이터를 안전하게 전송하십시오. 이것은 SSL을 통해 이루어 지지만 SSL이 완벽하지 않더라도 지칠 수 있습니다 (OpenSSL의 Heartbleed 결함이 그 예입니다).
ru: Если пользователь создает пароль через фронтенд,это означает,что он должен быть отправлен на сервер.Это открывает проблему безопасности,поскольку это означает,что на сервер отправляется незашифрованный пароль,и если злоумышленник может прослушать и получить доступ,то вся ваша безопасность в PHP ничего не стоит.ВСЕГДА передавайте данные БЕЗОПАСНО,это делается через SSL,но будьте уставшими,даже SSL не безупречен (примером этого является дефект OpenSSL's Heartbleed).
zh_cn: 如果用户通过前台创建密码,这意味着它必须被发送到服务器上。这就带来了一个安全问题,因为这意味着未加密的密码被发送到服务器上,如果攻击者能够监听和访问,那么你的PHP的所有安全保障就毫无价值。永远要安全地传输数据,这是通过SSL来完成的,但要小心,即使SSL也不是无懈可击的(OpenSSL的Heartbleed漏洞就是一个例子)。

source: Implement a reasonable 8-10 character minimum length, plus require at least 1 upper case letter, 1 lower case letter, a number, and a symbol. This will improve the entropy of the password, in turn making it harder to crack. (See the "What makes a good password?" section for some debate.)
es: Implementar una longitud mínima razonable de 8-10 caracteres,además de requerir al menos 1 letra mayúscula,1 letra minúscula,un número y un símbolo.Esto mejorará la entropía de la contraseña,a su vez haciendo más difícil de descifrar.(Véase la sección "¿Qué hace que una contraseña sea buena?" para algún debate).
ja: 合理的な8-10文字の最小長さを実装し、さらに少なくとも1つの大文字、1つの小文字、数字、および記号を必要とします。これはパスワードのエントロピーを改善し、クラックを難しくします。(いくつかの議論については、"何が良いパスワードを作るのか?"のセクションを参照してください)。
ko: 8 ~ 10 자 이상의 적절한 길이를 구현하고 최소 1 개의 대문자, 1 개의 소문자, 숫자 및 기호가 필요합니다. 암호의 엔트로피가 향상되어 암호 해독이 어려워집니다. (일부 토론에 대해서는 "무엇이 좋은 암호를 만드는가?"섹션을 참조하십시오.)
ru: Реализуйте разумную минимальную длину в 8-10 символов,плюс требуйте не менее 1 прописной буквы,1 строчной буквы,цифры и символа.Это улучшит энтропию пароля,в свою очередь усложнит процесс взлома.(См.раздел "Что делает хороший пароль?" для некоторых дебатов).
zh_cn: 实施合理的8-10个字符的最小长度,并要求至少有1个大写字母、1个小写字母、1个数字和1个符号。这将提高密码的熵,从而使其更难破解。(请参阅 "什么才是好的密码?"一节中的争论)。)

source: In case I wasn't clear enough, I want to know which hashing function(s) to use and how to pick a good salt in order to have a safe and fast password protection mechanism.
es: En caso de que no haya sido lo suficientemente claro,quiero saber qué función(es)de hash para usar y cómo escoger una buena sal para tener un mecanismo de protección de contraseña seguro y rápido.
ja: 念のため、安全で高速なパスワード保護機構を持つためには、どのハッシュ関数を使えばいいのか、どのようにして良い塩を選べばいいのかを知りたいです。
ko: 충분히 명확하지 않은 경우 안전하고 빠른 암호 보호 메커니즘을 사용하기 위해 사용할 해싱 기능과 좋은 소금을 선택하는 방법을 알고 싶습니다.
ru: В случае,если я не был достаточно ясен,я хочу знать,какую функцию хэширования использовать и как подобрать хорошую соль для того,чтобы иметь безопасный и быстрый механизм парольной защиты.
zh_cn: 为了防止我还不够清楚,我想知道应该使用哪种散列函数,以及如何挑选好的盐,才能有一个安全快速的密码保护机制。

source: In short, entropy is how much variation is within the password. When a password is only lowercase roman letters, that's only 26 characters. That isn't much variation. Alpha-numeric passwords are better, with 36 characters. But allowing upper and lower case, with symbols, is roughly 96 characters. That's a lot better than just letters. One problem is, to make our passwords memorable we insert patterns&mdash;which reduces entropy. Oops!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En resumen, la entrop&iacute;a es la cantidad de variaci&oacute;n dentro de la contrase&ntilde;a. Cuando una contrase&ntilde;a solo tiene letras romanas en min&uacute;sculas, solo tiene 26 caracteres. Eso no es mucha variaci&oacute;n. Las contrase&ntilde;as alfanum&eacute;ricas son mejores, con 36 caracteres. Pero permitir may&uacute;sculas y min&uacute;sculas, con s&iacute;mbolos, tiene aproximadamente 96 caracteres. Eso es mucho mejor que solo letras. Un problema es que, para que nuestras contrase&ntilde;as sean memorables, insertamos patrones, lo que reduce la entrop&iacute;a. &iexcl;Uy!</font></font>
ja: つまり、エントロピーとは、パスワード内の変動の量です。 パスワードが小文字のローマ字のみの場合、それは26文字だけです。 それはあまり変化ではありません。 英数字パスワードの方がよく、36文字です。 ただし、大文字と小文字を区別できる記号は、およそ96文字です。 それは単なる文字よりもはるかに優れています。 問題の1つは、パスワードを覚えやすくするために、パターンを挿入することです。これにより、エントロピーが減少します。 おっとっと！
ko: 요컨대, 엔트로피는 암호 내에 얼마나 많은 변형이 있는지입니다. 암호가 소문자 로마자이면 26 자입니다. 큰 차이는 없습니다. 영숫자 암호는 36 자로 더 좋습니다. 그러나 기호와 함께 대소 문자를 허용하는 것은 대략 96 자입니다. 그것은 편지보다 훨씬 낫습니다. 한 가지 문제는 암호를 기억하기 쉽게하기 위해 엔트로피를 줄이는 패턴을 삽입하는 것입니다. 죄송합니다!
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Короче говоря, энтропия - это то, насколько сильно варьируется пароль. Когда пароль состоит только из строчных латинских букв, это всего 26 символов. Это не большая вариация. Буквенно-цифровые пароли лучше, с 36 символами. Но допускается верхний и нижний регистр с символами, примерно 96 символов. Это намного лучше, чем просто буквы. Одна проблема состоит в том, чтобы сделать наши пароли запоминающимися, мы вставляем шаблоны, что уменьшает энтропию. К сожалению!</font></font>
zh_cn: 简而言之，熵就是密码中的变化量。 当密码仅是小写罗马字母时，则只有26个字符。 差异不大。 字母数字密码最好使用36个字符。 但是允许带符号的大写和小写字母约为96个字符。 这比仅字母要好得多。 一个问题是，为了使密码令人难忘，我们插入了模式-从而减少了熵。 糟糕！

source: In the comments I talked with @popnoodles, who pointed out that <em>enforcing</em> a password policy of X length with X many letters, numbers, symbols, etc, can actually reduce entropy by making the password scheme more predictable. I do agree. Randomess, as truly random as possible, is always the safest but least memorable solution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En los comentarios que habl&eacute; con @popnoodles, quienes se&ntilde;alaron que </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aplicar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una pol&iacute;tica de contrase&ntilde;a de longitud X con X muchas letras, n&uacute;meros, s&iacute;mbolos, etc., en realidad puede reducir la entrop&iacute;a al hacer que el esquema de contrase&ntilde;a sea m&aacute;s predecible. Estoy de acuerdo. La aleatoriedad, lo m&aacute;s aleatoria posible, es siempre la soluci&oacute;n m&aacute;s segura pero menos memorable.</font></font>
ja: 私が@popnoodlesと話したコメントで、Xの長さのパスワードポリシーをX個の文字、数字、記号などで<em>強制</em>すると、パスワードスキームをより予測可能にして実際にエントロピーを減らすことができると指摘しました。 私は同意しますよ。 Randomessは、可能な限り真にランダムであり、常に最も安全ですが最も記憶に残る解決策です。
ko: @ popnoodles와의 의견에서 X 문자의 암호 정책을 X 문자, 숫자, 기호 등으로 적용하면 암호 체계를보다 예측 가능하게하여 실제로 엔트로피를 줄일 수 있다고 지적한 의견입니다. 동의합니다. 랜덤은 가능한 한 무작위로 항상 가장 안전하지만 가장 기억에 남는 솔루션입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В комментариях я говорил с @popnoodles, который указал, что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">применение</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> политики паролей длиной X с множеством букв, цифр, символов и т. Д. На самом деле может снизить энтропию, сделав схему паролей более предсказуемой. Я согласен. Randomess, как можно более случайный, всегда является самым безопасным, но наименее запоминающимся решением.</font></font>
zh_cn: 在我与@popnoodles交谈的评论中，他指出<em>强制</em> X长度为X的密码策略包含X个字母，数字，符号等，实际上可以通过使密码方案更可预测来减少熵。 我同意。 随机性，尽可能真正地随机性，始终是最安全但最难忘的解决方案。

source: In the end, double-hashing, mathematically, provides no benefit. In practice, however, it is useful for preventing rainbow table-based attacks. In other words, it is of no more benefit than hashing with a salt, which takes far less processor time in your application or on your server.
es: Al final,el doble golpe,matemáticamente,no proporciona ningún beneficio.En la práctica,sin embargo,es útil para prevenir los ataques de la tabla del arco iris.En otras palabras,no es más beneficioso que el "hashing" con una sal,que requiere mucho menos tiempo de procesador en su aplicación o en su servidor.
ja: 結局、ダブルハッシュは数学的には何のメリットもありません。しかし、実際にはレインボーテーブルベースの攻撃を防ぐのに役立ちます。言い換えれば、ソルトを使ったハッシュよりも、アプリケーションやサーバの処理時間がはるかに短くて済むということです。
ko: 결국, 이중 해싱은 수학적으로 아무런 이점을 제공하지 않습니다. 그러나 실제로는 레인보우 테이블 기반 공격을 방지하는 데 유용합니다. 다시 말해, 애플리케이션이나 서버에서 프로세서 시간이 훨씬 적게 걸리는 솔트를 사용한 해싱보다 더 큰 이점이 없습니다.
ru: В конце концов,двойное хэширование,математически,не приносит никакой пользы.На практике,однако,это полезно для предотвращения атак по радужным таблицам.Другими словами,это не более полезно,чем хэширование с солью,которое занимает намного меньше процессорного времени в вашем приложении или на вашем сервере.
zh_cn: 最后,从数学上来说,双切值,没有提供任何好处。然而,在实践中,它对于防止基于彩虹表的攻击是有用的。换句话说,它的好处不比用盐进行散列的好处多,因为它在你的应用程序或服务器上花费的处理器时间要少得多。

source: Increasing cost (which defaults to 10) makes the hash harder to brute-force but also means generating hashes and verifying passwords against them will be more work for your server's CPU.
es: El aumento del coste (que por defecto es de 10)hace que el hash sea más difícil de forzar,pero también significa que la generación de hashes y la verificación de las contraseñas contra ellos será más trabajo para la CPU de su servidor.
ja: コストの増加(デフォルトは10)は、ハッシュをブルートフォースすることを難しくしますが、ハッシュを生成してパスワードを検証することは、サーバのCPUにとってより多くの作業になることを意味します。
ko: 비용을 높이면 (기본값은 10) 해시는 무차별 대입이 어려워 지지만 해시를 생성하고 이에 대한 암호를 확인하면 서버의 CPU에서 더 많은 작업을 수행 할 수 있습니다.
ru: Увеличение стоимости (по умолчанию 10)усложняет перебор хэшей,но также означает,что генерация хэшей и проверка паролей к ним будет более трудоемкой задачей для процессора вашего сервера.
zh_cn: 增加成本(默认为10)使得散列的难度增加,但也意味着生成散列和验证密码的难度增加了服务器的CPU。
