Repository: rueisnom/feedback
Catalog: xlf/19/51/74/2/1951742.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: (Because an ASCII picture is worth a thousand characters.)
ja: (アスキー画像は1000文字の価値があるから)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(ASCII 그림은 천 자의 가치가 있기 때문에)</font></font>
ru: (Потому что ASCII-фотография стоит тысячи символов.)
zh_cn: (因为一张ASCII图片的价值是一千个字符)。)

source: (I always get mixed up on whether various commands and arguments should involve a pre-existing location, or one to be made.)
ja: (いろいろなコマンドや引数には事前に存在する場所が必要なのか、それとも作られる場所が必要なのか、いつも混同してしまいます)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(나는 항상 다양한 명령과 인수가 기존 위치 또는 만들어야 할 위치와 관련이 있는지에 대해 혼란스러워합니다.)</font></font>
ru: (Я всегда путаюсь в том,должны ли различные команды и аргументы включать в себя уже существующее место,или же оно должно быть сделано).
zh_cn: (我总是纠结于各种命令和争论,到底是要涉及到预设的位置,还是要做的位置)。

source: <a href="http://linux.die.net/man/1/cp"><code>cp</code></a> copies a file that currently exists (the first argument) to a new file (the second argument).<em><br/> <a href="http://linux.die.net/man/1/mv"><code>mv</code></a> moves a file that currently exists (the first argument) to a new place (the second argument)<sup></sup></em>
ja: <a href="http://linux.die.net/man/1/cp"> <code>cp</code> は</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、現在存在するファイル（最初の引数）を新しいファイル（2番目の引数）にコピーします。</font></font><em><br/> <a href="http://linux.die.net/man/1/mv"> <code>mv</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、現在存在するファイル（最初の引数）を新しい場所（2番目の引数）に移動します</font></font><sup></sup></em>
ko: <a href="http://linux.die.net/man/1/cp"> <code>cp</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 존재하는 파일 (첫 번째 인수)을 새 파일 (두 번째 인수)에 복사합니다. </font></font><em><br/> <a href="http://linux.die.net/man/1/mv"> <code>mv</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 현재 존재하는 파일 (첫 번째 인수)을 새 위치 (두 번째 인수)로 이동합니다</font></font><sup></sup></em>
ru: <a href="http://linux.die.net/man/1/cp"> <code>cp</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> копирует файл, который существует в данный момент (первый аргумент), в новый файл (второй аргумент). </font></font><em><br/> <a href="http://linux.die.net/man/1/mv"> <code>mv</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> перемещает файл, который в данный момент существует (первый аргумент), в новое место (второй аргумент)</font></font><sup></sup></em>
zh_cn: <a href="http://linux.die.net/man/1/cp"> <code>cp</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将当前存在的文件（第一个参数）复制到新文件（第二个参数）。</font></font><em><br/> <a href="http://linux.die.net/man/1/mv"> <code>mv</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将当前存在的文件（第一个参数）移动到新位置（第二个参数）</font></font><sup></sup></em>

source: <code>symlink</code> only returns 0 when the link can be created. In other cases I'm using <code>perror</code> to tell more about the problem.
ja: <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、リンクを作成できる場合にのみ0を返します。</font><font style="vertical-align: inherit;">他の場合では、</font></font> <code>perror</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">て問題の詳細を伝えています。</font></font>
ko: <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 링크를 만들 수있는 경우에만 0을 반환합니다. </font><font style="vertical-align: inherit;">다른 경우에는 </font></font> <code>perror</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 문제에 대해 자세히 설명합니다.</font></font>
ru: <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает только 0, когда ссылка может быть создана. </font><font style="vertical-align: inherit;">В других случаях я использую </font></font> <code>perror</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы рассказать больше о проблеме.</font></font>
zh_cn: <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当可以创建链接时，</font><font style="vertical-align: inherit;">symlink</font><font style="vertical-align: inherit;">仅返回0。</font><font style="vertical-align: inherit;">在其他情况下，我会使用</font></font> <code>perror</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来进一步说明问题。</font></font>

source: <em>-s</em> makes symbolic links instead of hard links
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-s</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はハードリンクの代わりにシンボリックリンクを作成します</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-s</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 하드 링크 대신 기호 링크를 만듭니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-s</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает символические ссылки вместо жестких ссылок</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-s</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行符号链接而不是硬链接</font></font>

source: <strong>A) Goto the folder where you want to create a soft link and typeout the command as mentioned below</strong>:
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A）ソフトリンクを作成するフォルダーに移動し、次のようにコマンドを入力します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) 소프트 링크를 만들 폴더로 이동하여 아래에 언급 된대로 명령을 입력하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) Перейдите в папку, в которой вы хотите создать программную ссылку, и введите команду, как указано ниже</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A）转到您要在其中创建软链接的文件夹，然后按如下所示键入命令</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: <strong>B) Goto your new-file name path and type</strong>:
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B）新しいファイル名のパスに移動し、次のように入力し</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B) 새 파일 이름 경로로 이동하여 다음을 입력하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B) Перейдите к вашему новому имени файла и введите</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B）转到您的新文件名路径并输入</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: <strong>CAUTION</strong>: Although this code checks for errors, it does NOT check if <code>/tmp/realfile</code> actually exists ! This is because a dead link is still valid and depending on your code you might (rarely) want to create the link before the real file.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：このコードはエラーをチェックしますが、</font></font> <code>/tmp/realfile</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際に存在する</font><font style="vertical-align: inherit;">かどうかはチェックしません</font><font style="vertical-align: inherit;">！</font><font style="vertical-align: inherit;">これはデッドリンクがまだ有効であり、コードによっては実際のファイルの前にリンクを作成することが（まれに）必要になる場合があるためです。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주의</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :이 코드는 오류를 검사하지만 </font></font> <code>/tmp/realfile</code> 이<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 실제로 존재 </font><font style="vertical-align: inherit;">하는지 검사하지는 않습니다 </font><font style="vertical-align: inherit;">! </font><font style="vertical-align: inherit;">데드 링크는 여전히 유효하고 코드에 따라 실제 파일 전에 링크를 거의 생성하지 않을 수 있기 때문입니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ВНИМАНИЕ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Хотя этот код проверяет наличие ошибок, он НЕ проверяет, существует ли </font></font> <code>/tmp/realfile</code> на<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> самом деле! </font><font style="vertical-align: inherit;">Это связано с тем, что недействительная ссылка все еще действительна, и в зависимости от вашего кода вы можете (редко) захотите создать ссылку перед реальным файлом.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：尽管此代码检查错误，但不会检查</font></font> <code>/tmp/realfile</code> 是否<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际存在！</font><font style="vertical-align: inherit;">这是因为无效链接仍然有效，并且根据您的代码，您可能（很少）要在真实文件之前创建链接。</font></font>

source: <sup>&diams; - examples using the bash shell</sup>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;-bashシェルを使用した例</font></font></sup>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash-bash 쉘을 사용한 예제</font></font></sup>
ru: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams; - примеры использования оболочки bash</font></font></sup>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;-使用bash shell的示例</font></font></sup>

source: <sup>* - well obviously they can all take different parameters and do different things and can work on files as well as directories... but the premise is the same</sup>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*-もちろん、それらはすべて異なるパラメータを取り、異なることを行うことができ、ファイルだけでなくディレクトリでも作業できます...しかし、前提は同じです</font></font></sup>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*-분명히 그들은 모두 다른 매개 변수를 취하고 다른 일을 할 수 있으며 파일뿐만 아니라 디렉토리에서도 작동 할 수 있습니다 ...하지만 전제는 동일합니다</font></font></sup>
ru: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* - очевидно, что все они могут принимать разные параметры и делать разные вещи и могут работать как с файлами, так и с каталогами ... но предпосылка та же</font></font></sup>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*-很明显，它们都可以采用不同的参数并做不同的事情，并且可以在文件和目录上工作...但是前提是相同的</font></font></sup>

source: A hard link to a file is indistinguishable from the original directory entry; any changes to a file are effectively independent of the name used to reference the file. Hard links may not normally refer to directories and may not span file systems.
ja: ファイルへのハードリンクは、元のディレクトリエントリと区別がつきません。ファイルへの変更は、ファイルを参照するために使用される名前とは実質的に独立しています。ハードリンクは通常、ディレクトリを参照することはできず、ファイルシステムにまたがることもありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일에 대한 하드 링크는 원래 디렉토리 항목과 구별 할 수 없습니다. </font><font style="vertical-align: inherit;">파일에 대한 모든 변경 사항은 파일을 참조하는 데 사용되는 이름과 사실상 무관합니다. </font><font style="vertical-align: inherit;">하드 링크는 일반적으로 디렉토리를 참조하지 않을 수 있으며 파일 시스템에 걸쳐 있지 않을 수 있습니다.</font></font>
ru: Жесткая ссылка на файл неотличима от оригинальной записи каталога;любые изменения в файле фактически не зависят от имени,используемого для ссылки на файл.Жесткие ссылки могут обычно не относиться к каталогам и не охватывать файловые системы.
zh_cn: 一个文件的硬链接与原始目录条目是无法区分的;对文件的任何更改实际上与引用文件的名称无关。硬链接通常不能引用目录,也不能跨越文件系统。

source: All following code assumes that you want to create a symbolic link named <code>/tmp/link</code> that links to <code>/tmp/realfile</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての次のコードは、名前のシンボリックリンクを作成することを想定してい</font></font> <code>/tmp/link</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">へのリンクということ</font></font> <code>/tmp/realfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 다음 코드라는 이름의 심볼릭 링크 생성 할 것으로 가정 </font></font> <code>/tmp/link</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 링크에 </font></font> <code>/tmp/realfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Весь следующий код предполагает, что вы хотите создать символическую ссылку с именем </font></font> <code>/tmp/link</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которая ссылается на </font></font> <code>/tmp/realfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下所有代码均假定您要创建一个名为</font></font> <code>/tmp/link</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的符号</font><font style="vertical-align: inherit;">链接</font><font style="vertical-align: inherit;">，该链接链接到</font></font> <code>/tmp/realfile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: An arrow may be a helpful mnemonic, especially since that's almost exactly how it looks in Emacs' dired.
ja: 矢印は、Emacs の dired でほぼ同じように見えるので、便利なニーモニックかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">화살표는 유용한 니모닉 일 수 있습니다. 특히 Emacs에서 거의 정확하게 보이는 방식이기 때문입니다.</font></font>
ru: Стрелка может быть полезным мнемоническим средством,тем более,что она выглядит почти точно так же,как выглядит в погружении Emacs.
zh_cn: 箭头可能是一个有用的记忆体,尤其是在Emacs的dired中几乎就是这样。

source: And big picture so you don't get it confused with the Windows' version
ja: そして、Windowsのバージョンと混同されないようにするための大きな絵
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">큰 그림이므로 Windows 버전과 혼동되지 않습니다.</font></font>
ru: И общая картина,чтобы не путать с версией Windows.
zh_cn: 和大图片,这样你就不会和Windows的版本混淆了。

source: C and C++
ja: CおよびC++
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C와 C ++</font></font>
ru: C и C++
zh_cn: C和C++

source: Creating Symbolic links or Soft-links on Linux:
ja: Linuxでのシンボリックリンクやソフトリンクの作成
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Linux에서 기호 링크 또는 소프트 링크 작성 :</font></font>
ru: Создание символических ссылок или Soft-ссылок под Linux:
zh_cn: 在Linux上创建符号链接或软链接。

source: EDIT: It's still sinking in slowly for me; I have another way I've written in my notes.
ja: EDIT:それはまだ私のためにゆっくりと沈んでいます;私は私のノートに書き込んだ別の方法を持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : 그것은 여전히 ​​나를 위해 천천히 침몰하고 있습니다. </font><font style="vertical-align: inherit;">노트에 쓴 다른 방법이 있습니다.</font></font>
ru: EDIT:Это все еще медленно опускается для меня;у меня есть другой способ,который я написал в своих записях.
zh_cn: EDIT:这对我来说,还在慢慢地沉淀;我在笔记中又有了另一种写法。

source: Example 1:
ja: 例1.
ko: 예 1 :
ru: Пример 1:
zh_cn: 例1:

source: Example 2:
ja: 例2.
ko: 예 2 :
ru: Пример 2:
zh_cn: 例2:

source: First, there's the <a href="http://linux.die.net/man/1/ln">man page for <code>ln</code></a>. You can access this via searching "man ln" in google, or just open a terminal window and type <code>man ln</code> and you'll get the same information. The man page clearly states:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まず、</font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;">の</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">manページ</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">があり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">あなたはグーグルで「男のLN」を検索経由して、これをアクセスするか、単にターミナルウィンドウを開いて入力することができます</font></font> <code>man ln</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、あなたが同じ情報を取得します。</font><font style="vertical-align: inherit;">マニュアルページには、次のように明記されています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 </font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> 에</a><font style="vertical-align: inherit;"> 대한 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">맨 페이지가</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있습니다. </font><font style="vertical-align: inherit;">Google에서 "man ln"을 검색하여 액세스하거나 터미널 창을 열고 </font></font> <code>man ln</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입력 </font><font style="vertical-align: inherit;">하면 동일한 정보를 얻을 수 있습니다. </font><font style="vertical-align: inherit;">매뉴얼 페이지에는 다음과 같이 명확하게 나와 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во-первых, это </font></font><a href="http://linux.die.net/man/1/ln"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">справочная страница для </font></font> <code>ln</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вы можете получить доступ к этому через поиск "man ln" в Google, или просто откройте окно терминала и введите </font></font> <code>man ln</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вы получите ту же информацию. </font><font style="vertical-align: inherit;">Справочная страница четко гласит:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">首先，有</font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;">的</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">手册页</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您可以通过在Google中搜索&ldquo; man ln&rdquo;来访问此文件，也可以打开终端窗口并输入</font></font> <code>man ln</code> 来<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获取相同的信息。</font><font style="vertical-align: inherit;">手册页明确指出：</font></font>

source: For more details, you can read the man page of ln on your Linux OS.
ja: 詳細はLinux OSのlnのmanページを参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 Linux OS에서 ln의 매뉴얼 페이지를 읽을 수 있습니다.</font></font>
ru: Более подробную информацию Вы можете прочитать в man-странице ln в Вашей Linux OS.
zh_cn: 更多细节,你可以在你的Linux操作系统上阅读ln的man page。

source: General syntax
ja: 一般的な構文
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 문법</font></font>
ru: Общий синтаксис
zh_cn: 一般语法

source: Hard links: link to the specific location of physical data.
ja: ハードリンク:物理データの特定の場所にリンクします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하드 링크 : 실제 데이터의 특정 위치에 링크합니다.</font></font>
ru: Жесткие ссылки:ссылка на конкретное расположение физических данных.
zh_cn: 硬链接:链接到物理数据的具体位置。

source: Here's a few ways to help you remember:
ja: 思い出すのに役立つ方法をいくつかご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기억하는 데 도움이되는 몇 가지 방법이 있습니다.</font></font>
ru: Вот несколько способов помочь тебе вспомнить:
zh_cn: 以下是一些方法,希望能帮助你记住。

source: How can I symlink a file in Linux
ja: Linuxでファイルをシンボリックリンクするには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Linux에서 파일을 심볼릭 링크하는 방법</font></font>
ru: Как я могу соединить файл в Linux.
zh_cn: 如何在Linux中进行文件的symlink

source: How to create symlink in vagrant. Steps:
ja: vagrantでシンボリックリンクを作成する方法。手順は以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방랑자에서 심볼릭 링크를 만드는 방법. </font><font style="vertical-align: inherit;">단계 :</font></font>
ru: Как создать симлинк в бродяге.Шаги:
zh_cn: 如何在vagrant中创建symlink。步骤。

source: I find a bit confusing the terminologies "target" and "directory" in the man information.
ja: man情報の中の「ターゲット」と「ディレクトリ」という用語が少し混乱しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">man 정보에서 "target"과 "directory"라는 용어를 혼동하는 것이 있습니다.</font></font>
ru: Я нахожу немного запутанной терминологию "цель" и "каталог" в информации о человеке.
zh_cn: 我发现男人信息中的 "目标 "和 "目录 "这两个术语有点混乱。

source: I hope this helps to those (still) slighly confused.
ja: 私はこれが(まだ)わずかに混乱している人に役立つことを願っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 여전히 혼란스러워하는 사람들에게 도움이되기를 바랍니다.</font></font>
ru: Надеюсь,это поможет тем,кто (все еще)слабовольно запутался.
zh_cn: 我希望这对那些(仍然)有点迷茫的人有帮助。

source: I want to make a symbolic link in Linux. I have written this Bash command where the first path is the folder I want link into and the second path is the compiled source.
ja: Linuxでシンボリックリンクを作りたい。最初のパスがリンクしたいフォルダ、2番目のパスがコンパイルされたソースであるBashコマンドを書きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">리눅스에서 심볼릭 링크를 만들고 싶습니다. </font><font style="vertical-align: inherit;">첫 번째 경로는 링크하려는 폴더이고 두 번째 경로는 컴파일 된 소스 인이 Bash 명령을 작성했습니다.</font></font>
ru: Я хочу сделать символическую ссылку в Linux.Я написал эту команду Bash,где первый путь-это папка,в которую я хочу сделать ссылку,а второй-скомпилированный исходник.
zh_cn: 我想在Linux中做一个符号链接。我写了这个Bash命令,其中第一个路径是我想链接到的文件夹,第二个路径是编译后的源码。

source: I'd like to present a plainer-English version of the descriptions already presented.
ja: すでに提示されている記述の平易な英語版を提示したいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 제시된 설명의 평범한 영어 버전을 제시하고 싶습니다.</font></font>
ru: Я хотел бы представить более простую,английскую версию уже представленных описаний.
zh_cn: 我想把已经介绍过的描述用更通俗易懂的英文写出来。
