Repository: rueisnom/feedback
Catalog: xlf/19/51/74/2/1951742.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Then create symlink e.g sudo ln -s /source/local local. local mean link-name (folder name in guest machine which you are going to link) if you need to remove the symlink :- Type sudo rm local
ja: シンボリックリンクを削除する必要がある場合は、例えば sudo ln -s sourcelocal local.local はリンク名 (リンクしようとしているゲストマシンのフォルダ名)を意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 symlink를 만듭니다 (예 : sudo ln -s / source / local local). </font><font style="vertical-align: inherit;">symlink를 제거해야하는 경우 로컬 평균 링크 이름 (연결하려는 게스트 시스템의 폴더 이름) :-sudo rm local을 입력하십시오.</font></font>
ru: Затем создайте symlink,например sudo ln -s sourcelocal local.local mean link-name (имя папки в гостевой машине,на которую вы собираетесь сделать ссылку),если вам нужно удалить symlink :-Введите sudo rm local
zh_cn: 然后创建symlink,例如sudo ln -s sourcelocal local,本地指的是链接名(你要链接的客机中的文件夹名),如果你需要删除symlink :-输入sudo rm local

source: Then go to the guest machine directory where the files which are associate with the browser. After get backup of the file. e.g sudo mv local local_bk
ja: その後、ブラウザに関連付けられているファイルがあるゲストマシンのディレクトリに移動します。ファイルのバックアップを取得した後、例えば sudo mv local_bk
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 브라우저와 연관된 파일이있는 게스트 머신 디렉토리로 이동하십시오. </font><font style="vertical-align: inherit;">파일 백업 후. </font><font style="vertical-align: inherit;">예 : sudo mv local local_bk</font></font>
ru: Затем перейдите в каталог гостевой машины,где находятся файлы,связанные с браузером.После получения резервной копии файла,например,sudo mv local local_bk
zh_cn: 然后转到客机目录下,将与浏览器相关联的文件放在那里。获取文件的备份后,例如:sudo mv local local_bk

source: Then when you need it, from the command line just type <code>cmds</code> and you'll get back the proper syntax in a way you can quickly read and understand it. You can make these functions as advanced as you'd like to get what what information you need, it's up to you. You could even make them interactive so you just have to follow the prompts.. something like:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、必要に応じて、コマンドラインから</font></font> <code>cmds</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">入力するだけで</font><font style="vertical-align: inherit;">、適切な構文が返され、すばやく読み、理解できます。</font><font style="vertical-align: inherit;">これらの機能は、必要な情報を取得したいだけ高度なものにすることができます。</font><font style="vertical-align: inherit;">インタラクティブにすることもできるので、プロンプトに従う必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 필요할 때 명령 행에서 </font></font> <code>cmds</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입력 </font><font style="vertical-align: inherit;">하면 빠르게 읽고 이해할 수있는 방식으로 적절한 구문을 다시 얻을 수 있습니다. </font><font style="vertical-align: inherit;">필요한 정보를 얻고 자하는대로 이러한 기능을 고급으로 만들 수 있습니다. </font><font style="vertical-align: inherit;">대화식으로 만들 수도 있으므로 프롬프트를 따라야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Затем, когда вам это нужно, просто введите в командной строке </font></font> <code>cmds</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вы получите правильный синтаксис, чтобы вы могли быстро его прочитать и понять. </font><font style="vertical-align: inherit;">Вы можете сделать эти функции настолько продвинутыми, насколько захотите, чтобы получить то, какая информация вам нужна, решать только вам. </font><font style="vertical-align: inherit;">Вы даже можете сделать их интерактивными, так что вы просто должны следовать инструкциям .. что-то вроде:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后，在需要时，从命令行中键入</font></font> <code>cmds</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您将以一种可以快速阅读和理解它的方式获得正确的语法。</font><font style="vertical-align: inherit;">您可以根据需要使这些功能高级，以获取所需的信息。</font><font style="vertical-align: inherit;">您甚至可以使它们具有交互性，因此您只需要按照提示进行操作即可。</font></font>

source: There are two types of links:
ja: リンクには2種類あります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 유형의 링크가 있습니다.</font></font>
ru: Есть два типа связей:
zh_cn: 链接有两种类型。

source: This code assumes you have a perl 5 interpreter at <code>/usr/bin/perl</code>. <code>symlink</code> only returns 1 if the link can be created. In other cases I'm printing the failure reason to the standard error output.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このコードは、</font></font> <code>/usr/bin/perl</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> perl 5インタープリターがあることを前提としています</font><font style="vertical-align: inherit;">。</font></font> <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、リンクを作成できる場合にのみ1を返します。</font><font style="vertical-align: inherit;">他の場合では、失敗の理由を標準エラー出力に出力しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 코드는 </font></font> <code>/usr/bin/perl</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> perl 5 인터프리터가 있다고 가정합니다 </font><font style="vertical-align: inherit;">. </font></font> <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만들 수있는 경우 </font><font style="vertical-align: inherit;">symlink</font><font style="vertical-align: inherit;"> 는 1 만 반환합니다. </font><font style="vertical-align: inherit;">다른 경우에는 실패 이유를 표준 오류 출력에 인쇄하고 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот код предполагает, что у вас есть интерпретатор perl 5 в </font></font> <code>/usr/bin/perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает только 1, если ссылка может быть создана. </font><font style="vertical-align: inherit;">В других случаях я печатаю причину сбоя на стандартный вывод ошибки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此代码假定您在</font></font> <code>/usr/bin/perl</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有perl 5解释器</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果可以创建链接，则</font></font> <code>symlink</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅返回1。</font><font style="vertical-align: inherit;">在其他情况下，我会将失败原因打印到标准错误输出。</font></font>

source: This is Stack Overflow so I assume you want code:
ja: これはStack Overflowなので、コードが欲しいのではないかと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 스택 오버플로이므로 코드를 원한다고 가정합니다.</font></font>
ru: Это Переполнение стека,так что,полагаю,вам нужен код:
zh_cn: 这里是Stack Overflow,所以我想你需要代码。

source: This is my interpretation of creating a Symlink (in linux):
ja: これは、(linuxでの)Symlinkの作成についての私の解釈です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 Linux에서 Symlink를 만드는 것에 대한 나의 해석입니다.</font></font>
ru: Это моя интерпретация создания Symlink (на linux):
zh_cn: 这是我对创建一个Symlink(在linux中)的解释。

source: This will indeed create a <a href="http://en.wikipedia.org/wiki/Symbolic_link">symbolic link</a> (<code>-s</code>) from the file/directory:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これ</font><font style="vertical-align: inherit;">により、ファイル/ディレクトリから</font></font><a href="http://en.wikipedia.org/wiki/Symbolic_link"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シンボリックリンク</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）が</font><font style="vertical-align: inherit;">作成さ</font><font style="vertical-align: inherit;">れます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일 / 디렉토리에서 </font></font><a href="http://en.wikipedia.org/wiki/Symbolic_link"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )가 </font><font style="vertical-align: inherit;">생성됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это действительно создаст </font></font><a href="http://en.wikipedia.org/wiki/Symbolic_link"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">символическую ссылку</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) из файла / каталога:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上，这将从</font><font style="vertical-align: inherit;">文件/目录</font><font style="vertical-align: inherit;">创建</font></font><a href="http://en.wikipedia.org/wiki/Symbolic_link"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符号链接</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: To create a new symlink (will fail if symlink exists already):
ja: 新しいシンボリックリンクを作成するには(シンボリックリンクが既に存在する場合は失敗します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새 심볼릭 링크를 만들려면 (심볼릭 링크가 이미 존재하지 않으면 실패)</font></font>
ru: Создать новую сим-ссылку (не удастся,если сим-ссылка уже существует):
zh_cn: 要创建一个新的symlink(如果已经存在symlink,则会失败)。

source: To create a symbolic link /soft link, use:
ja: シンボリックリンクソフトリンクを作成するには、以下を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크 / 소프트 링크를 만들려면 다음을 사용하십시오.</font></font>
ru: Для создания символической ссылки используйте мягкую ссылку:
zh_cn: 要创建一个符号化的软链接,请使用。

source: To create or update a symlink:
ja: シンボリックリンクを作成または更新するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크를 만들거나 업데이트하려면</font></font>
ru: Для создания или обновления сим-ссылки:
zh_cn: 要创建或更新一个符号链接。

source: To the original question:
ja: 元の質問へ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 질문에 :</font></font>
ru: К первоначальному вопросу:
zh_cn: 对于原来的问题。

source: Vagrant up and type vagrant ssh and go to source directory e.g cd source
ja: Vagrantを起動してvagrant sshと入力し、ソースディレクトリに移動します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">vagrant up을 입력하고 vagrant ssh를 입력하고 소스 디렉토리로 이동하십시오 (예 : cd source).</font></font>
ru: Бродяга вверх и введите vagrant ssh и перейдите в исходный каталог,например cd source
zh_cn: Vagrant,然后键入vagrant ssh,进入源目录,如:cd source

source: Verify your source code folder structure is available in the source directory. e.g /source/local
ja: ソースコードのフォルダ構造がソースディレクトリにあることを確認してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소스 코드 폴더 구조가 소스 디렉토리에서 사용 가능한지 확인하십시오. </font><font style="vertical-align: inherit;">예 : / source / local</font></font>
ru: Убедитесь,что структура папки с исходным кодом доступна в каталоге с исходным кодом.например,sourcelocal
zh_cn: 验证你的源码文件夹结构是否在源目录中可用,例如:sourcelocal

source: When you do:
ja: その時は
ko: 할 때 :
ru: Когда ты это сделаешь:
zh_cn: 当你做的时候。

source: Where the <code>-s</code> makes it symbolic.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はそれをシンボリックにします。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 그것을 상징적으로 만드는 </font><font style="vertical-align: inherit;">곳 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Где </font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает это символическим.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">凡</font></font> <code>-s</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使得它的象征意义。</font></font>

source: You can have a look at the man page here:
ja: こちらの男性ページをご覧になってみてはいかがでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 여기 맨 페이지를 볼 수 있습니다 :</font></font>
ru: Вы можете взглянуть на man-страницу здесь:
zh_cn: 你可以在这里看一下男人的页面。

source: You can navigate to the folder where you want to create the symlink and run the command or specify the FULL PATH for your symlink instead of NAME-OF-YOUR-SYMLINK.
ja: シンボリックリンクを作成したいフォルダに移動してコマンドを実行するか、NAME-OF-YOUR-SYMLINKの代わりにシンボリックリンクのFULL PATHを指定してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크를 만들 폴더로 이동하여 명령을 실행하거나 NAME-OF-YOUR-SYMLINK 대신 심볼릭 링크의 전체 경로를 지정할 수 있습니다.</font></font>
ru: Вы можете перейти в папку,где вы хотите создать сим-ссылку и запустить команду или указать FULL PATH для вашей сим-ссылки вместо NAME-OF-YOUR-SYMLINK.
zh_cn: 你可以导航到你要创建symlink的文件夹,然后运行该命令,或者为你的symlink指定FULL PATH,而不是NAME-OF-YOUR-SYMLINK。

source: You could also look at these as
ja: これらを次のように見ることもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것들을 다음과 같이 볼 수도 있습니다.</font></font>
ru: Вы также можете смотреть на них как
zh_cn: 你也可以把这些看成

source: You'll see that there is a different inode number for the symlinks.
ja: シンボリックリンクには異なるinode番号があることがわかります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크에 다른 inode 번호가 있음을 알 수 있습니다.</font></font>
ru: Ты увидишь,что есть другой код для симлинков.
zh_cn: 你会发现symlinks有一个不同的inode号。

source: hard links: Refer to the specific location of physical data.
ja: ハードリンクを参照してください。物理データの特定の場所を参照します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하드 링크 : 실제 데이터의 특정 위치를 참조하십시오.</font></font>
ru: Жёсткие ссылки:Обратитесь к конкретному местоположению физических данных.
zh_cn: 硬链接。参照物理数据的具体位置。

source: ln [OPTION]... [-T] TARGET LINK_NAME (1st form)
ja: ln [OPTION]...T]TARGET LINK_NAME (第1形態)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[OPTION] ... [-T] TARGET LINK_NAME (첫 번째 형식)</font></font>
ru: В [ВАРИАНТ]...[-T]TARGET LINK_NAME (1-я форма)
zh_cn: ln [option].....[-T]TARGET LINK_NAME (第一种形式)

source: symbolic links: Refer to a symbolic path indicating the abstract location of another file
ja: シンボリックリンク。別のファイルの抽象的な場所を示すシンボリックパスを参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심볼릭 링크 : 다른 파일의 추상 위치를 나타내는 심볼릭 경로를 참조하십시오.</font></font>
ru: символические ссылки:См.символический путь,указывающий на абстрактное расположение другого файла.
zh_cn: 符号链接。指的是表示另一个文件的抽象位置的符号路径。

source: to your new link
ja: あなたの新しいリンクに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새 링크로</font></font>
ru: на вашу новую ссылку
zh_cn: 到你的新链接

source: you can create too hard links
ja: リンクが固すぎる
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">너무 단단한 링크를 만들 수 있습니다</font></font>
ru: можно создавать слишком жёсткие ссылки
zh_cn: 你可以建立太硬的链接

source: you can refer to <a href="http://man7.org/linux/man-pages/man7/symlink.7.html">http://man7.org/linux/man-pages/man7/symlink.7.html</a>
ja: <font style="vertical-align: inherit;"><a href="http://man7.org/linux/man-pages/man7/symlink.7.html"><font style="vertical-align: inherit;">http://man7.org/linux/man-pages/man7/symlink.7.html</font></a><font style="vertical-align: inherit;">を参照できます</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://man7.org/linux/man-pages/man7/symlink.7.html"><font style="vertical-align: inherit;">http://man7.org/linux/man-pages/man7/symlink.7.html을</font></a><font style="vertical-align: inherit;"> 참조 할 수 있습니다</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вы можете обратиться к </font></font><a href="http://man7.org/linux/man-pages/man7/symlink.7.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://man7.org/linux/man-pages/man7/symlink.7.html</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以参考</font></font><a href="http://man7.org/linux/man-pages/man7/symlink.7.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://man7.org/linux/man-pages/man7/symlink.7.html</font></font></a>
