Repository: rueisnom/feedback
Catalog: xlf/19/51/74/2/1951742.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: If having to search or read through a man page every time isn't for you, maybe you'll have an easier time remembering that all <em>nix commands work the same way<sup></sup></em>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">毎回manページを検索したり読んだりする必要がない場合は、すべての</font><em><font style="vertical-align: inherit;">nixコマンドが同じように機能する</font></em><font style="vertical-align: inherit;">ことを覚えておくと便利です。</font></font><em><font style="vertical-align: inherit;"></font><sup></sup></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매번 맨 페이지를 검색하거나 읽을 필요가 없다면 모든 </font><em><font style="vertical-align: inherit;">nix 명령이 동일한 방식으로 작동</font></em><font style="vertical-align: inherit;"> 한다는 것을 기억하는 것이 더 쉬울 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">것입니다</font></font><sup></sup></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам каждый раз приходится искать или просматривать справочную страницу, возможно, вам будет легче вспомнить, что все </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">команды nix работают одинаково</font></font><sup></sup></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果不适合每次都需要搜索或阅读手册页，也许您会更容易记住所有的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">nix命令以相同的方式工作</font></font><sup></sup></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: If needed you could still implement your own error handling by using the <code>$?</code> variable which will only be set to 0 if the link was successfully created.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要に応じて、</font></font> <code>$?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して独自のエラー処理を実装することもできます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">リンクが正常に作成された場合にのみ0に設定される変数。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필요한 경우 </font></font> <code>$?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 여전히 자체 오류 처리를 구현할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">변수는 링크가 성공적으로 생성 된 경우에만 0으로 설정됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При необходимости вы все равно можете реализовать свою собственную обработку ошибок, используя </font></font> <code>$?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">переменная, которая будет установлена ​​в 0, только если ссылка была успешно создана.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果需要，您仍然可以使用</font></font> <code>$?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来实现自己的错误处理</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">仅在成功创建链接后才将其设置为0的变量。</font></font>

source: If you <em>delete</em> a source file then you won't have anything to the destination in soft.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソースファイル</font><font style="vertical-align: inherit;">を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">削除すると</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ソフトの宛先には何もありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 경우 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">삭제</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 소스 파일을 당신은 부드러운 목적지까지 아무것도하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">удалите</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> исходный файл, то у вас не будет ничего к месту назначения в программном обеспечении.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">删除</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">源文件，则目标软件中将没有任何内容。</font></font>

source: If you are in the directory where you want to create symlink, then ignore second path.
ja: シンボリックリンクを作成したいディレクトリにある場合は、2番目のパスは無視してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">symlink를 작성하려는 디렉토리에 있으면 두 번째 경로를 무시하십시오.</font></font>
ru: Если вы находитесь в каталоге,где вы хотите создать symlink,то игнорируйте второй путь.
zh_cn: 如果你是在你要创建symlink的目录下,那么忽略第二条路径。

source: In vagrant file create a synced folder. e.g config.vm.synced_folder "F:/Sunburst/source/sunburst/lms", "/source" F:/Sunburst/source/sunburst/lms :- where the source code, /source :- directory path inside the vagrant
ja: vagrantファイルの中に同期フォルダを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방랑 파일에서 동기화 된 폴더를 만듭니다. </font><font style="vertical-align: inherit;">예 : config.vm.synced_folder "F : / Sunburst / source / sunburst / lms", "/ source"F : / Sunburst / source / sunburst / lms :-여기서 소스 코드, / source :-vagrant 내의 디렉토리 경로</font></font>
ru: В файле бродяги создайте синхронизированную папку,например,config.vm.synced_folder "F:Sunburstsourcesunburstlms","source" F:Sunburstsourcesunburstlms :-где находится исходный код,путь к каталогу с исходным кодом :-внутри бродяги
zh_cn: 在vagrant文件中创建一个同步文件夹,例如config.vm.synced_folder "F:Sunburstsourcesunburstlms","source "F:Sunburstsourcesunburstlms :--其中源码,source :--vagrant里面的目录路径

source: In your .bash_aliases file you can place something like:
ja: .bash_aliases ファイルには、以下のようなものがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.bash_aliases 파일에서 다음과 같은 것을 배치 할 수 있습니다 :</font></font>
ru: В вашем файле .bash_aliases вы можете поместить что-нибудь вроде:
zh_cn: 在你的.bash_aliases文件中,你可以放置类似这样的东西。

source: In your case symlinks:
ja: あなたの場合はシンボリックリンク。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 경우 symlinks :</font></font>
ru: В твоем случае-симлинки:
zh_cn: 在你的情况下,是指症状链接。

source: Is this correct?
ja: これは正しいのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 올바른지?</font></font>
ru: Это верно?
zh_cn: 是这样吗?

source: It will create symlink of <code>target</code> inside <code>myfolder</code>.
ja: <font style="vertical-align: inherit;"> <code>myfolder</code> <font style="vertical-align: inherit;">内</font><font style="vertical-align: inherit;">に</font></font> <code>target</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シンボリックリンクを作成します</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>myfolder</code> <font style="vertical-align: inherit;"> 안에 </font></font> <code>target</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 심볼릭 링크를 만듭니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это создаст символическую ссылку </font></font> <code>target</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font> <code>myfolder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它将</font><font style="vertical-align: inherit;">在</font> <code>myfolder</code> 中<font style="vertical-align: inherit;">创建</font></font> <code>target</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符号链接</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Likewise <a href="http://linux.die.net/man/1/ln"><code>ln</code></a> links a file that currently exists (the first argument) to a new link (the second argument)<sup>*</sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同様に、</font></font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は現在存在するファイル（最初の引数）を新しいリンク（2番目の引数）にリンクします</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마찬가지로 </font></font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 현재 존재하는 파일 (첫 번째 인수)을 새 링크 (두 번째 인수)에 연결합니다. </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Аналогично, </font></font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> связывает существующий в данный момент файл (первый аргумент) с новой ссылкой (второй аргумент) </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*</font></font></sup>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同样，</font></font><a href="http://linux.die.net/man/1/ln"> <code>ln</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将当前存在的文件（第一个参数）链接到新链接（第二个参数）</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*</font></font></sup>

source: Links are basically of two types:
ja: リンクには基本的に2種類あります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링크는 기본적으로 두 가지 유형입니다.</font></font>
ru: Ссылки,в основном,двух типов:
zh_cn: 链接基本上有两种类型。

source: Open Bash prompt and type the below mentioned command to make a symbolic link to your file:
ja: Bashプロンプトを開き、以下のコマンドを入力してファイルへのシンボリックリンクを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bash 프롬프트를 열고 아래에 언급 된 명령을 입력하여 파일에 심볼릭 링크를 만듭니다.</font></font>
ru: Откройте Bash prompt и введите следующую команду,чтобы сделать символическую ссылку на ваш файл:
zh_cn: 打开Bash提示符,输入下面提到的命令,就可以在你的文件中做一个符号链接。

source: Real simple, just like you would do it on the command line (which is the shell). All error handling is done by the shell interpreter. This code assumes that you have a working shell interpreter at <code>/bin/sh</code> .
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドライン（シェル）で実行するのと同じように、非常に単純です。</font><font style="vertical-align: inherit;">すべてのエラー処理は、シェルインタープリターによって行われます。</font><font style="vertical-align: inherit;">このコードは、</font></font> <code>/bin/sh</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シェルインタープリターが動作していることを前提としています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명령 줄 (쉘)에서하는 것처럼 간단합니다. </font><font style="vertical-align: inherit;">모든 오류 처리는 쉘 인터프리터에 의해 수행됩니다. </font><font style="vertical-align: inherit;">이 코드는 </font></font> <code>/bin/sh</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 작동하는 쉘 인터프리터가 있다고 가정합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Все очень просто, так же, как вы делаете это в командной строке (это оболочка). </font><font style="vertical-align: inherit;">Вся обработка ошибок выполняется интерпретатором оболочки. </font><font style="vertical-align: inherit;">Этот код предполагает, что у вас есть работающий интерпретатор оболочки в </font></font> <code>/bin/sh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真的很简单，就像您在命令行（这是外壳程序）上一样。</font><font style="vertical-align: inherit;">所有错误处理均由外壳解释器完成。</font><font style="vertical-align: inherit;">此代码假定您在</font></font> <code>/bin/sh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处具有有效的shell解释器</font><font style="vertical-align: inherit;">。</font></font>

source: Shell (bash, zsh, ...)
ja: シェル (bash,zsh,....)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">쉘 (bash, zsh, ...)</font></font>

source: Standard file-info stuff is at left (although note the first character is an "l" for "link"); the file-name is "a:" and the "-&gt;" also indicates the file is a link. It basically tells WINE how Windows "Drive A:" is to be associated with a floppy drive in Linux. To actually create a symbolic link SIMILAR to that (in current directory, and to actually do this for WINE is more complicated; use the "winecfg" utility):
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">標準のファイル情報は左側にあります（ただし、最初の文字は「リンク」の「l」です）。</font><font style="vertical-align: inherit;">ファイル名は「a：」であり、「-&gt;」はファイルがリンクであることも示します。</font><font style="vertical-align: inherit;">基本的には、Windowsの「ドライブA：」をLinuxのフロッピードライブに関連付ける方法をWINEに伝えます。</font><font style="vertical-align: inherit;">実際にシンボリックリンクを作成するには（現在のディレクトリにあり、実際にWINEでこれを行うには、 "winecfg"ユーティリティを使用します）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">표준 파일 정보 항목은 왼쪽에 있습니다 (첫 번째 문자는 "링크"의 경우 "l"임). </font><font style="vertical-align: inherit;">파일 이름은 "a :"이고 "-&gt;"는 파일이 링크임을 나타냅니다. </font><font style="vertical-align: inherit;">기본적으로 WINE에 Linux에서 Windows "Drive A :"가 플로피 드라이브와 연결되는 방법을 알려줍니다. </font><font style="vertical-align: inherit;">실제로 이와 유사한 심볼릭 링크를 작성하려면 (현재 디렉토리에서 WINE에 대해 실제로 수행하는 것이 더 복잡합니다. "winecfg"유틸리티 사용) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стандартные данные файла находятся слева (хотя обратите внимание, что первый символ - это &laquo;l&raquo; для &laquo;ссылки&raquo;); </font><font style="vertical-align: inherit;">имя файла - &laquo;a:&raquo;, а &laquo;-&gt;&raquo; также указывает, что файл является ссылкой. </font><font style="vertical-align: inherit;">Это в основном говорит WINE, как Windows &laquo;Drive A:&raquo; должна быть связана с флоппи-дисководом в Linux. </font><font style="vertical-align: inherit;">Чтобы фактически создать символическую ссылку ПОХОЖУЮ на это (в текущем каталоге, и фактически сделать это для WINE более сложно; используйте утилиту "winecfg"):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标准文件信息的内容位于左侧（尽管请注意，第一个字符是&ldquo; link&rdquo;的&ldquo; l&rdquo;）；</font><font style="vertical-align: inherit;">文件名是&ldquo; a：&rdquo;，&ldquo;-&gt;&rdquo;也表示文件是链接。</font><font style="vertical-align: inherit;">它基本上告诉WINE Windows如何将Windows&ldquo; Drive A：&rdquo;与Linux中的软盘驱动器关联。</font><font style="vertical-align: inherit;">实际创建一个与此类似的符号链接（在当前目录中，并且为WINE实际执行此操作更为复杂；请使用&ldquo; winecfg&rdquo;实用程序）：</font></font>

source: Symbolic links (soft): link to a symbolic path indicating the abstract location of another file
ja: シンボリックリンク(ソフト):別のファイルの抽象的な位置を示すシンボリックパスへのリンク
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기호 링크 (소프트) : 다른 파일의 추상 위치를 나타내는 기호 경로에 대한 링크</font></font>
ru: Символические ссылки (soft):ссылка на символический путь,указывающий на абстрактное расположение другого файла
zh_cn: 符号链接(软):链接到一个符号路径,表示另一个文件的抽象位置。

source: The "ln" command creates a link-FILE, and the "-s" specifies that the type of link will be symbolic. An example of a symbolic-link file can be found in a WINE installation (using "ls -la" to show one line of the directory contents):
ja: ln "コマンドはlink-FILEを作成し、"-s "はリンクの種類をシンボリックにすることを指定する。シンボリックリンクファイルの例は、WINEのインストールで見ることができます("ls -la "を使用して、ディレクトリの内容を1行表示します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"ln"명령은 link-FILE을 작성하고 "-s"는 링크 유형이 기호가되도록 지정합니다. </font><font style="vertical-align: inherit;">심볼릭 링크 파일의 예는 WINE 설치에서 찾을 수 있습니다 ( "ls -la"를 사용하여 한 줄의 디렉토리 내용 표시).</font></font>
ru: Команда "ln" создает link-FILE,а команда "-s" указывает,что тип ссылки будет символическим.Пример файла символической связи можно найти в инсталляции WINE (используя "ls -la",чтобы показать одну строку содержимого директории):
zh_cn: ln "命令会创建一个link-File,"-s "指定链接类型为符号链接。符号链接文件的一个例子可以在WINE安装中找到(使用 "ls -la "显示一行目录内容)。

source: The <code>from-here</code> should not exist yet, it is to be created, while the <code>to-here</code> should already exist (IIRC).
ja: <font style="vertical-align: inherit;"></font> <code>from-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方でまだ存在してはならないが、それは、作成される</font></font> <code>to-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、既に（IIRC）が存在しなければなりません。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>from-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (가) 동안 아직 존재하지 않아야, 그것은 생성 될 </font></font> <code>to-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이미 (IIRC) 있어야합니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>from-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> еще не существует, она будет создана, в </font><font style="vertical-align: inherit;">то время как </font></font> <code>to-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> уже должна существовать (IIRC).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo; </font></font> <code>from-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尚不存在，需要创建它，而&ldquo; </font></font> <code>to-here</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该已经存在（IIRC）。</font></font>

source: The above command will create a symbolic link to file1.txt.
ja: 上記のコマンドを実行すると、file1.txtへのシンボリックリンクが作成されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 명령은 file1.txt에 대한 심볼릭 링크를 만듭니다.</font></font>
ru: Вышеуказанная команда создаст символическую ссылку на file1.txt.
zh_cn: 上面的命令将创建一个符号链接到file1.txt。

source: The above is an example of a hard link where you can have a copy of your physical data.
ja: 上記は、物理的なデータのコピーを持つことができるハードリンクの例です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위는 실제 데이터의 사본을 보유 할 수있는 하드 링크의 예입니다.</font></font>
ru: Выше приведен пример жесткой ссылки,по которой вы можете получить копию своих физических данных.
zh_cn: 以上是一个硬链接的例子,在这里你可以有一个物理数据的拷贝。

source: The final option I would like to suggest is you can create your own man pages that are easy to read and easy (for you) to find/remember. Just make a simple shell script that gives you the hint you need. For example<sup>&diams;</sup>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が提案したい最後のオプションは、あなたが読みやすく、（あなたにとって）見つけやすく、覚えやすい、あなた自身のマニュアルページを作成できることです。</font><font style="vertical-align: inherit;">必要なヒントを提供する単純なシェルスクリプトを作成するだけです。</font><font style="vertical-align: inherit;">例えば</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막으로 제안하고 싶은 옵션은 읽기 쉽고 기억하기 쉬운 사용자 매뉴얼 페이지를 만들 수 있다는 것입니다. </font><font style="vertical-align: inherit;">필요한 힌트를 제공하는 간단한 쉘 스크립트를 작성하십시오. </font><font style="vertical-align: inherit;">예를 들어 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Последний вариант, который я хотел бы предложить, - вы можете создавать свои собственные справочные страницы, которые легко читаются и которые легко (для вас) можно найти / запомнить. </font><font style="vertical-align: inherit;">Просто создайте простой сценарий оболочки, который даст вам подсказку, которая вам нужна. </font><font style="vertical-align: inherit;">Например, </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我想建议的最后一个选择是，您可以创建自己的手册页，这些手册页易于阅读并且易于（对您）查找/记住。</font><font style="vertical-align: inherit;">只需编写一个简单的shell脚本即可为您提供所需的提示。</font><font style="vertical-align: inherit;">例如</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&diams;</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: The target is the folder that we are symlinking to and the directory the actual symlink (not the directory that you will be symlinking to), if anyone is experiencing the same confusion, don't feel alone.
ja: ターゲットは、私たちがシンボリックリンクしているフォルダと実際のシンボリックリンク先のディレクトリです(シンボリックリンク先のディレクトリではありません)、もし誰かが同じ混乱を経験している場合は、一人で感じないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가가 같은 혼란을 겪고 있다면, 목표는 우리가 연결하는 폴더와 실제 연결 (디렉토리가 아닌)이있는 디렉토리입니다.</font></font>
ru: Цель-это папка,к которой мы подключаемся,а папка,к которой мы подключаемся (а не папка,к которой вы будете подключаться),если кто-то испытывает такую же путаницу,не чувствуйте себя одинокими.
zh_cn: 目标是我们所要链接的文件夹,而目录是实际的symlink(而不是你所要链接的目录),如果有人遇到同样的困惑,不要觉得孤单。
