Repository: rueisnom/feedback
Catalog: xlf/30/68/09/38/30680938.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Hidden" characters
es: Los personajes "ocultos"
ja: "隠し文字
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"숨겨진"문자</font></font>
ru: "Скрытые" персонажи
zh_cn: "隐 "字

source: 1. We first see, that the value 2 is in an array with the key 1
es: 1.Primero vemos,que el valor 2 está en una matriz con la clave 1
ja: 1.まず、値2がキー1の配列にあることがわかります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. 먼저 값 2가 키가 1 인 배열에 있음을 확인</font></font>
ru: 1.Сначала мы видим,что значение 2 находится в массиве с ключом 1.
zh_cn: 1.我们首先看到,值2在一个数组中的键1中

source: 2. Next we see, that the array is assigned to a property with the name property of an object
es: 2.A continuación vemos que la matriz se asigna a una propiedad con la propiedad de nombre de un objeto
ja: 2.次に、配列がオブジェクトの名前プロパティを持つプロパティに代入されていることを見てみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. 다음으로, 배열이 객체의 name 속성을 가진 속성에 할당 된 것을 볼 수 있습니다</font></font>
ru: 2.Далее мы видим,что массив присваивается свойству с именем свойства объекта
zh_cn: 2.接下来我们看到,数组被分配到一个具有对象的名称属性的属性上。

source: 3. And at the end we see, that the outermost is an array
es: 3.Y al final vemos,que el más exterior es un conjunto
ja: 3.そして最後に、一番外側が配列であることがわかります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. 그리고 마지막에 가장 바깥 쪽이 배열임을 알 수 있습니다</font></font>
ru: 3.И в конце мы видим,что крайняя часть-это массив.
zh_cn: 3.最后我们看到,最外面的是一个数组。

source: <code>print_r()</code> output:
es: <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">salida </font><font style="vertical-align: inherit;">print_r ()</font><font style="vertical-align: inherit;"> :</font></font>
ja: <code>print_r()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力：</font></font>
ko: <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 출력 :</font></font>
ru: <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вывод </font><font style="vertical-align: inherit;">print_r ()</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出：</font></font>

source: <code>var_dump()</code> output:
es: <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">salida </font><font style="vertical-align: inherit;">var_dump ()</font><font style="vertical-align: inherit;"> :</font></font>
ja: <code>var_dump()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力：</font></font>
ko: <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 출력 :</font></font>
ru: <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出：</font></font>

source: <code>var_export()</code> output:
es: <code>var_export()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">salida </font><font style="vertical-align: inherit;">var_export ()</font><font style="vertical-align: inherit;"> :</font></font>
ja: <code>var_export()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力：</font></font>
ko: <code>var_export()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 출력 :</font></font>
ru: <code>var_export()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <code>var_export()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出：</font></font>

source: <strong>And if you are not sure if you have an object or array, just use <a href="http://php.net/manual/en/function.gettype.php"><code>gettype()</code></a>.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y si no est&aacute; seguro de tener un objeto o una matriz, simplemente use </font></font><a href="http://php.net/manual/en/function.gettype.php"> <code>gettype()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトか配列かわからない場合は、</font></font><a href="http://php.net/manual/en/function.gettype.php"> <code>gettype()</code> を</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 또는 배열이 있는지 확실하지 않은 경우 </font></font><a href="http://php.net/manual/en/function.gettype.php"> <code>gettype()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И если вы не уверены, есть ли у вас объект или массив, просто используйте </font></font><a href="http://php.net/manual/en/function.gettype.php"> <code>gettype()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而且，如果不确定是否有对象或数组，只需使用</font></font><a href="http://php.net/manual/en/function.gettype.php"> <code>gettype()</code> 即可</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></strong>

source: <strong>General (symbols, errors)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">General (s&iacute;mbolos, errores)</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一般（記号、エラー）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반 (기호, 오류)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Общее (символы, ошибки)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常规（符号，错误）</font></font></strong>

source: <strong>Property name problems</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Problemas de nombre de propiedad</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティ名の問題</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 이름 문제</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проблемы с названием недвижимости</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">物业名称问题</font></font></strong>

source: Access array element
es: Acceder al elemento de la matriz
ja: アクセス配列要素
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">액세스 배열 요소</font></font>
ru: Элемент массива Access
zh_cn: 访问数组元素

source: Access multidimensional array
es: Acceder a la matriz multidimensional
ja: 多次元配列にアクセス
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다차원 배열에 액세스</font></font>
ru: Многомерный массив доступа
zh_cn: 访问多维数组

source: All of these 3 debug functions output the same data, just in another format or with some meta data (e.g. type, size). So here I want to show how you have to read the output of these functions to know/get to the way how to access certain data from your array/object.
es: Estas tres funciones de depuración producen los mismos datos,sólo que en otro formato o con algunos metadatos (por ejemplo,tipo,tamaño).Así que aquí quiero mostrar cómo tienes que leer la salida de estas funciones para saber cómo acceder a ciertos datos de tu objeto matriz.
ja: これら3つのデバッグ関数はすべて同じデータを出力しますが、別のフォーマットやメタデータ(例えば、型やサイズ)で出力します。そこで、ここでは、これらの関数の出力を読み込んで、配列オブジェクトから特定のデータにアクセスする方法を知ることができるようにしたいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 3 가지 디버그 함수는 모두 다른 형식으로 또는 일부 메타 데이터 (예 : 유형, 크기)로 동일한 데이터를 출력합니다. </font><font style="vertical-align: inherit;">그래서 여기에서는 배열 / 객체에서 특정 데이터에 액세스하는 방법을 알고 / 알기 위해 이러한 함수의 출력을 읽는 방법을 보여 드리고자합니다.</font></font>
ru: Все эти 3 отладочные функции выводят одни и те же данные,просто в другом формате или с некоторыми мета-данными (например,тип,размер).Поэтому здесь я хочу показать,как вам нужно читать вывод этих функций,чтобы знать,как получить доступ к определенным данным из вашего массива-объекта.
zh_cn: 这3个调试函数输出的数据都是一样的,只是用另一种格式或者是一些元数据(如类型、大小)。所以在这里我想告诉大家如何通过读取这些函数的输出来知道如何从你的数组对象中访问某些数据。

source: Also you have to be careful if you have a property name which is invalid! So to see all problems, which you can face with an invalid property name see this <a href="https://stackoverflow.com/q/33157296/3933332">question/answer</a>. And especially <a href="https://stackoverflow.com/a/10333200/3933332">this one</a> if you have numbers at the start of the property name.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Tambi&eacute;n debe tener cuidado si tiene un nombre de propiedad que no es v&aacute;lido! </font><font style="vertical-align: inherit;">Para ver todos los problemas que puede enfrentar con un nombre de propiedad no v&aacute;lido, consulte esta </font></font><a href="https://stackoverflow.com/q/33157296/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pregunta / respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y especialmente </font></font><a href="https://stackoverflow.com/a/10333200/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si tiene n&uacute;meros al comienzo del nombre de la propiedad.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、無効なプロパティ名がある場合は注意が必要です。</font><font style="vertical-align: inherit;">したがって、無効なプロパティ名で直面する可能性があるすべての問題を確認するには、この</font></font><a href="https://stackoverflow.com/q/33157296/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">質問/回答を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">そして、特に</font></font><a href="https://stackoverflow.com/a/10333200/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは、プロパティ名の先頭に数字を持っている場合。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 속성 이름이 유효하지 않은 경우 조심해야합니다! </font><font style="vertical-align: inherit;">따라서 잘못된 속성 이름으로 직면 할 수있는 모든 문제를 보려면이 </font></font><a href="https://stackoverflow.com/q/33157296/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문 / 답변을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그리고 특히 </font></font><a href="https://stackoverflow.com/a/10333200/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 하나</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신은 속성 이름의 시작 부분에 번호가있는 경우.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также вы должны быть осторожны, если у вас есть неправильное имя свойства! </font><font style="vertical-align: inherit;">Чтобы увидеть все проблемы, с которыми вы можете столкнуться при неверном имени свойства, посмотрите этот </font></font><a href="https://stackoverflow.com/q/33157296/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вопрос / ответ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">И особенно </font></font><a href="https://stackoverflow.com/a/10333200/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этот,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если у вас есть цифры в начале названия свойства.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另外，如果您使用的属性名称无效，也必须小心！</font><font style="vertical-align: inherit;">因此，要查看所有问题，您可能会遇到一个无效的属性名称，请参阅此</font></font><a href="https://stackoverflow.com/q/33157296/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">问题/答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果您在属性名称的开头有数字，则</font><font style="vertical-align: inherit;">尤其要注意</font></font><a href="https://stackoverflow.com/a/10333200/3933332"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这一点</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Analyse <a href="http://php.net/manual/en/function.var-dump.php"><code>var_dump()</code></a> / <a href="http://php.net/manual/en/function.print-r.php"><code>print_r()</code></a> / <a href="http://php.net/manual/en/function.var-export.php"><code>var_export()</code></a> output
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Analizar </font><font style="vertical-align: inherit;">salida </font></font><a href="http://php.net/manual/en/function.var-dump.php"> <code>var_dump()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.print-r.php"> <code>print_r()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.var-export.php"> <code>var_export()</code> </a><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://php.net/manual/en/function.var-dump.php"> <code>var_dump()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.print-r.php"> <code>print_r()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.var-export.php"> <code>var_export()</code> の</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力を</font><font style="vertical-align: inherit;">分析する</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분석 </font></font><a href="http://php.net/manual/en/function.var-dump.php"> <code>var_dump()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.print-r.php"> <code>print_r()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.var-export.php"> <code>var_export()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 출력</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Анализ </font></font><a href="http://php.net/manual/en/function.var-dump.php"> <code>var_dump()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.print-r.php"> <code>print_r()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.var-export.php"> <code>var_export()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Выход</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分析</font></font><a href="http://php.net/manual/en/function.var-dump.php"> <code>var_dump()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.print-r.php"> <code>print_r()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://php.net/manual/en/function.var-export.php"> <code>var_export()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出</font></font>

source: And all of the sudden you will maybe see stuff like this:
es: Y de repente,tal vez veas cosas como esta:
ja: 突然、こんなものが出てくるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 갑자기 당신은 아마 다음과 같은 것들을 보게 될 것입니다 :</font></font>
ru: И внезапно ты,возможно,увидишь такие вещи:
zh_cn: 突然间,你也许会看到这样的东西。

source: And the output will be:
es: Y la salida será:
ja: そして、アウトプットされます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출력은 다음과 같습니다.</font></font>
ru: И результат будет:
zh_cn: 而输出将是。

source: And then you will get the output:
es: Y entonces tendrás la salida:
ja: そして、アウトプットが出てきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 출력을 얻습니다.</font></font>
ru: И тогда вы получите результат:
zh_cn: 然后就可以得到输出。

source: And with this you can loop through any dimension which you want no matter if it is an array or object.
es: Y con esto puedes hacer un bucle a través de cualquier dimensión que desees sin importar si es una matriz o un objeto.
ja: また、これを使えば、配列でもオブジェクトでも、任意の次元をループすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 이것으로 배열이나 객체이든 상관없이 원하는 치수를 반복 할 수 있습니다.</font></font>
ru: При этом вы можете проциклировать любое измерение,независимо от того,является ли оно массивом или объектом.
zh_cn: 有了这个,你可以在任何你想要的维度中循环,不管它是数组还是对象。

source: Array_values lost keys and return array with numerous keys making array as <code>array(10499478683521864, '07/22/1983'...)</code>. This result we see in the question.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array_values ​​perdi&oacute; las claves y devolvi&oacute; la matriz con numerosas claves que hacen la matriz como </font></font> <code>array(10499478683521864, '07/22/1983'...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Este resultado lo vemos en la pregunta.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array_valuesはキーを失い、配列を</font></font> <code>array(10499478683521864, '07/22/1983'...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として作成する多数のキーを持つ配列を返します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この結果は、質問でわかります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array_values는 키를 잃어 버리고 배열로 배열하는 수많은 키가있는 배열을 반환합니다 </font></font> <code>array(10499478683521864, '07/22/1983'...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이 결과는 질문에서 볼 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array_values ​​потерял ключи и возвращает массив с многочисленными ключами, делающими массив </font></font> <code>array(10499478683521864, '07/22/1983'...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Этот результат мы видим в вопросе.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Array_values丢失键并返回带有多个键的数组，从而使数组成为</font></font> <code>array(10499478683521864, '07/22/1983'...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我们在问题中看到了这个结果。</font></font>

source: Arrays &amp; Objects
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Arreglos y objetos</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列とオブジェクト</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 및 객체</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Массивы и объекты</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组与对象</font></font>

source: Arrays, Objects and Loops
es: Matrices,objetos y bucles
ja: 配列、オブジェクト、ループ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열, 객체 및 루프</font></font>
ru: Массивы,объекты и петли
zh_cn: 数组、对象和循环

source: As an example if you look at the output of <code>print_r()</code> and you see:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como ejemplo, si mira la salida de </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y ve:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例として、</font></font> <code>print_r()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出力を確認すると、次のように表示され</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 출력을 보면 다음 </font><font style="vertical-align: inherit;">과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В качестве примера, если вы посмотрите на вывод </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и увидите:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为示例，如果您查看</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的输出，</font><font style="vertical-align: inherit;">您会看到：</font></font>

source: As an example we take an array, but it could also be an object:
es: Como ejemplo tomamos una matriz,pero también podría ser un objeto:
ja: 例として配列を取り上げましたが、オブジェクトであっても構いません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 배열을 사용하지만 객체 일 수도 있습니다.</font></font>
ru: В качестве примера возьмем массив,но это может быть и объект:
zh_cn: 我们以数组为例,但它也可以是一个对象。
