Repository: rueisnom/feedback
Catalog: xlf/30/68/09/38/30680938.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As we know that we have to access an array element with <code>[]</code>, we see here that we have to use <strong><code>["key"]</code></strong> to access the object. We now can put all these parts together and write:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como sabemos que tenemos que acceder a un elemento de matriz con </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , vemos aqu&iacute; que tenemos que usar </font></font><strong> <code>["key"]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para acceder al objeto. </font><font style="vertical-align: inherit;">Ahora podemos juntar todas estas partes y escribir:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">配列要素にアクセスする必要があることがわかっているので</font><font style="vertical-align: inherit;">、オブジェクトにアクセス</font><font style="vertical-align: inherit;">するには</font></font><strong> <code>["key"]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用する必要があることがわかり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これで、これらすべてのパーツをまとめて記述できます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 배열 요소에 액세스해야한다는 것을 알았 </font><font style="vertical-align: inherit;">으므로 여기서는 </font></font><strong> <code>["key"]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 객체에 액세스해야합니다. </font><font style="vertical-align: inherit;">이제이 모든 부분들을 모아서 다음과 같이 쓸 수 있습니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку мы знаем, что мы должны получить доступ к элементу массива с помощью </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы видим здесь, что мы должны использовать </font></font><strong> <code>["key"]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для доступа к объекту. </font><font style="vertical-align: inherit;">Теперь мы можем собрать все эти части вместе и написать:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如我们所知，我们必须使用</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问数组元素</font><font style="vertical-align: inherit;">，我们在这里看到必须使用</font></font><strong> <code>["key"]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来访问对象。</font><font style="vertical-align: inherit;">现在，我们可以将所有这些部分放在一起并编写：</font></font>

source: But this displays me:
es: Pero esto me muestra:
ja: しかし、これは私を表示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것은 나를 표시합니다.</font></font>
ru: Но это показывает мне:
zh_cn: 但这显示我。

source: But you are getting the notice:
es: Pero estás recibiendo el aviso:
ja: でも、通知が来ているんですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 당신은 통지를 받고 있습니다 :</font></font>
ru: Но ты получаешь уведомление:
zh_cn: 但是,你收到通知了。

source: Defining an array and accessing an array element are two different things. So don't mix them up.
es: Definir una matriz y acceder a un elemento de la matriz son dos cosas diferentes.Así que no los mezcles.
ja: 配列を定義することと、配列要素にアクセスすることは別のものです。ですから、これらを混同しないようにしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 정의하고 배열 요소에 액세스하는 것은 서로 다른 두 가지입니다. </font><font style="vertical-align: inherit;">따라서 섞지 마십시오.</font></font>
ru: Определение массива и доступ к элементу массива-это две разные вещи.Так что не путайте их.
zh_cn: 定义一个数组和访问一个数组元素是两回事。所以不要把它们混为一谈。

source: Difference between declaring an array and accessing an array element
es: Diferencia entre declarar un conjunto y acceder a un elemento del conjunto
ja: 配列の宣言と配列要素へのアクセスの違い
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 선언과 배열 요소 액세스의 차이점</font></font>
ru: Разница между объявлением массива и доступом к элементу массива
zh_cn: 声明数组和访问数组元素的区别

source: Don't get yourself confused if someone uses another coding style than you:
es: No te confundas si alguien usa un estilo de codificación distinto al tuyo:
ja: 自分とは別のコーディングスタイルを使っている人がいても混乱しないようにしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가 다른 코딩 스타일을 사용하는 경우 혼동하지 마십시오.</font></font>
ru: Не путайте себя,если кто-то использует другой стиль кодирования,чем вы:
zh_cn: 如果别人用的是另一种编码风格,不要把自己搞糊涂了。

source: Don't let PHP troll you!
es: ¡No dejes que PHP te engañe!
ja: PHPに荒らされるな!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP가 당신을 트롤하게하지 마십시오!</font></font>
ru: Не позволяй PHP троллить тебя!
zh_cn: 别让PHP欺骗你!

source: For more information see:
es: Para más información,véase:
ja: 詳細はこちらをご覧ください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자세한 내용은 다음을 참조하십시오.</font></font>
ru: Дополнительную информацию см:
zh_cn: 欲了解更多信息,请参见:

source: For this you just have to access the dimension over which you want to loop and then you can loop over all values of that dimension.
es: Para ello sólo tienes que acceder a la dimensión sobre la que quieres hacer un bucle y luego puedes hacer un bucle sobre todos los valores de esa dimensión.
ja: このためには、ループするディメンジョンにアクセスして、そのディメンジョンのすべての値をループできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 위해 루프하려는 치수에 액세스하면 해당 치수의 모든 값을 루프 할 수 있습니다.</font></font>
ru: Для этого достаточно получить доступ к измерению,над которым нужно выполнить цикл,и затем можно выполнить цикл над всеми значениями этого измерения.
zh_cn: 为此,你只需要访问你想循环的维度,然后你就可以在该维度的所有值上循环。

source: From the question we can't see the structure of input array. It maybe <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code>. So when you ask $demo[0] you use undefind index.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De la pregunta no podemos ver la estructura de la matriz de entrada. </font><font style="vertical-align: inherit;">Puede ser una </font></font> <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Entonces, cuando pregunta $ demo [0], usa undefind index.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">質問から、入力配列の構造を見ることができません。</font><font style="vertical-align: inherit;">多分</font></font> <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">したがって、$ demo [0]に尋ねると、未定義のインデックスが使用されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문에서 우리는 입력 배열의 구조를 볼 수 없습니다. </font><font style="vertical-align: inherit;">그것은 어쩌면 </font></font> <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">따라서 $ demo [0]을 물을 때 정의되지 않은 색인을 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Из вопроса мы не видим структуру входного массива. </font><font style="vertical-align: inherit;">Это может быть </font></font> <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Поэтому, когда вы спрашиваете $ demo [0], вы используете undefind index.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从这个问题我们看不到输入数组的结构。</font><font style="vertical-align: inherit;">它可能是</font></font> <code>array ('id' =&gt; 10499478683521864, 'date' =&gt; '07/22/1983')</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，当您询问$ demo [0]时，将使用未定义索引。</font></font>

source: How can I access a property with an invalid name?
es: ¿Cómo puedo acceder a una propiedad con un nombre inválido?
ja: 無効な名前のプロパティにアクセスするには?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이름이 잘못된 속성에 어떻게 액세스 할 수 있습니까?</font></font>
ru: Как я могу получить доступ к недвижимости с недействительным именем?
zh_cn: 如何访问一个无效名字的属性?

source: How can I access an array/object
es: ¿Cómo puedo acceder a un objeto de la matriz
ja: 配列オブジェクトにアクセスするには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 / 객체에 액세스하는 방법</font></font>
ru: Как получить доступ к массиву
zh_cn: 如何访问一个数组对象

source: How can I access as an example the value <code>email@saya.com</code> from the array?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo puedo acceder como ejemplo al valor </font></font> <code>email@saya.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la matriz?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例として</font><font style="vertical-align: inherit;">、アレイから</font></font> <code>email@saya.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という値にアクセスするにはどうすればよい</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열에서 </font></font> <code>email@saya.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값에 어떻게 액세스 할 수 </font><font style="vertical-align: inherit;">있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу получить в качестве примера значение </font></font> <code>email@saya.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из массива?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，</font></font> <code>email@saya.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从数组</font><font style="vertical-align: inherit;">访问值</font><font style="vertical-align: inherit;">email@saya.com</font><font style="vertical-align: inherit;">？</font></font>

source: How to access object properties with names like integers?
es: ¿Cómo acceder a las propiedades de los objetos con nombres como números enteros?
ja: 整数のような名前を持つオブジェクトのプロパティにアクセスするには?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정수와 같은 이름으로 객체 속성에 액세스하는 방법은 무엇입니까?</font></font>
ru: Как получить доступ к свойствам объектов с именами типа integers?
zh_cn: 如何用整数等名称访问对象属性?

source: I get this array from the <strong>Facebook SDK 4</strong>, so I don't know the original array structure.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Obtengo esta matriz del </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SDK 4 de Facebook</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que no conozco la estructura original de la matriz.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この配列は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Facebook SDK 4</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から取得している</font><font style="vertical-align: inherit;">ため、元の配列構造がわかりません。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Facebook SDK 4</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서이 배열을 얻으 </font><font style="vertical-align: inherit;">므로 원래 배열 구조를 모릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я получил этот массив из </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Facebook SDK 4</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому я не знаю исходную структуру массива.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我从</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Facebook SDK 4</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获得此数组</font><font style="vertical-align: inherit;">，所以我不知道原始的数组结构。</font></font>

source: I have the following array and when I do <code>print_r(array_values($get_user));</code>, I get:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tengo la siguiente matriz y cuando hago </font></font> <code>print_r(array_values($get_user));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, Yo obtengo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次の配列があり、</font></font> <code>print_r(array_values($get_user));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、私は得ます：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 다음과 같은 배열을 가지고 있는데 </font></font> <code>print_r(array_values($get_user));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, 나는 얻다:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У меня есть следующий массив, и когда я делаю </font></font> <code>print_r(array_values($get_user));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, Я получил:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我有以下数组，当我做</font></font> <code>print_r(array_values($get_user));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我得到：</font></font>

source: I hope this gives you a rough idea how you can access arrays and objects, when they are nested in each other.
es: Espero que esto te dé una idea aproximada de cómo puedes acceder a los conjuntos y objetos,cuando están anidados unos en otros.
ja: これで、配列とオブジェクトが入れ子になっているときに、どのようにアクセスするかの大まかなイメージがつかめるといいですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 배열과 객체가 서로 중첩되어있을 때 어떻게 액세스 할 수 있는지에 대한 대략적인 아이디어를 제공하기를 바랍니다.</font></font>
ru: Надеюсь,это даст вам примерное представление о том,как можно получить доступ к массивам и объектам,когда они вложены друг в друга.
zh_cn: 我希望这能给你一个大概的思路,当数组和对象之间相互嵌套的时候,你可以访问数组和对象。

source: I tried to access the array as followed:
es: Intenté acceder a la matriz como se indica a continuación:
ja: 以下のように配列にアクセスしてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 배열에 액세스하려고했습니다.</font></font>
ru: Я пытался получить доступ к массиву следующим образом:
zh_cn: 我试着按照下面的方法访问数组。

source: I wrote a small function for accessing properties in either arrays or objects. I use it quite a bit find it pretty handy
es: Escribí una pequeña función para acceder a las propiedades de las matrices o de los objetos.La uso bastante a menudo y la encuentro bastante útil
ja: 配列やオブジェクトのプロパティにアクセスするための小さな関数を書きました。かなり便利に使っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열이나 객체의 속성에 액세스하기위한 작은 함수를 작성했습니다. </font><font style="vertical-align: inherit;">나는 그것을 아주 조금 사용하여 꽤 편리하다고 생각합니다.</font></font>
ru: Я написал небольшую функцию для доступа к свойствам как в массивах,так и в объектах.Я использую ее довольно часто,и нахожу ее довольно удобной.
zh_cn: 我写了一个小函数,用于访问数组或对象中的属性。我经常使用它,觉得很方便

source: If it is called an array or object depends on the outermost part of your variable. So <strong><code>[new StdClass]</code></strong> is an <strong>array</strong> even if it has (nested) objects inside of it and <strong><code>$object-&gt;property = array();</code></strong> is an <strong>object</strong> even if it has (nested) arrays inside.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si se llama matriz u objeto depende de la parte m&aacute;s externa de su variable. </font><font style="vertical-align: inherit;">Entonces </font></font><strong> <code>[new StdClass]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matriz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> incluso si tiene objetos (anidados) dentro de ella y </font></font><strong> <code>$object-&gt;property = array();</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es un </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">objeto</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> incluso si tiene matrices (anidadas) dentro.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列またはオブジェクトと呼ばれる場合は、変数の最も外側の部分によって異なります。</font><font style="vertical-align: inherit;">だから、</font></font><strong> <code>[new StdClass]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、それはそれの内部オブジェクトおよび（ネストされた）があっても</font></font><strong> <code>$object-&gt;property = array();</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内部に（ネストされた）配列</font><font style="vertical-align: inherit;">がある</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でも</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">オブジェクト</font></strong><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 배열 또는 객체라고 불리는 경우 변수의 가장 바깥 부분에 달려 있습니다. </font><font style="vertical-align: inherit;">그래서 </font></font><strong> <code>[new StdClass]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 (중첩 된) 경우에도 그 안에 물체와 </font></font><strong> <code>$object-&gt;property = array();</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입니다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오브젝트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 (중첩) 경우에도 내부 배열을.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если он называется массив или объект, зависит от внешней части вашей переменной. </font><font style="vertical-align: inherit;">Таким образом, </font></font><strong> <code>[new StdClass]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">массивом,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> даже если он содержит (вложенные) объекты внутри него и </font></font><strong> <code>$object-&gt;property = array();</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">объектом,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> даже если он имеет (вложенные) массивы внутри.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否调用数组或对象取决于变量的最外部。</font><font style="vertical-align: inherit;">因此，</font><font style="vertical-align: inherit;">即使</font></font><strong> <code>[new StdClass]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">里面有（嵌套）对象并且</font><strong> <code>$object-&gt;property = array();</code> </strong><font style="vertical-align: inherit;">也是一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组</font></font></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象，</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即使它内部具有（嵌套）数组也是如此。</font></font>

source: If the output from <code>print_r($var)</code> is e.g:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si el resultado de </font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es, por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の出力が次の場合</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 출력 </font><font style="vertical-align: inherit;">이 다음과 같은 경우 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вывод из </font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的输出</font><font style="vertical-align: inherit;">例如：</font></font>
