Repository: rueisnom/feedback
Catalog: xlf/30/68/09/38/30680938.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To access a particular element in an array you can use any expression inside <code>[]</code> or <code>{}</code> which then evaluates to the key you want to access:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para acceder a un elemento particular en una matriz, puede usar cualquier expresi&oacute;n dentro de </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que luego eval&uacute;a la clave a la que desea acceder:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列内の特定の要素にアクセスするには、</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内の任意の式を使用</font><font style="vertical-align: inherit;">して、アクセスするキーに評価できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열의 특정 요소에 액세스하려면 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 안에있는 표현식을 사용 </font><font style="vertical-align: inherit;">하여 액세스하려는 키로 평가할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для доступа к определенному элементу в массиве вы можете использовать любое выражение внутри </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>{}</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которое затем вычисляет ключ, к которому вы хотите получить доступ:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要访问数组中的特定元素，可以使用</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内的任何表达式</font><font style="vertical-align: inherit;">，然后求值为要访问的键：</font></font>

source: To access an <code>array</code> or <code>object</code> you how to use two different operators.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para acceder a una </font></font> <code>array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> u </font></font> <code>object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , debe utilizar dos operadores diferentes.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アクセスする</font><font style="vertical-align: inherit;">には、2つの異なる演算子の使用方法を説明します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이나 </font></font> <code>object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 액세스하려면 </font><font style="vertical-align: inherit;">서로 다른 두 개의 연산자를 사용하는 방법이 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для доступа к </font></font> <code>array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вам нужно использовать два разных оператора.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要访问</font></font> <code>array</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您如何使用两个不同的运算符。</font></font>

source: To access an object property you have to use <code>-&gt;</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para acceder a una propiedad de objeto, debe usar </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトのプロパティにアクセスするには、</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 속성에 액세스하려면 </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용해야 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для доступа к свойству объекта вы должны использовать </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要访问对象属性，必须使用</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: To access array elements you have to use either <code>[]</code> or which you don't see that much, but which you can also use is <code>{}</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para acceder a los elementos de la matriz, debe usar </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o que no ve mucho, pero que tambi&eacute;n puede usar es </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列要素にアクセスするには、</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用するか</font><font style="vertical-align: inherit;">、あまり表示されないが、使用できるものは</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 요소에 액세스하려면 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하거나 </font><font style="vertical-align: inherit;">많이 보지 않지만 사용할 수있는 것은 </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы получить доступ к элементам массива, вы должны использовать либо </font></font> <code>[]</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> либо те, которые вы не видите, но также можете использовать </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要访问数组元素，您必须使用</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">不多的</font><font style="vertical-align: inherit;">元素</font><font style="vertical-align: inherit;">，但也可以使用</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: To define an array you can use <code>array()</code> or for PHP &gt;=5.4 <code>[]</code> and you assign/set an array/-element. While when you are accessing an array element with <code>[]</code> or <code>{}</code> as mentioned above you get the value of an array element opposed to setting an element.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para definir una matriz, puede usar </font></font> <code>array()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o para PHP&gt; = 5.4 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y asignar / establecer una matriz / elemento. </font><font style="vertical-align: inherit;">Mientras que cuando accede a un elemento de matriz con </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como se mencion&oacute; anteriormente, obtiene el valor de un elemento de matriz en lugar de establecer un elemento.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列を定義するには、array </font></font> <code>array()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">またはPHP&gt; = 5.4 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して、配列/要素を割り当て/設定します。</font><font style="vertical-align: inherit;">上記のように</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">して配列要素にアクセスしているときは</font><font style="vertical-align: inherit;">、要素を設定するのではなく、配列要素の値を取得します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 정의하기 위해 </font></font> <code>array()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 PHP&gt; = 5.4 </font></font> <code>[]</code> 를 사용<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 배열 / 요소를 할당 / 설정할 수 있습니다. </font><font style="vertical-align: inherit;">위에서 언급 한대로 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 배열 요소에 액세스하는 경우 요소 </font><font style="vertical-align: inherit;">를 설정하는 대신 배열 요소의 값을 얻습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для определения массива вы можете использовать </font></font> <code>array()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или для PHP&gt; = 5.4 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и назначить / установить массив / -element. </font><font style="vertical-align: inherit;">Хотя, когда вы обращаетесь к элементу массива с помощью </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>{}</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как упомянуто выше, вы получаете значение элемента массива, противоположное установке элемента.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要定义一个数组，可以使用</font></font> <code>array()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或PHP&gt; = 5.4 </font></font> <code>[]</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后分配/设置一个数组/元素。</font><font style="vertical-align: inherit;">如上所述，</font><font style="vertical-align: inherit;">当您使用</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问数组元素时，您将获得与</font><font style="vertical-align: inherit;">设置元素相反的数组元素的值。</font></font>

source: You can only access properties with public <a href="http://php.net/manual/en/language.oop5.visibility.php">visibility</a> from outside of the class. Otherwise (private or protected) you need a method or reflection, which you can use to get the value of the property.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Solo puede acceder a propiedades con </font></font><a href="http://php.net/manual/en/language.oop5.visibility.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">visibilidad</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> p&uacute;blica </font><font style="vertical-align: inherit;">desde fuera de la clase. </font><font style="vertical-align: inherit;">De lo contrario (privado o protegido) necesita un m&eacute;todo o una reflexi&oacute;n, que puede utilizar para obtener el valor de la propiedad.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスの外部からは、</font><font style="vertical-align: inherit;">パブリックな</font></font><a href="http://php.net/manual/en/language.oop5.visibility.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可視性</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を持つプロパティにのみアクセスできます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それ以外の場合（プライベートまたは保護）、プロパティまたは値を取得するために使用できるメソッドまたはリフレクションが必要です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수업 외부에서 </font><font style="vertical-align: inherit;">공개적으로 </font></font><a href="http://php.net/manual/en/language.oop5.visibility.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공개</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 된 </font><font style="vertical-align: inherit;">속성에만 액세스 할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그렇지 않으면 (개인 또는 보호 된) 속성이나 값을 얻는 데 사용할 수있는 방법이나 반영이 필요합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете получить доступ к свойствам с публичной </font></font><a href="http://php.net/manual/en/language.oop5.visibility.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">видимостью только</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вне класса. </font><font style="vertical-align: inherit;">В противном случае (частный или защищенный) вам нужен метод или отражение, которое вы можете использовать для получения значения свойства.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您只能</font><font style="vertical-align: inherit;">从班级外部</font><font style="vertical-align: inherit;">访问具有公共</font></font><a href="http://php.net/manual/en/language.oop5.visibility.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可见性的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">否则（私有或受保护的），您需要一个方法或反射，您可以使用该方法或反射来获取属性的值。</font></font>

source: You might have an XML file or string loaded into an object, e.g.
es: Puede tener un archivo o cadena XML cargada en un objeto,por ejemplo.
ja: XML ファイルや文字列をオブジェクトに読み込ませることができるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">XML 파일이나 문자열을 객체에로드했을 수 있습니다.</font></font>
ru: В объект может быть загружен XML-файл или строка,например
zh_cn: 你可能有一个XML文件或字符串被加载到一个对象中,比如说

source: You will get your desired output:
es: Obtendrá el resultado deseado:
ja: 希望の出力が得られます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원하는 출력을 얻을 수 있습니다 :</font></font>
ru: Вы получите желаемый результат:
zh_cn: 你会得到你想要的输出。

source: then do <code>$var['demo'][0]</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">luego haga </font></font> <code>$var['demo'][0]</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に</font></font> <code>$var['demo'][0]</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 </font></font> <code>$var['demo'][0]</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тогда сделайте </font></font> <code>$var['demo'][0]</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后做</font></font> <code>$var['demo'][0]</code>

source: then do <code>$var[0]</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">entonces haz </font></font> <code>$var[0]</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に</font></font> <code>$var[0]</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 </font></font> <code>$var[0]</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тогда сделайте </font></font> <code>$var[0]</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后做</font></font> <code>$var[0]</code>

source: then you can access their indices arra-wise:
es: ...entonces puedes acceder a sus índices en cuanto a la arraigo:
ja: を使用すると、それらのインデックスに arra-wise でアクセスすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 색인에 arra-wise로 액세스 할 수 있습니다.</font></font>
ru: тогда вы сможете получить доступ к их индексам:
zh_cn: 然后,你可以访问他们的指数arra-wise。

source: undefined 0
es: indefinido 0
ja: 未定義 0
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정의되지 않은 0</font></font>
ru: неопределённый 0
zh_cn: 未定义0

source: you can use
es: puedes usar
ja: 使える
ko: 당신이 사용할 수있는
ru: вы можете использовать
zh_cn: 可以用
