Repository: rueisnom/feedback
Catalog: xlf/30/68/09/38/30680938.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you don't just want to access a single element you can loop over your nested array / object and go through the values of a particular dimension.
es: Si no quieres acceder a un solo elemento,puedes hacer un bucle sobre el objeto de la matriz anidada y pasar por los valores de una dimensión en particular.
ja: 単一の要素だけにアクセスしたくない場合は、入れ子になった配列オブジェクトをループして、特定の次元の値を通過させることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 요소에 액세스하고 싶지 않으면 중첩 배열 / 객체를 반복하고 특정 차원의 값을 통과 할 수 있습니다.</font></font>
ru: Если вы не хотите получить доступ только к одному элементу,вы можете зациклиться на вложенном объекте массива и пройтись по значениям определенного измерения.
zh_cn: 如果你不只是想访问单个元素,你可以在你的嵌套数组对象上循环,并通过特定维度的值进行循环。

source: If you have an object in another object you just have to use multiple <code>-&gt;</code> to get to your object property.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si tiene un objeto en otro objeto, solo tiene que usar m&uacute;ltiples </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para llegar a su propiedad de objeto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別のオブジェクトにオブジェクトがある場合は、複数の</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">してオブジェクトプロパティにアクセスする必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 객체에 객체가있는 경우 여러 </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 객체 속성을 가져와야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если у вас есть объект в другом объекте, вам просто нужно использовать несколько </font></font> <code>-&gt;</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы перейти к свойству объекта.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果另一个对象中有一个对象，则只需使用多个</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即可进入对象属性。</font></font>

source: If you have multiple arrays in each other you simply have a multidimensional array. To access an array element in a sub array you just have to use multiple <code>[]</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si tiene varias matrices entre s&iacute;, simplemente tiene una matriz multidimensional. </font><font style="vertical-align: inherit;">Para acceder a un elemento de matriz en una matriz secundaria solo tiene que usar m&uacute;ltiples </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">互いに複数の配列がある場合は、単に多次元配列になります。</font><font style="vertical-align: inherit;">サブ配列の配列要素にアクセスするには、複数の</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서로 배열이 여러 개인 경우 다차원 배열 만 있으면됩니다. </font><font style="vertical-align: inherit;">하위 배열의 배열 요소에 액세스하려면 여러 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если у вас есть несколько массивов друг в друге, у вас просто есть многомерный массив. </font><font style="vertical-align: inherit;">Чтобы получить доступ к элементу массива в подмассиве, вам просто нужно использовать несколько </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果彼此之间有多个数组，则只需一个多维数组。</font><font style="vertical-align: inherit;">要访问子数组中的数组元素，您只需要使用multiple </font></font> <code>[]</code> 即可<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If you loop over the first dimension you will get all values from the first dimension:
es: Si pasas por encima de la primera dimensión obtendrás todos los valores de la primera dimensión:
ja: 1 つ目の次元をループすると、1 つ目の次元からすべての値が取得されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 차원을 반복하면 첫 번째 차원에서 모든 값을 얻습니다.</font></font>
ru: Если выполнить цикл над первым измерением,то все значения будут получены из первого измерения:
zh_cn: 如果你在第一个维度上循环,你将得到来自第一个维度的所有值。

source: If you loop over the second dimension you will get all values from the second dimension:
es: Si pasas por encima de la segunda dimensión obtendrás todos los valores de la segunda dimensión:
ja: 2 番目の次元をループすると、2 番目の次元からすべての値が取得されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 차원을 반복하면 두 번째 차원에서 모든 값을 얻습니다.</font></font>
ru: Если вы пройдете цикл над вторым измерением,то получите все значения из второго измерения:
zh_cn: 如果你在第二个维度上循环,你将得到第二个维度的所有值。

source: If your output from <code>print_r($var)</code> is e.g:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si su salida de </font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es, por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">からの出力が次の場合</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 출력 </font><font style="vertical-align: inherit;">이 다음과 같은 경우 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если ваш вывод из </font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您从</font></font> <code>print_r($var)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输出</font><font style="vertical-align: inherit;">是例如：</font></font>

source: Input array:
es: Matriz de entrada:
ja: 入力配列。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력 배열 :</font></font>
ru: Входной массив:
zh_cn: 输入数组。

source: Means here in the first dimension you would only have 1 element with the key(<code>$key</code>) <code>data</code> and the value(<code>$value</code>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Medios aqu&iacute; en la primera dimensi&oacute;n que s&oacute;lo tendr&iacute;a 1 elemento con la clave ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font> <code>data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el valor ( </font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、最初の次元では、key（</font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font> <code>data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とvalue（</font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">含む</font><font style="vertical-align: inherit;">要素は1つしかありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 차원에서 여기서 의미는 key ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font> <code>data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 value ( </font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">가있는 요소가 하나뿐입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имеется в виду, что в первом измерении у вас будет только 1 элемент с </font> <code>data</code> <font style="vertical-align: inherit;"> ключа ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">и значением ( </font> <code>$value</code> <font style="vertical-align: inherit;"> ):</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这意味着在第一维中，您只有一个元素，其中包含key（</font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font> <code>data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和value（</font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: Means here in the second dimension you would have 3 element with the keys(<code>$key</code>) <code>0</code>, <code>1</code>, <code>2</code> and the values(<code>$value</code>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Significa que aqu&iacute;, en la segunda dimensi&oacute;n, tendr&iacute;as 3 elementos con las teclas ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los valores ( </font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは二次元の手段あなたは3つのキーを持つ要素（だろう</font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および値（</font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 두 번째 차원에서 키 ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 값 ( </font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )을 </font><font style="vertical-align: inherit;">갖는 3 개의 요소가 있음을 의미합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Значит, здесь во втором измерении у вас будет 3 элемента с ключами ( </font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и значениями ( </font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里意味着在第二个维度你就必须用钥匙3元（</font></font> <code>$key</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和值（</font></font> <code>$value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）：</font></font>

source: Never trust the output of <code>print_r()</code> or <code>var_dump()</code> if you look at XML
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nunca conf&iacute;e en la salida de </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si mira XML</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">XMLを見る場合</font><font style="vertical-align: inherit;">は、</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の出力を信頼しないでください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">XML을 보면 </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 출력을 신뢰하지 마십시오</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Никогда не доверяйте выводу </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы посмотрите на XML</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您查看XML，请</font><font style="vertical-align: inherit;">不要相信</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的输出</font></font>

source: Notice: Undefined index: key
es: Aviso:Índice indefinido:clave
ja: 通知しています。未定義のインデックス:キー
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">통지 : 정의되지 않은 색인 : 키</font></font>
ru: Заметь:Неопределенный индекс:ключ
zh_cn: 注意事项。未定义索引:关键

source: Now if you have arrays and objects mixed in each other you just have to look if you now access an array element or an object property and use the corresponding operator for it.
es: Ahora,si tienes matrices y objetos mezclados entre sí,sólo tienes que mirar si ahora accedes a un elemento de la matriz o a una propiedad del objeto y usas el operador correspondiente para ello.
ja: 配列とオブジェクトが混在している場合は、配列の要素やオブジェクトのプロパティにアクセスして、それに対応する演算子を使用するかどうかを調べればいいだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 배열과 객체가 서로 혼합되어 있으면 이제 배열 요소 또는 객체 속성에 액세스하고 해당 연산자를 사용 해야하는지 확인해야합니다.</font></font>
ru: Теперь,если у Вас есть массивы и объекты,смешанные друг с другом,Вам просто нужно посмотреть,имеете ли Вы теперь доступ к элементу массива или свойству объекта и использовать для этого соответствующий оператор.
zh_cn: 现在,如果你有数组和对象混合在一起,你只需要看看你现在是访问一个数组元素还是对象属性,并为其使用相应的操作符。

source: Now if you use <code>var_dump()</code> or <code>print_r()</code> you will see:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora si usa </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ver&aacute;:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">今、あなたが使用している場合</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用すると、表示されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하면 다음을 볼 수 있습니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь, если вы используете </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы увидите:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，如果您使用</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>print_r()</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您将看到：</font></font>

source: Now you will see, that your key has a html tag in it + a new line character, which you didn't saw in the first place, since <code>print_r()</code> and the browser didn't showed that.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora ver&aacute; que su clave tiene una etiqueta html + un nuevo car&aacute;cter de l&iacute;nea, que no vio en primer lugar, ya que </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el navegador no lo mostraron.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これで、キーにはhtmlタグと改行文字が含まれていることがわかります。これは、</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とブラウザがそれを示していない</font><font style="vertical-align: inherit;">ため、最初は見て</font><font style="vertical-align: inherit;">いませんでした。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 키에 html 태그가 있고 </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브라우저가 표시하지 않았기 </font><font style="vertical-align: inherit;">때문에 처음에는 보지 못한 줄 바꿈 문자 </font><font style="vertical-align: inherit;">가 있음을 알 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь вы увидите, что в вашем ключе есть html-тег + символ новой строки, которого вы прежде не видели, так как </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и браузер этого не показывали.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在您将看到，您的键中带有一个html标记+一个换行符，由于</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和浏览器没有显示该</font><font style="vertical-align: inherit;">键，所以您最初没有看到</font><font style="vertical-align: inherit;">它。</font></font>

source: PHP Parse/Syntax Errors; and How to solve them?
es: Errores de ParseSintaxis PHP;y ¿Cómo resolverlos?
ja: PHP の ParseSyntax エラーとその解決方法は?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PHP 구문 분석 / 구문 오류; </font><font style="vertical-align: inherit;">그리고 그들을 해결하는 방법?</font></font>
ru: Ошибки синтаксиса PHP;и как их решить?
zh_cn: PHP ParseSyntax错误;以及如何解决?

source: Reference - What does this error mean in PHP?
es: Reference-¿Qué significa este error en PHP?
ja: 参照-このエラーは PHP で何を意味するのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조-이 오류는 PHP에서 무엇을 의미합니까?</font></font>
ru: Ссылка-Что означает эта ошибка в PHP?
zh_cn: 参考--在PHP中这个错误是什么意思?

source: Reference - What does this symbol mean in PHP?
es: Reference-¿Qué significa este símbolo en PHP?
ja: 参照-この記号は、PHP でどのような意味を持つのでしょうか?
ko: 참조-PHP에서이 기호는 무엇을 의미합니까?
ru: Ссылка-Что означает этот символ в PHP?
zh_cn: 参考文献-这个符号在PHP中是什么意思?

source: So as you can see all outputs are pretty similar. And if you now want to access the value 2 you can just start from the value itself, which you want to access and work your way out to the "top left".
es: Como puedes ver,todas las salidas son bastante similares.Y si ahora quieres acceder al valor 2 puedes empezar desde el valor mismo,al que quieres acceder y salir a la "parte superior izquierda".
ja: このように、すべての出力は非常に似ています。そして、値2にアクセスしたい場合は、アクセスしたい値自体から始めて、"左上 "に向かって作業することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보시다시피 모든 출력은 매우 비슷합니다. </font><font style="vertical-align: inherit;">그리고 이제 값 2에 액세스하려면 값 자체에서 시작하여 "왼쪽 상단"으로 접근하여 작업하려고합니다.</font></font>
ru: Так что,как вы видите,все выходы довольно похожи.И если теперь вы хотите получить доступ к значению 2,вы можете просто начать со значения,к которому вы хотите получить доступ,и проработать свой путь к "левому верху".
zh_cn: 所以,你可以看到所有的输出都很相似。如果你现在想访问值2,你可以从你想访问的值本身开始,然后从 "左上角 "开始。
