Repository: rueisnom/feedback
Catalog: xlf/30/68/09/38/30680938.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: So as you can see you don't see the attributes of title. So as I said never trust the output of <code>var_dump()</code> or <code>print_r()</code> when you have an XML object. Always use <a href="http://php.net/manual/en/simplexmlelement.asxml.php"><code>asXML()</code></a> to see the full XML file/string.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, como puedes ver, no ves los atributos del t&iacute;tulo. </font><font style="vertical-align: inherit;">Entonces, como dije, nunca conf&iacute;es en la salida de </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cuando tienes un objeto XML. </font><font style="vertical-align: inherit;">Utilice siempre </font></font><a href="http://php.net/manual/en/simplexmlelement.asxml.php"> <code>asXML()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ver el archivo / cadena XML completo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧のとおり、タイトルの属性は表示されません。</font><font style="vertical-align: inherit;">したがって</font><font style="vertical-align: inherit;">、XMLオブジェクトがある場合は、</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の出力を信頼しないで</font><font style="vertical-align: inherit;">ください。</font><font style="vertical-align: inherit;">XMLファイル/文字列全体を表示するには、</font><font style="vertical-align: inherit;">常に</font></font><a href="http://php.net/manual/en/simplexmlelement.asxml.php"> <code>asXML()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보시다시피 제목의 속성은 보이지 않습니다. </font><font style="vertical-align: inherit;">내가 말했듯 </font><font style="vertical-align: inherit;">이 XML 객체가있을 때 </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 출력을 신뢰하지 마십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">전체 XML 파일 / 문자열을 보려면 </font><font style="vertical-align: inherit;">항상 </font></font><a href="http://php.net/manual/en/simplexmlelement.asxml.php"> <code>asXML()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Итак, как вы можете видеть, вы не видите атрибуты заголовка. </font><font style="vertical-align: inherit;">Поэтому, как я уже сказал, никогда не доверяйте выводу </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> когда у вас есть объект XML. </font><font style="vertical-align: inherit;">Всегда используйте </font></font><a href="http://php.net/manual/en/simplexmlelement.asxml.php"> <code>asXML()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы увидеть полный XML-файл / строку.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如您所见，您看不到标题的属性。</font><font style="vertical-align: inherit;">因此，正如我所说，</font><font style="vertical-align: inherit;">当您拥有XML对象时，请</font><font style="vertical-align: inherit;">不要相信</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>print_r()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的输出</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">始终使用</font></font><a href="http://php.net/manual/en/simplexmlelement.asxml.php"> <code>asXML()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查看完整的XML文件/字符串。</font></font>

source: So just be aware of what expression you use as key and how it gets interpreted by PHP:
es: Así que ten cuidado con la expresión que usas como clave y cómo es interpretada por PHP:
ja: そのため、どのような式をキーとして使用するか、そしてそれが PHP によってどのように解釈されるかに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 키로 사용하는 표현과 PHP가 해석하는 방식을 알고 있어야합니다.</font></font>
ru: Поэтому просто знайте,какое выражение вы используете в качестве ключа и как оно интерпретируется PHP:
zh_cn: 所以只要注意你用什么表达式作为key,以及它如何被PHP解释。

source: So just use one of the methods shown below:
es: Así que usa uno de los métodos que se muestran a continuación:
ja: だから、以下の方法のいずれかを使えばいいのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 아래 표시된 방법 중 하나를 사용하십시오.</font></font>
ru: Так что просто используйте один из методов,показанных ниже:
zh_cn: 所以只要用下面所示的方法之一就可以了。

source: So now if you try to do:
es: Así que ahora si intentas hacerlo:
ja: だから今、あなたがしようとした場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 당신이하려고하면 :</font></font>
ru: Так что теперь,если ты попытаешься:
zh_cn: 所以现在如果你想做。

source: So until now we know, that we have to use <strong><code>-&gt;property[1]</code></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, hasta ahora sabemos que tenemos que usar </font></font><strong> <code>-&gt;property[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、これまでは、</font></font><strong> <code>-&gt;property[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があることがわかりました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 지금까지 우리는 </font></font><strong> <code>-&gt;property[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용해야한다는 것을 알고 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так что до сих пор мы знаем, что мы должны использовать </font></font><strong> <code>-&gt;property[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所以直到现在我们知道，我们必须使用</font></font><strong> <code>-&gt;property[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: So, you can take an array item values by the same way
es: Así que puedes tomar los valores de los elementos de una matriz de la misma manera
ja: ということで、配列の項目の値を取るには、同じように
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 같은 방법으로 배열 항목 값을 가져올 수 있습니다</font></font>
ru: Итак,вы можете взять значения элементов массива таким же образом.
zh_cn: 所以,你可以用同样的方法取一个数组项的值。

source: Sometimes you have characters in your keys, which you don't see on the first look in the browser. And then you're asking yourself, why you can't access the element. These characters can be: tabs (<code>\t</code>), new lines (<code>\n</code>), spaces or html tags (e.g. <code>&lt;/p&gt;</code>, <code>&lt;b&gt;</code>), etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A veces tienes caracteres en tus teclas, que no ves en la primera mirada en el navegador. </font><font style="vertical-align: inherit;">Y luego te preguntas por qu&eacute; no puedes acceder al elemento. </font><font style="vertical-align: inherit;">Estos caracteres pueden ser: pesta&ntilde;as ( </font></font> <code>\t</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), nuevas l&iacute;neas ( </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), espacios o etiquetas html (p. Ej. </font></font> <code>&lt;/p&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;b&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キーに文字が含まれていることがありますが、ブラウザの最初の表示では表示されません。</font><font style="vertical-align: inherit;">そして、あなたは自分自身に尋ねています、なぜあなたは要素にアクセスできないのですか？</font><font style="vertical-align: inherit;">これらの文字は、タブ（</font></font> <code>\t</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）、改行（</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）、スペース、またはhtmlタグ（例</font></font> <code>&lt;/p&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>&lt;b&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）などです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때로는 키에 문자가있어 브라우저에서 처음 볼 수 없습니다. </font><font style="vertical-align: inherit;">그런 다음 요소에 액세스 할 수없는 이유를 스스로에게 묻습니다. </font><font style="vertical-align: inherit;">이러한 문자는 탭 ( </font></font> <code>\t</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), 줄 바꿈 ( </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), 공백 또는 html 태그 (예 : </font></font> <code>&lt;/p&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;b&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) 등이 될 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иногда в ваших клавишах есть символы, которых вы не видите на первый взгляд в браузере. </font><font style="vertical-align: inherit;">А потом вы спрашиваете себя, почему вы не можете получить доступ к элементу. </font><font style="vertical-align: inherit;">Это могут быть символы табуляции ( </font></font> <code>\t</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), новые строки ( </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), пробелы или теги html (например, </font></font> <code>&lt;/p&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;b&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) и т. Д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有时，您的按键中包含字符，这些字符在浏览器的第一次外观中不会出现。</font><font style="vertical-align: inherit;">然后您要问自己，为什么无法访问该元素。</font><font style="vertical-align: inherit;">这些字符可以是：制表符（</font></font> <code>\t</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），换行（</font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），空格或html标记（例如</font></font> <code>&lt;/p&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>&lt;b&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）等。</font></font>

source: The trick here is to use <code>var_dump()</code> + look into your source code! (Alternative: <code>highlight_string(print_r($variable, TRUE));</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;El truco aqu&iacute; es usar </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + buscar en su c&oacute;digo fuente! </font><font style="vertical-align: inherit;">(Alternativa: </font></font> <code>highlight_string(print_r($variable, TRUE));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでの秘訣は</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用すること</font><font style="vertical-align: inherit;">です</font><font style="vertical-align: inherit;"> +ソースコードを調べてください！</font><font style="vertical-align: inherit;">（代替：</font></font> <code>highlight_string(print_r($variable, TRUE));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 트릭은 </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하고 </font><font style="vertical-align: inherit;">소스 코드를 살펴 보는 것입니다! </font><font style="vertical-align: inherit;">(대안 : </font></font> <code>highlight_string(print_r($variable, TRUE));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хитрость здесь в том, чтобы использовать </font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + заглянуть в ваш исходный код! </font><font style="vertical-align: inherit;">(Альтернатива: </font></font> <code>highlight_string(print_r($variable, TRUE));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里的技巧是使用</font></font> <code>var_dump()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> +查看源代码！</font><font style="vertical-align: inherit;">（可选：</font></font> <code>highlight_string(print_r($variable, TRUE));</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font></font>

source: Then you are trying to access the element with:
es: Entonces estás tratando de acceder al elemento con:
ja: とすると、要素にアクセスしようとしていることになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 다음을 사용하여 요소에 액세스하려고합니다.</font></font>
ru: Тогда вы пытаетесь получить доступ к элементу:
zh_cn: 那么,你是想用这个元素来访问。

source: There are a few things, which you have to know, so that you don't spend hours on it finding them.
es: Hay algunas cosas que debes saber para no pasar horas buscándolas.
ja: 知っておかなければならないことがいくつかあるので、それを見つけるのに何時間もかけないようにしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 가지 알아야 할 사항이 있으므로이를 찾는 데 몇 시간을 소비하지 않습니다.</font></font>
ru: Есть несколько вещей,которые вы должны знать,чтобы не тратить часы на их поиски.
zh_cn: 有一些东西,你必须知道,这样你就不会花几个小时的时间在上面找。

source: This is a good indication that there must be some hidden characters, since you can't access the element, even if the keys seems pretty correct.
es: Esto es un buen indicio de que debe haber algunos personajes ocultos,ya que no se puede acceder al elemento,aunque las claves parezcan bastante correctas.
ja: これは、キーがかなり正しいように見えても、要素にアクセスできないので、何か隠し文字があるに違いないことを示しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 키가 꽤 올바른 것처럼 보이더라도 요소에 액세스 할 수 없으므로 숨겨진 문자가 있어야 함을 나타냅니다.</font></font>
ru: Это хороший признак того,что должны быть какие-то скрытые символы,так как вы не можете получить доступ к элементу,даже если клавиши кажутся довольно правильными.
zh_cn: 这说明一定有一些隐藏的字符,因为你无法访问到这个元素,即使按键看起来很正确,但这也是一个很好的说明。

source: This means we have to use <code>-&gt;</code> to access the property of the object, e.g. <strong><code>-&gt;property</code></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto significa que tenemos que usar </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para acceder a la propiedad del objeto, por ejemplo, </font></font><strong> <code>-&gt;property</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり</font><font style="vertical-align: inherit;">、オブジェクトのプロパティにアクセス</font><font style="vertical-align: inherit;">するには</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要</font><font style="vertical-align: inherit;">があります（例：</font></font><strong> <code>-&gt;property</code> )</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉 </font><font style="vertical-align: inherit;">, 객체 속성에 액세스 </font><font style="vertical-align: inherit;">하기 위해 </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성 </font><font style="vertical-align: inherit;">을 사용해야 </font><font style="vertical-align: inherit;">합니다 (예 : </font></font><strong> <code>-&gt;property</code> )</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это означает, что мы должны использовать </font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для доступа к свойству объекта, например </font></font><strong> <code>-&gt;property</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这意味着我们必须使用</font></font> <code>-&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问对象的属性，例如</font></font><strong> <code>-&gt;property</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: This means we have to use <code>[]</code>/<code>{}</code> to access the value 2 with <strong><code>[1]</code></strong>, since the value has the key/index 1.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto significa que tenemos que usar </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para acceder al valor 2 con </font></font><strong> <code>[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , ya que el valor tiene la clave / &iacute;ndice 1.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font><font style="vertical-align: inherit;">、値がキー/インデックス1を持っているため、</font><strong> <code>[1]</code> </strong><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">値2にアクセス</font><font style="vertical-align: inherit;">するために</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があることを意味</font><font style="vertical-align: inherit;">します</font><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉 </font><font style="vertical-align: inherit;">, 값에 키 / 인덱스 1이 있으므로 </font><strong> <code>[1]</code> 으로</strong><font style="vertical-align: inherit;"> 값 2에 액세스 </font><font style="vertical-align: inherit;">하려면 </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это означает, что мы должны использовать </font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для доступа к значению 2 с помощью </font></font><strong> <code>[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поскольку значение имеет ключ / индекс 1.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这意味着我们必须使用</font></font> <code>[]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来通过</font></font><strong> <code>[1]</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问值2 </font><font style="vertical-align: inherit;">，因为该值具有键/索引1。</font></font>
