Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Port number is missing or wrong in JDBC URL.
es: El número de puerto falta o está equivocado en la URL de JDBC.
ja: JDBCのURLにポート番号がないか、間違っている。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC URL에서 포트 번호가 누락되었거나 잘못되었습니다.</font></font>
ru: Номер порта отсутствует или неправильно указан в JDBC URL.
zh_cn: JDBC URL中的端口号丢失或错误。

source: Probably there's some case, while <code>getConnection</code> can return <code>null</code> :)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Probablemente haya alg&uacute;n caso, mientras que </font></font> <code>getConnection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede devolver </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おそらくいくつかのケースがあり</font> <code>null</code> <font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">、</font></font> <code>getConnection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">null</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を返すことができ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;"> :)</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 </font></font> <code>getConnection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 반환 할 수 </font><font style="vertical-align: inherit;">있는 경우가 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;"> :)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вероятно, есть какой-то случай, в то время как </font></font> <code>getConnection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может вернуть </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可能有些情况，而</font></font> <code>getConnection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以返回</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ：）</font></font>

source: Refresh DNS or use IP address in JDBC URL instead.
es: Refresca el DNS o usa la dirección IP en la URL de JDBC en su lugar.
ja: DNSを更新するか、JDBC URLのIPアドレスを代わりに使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신 DNS를 새로 고치거나 JDBC URL에서 IP 주소를 사용하십시오.</font></font>
ru: Обновите DNS или используйте вместо этого IP-адрес в JDBC URL.
zh_cn: 刷新DNS或使用JDBC URL中的IP地址来代替。

source: Restart the DB and fix your code accordingly that it closes connections in <code>finally</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Reinicie la base de datos y corrija su c&oacute;digo en consecuencia para que </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cierre las conexiones </font><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DBを再起動し、</font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接続を閉じるようにコードを修正します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB를 다시 시작하고 </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연결을 닫도록 코드를 수정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Перезапустите БД и исправьте ваш код, чтобы он </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> закрыл соединения </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重新启动数据库并相应地修复代码，以</font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关闭连接</font><font style="vertical-align: inherit;">。</font></font>

source: Short and Sweet code.
es: Código corto y dulce.
ja: ショート&スウィートコーデ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">짧고 달콤한 코드.</font></font>
ru: Короткий и сладкий код.
zh_cn: 短小精悍的代码。

source: So the final URL should look like:
es: Así que la URL final debería ser como:
ja: なので、最終的なURLは以下のようになるはずです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최종 도착 URL은 다음과 같아야합니다.</font></font>
ru: Значит,окончательный URL должен выглядеть так:
zh_cn: 所以最终的URL应该是这样的。

source: Something in between Java and DB is blocking connections, e.g. a firewall or proxy.
es: Algo entre Java y la base de datos bloquea las conexiones,por ejemplo,un cortafuegos o un proxy.
ja: JavaとDBの間にある何かが、ファイアウォールやプロキシなどの接続をブロックしている。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java와 DB 사이에 방화벽이나 프록시와 같은 연결이 차단되고 있습니다.</font></font>
ru: Что-то между Java и БД блокирует соединения,например,брандмауэр или прокси-сервер.
zh_cn: 在Java和DB之间的东西会阻止连接,例如防火墙或代理。

source: Somewhere else in your code ...
es: En algún otro lugar de tu código...
ja: あなたのコードのどこか他の場所で...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드의 다른 곳에 ...</font></font>
ru: Где-то еще в твоем коде...
zh_cn: 在你的代码中的其他地方.....

source: Start the DB.
es: Comienza el DB.
ja: DBを起動します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB를 시작하십시오.</font></font>
ru: Запускай DB.
zh_cn: 启动数据库。

source: That was it as far the connectivity concerns. You can find <a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html">here</a> a more advanced tutorial how to load and store fullworthy Java model objects in a database with help of a basic DAO class.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso fue todo lo que concierne a la conectividad. </font><font style="vertical-align: inherit;">Puede encontrar </font></font><a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> un tutorial m&aacute;s avanzado sobre c&oacute;mo cargar y almacenar objetos de modelo Java en una base de datos con la ayuda de una clase DAO b&aacute;sica.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接続性に関する限り、これで終わりです。</font></font><a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、基本的なDAOクラスを使用して、価値のあるJavaモデルオブジェクトをデータベースにロードおよび格納する方法についてのより高度なチュートリアルを</font><font style="vertical-align: inherit;">見つけることができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연결성 문제까지는 그 정도였습니다. </font><font style="vertical-align: inherit;">당신은 찾을 수 있습니다 </font></font><a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기본 DAO 클래스의 도움으로 데이터베이스에 자바 모델 객체 fullworthy 더 진보 된 방법을로드하는 튜토리얼 및 저장합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это было что касается связи. </font><font style="vertical-align: inherit;">Вы можете найти </font></font><a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> более продвинутый учебник, как загружать и хранить полноценные объекты модели Java в базе данных с помощью базового класса DAO.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就连接性而言，仅此而已。</font><font style="vertical-align: inherit;">您可以在</font></font><a href="http://balusc.blogspot.com/2008/07/dao-tutorial-data-layer.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到</font><font style="vertical-align: inherit;">更高级的教程，该教程如何在基本DAO类的帮助下将有价值的Java模型对象加载和存储在数据库中。</font></font>

source: The <code>.</code> is just there to add the <em>current</em> directory to the classpath as well so that it can locate <code>com.example.YourClass</code> and the <code>;</code> is the classpath separator as it is in Windows. In Unix and clones <code>:</code> should be used.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solo est&aacute; all&iacute; para agregar el </font><font style="vertical-align: inherit;">directorio </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">actual</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al classpath para que pueda localizar </font></font> <code>com.example.YourClass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es el separador de classpath tal como est&aacute; en Windows. </font><font style="vertical-align: inherit;">En Unix y clones </font></font> <code>:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe usarse.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>.</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクトリをクラスパス</font><font style="vertical-align: inherit;">に追加する</font><font style="vertical-align: inherit;">ためだけにあるので、</font></font> <code>com.example.YourClass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>;</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つけることができます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">Windowsと同じようにクラスパス区切り文字です。</font><font style="vertical-align: inherit;">Unixとクローンでは</font></font> <code>:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>.</code> <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 디렉토리를 클래스 경로 </font><font style="vertical-align: inherit;">에 추가하여 </font></font> <code>com.example.YourClass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows에서와 같이 클래스 경로 구분 기호입니다. </font><font style="vertical-align: inherit;">유닉스와 클론에서는 </font></font> <code>:</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">просто добавить </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">текущий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> каталог в classpath, чтобы он мог найти </font></font> <code>com.example.YourClass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является разделителем пути к классам, как в Windows. </font><font style="vertical-align: inherit;">В Unix и клонах </font></font> <code>:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> следует использовать.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只是将</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当前</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">目录</font><font style="vertical-align: inherit;">也添加</font><font style="vertical-align: inherit;">到类路径中，以便它可以找到</font></font> <code>com.example.YourClass</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是Windows中的类路径分隔符。</font><font style="vertical-align: inherit;">在Unix和clones中</font></font> <code>:</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该使用。</font></font>

source: The properties object hold the connection information, check if it is already set.
es: El objeto de propiedades contiene la información de la conexión,comprueba si ya está establecida.
ja: propertiesオブジェクトは接続情報を保持しており、既に設定されているかどうかを確認します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 개체는 연결 정보를 보유하고 있으며 이미 설정되어 있는지 확인하십시오.</font></font>
ru: Объект "Свойства" содержит информацию о соединении,проверьте,не установлено ли оно уже.
zh_cn: 属性对象持有的连接信息,检查是否已经设置好了。

source: This is all <strong>:)</strong> If anything to improve edit it! Hope this is helpful.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto es todo </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Si hay algo para mejorar, ed&iacute;talo! </font><font style="vertical-align: inherit;">Espero que esto sea &uacute;til.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これがすべてです</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">改善すべきことがあれば編集してください！</font><font style="vertical-align: inherit;">これがお役に立てば幸いです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 모두입니다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 개선해야 할 것이 있으면 편집하십시오! </font><font style="vertical-align: inherit;">이것이 도움이 되길 바랍니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это все </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Если что-то улучшить, отредактируйте его! </font><font style="vertical-align: inherit;">Надеюсь, это полезно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这就是所有</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">:)</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果有任何改进之处，请编辑！</font><font style="vertical-align: inherit;">希望这会有所帮助。</font></font>

source: To set up the CLASSPATH
es: Para establecer el CLASSPATH
ja: CLASSPATHを設定するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CLASSPATH를 설정하려면</font></font>
ru: Чтобы настроить CLASSPATH
zh_cn: 要设置CLASSPATH

source: To set up the Driver to run a quick sample
es: Para configurar el controlador para ejecutar una muestra rápida
ja: クイックサンプルを実行するためのドライバを設定するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빠른 샘플을 실행하도록 드라이버를 설정하려면</font></font>
ru: Чтобы настроить драйвер на запуск быстрого образца
zh_cn: 设置驱动程序以运行快速样本

source: To solve the one or the other, follow the following advices:
es: Para resolver una u otra,siga los siguientes consejos:
ja: どちらか一方を解決するには、以下のアドバイスに従ってください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">둘 중 하나를 해결하려면 다음 조언을 따르십시오.</font></font>
ru: Чтобы решить тот или иной вопрос,следуйте следующим советам:
zh_cn: 要想解决这个或那个,请按照下面的建议来解决。

source: Unzip the files and move to C:\ drive. Your driver path should be like <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Descomprima los archivos y mu&eacute;vase a C: \ drive. </font><font style="vertical-align: inherit;">La ruta del controlador debe ser como </font></font> <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ファイルを解凍し、C：\ドライブに移動します。</font><font style="vertical-align: inherit;">ドライバーのパスは、</font></font> <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일의 압축을 풀고 C : \ 드라이브로 이동하십시오. </font><font style="vertical-align: inherit;">드라이버 경로는 </font></font> <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Разархивируйте файлы и перейдите на диск C: \. </font><font style="vertical-align: inherit;">Ваш путь к драйверу должен быть таким </font></font> <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解压缩文件并移动到C：\驱动器。</font><font style="vertical-align: inherit;">您的驱动程序路径应类似于</font></font> <code>C:\mysql-connector-java-8.0.19\mysql-connector-java-8.0.19</code>

source: Use this class <code>MysqlConnect</code> directly after changing database_name, username and password etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice esta clase </font></font> <code>MysqlConnect</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directamente despu&eacute;s de cambiar el nombre de la base de datos, el nombre de usuario y la contrase&ntilde;a, etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">database_name、ユーザー名、パスワードなどを変更した直後に、</font><font style="vertical-align: inherit;">このクラス</font></font> <code>MysqlConnect</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">database_name, username 및 password 등을 변경 한 </font></font> <code>MysqlConnect</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 </font><font style="vertical-align: inherit;">MysqlConnect를</font><font style="vertical-align: inherit;"> 직접 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте этот класс </font></font> <code>MysqlConnect</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сразу после изменения </font><font style="vertical-align: inherit;">имени_базы</font><font style="vertical-align: inherit;"> данных, имени пользователя и пароля и т. Д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改数据库名称，用户名和密码等后，直接</font><font style="vertical-align: inherit;">使用此类</font></font> <code>MysqlConnect</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
