Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you're doing it "plain vanilla" in the command console, then you need to specify the path to the JAR file in the <code>-cp</code> or <code>-classpath</code> argument when executing your Java application.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si lo est&aacute; haciendo "vainilla simple" en la consola de comandos, entonces debe especificar la ruta al archivo JAR en el </font><font style="vertical-align: inherit;">argumento </font></font> <code>-cp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>-classpath</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cuando ejecute su aplicaci&oacute;n Java.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドコンソールで「プレーンバニラ」で</font><font style="vertical-align: inherit;">実行している場合は、Javaアプリケーションを実行するとき</font><font style="vertical-align: inherit;">に、</font></font> <code>-cp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>-classpath</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引数</font><font style="vertical-align: inherit;">でJARファイルへのパスを指定する必要があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명령 콘솔에서 "일반 바닐라"를 </font><font style="vertical-align: inherit;">수행하는 경우 Java 애플리케이션을 실행할 때 </font></font> <code>-cp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>-classpath</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인수 </font><font style="vertical-align: inherit;">에서 JAR 파일의 경로를 지정해야 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы делаете это &laquo;простой ванили&raquo; в командной консоли, то вам необходимо указать путь к файлу JAR в </font></font> <code>-cp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>-classpath</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> аргумента при выполнении приложения Java.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果在命令控制台中执行&ldquo;普通香草&rdquo;操作，则</font><font style="vertical-align: inherit;">在执行Java应用程序时</font><font style="vertical-align: inherit;">需要在</font></font> <code>-cp</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>-classpath</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数中</font><font style="vertical-align: inherit;">指定JAR文件的路径</font><font style="vertical-align: inherit;">。</font></font>

source: If you're using an IDE like Eclipse or Netbeans, then you can add it to the classpath by adding the JAR file as <em>Library</em> to the <em>Build Path</em> in project's properties.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; utilizando un IDE como Eclipse o Netbeans, puede agregarlo a la ruta de clase agregando el archivo JAR como </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Biblioteca</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruta de compilaci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en las propiedades del proyecto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはEclipseやNetbeansのようなIDEを使用している場合は、としてJARファイルを追加することにより、クラスパスに追加することができ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ライブラリ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ビルド・パス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロジェクトのプロパティインチ</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eclipse 또는 Netbeans와 같은 IDE를 사용하는 경우 JAR 파일을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">라이브러리</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 </font><font style="vertical-align: inherit;">프로젝트 특성 </font><font style="vertical-align: inherit;">의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빌드 경로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><em><font style="vertical-align: inherit;">라이브러리</font></em><font style="vertical-align: inherit;"> 로 </font><font style="vertical-align: inherit;">추가하여 클래스 경로에 추가 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете IDE, такую ​​как Eclipse или Netbeans, вы можете добавить ее в </font><em><font style="vertical-align: inherit;">путь</font></em><font style="vertical-align: inherit;"> к классам, добавив файл JAR в качестве </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">библиотеки</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">путь сборки</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в свойствах проекта.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果使用的是Eclipse或Netbeans之类的IDE，则可以通过将JAR文件作为</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">库</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加</font><font style="vertical-align: inherit;">到</font><font style="vertical-align: inherit;">项目属性中</font><font style="vertical-align: inherit;">的&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">构建路径&rdquo;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">将其添加到类</font><em><font style="vertical-align: inherit;">路径</font></em><font style="vertical-align: inherit;">中。</font></font>

source: In the above command, I have set the CLASSPATH to the current folder and mysql-connector-java-VERSION.jar file. So when the <code>java MyClassFile</code> command executed, java application launcher will try to load all the Java class in CLASSPATH. And it found the <code>Drive</code> class =&gt; BOOM errors was gone.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el comando anterior, configur&eacute; CLASSPATH en la carpeta actual y el archivo mysql-connector-java-VERSION.jar. </font><font style="vertical-align: inherit;">Entonces, cuando se </font></font> <code>java MyClassFile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comando </font><font style="vertical-align: inherit;">java MyClassFile,</font><font style="vertical-align: inherit;"> el </font><font style="vertical-align: inherit;">iniciador de</font><font style="vertical-align: inherit;"> aplicaciones java intentar&aacute; cargar toda la clase Java en CLASSPATH. </font><font style="vertical-align: inherit;">Y descubri&oacute; que la </font><font style="vertical-align: inherit;">clase de </font></font> <code>Drive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> =&gt; errores de BOOM hab&iacute;a desaparecido.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のコマンドでは、CLASSPATHを現在のフォルダーとmysql-connector-java-VERSION.jarファイルに設定しています。</font><font style="vertical-align: inherit;">したがって、</font></font> <code>java MyClassFile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドが実行されると、JavaアプリケーションランチャーはCLASSPATH内のすべてのJavaクラスをロードしようとします。</font><font style="vertical-align: inherit;">そして、</font></font> <code>Drive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス=&gt; BOOMエラーがなくなった</font><font style="vertical-align: inherit;">ことがわかりました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 명령에서 CLASSPATH를 현재 폴더 및 mysql-connector-java-VERSION.jar 파일로 설정했습니다. </font><font style="vertical-align: inherit;">따라서 </font></font> <code>java MyClassFile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 실행될 </font><font style="vertical-align: inherit;">때 </font><font style="vertical-align: inherit;">, Java 애플리케이션 실행기는 모든 Java 클래스를 CLASSPATH에로드하려고 시도합니다. </font><font style="vertical-align: inherit;">그리고 </font></font> <code>Drive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 =&gt; BOOM 오류가 사라졌습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В приведенной выше команде я установил для CLASSPATH текущую папку и файл mysql-connector-java-VERSION.jar. </font><font style="vertical-align: inherit;">Поэтому при выполнении команды </font></font> <code>java MyClassFile</code> модуль<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> запуска приложений java попытается загрузить все классы Java в CLASSPATH. </font><font style="vertical-align: inherit;">И он обнаружил, что </font></font> <code>Drive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> class =&gt; BOOM ошибки исчезли.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在上面的命令中，我将CLASSPATH设置为当前文件夹和mysql-connector-java-VERSION.jar文件。</font><font style="vertical-align: inherit;">因此，当执行</font></font> <code>java MyClassFile</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令时，Java应用程序启动器将尝试在CLASSPATH中加载所有Java类。</font><font style="vertical-align: inherit;">它发现</font></font> <code>Drive</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类=&gt; BOOM错误消失了。</font></font>

source: Initialize Connection and Properties
es: Iniciar la conexión y las propiedades
ja: 接続とプロパティの初期化
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연결 및 속성 초기화</font></font>
ru: Инициализировать Подключение и Свойства
zh_cn: 初始化连接和属性

source: Initialize database constants
es: Inicializar las constantes de la base de datos
ja: データベース定数の初期化
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스 상수 초기화</font></font>
ru: Инициализировать константы БД
zh_cn: 初始化数据库常数

source: Initialize the database class.
es: Inicie la clase de la base de datos.
ja: データベースクラスを初期化します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스 클래스를 초기화하십시오.</font></font>
ru: Инициализируйте класс базы данных.
zh_cn: 初始化数据库类。

source: Method 1: set the CLASSPATH variable.
es: Método 1:establecer la variable CLASSPATH.
ja: 方法1:CLASSPATH変数を設定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법 1 : CLASSPATH 변수를 설정하십시오.</font></font>
ru: Метод 1:установите переменную CLASSPATH.
zh_cn: 方法1:设置CLASSPATH变量。

source: Method 2:
es: Método 2:
ja: 方法2.
ko: 방법 2 :
ru: Метод 2:
zh_cn: 方法二:

source: MySQL JDBC Connection with useSSL.
es: Conexión MySQL JDBC con useSSL.
ja: useSSLでMySQLのJDBC接続。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">useSSL을 사용한 MySQL JDBC 연결.</font></font>
ru: MySQL JDBC Соединение с помощью useSSL.
zh_cn: MySQL JDBC连接与使用SSL。

source: MySql JDBC Connection:
es: Conexión MySql JDBC:
ja: MySql JDBC 接続。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySql JDBC 연결 :</font></font>
zh_cn: MySql JDBC连接。
