Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that closing the <code>Connection</code> is <strong>extremely</strong> important. If you don't close connections and keep getting a lot of them in a short time, then the database may run out of connections and your application may break. Always acquire the <code>Connection</code> in a <a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"><code>try-with-resources</code> statement</a>. Or if you're not on Java 7 yet, explicitly close it in <code>finally</code> of a <code>try-finally</code> block. Closing in <code>finally</code> is just to ensure that it get closed as well in case of an exception. This also applies to <code>Statement</code>, <code>PreparedStatement</code> and <code>ResultSet</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que cerrar la </font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">extremadamente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> importante. Si no cierra las conexiones y sigue obteniendo muchas en poco tiempo, la base de datos puede quedarse sin conexiones y su aplicaci&oacute;n puede fallar. Adquiera siempre la </font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en una </font><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"><font style="vertical-align: inherit;">declaraci&oacute;n de </font></a></font> <code>try-with-resources</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . O si a&uacute;n no est&aacute; en Java 7, ci&eacute;rrelo expl&iacute;citamente </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en un </font><font style="vertical-align: inherit;">bloque </font></font> <code>try-finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Cerrar </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es solo para asegurarse de que tambi&eacute;n se cierre en caso de una excepci&oacute;n. Esto tambi&eacute;n se aplica a </font></font> <code>Statement</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>PreparedStatement</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>ResultSet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を閉じること</font><font style="vertical-align: inherit;">は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常に</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重要です。接続を閉じずに短時間で多くの接続を取得し続けると、データベースの接続が不足し、アプリケーションが破損する可能性があります。</font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">常に</font></font><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"> <code>try-with-resources</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">取得し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。または、Java 7をまだ使用していない場合</font><font style="vertical-align: inherit;">は、</font> <code>try-finally</code> <font style="vertical-align: inherit;">ブロックの</font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">明示的に閉じ</font><font style="vertical-align: inherit;">ます。</font> <code>finally</code> <font style="vertical-align: inherit;">閉じる</font><font style="vertical-align: inherit;">ことは、例外が発生した場合にも確実に閉じることです。これは、</font> <code>Statement</code> <font style="vertical-align: inherit;">、</font> <code>PreparedStatement</code> <font style="vertical-align: inherit;">、および</font> <code>ResultSet</code> に<font style="vertical-align: inherit;">も適用され</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 닫는 </font><font style="vertical-align: inherit;">것이 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 중요합니다. 연결을 닫지 않고 짧은 시간 안에 많은 연결을 유지하면 데이터베이스 연결이 끊어지고 응용 프로그램이 중단 될 수 있습니다. 항상 </font><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"> <code>try-with-resources</code> </a><font style="vertical-align: inherit;"> 문</font><font style="vertical-align: inherit;"> 에서 </font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">확보하십시오 </font><font style="vertical-align: inherit;">. 또는 명시 적으로 가까운 거기에 아직 자바 7에하지 않으면 </font> <code>finally</code> <font style="vertical-align: inherit;"> (A)의 </font> <code>try-finally</code> <font style="vertical-align: inherit;"> 블록. </font> <code>finally</code> <font style="vertical-align: inherit;"> 닫는 </font><font style="vertical-align: inherit;">것은 예외가 발생했을 때도 닫히는 것입니다. 이것은 </font> <code>Statement</code> <font style="vertical-align: inherit;"> , </font> <code>PreparedStatement</code> <font style="vertical-align: inherit;"> 및 </font> <code>ResultSet</code> <font style="vertical-align: inherit;"> 에도 적용됩니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание , </font><font style="vertical-align: inherit;">что закрытие </font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чрезвычайно</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> важным. Если вы не закрываете соединения и продолжаете получать их в течение короткого времени, то в базе данных могут не хватить соединений, и ваше приложение может разорваться. Всегда устанавливайте </font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"><font style="vertical-align: inherit;">инструкции </font></a></font> <code>try-with-resources</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Или , </font><font style="vertical-align: inherit;">если вы не на Java-пока, явно близко он в </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font> <code>try-finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , блока. </font></font> <code>finally</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> закрытие </font><font style="vertical-align: inherit;">- это просто гарантия того, что оно также будет закрыто в случае исключения. Это также относится к </font></font> <code>Statement</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>PreparedStatement</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ResultSet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">需要注意的是关闭</font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重要的。如果您不关闭连接并在短时间内保持大量连接，则数据库可能会用尽连接，您的应用程序可能会中断。始终</font><font style="vertical-align: inherit;">在</font><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html"> <code>try-with-resources</code> </a><font style="vertical-align: inherit;">语句中</font><font style="vertical-align: inherit;">获取</font></font> <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。或者，如果您尚未使用Java 7，请在</font> <code>finally</code> <font style="vertical-align: inherit;">的</font> <code>try-finally</code> <font style="vertical-align: inherit;">块中</font><font style="vertical-align: inherit;">明确关闭它</font><font style="vertical-align: inherit;">。</font> <code>finally</code> <font style="vertical-align: inherit;">关闭</font><font style="vertical-align: inherit;">只是为了确保在发生异常时也将其关闭。这也适用于</font> <code>Statement</code> <font style="vertical-align: inherit;">，</font> <code>PreparedStatement</code> <font style="vertical-align: inherit;">和</font> <code>ResultSet</code> <font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Note that the <code>newInstance()</code> call is <strong>not</strong> needed here. It's just to fix the old and buggy <code>org.gjt.mm.mysql.Driver</code>. <a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236">Explanation here</a>. If this line throws <code>ClassNotFoundException</code>, then the JAR file containing the JDBC driver class is simply not been placed in the classpath.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que la </font><font style="vertical-align: inherit;">llamada </font></font> <code>newInstance()</code> <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font><font style="vertical-align: inherit;">necesaria aqu&iacute;. </font><font style="vertical-align: inherit;">Es solo para arreglar el viejo y </font></font> <code>org.gjt.mm.mysql.Driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Explicaci&oacute;n aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si esta l&iacute;nea arroja </font></font> <code>ClassNotFoundException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , entonces el archivo JAR que contiene la clase de controlador JDBC simplemente no se coloca en el classpath.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは</font></font> <code>newInstance()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出しは</font><font style="vertical-align: inherit;">必要</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ない</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことに注意して</font><font style="vertical-align: inherit;">ください。</font><font style="vertical-align: inherit;">古いバグの多い</font></font> <code>org.gjt.mm.mysql.Driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を修正するだけ</font><font style="vertical-align: inherit;">です</font><font style="vertical-align: inherit;">。</font></font><a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明はこちら</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この行が</font></font> <code>ClassNotFoundException</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スローする場合</font><font style="vertical-align: inherit;">、JDBCドライバークラスを含むJARファイルはクラスパスに配置されません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">점을 유의 </font></font> <code>newInstance()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출이되어 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있지</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여기가 필요했습니다. </font><font style="vertical-align: inherit;">오래되고 버그가 </font></font> <code>org.gjt.mm.mysql.Driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 수정하는 </font><font style="vertical-align: inherit;">것</font><font style="vertical-align: inherit;"> 입니다. </font></font><a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 설명하십시오</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이 행이 </font></font> <code>ClassNotFoundException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 발생 시키면 JDBC 드라이버 클래스를 포함하는 JAR 파일이 단순히 클래스 경로에 배치되지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font><font style="vertical-align: inherit;">вызов </font></font> <code>newInstance()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> здесь </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> нужен. </font><font style="vertical-align: inherit;">Это просто исправить старый и </font></font> <code>org.gjt.mm.mysql.Driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Объяснение здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если в этой строке </font></font> <code>ClassNotFoundException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то файл JAR, содержащий класс драйвера JDBC, просто не помещается в путь к классам.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font> <code>newInstance()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被调用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此需要。</font><font style="vertical-align: inherit;">这只是为了修复老旧的</font></font> <code>org.gjt.mm.mysql.Driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><a href="https://stackoverflow.com/questions/2092659/what-is-difference-between-class-forname-and-class-forname-newinstance/2093236#2093236"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里解释</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果此行引发</font></font> <code>ClassNotFoundException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则根本不会将包含JDBC驱动程序类的JAR文件放置在类路径中。</font></font>

source: Note that you don't need to load the driver <strong>everytime</strong><em>before</em> connecting. Just only once during application startup is enough.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que no necesita cargar el controlador </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cada vez </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">antes de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> conectarse. </font><font style="vertical-align: inherit;">Solo una vez durante el inicio de la aplicaci&oacute;n es suficiente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接続する</font><em><font style="vertical-align: inherit;">前に</font></em></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">毎回</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドライバーをロードする必要がないことに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">アプリケーションの起動時に一度だけで十分です。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연결 </font><em><font style="vertical-align: inherit;">하기 전에 </font></em></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매번</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 드라이버를로드 할 필요는 없습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">응용 프로그램 시작 중 한 번만으로 충분합니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что вам не нужно загружать драйвер </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">каждый раз </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">перед</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> подключением. </font><font style="vertical-align: inherit;">Достаточно всего один раз при запуске приложения.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，您不需要</font><em><font style="vertical-align: inherit;">在</font></em><font style="vertical-align: inherit;">连接</font><em><font style="vertical-align: inherit;">之前</font></em></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每次都</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加载驱动程序</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在应用程序启动期间仅一次就足够了。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: Now connect to database using the constants and properties initialized.
es: Ahora conéctese a la base de datos usando las constantes y propiedades inicializadas.
ja: これで、初期化された定数とプロパティを使用してデータベースに接続します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 초기화 된 상수와 속성을 사용하여 데이터베이스에 연결하십시오.</font></font>
ru: Теперь подключитесь к базе данных,используя инициализированные константы и свойства.
zh_cn: 现在使用常量和属性初始化后连接到数据库。

source: Once the connection is established, it is better to store for reuse purpose.
es: Una vez que se establece la conexión,es mejor almacenar para su reutilización.
ja: 接続が確立されたら、再利用目的で保管した方が良いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연결이 설정되면 재사용 목적으로 보관하는 것이 좋습니다.</font></font>
ru: После установления соединения лучше хранить для повторного использования.
zh_cn: 一旦建立了连接,最好是储存起来,以备再利用。

source: Once you are done with database operations, just close the connection.
es: Una vez que termines con las operaciones de la base de datos,cierra la conexión.
ja: データベースの操作が終わったら、あとは接続を閉じるだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스 작업이 끝나면 연결을 닫으십시오.</font></font>
ru: Как только вы закончите работу с базой данных,просто закройте соединение.
zh_cn: 一旦你完成了数据库操作,只需关闭连接即可。

source: Or something like in that way :)
es: O algo así como de esa manera :)
ja: とかそんな感じで :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아니면 그런 식으로 :)</font></font>
ru: Или что-то в этом роде :)
zh_cn: 或类似这样的东西:)
