Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>Create a <a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html">database</a> in MySQL</strong>. Let's create a database <code>javabase</code>. You of course want World Domination, so let's use UTF-8 as well.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Crea una </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">base</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">datos</font><font style="vertical-align: inherit;"> en MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Vamos a crear una base de datos </font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Por supuesto, quieres World Domination, as&iacute; que usemos UTF-8 tambi&eacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLで</font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">データベース</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">作成</font><font style="vertical-align: inherit;">します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">データベース</font></font> <code>javabase</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作成しましょう</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">もちろん世界制覇を望んでいるので、UTF-8も使用しましょう。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL </font><font style="vertical-align: inherit;">에서 </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">데이터베이스 </font></font> <code>javabase</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 작성하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">물론 World Domination을 원하니 UTF-8도 사용하자.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Создайте </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">базу данных</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Давайте создадим базу данных </font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вы, конечно, хотите World Domination, так что давайте также использовать UTF-8.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在MySQL中</font><font style="vertical-align: inherit;">创建一个</font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/create-database.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数据库</font></font></a><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">让我们创建一个数据库</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您当然想要世界统治，所以我们也要使用UTF-8。</font></font>

source: <strong>Download JDBC Driver</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Descargar JDBC Driver</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC Driverをダウンロード</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC 드라이버 다운로드</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Скачать драйвер JDBC</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载JDBC驱动程序</font></font></strong>

source: <strong>Move JDBC Driver to C Drive</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mueva el controlador JDBC a la unidad C</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBCドライバーをCドライブに移動</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC 드라이버를 C 드라이브로 이동</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Переместить драйвер JDBC на диск C</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将JDBC驱动程序移动到C驱动器</font></font></strong>

source: <strong>Run Your Java</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejecute su Java</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaを実行する</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신의 자바를 실행</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Запустите свою Java</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">运行您的Java</font></font></strong>

source: <strong>Short Code</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&oacute;digo corto</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ショートコード</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">짧은 코드</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Короткий номер</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">短代码</font></font></strong>

source: Add exception handling, configuration etc. to taste.
es: Añade el manejo de excepciones,la configuración,etc.a tu gusto.
ja: 例外処理や設定などを好みに合わせて追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">취향에 맞게 예외 처리, 구성 등을 추가하십시오.</font></font>
ru: Добавьте обработку исключений,настройку и т.д.по вкусу.
zh_cn: 增加异常处理,配置等,以满足用户的口味。

source: Connect Java to a MySQL database
es: Conectar Java a una base de datos MySQL
ja: JavaをMySQLデータベースに接続する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java를 MySQL 데이터베이스에 연결</font></font>
ru: Подключение Java к базе данных MySQL
zh_cn: 将Java连接到MySQL数据库

source: Connect the Database
es: Conectar la base de datos
ja: データベースを接続する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스 연결</font></font>
ru: Подключить базу данных
zh_cn: 连接数据库

source: Create Properties
es: Crear propiedades
ja: プロパティの作成
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 만들기</font></font>
ru: Создать недвижимость
zh_cn: 创建属性

source: Create constant properties database username, password, URL and drivers, polling limit etc.
es: Crear una base de datos de propiedades constantes con nombre de usuario,contraseña,URL y controladores,límite de votación,etc.
ja: データベースのユーザー名、パスワード、URLとドライバ、ポーリング制限などの定数プロパティを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상수 속성 데이터베이스 사용자 이름, 비밀번호, URL 및 드라이버, 폴링 제한 등을 작성하십시오.</font></font>
ru: Создайте постоянное имя пользователя базы данных свойств,пароль,URL и драйверы,лимит опроса и т.д.
zh_cn: 创建常量属性数据库的用户名、密码、URL和驱动程序、投票限制等。

source: DB server doesn't accept TCP/IP connections.
es: El servidor de la base de datos no acepta conexiones TCPIP.
ja: DBサーバはTCPIP接続を受け付けません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB 서버는 TCP / IP 연결을 허용하지 않습니다.</font></font>
ru: Сервер БД не принимает TCPIP-соединения.
zh_cn: DB服务器不接受TCPIP连接。

source: DB server has run out of connections.
es: El servidor de la base de datos se ha quedado sin conexiones.
ja: DBサーバの接続数が不足しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB 서버에 연결이 부족합니다.</font></font>
ru: На сервере БД закончились соединения.
zh_cn: DB服务器已经用完了连接。

source: DB server is down.
es: El servidor de la base de datos está caído.
ja: DBサーバがダウンしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB 서버가 다운되었습니다.</font></font>
ru: Сервер БД не работает.
zh_cn: DB服务器瘫痪了。

source: Disable firewall and/or configure firewall/proxy to allow/forward the port.
es: Deshabilite el cortafuegos y/o configure el firewallproxy para permitir el reenvío del puerto.
ja: ファイアウォールを無効にするか、ポートを許可するようにファイアウォールプロキシを設定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방화벽을 비활성화하거나 포트를 허용 / 전달하도록 방화벽 / 프록시를 구성하십시오.</font></font>
ru: Отключите брандмауэр или настройте Firewallproxy,чтобы разрешить переадресацию порта.
zh_cn: 禁用防火墙,或配置firewallproxy,允许转发端口。

source: Disconnect the database
es: Desconecte la base de datos
ja: データベースの接続を解除する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스 연결 끊기</font></font>
ru: Отключить базу данных
zh_cn: 断开数据库的连接

source: Download link (Select platform independent): <a href="https://dev.mysql.com/downloads/connector/j/">https://dev.mysql.com/downloads/connector/j/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Enlace de descarga (Seleccione plataforma independiente): </font></font><a href="https://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://dev.mysql.com/downloads/connector/j/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ダウンロードリンク（プラットフォームに依存しない選択）：</font><a href="https://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//dev.mysql.com/downloads/connector/j/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다운로드 링크 (일부 플랫폼 독립적) : </font></font><a href="https://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://dev.mysql.com/downloads/connector/j/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ссылка для скачивания (выберите платформу независимо): </font></font><a href="https://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://dev.mysql.com/downloads/connector/j/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载链接（选择独立于平台的链接）：</font><a href="https://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//dev.mysql.com/downloads/connector/j/</font></font>

source: Everything together
es: Todo junto
ja: すべて一緒に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모두 함께</font></font>
ru: Все вместе
zh_cn: 一切都在一起

source: For SQL server 2012
es: Para el servidor SQL 2012
ja: SQLサーバー2012の場合
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQL Server 2012의 경우</font></font>
ru: Для SQL-сервера 2012
zh_cn: 对于SQL server 2012

source: Here's a step by step explanation how to install MySQL and JDBC and how to use it:
es: Aquí hay una explicación paso a paso de cómo instalar MySQL y JDBC y cómo usarlos:
ja: ここでは、MySQLとJDBCのインストール方法や使い方を順を追って解説していきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 MySQL 및 JDBC 설치 방법 및 사용 방법에 대한 단계별 설명입니다.</font></font>
ru: Вот пошаговое объяснение,как установить MySQL и JDBC и как его использовать:
zh_cn: 下面就一步步讲解如何安装MySQL和JDBC以及如何使用。

source: Here's the very minimum you need to get data out of a MySQL database:
es: Esto es lo mínimo que necesitas para obtener datos de una base de datos MySQL:
ja: MySQLデータベースからデータを取り出すために最低限必要なものは以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 MySQL 데이터베이스에서 데이터를 가져 오는 데 필요한 최소값입니다.</font></font>
ru: Вот самый минимум,который необходим для получения данных из базы данных MySQL:
zh_cn: 这里是你从MySQL数据库中获取数据的最起码条件。

source: Hope this can help someone!
es: ¡Espero que esto pueda ayudar a alguien!
ja: 誰かのお役に立てるといいですね
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 누군가를 도울 수 있기를 바랍니다!</font></font>
ru: Надеюсь,это кому-нибудь поможет!
zh_cn: 希望这能帮助到某人!

source: Hostname in JDBC URL is not recognized by local DNS server.
es: El nombre de host en la URL de JDBC no es reconocido por el servidor DNS local.
ja: JDBC URLのホスト名がローカルDNSサーバに認識されない。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로컬 DNS 서버가 JDBC URL의 호스트 이름을 인식하지 못합니다.</font></font>
ru: Имя хоста в JDBC URL не распознается локальным DNS-сервером.
zh_cn: JDBC URL中的主机名不被本地DNS服务器识别。

source: How do you connect to a MySQL database in Java?
es: ¿Cómo te conectas a una base de datos MySQL en Java?
ja: JavaでMySQLデータベースに接続する方法は?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java에서 MySQL 데이터베이스에 어떻게 연결합니까?</font></font>
ru: Как подключиться к базе данных MySQL на Java?
zh_cn: 如何在Java中连接到MySQL数据库?

source: How to Use?
es: ¿Cómo se usa?
ja: 使い方は?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용하는 방법?</font></font>
ru: Как пользоваться?
zh_cn: 如何使用?

source: IP address or hostname in JDBC URL is wrong.
es: La dirección IP o el nombre de host en la URL de JDBC es errónea.
ja: JDBC URLのIPアドレスまたはホスト名が間違っている。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC URL의 IP 주소 또는 호스트 이름이 잘못되었습니다.</font></font>
ru: IP-адрес или имя хоста в JDBC URL неправильный.
zh_cn: JDBC URL中的IP地址或主机名错误。

source: If you get a <code>SQLException: Connection refused</code> or <code>Connection timed out</code> or a MySQL specific <code>CommunicationsException: Communications link failure</code>, then it means that the DB isn't reachable at all. This can have one or more of the following causes:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si obtiene una </font></font> <code>SQLException: Connection refused</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o la </font></font> <code>Connection timed out</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o una excepci&oacute;n de </font></font> <code>CommunicationsException: Communications link failure</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> espec&iacute;fica de MySQL </font><font style="vertical-align: inherit;">: falla del enlace de comunicaciones</font><font style="vertical-align: inherit;"> , significa que no se puede acceder a la base de datos. </font><font style="vertical-align: inherit;">Esto puede tener una o m&aacute;s de las siguientes causas:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたが取得する場合</font></font> <code>SQLException: Connection refused</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">か</font></font> <code>Connection timed out</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">かMySQLの特定の</font></font> <code>CommunicationsException: Communications link failure</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、それはDBがすべてでは到達できないことを意味します。</font><font style="vertical-align: inherit;">これには、次の1つ以上の原因が考えられます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 얻을 경우 </font></font> <code>SQLException: Connection refused</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>Connection timed out</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 MySQL의 특정의 </font></font> <code>CommunicationsException: Communications link failure</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 다음은 DB가 전혀 도달 할 수없는 것을 의미한다. </font><font style="vertical-align: inherit;">다음 원인 중 하나 이상이 발생할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы получаете </font></font> <code>SQLException: Connection refused</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>Connection timed out</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или специфическое для MySQL </font></font> <code>CommunicationsException: Communications link failure</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то это означает, что БД вообще недоступна. </font><font style="vertical-align: inherit;">Это может иметь одну или несколько из следующих причин:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您收到一个</font></font> <code>SQLException: Connection refused</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>Connection timed out</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者一个MySQL特定的</font></font> <code>CommunicationsException: Communications link failure</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则意味着根本无法访问该数据库。</font><font style="vertical-align: inherit;">可能有以下一种或多种原因：</font></font>

source: If you get a <code>SQLException: No suitable driver</code>, then it means that either the JDBC driver wasn't autoloaded at all or that the JDBC URL is wrong (i.e. it wasn't recognized by any of the loaded drivers). Normally, a JDBC 4.0 driver should be autoloaded when you just drop it in runtime classpath. To exclude one and other, you can always manually load it as below:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si obtiene una </font></font> <code>SQLException: No suitable driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , significa que el controlador JDBC no se carg&oacute; autom&aacute;ticamente o que la URL de JDBC es incorrecta (es decir, ninguno de los controladores cargados lo reconoci&oacute;). </font><font style="vertical-align: inherit;">Normalmente, un controlador JDBC 4.0 debe cargarse autom&aacute;ticamente cuando lo suelta en classpath en tiempo de ejecuci&oacute;n. </font><font style="vertical-align: inherit;">Para excluir uno y otro, siempre puede cargarlo manualmente de la siguiente manera:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたが取得する場合</font></font> <code>SQLException: No suitable driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、それは（それがロードされたドライバのいずれによっても認識されませんでしたIE）JDBCドライバがすべてで自動的にロードされなかったこと、またはJDBC URLが間違っていることを意味しています。</font><font style="vertical-align: inherit;">通常、JDBC 4.0ドライバーは、ランタイムクラスパスにドロップするだけでオートロードされます。</font><font style="vertical-align: inherit;">どちらか一方を除外するには、次のようにいつでも手動でロードできます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 얻을 경우 </font></font> <code>SQLException: No suitable driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 다음은 JDBC 드라이버 중 하나가 전혀 또는 (그것을 즉로드 된 드라이버의 인식하지 않은)이 JDBC URL이 잘못되었다는 자동으로 적재되지 않았 음을 의미한다. </font><font style="vertical-align: inherit;">일반적으로 JDBC 4.0 드라이버는 런타임 클래스 경로에 드롭 할 때 자동으로로드되어야합니다. </font><font style="vertical-align: inherit;">하나와 다른 것을 제외하기 위해 항상 다음과 같이 수동으로로드 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы получаете </font></font> <code>SQLException: No suitable driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то это означает, что либо драйвер JDBC вообще не был загружен автоматически, либо URL-адрес JDBC неверен (т.е. он не был распознан ни одним из загруженных драйверов). </font><font style="vertical-align: inherit;">Обычно драйвер JDBC 4.0 должен загружаться автоматически, когда вы просто отбрасываете его в путь к классам во время выполнения. </font><font style="vertical-align: inherit;">Чтобы исключить одно и другое, вы всегда можете вручную загрузить его, как показано ниже:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果收到</font></font> <code>SQLException: No suitable driver</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则意味着JDBC驱动程序根本没有自动加载，或者JDBC URL错误（即，任何已加载的驱动程序都无法识别）。</font><font style="vertical-align: inherit;">通常，只要将JDBC 4.0驱动程序放入运行时类路径中，就应该自动加载该驱动程序。</font><font style="vertical-align: inherit;">要排除其中的一个，您始终可以按如下所示手动加载它：</font></font>
