Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong><a href="http://dev.mysql.com/downloads/connector/j/">Download</a> the JDBC driver and put in classpath</strong>, extract the ZIP file and put the containing JAR file in the classpath. The vendor-specific JDBC driver is a concrete implementation of the <a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html">JDBC API</a> (<a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html">tutorial here</a>).
es: <strong><a href="http://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Descargue</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el controlador JDBC y p&oacute;ngalo en classpath</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , extraiga el archivo ZIP y coloque el archivo JAR que contiene en el classpath. </font><font style="vertical-align: inherit;">El controlador JDBC espec&iacute;fico del proveedor es una implementaci&oacute;n concreta de la</font></font><a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> API JDBC</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (</font></font><a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tutorial aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <strong><a href="http://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBCドライバーを</font><font style="vertical-align: inherit;">ダウンロード</font><font style="vertical-align: inherit;">してclasspath</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><strong><font style="vertical-align: inherit;">入れ</font></strong><font style="vertical-align: inherit;">、ZIPファイルを抽出して、含まれているJARファイルをクラスパスに入れます。</font><font style="vertical-align: inherit;">ベンダー固有のJDBCドライバーは、</font></font><a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JDBC APIの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具体的な実装です</font><font style="vertical-align: inherit;">（</font></font><a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チュートリアルはこちら</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>
ko: <strong><a href="http://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC 드라이버를 </font><font style="vertical-align: inherit;">다운로드</font><font style="vertical-align: inherit;"> 하고 classpath에 넣고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ZIP 파일을 추출한 후 포함하는 JAR 파일을 클래스 경로에 넣으십시오. </font><font style="vertical-align: inherit;">공급 업체별 JDBC 드라이버는</font></font><a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JDBC API를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구체적으로 구현 한 것입니다</font><font style="vertical-align: inherit;">(</font></font><a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여기의 자습서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <strong><a href="http://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Загрузите</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> драйвер JDBC и поместите в classpath</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , извлеките ZIP-файл и поместите содержащий JAR-файл в classpath. </font><font style="vertical-align: inherit;">Драйвер JDBC для конкретного поставщика является конкретной реализацией</font></font><a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> API JDBC</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (</font></font><a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> учебное пособие здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <strong><a href="http://dev.mysql.com/downloads/connector/j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JDBC驱动程序并放入classpath</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，解压缩ZIP文件并将包含的JAR文件放入classpath。</font><font style="vertical-align: inherit;">特定于供应商的JDBC驱动程序是</font></font><a href="http://docs.oracle.com/javase/8/docs/api/java/sql/package-summary.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JDBC API</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的具体实现</font><font style="vertical-align: inherit;">（</font></font><a href="http://docs.oracle.com/javase/tutorial/jdbc/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处提供了教程</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: <strong><a href="http://dev.mysql.com/downloads/mysql/">Download</a> and install the MySQL server</strong>. Just do it the usual way. Remember the port number whenever you've changed it. It's by default <code>3306</code>.
es: <strong><a href="http://dev.mysql.com/downloads/mysql/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Descargue</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e instale el servidor MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Solo hazlo de la manera habitual. </font><font style="vertical-align: inherit;">Recuerde el n&uacute;mero de puerto siempre que lo haya cambiado. </font><font style="vertical-align: inherit;">Es por defecto</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong><a href="http://dev.mysql.com/downloads/mysql/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQLサーバーを</font><font style="vertical-align: inherit;">ダウンロード</font><font style="vertical-align: inherit;">してインストールします</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">いつものようにしてください。</font><font style="vertical-align: inherit;">ポート番号を変更したときはいつでも覚えておいてください。</font><font style="vertical-align: inherit;">デフォルトは</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <strong><a href="http://dev.mysql.com/downloads/mysql/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL 서버를 </font><font style="vertical-align: inherit;">다운로드</font><font style="vertical-align: inherit;"> 하여 설치하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그냥 평소처럼하세요. </font><font style="vertical-align: inherit;">포트 번호를 변경할 때마다 기억하십시오. </font><font style="vertical-align: inherit;">기본적으로</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <strong><a href="http://dev.mysql.com/downloads/mysql/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Загрузите</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и установите сервер MySQL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Просто сделай это обычным способом. </font><font style="vertical-align: inherit;">Помните номер порта всякий раз, когда вы его изменили. </font><font style="vertical-align: inherit;">Это по умолчанию</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong><a href="http://dev.mysql.com/downloads/mysql/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并安装MySQL服务器</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">只需按照通常的方式进行即可。</font><font style="vertical-align: inherit;">每次更改时都请记住端口号。</font><font style="vertical-align: inherit;">默认为</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong><code>databasename</code></strong>: The name of the database you'd like to connect to. That's <code>javabase</code>.
es: <strong> <code>databasename</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el nombre de la base de datos a la que le gustar&iacute;a conectarse. </font><font style="vertical-align: inherit;">Eso es</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong> <code>databasename</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：接続するデータベースの名前。</font><font style="vertical-align: inherit;">それは</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <strong> <code>databasename</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 연결하려는 데이터베이스의 이름입니다. </font><font style="vertical-align: inherit;">이것이</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <strong> <code>databasename</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имя</font><strong><font style="vertical-align: inherit;"> базы данных</font></strong><font style="vertical-align: inherit;"> : имя базы данных, к которой вы хотите подключиться. </font><font style="vertical-align: inherit;">Это</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong> <code>databasename</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：您要连接的数据库的名称。</font><font style="vertical-align: inherit;">那是</font></font> <code>javabase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong><code>hostname</code></strong>: The hostname where MySQL server is installed. If it's installed at the same machine where you run the Java code, then you can just use <code>localhost</code>. It can also be an IP address like <code>127.0.0.1</code>. If you encounter connectivity problems and using <code>127.0.0.1</code> instead of <code>localhost</code> solved it, then you've a problem in your network/DNS/hosts config.
es: <strong> <code>hostname</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el nombre de host donde est&aacute; instalado el servidor MySQL. </font><font style="vertical-align: inherit;">Si est&aacute; instalado en la misma m&aacute;quina donde ejecuta el c&oacute;digo Java, puede usar</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Tambi&eacute;n puede ser una direcci&oacute;n IP como</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si encuentra problemas de conectividad y el uso de</font></font> <code>127.0.0.1</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de</font></font> <code>localhost</code> lo<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> resolvi&oacute;, entonces tiene un problema en su configuraci&oacute;n de red / DNS / hosts.</font></font>
ja: <strong> <code>hostname</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：MySQLサーバーがインストールされているホスト名。</font><font style="vertical-align: inherit;">Javaコードを実行するのと同じマシンにインストールされている場合は、</font></font> <code>localhost</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用できます</font><font style="vertical-align: inherit;">。</font></font> <code>127.0.0.1</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ようなIPアドレスにすることもできます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">接続の問題が発生し</font><font style="vertical-align: inherit;">、</font> <code>localhost</code> の<font style="vertical-align: inherit;">代わりに</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して</font><font style="vertical-align: inherit;">解決した場合は、ネットワーク/ DNS /ホストの構成に問題があります。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <strong> <code>hostname</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : MySQL 서버가 설치된 호스트 이름입니다. </font><font style="vertical-align: inherit;">Java 코드를 실행하는 동일한 시스템에 설치되어 있으면</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 사용할 수 있습니다</font><font style="vertical-align: inherit;">. </font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 같은 IP 주소 일 수도 있습니다</font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">연결 문제가 발생하고</font> <code>localhost</code> <font style="vertical-align: inherit;"> 대신</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을</font><font style="vertical-align: inherit;">사용하여 문제를</font><font style="vertical-align: inherit;">해결 한 경우 네트워크 / DNS / hosts 구성에 문제가있는 것입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <strong> <code>hostname</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : имя хоста, на котором установлен сервер MySQL. </font><font style="vertical-align: inherit;">Если он установлен на той же машине, где вы запускаете код Java, вы можете просто использовать</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это также может быть IP-адрес, такой как</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если вы столкнулись с проблемами с подключением и</font><font style="vertical-align: inherit;">решили</font><font style="vertical-align: inherit;">использовать</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , значит, у вас проблема в конфигурации вашей сети / DNS / hosts.</font></font>
zh_cn: <strong> <code>hostname</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：安装MySQL服务器的主机名。</font><font style="vertical-align: inherit;">如果将它安装在运行Java代码的同一台计算机上，则可以只使用</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">它也可以是</font></font> <code>127.0.0.1</code> 之<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类的IP地址</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果遇到连接问题，并且使用</font></font> <code>127.0.0.1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>localhost</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决了此问题，则您的网络/ DNS /主机配置中存在问题。</font></font>

source: <strong><code>port</code></strong>: The TCP/IP port where MySQL server listens on. This is by default <code>3306</code>.
es: <strong> <code>port</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el</font><strong><font style="vertical-align: inherit;"> puerto</font></strong><font style="vertical-align: inherit;"> TCP / IP donde el servidor MySQL escucha. </font><font style="vertical-align: inherit;">Esto es por defecto</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong> <code>port</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：MySQLサーバーが待機するTCP / IPポート。</font><font style="vertical-align: inherit;">これはデフォルトでは</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <strong> <code>port</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : MySQL 서버가 수신하는 TCP / IP 포트. </font><font style="vertical-align: inherit;">기본적으로</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <strong> <code>port</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font><strong><font style="vertical-align: inherit;"> порт</font></strong><font style="vertical-align: inherit;"> TCP / IP, на котором сервер MySQL прослушивает. </font><font style="vertical-align: inherit;">Это по умолчанию</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong> <code>port</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：MySQL服务器侦听的TCP / IP端口。</font><font style="vertical-align: inherit;">默认情况下为</font></font> <code>3306</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
