Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: 1. Send queries or update SQL to DB(any relational Database) 2. Retrieve and process the results from DB
es: 1.Enviar consultas o actualizar el SQL a la BD (cualquier base de datos relacional)2.2.Recuperar y procesar los resultados de la BD
ja: 1.DB(任意のリレーショナルデータベース)にクエリを送信したり、SQLを更新したりする 2.DBから結果を取得して処理する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. DB (관계형 데이터베이스)에 쿼리를 보내거나 SQL을 업데이트합니다. 2. DB에서 결과를 검색하고 처리합니다.</font></font>
ru: 1.Отправлять запросы или обновлять SQL в БД (любую реляционную БД)2.Извлекать и обрабатывать результаты из БД
zh_cn: 1.向DB(任何关系型数据库)发送查询或更新SQL 2.从DB中检索和处理结果

source: <code>Connection</code> I was using some time ago, it was looking like the easiest way, but also there were recommendation to make there <code>if</code> statement- exactly
es: <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que estaba usando hace alg&uacute;n tiempo, parec&iacute;a la forma m&aacute;s f&aacute;cil, pero tambi&eacute;n hubo recomendaciones para hacerla </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> declaraci&oacute;n es exactamente</font></font>
ja: <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が少し前に使用していた</font><font style="vertical-align: inherit;">接続</font><font style="vertical-align: inherit;">は、それが最も簡単な方法のように見えましたが</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">がある</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、そこに作成することをお勧めしました</font></font>
ko: <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 얼마 전에 사용했던 </font><font style="vertical-align: inherit;">연결</font><font style="vertical-align: inherit;"> 은 가장 쉬운 방법처럼 보였지만 </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문을 정확하게 작성하는 </font><font style="vertical-align: inherit;">것이 좋습니다.</font></font>
ru: <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> я использовал некоторое время назад, выглядела как самый простой способ, но также была рекомендация сделать там, </font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заявление - точно</font></font>
zh_cn: <code>Connection</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我前一段时间使用的</font><font style="vertical-align: inherit;">连接</font><font style="vertical-align: inherit;">，它看起来是最简单的方法，但是也有人建议在</font></font> <code>if</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句中-</font></font>

source: <code>DriverManager</code> is a fairly old way of doing things. The better way is to get a <code>DataSource</code>, either by looking one up that your app server container already configured for you:
es: <code>DriverManager</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una forma bastante antigua de hacer las cosas. </font><font style="vertical-align: inherit;">La mejor manera es obtener un </font></font> <code>DataSource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , ya sea buscando uno que el contenedor del servidor de aplicaciones ya haya configurado para usted:</font></font>
ja: <code>DriverManager</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、かなり古い方法です。</font><font style="vertical-align: inherit;">より良い方法は、</font></font> <code>DataSource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を取得する</font><font style="vertical-align: inherit;">ことです。これは、アプリケーションサーバーコンテナーが既に構成されていることを確認することによって行います。</font></font>
ko: <code>DriverManager</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 상당히 오래된 방법입니다. </font><font style="vertical-align: inherit;">더 좋은 방법은 </font><font style="vertical-align: inherit;">앱 서버 컨테이너가 이미 구성되어 있는지 확인하여 </font></font> <code>DataSource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 얻는 </font><font style="vertical-align: inherit;">것입니다.</font></font>
ru: <code>DriverManager</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - довольно старый способ работы. </font><font style="vertical-align: inherit;">Лучше всего получить </font></font> <code>DataSource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , либо найдя тот, который уже настроен для вас в контейнере сервера приложений:</font></font>
zh_cn: <code>DriverManager</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一种相当古老的做事方式。</font><font style="vertical-align: inherit;">更好的方法是获取</font></font> <code>DataSource</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，方法是查找已经为您配置的应用服务器容器：</font></font>

source: <em>Note: Class.forName("com.mysql.jdbc.Driver"); This is deprecated at this moment 2019 Apr.</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota: Class.forName ("com.mysql.jdbc.Driver"); </font><font style="vertical-align: inherit;">Esto est&aacute; en desuso en este momento 2019 Abr.</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注：Class.forName（ "com.mysql.jdbc.Driver"）; </font><font style="vertical-align: inherit;">これは現在2019年4月に廃止されます。</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : Class.forName ( "com.mysql.jdbc.Driver"); </font><font style="vertical-align: inherit;">2019 년 4 월 현재 사용 중지되었습니다.</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание. Class.forName ("com.mysql.jdbc.Driver"); </font><font style="vertical-align: inherit;">Это не рекомендуется в данный момент 2019 апр.</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意：Class.forName（&ldquo; com.mysql.jdbc.Driver&rdquo;）; </font><font style="vertical-align: inherit;">在2019年4月此刻不推荐使用。</font></font></em>

source: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html">Determine</a> the JDBC URL</strong>. To connect the MySQL database using Java you need an JDBC URL in the following syntax:
es: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Determine</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la URL de JDBC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Para conectar la base de datos MySQL utilizando Java, necesita una URL JDBC en la siguiente sintaxis:</font></font>
ja: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC URLを</font><font style="vertical-align: inherit;">決定</font><font style="vertical-align: inherit;">します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">Javaを使用してMySQLデータベースに接続するには、次の構文のJDBC URLが必要です。</font></font>
ko: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JDBC URL을 </font><font style="vertical-align: inherit;">결정</font><font style="vertical-align: inherit;"> 하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Java를 사용하여 MySQL 데이터베이스를 연결하려면 다음 구문의 JDBC URL이 필요합니다.</font></font>
ru: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Определите</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> URL JDBC</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Для подключения базы данных MySQL с использованием Java вам потребуется URL JDBC в следующем синтаксисе:</font></font>
zh_cn: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-reference-configuration-properties.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确定</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JDBC URL</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">要使用Java连接MySQL数据库，您需要使用以下语法的JDBC URL：</font></font>

source: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html">Test the connection</a> to MySQL using Java</strong>. Create a simple Java class with a <code>main()</code> method to test the connection.
es: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Probar la conexi&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a MySQL usando Java</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Cree una clase Java simple con un</font><font style="vertical-align: inherit;">m&eacute;todo</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para probar la conexi&oacute;n.</font></font>
ja: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaを使用してMySQLへ</font><font style="vertical-align: inherit;">の接続</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">テスト</font><font style="vertical-align: inherit;">します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを使用</font><font style="vertical-align: inherit;">して単純なJavaクラスを作成し</font><font style="vertical-align: inherit;">、接続をテストします。</font></font>
ko: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java를 사용하여 MySQL에 </font><font style="vertical-align: inherit;">대한 연결</font><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">테스트하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드로</font><font style="vertical-align: inherit;">간단한 Java 클래스를 작성</font><font style="vertical-align: inherit;">하여 연결을 테스트하십시오.</font></font>
ru: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте соединение</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с MySQL, используя Java</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Создайте простой Java-класс с</font><font style="vertical-align: inherit;">методом</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для проверки соединения.</font></font>
zh_cn: <strong><a href="http://dev.mysql.com/doc/connector-j/en/connector-j-usagenotes-basic.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用Java </font><font style="vertical-align: inherit;">测试与</font><font style="vertical-align: inherit;"> MySQL </font><font style="vertical-align: inherit;">的连接</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">使用</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">创建一个简单的Java类</font><font style="vertical-align: inherit;">来测试连接。</font></font>

source: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html">Create an user</a> for Java and <a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html">grant</a> it access</strong>. Simply because using <code>root</code> is a bad practice.
es: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cree un usuario</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para Java y </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">conc&eacute;dale</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> acceso</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Simplemente porque usar</font></font> <code>root</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una mala pr&aacute;ctica.</font></font>
ja: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java </font><font style="vertical-align: inherit;">のユーザー</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">作成し、</font><font style="vertical-align: inherit;">アクセス</font><font style="vertical-align: inherit;">を</font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">許可</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font> <code>root</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">こと</font><font style="vertical-align: inherit;">は悪い習慣だからです。</font></font>
ko: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 용 </font><font style="vertical-align: inherit;">사용자</font><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성하고</font><font style="vertical-align: inherit;"> 액세스 </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">권한을 부여</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하십시오</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">단순히</font></font> <code>root</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 것은 나쁜 습관</font><font style="vertical-align: inherit;">이기 때문</font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Создайте пользователя</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для Java и </font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предоставьте</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ему доступ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Просто потому, что использование</font></font> <code>root</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - плохая практика.</font></font>
zh_cn: <strong><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">创建</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Java </font><font style="vertical-align: inherit;">用户</font><font style="vertical-align: inherit;">并</font></font><a href="http://dev.mysql.com/doc/refman/5.7/en/grant.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">授予</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其访问权限</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">仅仅因为使用</font></font> <code>root</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一种不好的做法。</font></font>
