Repository: rueisnom/feedback
Catalog: xlf/28/39/32/1/2839321.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Using a Singleton Pattern for the DB connection is a bad approach. See among other questions: <a href="http://stackoverflow.com/q/9428573/">http://stackoverflow.com/q/9428573/</a>. This is a #1 starters mistake.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usar un patr&oacute;n Singleton para la conexi&oacute;n DB es un mal enfoque. </font><font style="vertical-align: inherit;">Consulte entre otras preguntas: </font></font><a href="http://stackoverflow.com/q/9428573/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://stackoverflow.com/q/9428573/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Este es un error de arranque # 1.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB接続にシングルトンパターンを使用するのは不適切なアプローチです。</font><font style="vertical-align: inherit;">他の質問を</font></font><a href="http://stackoverflow.com/q/9428573/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧ください</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">http</font><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//stackoverflow.com/q/9428573/</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは＃1の初心者の間違いです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DB 연결에 싱글 톤 패턴을 사용하는 것은 나쁜 접근법입니다. </font><font style="vertical-align: inherit;">다른 질문들 중 하나를 참조하십시오 : </font></font><a href="http://stackoverflow.com/q/9428573/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://stackoverflow.com/q/9428573/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이것은 첫 번째 실수입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование шаблона Singleton для подключения к БД - плохой подход. </font><font style="vertical-align: inherit;">Смотрите среди других вопросов: </font></font><a href="http://stackoverflow.com/q/9428573/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://stackoverflow.com/q/9428573/</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это ошибка № 1 для начинающих.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对数据库连接使用单例模式是一种不好的方法。</font><font style="vertical-align: inherit;">参见其他问题：</font></font><a href="http://stackoverflow.com/q/9428573/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//stackoverflow.com/q/9428573/</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这是＃1入门错误。</font></font>

source: Verify and test them with <code>ping</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Verif&iacute;quelos y pru&eacute;belos con </font></font> <code>ping</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ping</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">確認してテストし</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ping</code> 으로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 확인하고 테스트하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте и проверьте их с помощью </font></font> <code>ping</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>ping</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">验证并测试它们</font><font style="vertical-align: inherit;">。</font></font>

source: Verify if mysqld is started without the <code>--skip-networking option</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Verifique si mysqld se inicia sin la </font></font> <code>--skip-networking option</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mysqldが</font></font> <code>--skip-networking option</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なしで起動されているかどうかを確認し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>--skip-networking option</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 없이 mysqld가 시작되었는지 확인하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Убедитесь, что mysqld запущен без </font></font> <code>--skip-networking option</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">验证mysqld是否在没有</font></font> <code>--skip-networking option</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况下启动</font><font style="vertical-align: inherit;">。</font></font>

source: Verify it based on <code>my.cnf</code> of MySQL DB.
es: <font style="vertical-align: inherit;"></font> <code>my.cnf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en base a </font><font style="vertical-align: inherit;">my.cnf</font><font style="vertical-align: inherit;"> de MySQL DB.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL DBの</font></font> <code>my.cnf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">基づいて確認し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySQL DB의 </font></font> <code>my.cnf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">기반으로 확인하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Проверьте это на основе </font></font> <code>my.cnf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> базы данных MySQL.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font><font style="vertical-align: inherit;">MySQL DB的</font></font> <code>my.cnf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行</font><font style="vertical-align: inherit;">验证</font><font style="vertical-align: inherit;">。</font></font>

source: Visit <a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visite </font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVAに</font></a><font style="vertical-align: inherit;">アクセスします</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA</font></a><font style="vertical-align: inherit;"> 방문</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Посетите </font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问</font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA</font></font></a>

source: When I try, I get
es: Cuando lo intento,consigo
ja: 試してみると
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시도하면</font></font>
ru: Когда я пытаюсь,я получаю
zh_cn: 当我尝试的时候,我得到的是

source: Yes, <code>java</code> is the username and <code>password</code> is the password here.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">S&iacute;, </font></font> <code>java</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el nombre de usuario y la </font></font> <code>password</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es la contrase&ntilde;a aqu&iacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はい、</font></font> <code>java</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はユーザー名で、</font></font> <code>password</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はここでのパスワードです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예, </font></font> <code>java</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 사용자 이름이고 </font></font> <code>password</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><font style="vertical-align: inherit;">비밀번호</font><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Да, </font></font> <code>java</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это имя пользователя, а </font></font> <code>password</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - здесь.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是的，</font></font> <code>java</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是用户名，</font></font> <code>password</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是此处的密码。</font></font>

source: You can see all steps to connect MySQL database from Java application <a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA">here</a>. For other database, you just need to change the driver in first step only. Please make sure that you provide right path to database and correct username and password.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede ver todos los pasos para conectar la base de datos MySQL desde la aplicaci&oacute;n Java </font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Para otra base de datos, solo necesita cambiar el controlador solo en el primer paso. </font><font style="vertical-align: inherit;">Aseg&uacute;rese de proporcionar la ruta correcta a la base de datos y el nombre de usuario y contrase&ntilde;a correctos.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、JavaアプリケーションからMySQLデータベースに接続するためのすべての手順を確認でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">他のデータベースの場合、最初のステップでのみドライバーを変更する必要があります。</font><font style="vertical-align: inherit;">データベースへの正しいパスを提供し、ユーザー名とパスワードを修正してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 애플리케이션에서 MySQL 데이터베이스를 연결하는 모든 단계는 </font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 볼 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">다른 데이터베이스의 경우 첫 단계에서만 드라이버를 변경하면됩니다. </font><font style="vertical-align: inherit;">데이터베이스에 대한 올바른 경로와 올바른 사용자 이름 및 비밀번호를 제공해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете увидеть все шаги для подключения базы данных MySQL из приложения Java </font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Для другой базы данных вам просто нужно изменить драйвер только на первом этапе. </font><font style="vertical-align: inherit;">Пожалуйста, убедитесь, что вы указали правильный путь к базе данных и правильное имя пользователя и пароль.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以</font></font><a href="http://apekshit.com/t/51/Steps-to-connect-Database-using-JAVA"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在此处查看</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从Java应用程序连接MySQL数据库的所有步骤</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">对于其他数据库，您只需要在第一步中更改驱动程序。</font><font style="vertical-align: inherit;">请确保您提供正确的数据库路径以及正确的用户名和密码。</font></font>

source: and then obtain connections from it, same as above:
es: y luego obtener conexiones de él,igual que arriba:
ja: とし、そこから接続を取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 위와 같이 연결을 얻습니다.</font></font>
ru: а затем получить от него связи,как и выше:
zh_cn: 然后从中获取连接,同上。

source: in Java JDBC API makes everything with databases. using JDBC we can write Java applications to
es: en Java JDBC API hace todo con las bases de datos.usando JDBC podemos escribir aplicaciones Java para
ja: JavaのJDBC APIは、データベースを使用してすべてのものを作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java JDBC API에서는 데이터베이스로 모든 것을 만듭니다. </font><font style="vertical-align: inherit;">JDBC를 사용하여 Java 애플리케이션을 작성할 수 있습니다.</font></font>
ru: в Java JDBC API делает все с базами данных.с помощью JDBC мы можем писать Java-приложения к
zh_cn: 在Java中,JDBC API使得一切都与数据库有关。

source: or instantiating and configuring one from your database driver directly:
es: o instanciar y configurar uno desde el controlador de la base de datos directamente:
ja: または、データベースドライバから直接インスタンスを作成して設定することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 데이터베이스 드라이버에서 직접 인스턴스화 및 구성 :</font></font>
ru: или инстанцирование и настройка непосредственно из драйвера базы данных:
zh_cn: 或直接从数据库驱动程序中实例化和配置一个。

source: with below three steps we can able to retrieve data from any Database
es: con menos de tres pasos podemos recuperar datos de cualquier base de datos
ja: 以下の3つのステップで、我々は任意のデータベースからデータを取得することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 3 단계를 통해 모든 데이터베이스에서 데이터를 검색 할 수 있습니다.</font></font>
ru: с помощью трех шагов мы можем получить данные из любой базы данных.
zh_cn: 通过以下三个步骤,我们可以从任何数据库中检索数据

source: you need to have mysql connector jar in your classpath.
es: necesitas tener un tarro de conectores mysql en tu clase.
ja: クラスパスに mysql connector jar がある必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스 패스에 mysql 커넥터 jar이 있어야합니다.</font></font>
ru: вам нужно иметь банку с разъёмом mysql в вашем клас-спате.
zh_cn: 你需要在你的classpath里有mysql连接器jar。
