Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Although ADD and COPY are functionally similar, generally speaking, COPY is preferred. That&rsquo;s because it&rsquo;s more transparent than ADD. COPY only supports the basic copying of local files into the container, while ADD has some features (like local-only tar extraction and remote URL support) that are not immediately obvious. Consequently, the best use for ADD is local tar file auto-extraction into the image, as in ADD rootfs.tar.xz /.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"Aunque ADD y COPY son funcionalmente similares, en general, se prefiere COPY. Esto se debe a que es m&aacute;s transparente que ADD. COPY solo admite la copia b&aacute;sica de archivos locales en el contenedor, mientras que ADD tiene algunas caracter&iacute;sticas (como la extracci&oacute;n de alquitr&aacute;n solo local y soporte remoto de URL) que no son inmediatamente obvios. En consecuencia, el mejor uso para ADD es la extracci&oacute;n autom&aacute;tica de archivos tar locales en la imagen, como en ADD rootfs.tar.xz /.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「ADDとCOPYは機能的に類似していますが、一般的に言えば、COPYが推奨されます。これは、ADDよりも透過的であるためです。COPYは、ローカルファイルのコンテナーへの基本的なコピーのみをサポートしますが、ADDにはいくつかの機能（ローカルのみのtar抽出やリモートURLのサポート）はすぐにはわかりません。そのため、ADDの最適な用途は、ADD rootfs.tar.xz /のように、ローカルtarファイルをイメージに自動抽出することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"ADD와 COPY는 기능적으로 비슷하지만 일반적으로 COPY가 선호됩니다. ADD보다 투명하기 때문입니다. COPY는 로컬 파일을 컨테이너로 기본 복사 만 지원하는 반면 ADD에는 로컬 전용 tar 추출 및 ADD rootfs.tar.xz /에서와 같이 ADD를 가장 잘 사용하는 것은 이미지에 로컬 tar 파일을 자동 추출하는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&laquo;Хотя ADD и COPY функционально схожи, в целом, COPY предпочтительнее. Это потому, что он более прозрачен, чем ADD. COPY поддерживает только базовое копирование локальных файлов в контейнер, в то время как ADD имеет некоторые функции (такие как локальное извлечение tar и поддержка удаленного URL), которые не сразу очевидны. Следовательно, лучшее использование ADD - это автоматическое извлечение локального tar-файла в образ, как в ADD rootfs.tar.xz /.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;虽然ADD和COPY在功能上相似，但通常来说COPY是首选。这是因为它比ADD更加透明。COPY仅支持将本地文件基本复制到容器中，而ADD具有一些功能（例如仅本地tar提取和远程URL支持）并不是立即显而易见的，因此，ADD的最佳用途是将本地tar文件自动提取到映像中，如ADD rootfs.tar.xz /中所示。</font></font>

source: <code>ADD</code> allows <code>&lt;src&gt;</code> to be a URL
es: <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permite que </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sea ​​una URL</font></font>
ja: <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をURLにすることができます</font></font>
ko: <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 URL이되도록합니다</font></font>
ru: <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> позволяет </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> быть URL</font></font>
zh_cn: <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">允许</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为URL</font></font>

source: <code>COPY</code> is
es: <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es</font></font>
ja: <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font>
ko: <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은</font></font>
ru: <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является</font></font>
zh_cn: <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font>

source: <strong><code>ADD</code></strong> can also copy files from a URL. It can download an external file and copy it to the wanted destination. For example:
es: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n puede copiar archivos desde una URL. </font><font style="vertical-align: inherit;">Puede descargar un archivo externo y copiarlo en el destino deseado. </font><font style="vertical-align: inherit;">Por ejemplo:</font></font>
ja: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、URLからファイルをコピーすることもできます。</font><font style="vertical-align: inherit;">外部ファイルをダウンロードして、目的の宛先にコピーできます。</font><font style="vertical-align: inherit;">例えば：</font></font>
ko: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 URL에서 파일을 복사 할 수도 있습니다. </font><font style="vertical-align: inherit;">외부 파일을 다운로드하여 원하는 대상으로 복사 할 수 있습니다. </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다.</font></font>
ru: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> также может копировать файлы с URL. </font><font style="vertical-align: inherit;">Он может загрузить внешний файл и скопировать его в требуемое место назначения. </font><font style="vertical-align: inherit;">Например:</font></font>
zh_cn: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还可以从URL复制文件。</font><font style="vertical-align: inherit;">它可以下载外部文件并将其复制到所需的目的地。</font><font style="vertical-align: inherit;">例如：</font></font>

source: <strong><code>ADD</code></strong> copies a file/directory from your host to your image, but can also fetch remote URLs, extract TAR files, etc...
es: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> copia un archivo / directorio de su host a su imagen, pero tambi&eacute;n puede buscar URL remotas, extraer archivos TAR, etc.</font></font>
ja: <strong> <code>ADD</code> は</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ホストからイメージにファイル/ディレクトリをコピーしますが、リモートURLのフェッチ、TARファイルの抽出などもできます...</font></font>
ko: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 호스트에서 이미지로 파일 / 디렉토리를 복사하지만 원격 URL을 가져오고 TAR 파일을 추출 할 수도 있습니다.</font></font>
ru: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> копирует файл / каталог с вашего хоста в ваше изображение, но также может извлекать удаленные URL, извлекать файлы TAR и т. Д.</font></font>
zh_cn: <strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将文件/目录从主机复制到图像，但也可以获取远程URL，提取TAR文件等。</font></font>

source: <strong><code>COPY</code></strong> copies a file/directory from your host to your image.
es: <strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> copia un archivo / directorio de su host a su imagen.</font></font>
ja: <strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、ホストからイメージにファイル/ディレクトリをコピーします。</font></font>
ko: <strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 파일 / 디렉토리를 호스트에서 이미지로 복사합니다.</font></font>
ru: <strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> копирует файл / каталог с вашего хоста на ваше изображение.</font></font>
zh_cn: <strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将文件/目录从主机复制到图像。</font></font>

source: A valid use case for ADD is when you want to extract a local tar file into a specific directory in your Docker image.
es: Un caso de uso válido para el ADD es cuando quieres extraer un archivo local de alquitrán en un directorio específico en tu imagen del Docker.
ja: ADDの有効なユースケースは、ローカルのtarファイルをDockerイメージの特定のディレクトリに展開したい場合です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD의 유효한 유스 케이스는 로컬 tar 파일을 Docker 이미지의 특정 디렉토리로 추출하려는 경우입니다.</font></font>
ru: Правильным вариантом использования ADD является извлечение локального tar-файла в определенный каталог в образе Docker.
zh_cn: ADD的一个有效用例是当你想将本地 tar 文件提取到 Docker 映像中的特定目录中。

source: ADD lets you do that too, but it also supports 2 other sources. First, you can use a URL instead of a local file / directory. Secondly, you can extract a tar file from the source directly into the destination
es: El ADD te permite hacer eso también,pero también soporta otras 2 fuentes.Primero,puedes usar una URL en lugar de un directorio de archivos locales.En segundo lugar,puedes extraer un archivo tar de la fuente directamente al destino
ja: ADDでもできますが、他にも2つのソースをサポートしています。1つ目は、ローカルのファイルディレクトリの代わりにURLを使うことができます。第二に、ソースからtarファイルを直接保存先の
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD를 사용하면 그렇게 할 수 있지만 2 개의 다른 소스도 지원합니다. </font><font style="vertical-align: inherit;">먼저 로컬 파일 / 디렉토리 대신 URL을 사용할 수 있습니다. </font><font style="vertical-align: inherit;">둘째, 소스에서 대상으로 직접 tar 파일을 추출 할 수 있습니다</font></font>
ru: ADD позволяет это делать и вам,но он также поддерживает 2 других источника.Во-первых,вы можете использовать URL вместо локального каталога файлов.Во-вторых,вы можете извлечь tar-файл из исходников непосредственно в место назначения
zh_cn: ADD也允许你这样做,但它还支持另外两个来源。首先,你可以使用URL来代替本地文件目录。第二,你可以直接从源文件中提取一个tar文件到目标文件中。

source: ADD or COPY
es: AÑADIR o COPIAR
ja: 追加またはコピー
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추가 또는 복사</font></font>
ru: ДОБАВЛЕНИЕ или КОПИ
zh_cn: 添加或复制

source: ADD supports local-only tar extraction. Besides it, COPY will use three layers, but ADD only uses one layer.
es: El ADD apoya la extracción de alquitrán sólo localmente.Además,COPY usará tres capas,pero ADD sólo usa una capa.
ja: ADDはローカルのみのtar抽出をサポートしています。それに加えて、COPYは3つのレイヤーを使用しますが、ADDは1つのレイヤーしか使用しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD는 로컬 전용 tar 추출을 지원합니다. </font><font style="vertical-align: inherit;">그 외에도 COPY는 3 개의 레이어를 사용하지만 ADD는 1 개의 레이어 만 사용합니다.</font></font>
ru: ADD поддерживает только местное извлечение смолы.Кроме того,COPY будет использовать три слоя,но ADD использует только один слой.
zh_cn: ADD支持仅在本地提取焦油。除此之外,COPY会使用三层,但ADD只使用一层。

source: Also, like the curl and wget, it can be run in a command stack (runs in a single container) and not multiply the image size. ADD and COPY are not stackable because they run in a standalone container and subsequent commands on those files that execute in additional containers will multiply the image size:
es: También,como el curl y wget,se puede ejecutar en una pila de comandos (se ejecuta en un solo contenedor)y no multiplicar el tamaño de la imagen.ADD y COPY no son apilables porque se ejecutan en un contenedor independiente y los comandos subsiguientes en esos archivos que se ejecutan en contenedores adicionales multiplicarán el tamaño de la imagen:
ja: また、curlやwgetと同様に、コマンドスタックで実行することができ(単一のコンテナ内で実行される)、イメージサイズを乗算しないようになっています。addとcopyはスタンドアロンコンテナ内で実行され、追加コンテナ内で実行されるこれらのファイルに対する後続のコマンドはイメージサイズを乗算してしまうため、スタック可能ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 curl 및 wget과 같이 이미지 스택을 곱하지 않고 명령 스택 (단일 컨테이너에서 실행)에서 실행할 수 있습니다. </font><font style="vertical-align: inherit;">ADD 및 COPY는 독립형 컨테이너에서 실행되므로 추가 컨테이너에서 실행되는 파일의 후속 명령에 이미지 크기가 곱해지기 때문에 스택 할 수 없습니다.</font></font>
ru: Также,как и в случае с curl и wget,его можно запустить в стеке команд (запускается в одном контейнере)и не умножать размер изображения.ADD и COPY не могут быть сложены в стек,так как запускаются в отдельном контейнере,а последующие команды на тех файлах,которые выполняются в дополнительных контейнерах,будут умножать размер изображения:
zh_cn: 另外,和 curl 和 wget 一样,它可以在命令堆栈中运行(在一个容器中运行),不会使映像大小成倍增加。ADD和COPY是不可堆叠的,因为它们是在一个独立的容器中运行的,而后续在这些文件上执行的命令,如果在其他容器中执行,会使映像大小成倍增加。

source: Although ADD and COPY are functionally similar, generally speaking, COPY is preferred. That&rsquo;s because it&rsquo;s more transparent than ADD. COPY only supports the basic copying of local files into the container, while ADD has some features (like local-only tar extraction and remote URL support) that are not immediately obvious. Consequently, the best use for ADD is local tar file auto-extraction into the image, as in ADD rootfs.tar.xz /.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aunque ADD y COPY son funcionalmente similares, en general, se prefiere COPY. </font><font style="vertical-align: inherit;">Eso es porque es m&aacute;s transparente que AGREGAR. </font><font style="vertical-align: inherit;">COPY solo admite la copia b&aacute;sica de archivos locales en el contenedor, mientras que ADD tiene algunas caracter&iacute;sticas (como extracci&oacute;n de alquitr&aacute;n solo local y soporte remoto de URL) que no son obvias de inmediato. </font><font style="vertical-align: inherit;">En consecuencia, el mejor uso para ADD es la extracci&oacute;n autom&aacute;tica de archivos tar locales en la imagen, como en ADD rootfs.tar.xz /.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADDとCOPYは機能的に類似していますが、一般的に言えば、COPYが推奨されます。</font><font style="vertical-align: inherit;">ADDよりも透過的だからです。</font><font style="vertical-align: inherit;">COPYは、ローカルファイルのコンテナーへの基本的なコピーのみをサポートしますが、ADDには、すぐには明らかにならない機能（ローカルのみのtar抽出やリモートURLサポートなど）があります。</font><font style="vertical-align: inherit;">したがって、ADD rootfs.tar.xz /のように、ADDの最適な使用法は、イメージへのローカルtarファイルの自動抽出です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD와 COPY는 기능적으로 비슷하지만 일반적으로 COPY가 바람직합니다. </font><font style="vertical-align: inherit;">ADD보다 투명하기 때문입니다. </font><font style="vertical-align: inherit;">COPY는 로컬 파일을 컨테이너로 복사하는 기본 기능 만 지원하지만 ADD에는 로컬 전용 tar 추출 및 원격 URL 지원과 같은 일부 기능이있어 즉시 확인할 수 없습니다. </font><font style="vertical-align: inherit;">결과적으로 ADD를 가장 잘 사용하는 것은 ADD rootfs.tar.xz /에서와 같이 이미지에 로컬 tar 파일 자동 추출입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя ADD и COPY функционально схожи, в общем, COPY является предпочтительным. </font><font style="vertical-align: inherit;">Это потому, что он более прозрачен, чем ADD. </font><font style="vertical-align: inherit;">COPY поддерживает только базовое копирование локальных файлов в контейнер, в то время как ADD обладает некоторыми функциями (такими как локальное извлечение tar и поддержка удаленных URL), которые не сразу очевидны. </font><font style="vertical-align: inherit;">Следовательно, лучшее использование ADD - это автоматическое извлечение локального tar-файла в образ, как в ADD rootfs.tar.xz /.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尽管ADD和COPY在功能上相似，但通常来说COPY是首选。</font><font style="vertical-align: inherit;">那是因为它比ADD更透明。</font><font style="vertical-align: inherit;">COPY仅支持将本地文件基本复制到容器中，而ADD的某些功能（如仅本地tar提取和远程URL支持）并不是立即显而易见的。</font><font style="vertical-align: inherit;">因此，与ADD rootfs.tar.xz /中一样，ADD的最佳用途是将本地tar文件自动提取到映像中。</font></font>

source: An additional feature is that it copies compressed files, automatically extracting the content in the given destination. This feature only applies to locally stored compressed files/directories.
es: Una característica adicional es que copia los archivos comprimidos,extrayendo automáticamente el contenido en el destino dado.Esta característica sólo se aplica a los directorios de archivos comprimidos almacenados localmente.
ja: 追加機能として、圧縮ファイルをコピーして、指定された宛先のコンテンツを自動的に抽出することができます。この機能は、ローカルに保存された圧縮ファイルディレクトリにのみ適用されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추가 기능은 압축 파일을 복사하여 지정된 대상에서 컨텐츠를 자동으로 추출한다는 것입니다. </font><font style="vertical-align: inherit;">이 기능은 로컬로 저장된 압축 파일 / 디렉토리에만 적용됩니다.</font></font>
ru: Дополнительной функцией является копирование сжатых файлов,автоматически распаковывая содержимое в заданном месте назначения.Эта функция применяется только к локально хранящимся каталогам сжатых файлов.
zh_cn: 还有一个额外的功能是,它可以复制压缩文件,自动提取给定目标中的内容。这个功能只适用于本地存储的压缩文件目录。

source: And instead, do something like:
es: Y en vez de eso,haz algo como:
ja: その代わりに、こんなことをしてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신 다음과 같은 작업을 수행하십시오.</font></font>
ru: А вместо этого,сделай что-нибудь вроде:
zh_cn: 相反,做一些类似于:

source: Bear in mind that you cannot download and extract a compressed file/directory from a URL. The command does not unpack external packages when copying them to the local filesystem.
es: Tenga en cuenta que no puede descargar y extraer un directorio comprimido de una URL.El comando no desempaqueta los paquetes externos al copiarlos al sistema de archivos local.
ja: URL から圧縮された圧縮されたディレクトリをダウンロードして展開することはできないことに注意してください。このコマンドは、外部パッケージをローカルファイルシステムにコピーしても解凍しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">URL에서 압축 파일 / 디렉토리를 다운로드하고 추출 할 수는 없습니다. </font><font style="vertical-align: inherit;">이 명령은 외부 패키지를 로컬 파일 시스템에 복사 할 때 외부 패키지의 압축을 풀지 않습니다.</font></font>
ru: Помните,что вы не можете загрузить и извлечь сжатый каталог из URL.Команда не распаковывает внешние пакеты при копировании их в локальную файловую систему.
zh_cn: 请记住,你不能从URL下载和提取压缩后的文件目录。当将外部包复制到本地文件系统时,该命令不会解压。

source: Because image size matters, using <code>ADD</code> to fetch packages from remote URLs is strongly discouraged; you should use <code>curl</code> or <code>wget</code> instead. That way you can delete the files you no longer need after they've been extracted and you won't have to add another layer in your image.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que el tama&ntilde;o de la imagen es importante, </font><font style="vertical-align: inherit;">se desaconseja </font><font style="vertical-align: inherit;">utilizar </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener paquetes de URL remotas; </font><font style="vertical-align: inherit;">deber&iacute;as usar </font></font> <code>curl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>wget</code> en su<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar. </font><font style="vertical-align: inherit;">De esa manera, puede eliminar los archivos que ya no necesita despu&eacute;s de que se hayan extra&iacute;do y no tendr&aacute; que agregar otra capa en su imagen.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">画像サイズが重要であるため、</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">してリモートURLからパッケージをフェッチすることは強くお勧めしません。</font><font style="vertical-align: inherit;">代わりに</font></font> <code>curl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>wget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これにより、抽出後に不要になったファイルを削除でき、画像に別のレイヤーを追加する必要がなくなります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미지 크기가 중요하기 때문에 </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font><font style="vertical-align: inherit;">원격 URL에서 패키지를 가져 오는 것은 권장하지 않습니다. </font><font style="vertical-align: inherit;">대신 </font></font> <code>curl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>wget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용해야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그렇게하면 더 이상 필요없는 파일을 추출한 후 삭제할 수 있으며 이미지에 다른 레이어를 추가 할 필요가 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку размер изображения имеет значение, использование </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для получения пакетов с удаленных URL настоятельно не рекомендуется; </font><font style="vertical-align: inherit;">вы должны использовать </font></font> <code>curl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>wget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Таким образом, вы можете удалить файлы, которые вам больше не нужны, после того, как они были извлечены, и вам не нужно будет добавлять еще один слой в изображение.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于图像大小很重要，</font><font style="vertical-align: inherit;">因此强烈建议不要</font><font style="vertical-align: inherit;">使用</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从远程URL获取软件包。</font><font style="vertical-align: inherit;">您应该使用</font></font> <code>curl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>wget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替。</font><font style="vertical-align: inherit;">这样，您可以在提取文件后删除不再需要的文件，而不必在图像中添加其他图层。</font></font>
