Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Because image size matters, using ADD to fetch packages from remote URLs is strongly discouraged; you should use curl or wget instead. That way you can delete the files you no longer need after they&rsquo;ve been extracted and you won&rsquo;t have to add another layer in your image. For example, you should avoid doing things like:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que el tama&ntilde;o de la imagen es importante, se desaconseja utilizar ADD para obtener paquetes de URL remotas; </font><font style="vertical-align: inherit;">deber&iacute;as usar curl o wget en su lugar. </font><font style="vertical-align: inherit;">De esa manera, puede eliminar los archivos que ya no necesita despu&eacute;s de que se hayan extra&iacute;do y no tendr&aacute; que agregar otra capa en su imagen. </font><font style="vertical-align: inherit;">Por ejemplo, debe evitar hacer cosas como:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">画像サイズが重要であるため、ADDを使用してリモートURLからパッケージをフェッチすることは強くお勧めしません。</font><font style="vertical-align: inherit;">代わりにcurlまたはwgetを使用してください。</font><font style="vertical-align: inherit;">これにより、抽出後に不要になったファイルを削除でき、画像に別のレイヤーを追加する必要がなくなります。</font><font style="vertical-align: inherit;">たとえば、次のようなことは避けてください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미지 크기가 중요하기 때문에 ADD를 사용하여 원격 URL에서 패키지를 가져 오는 것은 권장하지 않습니다. </font><font style="vertical-align: inherit;">대신 curl 또는 wget을 사용해야합니다. </font><font style="vertical-align: inherit;">그렇게하면 더 이상 필요없는 파일을 추출한 후 삭제할 수 있으며 이미지에 다른 레이어를 추가 할 필요가 없습니다. </font><font style="vertical-align: inherit;">예를 들어 다음과 같은 일을 피해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку размер изображения имеет значение, использование ADD для получения пакетов с удаленных URL настоятельно не рекомендуется; </font><font style="vertical-align: inherit;">вы должны использовать curl или wget. </font><font style="vertical-align: inherit;">Таким образом, вы можете удалить файлы, которые вам больше не нужны, после того, как они были извлечены, и вам не нужно будет добавлять еще один слой в изображение. </font><font style="vertical-align: inherit;">Например, вы должны избегать таких вещей, как:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于图像大小很重要，因此强烈建议不要使用ADD从远程URL获取软件包。</font><font style="vertical-align: inherit;">您应该使用curl或wget代替。</font><font style="vertical-align: inherit;">这样，您可以在提取文件后删除不再需要的文件，而不必在图像中添加其他图层。</font><font style="vertical-align: inherit;">例如，您应该避免做以下事情：</font></font>

source: COPY and ADD are both Dockerfile instructions that serve similar purposes. They let you copy files from a specific location into a Docker image.
es: COPIAR y AÑADIR son instrucciones de Dockerfile que sirven a propósitos similares.Te permiten copiar archivos de una ubicación específica en una imagen Docker.
ja: COPYとADDはどちらも似たような目的を果たすDockerfile命令です。これらは、特定の場所からDockerイメージにファイルをコピーすることを可能にします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY 및 ADD는 모두 유사한 목적을 수행하는 Dockerfile 명령어입니다. </font><font style="vertical-align: inherit;">특정 위치에서 Docker 이미지로 파일을 복사 할 수 있습니다.</font></font>
ru: COPY и ADD являются инструкциями Dockerfile,которые служат аналогичным целям.Они позволяют копировать файлы из определенного места в образ Docker.
zh_cn: COPY 和 ADD 都是 Dockerfile 指令,其作用类似。它们可以让你从特定位置复制文件到Docker镜像中。

source: COPY takes in a src and destination. It only lets you copy in a local file or directory from your host (the machine building the Docker image) into the Docker image itself.
es: La copia toma en un src y el destino.Sólo te permite copiar en un archivo o directorio local de tu host (la máquina que construye la imagen del Docker)en la propia imagen del Docker.
ja: COPYは、srcとdockerイメージのコピー先を受け取ります。ホスト(Dockerイメージを構築しているマシン)からDockerイメージ自体にローカルファイルやディレクトリをコピーすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY는 src와 대상을받습니다. </font><font style="vertical-align: inherit;">호스트 (Docker 이미지를 빌드하는 머신)에서 Docker 이미지 자체로 로컬 파일 또는 디렉토리로 복사 할 수 있습니다.</font></font>
ru: COPY принимает src и пункт назначения.Он позволяет копировать только в локальный файл или каталог с вашего хоста (машины,создающей образ Docker)в сам образ Docker.
zh_cn: COPY 包含了一个 src 和目的地。它只允许你将本地文件或目录从主机(构建Docker镜像的机器)复制到Docker镜像本身。

source: Considering the circumstances in which the <strong><code>COPY</code></strong> command was introduced, it is evident that keeping <strong><code>ADD</code></strong> was a matter of necessity. Docker released an official document outlining best practices for writing Dockerfiles, which explicitly advises against using the <strong><code>ADD</code></strong> command.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Teniendo en cuenta las circunstancias en que </font><font style="vertical-align: inherit;">se introdujo el comando </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es evidente que mantener </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> era una cuesti&oacute;n de necesidad. </font><font style="vertical-align: inherit;">Docker lanz&oacute; un documento oficial que describe las mejores pr&aacute;cticas para escribir Dockerfiles, que expl&iacute;citamente desaconseja el uso del </font><font style="vertical-align: inherit;">comando </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドが導入され</font><font style="vertical-align: inherit;">た状況を考えると、</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を維持</font><font style="vertical-align: inherit;">することが必要であった</font><font style="vertical-align: inherit;">ことは明らかです</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ドッキングウィンドウは、明示的に使用しないことを助言Dockerfiles、書き込むためのベストプラクティスをまとめた公式文書にリリース</font></font><strong> <code>ADD</code> の</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドを。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 도입 </font><font style="vertical-align: inherit;">된 상황을 고려할 때 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 유지 </font><font style="vertical-align: inherit;">하는 것이 필수적 </font><font style="vertical-align: inherit;">이라는 것은 분명합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Docker는 Dockerfile 작성에 대한 모범 사례를 요약 한 공식 문서를 발표했으며 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">사용에 대해 명시 적으로 권고합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Учитывая обстоятельства, в которых </font><font style="vertical-align: inherit;">была введена команда </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , очевидно, что сохранение </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было вопросом необходимости. </font><font style="vertical-align: inherit;">Docker выпустил официальный документ с изложением лучших практик написания Dockerfiles, в котором явно не рекомендуется использовать команду </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考虑到</font><font style="vertical-align: inherit;">引入</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">的情况</font><font style="vertical-align: inherit;">，很明显，保持</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是必不可少的。</font><font style="vertical-align: inherit;">Docker发布了一份正式文档，概述了编写Dockerfile的最佳实践，明确建议不要使用</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令。</font></font>

source: DOCKER <code>ADD</code> COMMAND
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> COMANDO</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドッカー</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의사 </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> COMMAND</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font></font>

source: DOCKER <code>COPY</code> COMMAND
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> COMMAND</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドッカー</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의사 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> КОМАНДА</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DOCKER </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font></font>

source: Docker&rsquo;s official documentation notes that <strong><code>COPY</code></strong> should always be the go-to instruction as it is more transparent than <strong><code>ADD</code></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La documentaci&oacute;n oficial de Docker se&ntilde;ala que </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> siempre debe ser la instrucci&oacute;n de acceso, ya que es m&aacute;s transparente que </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerの公式ドキュメントでは、</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも透過的であるため、常に</font><strong><font style="vertical-align: inherit;">GOTO</font></strong><font style="vertical-align: inherit;">命令である必要があると記載されてい</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker의 공식 문서에 따르면 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 투명하므로 항상 </font><strong><font style="vertical-align: inherit;">COPY를</font></strong><font style="vertical-align: inherit;"> 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Официальная документация </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отмечает, что </font><strong><font style="vertical-align: inherit;">COPY</font></strong><font style="vertical-align: inherit;"> всегда должна быть инструкцией по переходу, поскольку она более прозрачна, чем </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker的官方文档指出</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该始终是</font><font style="vertical-align: inherit;">入门指南，</font><font style="vertical-align: inherit;">因为它比</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更透明</font><font style="vertical-align: inherit;">。</font></font>

source: Due to some functionality issues, Docker had to introduce an additional command for duplicating content &ndash; <strong><code>COPY</code></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a algunos problemas de funcionalidad, Docker tuvo que introducir un comando adicional para duplicar contenido: </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いくつかの機能上の問題のため、Dockerはコンテンツを複製するための追加コマンド</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を導入する必要がありました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 기능 문제로 인해 Docker는 콘텐츠 복제를위한 추가 명령 인 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 도입해야했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Из-за некоторых функциональных проблем Docker пришлось ввести дополнительную команду для дублирования контента - </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于某些功能问题，Docker必须引入一个用于复制内容的附加命令</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: For ADD:
es: Para el TDA:
ja: ADDのために
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD의 경우 :</font></font>
ru: Для ADD:
zh_cn: 对于ADD:

source: For COPY:
es: Para la COPIA:
ja: COPYのために。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복사 :</font></font>
ru: Для КОПИ:
zh_cn: 对于复制。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For instance, if the file is locally available and you want to add it to the directory of an image, you type:
es: Por ejemplo,si el archivo está disponible localmente y quieres añadirlo al directorio de una imagen,teclea:
ja: 例えば、ファイルがローカルで利用可能で、それを画像のディレクトリに追加したい場合は、次のように入力します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, 파일이 로컬로 사용 가능하고 이미지의 디렉토리에 추가하려는 경우 다음을 입력하십시오.</font></font>
ru: Например,если файл локально доступен и вы хотите добавить его в каталог изображения,вы набираете:
zh_cn: 例如,如果文件是本地可用的,而你想把它添加到图像的目录中,你可以输入。

source: For other items (files, directories) that do not require <code>ADD</code>&rsquo;s tar auto-extraction capability, you should always use <code>COPY</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para otros elementos (archivos, directorios) que no requieren la </font><font style="vertical-align: inherit;">capacidad de extracci&oacute;n autom&aacute;tica de alquitr&aacute;n de </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , siempre debe usar </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のtar自動抽出機能を</font><font style="vertical-align: inherit;">必要としない他のアイテム（ファイル、ディレクトリ）の</font><font style="vertical-align: inherit;">場合は、常に</font></font> <code>COPY</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 tar 자동 추출 기능이 </font><font style="vertical-align: inherit;">필요하지 않은 다른 항목 (파일, 디렉토리) </font><font style="vertical-align: inherit;">의 경우 항상 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для других элементов (файлов, каталогов), которые не требуют </font><font style="vertical-align: inherit;">возможности автоматического извлечения tar из </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вы всегда должны использовать </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于不需要</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的tar自动提取功能的</font><font style="vertical-align: inherit;">其他项目（文件，目录）</font><font style="vertical-align: inherit;">，您应始终使用</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: For other items (files, directories) that do not require ADD&rsquo;s tar auto-extraction capability, you should always use COPY."
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para otros elementos (archivos, directorios) que no requieren la capacidad de extracci&oacute;n autom&aacute;tica de tar del ADD, siempre debe usar COPY ".</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADDのtar自動抽出機能を必要としない他のアイテム（ファイル、ディレクトリ）については、常にCOPYを使用する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD의 tar 자동 추출 기능이 필요하지 않은 다른 항목 (파일, 디렉토리)의 경우 항상 COPY를 사용해야합니다. "</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для других элементов (файлов, каталогов), которые не требуют возможности автоматического извлечения tar из ADD, вы всегда должны использовать COPY. "</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于不需要ADD的tar自动提取功能的其他项目（文件，目录），应始终使用COPY。&rdquo;</font></font>

source: From Docker docs:
es: De Docker docs:
ja: Dockerのドキュメントより。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker 문서에서 :</font></font>
ru: Из Докерских докторов:
zh_cn: 来自Docker docs。

source: From Docker docs: <a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy">https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde Docker docs: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker docsから：</font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker 문서에서 : </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Из документации Docker: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来自Docker文档：</font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#add-or-copy</font></font>
