Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that the <a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy">Best practices for writing Dockerfiles</a> suggests using <code>COPY</code> where the magic of <code>ADD</code> is not required. Otherwise, you (<em>since you had to look up this answer</em>) are likely to get surprised someday when you mean to copy <code>keep_this_archive_intact.tar.gz</code> into your container, but instead, you spray the contents onto your filesystem.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que las </font></font><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mejores pr&aacute;cticas para escribir Dockerfiles</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sugieren usar </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> donde </font><font style="vertical-align: inherit;">no se requiere </font><font style="vertical-align: inherit;">la magia de </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">De lo contrario, usted ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ya que tuvo que buscar esta respuesta</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) es probable que se sorprenda alg&uacute;n d&iacute;a cuando quiera copiar </font></font> <code>keep_this_archive_intact.tar.gz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en su contenedor, pero en su lugar, roc&iacute;e el contenido en su sistema de archivos.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfileを作成するため</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">ベストプラクティス</font><font style="vertical-align: inherit;">では、</font> <code>ADD</code> <font style="vertical-align: inherit;">のマジックが</font><font style="vertical-align: inherit;">不要な場合は</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用することをお</font><font style="vertical-align: inherit;">勧め</font><font style="vertical-align: inherit;">し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そうしないと、</font> <code>keep_this_archive_intact.tar.gz</code> <font style="vertical-align: inherit;">をコンテナー</font><font style="vertical-align: inherit;">にコピーする</font><font style="vertical-align: inherit;">つもりで</font><font style="vertical-align: inherit;">（</font><em><font style="vertical-align: inherit;">この答えを調べる必要があったため</font></em><font style="vertical-align: inherit;">）いつか驚かれる可能性があり</font><font style="vertical-align: inherit;">ますが、代わりにコンテンツをファイルシステムにスプレーします。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile을 작성</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 </font><font style="vertical-align: inherit;">모범 사례</font><font style="vertical-align: inherit;"> 는 </font> <code>ADD</code> <font style="vertical-align: inherit;"> 의 마법이 </font><font style="vertical-align: inherit;">필요하지 않은 </font></font> <code>COPY</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하도록</font><font style="vertical-align: inherit;"> 제안 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">그렇지 않으면 ( </font><em><font style="vertical-align: inherit;">이 답변을 찾아야했기 때문에</font></em><font style="vertical-align: inherit;"> ) </font> <code>keep_this_archive_intact.tar.gz</code> <font style="vertical-align: inherit;"> 를 컨테이너 </font><font style="vertical-align: inherit;">에 복사 </font><font style="vertical-align: inherit;">하려고</font><font style="vertical-align: inherit;"> 할 때 언젠가 놀랄 것입니다. </font><font style="vertical-align: inherit;">대신 파일 시스템에 내용을 뿌립니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font></font><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">лучшие практики для написания Dockerfiles</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предлагают использовать </font></font> <code>COPY</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где магия </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не требуется. </font><font style="vertical-align: inherit;">В противном случае вы ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">поскольку вам пришлось искать этот ответ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), скорее всего, однажды удивитесь, если захотите скопировать </font></font> <code>keep_this_archive_intact.tar.gz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в свой контейнер, но вместо этого вы распыляете содержимое на свою файловую систему.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，</font></font><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/#add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编写Dockerfile</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font><font style="vertical-align: inherit;">最佳实践</font><font style="vertical-align: inherit;">建议</font><font style="vertical-align: inherit;">在</font><font style="vertical-align: inherit;">不需要</font> <code>ADD</code> 的<font style="vertical-align: inherit;">情况下</font><font style="vertical-align: inherit;">使用</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">否则，</font><font style="vertical-align: inherit;">当您打算将</font> <code>keep_this_archive_intact.tar.gz</code> <font style="vertical-align: inherit;">复制</font><font style="vertical-align: inherit;">到您的容器中</font><font style="vertical-align: inherit;">时</font><font style="vertical-align: inherit;">，您（</font><em><font style="vertical-align: inherit;">因为您必须查找此答案</font></em><font style="vertical-align: inherit;">）可能有一天会感到惊讶</font><font style="vertical-align: inherit;">，而是将内容喷洒到文件系统上。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Optionally COPY accepts a flag <code>--from=&lt;name|index&gt;</code> that can be used to set the source location to a previous build stage (created with FROM .. AS ) that will be used instead of a build context sent by the user.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Opcionalmente, COPY acepta un indicador </font></font> <code>--from=&lt;name|index&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se puede usar para establecer la ubicaci&oacute;n de origen en una etapa de compilaci&oacute;n anterior (creada con FROM .. AS) que se usar&aacute; en lugar de un contexto de compilaci&oacute;n enviado por el usuario.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプションで、COPYは</font><font style="vertical-align: inherit;">、ユーザーが送信したビルドコンテキストの代わりに使用される（FROM .. ASで作成された）前のビルドステージにソースの場所を設定するために使用できる</font><font style="vertical-align: inherit;">フラグ</font></font> <code>--from=&lt;name|index&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">受け入れ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선택적으로 COPY는 </font><font style="vertical-align: inherit;">소스 위치를 사용자가 보낸 빌드 컨텍스트 대신 사용할 이전 빌드 단계 (FROM .. AS로 작성)로 설정하는 데 사용할 수있는 </font></font> <code>--from=&lt;name|index&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그를 허용합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Необязательно COPY принимает флаг </font></font> <code>--from=&lt;name|index&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который можно использовать для установки исходного местоположения на предыдущий этап сборки (созданный с помощью FROM .. AS), который будет использоваться вместо контекста сборки, отправленного пользователем.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可选地，COPY接受</font></font> <code>--from=&lt;name|index&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志，该标志</font><font style="vertical-align: inherit;">可用于将源位置设置为先前的构建阶段（使用FROM .. AS创建），该阶段将代替用户发送的构建上下文。</font></font>

source: Reference <a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77">straight from the source code</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Referencia </font></font><a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">directamente desde el c&oacute;digo fuente</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソースコードから直接</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소스 코드에서 직접</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ссылка </font></font><a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">прямо из исходного кода</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><a href="https://github.com/docker/docker/blob/670c8696a29825b23208496bd4d8e88b5faa7773/builder/dispatchers.go#L77"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接从源代码中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用</font><font style="vertical-align: inherit;">。</font></font>

source: Referring to comments bellow, the <code>ADD</code><a href="https://docs.docker.com/engine/reference/builder/#add">documentation</a> states that:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Refiri&eacute;ndose a los comentarios a continuaci&oacute;n, la </font><a href="https://docs.docker.com/engine/reference/builder/#add"><font style="vertical-align: inherit;">documentaci&oacute;n </font></a></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> establece que:</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下のコメントを参照して、</font></font> <code>ADD</code> <a href="https://docs.docker.com/engine/reference/builder/#add"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は次のように述べています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 주석을 참조하면 </font></font> <code>ADD</code> <a href="https://docs.docker.com/engine/reference/builder/#add"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명서에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음과 같이 명시되어 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ссылаясь на комментарии ниже, в </font><a href="https://docs.docker.com/engine/reference/builder/#add"><font style="vertical-align: inherit;">документации </font></a></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> говорится, что:</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关于下面的评论，</font></font> <code>ADD</code> <a href="https://docs.docker.com/engine/reference/builder/#add"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指出：</font></font>

source: Results in fewer cache invalidations for the RUN step, than if you put the COPY . /tmp/ before it.
es: Resulta en menos invalidaciones de la memoria caché para el paso RUN,que si pones el COPY.tmp antes de él.
ja: 結果として、RUNステップの前にCOPY .tmpを置いた場合に比べて、RUNステップでのキャッシュの無効化が少なくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY를 넣을 때보 다 RUN 단계에 대한 캐시 무효화가 줄어 듭니다. </font><font style="vertical-align: inherit;">그 전에 / tmp /.</font></font>
ru: Это приводит к меньшему количеству аннулирований кэша на шаге RUN,чем если бы вы поставили COPY.tmp перед ним.
zh_cn: 结果是在RUN步骤中的缓存无效,比把COPY .

source: Same as 'ADD', but without the tar and remote URL handling.
es: Lo mismo que 'ADD',pero sin el alquitrán y el manejo remoto de la URL.
ja: ADD' と同じですが、tar とリモート URL の扱いがありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'ADD'와 동일하지만 tar 및 원격 URL 처리가 없습니다.</font></font>
ru: То же самое,что и 'ADD',но без tar и удаленной обработки URL.
zh_cn: 和'ADD'一样,但没有焦油和远程URL处理。

source: Since Docker 17.05 <code>COPY</code> is used with the <code>--from</code> flag in <a href="https://docs.docker.com/develop/develop-images/multistage-build/">multi-stage builds</a> to copy artifacts from previous build stages to the current build stage.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde Docker 17.05 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se usa con el </font><font style="vertical-align: inherit;">indicador </font></font> <code>--from</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font></font><a href="https://docs.docker.com/develop/develop-images/multistage-build/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">compilaciones de varias etapas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para copiar artefactos de las etapas de compilaci&oacute;n anteriores a la etapa de compilaci&oacute;n actual.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker 17.05以降、</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font><a href="https://docs.docker.com/develop/develop-images/multistage-build/"><font style="vertical-align: inherit;">マルチステージビルド</font></a><font style="vertical-align: inherit;">で</font></font> <code>--from</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグ</font><font style="vertical-align: inherit;">と共に使用され、</font><font style="vertical-align: inherit;">以前のビルドステージから現在のビルドステージにアーティファクトをコピーします。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker 17.05 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font><a href="https://docs.docker.com/develop/develop-images/multistage-build/"><font style="vertical-align: inherit;">다단계 빌드</font></a><font style="vertical-align: inherit;"> 에서 </font></font> <code>--from</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그 </font><font style="vertical-align: inherit;">와 함께 사용되어 </font><font style="vertical-align: inherit;">이전 빌드 단계에서 현재 빌드 단계로 아티팩트를 복사합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поскольку Docker 17.05 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется с </font><font style="vertical-align: inherit;">флагом </font></font> <code>--from</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><a href="https://docs.docker.com/develop/develop-images/multistage-build/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">многоэтапных сборках</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для копирования артефактов с предыдущих этапов сборки на текущий этап сборки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于</font><font style="vertical-align: inherit;">在</font><a href="https://docs.docker.com/develop/develop-images/multistage-build/"><font style="vertical-align: inherit;">多阶段构建</font></a><font style="vertical-align: inherit;">中将</font><font style="vertical-align: inherit;">Docker 17.05 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>--from</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志一起</font><font style="vertical-align: inherit;">使用，</font><font style="vertical-align: inherit;">以将工件从先前的构建阶段复制到当前的构建阶段。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: So, why do we have two commands, and how do we know when to use one or the other?
es: Entonces,¿por qué tenemos dos comandos,y cómo sabemos cuándo usar uno o el otro?
ja: では、なぜ2つのコマンドがあり、どちらか一方を使うタイミングを知るにはどうすればいいのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇다면 왜 우리는 두 가지 명령을 가지고 있으며, 언제 하나를 사용할지 어떻게 알 수 있습니까?</font></font>
ru: Итак,почему у нас две команды,и как мы знаем,когда использовать ту или иную?
zh_cn: 那么,为什么会有两个命令,我们又该如何知道什么时候使用一个或另一个命令呢?

source: Source: <a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile">https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font><a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出典：</font></font><a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 : </font></font><a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来源：</font></font><a href="https://nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">//nickjanetakis.com/blog/docker-tip-2-the-difference-between-copy-and-add-in-a-dockerile</font><font style="vertical-align: inherit;">：</font></font>
