Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The ADD instruction will copy new files from <code>&lt;src&gt;</code> and add them to the container's filesystem at path <code>&lt;dest&gt;</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La instrucci&oacute;n ADD copiar&aacute; los archivos nuevos de </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los agregar&aacute; al sistema de archivos del contenedor en la ruta </font></font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD命令は、</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から新しいファイルをコピー</font><font style="vertical-align: inherit;">し、パス</font></font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にあるコンテナーのファイルシステムに追加します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD 명령어는 </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 새 파일을 복사 </font><font style="vertical-align: inherit;">하여 </font></font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경로의 컨테이너 파일 시스템에 추가합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Инструкция ADD скопирует новые файлы из </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и добавит их в файловую систему контейнера по пути </font></font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ADD指令将从</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">复制新文件</font><font style="vertical-align: inherit;">，并将它们添加到路径为</font></font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的容器文件系统中</font><font style="vertical-align: inherit;">。</font></font>

source: The COPY instruction will copy new files from <code>&lt;src&gt;</code> and add them to the container's filesystem at path <code>&lt;dest&gt;</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La instrucci&oacute;n COPY copiar&aacute; los archivos nuevos de </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los agregar&aacute; al sistema de archivos del contenedor en la ruta </font></font> <code>&lt;dest&gt;</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY命令は、</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から新しいファイルをコピー</font><font style="vertical-align: inherit;">し、パス</font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;">にあるコンテナーのファイルシステムに追加します。</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY 명령어는 </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 새 파일을 복사 </font><font style="vertical-align: inherit;">하여 </font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;"> 경로의 컨테이너 파일 시스템에 추가합니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Инструкция COPY скопирует новые файлы из </font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и добавит их в файловую систему контейнера по пути </font></font> <code>&lt;dest&gt;</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COPY指令将从</font></font> <code>&lt;src&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">复制新文件</font><font style="vertical-align: inherit;">，并将它们添加到路径为</font> <code>&lt;dest&gt;</code> <font style="vertical-align: inherit;">的容器文件系统中。</font></font><font style="vertical-align: inherit;"></font>

source: The Docker team also strongly discourages using <strong><code>ADD</code></strong> to download and copy a package from a URL. Instead, it&rsquo;s safer and more efficient to use wget or curl within a <strong><code>RUN</code></strong> command. By doing so, you avoid creating an additional image layer and save space.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El equipo de Docker tambi&eacute;n desaconseja utilizar </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para descargar y copiar un paquete desde una URL. </font><font style="vertical-align: inherit;">En cambio, es m&aacute;s seguro y m&aacute;s eficiente usar wget o curl dentro de un </font><font style="vertical-align: inherit;">comando </font></font><strong> <code>RUN</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Al hacerlo, evita crear una capa de imagen adicional y ahorra espacio.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerチームは、</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">してURLからパッケージをダウンロードおよびコピーすること</font><font style="vertical-align: inherit;">も強くお勧めしません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">代わりに、</font></font><strong> <code>RUN</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">内でwgetまたはcurlを使用する方がより安全で効率的</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">そうすることで、追加の画像レイヤーの作成を避け、スペースを節約できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker 팀은 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하여 </font><font style="vertical-align: inherit;">URL에서 패키지를 다운로드하고 복사 </font><font style="vertical-align: inherit;">하지 않는 것이 좋습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">대신 </font></font><strong> <code>RUN</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">내에서 wget 또는 curl을 사용하는 것이 더 안전하고 효율적 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">이렇게하면 추가 이미지 레이어를 만들지 않고 공간을 절약 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Команда Docker также настоятельно рекомендует использовать </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для загрузки и копирования пакета с URL-адреса. </font><font style="vertical-align: inherit;">Вместо этого безопаснее и эффективнее использовать wget или curl в </font><font style="vertical-align: inherit;">команде </font></font><strong> <code>RUN</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Тем самым вы избегаете создания дополнительного слоя изображения и экономите место.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Docker团队还强烈不建议使用</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从URL下载和复制软件包。</font><font style="vertical-align: inherit;">相反，在</font></font><strong> <code>RUN</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令中</font><font style="vertical-align: inherit;">使用wget或curl更安全，更有效</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这样可以避免创建额外的图像层并节省空间。</font></font>

source: The basic syntax for the <strong><code>ADD</code></strong> command is:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La sintaxis b&aacute;sica para el </font><font style="vertical-align: inherit;">comando </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es:</font></font>
ja: <font style="vertical-align: inherit;"></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">の基本的な構文は次のとおり</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">의 기본 구문 </font><font style="vertical-align: inherit;">은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Основной синтаксис команды </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">的基本语法为</font><font style="vertical-align: inherit;">：</font></font>

source: The command copies files/directories to a file system of the specified container.
es: El comando copia los directorios de archivos a un sistema de archivos del contenedor especificado.
ja: このコマンドは、指定したコンテナのファイルシステムにファイルディレクトリをコピーします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 명령은 파일 / 디렉토리를 지정된 컨테이너의 파일 시스템으로 복사합니다.</font></font>
ru: Команда копирует каталоги файлов в файловую систему указанного контейнера.
zh_cn: 该命令将文件目录复制到指定容器的文件系统中。

source: The following will execute in one container:
es: Lo siguiente se ejecutará en un contenedor:
ja: 1つのコンテナで以下を実行します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 컨테이너에서 다음이 실행됩니다.</font></font>
ru: В одном контейнере будет выполнено следующее:
zh_cn: 以下内容将在一个容器中执行。

source: The instruction can be used only for locally stored files. Therefore, you cannot use it with URLs to copy external files to your container.
es: La instrucción sólo puede utilizarse para los archivos almacenados localmente.Por lo tanto,no se puede utilizar con las URL para copiar archivos externos a su contenedor.
ja: この命令は、ローカルに保存されたファイルに対してのみ使用できます。したがって、外部ファイルをコンテナにコピーするためのURLと一緒に使用することはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 명령은 로컬로 저장된 파일에만 사용할 수 있습니다. </font><font style="vertical-align: inherit;">따라서 URL과 함께 사용하여 외부 파일을 컨테이너에 복사 할 수 없습니다.</font></font>
ru: Инструкция может быть использована только для локально хранящихся файлов.Поэтому вы не можете использовать ее с URL для копирования внешних файлов в ваш контейнер.
zh_cn: 该指令只能用于本地存储的文件。因此,您不能将其与URL一起使用,将外部文件复制到您的容器中。

source: There is some official documentation on that point: <a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy">Best Practices for Writing Dockerfiles</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay algo de documentaci&oacute;n oficial sobre ese punto: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mejores pr&aacute;cticas para escribir archivos Docker</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その点についてはいくつかの公式ドキュメントがあります：</font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfilesを作成するためのベストプラクティス</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 시점에서 공식 문서가 있습니다 : </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile 작성을위한 모범 사례</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует некоторая официальная документация по этому вопросу: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Лучшие практики для написания Dockerfiles</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关于这一点，有一些官方文档：</font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编写Dockerfile的最佳实践</font></font></a>

source: This is another way to copy files into an image. The -v option temporarily creates a volume that us used during the build process.
es: Esta es otra forma de copiar archivos en una imagen.La opción -v crea temporalmente un volumen que usamos durante el proceso de construcción.
ja: これはファイルをイメージにコピーするもう一つの方法です。v オプションは、ビルド中に使用するボリュームを一時的に作成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일에 이미지를 복사하는 또 다른 방법입니다. </font><font style="vertical-align: inherit;">-v 옵션은 빌드 과정에서 사용한 볼륨을 임시로 만듭니다.</font></font>
ru: Это еще один способ копирования файлов в изображение.Опция -v временно создает том,который мы использовали в процессе сборки.
zh_cn: 这是另一种将文件复制到映像中的方法。-v 选项临时创建一个卷,在构建过程中使用。

source: This is different that other volumes because it mounts a host directory for the build only. Files can be copied using a standard cp command.
es: Esto es diferente a otros volúmenes porque monta un directorio de host sólo para la construcción.Los archivos pueden ser copiados usando un comando cp estándar.
ja: これは他のボリュームとは異なり、ビルド専用のホストディレクトリをマウントします。ファイルは標準の cp コマンドでコピーできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빌드 전용 호스트 디렉토리를 마운트하기 때문에 다른 볼륨과 다릅니다. </font><font style="vertical-align: inherit;">표준 cp 명령을 사용하여 파일을 복사 할 수 있습니다.</font></font>
ru: Это отличается от других томов тем,что монтирует каталог хоста только для сборки.Файлы могут быть скопированы с помощью стандартной команды cp.
zh_cn: 这与其他卷不同,因为它只为构建的主机目录挂载一个主机目录。可以使用标准的 cp 命令复制文件。

source: This means that although ADD removes the tar file, it is still kept somewhere. And its making the image bigger!!
es: Esto significa que aunque ADD elimina el archivo tar,todavía se mantiene en algún lugar.Y está haciendo la imagen más grande!!
ja: これはADDがtarファイルを削除しても、どこかに保存されていることを意味します。そして、それは画像を大きくしています!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이는 ADD가 tar 파일을 제거하더라도 여전히 어딘가에 유지됨을 의미합니다. </font><font style="vertical-align: inherit;">그리고 그것은 이미지를 더 크게 만듭니다 !!</font></font>
ru: Это означает,что хотя ADD удаляет tar-файл,он все равно где-то хранится.И это делает изображение больше!
zh_cn: 这意味着,虽然ADD删除了焦油文件,但它仍然保留在某个地方。而且它使图像变大了!

source: To use the <code>COPY</code> instruction, follow the basic command format:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para usar la </font><font style="vertical-align: inherit;">instrucci&oacute;n </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , siga el formato de comando b&aacute;sico:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">には、基本的なコマンド形式に従います。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">을 사용하려면 </font><font style="vertical-align: inherit;">기본 명령 형식을 따르십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы использовать </font><font style="vertical-align: inherit;">инструкцию </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , следуйте основному формату команды:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要使用</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令，请遵循基本命令格式：</font></font>

source: Type in the source and where you want the command to extract the content as follows:
es: Escriba la fuente y el lugar donde quiere que el comando extraiga el contenido de la siguiente manera:
ja: 以下のように、ソースとコマンドで内容を抽出したい場所を入力します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소스를 입력하고 명령이 다음과 같이 컨텐츠를 추출 할 위치를 입력하십시오.</font></font>
ru: Введите источник и место,где вы хотите,чтобы команда для извлечения содержимого следующим образом:
zh_cn: 输入你想要提取内容的来源和命令的位置,如下图所示。

source: Unlike its closely related <strong><code>ADD</code></strong> command, <strong><code>COPY</code></strong> only has only one assigned function. Its role is to duplicate files/directories in a specified location in their existing format. This means that it doesn&rsquo;t deal with extracting a compressed file, but rather copies it as-is.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A diferencia de su </font><font style="vertical-align: inherit;">comando </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> estrechamente relacionado </font><font style="vertical-align: inherit;">, </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo tiene una funci&oacute;n asignada. </font><font style="vertical-align: inherit;">Su funci&oacute;n es duplicar archivos / directorios en una ubicaci&oacute;n espec&iacute;fica en su formato existente. </font><font style="vertical-align: inherit;">Esto significa que no se trata de extraer un archivo comprimido, sino que lo copia tal como est&aacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">密接に関連する</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">とは異なり</font><font style="vertical-align: inherit;">、</font></font><strong> <code>COPY</code> に</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は割り当てられた関数が1つしかありません。</font><font style="vertical-align: inherit;">その役割は、指定された場所にあるファイル/ディレクトリを既存の形式で複製することです。</font><font style="vertical-align: inherit;">つまり、圧縮ファイルの抽出は処理されず、そのままコピーされます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">밀접하게 관련된 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">과 달리 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에는 하나의 할당 된 기능 만 있습니다. </font><font style="vertical-align: inherit;">그 역할은 지정된 형식으로 파일 / 디렉토리를 기존 형식으로 복제하는 것입니다. </font><font style="vertical-align: inherit;">이는 압축 파일 추출을 처리하지 않고 그대로 복사하는 것을 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В отличие от тесно связанной </font><font style="vertical-align: inherit;">команды </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет только одну назначенную функцию. </font><font style="vertical-align: inherit;">Его роль заключается в дублировании файлов / каталогов в указанном месте в их существующем формате. </font><font style="vertical-align: inherit;">Это означает, что он не занимается извлечением сжатого файла, а копирует его как есть.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与其密切相关的</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令不同，</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅分配了一个功能。</font><font style="vertical-align: inherit;">它的作用是按照现有格式在指定位置复制文件/目录。</font><font style="vertical-align: inherit;">这意味着它不处理提取压缩文件，而是按原样复制它。</font></font>

source: Use <strong><code>ADD</code></strong> for downloading remote resources, extracting TAR files, etc..
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para descargar recursos remotos, extraer archivos TAR, etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リモートリソースのダウンロード、TARファイルの抽出などに</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원격 자원 다운로드, TAR 파일 추출 등에 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для загрузки удаленных ресурсов, извлечения файлов TAR и т. Д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载远程资源，提取TAR文件等。</font></font>
