Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I had to <code>COPY</code> and untar java package in my docker image. When I compared the docker image size created using ADD it was 180MB bigger than the one created using COPY, tar -xzf *.tar.gz and rm *.tar.gz
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tuve que </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y descomprimir el paquete de Java en mi imagen acoplable. </font><font style="vertical-align: inherit;">Cuando compar&eacute; el tama&ntilde;o de la imagen acoplada creado con ADD, era 180 MB m&aacute;s grande que el creado con COPY, tar -xzf * .tar.gz y rm * .tar.gz</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dockerイメージのjavaパッケージ</font><font style="vertical-align: inherit;">を</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">して解凍する</font><font style="vertical-align: inherit;">必要がありました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ADDを使用して作成されたDockerイメージのサイズを比較すると、COPYを使用して作成されたものよりも180MB大きくなりました。tar-xzf * .tar.gzおよびrm * .tar.gz</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도커 이미지에서 Java 패키지 </font><font style="vertical-align: inherit;">를 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 untar </font><font style="vertical-align: inherit;">해야했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">ADD를 사용하여 만든 도커 이미지 크기를 비교할 때 COPY, tar -xzf * .tar.gz 및 rm * .tar.gz를 사용하여 만든 도커 이미지 크기보다 180MB가 큽니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мне пришлось </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и распаковать Java-пакет в моем образе докера. </font><font style="vertical-align: inherit;">Когда я сравнил размер образа докера, созданного с помощью ADD, он оказался на 180 МБ больше, чем размер, созданный с помощью COPY, tar -xzf * .tar.gz и rm * .tar.gz.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我必须</font><font style="vertical-align: inherit;">在Docker映像中</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并解压缩Java包。</font><font style="vertical-align: inherit;">当我比较使用ADD创建的docker镜像大小时，它比使用COPY，tar -xzf * .tar.gz和rm * .tar.gz创建的镜像大180MB。</font></font>

source: If is a local tar archive in a recognized compression format (identity, gzip, bzip2 or xz) then it is unpacked as a directory. Resources from remote URLs are not decompressed.
es: Si es un archivo local de alquitrán en un formato de compresión reconocido (identity,gzip,bzip2 o xz)entonces se desempaqueta como un directorio.Los recursos de las URL remotas no se descomprimen.
ja: 認識された圧縮形式 (identity、gzip、bzip2、または xz)のローカル tar アーカイブの場合は、ディレクトリとして展開されます。リモート URL からのリソースは解凍されません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인식 된 압축 형식 (ID, gzip, bzip2 또는 xz)의 로컬 tar 아카이브 인 경우 디렉토리로 압축이 풀립니다. </font><font style="vertical-align: inherit;">원격 URL의 리소스는 압축 해제되지 않습니다.</font></font>
ru: Если это локальный tar-архив в распознанном формате сжатия (identity,gzip,bzip2 или xz),то он распаковывается как каталог.Ресурсы из удаленных URL не распаковываются.
zh_cn: 如果是一个本地的压缩格式(identify、gzip、bzip2或xz),那么它将被解压缩为一个目录。来自远程URL的资源不会被解压。

source: If you have multiple Dockerfile steps that use different files from your context, COPY them individually, rather than all at once. This will ensure that each step&rsquo;s build cache is only invalidated (forcing the step to be re-run) if the specifically required files change.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si tiene varios pasos de Dockerfile que usan diferentes archivos de su contexto, COPIELOS individualmente, en lugar de todos a la vez. </font><font style="vertical-align: inherit;">Esto garantizar&aacute; que la memoria cach&eacute; de compilaci&oacute;n de cada paso solo se invalide (obligando a que el paso se vuelva a ejecutar) si cambian los archivos espec&iacute;ficamente requeridos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンテキストから異なるファイルを使用する複数のDockerfileステップがある場合は、一度にすべてではなく、個別にコピーします。</font><font style="vertical-align: inherit;">これにより、特に必要なファイルが変更された場合にのみ、各ステップのビルドキャッシュが無効化される（ステップを強制的に再実行する）ことが確実になります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨텍스트와 다른 파일을 사용하는 여러 Dockerfile 단계가있는 경우 한 번에가 아니라 개별적으로 복사하십시오. </font><font style="vertical-align: inherit;">이렇게하면 특별히 필요한 파일이 변경 될 경우 각 단계의 빌드 캐시가 무효화됩니다 (단계를 다시 실행해야 함).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если у вас есть несколько шагов Dockerfile, которые используют разные файлы из вашего контекста, скопируйте их по отдельности, а не все сразу. </font><font style="vertical-align: inherit;">Это гарантирует, что кэш сборки каждого шага становится недействительным (что приводит к повторному запуску шага), если изменяются специально необходимые файлы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您有多个使用不同上下文的文件的Dockerfile步骤，请单独复制而不是一次全部复制。</font><font style="vertical-align: inherit;">这将确保仅在特别需要的文件发生更改时，才使每个步骤的构建缓存无效（强制重新运行该步骤）。</font></font>

source: If you need to copy from the local build context into a container, stick to using <strong><code>COPY</code></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si necesita copiar desde el contexto de compilaci&oacute;n local en un contenedor, utilice </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ローカルビルドコンテキストからコンテナーにコピーする必要がある場合は、</font></font><strong> <code>COPY</code> の</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用に固執し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로컬 빌드 컨텍스트에서 컨테이너로 복사해야하는 경우 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용을 고수하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам нужно скопировать из локального контекста сборки в контейнер, используйте </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果需要从本地构建上下文复制到容器中，请坚持使用</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If you want to add a xx.tar.gz to a <code>/usr/local</code> in container, unzip it, and then remove the useless compressed package.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea agregar un xx.tar.gz a </font></font> <code>/usr/local</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el contenedor, descompr&iacute;malo y luego elimine el paquete comprimido in&uacute;til.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">xx.tar.gzを</font><font style="vertical-align: inherit;">コンテナー内の</font></font> <code>/usr/local</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">追加する</font><font style="vertical-align: inherit;">場合は、それを解凍して、</font><font style="vertical-align: inherit;">不要</font><font style="vertical-align: inherit;">な圧縮パッケージを削除します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨테이너 </font><font style="vertical-align: inherit;">의 </font></font> <code>/usr/local</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">xx.tar.gz를 추가하려면 </font><font style="vertical-align: inherit;">압축을 풀고 쓸모없는 압축 패키지를 제거하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите добавить xx.tar.gz в </font></font> <code>/usr/local</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в контейнере, разархивируйте его, а затем удалите ненужный сжатый пакет.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要将xx.tar.gz添加到容器中的</font></font> <code>/usr/local</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，请解压缩它，然后删除无用的压缩包。</font></font>

source: If you&rsquo;re copying in local files to your Docker image, always use COPY because it&rsquo;s more explicit.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; copiando archivos locales en su imagen de Docker, use siempre COPY porque es m&aacute;s expl&iacute;cito.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ローカルファイルをDockerイメージにコピーする場合は、より明確であるため、常にCOPYを使用してください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로컬 파일을 Docker 이미지로 복사하는 경우 더 명확하므로 항상 COPY를 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы копируете локальные файлы в образ Docker, всегда используйте COPY, потому что это более явно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要将本地文件复制到Docker映像中，请始终使用COPY，因为它更加明确。</font></font>

source: Important Note
es: Nota importante
ja: 重要な注意事項
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중요 사항</font></font>
ru: Важная заметка
zh_cn: 重要提示

source: It includes the source you want to copy (<strong><code>&lt;src&gt;</code></strong>) followed by the destination where you want to store it (<strong><code>&lt;dest&gt;</code></strong>). If the source is a directory, <strong><code>ADD</code></strong> copies everything inside of it (including file system metadata).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Incluye el origen que desea copiar ( </font></font><strong> <code>&lt;src&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) seguido del destino donde desea almacenarlo ( </font></font><strong> <code>&lt;dest&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Si la fuente es un directorio, </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> copia todo lo que contiene (incluidos los metadatos del sistema de archivos).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コピーするソース（</font></font><strong> <code>&lt;src&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）の後に、保存先（</font></font><strong> <code>&lt;dest&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">が続きます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ソースがディレクトリの場合、</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はその</font><font style="vertical-align: inherit;">中のすべてをコピーします（ファイルシステムメタデータを含む）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복사하려는 소스 ( </font></font><strong> <code>&lt;src&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )와 저장하려는 대상 ( </font></font><strong> <code>&lt;dest&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )이 포함됩니다. </font><font style="vertical-align: inherit;">소스가 디렉토리 인 경우 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 내부의 모든 것을 복사합니다 (파일 시스템 메타 데이터 포함).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он включает источник, который вы хотите скопировать ( </font></font><strong> <code>&lt;src&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), а также место назначения, где вы хотите его сохранить ( </font></font><strong> <code>&lt;dest&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Если источником является каталог, </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> копирует все внутри него (включая метаданные файловой системы).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它包括要复制的源（</font></font><strong> <code>&lt;src&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），后跟要存储它的</font></font><strong> <code>&lt;dest&gt;</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><strong><font style="vertical-align: inherit;">&lt;dest&gt;</font></strong><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">如果源是目录，则</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">复制其中的所有内容（包括文件系统元数据）。</font></font>

source: Let&rsquo;s start by noting that the <strong><code>ADD</code></strong> command is older than <strong><code>COPY</code></strong>. Since the launch of the Docker platform, the <strong><code>ADD</code></strong> instruction has been part of its list of commands.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Comencemos notando que el </font><font style="vertical-align: inherit;">comando </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es anterior a </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Desde el lanzamiento de la plataforma Docker, la </font><font style="vertical-align: inherit;">instrucci&oacute;n </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ha sido parte de su lista de comandos.</font></font>
ja: <font style="vertical-align: inherit;"></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドが</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも古い</font><font style="vertical-align: inherit;">ことに注意してみましょう</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">Dockerプラットフォームのリリース以来、</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令はコマンドリストの一部になっています。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 오래 </font><font style="vertical-align: inherit;">되었다는 점에 주목하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Docker 플랫폼이 출시 된 이후 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령어는 명령 목록의 일부였습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начнем с того, что команда </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> старше, чем </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">С момента запуска платформы Docker </font><font style="vertical-align: inherit;">инструкция </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> была частью ее списка команд.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">首先，请注意</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令早于</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">自从Docker平台启动以来，</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令已成为其命令列表的一部分。</font></font>

source: More: <a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy">Best practices for writing Dockerfiles</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&aacute;s: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mejores pr&aacute;cticas para escribir Dockerfiles</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細：</font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfileを作成するためのベストプラクティス</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더보기 : </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile 작성을위한 모범 사례</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подробнее: </font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Лучшие практики для написания Dockerfiles</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更多：</font></font><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/#/add-or-copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编写Dockerfile的最佳实践</font></font></a>
