Repository: rueisnom/feedback
Catalog: xlf/24/95/81/40/24958140.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Use <strong><code>COPY</code></strong> for simply copying files and/or directories into the build context.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para simplemente copiar archivos y / o directorios en el contexto de compilaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して、ファイルやディレクトリをビルドコンテキストに単純にコピーします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일 및 / 또는 디렉토리를 빌드 컨텍스트에 간단히 복사 </font><font style="vertical-align: inherit;">하려면 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для простого копирования файлов и / или каталогов в контекст сборки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以简单地将文件和/或目录复制到构建上下文中。</font></font>

source: What is the difference between the 'COPY' and 'ADD' commands in a Dockerfile
es: ¿Cuál es la diferencia entre los comandos "COPIAR" y "AÑADIR" en un Dockerfile
ja: Dockerfileの'COPY'と'ADD'コマンドの違いは何ですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile에서 'COPY'와 'ADD'명령의 차이점은 무엇입니까?</font></font>
ru: В чем разница между командами 'COPY' и 'ADD' в файле докера.
zh_cn: Docker文件中的'COPY'和'ADD'命令有什么区别?

source: What is the difference between the <code>COPY</code> and <code>ADD</code> commands in a Dockerfile, and when would I use one over the other?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Cu&aacute;l es la diferencia entre los </font><font style="vertical-align: inherit;">comandos </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en un Dockerfile, y cu&aacute;ndo usar&iacute;a uno sobre el otro?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfileの</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">と</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド</font><font style="vertical-align: inherit;">の違いは何ですか？</font><font style="vertical-align: inherit;">また、いつどちらを使用するのですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile에서 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령 </font><font style="vertical-align: inherit;">의 차이점은 무엇이며 언제 다른 </font><font style="vertical-align: inherit;">명령을 사용합니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В чем разница между </font><font style="vertical-align: inherit;">командами </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Dockerfile и когда я буду использовать одну поверх другой?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile中</font><font style="vertical-align: inherit;">的</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">之间有什么区别，什么</font><font style="vertical-align: inherit;">时候可以在另一个上使用？</font></font>

source: When creating a Dockerfile, <strong>there are two commands that you can use to copy files/directories</strong> into it &ndash; <strong><code>ADD</code></strong> and <strong><code>COPY</code></strong>. Although there are slight differences in the scope of their function, they essentially perform the same task.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al crear un Dockerfile, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">hay dos comandos que puede usar para copiar archivos / directorios</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en &eacute;l: </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Aunque existen ligeras diferencias en el alcance de su funci&oacute;n, esencialmente realizan la misma tarea.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfileを作成する場合、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そこにファイル/ディレクトリをコピーするために使用できる2つのコマンド</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &ndash; </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><strong> <code>COPY</code> があり</strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">それらの機能の範囲にはわずかな違いがありますが、基本的に同じタスクを実行します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dockerfile을 작성할 때 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일 / 디렉토리</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 </font><strong><font style="vertical-align: inherit;">복사하는 데 사용할 수있는 두 가지 명령이 있습니다</font></strong><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">기능 범위에 약간의 차이가 있지만 본질적으로 동일한 작업을 수행합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При создании Dockerfile </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">есть две команды, которые вы можете использовать для копирования в него файлов / каталогов</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Хотя существуют небольшие различия в объеме их функций, они по сути выполняют ту же задачу.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">创建Dockerfile时，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以使用两个命令将文件/目录复制</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到其中：</font></font><strong> <code>ADD</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong> <code>COPY</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">尽管它们的功能范围略有不同，但是它们实际上执行相同的任务。</font></font>

source: Which command to use?(Best Practice)
es: ¿Qué comando usar?
ja: どのコマンドを使うか(ベストプラクティス)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 명령을 사용해야합니까? (모범 사례)</font></font>
ru: Какую команду использовать? (Лучшая практика)
zh_cn: 使用哪种命令(最佳实践)?

source: With the options set thus:
es: Con las opciones establecidas así:
ja: このようにオプションを設定した状態で
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">옵션이 설정되어 있으면 :</font></font>
ru: С установленными таким образом опциями:
zh_cn: 在这样设置了选项的情况下:

source: You should check the <a href="https://docs.docker.com/engine/reference/builder/#add"><code>ADD</code></a> and <a href="https://docs.docker.com/engine/reference/builder/#copy"><code>COPY</code></a> documentation for a more detailed description of their behaviors, but in a nutshell, the major difference is that <code>ADD</code> can do more than <code>COPY</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debe consultar la </font><font style="vertical-align: inherit;">documentaci&oacute;n de </font></font><a href="https://docs.docker.com/engine/reference/builder/#add"> <code>ADD</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"> <code>COPY</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener una descripci&oacute;n m&aacute;s detallada de sus comportamientos, pero en pocas palabras, la principal diferencia es que </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede hacer m&aacute;s que </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">動作の詳細については</font><font style="vertical-align: inherit;">、</font></font><a href="https://docs.docker.com/engine/reference/builder/#add"> <code>ADD</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"> <code>COPY</code> の</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメントを</font><font style="vertical-align: inherit;">確認する必要</font><font style="vertical-align: inherit;">がありますが、簡単に言えば、</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも多くのことができる</font><font style="vertical-align: inherit;">という点が大きく異なり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 확인해야 </font></font><a href="https://docs.docker.com/engine/reference/builder/#add"> <code>ADD</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"> <code>COPY</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자신의 행동에 대한 자세한 설명은 문서를하지만, 간단히 말해서, 주요 차이점은입니다 </font></font> <code>ADD</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 더 많은 작업을 수행 할 수 있습니다 </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы должны проверить </font><font style="vertical-align: inherit;">документацию </font></font><a href="https://docs.docker.com/engine/reference/builder/#add"> <code>ADD</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"> <code>COPY</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для более подробного описания их поведения, но в двух словах, главное отличие состоит в том, что </font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может делать больше, чем </font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您应该查看</font></font><a href="https://docs.docker.com/engine/reference/builder/#add"> <code>ADD</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"> <code>COPY</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档以获取有关其行为的更详细描述，但简而言之，主要区别在于</font></font> <code>ADD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以做的比</font></font> <code>COPY</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还多</font><font style="vertical-align: inherit;">：</font></font>

source: from the <a href="https://docs.docker.com/engine/reference/builder/#copy">documentation</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de la </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentaci&oacute;n</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="https://docs.docker.com/engine/reference/builder/#copy"><font style="vertical-align: inherit;">ドキュメント</font></a><font style="vertical-align: inherit;">から</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로부터 </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문서</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">из </font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">документации</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><a href="https://docs.docker.com/engine/reference/builder/#copy"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档中</font></font></a>
