Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I myself prefer using an existing OpenUDID implementation (see <a href="https://github.com/ylechelle/OpenUDID">https://github.com/ylechelle/OpenUDID</a>) for Android (see <a href="https://github.com/vieux/OpenUDID">https://github.com/vieux/OpenUDID</a>). It is easy to integrate and makes use of the <code>ANDROID_ID</code> with fallbacks for those issues mentioned above.
es: Yo mismo prefiero usar una implementaci&oacute;n de OpenUDID existente (consulte <a href="https://github.com/ylechelle/OpenUDID">https://github.com/ylechelle/OpenUDID</a> ) para Android (consulte <a href="https://github.com/vieux/OpenUDID">https://github.com/vieux/OpenUDID</a> ). Es f&aacute;cil de integrar y utiliza <code>ANDROID_ID</code> con retrocesos para los problemas mencionados anteriormente.
ja: 私自身は、Android用の既存のOpenUDID実装（ <a href="https://github.com/ylechelle/OpenUDID">https://github.com/ylechelle/OpenUDIDを</a>参照）を使用することを好みます （ <a href="https://github.com/vieux/OpenUDID">https://github.com/vieux/OpenUDIDを</a>参照）。 <code>ANDROID_ID</code> は統合が簡単で、上記の問題のフォールバックを利用できます。
ko: 본인은 Android 용 기존 OpenUDID 구현 ( <a href="https://github.com/ylechelle/OpenUDID">https://github.com/ylechelle/OpenUDID 참조</a> )을 선호합니다 ( <a href="https://github.com/vieux/OpenUDID">https://github.com/vieux/OpenUDID 참조</a> ). 위에서 언급 한 문제에 대해 <code>ANDROID_ID</code> 를 쉽게 통합하고 대체 할 수 있습니다.
ru: Я сам предпочитаю использовать существующую реализацию OpenUDID (см. <a href="https://github.com/ylechelle/OpenUDID">Https://github.com/ylechelle/OpenUDID</a> ) для Android (см. <a href="https://github.com/vieux/OpenUDID">Https://github.com/vieux/OpenUDID</a> ). Он легко интегрируется и использует <code>ANDROID_ID</code> с запасными вариантами для упомянутых выше проблем.
zh_cn: 我本人更喜欢使用适用于Android的现有OpenUDID实现（请参阅<a href="https://github.com/ylechelle/OpenUDID">https://github.com/ylechelle/OpenUDID</a> ）（请参阅<a href="https://github.com/vieux/OpenUDID">https://github.com/vieux/OpenUDID</a> ）。 它很容易集成，并且可以将 <code>ANDROID_ID</code> 与备用功能结合使用来解决上述问题。

source: I personally find this acceptable but not ideal. No one identifier provided by Android works in all instances as most are dependent on the phone's radio states (Wi-Fi on/off, cellular on/off, Bluetooth on/off). The others, like <code>Settings.Secure.ANDROID_ID</code> must be implemented by the manufacturer and are not guaranteed to be unique.
es: Personalmente, considero que esto es aceptable pero no ideal. Ning&uacute;n identificador proporcionado por Android funciona en todos los casos, ya que la mayor&iacute;a depende de los estados de radio del tel&eacute;fono (conexi&oacute;n / desconexi&oacute;n de Wi-Fi, conexi&oacute;n / desconexi&oacute;n de celular, conexi&oacute;n / desconexi&oacute;n de Bluetooth). Los dem&aacute;s, como <code>Settings.Secure.ANDROID_ID</code> , deben ser implementados por el fabricante y no se garantiza que sean &uacute;nicos.
ja: 私は個人的にはこれは受け入れられるが、理想的ではないと思います。 ほとんどの場合、Androidによって提供される識別子はどれも機能しません。ほとんどがスマートフォンの無線状態（Wi-Fiオン/オフ、携帯電話オン/オフ、Bluetoothオン/オフ）に依存しているためです。 その他、 <code>Settings.Secure.ANDROID_ID</code> などは製造元が実装する必要があり、一意であるとは限りません。
ko: 나는 개인적으로 이것을 받아 들일 수 있지만 이상적이지는 않다. 대부분의 경우 휴대 전화의 라디오 상태 (Wi-Fi 켜기 / 끄기, 셀룰러 켜기 / 끄기, 블루투스 켜기 / 끄기)에 따라 Android에서 제공하는 식별자가 모든 경우에 작동하지 않습니다. <code>Settings.Secure.ANDROID_ID</code> 와 같은 다른 것은 제조업체가 구현해야하며 고유하지는 않습니다.
ru: Я лично считаю это приемлемым, но не идеальным. Ни один идентификатор, предоставляемый Android, не работает во всех случаях, поскольку большинство из них зависят от состояния радиосвязи телефона (вкл / выкл Wi-Fi, вкл / выкл сотовой связи, вкл / выкл Bluetooth). Другие, такие как <code>Settings.Secure.ANDROID_ID</code> , должны быть реализованы производителем и не обязательно должны быть уникальными.
zh_cn: 我个人认为这可以接受，但并不理想。 Android提供的任何标识符都无法在所有情况下正常工作，因为大多数标识符都取决于手机的无线电状态（Wi-Fi开/关，蜂窝式开/关，蓝牙开/关）。 其他 <code>Settings.Secure.ANDROID_ID</code> （例如Settings.Secure.ANDROID_ID）必须由制造商实现，并且不能保证唯一。

source: I think this is sure fire way of building a skeleton for a unique ID... check it out.
es: Creo que esta es una forma segura de construir un esqueleto para una identificación única...compruébalo.
ja: ユニークなIDのための骨格を作るための確実な方法だと思います...チェックしてみてください。
ko: 나는 이것이 유일한 ID를위한 골격을 구축하는 확실한 방법이라고 생각합니다 ... 확인하십시오.
ru: Я думаю,что это верный способ построить скелет для уникального удостоверения личности...зацените.
zh_cn: 我觉得这是个很有把握的方法,可以打造一个独一无二的ID骨架...........看看吧。

source: I use the following code to get the <code>IMEI</code> or use Secure.<code>ANDROID_ID</code> as an alternative, when the device doesn't have phone capabilities:
es: Uso el siguiente c&oacute;digo para obtener el <code>IMEI</code> o uso Secure. <code>ANDROID_ID</code> como alternativa, cuando el dispositivo no tiene capacidades telef&oacute;nicas:
ja: 次のコードを使用して <code>IMEI</code> を取得するか、Secureを使用します。 デバイスに電話機能がない場合の代替としての <code>ANDROID_ID</code> ：
ko: 다음 코드를 사용하여 <code>IMEI</code> 를 얻거나 보안을 사용합니다. 기기에 전화 기능이없는 경우 대안으로 <code>ANDROID_ID</code> :
ru: Я использую следующий код, чтобы получить <code>IMEI</code> или использовать Secure. <code>ANDROID_ID</code> в качестве альтернативы, когда устройство не имеет возможностей телефона:
zh_cn: 我使用以下代码获取 <code>IMEI</code> 或使用Secure。 当设备不具备电话功能时，可以使用 <code>ANDROID_ID</code> 作为替代：

source: IMEI, Mac Addresses, Instance Id, GUIDs, SSAID, Advertising Id, Safety Net API to verify devices.
es: IMEI,Direcciones Mac,Instance Id,GUIDs,SSAID,Advertising Id,Safety Net API para verificar los dispositivos.
ja: IMEI、Macアドレス、インスタンスID、GUID、SSAID、広告ID、デバイスを検証するSafety Net API。
ko: 장치를 확인하기위한 IMEI, Mac 주소, 인스턴스 ID, GUID, SSAID, 광고 ID, Safety Net API.
ru: IMEI,адреса Mac,идентификатор инстанции,GUID,SSAID,рекламный идентификатор,Safety Net API для верификации устройств.
zh_cn: IMEI、Mac地址、Instance Id、GUID、SSAID、广告ID、安全网API验证设备。

source: If all else fails, if the user does have lower than API 9 (lower than Gingerbread), has reset their device or 'Secure.ANDROID_ID' returns 'null', then simply the ID returned will be solely based off their Android device information. This is where the collisions can happen.
es: Si todo lo demás falla,si el usuario tiene un API inferior a 9 (inferior a Gingerbread),ha reiniciado su dispositivo o 'Secure.ANDROID_ID' devuelve 'null',entonces simplemente el ID devuelto se basará únicamente en la información de su dispositivo Android.Aquí es donde las colisiones pueden ocurrir.
ja: 他のすべてが失敗した場合、ユーザが API 9 未満 (Gingerbread 未満)のデバイスを使用していたり、デバイスをリセットしていたり、「Secure.ANDROID_ID」が「null」を返したりした場合、返される ID は単純に、ユーザの Android デバイス情報のみに基づいていることになります。このような場合、衝突が発生する可能性があります。
ko: 사용자가 API 9보다 낮거나 (Gingerbread보다 낮은) 기기를 재설정했거나 'Secure.ANDROID_ID'가 'null'을 반환하면 다른 모든 방법이 실패하면 단순히 반환 된 ID는 Android 기기 정보를 기반으로합니다. 충돌이 발생할 수있는 곳입니다.
ru: Если все остальное не удается,если пользователь имеет API ниже 9 (ниже Gingerbread),сбросил свое устройство или 'Secure.ANDROID_ID' возвращает 'null',то просто возвращаемый ID будет основываться исключительно на информации об устройстве Android.Именно здесь могут произойти столкновения.
zh_cn: 如果其他的方法都失败了,如果用户的设备确实低于API 9(低于Gingerbread),重置了他们的设备,或者'Secure.ANDROID_ID'返回'null',那么返回的ID将完全基于他们的Android设备信息。这就是可能发生碰撞的地方。

source: If all else fails:
es: Si todo lo demás falla:
ja: 他のすべてが失敗した場合
ko: 다른 모든 것이 실패하면 :
ru: Если все остальное провалится:
zh_cn: 如果其他方面都失败了。

source: If the user's Android device is lower than API 9; hopefully, they have not done a factory reset and their 'Secure.ANDROID_ID' will be preserved or not 'null'. (see <a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.html</a>)
es: Si el dispositivo Android del usuario es inferior a la API 9; con suerte, no han realizado un restablecimiento de f&aacute;brica y su 'Secure.ANDROID_ID' se conservar&aacute; o no 'nulo'. (ver <a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.html</a> )
ja: ユーザーのAndroidデバイスがAPI 9より低い場合。 うまくいけば、彼らは出荷時設定へのリセットを行っておらず、「Secure.ANDROID_ID」は保持されるか「null」にならないでしょう。 （ <a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.htmlを</a>参照してください）
ko: 사용자의 Android 기기가 API 9보다 낮은 경우 희망적으로, 그들은 공장 초기화를하지 않았고 그들의 'Secure.ANDROID_ID'는 보존되거나 '널'이 아닙니다. ( <a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.html 참조</a> )
ru: Если Android-устройство пользователя ниже API 9; надеюсь, они не сделали сброс настроек, и их &laquo;Secure.ANDROID_ID&raquo; будет сохранен или не будет &laquo;нулевым&raquo;. (см. <a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.html</a> )
zh_cn: 如果用户的Android设备低于API 9； 希望他们没有恢复出厂设置，并且他们的&ldquo; Secure.ANDROID_ID&rdquo;将保留或不为&ldquo; null&rdquo;。 （请参阅<a href="http://developer.android.com/about/dashboards/index.html">http://developer.android.com/about/dashboards/index.html</a> ）

source: If their Android device is API 9 or over, this is guaranteed to be unique because of the 'Build.SERIAL' field.
es: Si su dispositivo Android es API 9 o superior,está garantizado que es único debido al campo "Build.SERIAL".
ja: AndroidデバイスがAPI 9以上の場合、'Build.SERIAL'フィールドのため、これは一意であることが保証されています。
ko: Android 기기가 API 9 이상인 경우 'Build.SERIAL'필드 때문에 고유해야합니다.
ru: Если их Android-устройство является API 9 или выше,это гарантированно будет уникальным из-за поля 'Build.SERIAL'.
zh_cn: 如果他们的安卓设备是API 9或以上的设备,由于 "Build.SERIAL "字段的存在,保证了这是唯一的。

source: If you couple this with a backup strategy to send preferences to the cloud (also described in Reto's <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">talk</a>, you should have an id that ties to a user and sticks around after the device has been wiped, or even replaced. I plan to use this in analytics going forward (in other words, I have not done that bit yet :).
es: Si combina esto con una estrategia de copia de seguridad para enviar preferencias a la nube (tambi&eacute;n se describe en la <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">charla</a> de Reto, debe tener una identificaci&oacute;n que se vincule con un usuario y permanezca despu&eacute;s de que el dispositivo haya sido borrado, o incluso reemplazado. Planeo usar esto en an&aacute;lisis en el futuro (en otras palabras, a&uacute;n no he hecho eso :).
ja: これをバックアップ戦略と組み合わせてプリファレンスをクラウドに送信する場合（Retoの<a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">トーク</a>でも説明されています）、ユーザーに関連付けられ、デバイスがワイプされた後、または交換された後も固執するIDが必要です。これを使用する予定です。今後の分析では（言い換えれば、まだその段階ではありません:)。
ko: 이 옵션을 백업 전략과 결합하여 환경 설정을 클라우드에 전송하는 경우 (Reto 's <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">talk에</a> 설명되어 있음), 사용자를 연결하고 장치가 지워지거나 교체 된 후에도 연결되는 ID가 있어야합니다. 앞으로 분석에서 (즉, 아직 그 일을하지 않았습니다 :).
ru: Если вы соедините это со стратегией резервного копирования для отправки настроек в облако (также описано в <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">выступлении</a> Рето, у вас должен быть идентификатор, который привязывается к пользователю и остается после того, как устройство было стерто или даже заменено. Я планирую использовать это в аналитике, идущей вперед (другими словами, я еще этого не сделал :).
zh_cn: 如果将此方法与备份策略结合使用，以将首选项发送到云（在Reto的<a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">演讲中</a>也有介绍），则应该有一个与用户相关联的ID，并在擦除或更换设备后仍然存在。我计划使用此ID。在未来的分析中（换句话说，我还没有这样做：）。

source: If you have a user with a factory reset device, the value may have changed or altered on the rooted device so there may be duplicates entries if you are tracking user installs.
es: Si tiene un usuario con un dispositivo de reinicio de fábrica,es posible que el valor haya cambiado o alterado en el dispositivo arraigado,por lo que puede haber entradas duplicadas si está rastreando las instalaciones del usuario.
ja: 工場出荷時にリセットされたデバイスを使用しているユーザーがいる場合、root化されたデバイスで値が変更または変更されている可能性があるため、ユーザーのインストールを追跡している場合、重複したエントリが存在する可能性があります。
ko: 출고시 재설정 장치를 사용하는 사용자가있는 경우 루팅 된 장치에서 값이 변경되거나 변경되어 사용자 설치를 추적하는 경우 항목이 중복 될 수 있습니다.
ru: Если у вас есть пользователь с устройством сброса настроек на заводе-изготовителе,значение может быть изменено или модифицировано на корневом устройстве,так что при отслеживании установки пользователя могут быть дубликаты записей.
zh_cn: 如果你有一个用户使用了出厂重置设备,那么该值可能已经改变或改变了根设备上的值,所以如果你跟踪用户安装,可能会有重复的条目。

source: If you need to store the device identification on your remote server, then don't store it as is (plain text), but a <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">hash with salt</a>.
es: Si necesita almacenar la identificaci&oacute;n del dispositivo en su servidor remoto, no la guarde tal cual (texto sin formato), sino un <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">hash con sal</a> .
ja: リモートサーバーにデバイスIDを保存する必要がある場合は、そのまま（プレーンテキスト）ではなく、 <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">saltを使用し</a>たハッシュで保存します。
ko: 장치 식별을 원격 서버에 저장해야하는 경우에는 그대로 (일반 텍스트) 저장하지 말고 <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">salt</a> 로 해시하십시오 .
ru: Если вам нужно сохранить идентификацию устройства на вашем удаленном сервере, не храните его как есть (простой текст), но <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">хеш с солью</a> .
zh_cn: 如果您需要将设备标识存储在远程服务器上，则不要按原样存储（纯文本），而是存储<a href="https://en.wikipedia.org/wiki/Salt_(cryptography)">带有salt</a>的哈希 。

source: If you use GCM, then you will eventually need to use this instance ID because you need it in order to get the GCM token (which replaces the old GCM registration ID).
es: Si usas GCM,entonces eventualmente necesitarás usar este ID de instancia porque lo necesitas para obtener el token GCM (que reemplaza el antiguo ID de registro del GCM).
ja: GCM を使用している場合は、GCM トークン(旧 GCM 登録 ID に代わるもの)を取得するためにこのインスタンス ID が必要なので、最終的にはこのインスタンス ID を使用する必要があります。
ko: GCM을 사용하는 경우 GCM 토큰 (이전 GCM 등록 ID를 대체 함)을 가져 오기 위해이 인스턴스 ID가 필요하므로 결국이 인스턴스 ID를 사용해야합니다.
ru: Если вы используете GCM,то вам,в конечном счете,придется использовать этот идентификатор экземпляра,потому что он нужен вам для получения GCM-токена (который заменяет старый регистрационный ID GCM).
zh_cn: 如果你使用GCM,那么你最终需要使用这个实例ID,因为你需要它来获得GCM令牌(它取代了旧的GCM注册ID)。

source: If you use the ID for the purposes they intend - eg. app authentication, app identification, GCM - I think this 1-3 seconds could be a nuisance (depending on your app, of course).
es: Si usas la identificación para los propósitos que pretenden-por ejemplo,autenticación de la aplicación,identificación de la aplicación,GCM-creo que estos 1-3 segundos podrían ser una molestia (dependiendo de tu aplicación,por supuesto).
ja: アプリ認証、アプリ識別、GCMなどの目的でIDを使用する場合、この1~3秒は迷惑になると思います(もちろんアプリにもよりますが)。
ko: 의도 한 목적으로 ID를 사용하는 경우-예. 앱 인증, 앱 식별, GCM-이 1-3 초가 성가신 것으로 생각합니다 (물론 앱에 따라 다름).
ru: Если вы используете ID для целей,которые они намереваются использовать-например,аутентификация приложения,идентификация приложения,GCM-я думаю,что эти 1-3 секунды могут быть помехой (в зависимости от вашего приложения,конечно).
zh_cn: 如果你使用ID的目的是为了他们想要的目的--例如:应用认证、应用识别、GCM--我认为这1-3秒的时间可能会让你很烦(当然,这取决于你的应用)。

source: Implementing a custom ID generation algorithm (based on device properties that are supposed to be static and won't change -&gt; who knows)
es: Implementaci&oacute;n de un algoritmo de generaci&oacute;n de ID personalizado (basado en las propiedades del dispositivo que se supone que son est&aacute;ticas y que no cambiar&aacute;n -&gt; qui&eacute;n sabe)
ja: カスタムID生成アルゴリズムの実装（静的であることが想定されており、変更されないデバイスプロパティに基づく-&gt;知っている）
ko: 사용자 정의 ID 생성 알고리즘 구현 (정적이며 변경되지 않아야하는 장치 속성을 기반으로-&gt; 아는 사람)
ru: Реализация собственного алгоритма генерации идентификатора (на основе свойств устройства, которые должны быть статическими и не изменятся -&gt; кто знает)
zh_cn: 实现自定义ID生成算法（基于应该是静态且不会更改的设备属性-&gt;谁知道）

source: In every Android device their is at least a "wlan0" Interface witch is the WI-FI chip. This code works even when WI-FI is not turned on.
es: En cada dispositivo Android hay al menos una interfaz "wlan0" que es el chip WI-FI.Este código funciona incluso cuando el WI-FI no está activado.
ja: すべてのAndroidデバイスでは、少なくとも "wlan0 "インターフェースの魔女は、WI-FIチップです。このコードはWI-FIがオンになっていない場合でも動作します。
ko: 모든 Android 기기에서 최소 "wlan0"인터페이스 마녀는 WI-FI 칩입니다. 이 코드는 WI-FI가 켜져 있지 않은 경우에도 작동합니다.
ru: В каждом Android-устройстве как минимум интерфейс "wlan0" является WI-FI чипом.Этот код работает даже тогда,когда WI-FI не включен.
zh_cn: 每个Android设备中至少有一个 "wlan0 "接口,这就是WI-FI芯片。即使在没有开启WI-FI的情况下,这个代码也能工作。

source: In the current implementation (GPS 7.5) the instance ID is retrieved from a server when your app requests it. This means that the call above is a blocking call - in my unscientific testing it takes 1-3 seconds if the device is online, and 0.5 - 1.0 seconds if off-line (presumably this is how long it waits before giving up and generating a random ID). This was tested in North America on Nexus 5 with Android 5.1.1 and GPS 7.5.
es: En la implementación actual (GPS 7.5)el ID de la instancia se recupera de un servidor cuando tu aplicación lo solicita.Esto significa que la llamada anterior es una llamada de bloqueo-en mis pruebas no científicas toma de 1 a 3 segundos si el dispositivo está en línea,y de 0,5 a 1,0 segundos si está fuera de línea (presumiblemente este es el tiempo que espera antes de rendirse y generar un ID aleatorio).Esto fue probado en Norteamérica en el Nexus 5 con Android 5.1.1 y GPS 7.5.
ja: 現在の実装(GPS 7.5)では、インスタンスIDはアプリが要求したときにサーバーから取得されます。これは、上記の呼び出しがブロッキングコールであることを意味します-私の非科学的なテストでは、デバイスがオンラインの場合は1~3秒、オフラインの場合は0.5~1.0秒かかります(おそらくこれは、それが諦めてランダムなIDを生成する前に待っている時間です)。これは北米でAndroid 5.1.1.1とGPS 7.5を搭載したNexus 5でテストしました。
ko: 현재 구현 (GPS 7.5)에서 앱이 요청하면 인스턴스 ID가 서버에서 검색됩니다. 이것은 위의 호출이 차단 호출이라는 것을 의미합니다. 비과학적인 테스트에서는 장치가 온라인 상태 인 경우 1 ~ 3 초, 오프라인 상태 인 경우 0.5 ~ 1.0 초 (아마도 포기하고 생성하기까지 대기하는 시간입니다) 임의의 ID). Android 5.1.1 및 GPS 7.5가 설치된 Nexus 5에서 북미 지역에서 테스트되었습니다.
ru: В текущей реализации (GPS 7.5)идентификатор экземпляра извлекается с сервера,когда ваше приложение запрашивает его.Это означает,что вызов выше является блокировкой-в моем ненаучном тестировании это занимает 1-3 секунды,если устройство находится в режиме онлайн,и 0.5-1.0 секунды,если не в режиме онлайн (предположительно,это то,как долго он ждет,прежде чем сдаться и генерировать случайный ID).Это было протестировано в Северной Америке на Nexus 5 с Android 5.1.1 и GPS 7.5.
zh_cn: 在目前的实现中(GPS 7.5),当你的应用请求时,实例ID是在服务器上获取的。这意味着上面的呼叫是一个阻断呼叫--在我不科学的测试中,如果设备是在线的,需要1-3秒,如果是离线的,需要0.5-1.0秒(大概就是在放弃和生成一个随机ID之前,它可能会等待多长时间)。这是在北美的Nexus 5上进行的测试,使用Android 5.1.1.1和GPS 7.5系统。

source: Instead, I encapsulated the various strategies for getting a (device) ID in an enum - changing the order of the enum constants affects the priority of the various ways of getting the ID. The first non-null ID is returned or an exception is thrown (as per good Java practices of not giving null a meaning). So for instance I have the TELEPHONY one first - but a good default choice would be the ANDROID_ID <strong>beta:</strong>
es: En cambio, encapsul&eacute; las diversas estrategias para obtener una ID (de dispositivo) en una enumeraci&oacute;n: cambiar el orden de las constantes de enumeraci&oacute;n afecta la prioridad de las diversas formas de obtener la ID. Se devuelve el primer ID no nulo o se lanza una excepci&oacute;n (seg&uacute;n las buenas pr&aacute;cticas de Java de no dar un significado nulo). Entonces, por ejemplo, primero tengo el TELEPHONY, pero una buena opci&oacute;n predeterminada ser&iacute;a la <strong>beta</strong> ANDROID_ID <strong>:</strong>
ja: 代わりに、（デバイス）IDを取得するためのさまざまな戦略を列挙型にカプセル化しました。列挙定数の順序を変更すると、IDを取得するさまざまな方法の優先順位に影響します。 最初のnull以外のIDが返されるか、例外がスローされます（nullに意味を与えないというJavaの適切な慣行に従って）。 たとえば、最初にTELEPHONYを最初に持っていますが、デフォルトの適切な選択はANDROID_ID <strong>ベータ版です。</strong>
ko: 대신 열거 형에서 (장치) ID를 얻는 다양한 전략을 요약했습니다. 열거 상수의 순서를 변경하면 ID를 얻는 다양한 방법의 우선 순위에 영향을 미칩니다. 널 (null)이 아닌 ID가 리턴되거나 예외가 발생합니다 (좋은 Java 관행에 따라 널 (null)에 의미를주지 않음) 예를 들어 TELEPHONY를 먼저 가지고 있지만 기본적으로 ANDROID_ID <strong>베타를</strong> 선택하는 것이 좋습니다 <strong>.</strong>
ru: Вместо этого я инкапсулировал различные стратегии получения идентификатора (устройства) в перечислении - изменение порядка перечисления констант влияет на приоритет различных способов получения идентификатора. Возвращается первый ненулевой идентификатор или генерируется исключение (в соответствии с хорошими практиками Java, не предусматривающими нулевого значения). Так, например, сначала у меня есть TELEPHONY, но хорошим вариантом по умолчанию будет <strong>бета-версия</strong> ANDROID_ID <strong>:</strong>
zh_cn: 相反，我封装了在枚举中获取（设备）ID的各种策略-更改枚举常量的顺序会影响获取ID的各种方式的优先级。 返回第一个非null的ID或引发异常（按照Java的良好做法，即不赋予null含义）。 举例来说，我首先使用TELEPHONY-但一个很好的默认选择是ANDROID_ID <strong>beta：</strong>

source: Is there a unique Android device ID
es: ¿Hay una identificación única del dispositivo Android
ja: Android端末固有のIDはありますか?
ko: 고유 한 Android 기기 ID가 있습니까
ru: Есть ли уникальный идентификатор устройства Android
zh_cn: 是否有一个唯一的Android设备ID

source: It appears to me that Google intends for it to be used for this purpose (identifying your installations), it is cross-platform, and can be used for a number of other purposes (see the links above).
es: Me parece que Google tiene la intención de utilizarlo para este fin (identificar sus instalaciones),es multiplataforma y puede ser utilizado para varios otros fines (ver los enlaces anteriores).
ja: Google はこの目的(インストールしたものを識別すること)に使用することを意図しているように見えますが、それはクロスプラットフォームであり、他の多くの目的に使用することができます(上のリンクを参照してください)。
ko: Google 은이 목적으로 (설치를 식별하는) 목적으로 사용하려고하며, 플랫폼 간이며 여러 다른 목적으로 사용할 수 있습니다 (위 링크 참조).
ru: Мне кажется,что Google намеревается использовать его для этих целей (определение ваших установок),он кроссплатформенный,и может быть использован для ряда других целей (см.ссылки выше).
zh_cn: 在我看来,谷歌的意图是为了这个目的(识别你的安装),它是跨平台的,可以用于其他一些目的(见上面的链接)。

source: It combines 3 IDs and creates a 32-digit hex string. It has worked very well for me.
es: Combina 3 identificaciones y crea una cadena hexagonal de 32 dígitos.Me ha funcionado muy bien.
ja: 3つのIDを組み合わせて32桁の16進数の文字列を作成します。これは私にとって非常にうまく機能しています。
ko: 3 개의 ID를 결합하고 32 자리 16 진 문자열을 작성합니다. 그것은 나를 위해 아주 잘 작동했습니다.
ru: Он объединяет 3 идентификатора и создает 32-значную шестнадцатеричную строку.Это очень хорошо сработало для меня.
zh_cn: 它结合了3个ID,并创建了一个32位数的十六进制字符串。对我来说,它的效果非常好。

source: It covers five different ID types:
es: Cubre cinco tipos de identificación diferentes:
ja: 5種類のIDをカバーしています。
ko: 다섯 가지 ID 유형이 있습니다.
ru: Она охватывает пять различных типов удостоверений личности:
zh_cn: 它涵盖了五种不同的ID类型。
