Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Of note that the <a href="https://stackoverflow.com/a/5626208/281545">solution</a> provided by @emmby falls back in a per application ID as the SharedPreferences are not synchronized across processes (see <a href="https://stackoverflow.com/a/4695567/281545">here</a> and <a href="https://stackoverflow.com/a/12430507/281545">here</a>). So I avoided this altogether.
es: Tenga en cuenta que la <a href="https://stackoverflow.com/a/5626208/281545">soluci&oacute;n</a> proporcionada por @emmby recae en un ID por aplicaci&oacute;n, ya que SharedPreferences no se sincronizan en todos los procesos (consulte <a href="https://stackoverflow.com/a/4695567/281545">aqu&iacute;</a> y <a href="https://stackoverflow.com/a/12430507/281545">aqu&iacute;</a> ). As&iacute; que evit&eacute; esto por completo.
ja: SharedPreferencesはプロセス間で同期されないため、@ emmbyによって提供される<a href="https://stackoverflow.com/a/5626208/281545">ソリューション</a>はアプリケーションIDごとにフォールバックすることに注意してください（ <a href="https://stackoverflow.com/a/4695567/281545">ここ</a>と<a href="https://stackoverflow.com/a/12430507/281545">ここを</a>参照）。 だから私はこれを完全に避けました。
ko: @emmby가 제공하는 <a href="https://stackoverflow.com/a/5626208/281545">솔루션</a> 은 SharedPreferences가 프로세스간에 동기화되지 않기 때문에 응용 프로그램 ID별로 폴백합니다 ( <a href="https://stackoverflow.com/a/4695567/281545">여기</a> 및 <a href="https://stackoverflow.com/a/12430507/281545">여기</a> 참조). 그래서 나는 이것을 피했습니다.
ru: Следует отметить, что <a href="https://stackoverflow.com/a/5626208/281545">решение,</a> предоставляемое @emmby, использует идентификатор каждого приложения, поскольку SharedPreferences не синхронизируются между процессами (см. <a href="https://stackoverflow.com/a/4695567/281545">Здесь</a> и <a href="https://stackoverflow.com/a/12430507/281545">здесь</a> ). Так что я вообще этого избежал.
zh_cn: 值得注意的是，@emmby提供的<a href="https://stackoverflow.com/a/5626208/281545">解决方案</a>在每个应用程序ID中都回退，因为SharedPreferences在各个进程之间不同步（请参见<a href="https://stackoverflow.com/a/4695567/281545">此处</a>和<a href="https://stackoverflow.com/a/12430507/281545">此处</a> ）。 因此，我完全避免了这种情况。

source: On some devices, it's not available when Wi-Fi is turned off.
es: En algunos aparatos,no está disponible cuando el Wi-Fi está apagado.
ja: 一部の端末では、Wi-Fiをオフにすると使えなくなります。
ko: 일부 기기에서는 Wi-Fi가 꺼져있을 때 사용할 수 없습니다.
ru: На некоторых устройствах он недоступен,когда Wi-Fi отключен.
zh_cn: 在某些设备上,当关闭Wi-Fi时,它无法使用。

source: One thing I'll add - I have one of those unique situations.
es: Una cosa que añadiré:tengo una de esas situaciones únicas.
ja: 一つ付け加えておきますが、私にはそのようなユニークな状況の一つがあります。
ko: 내가 추가 할 한 가지-나는 독특한 상황 중 하나를 가지고 있습니다.
ru: Добавлю одно-у меня одна из этих уникальных ситуаций.
zh_cn: 我要补充一点--我有一个独特的情况。

source: Overall breakdown with Android
es: Desglose general con Android
ja: Androidとの全体的な内訳
ko: Android의 전반적인 고장
ru: Общая разбивка с Android
zh_cn: 与安卓系统的整体细分

source: P.S. Their are a bunch of other Interfaces you will get from the list containing MACS But this can change between phones.
es: P.D.Hay un montón de otras interfaces que obtendrás de la lista que contiene MACS.Pero esto puede cambiar entre los teléfonos.
ja: 追伸:MACS を含むリストから得られる他のインタフェースの束がありますが、これは電話間で変更することができます。
ko: PS MACS가 포함 된 목록에서 얻을 수있는 다른 인터페이스들입니다. 그러나 이것은 전화기마다 바뀔 수 있습니다.
ru: P.S.Они представляют собой кучу других интерфейсов,которые вы получите из списка,содержащего MACS Но это может меняться между телефонами.
zh_cn: P.S.S.他们还有很多其他的接口,你可以从包含MACS的列表中获得,但这可能会在不同的手机之间改变。

source: Please take a look at the method below:
es: Por favor,eche un vistazo al método de abajo:
ja: 下記の方法を参考にしてみてください。
ko: 아래 방법을 살펴보십시오.
ru: Пожалуйста,взгляните на метод ниже:
zh_cn: 请看一下下面的方法。

source: Pseudo-Unique ID, that works on all Android devices Some devices don't have a phone (eg. Tablets) or for some reason, you don't want to include the READ_PHONE_STATE permission. You can still read details like ROM Version, Manufacturer name, CPU type, and other hardware details, that will be well suited if you want to use the ID for a serial key check, or other general purposes. The ID computed in this way won't be unique: it is possible to find two devices with the same ID (based on the same hardware and ROM image) but the changes in real-world applications are negligible. For this purpose you can use the Build class:
es: Pseudo-identificación única,que funciona en todos los dispositivos Android Algunos dispositivos no tienen teléfono (por ejemplo,las tabletas)o por alguna razón,no quieres incluir el permiso READ_PHONE_STATE.Todavía puede leer detalles como la versión de la ROM,el nombre del fabricante,el tipo de CPU y otros detalles de hardware,que serán muy adecuados si desea utilizar el ID para una comprobación de la clave de serie,u otros propósitos generales.El ID calculado de esta manera no será único:es posible encontrar dos dispositivos con el mismo ID (basado en el mismo hardware y la misma imagen de la ROM)pero los cambios en las aplicaciones del mundo real son insignificantes.Para este propósito puedes usar la clase Build:
ja: すべてのAndroidデバイスで動作する疑似ユニークID 一部のデバイスには電話(例:タブレット)がないか、何らかの理由でREAD_PHONE_STATEパーミッションを含めたくない場合があります。あなたはまだROMのバージョン、メーカー名、CPUの種類、および他のハードウェアの詳細のような詳細を読み取ることができます、あなたがシリアルキーのチェック、または他の一般的な目的のためにIDを使用したい場合に適しています。このようにして計算された ID は一意ではありません:同じ ID を持つ 2 つのデバイスを見つけることは可能ですが (同じハードウェアと ROM イメージに基づいて)、実世界のアプリケーションでの変更は無視できる程度です。この目的のために、Build クラスを使用することができます。
ko: 모든 Android 기기에서 작동하는 의사 고유 ID 일부 기기에는 휴대 전화 (예 : 태블릿)가 없거나 어떤 이유로 READ_PHONE_STATE 권한을 포함하고 싶지 않습니다. ROM 버전, 제조업체 이름, CPU 유형 및 기타 하드웨어 세부 사항과 같은 세부 사항을 계속 읽을 수 있습니다.이 세부 사항은 일련 키 확인 또는 기타 일반적인 목적으로 ID를 사용하려는 경우에 적합합니다. 이러한 방식으로 계산 된 ID는 고유하지 않습니다. 동일한 하드웨어 및 ROM 이미지를 기반으로 동일한 ID를 가진 두 개의 장치를 찾을 수 있지만 실제 응용 프로그램의 변경 사항은 무시할 수 있습니다. 이를 위해 Build 클래스를 사용할 수 있습니다.
ru: Псевдо-уникальный идентификатор,который работает на всех устройствах Android Некоторые устройства не имеют телефона (например,таблетки)или по каким-то причинам,вы не хотите включать разрешение READ_PHONE_STATE.Вы все еще можете прочитать такие детали,как версия ПЗУ,имя производителя,тип процессора и другие аппаратные детали,которые будут хорошо подходить,если вы хотите использовать ID для проверки серийного ключа,или другие общие цели.Вычисленный таким образом ID не будет уникальным:можно найти два устройства с одним и тем же ID (на основе одного и того же аппаратного обеспечения и образа ПЗУ),но изменения в реальных приложениях ничтожно малы.Для этого можно использовать класс Build:
zh_cn: 伪唯一的ID,可以在所有的Android设备上使用 有些设备没有手机(例如:平板电脑),或者由于某些原因,你不想包含READ_PHONE_STATE权限。你仍然可以读取诸如ROM版本、制造商名称、CPU类型和其他硬件细节,如果你想用这个ID来检查序列号,或者其他一般用途,这些都是很适合的。用这种方式计算出来的ID不会是唯一的:有可能找到两个具有相同ID的设备(基于相同的硬件和ROM映像),但在实际应用中的变化可以忽略不计。为了这个目的,你可以使用Build类。

source: Psuedo code:
es: Código Psuedo:
ja: プセドコード。
ko: 슈도 코드 :
ru: Код Псуэдо:
zh_cn: Psuedo代码。

source: Released at I/O 2015; on Android requires play services 7.5.
es: Lanzado en IO 2015;en Android requiere servicios de juego 7.5.
ja: IO 2015でリリース;Androidではプレイサービス7.5が必要です。
ko: I / O 2015에서 발표; 안드로이드에서는 플레이 서비스 7.5가 필요합니다.
ru: Выпущено при IO 2015;на Android требуются игровые сервисы 7.5.
zh_cn: 在IO 2015上发布;在安卓系统上需要播放服务7.5版本。

source: Removed 'Android.SECURE_ID' because of factory resets could cause the value to change
es: Eliminar 'Android.SECURE_ID' debido a los reajustes de fábrica podría causar que el valor cambie
ja: 工場出荷時にリセットすると値が変更される可能性があるため、「Android.SECURE_ID」を削除しました。
ko: 초기화로 인해 'Android.SECURE_ID'가 제거되어 값이 변경 될 수 있음
ru: Удалено 'Android.SECURE_ID' из-за того,что заводские сбросы могут привести к изменению значения
zh_cn: 删除了'Android.SECURE_ID',因为工厂重置可能会导致值发生变化。

source: Reported to be available even when Wi-Fi is not connected. If Joe from the answer above gives this one a try on his many devices, that'd be nice.
es: Se informa que está disponible incluso cuando el Wi-Fi no está conectado.Si Joe de la respuesta anterior le da a este una prueba en sus muchos dispositivos,eso estaría bien.
ja: Wi-Fiが接続されていなくても利用できると報告されています。上の回答のジョーさんが、たくさんのデバイスでこれを試してくれたら嬉しいですね。
ko: Wi-Fi가 연결되지 않은 경우에도 사용할 수 있다고보고되었습니다. 위의 답변에서 Joe 가이 장치를 많은 장치에서 사용해 볼 수 있다면 좋을 것입니다.
ru: Сообщается,что доступен,даже если Wi-Fi не подключен.Если Джо из приведенного выше ответа попробует свои многочисленные устройства,это было бы неплохо.
zh_cn: 据报道,即使在没有连接Wi-Fi的情况下也能使用。如果上面的答案中的Joe能在他的众多设备上试用一下这个,那就好了。

source: Requires permission <code>android.permission.ACCESS_WIFI_STATE</code> in the manifest.
es: Requiere permiso <code>android.permission.ACCESS_WIFI_STATE</code> en el manifiesto.
ja: マニフェストで <code>android.permission.ACCESS_WIFI_STATE</code> 権限が必要です。
ko: 매니페스트에 <code>android.permission.ACCESS_WIFI_STATE</code> 권한이 필요합니다.
ru: Требуется разрешение <code>android.permission.ACCESS_WIFI_STATE</code> в манифесте.
zh_cn: 清单中需要 <code>android.permission.ACCESS_WIFI_STATE</code> 权限。

source: Samsung Galaxy S II
ja: サムスンギャラクシーS II
ko: 삼성 갤럭시 S II
zh_cn: 三星Galaxy S II

source: Several devices by several manufacturers are affected by the ANDROID_ID bug in 2.2.
es: Varios dispositivos de varios fabricantes están afectados por el fallo del ANDROID_ID en 2.2.
ja: 複数のメーカーのいくつかのデバイスが2.2のandroid_idバグの影響を受けています。
ko: 여러 제조업체의 여러 장치가 2.2의 ANDROID_ID 버그의 영향을받습니다.
ru: На некоторые устройства нескольких производителей влияет ошибка ANDROID_ID,указанная в пункте 2.2.
zh_cn: 多个厂商的几款设备在2.2中受到ANDROID_ID bug的影响。

source: Since it can be 'null', we can check for 'null' and change its value, but this means it will no longer be unique.
es: Como puede ser "nulo",podemos comprobar si es "nulo" y cambiar su valor,pero esto significa que ya no será único.
ja: 'null'になることもあるので、'null'をチェックして値を変えればいいのですが、これでは一意ではなくなってしまいます。
ko: 'null'일 수 있으므로 'null'을 확인하고 값을 변경할 수 있지만 더 이상 고유하지 않습니다.
ru: Так как он может быть 'нулем',мы можем проверить его на 'null' и изменить его значение,но это означает,что он больше не будет уникальным.
zh_cn: 既然它可以是'null',我们可以检查'null'并改变它的值,但这意味着它将不再是唯一的。

source: Since you cannot have the desired static globally unique and reliable device identifier. Android's official reference suggest:
es: Ya que no se puede tener el deseado identificador estático globalmente único y fiable del dispositivo.La referencia oficial de Android sugiere:
ja: あなたが望む静的なグローバルにユニークで信頼性の高いデバイス識別子を持つことはできませんので。Androidの公式リファレンスが示唆しています。
ko: 원하는 정적 전역 고유하고 안정적인 장치 식별자를 가질 수 없기 때문입니다. 안드로이드의 공식 참조 제안 :
ru: Так как Вы не можете иметь желаемого статического глобально уникального и надежного идентификатора устройства.Официальная ссылка на Android предлагает:
zh_cn: 因为你无法拥有所需的静态的全局唯一的、可靠的设备标识符。Android的官方参考建议。

source: So <strong>don't use it either</strong>.
es: As&iacute; <strong>que tampoco lo uses</strong> .
ja: したがって<strong>、どちらも使用しないでください</strong> 。
ko: 따라서 <strong>어느 것도 사용하지 마십시오</strong> .
ru: Так <strong>что не используйте его тоже</strong> .
zh_cn: 所以<strong>也不要使用它</strong> 。

source: So <strong>if you're searching for a solution in 2020</strong>.
es: Entonces, <strong>si est&aacute; buscando una soluci&oacute;n en 2020</strong> .
ja: したがって<strong>、2020年に解決策を探している場合</strong> 。
ko: 따라서 <strong>2020 년에 솔루션을 찾고 있다면</strong> .
ru: Так что, <strong>если вы ищете решение в 2020 году</strong> .
zh_cn: 因此， <strong>如果您要在2020年寻求解决方案</strong> 。

source: So if you want something unique to the device itself, <code>TM.getDeviceId()</code><em>should</em> be sufficient. Obviously some users are more paranoid than others, so it might be useful to hash 1 or more of these identifiers, so that the string is still virtually unique to the device, but does not explicitly identify the user's actual device. For example, using <code>String.hashCode()</code>, combined with a UUID:
es: Entonces, si desea algo &uacute;nico para el dispositivo en s&iacute;, <code>TM.getDeviceId()</code> <em>deber&iacute;a</em> ser suficiente. Obviamente, algunos usuarios son m&aacute;s paranoicos que otros, por lo que podr&iacute;a ser &uacute;til hacer hash 1 o m&aacute;s de estos identificadores, de modo que la cadena todav&iacute;a sea pr&aacute;cticamente exclusiva del dispositivo, pero no identifique expl&iacute;citamente el dispositivo real del usuario. Por ejemplo, usando <code>String.hashCode()</code> , combinado con un UUID:
ja: したがって、デバイス自体に固有のものが必要な場合は、 <code>TM.getDeviceId()</code> で十分です。 明らかに、一部のユーザーは他のユーザーより偏執的であるため、これらの識別子の1つ以上をハッシュすると、文字列がデバイスに対して実質的に一意でありながら、ユーザーの実際のデバイスを明示的に識別できない場合があります。 たとえば、UUIDと組み合わせた <code>String.hashCode()</code> を使用します 。
ko: 따라서 장치 자체에 고유 한 것을 <code>TM.getDeviceId()</code> 이면 충분합니다. 분명히 일부 사용자는 다른 사용자보다 편집증이 많으므로 문자열이 실제로 장치에 고유하지만 사용자의 실제 장치를 명시 적으로 식별하지 않도록 이러한 식별자 중 하나 이상을 해시하는 것이 유용 할 수 있습니다. 예를 들어, UUID와 결합 된 <code>String.hashCode()</code> 사용 :
ru: Так что если вы хотите что-то уникальное для самого устройства, <code>TM.getDeviceId()</code> <em>должно</em> быть достаточно. Очевидно, что некоторые пользователи более параноидальны, чем другие, поэтому может быть полезно хешировать 1 или более этих идентификаторов, чтобы строка по-прежнему оставалась практически уникальной для устройства, но явно не идентифицировала фактическое устройство пользователя. Например, используя <code>String.hashCode()</code> сочетании с UUID:
zh_cn: 因此，如果您想要设备本身特有的功能，则 <code>TM.getDeviceId()</code> <em>应该</em>足够了。 显然，某些用户比其他用户更偏执，因此散列1个或多个这些标识符可能会很有用，这样该字符串实际上对于设备仍然是唯一的，但不会明确标识用户的实际设备。 例如，结合使用 <code>String.hashCode()</code> 和UUID：

source: So in simpler words: <strong>don't use those techniques</strong>.
es: En palabras m&aacute;s simples: <strong>no uses esas t&eacute;cnicas</strong> .
ja: 簡単に言うと、 <strong>これらのテクニックは使用しないでください</strong> 。
ko: 더 간단한 말로, <strong>그 기술을 사용하지 마십시오</strong> .
ru: Итак, проще говоря: <strong>не используйте эти методы</strong> .
zh_cn: 所以用简单的话来说： <strong>不要使用那些技术</strong> 。

source: Sometimes <strong>TelephonyManger.getDeviceId()</strong> will return null, so to assure an unique id you will use this method:
es: A veces, <strong>TelephonyManger.getDeviceId ()</strong> devolver&aacute; un valor nulo, por lo que para garantizar una identificaci&oacute;n &uacute;nica, utilizar&aacute; este m&eacute;todo:
ja: <strong>TelephonyManger.getDeviceId（）</strong>がnullを返すことがあるので、一意のIDを保証するには、このメソッドを使用します。
ko: 때때로 <strong>TelephonyManger.getDeviceId ()</strong> 는 null을 반환하므로 고유 한 ID를 보장하기 위해이 메소드를 사용합니다.
ru: Иногда <strong>TelephonyManger.getDeviceId ()</strong> возвращает null, поэтому для обеспечения уникального идентификатора вы будете использовать этот метод:
zh_cn: 有时<strong>TelephonyManger.getDeviceId（）</strong>将返回null，因此，为确保唯一的ID，您将使用此方法：

source: Thanks to @stansult for posting <em><a href="https://stackoverflow.com/a/9186943/950427">all of our options</a></em> (in this Stack Overflow question).
es: Gracias a @stansult por publicar <em><a href="https://stackoverflow.com/a/9186943/950427">todas nuestras opciones</a></em> (en esta pregunta de desbordamiento de pila).
ja: （このスタックオーバーフローの質問に） <em><a href="https://stackoverflow.com/a/9186943/950427">すべてのオプション</a></em>を投稿してくれた@stansultに感謝し<em>ます</em> 。
ko: <em><a href="https://stackoverflow.com/a/9186943/950427">모든</a></em> 스택 <em>옵션</em> (이 스택 오버플로 질문)을 게시 해 주신 @stansult에게 감사드립니다.
ru: Спасибо @stansult за публикацию <em><a href="https://stackoverflow.com/a/9186943/950427">всех наших опций</a></em> (в этом вопросе о переполнении стека).
zh_cn: 感谢@stansult发布<em><a href="https://stackoverflow.com/a/9186943/950427">了我们所有的选项</a></em> （在此Stack Overflow问题中）。

source: That makes most of the answers above invalid. Also due to different android security updates, some of them require newer and stricter runtime permissions, which can be simply denied by user.
es: Eso hace que la mayoría de las respuestas anteriores sean inválidas.También debido a las diferentes actualizaciones de seguridad de los androides,algunas de ellas requieren nuevos y más estrictos permisos de ejecución,que pueden ser simplemente negados por el usuario.
ja: そのため、上記の回答のほとんどは無効です。また、別のアンドロイドのセキュリティアップデートのために、それらのいくつかは、単にユーザーによって拒否することができます新しいと厳しいランタイム権限を必要とします。
ko: 위의 답변 대부분이 유효하지 않습니다. 또한 다양한 안드로이드 보안 업데이트로 인해 일부는 더 새롭고 더 엄격한 런타임 권한이 필요하며 이는 사용자가 간단하게 거부 할 수 있습니다.
ru: Это делает большинство из вышеперечисленных ответов недействительными.Кроме того,из-за различных андроид обновления безопасности,некоторые из них требуют более новых и более строгих разрешений на выполнение,которые могут быть просто отказано пользователю.
zh_cn: 这使得上面的大部分答案都是无效的。同时由于安卓安全更新的不同,有些安卓安全更新要求更新更多、更严格的运行时权限,用户可以直接拒绝。

source: That makes those identifiers not only unreliable, but also unaccessible in many cases.
es: Eso hace que esos identificadores no sólo sean poco fiables,sino también inaccesibles en muchos casos.
ja: そのため、これらの識別子は信頼性が低いだけでなく、多くの場合アクセスできません。
ko: 따라서 이러한 식별자를 신뢰할 수 없을뿐만 아니라 많은 경우 액세스 할 수 없습니다.
ru: Это делает эти идентификаторы не только ненадежными,но и во многих случаях недоступными.
zh_cn: 这使得这些标识符不仅不可靠,而且在许多情况下也无法获得。

source: The best want to <strong>TRACK AN INDIVIDUAL USER</strong> with their <strong>consent</strong> is to simply have them login (make this seamless using OAuth)
es: El mejor deseo de <strong>RASTREAR A UN USUARIO INDIVIDUAL</strong> con su <strong>consentimiento</strong> es simplemente hacer que inicien sesi&oacute;n (haga esto sin problemas con OAuth)
ja: <strong>同意を得て</strong> <strong>個々のユーザー</strong>を<strong>追跡</strong>するのに最適なのは、単にログインさせることです（OAuthを使用してこれをシームレスにします）。
ko: <strong>동의 한</strong> <strong>개별 사용자</strong> 를 <strong>추적</strong> 하려는 가장 좋은 방법은 단순히 로그인을하는 것입니다 (OAuth를 사용하여 원활하게 작성).
ru: Лучше всего <strong>отследить индивидуального пользователя</strong> с его <strong>согласия</strong> - просто попросить его войти (сделайте это без проблем, используя OAuth)
zh_cn: <strong>征得</strong>他们的<strong>同意后</strong> ， <strong>跟踪个人用户</strong>的最好方法就是简单地让他们登录（使用OAuth使其无缝连接）

source: The following code returns the device serial number using a hidden Android API. But, this code don't works on Samsung Galaxy Tab because "ro.serialno" isn't set on this device.
es: El siguiente código devuelve el número de serie del dispositivo utilizando una API de Android oculta.Pero,este código no funciona en la pestaña de la Galaxia Samsung porque "ro.serialno" no está configurado en este dispositivo.
ja: 以下のコードは、Androidの隠しAPIを使って端末のシリアル番号を返します。ただし、このコードはGalaxy Tabでは "ro.serialno "が設定されていないため、動作しません。
ko: 다음 코드는 숨겨진 Android API를 사용하여 장치 일련 번호를 반환합니다. 그러나이 코드는이 장치에서 "ro.serialno"가 설정되어 있지 않아 Samsung Galaxy Tab에서 작동하지 않습니다.
ru: Следующий код возвращает серийный номер устройства с помощью скрытого Android API.Но этот код не работает на Samsung Galaxy Tab,потому что "ro.serialno" не установлен на этом устройстве.
zh_cn: 下面的代码使用隐藏的Android API返回设备的序列号。但是,这段代码在三星Galaxy Tab上不能使用,因为 "ro.serialno "并没有在这个设备上设置。

source: The following is an example of writing data to an <em>installation</em> file that would be stored along with any other data the application saves locally.
es: El siguiente es un ejemplo de escritura de datos en un archivo de <em>instalaci&oacute;n</em> que se almacenar&iacute;a junto con cualquier otro dato que la aplicaci&oacute;n guarde localmente.
ja: 以下は、アプリケーションがローカルに保存する他のデータとともに保存される<em>インストール</em>ファイルにデータを書き込む例です。
ko: 다음은 응용 프로그램이 로컬로 저장하는 다른 데이터와 함께 저장되는 <em>설치</em> 파일에 데이터를 쓰는 예입니다.
ru: Ниже приведен пример записи данных в <em>установочный</em> файл, который будет храниться вместе с любыми другими данными, которые приложение сохраняет локально.
zh_cn: 以下是将数据写入<em>安装</em>文件的示例，该文件将与应用程序本地保存的任何其他数据一起存储。

source: The official Android Developers Blog now has a full article just about this very subject, <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Identifying App Installations</a></em>.
es: El blog oficial de desarrolladores de Android ahora tiene un art&iacute;culo completo sobre este mismo tema, <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Identificaci&oacute;n de instalaciones de aplicaciones</a></em> .
ja: Android Developersの公式ブログに、このテーマについての記事「 <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Identifying App Installations」の</a></em>完全な記事が掲載されました。
ko: 공식 Android 개발자 블로그에는 이제 바로이 주제에 관한 전체 기사 인 <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">앱 설치 식별</a></em> 이 있습니다.
ru: В официальном блоге разработчиков Android теперь есть полная статья, посвященная этой теме, &laquo; <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Определение установок приложений&raquo;</a></em> .
zh_cn: 现在，Android开发者官方博客正式发布了有关此主题的完整文章， <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">标识应用程序安装</a></em> 。

source: The unique device ID of an Android OS device as String, using <code>TelephonyManager</code> and <code>ANDROID_ID</code>, is obtained by:
es: El ID de dispositivo &uacute;nico de un dispositivo con sistema operativo Android como String, utilizando <code>TelephonyManager</code> y <code>ANDROID_ID</code> , se obtiene de la siguiente manera:
ja: <code>TelephonyManager</code> と <code>ANDROID_ID</code> を使用して、Android OSデバイスの一意のデバイスIDを文字列として取得するには、次のようにします。
ko: <code>TelephonyManager</code> 및 <code>ANDROID_ID</code> 를 사용하여 Android OS 디바이스의 고유 디바이스 ID (문자열)는 다음에 의해 확보됩니다.
ru: Уникальный идентификатор устройства на ОС Android в виде String с использованием <code>TelephonyManager</code> и <code>ANDROID_ID</code> получается путем:
zh_cn: 使用 <code>TelephonyManager</code> 和 <code>ANDROID_ID</code> 可以将Android OS设备的唯一设备ID作为String获取，方法是：

source: Then you need to create the backup agent and tell it to use the helper agent for sharedpreferences:
es: Entonces necesitas crear el agente de respaldo y decirle que use el agente de ayuda para las preferencias compartidas:
ja: 次に、バックアップエージェントを作成し、共有プリファレンスのヘルパーエージェントを使用するように指示する必要があります。
ko: 그런 다음 백업 에이전트를 작성하고 공유 환경 설정에 헬퍼 에이전트를 사용하도록 지시하십시오.
ru: Затем нужно создать агента резервного копирования и сказать ему,чтобы он использовал агент помощника для общих привилегий:
zh_cn: 然后,你需要创建备份代理,并告诉它使用共享首选项的帮助代理。

source: There are 30+ answers here and some are same and some are unique. This answer is based on few of those answers. One of them being @Lenn Dolling's answer.
es: Hay más de 30 respuestas aquí y algunas son iguales y otras son únicas.Esta respuesta se basa en pocas de esas respuestas.Una de ellas es la respuesta de Lenny Dolling.
ja: ここには30以上の回答があり、同じものもあればユニークなものもあります。この回答はそのうちのいくつかの回答に基づいています。そのうちの一つは@Lenn Dollingさんの回答です。
ko: 여기에 30 개 이상의 답변이 있으며 일부는 동일하고 일부는 독특합니다. 이 답변은 그 답변 중 일부를 기반으로합니다. 그중 하나는 @Len Dolling의 답변입니다.
ru: Здесь более 30 ответов,и некоторые из них такие же,а некоторые уникальные.Этот ответ основан на немногих из этих ответов.Один из них является ответом Ленна Доллинга.
zh_cn: 这里有30多个答案,有的答案是一样的,有的答案是唯一的。这个答案是基于其中的几个答案。其中一个是@Lenn Dolling的答案。

source: There are a lot of different approaches to work around those <code>ANDROID_ID</code> issues (may be <code>null</code> sometimes or devices of a specific model always return the same ID) with pros and cons:
es: Hay muchos enfoques diferentes para <code>ANDROID_ID</code> esos problemas de ANDROID_ID (a veces puede ser <code>null</code> o los dispositivos de un modelo espec&iacute;fico siempre devuelven la misma ID) con pros y contras:
ja: これらの <code>ANDROID_ID</code> の問題を回避するための多くの異なるアプローチがあり <code>null</code> （ nullになることも、特定のモデルのデバイスが常に同じIDを返すこともあります）。
ko: 장단점과 함께 <code>ANDROID_ID</code> 문제를 해결하는 방법에는 여러 가지가 있습니다 (때로는 <code>null</code> 이거나 특정 모델의 장치가 항상 동일한 ID를 반환 함).
ru: Существует много разных подходов к <code>ANDROID_ID</code> этих проблем ANDROID_ID (иногда они могут быть <code>null</code> или устройства определенной модели всегда возвращают один и тот же идентификатор) с плюсами и минусами:
zh_cn: 有许多不同的方法可以解决这些 <code>ANDROID_ID</code> 问题（有时可能为 <code>null</code> 或特定模型的设备总是返回相同的ID），但各有利弊：
