Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: ANDROID_ID is the preferred device identifier. ANDROID_ID is perfectly reliable on versions of Android &lt;=2.1 or &gt;=2.3. Only 2.2 has the problems mentioned in the post.
es: ANDROID_ID es el identificador de dispositivo preferido. ANDROID_ID es perfectamente confiable en las versiones de Android &lt;= 2.1 o&gt; = 2.3. Solo 2.2 tiene los problemas mencionados en la publicaci&oacute;n.
ja: ANDROID_IDは優先デバイス識別子です。 ANDROID_IDは、Android &lt;= 2.1または&gt; = 2.3のバージョンで完全に信頼できます。 投稿で言及されている問題があるのは2.2だけです。
ko: ANDROID_ID는 기본 장치 식별자입니다. ANDROID_ID는 Android &lt;= 2.1 또는&gt; = 2.3 버전에서 완벽하게 신뢰할 수 있습니다. 게시물에 언급 된 문제는 2.2 만입니다.
ru: ANDROID_ID является предпочтительным идентификатором устройства. ANDROID_ID абсолютно надежен в версиях Android &lt;= 2.1 или&gt; = 2.3. Только 2.2 имеет проблемы, упомянутые в посте.
zh_cn: ANDROID_ID是首选的设备标识符。 ANDROID_ID在Android &lt;= 2.1或&gt; = 2.3的版本上完全可靠。 只有2.2具有帖子中提到的问题。

source: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code><code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> (<a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">How to get the Android device's primary e-mail address</a>)
es: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code> <code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> ( <a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">C&oacute;mo obtener la direcci&oacute;n de correo electr&oacute;nico principal del dispositivo Android</a> )
ja: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code> <code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> （ <a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">Androidデバイスのメインのメールアドレスを取得する方法</a> ）
ko: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code> <code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> ( <a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">Android 기기의 기본 이메일 주소를 얻는 방법</a> )
ru: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code> <code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> ( <a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">Как получить основной адрес электронной почты устройства Android</a> )
zh_cn: API 14+ <code>&lt;uses-permission android:name="android.permission.READ_PROFILE" /&gt;</code> <code>&lt;uses-permission android:name="android.permission.READ_CONTACTS" /&gt;</code> （ <a href="https://stackoverflow.com/questions/2112965/how-to-get-the-android-devices-primary-e-mail-address">如何获取Android设备的主要电子邮件地址</a> ）

source: API 5+ <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> or
es: API 5+ <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> o
ja: API 5+ <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> または
ko: API 5 이상 <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> 또는
ru: API 5+ <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> или
zh_cn: API 5+ <code>&lt;uses-permission android:name="android.permission.GET_ACCOUNTS" /&gt;</code> 或

source: Abusing other IDs like <a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a>, serial number, Wi-Fi/Bluetooth-MAC address (they won't exist on all devices or additional permissions become necessary)
es: Abusar de otras identificaciones como <a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a> , n&uacute;mero de serie, direcci&oacute;n Wi-Fi / Bluetooth-MAC (no existir&aacute;n en todos los dispositivos o ser&aacute;n necesarios permisos adicionales)
ja: <a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a> 、シリアル番号、Wi-Fi / Bluetooth-MACアドレスなどの他のIDの悪用（すべてのデバイスに存在するわけではないか、追加の権限が必要になります）
ko: <a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a> , 일련 번호, Wi-Fi / Bluetooth-MAC 주소와 같은 다른 ID 남용 (일부 장치에 존재하지 않거나 추가 권한이 필요함)
ru: Злоупотребление другими идентификаторами, такими как <a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a> , серийный номер, Wi-Fi / Bluetooth-MAC-адрес (они не будут существовать на всех устройствах, или потребуются дополнительные разрешения)
zh_cn: 滥用其他ID，例如<a href="https://en.wikipedia.org/wiki/International_Mobile_Station_Equipment_Identity">IMEI</a> ，序列号，Wi-Fi /蓝牙MAC地址（它们不会在所有设备上都存在，或者需要其他权限）

source: Add Below code in class file:
es: Añade el código de abajo en el archivo de la clase:
ja: クラスファイルに以下のコードを追加します。
ko: 클래스 파일에 아래 코드를 추가하십시오.
ru: Добавьте код ниже в файл класса:
zh_cn: 在类文件中添加下面的代码。

source: Add in AndroidManifest.xml:
es: Añade en AndroidManifest.xml:
ja: AndroidManifest.xmlに追加します。
ko: AndroidManifest.xml에 추가하십시오.
ru: Добавить в AndroidManifest.xml:
zh_cn: 添加到AndroidManifest.xml中。

source: After reading every Stack Overflow post about creating a unique ID, the Google developer blog and Android documentation, I feel as if the 'Pseudo ID' is the best possible option.
es: Después de leer cada post de Stack Overflow sobre la creación de un ID único,el blog del desarrollador de Google y la documentación de Android,siento que el 'Pseudo ID' es la mejor opción posible.
ja: ユニークなIDの作成についてのStack Overflowの記事、Googleの開発者ブログ、Androidのドキュメントをすべて読んだ後、私は「疑似ID」が最良の選択肢であるように感じています。
ko: 고유 ID, Google 개발자 블로그 및 Android 설명서 작성에 대한 모든 스택 오버플로 게시물을 읽은 후 '의사 ID'가 최상의 옵션 인 것 같습니다.
ru: Прочитав каждый пост о переполнении стека о создании уникального ID,блог Google developer и документацию по Android,я чувствую,что 'Псевдо-идентификатор'-это лучший вариант.
zh_cn: 在阅读了每一篇关于创建唯一ID的Stack Overflow帖子、Google开发者博客和Android文档后,我觉得 "伪ID "是最好的选择。

source: Again, this code is for a device ID, not an app installation ID. For most situations, an app installation ID is probably what you're looking for. But if you do need a device ID, then the following code will probably work for you.
es: De nuevo,este código es para una identificación del dispositivo,no para una identificación de la instalación de la aplicación.Para la mayoría de las situaciones,un ID de instalación de la aplicación es probablemente lo que estás buscando.Pero si necesitas un ID de dispositivo,entonces el siguiente código probablemente te servirá.
ja: 繰り返しになりますが、このコードはデバイスIDのためのものであり、アプリのインストールIDではありません。ほとんどの状況では、アプリのインストールIDが必要でしょう。しかし、デバイスIDが必要な場合は、以下のコードを使用するとよいでしょう。
ko: 이 코드는 앱 설치 ID가 아니라 장치 ID 용입니다. 대부분의 경우 앱 설치 ID가 원하는 것일 수 있습니다. 그러나 장치 ID가 필요한 경우 다음 코드가 적합 할 것입니다.
ru: Опять же,этот код предназначен для идентификатора устройства,а не для идентификатора установки приложения.В большинстве ситуаций идентификатор установки приложения-это то,что вы ищете.Но если вам нужен идентификатор устройства,то следующий код,вероятно,подойдет вам.
zh_cn: 同样,这个代码是针对设备ID,而不是应用安装ID。在大多数情况下,你需要的可能是一个应用安装ID。但如果你需要一个设备ID,那么下面的代码可能对你有用。

source: All CDMA devices returned null for <code>getSimSerialNumber()</code> (as expected)
es: Todos los dispositivos CDMA devueltos nulos para <code>getSimSerialNumber()</code> (como se esperaba)
ja: すべてのCDMAデバイスが <code>getSimSerialNumber()</code> に対してnullを返しました（期待どおり）
ko: 모든 CDMA 장치가 <code>getSimSerialNumber()</code> 대해 null을 반환 했습니다 ( 예상)
ru: Все устройства CDMA вернули null для <code>getSimSerialNumber()</code> (как и ожидалось)
zh_cn: 所有CDMA设备的 <code>getSimSerialNumber()</code> 返回null（按预期方式）

source: All CDMA devices returned the same value (or derivation of the same value) for both <code>ANDROID_ID</code> and <code>TelephonyManager.getDeviceId()</code> -- <em>as long as</em> a Google account has been added during setup.
es: Todos los dispositivos CDMA devolvieron el mismo valor (o derivaci&oacute;n del mismo valor) para <code>ANDROID_ID</code> y <code>TelephonyManager.getDeviceId()</code> , <em>siempre y cuando</em> se haya agregado una cuenta de Google durante la configuraci&oacute;n.
ja: <code>ANDROID_ID</code> と <code>TelephonyManager.getDeviceId()</code> の両方に対して 、すべてのCDMAデバイスが同じ値（または同じ値の派生）を返しました -セットアップ中にGoogleアカウントが追加されている<em>限り</em> 。
ko: 모든 CDMA 장치는 설정 중에 Google 계정이 추가 <em>되어</em> 있는 한 <code>ANDROID_ID</code> 및 <code>TelephonyManager.getDeviceId()</code> 대해 동일한 값 (또는 동일한 값 파생)을 반환했습니다.
ru: Все устройства CDMA возвращали одно и то же значение (или производное одного и того же значения) для <code>ANDROID_ID</code> и <code>TelephonyManager.getDeviceId()</code> - <em>до тех пор, пока</em> учетная запись Google была добавлена ​​во время установки.
zh_cn: 所有CDMA设备对于 <code>ANDROID_ID</code> 和 <code>TelephonyManager.getDeviceId()</code> 都返回相同的值（或得出相同的值） - <em>只要</em>在安装过程中添加了Google帐户即可。

source: All GSM devices (all tested with a SIM) returned a value for <code>TelephonyManager.getSimSerialNumber()</code>
es: Todos los dispositivos GSM (todos probados con una SIM) devolvieron un valor para <code>TelephonyManager.getSimSerialNumber()</code>
ja: すべてのGSMデバイス（すべてSIMでテスト済み）が <code>TelephonyManager.getSimSerialNumber()</code> の値を返しました
ko: 모든 GSM 장치 (모두 SIM으로 테스트)는 <code>TelephonyManager.getSimSerialNumber()</code> 대한 값을 반환했습니다.
ru: Все устройства GSM (все протестированы с SIM-картой) вернули значение для <code>TelephonyManager.getSimSerialNumber()</code>
zh_cn: 所有GSM设备（均已通过SIM测试）均返回 <code>TelephonyManager.getSimSerialNumber()</code> 的值

source: All devices tested returned a value for <code>TelephonyManager.getDeviceId()</code>
es: Todos los dispositivos probados devolvieron un valor para <code>TelephonyManager.getDeviceId()</code>
ja: テストしたすべてのデバイスが <code>TelephonyManager.getDeviceId()</code> の値を返しました
ko: 테스트 된 모든 장치가 <code>TelephonyManager.getDeviceId()</code> 대한 값을 리턴했습니다.
ru: Все протестированные устройства вернули значение для <code>TelephonyManager.getDeviceId()</code>
zh_cn: 所有测试的设备均返回 <code>TelephonyManager.getDeviceId()</code> 的值

source: All devices with a Google account added returned a value for <code>ANDROID_ID</code>
es: Todos los dispositivos con una cuenta de Google agregada devolvieron un valor para <code>ANDROID_ID</code>
ja: Googleアカウントが追加されたすべてのデバイスが <code>ANDROID_ID</code> の値を返しました
ko: Google 계정이 추가 된 모든 기기에서 <code>ANDROID_ID</code> 에 대한 값을 반환했습니다.
ru: Все устройства с добавленной учетной записью Google вернули значение <code>ANDROID_ID</code>
zh_cn: 所有添加了Google帐户的设备都返回了 <code>ANDROID_ID</code> 的值

source: All the hardware based identifiers (SSAID, IMEI, MAC, etc) are unreliable for non-google's devices (Everything except Pixels and Nexuses), which are more than 50% of active devices worldwide. Therefore official <a href="https://developer.android.com/training/articles/user-data-ids">Android identifiers best practices</a> clearly states:
es: Todos los identificadores basados ​​en hardware (SSAID, IMEI, MAC, etc.) no son confiables para dispositivos que no son de Google (todo excepto p&iacute;xeles y nexos), que son m&aacute;s del 50% de los dispositivos activos en todo el mundo. Por lo tanto, <a href="https://developer.android.com/training/articles/user-data-ids">las mejores pr&aacute;cticas de los identificadores</a> oficiales de Android establecen claramente:
ja: すべてのハードウェアベースの識別子（SSAID、IMEI、MACなど）は、世界中のアクティブなデバイスの50％を超えるGoogle以外のデバイス（PixelとNexusを除くすべて）では信頼できません。 したがって、公式の<a href="https://developer.android.com/training/articles/user-data-ids">Android識別子のベストプラクティス</a>には、次のように明記されています。
ko: 모든 하드웨어 기반 식별자 (SSAID, IMEI, MAC 등)는 전 세계 활성 기기의 50 % 이상인 Google 이외의 기기 (픽셀 및 Nexus 제외)에는 신뢰할 수 없습니다. 따라서 공식 <a href="https://developer.android.com/training/articles/user-data-ids">Android 식별자 모범 사례</a> 에는 다음과 같이 명확하게 명시되어 있습니다.
ru: Все аппаратные идентификаторы (SSAID, IMEI, MAC и т. Д.) Ненадежны для устройств, не принадлежащих Google (все, кроме пикселей и Nexuses), которые составляют более 50% активных устройств во всем мире. Поэтому в официальных <a href="https://developer.android.com/training/articles/user-data-ids">рекомендациях по использованию идентификаторов Android</a> четко говорится:
zh_cn: 所有基于硬件的标识符（SSAID，IMEI，MAC等）对于非Google的设备（除Pixels和Nexus以外的所有设备）都不可靠，这些设备占全球活动设备的50％以上。 因此，官方<a href="https://developer.android.com/training/articles/user-data-ids">Android标识符最佳做法</a>明确指出：

source: Also you might consider the Wi-Fi adapter's MAC address. Retrieved thusly:
es: También puedes considerar la dirección MAC del adaptador Wi-Fi.Recuperada así:
ja: また、Wi-FiアダプタのMACアドレスを考慮するかもしれません。このように取得しました。
ko: 또한 Wi-Fi 어댑터의 MAC 주소를 고려할 수 있습니다. 따라서 검색 :
ru: Также можно учитывать MAC-адрес адаптера Wi-Fi.Извлеченный таким образом:
zh_cn: 另外,你可以考虑Wi-Fi适配器的MAC地址。这样检索到的。

source: And for full details of how to implement the backup agent see <em><a href="http://developer.android.com/guide/topics/data/backup.html">Data Backup</a></em>. I particularly recommend the section at the bottom on testing as the backup does not happen instantaneously and so to test you have to force the backup.
es: Y para obtener todos los detalles sobre c&oacute;mo implementar el agente de copia de seguridad, consulte <em><a href="http://developer.android.com/guide/topics/data/backup.html">Copia de seguridad de datos</a></em> . Recomiendo especialmente la secci&oacute;n en la parte inferior de las pruebas, ya que la copia de seguridad no se realiza instant&aacute;neamente, por lo que para realizar la prueba debe forzar la copia de seguridad.
ja: また、バックアップエージェントの実装方法の詳細については、 <em><a href="http://developer.android.com/guide/topics/data/backup.html">データバックアップを</a></em>参照してください。 バックアップは瞬時に実行されないため、テストを実行するにはバックアップを強制する必要があるため、テストの下部にあるセクションを特にお勧めします。
ko: 백업 에이전트를 구현하는 방법에 대한 자세한 내용은 <em><a href="http://developer.android.com/guide/topics/data/backup.html">데이터 백업을</a></em> 참조하십시오. 백업이 즉시 수행되지 않으므로 테스트를 수행하려면 백업 맨 아래 섹션을 사용하는 것이 좋습니다.
ru: А для получения полной информации о том, как реализовать агент резервного копирования, см. <em><a href="http://developer.android.com/guide/topics/data/backup.html">Резервное копирование данных</a></em> . Я особенно рекомендую раздел внизу, посвященный тестированию, поскольку резервное копирование не происходит мгновенно, поэтому для тестирования необходимо принудительно выполнить резервное копирование.
zh_cn: 有关如何实施备份代理的完整详细信息，请参见<em><a href="http://developer.android.com/guide/topics/data/backup.html">数据备份</a></em> 。 我特别推荐测试底部的部分，因为备份不会立即发生，因此要进行测试，您必须强制执行备份。

source: And use the code below in a background thread:
es: Y usa el código de abajo en un hilo de fondo:
ja: そして、以下のコードをバックグラウンドスレッドで使用します。
ko: 그리고 백그라운드 스레드에서 아래 코드를 사용하십시오.
ru: И используйте приведенный ниже код в фоновом потоке:
zh_cn: 并在背景线程中使用下面的代码。

source: Another way is to use <code>/sys/class/android_usb/android0/iSerial</code> in an app without any permissions whatsoever.
es: Otra forma es usar <code>/sys/class/android_usb/android0/iSerial</code> en una aplicaci&oacute;n sin ning&uacute;n tipo de permiso.
ja: 別の方法は、権限なしでアプリで <code>/sys/class/android_usb/android0/iSerial</code> を使用することです。
ko: 또 다른 방법은 권한없이 앱에서 <code>/sys/class/android_usb/android0/iSerial</code> 을 사용하는 것입니다.
ru: Другой способ - использовать <code>/sys/class/android_usb/android0/iSerial</code> в приложении без каких-либо разрешений.
zh_cn: 另一种方法是在没有任何许可的情况下在应用程序中使用 <code>/sys/class/android_usb/android0/iSerial</code> 。

source: As Dave Webb mentions, the <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android Developer Blog has an article</a> that covers this. Their preferred solution is to track app installs rather than devices, and that will work well for most use cases. The blog post will show you the necessary code to make that work, and I recommend you check it out.
es: Como Dave Webb menciona, el <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Blog para desarrolladores de Android tiene un art&iacute;culo</a> que cubre esto. Su soluci&oacute;n preferida es rastrear las instalaciones de aplicaciones en lugar de los dispositivos, y eso funcionar&aacute; bien para la mayor&iacute;a de los casos de uso. La publicaci&oacute;n del blog le mostrar&aacute; el c&oacute;digo necesario para que funcione, y le recomiendo que lo revise.
ja: Dave Webbが言及しているように、 <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android開発者ブログには</a>これをカバーする記事があります。 彼らが好むソリューションは、デバイスではなくアプリのインストールを追跡することであり、ほとんどのユースケースでうまく機能します。 ブログの投稿には、その機能を実現するために必要なコードが表示されます。ぜひチェックしてください。
ko: Dave Webb가 언급했듯이 <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android 개발자 블로그에는</a> 이를 다루는 기사 가 있습니다. 그들이 선호하는 솔루션은 기기가 아닌 앱 설치를 추적하는 것이며 대부분의 사용 사례에서 잘 작동합니다. 블로그 게시물에는 해당 작업을 수행하는 데 필요한 코드가 표시되어 있으므로 확인하시기 바랍니다.
ru: Как упоминает Дейв Уэбб, в <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">блоге разработчиков Android есть статья</a> , посвященная этому. Их предпочтительным решением является отслеживание установок приложений, а не устройств, и это будет хорошо работать в большинстве случаев использования. В блоге будет показан необходимый код для этой работы, и я рекомендую вам проверить его.
zh_cn: 正如Dave Webb所提到的， <a href="https://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android开发者博客上有一篇文章</a>对此进行了介绍。 他们的首选解决方案是跟踪应用安装而不是设备，并且在大多数用例中都可以很好地工作。 博客文章将向您显示完成该工作所需的代码，我建议您检查一下。

source: As Richard mentions below, don't forget that you need permission to read the <code>TelephonyManager</code> properties, so add this to your manifest:
es: Como Richard menciona a continuaci&oacute;n, no olvide que necesita permiso para leer las propiedades de <code>TelephonyManager</code> , as&iacute; que agregue esto a su manifiesto:
ja: Richardが以下で言及するように、 <code>TelephonyManager</code> プロパティを読み取るための権限が必要であることを忘れないでください。そのため、これをマニフェストに追加してください：
ko: Richard가 아래에 언급했듯이 <code>TelephonyManager</code> 속성을 읽을 수있는 권한이 필요하다는 것을 잊지 마십시오. 매니페스트에 추가하십시오.
ru: Как упоминает Ричард ниже, не забывайте, что вам нужно разрешение на чтение свойств <code>TelephonyManager</code> , поэтому добавьте это в свой манифест:
zh_cn: 正如Richard在下面提到的那样，请不要忘记您需要阅读 <code>TelephonyManager</code> 属性的权限，因此请将其添加到清单中：

source: As example <code>CVE-2018-9489</code> which affects all the WIFI based techniques mentioned above.
es: Como ejemplo <code>CVE-2018-9489</code> que afecta a todas las t&eacute;cnicas basadas en WIFI mencionadas anteriormente.
ja: 例として、上記のすべてのWIFIベースの手法に影響する <code>CVE-2018-9489</code> 。
ko: 위에서 언급 한 모든 WIFI 기반 기술에 영향을주는 예제 <code>CVE-2018-9489</code> .
ru: В качестве примера <code>CVE-2018-9489</code> , который влияет на все методы, основанные на WIFI, упомянутые выше.
zh_cn: 作为示例 <code>CVE-2018-9489</code> ，它会影响上述所有基于WIFI的技术。

source: As far as I've been able to determine, all affected devices have <a href="https://issuetracker.google.com/issues/36920653">the same ANDROID_ID</a>, which is <a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a>. Which is also the same device id reported by the emulator, btw.
es: Hasta donde he podido determinar, todos los dispositivos afectados tienen <a href="https://issuetracker.google.com/issues/36920653">el mismo ANDROID_ID</a> , que es <a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a> . Que tambi&eacute;n es la misma identificaci&oacute;n de dispositivo informada por el emulador, por cierto.
ja: 私が判断できる限り、影響を受けるすべてのデバイスは<a href="https://issuetracker.google.com/issues/36920653">同じANDROID_IDを</a>持っています。これは<a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a>です。 これは、エミュレーターによって報告された同じデバイスIDでもあります。
ko: 내가 결정할 수있는 한, 영향을받는 모든 장치는 <a href="https://issuetracker.google.com/issues/36920653">동일한 ANDROID_ID</a> 인 <a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a> 입니다. 에뮬레이터에서보고 한 것과 동일한 장치 ID 인 btw도 있습니다.
ru: Насколько я смог определить, все затронутые устройства имеют <a href="https://issuetracker.google.com/issues/36920653">одинаковый ANDROID_ID</a> , который равен <a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a> . Который также является идентичным идентификатором устройства, сообщенным эмулятором, кстати.
zh_cn: 据我所确定，所有受影响的设备都具有<a href="https://issuetracker.google.com/issues/36920653">相同的ANDROID_ID</a> ，即<a href="https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=9774d56d682e549c">9774d56d682e549c</a> 。 这也是模拟器报告的相同设备ID，btw。

source: At <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I/O</a> Reto Meier released a robust answer to how to approach this which should meet most developers needs to track users across installations. Anthony Nolan shows the direction in his answer, but I thought I'd write out the full approach so that others can easily see how to do it (it took me a while to figure out the details).
es: En <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O,</a> Reto Meier lanz&oacute; una respuesta s&oacute;lida sobre c&oacute;mo abordar esto, que deber&iacute;a satisfacer las necesidades de la mayor&iacute;a de los desarrolladores para rastrear a los usuarios en todas las instalaciones. Anthony Nolan muestra la direcci&oacute;n en su respuesta, pero pens&eacute; que escribir&iacute;a el enfoque completo para que otros puedan ver f&aacute;cilmente c&oacute;mo hacerlo (me tom&oacute; un tiempo descubrir los detalles).
ja: <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / Oで、</a> Reto Meierは、インストール全体でユーザーを追跡するほとんどの開発者のニーズを満たす必要がある、これにアプローチする方法に対する堅牢な回答をリリースしました。 アンソニーノーランは彼の答えに方向性を示していますが、他の人が簡単にその方法を理解できるように、完全なアプローチを書き出そうと思いました（詳細を理解するのにしばらく時間がかかりました）。
ko: <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O에서</a> Reto Meier는이 방법에 접근하는 방법에 대한 강력한 답변을 발표했습니다. Anthony Nolan은 그의 대답에 방향을 보여 주지만 다른 사람들이 쉽게 방법을 볼 수 있도록 전체 접근 방식을 작성한다고 생각했습니다 (세부 사항을 파악하는 데 시간이 걸렸습니다).
ru: В <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O</a> Рето Мейер (Rto Meier) выпустил исчерпывающий ответ о том, как подойти к этому, что должно отвечать большинству разработчиков, чтобы отслеживать пользователей в различных установках. Энтони Нолан показывает направление в своем ответе, но я решил написать полный подход, чтобы другие могли легко увидеть, как это сделать (мне потребовалось некоторое время, чтобы выяснить детали).
zh_cn: Reto Meier在<a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O上</a>发布了一个强有力的答案，说明了如何解决此问题，这应满足大多数开发人员跟踪安装之间用户的需求。 安东尼&middot;诺兰（Anthony Nolan）在回答中指明了方向，但我认为我应该写出完整的方法，以便其他人可以轻松地了解如何做到这一点（花了我一段时间才弄清楚细节）。

source: At least the following devices are known to have this file world-readable:
es: Se sabe que al menos los siguientes dispositivos tienen este archivo legible en todo el mundo:
ja: 少なくとも以下のデバイスでは、このファイルがworld-readableであることが知られています。
ko: 최소한 다음 장치는이 파일을 세계에서 읽을 수있는 것으로 알려져 있습니다.
ru: Известно,что по крайней мере следующие устройства имеют возможность чтения этого файла в мире:
zh_cn: 已知至少有以下设备具有该文件的世界可读性。
