Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Based on Google's recommendations, I implemented a class that will generate a unique UUID for each device, using ANDROID_ID as the seed where appropriate, falling back on TelephonyManager.getDeviceId() as necessary, and if that fails, resorting to a randomly generated unique UUID that is persisted across app restarts (but not app re-installations).
es: Basado en las recomendaciones de Google,implementé una clase que generará un UUID único para cada dispositivo,usando ANDROID_ID como semilla cuando sea apropiado,recurriendo a TelephonyManager.getDeviceId()según sea necesario,y si eso falla,recurriendo a un UUID único generado al azar que persiste a través de reinicios de aplicaciones (pero no de reinstalaciones de aplicaciones).
ja: Googleの推奨事項に基づいて、私は各デバイスに一意のUUIDを生成するクラスを実装しました。必要に応じてTelephonyManager.getDeviceId()にフォールバックし、失敗した場合はランダムに生成された一意のUUIDに頼り、アプリの再起動(アプリの再インストールではなく)にわたって永続化されます。
ko: Google의 권장 사항을 바탕으로 ANDROID_ID를 적절한 시드로 사용하여 필요에 따라 TelephonyManager.getDeviceId ()로 돌아가고 실패하면 임의로 생성 된 고유 UUID를 사용하여 각 장치에 대해 고유 한 UUID를 생성하는 클래스를 구현했습니다. 이는 앱을 다시 시작해도 지속되지만 앱을 다시 설치하지는 않습니다.
ru: Основываясь на рекомендациях Google,я реализовал класс,который будет генерировать уникальный UUID для каждого устройства,используя ANDROID_ID в качестве посылки,где это необходимо,отступая при необходимости от TelephonyManager.getDeviceId(),а в случае неудачи,прибегая к случайно сгенерированному уникальному UUID,который сохраняется во время перезагрузки приложения (но не переустановки приложения).
zh_cn: 根据Google的建议,我实现了一个类,它将为每个设备生成一个唯一的UUUID,在适当的情况下使用ANDROID_ID作为种子,必要时返回到TelephonyManager.getDeviceId(),如果失败,则采用随机生成的唯一UUUID,该UUUID将在应用程序重启时持久化(但不是应用程序重装)。

source: Based on my tests of devices (all phones, at least one of which is not activated):
es: Basado en mis pruebas de los dispositivos (todos los teléfonos,al menos uno de los cuales no está activado):
ja: デバイス(すべての電話機、少なくとも1つは起動していない)の私のテストに基づいています。
ko: 장치에 대한 나의 테스트 (적어도 하나는 활성화되지 않은 모든 전화기)를 기반으로합니다.
ru: На основании моих тестов устройств (все телефоны,по крайней мере один из которых не активирован):
zh_cn: 根据我对设备的测试(所有的手机,至少有一部没有激活)。

source: Beginning August 1st, 2014, the Google Play Developer Program Policy requires all new app uploads and updates to use the advertising ID in lieu of any other persistent identifiers for any advertising purposes. Learn more
es: A partir del 1 de agosto de 2014,la Política del Programa de Google Play para Desarrolladores exige que todas las nuevas subidas y actualizaciones de aplicaciones utilicen el identificador de publicidad en lugar de cualquier otro identificador persistente con fines publicitarios.Más información
ja: 2014年8月1日より、Google Play デベロッパー プログラム ポリシーでは、新しいアプリのアップロードとアップデートには、広告目的で他の永続的な識別子の代わりに広告 ID を使用することが義務付けられています。詳細はこちら
ko: 2014 년 8 월 1 일부터 Google Play 개발자 프로그램 정책에 따라 광고 목적으로 다른 영구 식별자 대신 광고 ID를 사용하려면 모든 새로운 앱 업로드 및 업데이트가 필요합니다. 더 알아보기
ru: Начиная с 1 августа 2014 г.,Программная политика разработчиков Google Play требует,чтобы все новые приложения,загружаемые и обновляемые,использовали рекламный ID вместо любых других постоянных идентификаторов для любых рекламных целей.Узнать больше
zh_cn: 从2014年8月1日开始,Google Play开发者计划政策要求所有新上传和更新的应用都必须使用广告ID代替任何其他持久性标识符用于任何广告目的。了解更多

source: But I strongly recommend a method suggested by Google, see <em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">Identifying App Installations</a></em>.
es: Pero recomiendo encarecidamente un m&eacute;todo sugerido por Google, consulte <em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">Identificaci&oacute;n de instalaciones de aplicaciones</a></em> .
ja: ただし、Googleが提案する方法を強くお勧めします。 <em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">アプリインストールの識別を</a></em>ご覧ください。
ko: 그러나 Google에서 제안한 방법을 강력히 권장합니다 ( <em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">앱 설치 식별</a></em> 참조).
ru: Но я настоятельно рекомендую метод, предложенный Google, см. <em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">Определение установок приложений</a></em> .
zh_cn: 但我强烈建议Google建议一种方法，请参阅<em><a href="http://android-developers.blogspot.mx/2011/03/identifying-app-installations.html">识别应用程序安装</a></em> 。

source: But i recommend to use:
es: Pero recomiendo usar:
ja: しかし、私は使用することをお勧めします。
ko: 그러나 나는 다음을 사용하는 것이 좋습니다.
ru: Но я рекомендую использовать:
zh_cn: 但我推荐使用。

source: Changed the Pseudo
es: Cambió el Pseudo
ja: 擬似的に変更した
ko: 의사 변경
ru: Изменил Псевдо
zh_cn: 改变了伪装

source: Do Android devices have a unique ID, and if so, what is a simple way to access it using Java?
es: ¿Tienen los dispositivos Android una identificación única,y si es así,cuál es una forma sencilla de acceder a ellos usando Java?
ja: Android端末は固有のIDを持っているのか、持っている場合はJavaを使って簡単にアクセスする方法を教えてください。
ko: Android 기기에는 고유 ID가 있습니까? 그렇다면 Java를 사용하여 액세스하는 간단한 방법은 무엇입니까?
ru: Имеют ли Android-устройства уникальный идентификатор,и если да,то какой простой способ доступа к ним с помощью Java?
zh_cn: 安卓设备是否有唯一的ID,如果有,有什么简单的方法可以用Java访问?

source: Edited the code to change on API
es: Editado el código para cambiar en la API
ja: API上で変更するためにコードを編集しました
ko: API에서 변경하도록 코드를 편집했습니다.
ru: Отредактирован код для изменения на API
zh_cn: 编辑了代码,在API上进行修改

source: Finally create a user ID, if it doesn't already exist, and store it in the SharedPreferences:
es: Finalmente crea un ID de usuario,si no existe ya,y guárdalo en las Preferencias Compartidas:
ja: 最後に、まだ存在しない場合はユーザーIDを作成し、それをSharedPreferencesに格納します。
ko: 마지막으로 사용자 ID가없는 경우이를 작성하여 SharedPreferences에 저장하십시오.
ru: Наконец,создайте идентификатор пользователя,если его еще нет,и сохраните его в SharedPreferences:
zh_cn: 最后创建一个用户ID,如果还不存在的话,就创建一个用户ID,并将其存储在SharedPreferences中。

source: For <strong>TRACKING HARDWARE</strong>, this is a great idea
es: Para <strong>TRACKING HARDWARE</strong> , esta es una gran idea
ja: <strong>TRACKING HARDWAREの</strong>場合、これは素晴らしいアイデアです
ko: <strong>하드웨어 추적의</strong> 경우 이는 좋은 아이디어입니다
ru: Для <strong>отслеживания оборудования</strong> , это отличная идея
zh_cn: 对于<strong>跟踪硬件</strong> ，这是个好主意

source: For detailed instructions on how to get a unique identifier for each Android device your application is installed from, see the official Android Developers Blog posting <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Identifying App Installations</a></em>.
es: Para obtener instrucciones detalladas sobre c&oacute;mo obtener un identificador &uacute;nico para cada dispositivo Android desde el que se instala su aplicaci&oacute;n, consulte el blog oficial de desarrolladores de Android que publica la <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">identificaci&oacute;n de instalaciones de aplicaciones</a></em> .
ja: アプリケーションのインストール元であるAndroidデバイスごとに一意の識別子を取得する方法の詳細については、Android開発者の公式ブログの投稿「 <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">アプリのインストールの識別</a></em> 」を参照してください。
ko: 애플리케이션이 설치된 각 Android 기기마다 고유 식별자를 얻는 방법에 대한 자세한 지침은 공식 Android 개발자 블로그 게시물 <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">앱 설치 식별을</a></em> 참조하십시오.
ru: Подробные инструкции о том, как получить уникальный идентификатор для каждого устройства Android, с которого установлено приложение, см. В официальном блоге разработчиков Android, в котором описывается <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">определение установок приложений</a></em> .
zh_cn: 有关如何获取安装了应用程序的每个Android设备的唯一标识符的详细说明，请参阅发布了&ldquo; <em><a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">标识应用程序安装&rdquo;</a></em>的官方Android开发者博客。

source: For hardware recognition of a specific Android device you could check the MAC Addresses.
es: Para el reconocimiento por hardware de un dispositivo Android específico,puedes comprobar las direcciones MAC.
ja: 特定のAndroidデバイスのハードウェア認識については、MACアドレスを確認することができます。
ko: 특정 Android 기기의 하드웨어 인식을 위해 MAC 주소를 확인할 수 있습니다.
ru: Для аппаратного распознавания конкретного Android-устройства можно проверить MAC-адреса.
zh_cn: 对于特定Android设备的硬件识别,你可以查看MAC地址。

source: For more information on this approach see <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">Reto's talk</a>.
es: Para obtener m&aacute;s informaci&oacute;n sobre este enfoque, consulte <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">la charla de Reto</a> .
ja: このアプローチの詳細については、 <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">Retoの講演を</a>参照してください。
ko: 이 접근법에 대한 자세한 정보는 <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">Reto 's talk을</a> 참조하십시오.
ru: Для получения дополнительной информации об этом подходе см. <a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">Доклад Рето</a> .
zh_cn: 有关此方法的更多信息，请参见<a href="http://www.google.com/events/io/2011/sessions/android-protips-advanced-topics-for-expert-android-app-developers.html">Reto的演讲</a> 。

source: Full disclosure: my app used the below approach originally but no longer uses this approach, and we now use the approach outlined in the <a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android Developer Blog</a> entry that <a href="https://stackoverflow.com/a/5626208/231078">emmby's answer</a> links to (namely, generating and saving a <a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"><code>UUID#randomUUID()</code></a>).
es: Divulgaci&oacute;n completa: mi aplicaci&oacute;n us&oacute; originalmente el siguiente enfoque, pero ya no usa este enfoque, y ahora usamos el enfoque descrito en la entrada del <a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Blog para desarrolladores de Android</a> que <a href="https://stackoverflow.com/a/5626208/231078">enlaza la respuesta de emmby</a> (es decir, generar y guardar un <a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"> <code>UUID#randomUUID()</code> </a> ).
ja: 完全な開示：私のアプリは元々以下のアプローチを使用していましたが、現在はこのアプローチを使用していません。現在は、 <a href="https://stackoverflow.com/a/5626208/231078">emmbyの回答</a>リンクへの <a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android開発者ブログ</a>エントリで概説されているアプローチを使用しています（つまり、 <a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"> <code>UUID#randomUUID()</code> の</a>生成と保存）。
ko: 전체 공개 : 내 앱은 원래 아래 접근법을 사용했지만 더 이상이 접근법을 사용하지 않으며 이제는 <a href="https://stackoverflow.com/a/5626208/231078">emmby의 답변이</a> 링크 된 (즉, <a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"> <code>UUID#randomUUID()</code> </a> 생성 및 저장) <a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android 개발자 블로그</a> 항목에 설명 된 접근법을 사용합니다.
ru: Полное раскрытие: мое приложение изначально использовало приведенный ниже подход, но больше не использует этот подход, и теперь мы используем подход, описанный в записи <a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">блога Android Developer, на</a> которую <a href="https://stackoverflow.com/a/5626208/231078">ссылается ответ emmby</a> (а именно, создание и сохранение <a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"> <code>UUID#randomUUID()</code> </a> ).
zh_cn: 完整披露：我的应用最初使用以下方法，但不再使用此方法，现在我们使用<a href="https://stackoverflow.com/a/5626208/231078">emmby的答案</a>链接到的<a href="http://android-developers.blogspot.com/2011/03/identifying-app-installations.html">Android开发者博客</a>条目中概述的方法（即，生成并保存<a href="http://developer.android.com/reference/java/util/UUID.html#randomUUID()"> <code>UUID#randomUUID()</code> </a> ）。

source: Galaxy Nexus
es: Nexo de la galaxia
ja: ギャラクシーネクサス
ko: 갤럭시 넥서스
ru: Галактика Нексус

source: Google Player Services InstanceID
es: Servicios del reproductor de Google InstanceID
ko: Google 플레이어 서비스 인스턴스 ID

source: Google believes that OEMs have patched the issue for many or most of their devices, but I was able to verify that as of the beginning of April 2011, at least, it's still quite easy to find devices that have the broken ANDROID_ID.
es: Google cree que los fabricantes de equipos originales han solucionado el problema para muchos o la mayoría de sus dispositivos,pero he podido comprobar que a principios de abril de 2011,por lo menos,sigue siendo bastante fácil encontrar dispositivos que tienen el ANDROID_ID roto.
ja: Googleは、OEMが多くの、またはほとんどのデバイスの問題をパッチしたと考えていますが、私が確認できたのは、少なくとも2011年4月の初めの時点では、壊れたandroid_idを持っているデバイスを見つけるのはまだかなり簡単です。
ko: Google은 OEM이 대부분 또는 대부분의 기기에서이 문제를 해결했다고 생각하지만, 2011 년 4 월 초부터 ANDROID_ID가 손상된 기기를 찾는 것이 여전히 쉬운 지 확인할 수있었습니다.
ru: Google считает,что OEM-производители исправили эту проблему для многих или большинства своих устройств,но я смог убедиться,что по состоянию на начало апреля 2011 года,по крайней мере,все еще довольно легко найти устройства,у которых сломался ANDROID_ID.
zh_cn: 谷歌认为,OEM厂商已经为他们的许多或大部分设备打了补丁,但我能够证实的是,至少在2011年4月初,至少在2011年4月的时候,要找到有破损的ANDROID_ID的设备还是相当容易的。

source: Google will give you a backup service key which you need to add to the manifest. You also need to tell the application to use the BackupAgent as follows:
es: Google te dará una clave de servicio de respaldo que debes agregar al manifiesto.También necesitas decirle a la aplicación que use el BackupAgent de la siguiente manera:
ja: Googleは、マニフェストに追加する必要があるバックアップサービスキーを提供します。また、以下のようにアプリケーションにBackupAgentを使用するように指示する必要があります。
ko: Google은 매니페스트에 추가해야하는 백업 서비스 키를 제공합니다. 또한 응용 프로그램에 다음과 같이 BackupAgent를 사용하도록 지시해야합니다.
ru: Google предоставит вам ключ службы резервного копирования,который необходимо добавить в манифест.Также необходимо сообщить приложению,чтобы оно использовало BackupAgent следующим образом:
zh_cn: Google会给你一个备份服务密钥,你需要将其添加到清单中。您还需要告诉应用程序使用BackupAgent,如下所示。

source: HTC One V
ja: HTCワンV
ko: HTC 하나 V

source: Here are a few things to take in mind:
es: Aquí hay algunas cosas para tener en cuenta:
ja: ここでは、いくつかの注意点をご紹介します。
ko: 명심해야 할 몇 가지 사항은 다음과 같습니다.
ru: Вот несколько вещей,которые нужно иметь в виду:
zh_cn: 以下是一些需要注意的事项。

source: Here is how I am generating the unique id:
es: Así es como estoy generando la identificación única:
ja: 私がユニークIDを生成している方法は以下の通りです。
ko: 고유 ID를 생성하는 방법은 다음과 같습니다.
ru: Вот как я генерирую уникальный идентификатор:
zh_cn: 以下是我是如何生成唯一的ID的。

source: Here is the code that Reto Meier used in the <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I/O</a> presentation this year to get a unique id for the user:
es: Aqu&iacute; est&aacute; el c&oacute;digo que Reto Meier us&oacute; en la presentaci&oacute;n de <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O</a> este a&ntilde;o para obtener una identificaci&oacute;n &uacute;nica para el usuario:
ja: Reto Meierがユーザーの一意のIDを取得するために今年の<a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O</a>プレゼンテーションで使用したコードは次のとおりです。
ko: 다음은 Reto Meier가 올해 <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O</a> 프레젠테이션에서 사용자의 고유 ID를 얻기 위해 사용한 코드입니다.
ru: Вот код, который Reto Meier использовал в презентации <a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O в</a> этом году, чтобы получить уникальный идентификатор для пользователя:
zh_cn: 这是Reto Meier今年在<a href="https://en.wikipedia.org/wiki/Google_I/O">Google I / O</a>演示中使用的代码，用于为用户获取唯一的ID：

source: How about the <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEI</a>. That is unique for Android or other mobile devices.
es: &iquest;Qu&eacute; tal el <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEI</a> ? Eso es &uacute;nico para Android u otros dispositivos m&oacute;viles.
ja: <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEIは</a>どうですか。 これはAndroidやその他のモバイルデバイスに固有のものです。
ko: <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEI</a> 는 어떻습니까. 이는 Android 또는 다른 모바일 장치에 고유합니다.
ru: Как насчет <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEI</a> . Это уникально для Android или других мобильных устройств.
zh_cn: <a href="http://en.wikipedia.org/wiki/International_Mobile_Equipment_Identity">IMEI呢</a> ？ 这对于Android或其他移动设备而言是唯一的。

source: However, the blog post goes on to discuss solutions if you need a device identifier rather than an app installation identifier. I spoke with someone at Google to get some additional clarification on a few items in the event that you need to do so. Here's what I discovered about device identifiers that's NOT mentioned in the aforementioned blog post:
es: Sin embargo,la entrada del blog continúa discutiendo soluciones si se necesita un identificador de dispositivo en lugar de un identificador de instalación de una aplicación.Hablé con alguien de Google para obtener algunas aclaraciones adicionales sobre algunos puntos en caso de que necesites hacerlo.Esto es lo que descubrí sobre los identificadores de dispositivos que NO se mencionan en la entrada de blog mencionada:
ja: しかし、ブログ記事では、アプリのインストール識別子ではなく、デバイス識別子が必要な場合の解決策について述べています。必要な場合に備えて、いくつかの項目について追加の説明を得るために、Googleの担当者と話をしました。ここでは、前述のブログ記事では触れられていないデバイス識別子について発見したことを紹介します。
ko: 그러나 앱 설치 식별자가 아닌 장치 식별자가 필요한 경우 블로그 게시물에서 솔루션에 대해 논의합니다. Google 담당자에게 문의하여 필요한 경우 몇 가지 항목에 대한 추가 설명을 얻었습니다. 위에서 언급 한 블로그 게시물에서 언급하지 않은 장치 식별자에 대해 발견 한 내용은 다음과 같습니다.
ru: Однако,в посте блога обсуждаются решения,если вам нужен идентификатор устройства,а не идентификатор установки приложения.Я поговорил с кем-то из Google,чтобы получить дополнительные разъяснения по нескольким пунктам в случае необходимости.Вот что я узнал об идентификаторах устройств,которые НЕ упоминаются в вышеупомянутом посте блога:
zh_cn: 然而,如果你需要一个设备标识符而不是应用安装标识符的话,这篇博文继续讨论解决方案。我与谷歌的人进行了交谈,以获得一些额外的澄清,如果你需要这样做的情况下,一些项目。以下是我发现的关于设备标识符的内容,在上述博文中没有提到。

source: I did not yet have a chance to test GSM devices with no SIM, a GSM device with no Google account added, or any of the devices in airplane mode.
es: Aún no he tenido la oportunidad de probar dispositivos GSM sin SIM,un dispositivo GSM sin cuenta de Google añadido,o cualquiera de los dispositivos en modo avión.
ja: 私はまだSIMなしのGSMデバイス、Googleアカウントが追加されていないGSMデバイス、または飛行機モードでデバイスのいずれかをテストする機会を持っていませんでした。
ko: SIM이없는 GSM 장치, Google 계정이 추가되지 않은 GSM 장치 또는 비행기 모드의 장치는 아직 테스트 할 기회가 없었습니다.
ru: У меня еще не было возможности протестировать GSM-устройства без SIM-карты,GSM-устройство без аккаунта Google и ни одно из устройств в режиме полета.
zh_cn: 我还没有机会测试没有SIM卡的GSM设备,没有添加谷歌账户的GSM设备,也没有测试飞机模式下的任何设备。

source: I don't know whether it is actually supported (=not null) by all devices with API level &gt;= 9 though.
es: Sin embargo, no s&eacute; si realmente es compatible (= no nulo) con todos los dispositivos con nivel de API&gt; = 9.
ja: ただし、APIレベルが9以上のすべてのデバイスで実際にサポートされている（= nullではない）かどうかはわかりません。
ko: API 수준이 9보다 큰 모든 장치에서 실제로 지원되는지 (= null이 아닌지) 모르겠습니다.
ru: Я не знаю, поддерживается ли он (= не ноль) всеми устройствами с уровнем API&gt; = 9.
zh_cn: 我不知道API级别&gt; = 9的所有设备是否实际上都支持（=不为null）。

source: I have tried to reference every link that I took information from. If you are missing and need to be included, please comment!
es: He tratado de referirme a todos los enlaces de los que tomé información.Si falta y necesita ser incluido,¡por favor comente!
ja: 情報を取ったリンクは全て参考にしてみました。不足していたり、含まれている必要がある場合は、コメントをお願いします
ko: 정보를 얻은 모든 링크를 참조하려고했습니다. 누락되어 포함해야 할 경우 의견을 말하십시오!
ru: Я пытался ссылаться на каждую ссылку,по которой брал информацию.Если вы отсутствуете и должны быть включены,пожалуйста,прокомментируйте!
zh_cn: 我已经尽力参考了每一个链接,我所提取的资料。如有遗漏,需要收录的,请评论!

source: I know there isn't any 'perfect' way of getting a unique ID without using permissions; however, sometimes we only really need to track the device installation. When it comes to creating a unique ID, we can create a 'pseudo unique id' based solely off of information that the Android API gives us without using extra permissions. This way, we can show the user respect and try to offer a good user experience as well.
es: Sé que no hay ninguna manera "perfecta" de obtener una identificación única sin usar permisos;sin embargo,a veces sólo necesitamos rastrear la instalación del dispositivo.Cuando se trata de crear un ID único,podemos crear un "pseudo ID único" basado únicamente en la información que la API de Android nos da sin usar permisos adicionales.De esta manera,podemos mostrarle respeto al usuario y tratar de ofrecer una buena experiencia al usuario también.
ja: パーミッションを使わずにユニークなIDを取得する「完璧な」方法がないことは知っていますが、デバイスのインストールを追跡する必要がある場合もあります。ユニークなIDを作成することになると、余分なパーミッションを使用せずにAndroid APIが与えてくれる情報だけに基づいて「擬似的にユニークなID」を作成することができます。このようにして、ユーザーに敬意を示し、良いユーザー体験を提供しようとすることができます。
ko: 권한을 사용하지 않고 고유 ID를 얻는 '완벽한'방법이 없다는 것을 알고 있습니다. 그러나 때로는 장치 설치 만 추적하면됩니다. 고유 ID를 만들 때 추가 권한을 사용하지 않고 Android API가 제공 한 정보만으로 '의사 고유 ID'를 만들 수 있습니다. 이런 식으로, 우리는 사용자를 존중하고 좋은 사용자 경험을 제공하려고 노력할 수 있습니다.
ru: Я знаю,что нет никакого "идеального" способа получить уникальный ID без использования разрешений,однако иногда нам нужно лишь отследить установку устройства.Когда дело доходит до создания уникального ID,мы можем создать "псевдо уникальный идентификатор",основанный исключительно на информации,которую Android API дает нам без использования дополнительных разрешений.Таким образом,мы можем показать пользователю уважение и попытаться предложить хороший пользовательский опыт,а также.
zh_cn: 我知道没有任何 "完美 "的方法可以在不使用权限的情况下获得一个唯一的ID;然而,有时我们只需要跟踪设备的安装情况。当谈到创建一个唯一的ID时,我们可以完全根据Android API给我们的信息创建一个 "伪唯一ID",而不使用额外的权限。这样一来,我们既能体现出对用户的尊重,又能尽量提供良好的用户体验。
