Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: There are many answers to this question, most of which will only work "some" of the time, and unfortunately that's not good enough.
es: Hay muchas respuestas a esta pregunta,la mayoría de las cuales sólo funcionarán "algunas" de las veces,y desafortunadamente eso no es suficiente.
ja: この質問に対する答えはたくさんありますが、そのほとんどは「一部」しか機能しませんし、残念ながらそれでは十分ではありません。
ko: 이 질문에 대한 많은 답변이 있으며, 대부분은 "일부"만 작동하지만 불행히도 충분하지 않습니다.
ru: На этот вопрос есть много ответов,большинство из которых сработает только "немного",и,к сожалению,этого недостаточно.
zh_cn: 这个问题的答案有很多,大部分都只能在 "部分 "时间内起作用,遗憾的是,这还不够好。

source: There&rsquo;s rather useful info <strong><a href="http://www.pocketmagic.net/?p=1662">here</a></strong>.
es: Hay informaci&oacute;n bastante &uacute;til <strong><a href="http://www.pocketmagic.net/?p=1662">aqu&iacute;</a></strong> .
ja: <strong><a href="http://www.pocketmagic.net/?p=1662">ここに</a></strong>はかなり役立つ情報があり<strong>ます</strong> 。
ko: <strong><a href="http://www.pocketmagic.net/?p=1662">여기에</a></strong> 유용한 정보가 <strong>있습니다</strong> .
ru: Здесь довольно полезная информация.
zh_cn: 这里有相当有用的信息。

source: This User_ID will now be persistent across installations, even if the user moves device.
es: Este User_ID será ahora persistente en todas las instalaciones,incluso si el usuario mueve el dispositivo.
ja: このUser_IDは、ユーザーがデバイスを移動した場合でも、インストール間で永続的に保持されるようになりました。
ko: 이 User_ID는 이제 사용자가 장치를 이동하더라도 설치 전체에서 유지됩니다.
ru: Теперь этот идентификатор User_ID будет постоянен во всех установках,даже если пользователь перемещает устройство.
zh_cn: 现在,即使用户移动设备,这个User_ID也会在整个安装过程中保持不变。

source: This allows you to have an 'almost unique' ID from the user without taking anything that is private. You can create your own anonymous ID from device information.
es: Esto te permite tener una identificación "casi única" del usuario sin tomar nada que sea privado.Puedes crear tu propia identificación anónima a partir de la información del dispositivo.
ja: これにより、プライベートなものを取ることなく、ユーザーから「ほぼユニーク」なIDを取得することができます。デバイス情報から自分だけの匿名IDを作成することができます。
ko: 개인 정보를 사용하지 않고도 사용자로부터 '거의 고유 한'ID를 가질 수 있습니다. 장치 정보에서 자신의 익명 ID를 만들 수 있습니다.
ru: Это позволяет вам иметь "почти уникальный" ID от пользователя,не беря ничего личного.Вы можете создать свой собственный анонимный ID из информации об устройстве.
zh_cn: 这让你可以从用户那里得到一个 "几乎唯一 "的ID,而不需要拿走任何隐私的东西。你可以从设备信息中创建自己的匿名ID。

source: This approach will give you an anonymous, secure user ID which will be persistent for the user across different devices (based on the primary Google account) and across installs. The basic approach is to generate a random user ID and to store this in the apps' shared preferences. You then use Google's backup agent to store the shared preferences linked to the Google account in the cloud.
es: Este enfoque le dará una identificación de usuario anónima y segura que será persistente para el usuario en diferentes dispositivos (basados en la cuenta principal de Google)y en diferentes instalaciones.El enfoque básico consiste en generar un ID de usuario aleatorio y almacenarlo en las preferencias compartidas de las aplicaciones.A continuación,utiliza el agente de copia de seguridad de Google para almacenar las preferencias compartidas vinculadas a la cuenta de Google en Internet.
ja: このアプローチでは、匿名で安全なユーザー ID が得られます。このユーザー ID は、異なるデバイス間(プライマリの Google アカウントに基づいて)やインストール間でユーザーのために永続的に保持されます。基本的なアプローチは、ランダムなユーザー ID を生成し、これをアプリの共有環境設定に保存することです。その後、Googleのバックアップエージェントを使用して、Googleアカウントにリンクされた共有環境設定をクラウドに保存します。
ko: 이 방법을 사용하면 익명의 안전한 사용자 ID가 제공되며, 이는 기본 Google 계정을 기반으로하는 여러 기기 및 설치에서 사용자에게 지속됩니다. 기본 접근 방식은 임의의 사용자 ID를 생성하고이를 앱의 공유 환경 설정에 저장하는 것입니다. 그런 다음 Google 백업 에이전트를 사용하여 Google 계정에 연결된 공유 환경 설정을 클라우드에 저장합니다.
ru: Этот подход даст вам анонимный,безопасный идентификатор пользователя,который будет постоянен для пользователя на различных устройствах (на основе основного аккаунта Google)и в различных инсталляциях.Основной подход заключается в генерировании случайного идентификатора пользователя и его сохранении в общих предпочтениях приложений.Затем вы используете агента резервного копирования Google для хранения общих настроек,связанных с аккаунтом Google,в "облаке".
zh_cn: 这种方法将给你一个匿名的、安全的用户ID,这个ID将在不同的设备上(基于主要的Google账户)和跨安装的用户持久化。基本方法是生成一个随机的用户ID,并将其存储在应用程序的共享首选项中。然后使用谷歌的备份代理将与谷歌账户关联的共享首选项存储在云端。

source: This could be the second best option, but you are still collecting and storing a unique identifier that comes directly from a user. This is obvious that you are collecting data.
es: Esta podría ser la segunda mejor opción,pero aún así está recogiendo y almacenando un identificador único que viene directamente de un usuario.Es obvio que estás recolectando datos.
ja: これは2番目に良い選択肢かもしれませんが、ユーザーから直接送られてくるユニークな識別子を収集して保存していることに変わりはありません。これは、データを収集していることは明らかです。
ko: 이것은 두 번째 가장 좋은 옵션 일 수 있지만 여전히 사용자가 직접 제공하는 고유 식별자를 수집하여 저장하고 있습니다. 데이터를 수집하고 있음이 분명합니다.
ru: Это может быть второй лучший вариант,но вы все еще собираете и храните уникальный идентификатор,который поступает непосредственно от пользователя.Это очевидно,что вы собираете данные.
zh_cn: 这可能是第二好的选择,但你仍然在收集和存储一个直接来自用户的唯一标识符。这显然是你在收集数据。

source: To complete the backup you need to create an instance of BackupManager in your main Activity:
es: Para completar la copia de seguridad necesitas crear una instancia de BackupManager en tu actividad principal:
ja: バックアップを完了するには、メインアクティビティにBackupManagerのインスタンスを作成する必要があります。
ko: 백업을 완료하려면 기본 활동에서 BackupManager 인스턴스를 작성해야합니다.
ru: Для завершения резервного копирования необходимо создать экземпляр BackupManager в основной деятельности:
zh_cn: 要完成备份,您需要在主活动中创建一个BackupManager实例。

source: To do this in Java one would just use a FileInputStream to open the iSerial file and read out the characters. Just be sure you wrap it in an exception handler, because not all devices have this file.
es: Para hacer esto en Java uno sólo usaría un FileInputStream para abrir el archivo iSerial y leer los caracteres.Sólo asegúrate de envolverlo en un manejador de excepciones,porque no todos los dispositivos tienen este archivo.
ja: Javaでこれを行うには、FileInputStreamを使用してiSerialファイルを開き、文字を読み出すだけです。すべてのデバイスがこのファイルを持っているわけではないので、例外ハンドラでラップするようにしてください。
ko: Java 에서이 작업을 수행하려면 FileInputStream을 사용하여 iSerial 파일을 열고 문자를 읽으십시오. 모든 장치에이 파일이있는 것은 아니기 때문에 예외 처리기로 래핑해야합니다.
ru: Для этого в Java достаточно использовать FileInputStream,чтобы открыть iSerial файл и прочитать символы.Просто убедитесь,что вы обернули его в обработчик исключений,потому что не все устройства имеют этот файл.
zh_cn: 要在Java中做到这一点,只需使用FileInputStream来打开iSerial文件并读出字符。只要确保你把它封装在一个异常处理程序中就可以了,因为不是所有的设备都有这个文件。

source: To understand the available Unique Ids in Android devices. Use this official guide.
es: Para entender los Identificadores Únicos disponibles en los dispositivos Android.Utilice esta guía oficial.
ja: Androidデバイスで利用可能なユニークIDを理解するために。この公式ガイドを使用してください。
ko: Android 기기에서 사용 가능한 고유 ID를 이해합니다. 이 공식 안내서를 사용하십시오.
ru: Чтобы понять доступные Уникальные Объявления в устройствах Android.Используйте это официальное руководство.
zh_cn: 要了解Android设备中可用的Unique Ids。请使用本官方指南。

source: To use <code>FirebaseInstanceId</code> add the <a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">latest firebase-messaging dependency</a> into your gradle
es: Para usar <code>FirebaseInstanceId</code> agregue la <a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">&uacute;ltima dependencia de mensajer&iacute;a</a> firebase en su gradle
ja: <code>FirebaseInstanceId</code> を使用するには、 <a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">最新のfirebase-messaging依存関係</a>をグラドルに追加します
ko: <code>FirebaseInstanceId</code> 를 사용하려면 <a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">최신</a> firebase -messaging 종속성 을 gradle에 추가하십시오
ru: Чтобы использовать <code>FirebaseInstanceId</code> , добавьте самую <a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">последнюю зависимость</a> Firebase -Messaging в ваш Gradle.
zh_cn: 要使用 <code>FirebaseInstanceId</code> ,请将<a href="https://firebase.google.com/support/release-notes/android#latest_sdk_versions">最新</a>的firebase -messaging依赖项添加到gradle中

source: Today it's not only a best practice, you actually must to do it by law according to <a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR - identifiers</a> and similar regulations.
es: Hoy en d&iacute;a no es solo una mejor pr&aacute;ctica, en realidad debe hacerlo por ley de acuerdo con <a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR: identificadores</a> y regulaciones similares.
ja: 今日では、これはベストプラクティスであるだけでなく、実際には<a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR（識別子</a>および類似の規制）に従って法律で行う必要があります。
ko: 오늘날 그것은 모범 사례 일뿐 만 아니라 실제로 <a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR</a> 에 따라 법에 따라해야 합니다-식별자 및 유사한 규정.
ru: Сегодня это не только лучшая практика, на самом деле вы должны делать это по закону в соответствии с <a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR - идентификаторами</a> и аналогичными правилами.
zh_cn: 今天，这不仅是一种最佳做法，实际上您还必须根据<a href="https://gdpr.eu/eu-gdpr-personal-data/">GDPR（标识符</a>和类似法规）依法进行。

source: Toshiba AT300
ja: 東芝AT300
ko: 도시바 AT300
zh_cn: 东芝AT300

source: Turns out that even though my Viewsonic G Tablet reports a DeviceID that is not Null, every single G Tablet reports the same number.
es: Resulta que aunque mi Tableta G de Viewsonic reporta un DeviceID que no es Null,todas las Tabletas G reportan el mismo número.
ja: 私のViewsonic G TabletがNullではないDeviceIDを報告しているにもかかわらず、すべてのGタブレットが同じ番号を報告していることが判明しました。
ko: Viewsonic G Tablet이 Null이 아닌 DeviceID를보고하더라도 모든 G Tablet은 모두 같은 숫자를보고합니다.
ru: Оказывается,что несмотря на то,что мой планшет Viewsonic G Tablet сообщает идентификатор устройства,который не является Null,каждый планшет G Tablet сообщает один и тот же номер.
zh_cn: 结果发现,即使我的Viewsonic G平板电脑报告的DeviceID不是Null,但每一个G平板电脑报告的数字都是一样的。

source: User could change email - HIGHLY unlikely
es: El usuario podría cambiar el correo electrónico-ALTAMENTE improbable
ja: ユーザーがメールを変更できる可能性は非常に低い
ko: 사용자가 이메일을 변경할 수 있음-거의 없을 것
ru: Пользователь может изменить электронную почту-В высшей степени маловероятно.
zh_cn: 用户可以更改电子邮件-极其不可能

source: Users can change their hardware, Android tablet or phone, so unique IDs based on hardware are not good ideas for <strong>TRACKING USERS</strong>
es: Los usuarios pueden cambiar su hardware, tableta o tel&eacute;fono Android, por lo que las ID &uacute;nicas basadas en hardware no son buenas ideas para <strong>SEGUIR A LOS USUARIOS</strong>
ja: ユーザーはハードウェア、Androidタブレット、または電話を変更できるため、ハードウェアに基づく一意のIDはユーザーを<strong>追跡する</strong>ための良いアイデアではありません
ko: 사용자는 하드웨어, Android 태블릿 또는 휴대 전화를 변경할 수 있으므로 하드웨어를 기반으로하는 고유 ID는 <strong>추적 사용자</strong> 에게 적합하지 않습니다.
ru: Пользователи могут менять свое оборудование, планшет Android или телефон, поэтому уникальные идентификаторы, основанные на оборудовании, не являются хорошими идеями для <strong>отслеживания пользователей</strong>
zh_cn: 用户可以更改其硬件，Android平板电脑或手机，因此基于硬件的唯一ID并不是<strong>跟踪用户的</strong>好主意

source: Users can wipe/change their ROM if they are rooted
es: Los usuarios pueden cambiar su ROM si están arraigados
ja: root化されている場合、ユーザーは自分のROMをwipechangeすることができます。
ko: 사용자가 루팅 된 경우 ROM을 지우거나 변경할 수 있습니다
ru: Пользователи могут стирать свое ПЗУ,если они укоренились.
zh_cn: 如果用户是root用户,可以擦除更换他们的ROM。

source: Users could change phone numbers - HIGHLY unlikely
es: Los usuarios podrían cambiar de número de teléfono-Altamente improbable
ja: ユーザーが電話番号を変更できる可能性は極めて低い
ko: 사용자가 전화 번호를 변경할 수 있음-거의 없을 것
ru: Пользователи могут менять телефонные номера-В высшей степени маловероятно.
zh_cn: 用户可以更改电话号码--可能性很小

source: Using the code below, you can get the unique device ID of an Android OS device as a string.
es: Usando el código de abajo,puedes obtener la identificación única de un dispositivo con sistema operativo Android como una cadena.
ja: 以下のコードを使用すると、Android OSデバイスのユニークなデバイスIDを文字列として取得することができます。
ko: 아래 코드를 사용하면 Android OS 기기의 고유 기기 ID를 문자열로 얻을 수 있습니다.
ru: Используя приведенный ниже код,вы можете получить уникальный идентификатор устройства Android OS в виде строки.
zh_cn: 使用下面的代码,你可以得到Android操作系统设备的唯一设备ID作为一个字符串。

source: Very possible, may contain collisions - See my method posted below!
es: Muy posible,puede contener colisiones-¡Vean mi método publicado abajo!
ja: 非常に可能性があり、衝突が含まれている可能性があります-以下に投稿された私の方法を参照してください!
ko: 매우 가능하며 충돌이있을 수 있습니다-아래에 게시 된 내 방법을 참조하십시오!
ru: Очень возможно,может содержать столкновения-Смотрите мой метод размещен ниже!
zh_cn: 很有可能,可能包含碰撞----请看我在下面贴出的方法!

source: Warning, users can reset:
es: Advertencia,los usuarios pueden reiniciar:
ja: 警告、ユーザーはリセットすることができます。
ko: 경고, 사용자는 다음을 재설정 할 수 있습니다.
ru: Предупреждение,пользователи могут перезагрузить:
zh_cn: 警告,用户可以重置。

source: With a pseudo-unique id, you really only run into the fact that there may be duplicates based on the fact that there are similar devices. You can tweak the combined method to make it more unique; however, some developers need to track device installs and this will do the trick or performance based on similar devices.
es: Con una identificación pseudo-única,realmente sólo te encuentras con el hecho de que puede haber duplicados basados en el hecho de que hay dispositivos similares.Puedes ajustar el método combinado para hacerlo más único;sin embargo,algunos desarrolladores necesitan rastrear las instalaciones de los dispositivos y esto hará el truco o el rendimiento basado en dispositivos similares.
ja: 擬似的に一意な ID を使用すると、似たようなデバイスがあるという事実に基づいて重複があるかもしれないという事実に直面するだけです。しかし、一部の開発者はデバイスのインストールを追跡する必要があり、これは類似したデバイスに基づいてトリックやパフォーマンスを行うことになります。
ko: 의사 고유 ID를 사용하면 유사한 장치가 있다는 사실에 따라 중복이있을 수 있다는 사실 만 알게됩니다. 결합 된 방법을 조정하여 더 고유하게 만들 수 있습니다. 그러나 일부 개발자는 장치 설치를 추적해야하며 유사한 장치를 기반으로 트릭이나 성능을 수행합니다.
ru: С помощью псевдо-уникального идентификатора вы действительно сталкиваетесь только с тем фактом,что могут быть дубликаты,основанные на том,что есть похожие устройства.Вы можете настроить комбинированный метод,чтобы сделать его более уникальным,однако,некоторые разработчики должны отслеживать установку устройств,и это сделает трюк или производительность на основе аналогичных устройств.
zh_cn: 使用伪唯一性ID,你真的只是遇到了基于相似设备可能存在重复的事实。你可以调整组合方法,使其更加独特;然而,有些开发者需要跟踪设备安装,这将基于相似设备的性能或基于相似设备的性能。

source: You can also see my blog post <em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">Leaking Android hardware serial number to unprivileged apps</a></em> where I discuss what other files are available for information.
es: Tambi&eacute;n puede ver mi publicaci&oacute;n de blog <em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">Filtrando el n&uacute;mero de serie del hardware de Android a aplicaciones no privilegiadas</a></em> donde analizo qu&eacute; otros archivos est&aacute;n disponibles para obtener informaci&oacute;n.
ja: また、私のブログの記事<em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">「Androidハードウェアのシリアル番号を権限のないアプリ</a></em>に<em>漏らす</em> 」を参照して、他に入手可能なファイルについて説明してください。
ko: 또한 내 블로그 게시물 <em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">권한이없는 앱에 Android 하드웨어 일련 번호 누출</a></em> 정보를 제공하는 다른 파일에 대해 논의 할 수 있습니다.
ru: Вы также можете увидеть мой пост в блоге &laquo; <em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">Утечка серийного номера оборудования Android&raquo; в непривилегированных приложениях,</a></em> где я обсуждаю, какие другие файлы доступны для информации.
zh_cn: 您也可以在我的博客文章中讨论<em><a href="http://insitusec.blogspot.com/2013/01/leaking-android-hardware-serial-number.html">将Android硬件序列号泄漏到非特权应用程序中</a></em> ，并在其中讨论哪些其他文件可供参考。

source: You can track users across platforms (iOS, Android, Windows, and Web)
es: Puedes rastrear a los usuarios a través de las plataformas (iOS,Android,Windows y Web)
ja: プラットフォーム(iOS、Android、Windows、Web)をまたいでユーザーを追跡することができます。
ko: 여러 플랫폼 (iOS, Android, Windows 및 웹)에서 사용자를 추적 할 수 있습니다.
ru: Вы можете отслеживать пользователей на разных платформах (iOS,Android,Windows и Web).
zh_cn: 您可以跨平台追踪用户(iOS、Android、Windows和Web)。

source: import libs
es: importación libs
ja: インポートリブ
ko: 라이브러리 가져 오기
ru: либвоиды импорта
zh_cn: 导入 libs

source: in AndroidManifest.xml
es: en AndroidManifest.xml
ja: AndroidManifest.xmlで
ko: AndroidManifest.xml에서
ru: в AndroidManifest.xml
zh_cn: 在AndroidManifest.xml中

source: might result in something like: <code>00000000-54b3-e7c7-0000-000046bffd97</code>
es: podr&iacute;a resultar en algo como: <code>00000000-54b3-e7c7-0000-000046bffd97</code>
ja: <code>00000000-54b3-e7c7-0000-000046bffd97</code> のような結果になる可能性があります
ko: <code>00000000-54b3-e7c7-0000-000046bffd97</code> 과 같은 결과가 발생할 수 있습니다.
ru: может привести к чему-то вроде: <code>00000000-54b3-e7c7-0000-000046bffd97</code>
zh_cn: 可能会导致类似以下内容的情况： <code>00000000-54b3-e7c7-0000-000046bffd97</code>

source: now in your code:
es: ahora en tu código:
ja: をコードに追加しました。
ko: 지금 당신의 코드에서 :
ru: теперь в вашем коде:
zh_cn: 现在在你的代码中。

source: you can do it that way:
es: puedes hacerlo de esa manera:
ja: あなたはそのようにすることができます。
ko: 당신은 그렇게 할 수 있습니다 :
ru: ты можешь сделать это так:
zh_cn: 你可以这样做。
