Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It identifies an installation rather then a device, but then again, ANDROID_ID (which is the accepted answer) now no longer identifies devices either. With the ARC runtime a new ANDROID_ID is generated for every installation (<a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android">details here</a>), just like this new instance ID. Also, I think that identifying installations (not devices) is what most of us are actually looking for.
es: Identifica una instalaci&oacute;n en lugar de un dispositivo, pero nuevamente, ANDROID_ID (que es la respuesta aceptada) ahora ya no identifica dispositivos. Con el tiempo de ejecuci&oacute;n ARC, se genera un nuevo ANDROID_ID para cada instalaci&oacute;n ( <a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android">detalles aqu&iacute;</a> ), al igual que este nuevo ID de instancia. Adem&aacute;s, creo que identificar instalaciones (no dispositivos) es lo que la mayor&iacute;a de nosotros estamos buscando.
ja: これは、デバイスではなくインストールを識別しますが、ANDROID_ID（これは受け入れられた回答です）もデバイスを識別しなくなりました。 ARCランタイムでは、この新しいインスタンスIDと同様に、インストールごとに新しいANDROID_IDが生成されます（ <a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android">詳細はこちら</a> ）。 また、（デバイスではなく）設備を特定することは、私たちの多くが実際に求めていることだと思います。
ko: 장치 대신 설치를 식별하지만 다시 ANDROID_ID (허용되는 답변)는 더 이상 장치를 식별하지 않습니다. ARC 런타임을 사용하면이 새 인스턴스 ID와 마찬가지로 모든 설치에 대해 새 ANDROID_ID가 생성됩니다 ( <a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android">자세한 내용은 여기 참조</a> ). 또한, 우리는 대부분의 사람들이 실제로 장치를 찾는 것이 설치를 식별하는 것이라고 생각합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он идентифицирует установку, а не устройство, но опять же, ANDROID_ID (который является принятым ответом) теперь больше не идентифицирует устройства. </font><font style="vertical-align: inherit;">Во время выполнения ARC для каждой установки создается новый ANDROID_ID ( </font></font><a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подробности здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), как и этот новый идентификатор экземпляра. </font><font style="vertical-align: inherit;">Кроме того, я думаю, что на самом деле большинство из нас ищут определение установок (а не устройств).</font></font>
zh_cn: 它标识的是安装而不是设备，但是，ANDROID_ID（这是公认的答案）现在也不再标识设备。 借助ARC运行时，将为每个安装生成一个新的ANDROID_ID（ <a href="https://stackoverflow.com/questions/29656101/how-does-android-id-on-arc-chrome-differ-from-android">此处有详细信息</a> ），就像此新实例ID一样。 另外，我认为识别安装（不是设备）是我们大多数人真正想要的。

source: It is intended that the advertising ID completely replace existing usage of other identifiers for ads purposes (such as the use of ANDROID_ID in Settings.Secure) when Google Play Services is available. Cases where Google Play Services is unavailable are indicated by a GooglePlayServicesNotAvailableException being thrown by getAdvertisingIdInfo().
es: El objetivo es que el ID de la publicidad sustituya completamente el uso existente de otros identificadores para fines publicitarios (como el uso de ANDROID_ID en Settings.Secure)cuando los servicios de Google Play estén disponibles.Los casos en los que los servicios de Google Play no están disponibles se indican mediante una excepción de GooglePlayServicesNotAvailableException que se lanza mediante getAdvertisingIdInfo().
ja: 広告IDは、Google Play Servicesが利用可能な場合には、広告目的で他の識別子を使用することを完全に置き換えることが意図されています (Settings.SecureでのANDROID_IDの使用など)。GooglePlayサービスが利用できない場合は、getAdvertisingIdInfo()によりGooglePlayServicesNotAvailableExceptionがスローされます。
ko: Google Play 서비스를 사용할 수있는 경우 광고 ID는 광고 목적으로 다른 식별자의 기존 사용법 (예 : Settings.Secure에서 ANDROID_ID 사용)을 완전히 대체합니다. Google Play 서비스를 사용할 수없는 경우 getAdvertisingIdInfo ()에 의해 발생한 GooglePlayServicesNotAvailableException이 표시됩니다.
ru: Предполагается,что рекламный идентификатор полностью заменит существующее использование других идентификаторов в рекламных целях (например,использование ANDROID_ID в Settings.Secure),когда будут доступны службы Google Play.Случаи,когда Службы Google Play недоступны,указываются GooglePlayServicesNotAvailableException,бросаемым функцией getAdvertisingIdInfo().
zh_cn: 当GooglePlay服务可用时,广告ID将完全取代现有的其他标识符用于广告目的(如在Settings.Secure中使用ANDROID_ID)。在GooglePlay服务不可用的情况下,通过getAdvertisingIdInfo()抛出一个GooglePlayServicesNotAvailableException来表示。

source: It seems that Google intends for this ID to be used to identify installations across Android, Chrome, and iOS.
es: Parece que Google pretende que esta identificación se utilice para identificar instalaciones en Android,Chrome e iOS.
ja: GoogleはこのIDをAndroid、Chrome、iOSにまたがってインストールされたものを識別するために使用する意図があるようです。
ko: Google은이 ID를 사용하여 Android, Chrome 및 iOS에서 설치를 식별하려고합니다.
ru: Похоже,что Google намеревается использовать этот ID для идентификации инсталляций на Android,Chrome и iOS.
zh_cn: 看来,谷歌打算用这个ID来识别横跨安卓、Chrome和iOS系统的安装,这似乎是谷歌的意图。

source: It seems the best way is for you to generate one yourself upon installation and subsequently read it when the application is re-launched.
es: Parece que la mejor manera es que usted mismo genere uno en el momento de la instalación y lo lea posteriormente cuando se vuelva a lanzar la aplicación.
ja: インストール時に自分で生成して、アプリケーションを再起動したときに読むのが一番良い方法のようです。
ko: 가장 좋은 방법은 설치시 직접 생성하여 응용 프로그램을 다시 시작할 때 읽는 것입니다.
ru: Лучше всего сгенерировать его самостоятельно при установке,а затем прочитать при повторном запуске приложения.
zh_cn: 最好的方法似乎是在安装时自己生成一个,随后在重新启动应用程序时读取。

source: It will return something like this: <strong>551F27C060712A72730B0A0F734064B1</strong>
es: <strong>Devolver&aacute;</strong> algo como esto: <strong>551F27C060712A72730B0A0F734064B1</strong>
ja: 次のようなものが返されます： <strong>551F27C060712A72730B0A0F734064B1</strong>
ko: 다음과 같이 반환됩니다 : <strong>551F27C060712A72730B0A0F734064B1</strong>
ru: Он вернет что-то вроде этого: <strong>551F27C060712A72730B0A0F734064B1</strong>
zh_cn: 它将返回如下内容： <strong>551F27C060712A72730B0A0F734064B1</strong>

source: It works well enough for me.
es: Funciona bastante bien para mí.
ja: 私には十分に機能しています。
ko: 그것은 나를 위해 충분히 잘 작동합니다.
ru: Для меня это достаточно хорошо работает.
zh_cn: 它对我来说已经足够好用了。

source: It's a simple question, with no simple answer.
es: Es una pregunta simple,sin una respuesta simple.
ja: 単純な質問で、単純な答えはありません。
ko: 간단한 대답이없는 간단한 질문입니다.
ru: Это простой вопрос,без простого ответа.
zh_cn: 这是一个简单的问题,没有简单的答案。

source: It's not only unreliable for device identification, but you also must follow the <a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">user privacy regarding ad tracking</a> policy, which states clearly that user can reset or block it at any moment.
es: No solo no es confiable para la identificaci&oacute;n del dispositivo, sino que tambi&eacute;n debe seguir la <a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">privacidad</a> del usuario con respecto a la pol&iacute;tica de seguimiento de anuncios , que establece claramente que el usuario puede restablecerla o bloquearla en cualquier momento.
ja: これはデバイスの識別に信頼できないだけでなく、ユーザーがいつでもリセットまたはブロックできることを明記している<a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">広告追跡</a>ポリシーに関するユーザーのプライバシーに従う必要があります 。
ko: 기기 식별에는 신뢰할 수 없을뿐만 아니라 <a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">광고 추적</a> 정책 과 관련된 사용자 개인 정보 보호 정책을 준수해야합니다.이 정책은 사용자가 언제든지 재설정하거나 차단할 수 있음을 명확하게 보여줍니다.
ru: Это не только ненадежно для идентификации устройства, но вы также должны соблюдать <a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">конфиденциальность пользователя в отношении</a> политики отслеживания рекламы , в которой четко указано, что пользователь может сбросить или заблокировать ее в любой момент.
zh_cn: 这不仅会导致设备识别不可靠，而且您还必须遵守<a href="https://play.google.com/about/monetization-ads/ads/#!?zippy_activeEl=ad-id#ad-id">用户隐私权有关的广告跟踪</a>政策，该政策明确规定用户可以随时重置或阻止它。

source: It's unique for the application installation on the device, so when the user uninstall the app - it's wiped out, so it's not 100% reliable, but it's the next best thing.
es: Es único para la instalación de la aplicación en el dispositivo,por lo que cuando el usuario desinstala la aplicación-se borra,por lo que no es 100% fiable,pero es la siguiente mejor cosa.
ja: 端末にインストールされているアプリに固有のものなので、ユーザーがアプリをアンインストールすると-全滅してしまうので、100%の信頼性はありませんが、次善の策です。
ko: 장치에 응용 프로그램을 설치하는 데 고유하므로 사용자가 응용 프로그램을 제거하면 응용 프로그램이 지워 지므로 100 % 신뢰할 수는 없지만 다음으로 가장 좋습니다.
ru: Оно уникально для установки приложения на устройство,поэтому когда пользователь деинсталлирует приложение-оно стирается,поэтому оно не на 100% надежно,но это самое лучшее.
zh_cn: 它对设备上的应用安装是唯一的,所以当用户卸载应用时--应用被抹掉了,所以不是100%可靠,但它是次要的。

source: Last Updated: 6/2/15
es: Última actualización:6215
ja: 最終更新日 6215
ko: 최종 업데이트 : 15. 6. 2.
ru: Последнее обновление:6215
zh_cn: 最近一次更新。6215

source: Let's go through the full approach. First, we need to create a backup for our SharedPreferences using the Android Backup Service. Start by registering your app via <code>http://developer.android.com/google/backup/signup.html</code>.
es: Veamos el enfoque completo. Primero, necesitamos crear una copia de seguridad para nuestras Preferencias Compartidas usando el Servicio de Copia de Seguridad de Android. Comience por registrar su aplicaci&oacute;n a trav&eacute;s de <code>http://developer.android.com/google/backup/signup.html</code> .
ja: 完全なアプローチを見てみましょう。 まず、Androidバックアップサービスを使用してSharedPreferencesのバックアップを作成する必要があります。 まず、 <code>http://developer.android.com/google/backup/signup.html</code> からアプリを登録します。
ko: 전체 접근 방식을 살펴 보겠습니다. 먼저 Android 백업 서비스를 사용하여 SharedPreferences에 대한 백업을 만들어야합니다. <code>http://developer.android.com/google/backup/signup.html</code> 을 통해 앱을 등록 하십시오 .
ru: Давайте пройдем через полный подход. Во-первых, нам нужно создать резервную копию наших SharedPreferences с помощью службы резервного копирования Android. Начните с регистрации вашего приложения через <code>http://developer.android.com/google/backup/signup.html</code> .
zh_cn: 让我们来看看完整的方法。 首先，我们需要使用Android备份服务为SharedPreferences创建备份。 首先通过 <code>http://developer.android.com/google/backup/signup.html</code> 注册您的应用。

source: List of options - reasons why/ why not to use them:
es: Lista de opciones-razones por las cuales no usarlas:
ja: オプションの一覧-なぜ使わないのかの理由
ko: 옵션 목록-이유 / 사용하지 않는 이유 :
ru: Список опций-причины,по которым их нельзя использовать:
zh_cn: 选项清单----为什么不使用这些选项的原因。

source: Main Issue: Hardware vs Software
es: Asunto principal:Hardware vs.Software
ja: 主な問題 ハードウェアとソフトウェア
ko: 주요 문제 : 하드웨어 및 소프트웨어
ru: Главная проблема:Оборудование против программного обеспечения
zh_cn: 主要问题。硬件与软件

source: Makes it interesting playing "Pocket Empires" which gives you instant access to someone's account based on the "unique" DeviceID.
es: Hace que sea interesante jugar a "Pocket Empires" que te da acceso instantáneo a la cuenta de alguien basado en el "único" DeviceID.
ja: ユニークなデバイスIDに基づいて誰かのアカウントにすぐにアクセスできる「ポケットエンパイア」をプレイするのが面白くなってきました。
ko: "고유 한"DeviceID를 기반으로 누군가의 계정에 즉시 액세스 할 수있는 "Pocket Empires"를 재생하는 것이 재미있어집니다.
ru: Интересна игра в "Карманные империи",которая дает мгновенный доступ к чьему-либо аккаунту на основе "уникального" DeviceID.
zh_cn: 使得玩 "口袋帝国 "很有意思,它可以根据 "唯一 "的DeviceID即时访问某人的账户。

source: Many other answers here are suggesting to use the <code>AdvertisingIdClient</code>, which is also incompatible, as its by design should be used only for ads profiling. It's also stated in the <a href="https://developer.android.com/training/articles/user-data-ids">official reference</a>
es: Muchas otras respuestas aqu&iacute; sugieren utilizar <code>AdvertisingIdClient</code> , que tambi&eacute;n es incompatible, ya que por dise&ntilde;o solo se debe usar para crear perfiles de anuncios. Tambi&eacute;n se indica en la <a href="https://developer.android.com/training/articles/user-data-ids">referencia oficial.</a>
ja: 他の多くの答えは、 <code>AdvertisingIdClient</code> を使用することを提案しています。これは互換性もありません。仕様上、広告プロファイリングにのみ使用する必要があるためです。 <a href="https://developer.android.com/training/articles/user-data-ids">公式リファレンスに</a>も記載されています
ko: 다른 많은 답변은 <code>AdvertisingIdClient</code> 사용을 제안하고 있습니다. AdvertisingIdClient 는 의도적으로 설계되어 광고 프로파일 링에만 사용해야하므로 호환되지 않습니다. <a href="https://developer.android.com/training/articles/user-data-ids">공식 참조</a> 에도 언급되어 있습니다.
ru: Многие другие ответы здесь предлагают использовать <code>AdvertisingIdClient</code> , который также несовместим, так как его дизайн должен использоваться только для профилирования рекламы. Это также указано в <a href="https://developer.android.com/training/articles/user-data-ids">официальной ссылке</a>
zh_cn: 这里的许多其他答案都建议使用 <code>AdvertisingIdClient</code> ，这也是不兼容的，因为它的设计目的仅应用于广告概要分析。 <a href="https://developer.android.com/training/articles/user-data-ids">官方参考资料中</a>也有说明

source: Mini MK802
ja: ミニMK802
ko: 미니 MK802
ru: Мини МК802
zh_cn: 迷你MK802

source: More over, all of the existing answers here are whether out of date or unreliable.
es: Además,todas las respuestas existentes aquí están desactualizadas o no son fiables.
ja: もっと言えば、ここにある既存の回答はすべて、時代遅れか信頼できないものばかりです。
ko: 또한 기존의 모든 답변은 오래되었거나 신뢰할 수 없습니다.
ru: Более того,все существующие ответы здесь являются либо устаревшими,либо ненадежными.
zh_cn: 更多的是,这里现有的答案都是过期或不可靠。

source: More specifically, <code>Settings.Secure.ANDROID_ID</code>. This is a 64-bit quantity that is generated and stored when the device first boots. It is reset when the device is wiped.
es: M&aacute;s espec&iacute;ficamente, <code>Settings.Secure.ANDROID_ID</code> . Esta es una cantidad de 64 bits que se genera y almacena cuando el dispositivo se inicia por primera vez. Se restablece cuando se limpia el dispositivo.
ja: 具体的には、 <code>Settings.Secure.ANDROID_ID</code> です。 これは、デバイスが最初に起動したときに生成および保存される64ビットの量です。 デバイスがワイプされるとリセットされます。
ko: 더 구체적으로, <code>Settings.Secure.ANDROID_ID</code> 입니다. 이것은 장치가 처음 부팅 될 때 생성 및 저장되는 64 비트 수량입니다. 장치를 닦으면 재설정됩니다.
ru: Более конкретно, <code>Settings.Secure.ANDROID_ID</code> . Это 64-разрядная величина, которая генерируется и сохраняется при первой загрузке устройства. Сбрасывается при стирании устройства.
zh_cn: 更具体地说，是 <code>Settings.Secure.ANDROID_ID</code> 。 这是设备首次启动时生成并存储的64位数量。 擦拭设备时将其重置。

source: Most applications on the market do not use Bluetooth, and so if your application doesn't use Bluetooth and you are including this, the user could become suspicious.
es: La mayoría de las aplicaciones del mercado no usan Bluetooth,por lo que si tu aplicación no usa Bluetooth y la incluyes,el usuario podría sospechar.
ja: 市販されているアプリのほとんどはBluetoothを使用していないので、Bluetoothを使用していないアプリでこれを入れているとユーザーが怪しまれる可能性があります。
ko: 시장에 나와있는 대부분의 응용 프로그램은 Bluetooth를 사용하지 않으므로 응용 프로그램에서 Bluetooth를 사용하지 않고이를 포함하면 사용자가 의심 될 수 있습니다.
ru: Большинство приложений на рынке не используют Bluetooth,и поэтому,если ваше приложение не использует Bluetooth,и вы включили его,пользователь может заподозрить.
zh_cn: 市场上大多数应用都不使用蓝牙,所以如果你的应用没有使用蓝牙,而你的应用包括了这一点,用户可能会变得可疑。

source: Most of the Build members are strings, what we're doing here is to take their length and transform it via modulo in a digit. We have 13 such digits and we are adding two more in front (35) to have the same size ID as the IMEI (15 digits). There are other possibilities here are well, just have a look at these strings. Returns something like <code>355715565309247</code>. No special permission is required, making this approach very convenient.
es: La mayor&iacute;a de los miembros de Build son cadenas, lo que estamos haciendo aqu&iacute; es tomar su longitud y transformarla a trav&eacute;s de un m&oacute;dulo en un d&iacute;gito. Tenemos 13 de estos d&iacute;gitos y estamos agregando dos m&aacute;s al frente (35) para tener el mismo ID de tama&ntilde;o que el IMEI (15 d&iacute;gitos). Hay otras posibilidades aqu&iacute; que est&aacute;n bien, solo eche un vistazo a estas cadenas. Devuelve algo como <code>355715565309247</code> . No se requiere un permiso especial, lo que hace que este enfoque sea muy conveniente.
ja: Buildメンバーのほとんどは文字列です。ここで行うのは、その長さを受け取り、モジュロを介して数字に変換することです。 このような数字は13桁あり、IMEIと同じサイズのID（15桁）になるように前に2つ（35）追加します。 ここには他にも可能性があります。これらの文字列を見てください。 <code>355715565309247</code> のようなものを返します。 特別な許可は必要ないため、このアプローチは非常に便利です。
ko: 대부분의 Build 멤버는 문자열이며 여기서 수행하는 것은 길이를 가져 와서 모듈로를 통해 숫자로 변환하는 것입니다. 우리는 13 자리 숫자를 가지고 있으며 IMEI (15 자리)와 동일한 크기의 ID를 갖기 위해 앞에 두 개를 더 추가합니다 (35). 여기에 다른 가능성이 있습니다.이 문자열을 살펴보십시오. <code>355715565309247</code> 과 같은 것을 반환합니다. 특별한 접근이 필요하지 않으므로이 접근 방식이 매우 편리합니다.
ru: Большинство членов Build являются строками, мы здесь берем их длину и преобразуем их по модулю в цифру. У нас есть 13 таких цифр, и мы добавляем еще две впереди (35), чтобы иметь тот же идентификатор размера, что и IMEI (15 цифр). Есть и другие возможности, хорошо, просто взгляните на эти строки. Возвращает что-то вроде <code>355715565309247</code> . Специального разрешения не требуется, что делает этот подход очень удобным.
zh_cn: 大多数Build成员都是字符串，我们在这里要做的是获取它们的长度并通过对数字进行模运算来对其进行转换。 我们有13个这样的数字，并且在前面增加了两个数字（35），以具有与IMEI相同的大小ID（15个数字）。 这里还有其他可能性，只看这些字符串即可。 返回类似 <code>355715565309247</code> 的内容 。 不需要特殊许可，这使此方法非常方便。

source: Most users hate the fact that it says "Phone Calls" in the permission. Some users give bad ratings, because they believe you are simply stealing their personal information when all you really want to do is track device installs. It is obvious that you are collecting data.
es: La mayoría de los usuarios odian el hecho de que diga "Llamadas telefónicas" en el permiso.Algunos usuarios dan malas calificaciones,porque creen que simplemente estás robando su información personal cuando todo lo que realmente quieres hacer es rastrear las instalaciones del dispositivo.Es obvio que estás recolectando datos.
ja: ほとんどのユーザーは、パーミッションに「電話」と書かれていることを嫌っています。一部のユーザーは、あなたが本当にしたいのはデバイスのインストールを追跡することだけなのに、あなたは単に個人情報を盗んでいるだけだと信じているので、悪い評価をしています。データを収集しているのは明らかです。
ko: 대부분의 사용자는 권한에서 "전화 통화"라는 사실을 싫어합니다. 기기를 추적하는 것만으로도 개인 정보를 훔치기 만한다고 믿기 때문에 일부 사용자의 평가는 좋지 않습니다. 데이터를 수집하고 있음이 분명합니다.
ru: Большинство пользователей ненавидят тот факт,что в разрешении написано "Телефонные звонки".Некоторые пользователи дают плохие оценки,потому что они считают,что вы просто крадете их личную информацию,когда все,что вы действительно хотите сделать,это отслеживать устройство установки.Очевидно,что вы собираете данные.
zh_cn: 大多数用户讨厌它在权限中写着 "电话通话 "这一事实。一些用户给出了差评,因为他们认为你只是在窃取他们的个人信息,而你真正想做的是跟踪设备安装情况。很明显,你是在收集数据。

source: Motorola Xoom 3G
ja: モトローラXoom 3G
ko: 모토로라 Xoom 3G
zh_cn: 摩托罗拉Xoom 3G

source: My device does not have a cell radio.
es: Mi dispositivo no tiene una radio celular.
ja: 私の端末にはセルラジオがありません。
ko: 내 장치에는 셀 라디오가 없습니다.
ru: В моем устройстве нет мобильного радио.
zh_cn: 我的设备没有手机收音机。

source: My two cents - NB this is for a <em>device (err) unique ID</em> - not the installation one as discussed in the <a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">Android developers's blog</a>.
es: Mis dos centavos, NB, esto es para un <em>dispositivo (err) ID &uacute;nico</em> , no para la instalaci&oacute;n como se discuti&oacute; en el <a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">blog de desarrolladores de Android</a> .
ja: 私の2セント-これは<em>デバイス（err）の一意のID</em> <a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">用</a>であり、 Android開発者のブログで説明されているインストール用ではありません。
ko: 내 두 센트-NB 이것은 <em>장치 (err) 고유 ID를위한 것입니다</em> - <a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">안드로이드 개발자 블로그</a> 에서 논의 된 것처럼 설치 <em>ID가</em> 아닙니다.
ru: Мои два цента - NB это для <em>уникального идентификатора устройства (err)</em> - не установочный, как обсуждалось в <a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">блоге разработчиков Android</a> .
zh_cn: 我的两分钱-注意，这是针对<em>设备（err）的唯一ID-</em>而不是<a href="http://android-developers.blogspot.gr/2011/03/identifying-app-installations.html">Android开发者博客中</a>讨论的安装<em>ID</em> 。

source: New (for apps with ads AND Google Play Services):
es: Nuevo (para aplicaciones con anuncios Y servicios de Google Play):
ja: 新規(広告付きアプリとGoogle Play Servicesのアプリが対象)。
ko: 새로운 기능 (광고 및 Google Play 서비스가있는 앱) :
ru: Новое (для приложений с рекламой и служб Google Play):
zh_cn: 新的(适用于有广告和Google Play服务的应用)。

source: Nexus S
es: Nexo S
ja: ネクサスS
ko: 넥서스 S
ru: Нексус S

source: Note that for devices that have to fallback on the device ID, the unique ID <strong>WILL</strong> persist across factory resets. This is something to be aware of. If you need to ensure that a factory reset will reset your unique ID, you may want to consider falling back directly to the random UUID instead of the device ID.
es: Tenga en cuenta que para los dispositivos que tienen que recurrir a la ID del dispositivo, la ID &uacute;nica persistir&aacute; en todos los restablecimientos de f&aacute;brica. Esto es algo a tener en cuenta. Si necesita asegurarse de que un restablecimiento de f&aacute;brica restablecer&aacute; su ID &uacute;nica, puede considerar recurrir directamente al UUID aleatorio en lugar de la ID del dispositivo.
ja: デバイスIDにフォールバックする必要があるデバイスの場合、一意のIDは出荷時の設定にリセットされます。 これは知っておくべきことです。 出荷時設定にリセットして一意のIDを確実にリセットする必要がある場合は、デバイスIDではなくランダムなUUIDに直接フォールバックすることを検討してください。
ko: 장치 ID를 대체해야하는 장치의 경우 고유 한 ID는 공장 초기화시에도 유지됩니다. 이것은 알아야 할 사항입니다. 출고시 재설정으로 고유 ID를 재설정해야하는 경우 장치 ID 대신 임의의 UUID로 직접 폴백하는 것이 좋습니다.
ru: Обратите внимание, что для устройств, которые вынуждены использовать идентификатор устройства, уникальный идентификатор <strong>будет</strong> сохраняться при сбросе до заводских настроек. Это то, что нужно знать. Если вам необходимо убедиться, что сброс настроек к заводским установкам приведет к сбросу вашего уникального идентификатора, вы можете рассмотреть возможность возврата непосредственно к случайному UUID вместо идентификатора устройства.
zh_cn: 请注意，对于必须回退到设备ID的设备，唯一ID <strong>将</strong>在出厂重置后保持不变。 这是要注意的事情。 如果您需要确保恢复出厂设置会重置您的唯一ID，则可以考虑直接使用随机UUID代替设备ID。

source: Note: You can always add more IDs to the <code>longId</code> string. For example, Serial #. wifi adapter address. IMEI. This way you are making it more unique per device.
es: Nota: Siempre puede agregar m&aacute;s ID a la cadena <code>longId</code> . Por ejemplo, n&uacute;mero de serie. Direcci&oacute;n del adaptador wifi. IMEI De esta manera, lo har&aacute; m&aacute;s exclusivo por dispositivo.
ja: 注：いつでも <code>longId</code> 文字列にさらにIDを追加できます。 たとえば、シリアル番号。 wifiアダプターのアドレス。 IMEI。 このようにして、デバイスごとに固有のものにします。
ko: 참고 : <code>longId</code> 문자열에 언제든지 더 많은 ID를 추가 할 수 있습니다. 예를 들어, 일련 번호입니다. 와이파이 어댑터 주소. IMEI. 이렇게하면 장치마다 더 독창적입니다.
ru: Примечание. Вы всегда можете добавить дополнительные идентификаторы в строку <code>longId</code> . Например, Серийный №. адрес адаптера Wi-Fi. IMEI. Таким образом, вы делаете его более уникальным для каждого устройства.
zh_cn: 注意：您始终可以向 <code>longId</code> 字符串添加更多ID。 例如，序列号。 wifi适配器地址。 IMEI。 这样，您就可以使每个设备变得更加独特。
