Repository: rueisnom/feedback
Catalog: xlf/27/85/48/5/2785485.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Extra info: The technique given above was copied from an article on <a href="http://www.pocketmagic.net/?p=1662">Pocket Magic</a>.)
es: (Informaci&oacute;n adicional: la t&eacute;cnica proporcionada anteriormente se copi&oacute; de un art&iacute;culo sobre <a href="http://www.pocketmagic.net/?p=1662">Pocket Magic</a> ).
ja: （補足：上記のテクニックは<a href="http://www.pocketmagic.net/?p=1662">Pocket Magicの</a>記事からコピーされました。）
ko: (추가 정보 : 위에 제공된 기술은 <a href="http://www.pocketmagic.net/?p=1662">Pocket Magic</a> 의 기사에서 복사 한 것입니다.)
ru: (Дополнительная информация: техника, приведенная выше, была скопирована из статьи о <a href="http://www.pocketmagic.net/?p=1662">Pocket Magic</a> .)
zh_cn: （额外信息：以上给出的技术是从<a href="http://www.pocketmagic.net/?p=1662">Pocket Magic</a>上的一篇文章中复制的。）

source: - Guarantee uniqueness (include rooted devices) for API &gt;= 9/10 (99.5% of Android devices)
es: - Garantizar la unicidad (incluir dispositivos rooteados) para API&gt; = 9/10 (99.5% de dispositivos Android)
ja: -9/10以上のAPI（Androidデバイスの99.5％）の一意性を保証（根ざしたデバイスを含む）
ko: -API&gt; = 9/10 (Android 기기의 99.5 %)에 대한 고유성 보장 (루팅 된 기기 포함)
ru: - Гарантия уникальности (включая рутированные устройства) для API&gt; = 9/10 (99,5% устройств Android)
zh_cn: -保证API&gt; = 9/10的唯一性（包括根设备）（占Android设备的99.5％）

source: - No extra permissions
es: -No hay permisos extra
ja: -追加のパーミッションはありません。
ko: -추가 권한이 없습니다
ru: -Без дополнительных разрешений
zh_cn: -无额外权限

source: 3 IDs are:
es: 3 identificaciones son:
ja: 3つのIDがあります。
ko: 3 개의 ID는 다음과 같습니다.
ru: 3 удостоверения личности:
zh_cn: 3个身份证是:

source: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"><code>Settings.Secure#ANDROID_ID</code></a> returns the Android ID as an <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">unique for each user</a></em> 64-bit hex string.
es: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"> <code>Settings.Secure#ANDROID_ID</code> </a> devuelve la ID de Android como <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">&uacute;nica para cada</a></em> cadena hexadecimal de 64 bits de <em>usuario</em> .
ja: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"> <code>Settings.Secure#ANDROID_ID</code> </a>は、 <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">ユーザーごとに</a></em> 64ビットの16進数文字列として<em>一意の</em> Android IDを返します。
ko: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"> <code>Settings.Secure#ANDROID_ID</code> </a> 는 <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">각 사용자</a></em> 64 비트 16 진 문자열 <em>에 대해 고유 한</em> Android ID를 반환합니다.
ru: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"> <code>Settings.Secure#ANDROID_ID</code> </a> возвращает идентификатор Android как <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">уникальную для каждого пользователя</a></em> 64-битную шестнадцатеричную строку.
zh_cn: <a href="http://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID"> <code>Settings.Secure#ANDROID_ID</code> </a> <em><a href="https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID">以每个用户</a></em> 64位十六进制字符串的<em>唯一</em>身份返回Android ID。

source: <code>ANDROID_ID</code> seems a good choice for a unique device identifier. There are downsides: First, it is not 100% reliable on releases of Android prior to 2.2 <code>(&ldquo;Froyo&rdquo;).</code> Also, there has been at least one widely-observed bug in a popular handset from a major manufacturer, where every instance has the same ANDROID_ID.
es: <code>ANDROID_ID</code> parece una buena opci&oacute;n para un identificador de dispositivo &uacute;nico. Hay inconvenientes: en primer lugar, no es 100% confiable en las versiones de Android anteriores a 2.2 <code>(&ldquo;Froyo&rdquo;).</code> Adem&aacute;s, ha habido al menos un error ampliamente observado en un tel&eacute;fono popular de un fabricante importante, donde cada instancia tiene el mismo ANDROID_ID.
ja: <code>ANDROID_ID</code> は、一意のデバイス識別子に適しています。 欠点があります。まず、Android 2.2より前のリリース <code>(&ldquo;Froyo&rdquo;).</code> では100％信頼できません。 また、大手メーカーの人気のある携帯電話には、すべてのインスタンスが同じANDROID_IDを持っている、少なくとも1つの広く観察されているバグがありました。
ko: <code>ANDROID_ID</code> 는 고유 한 기기 식별자에 적합합니다. 단점 : 첫째, 2.2 이전 버전의 Android <code>(&ldquo;Froyo&rdquo;).</code> 에서는 100 % 신뢰할 수 없습니다 . 또한 모든 제조업체의 ANDROID_ID가 동일한 주요 제조업체의 인기있는 핸드셋에서 하나 이상의 광범위하게 발견 된 버그가있었습니다.
ru: <code>ANDROID_ID</code> кажется хорошим выбором для уникального идентификатора устройства. Есть недостатки: во-первых, это не на 100% надежно в выпусках Android до 2.2 <code>(&ldquo;Froyo&rdquo;).</code> Кроме того, в популярном телефоне от одного производителя была обнаружена, по крайней мере, одна широко распространенная ошибка, в которой каждый экземпляр имеет одинаковый ANDROID_ID.
zh_cn: 对于唯一的设备标识符， <code>ANDROID_ID</code> 似乎是一个不错的选择。 有缺点：首先，在2.2之前的Android版本 <code>(&ldquo;Froyo&rdquo;).</code> 上，它不是100％可靠的。 而且，在一家主要制造商的流行手机中，至少有一个广为人知的错误，其中每个实例都具有相同的ANDROID_ID。

source: <strong>ANDROID_ID</strong> - <code>Settings.Secure.ANDROID_ID</code>
ko: <strong>ANDROID_ID-</strong> <code>Settings.Secure.ANDROID_ID</code> <strong>.ANDROID_ID</strong>

source: <strong>Android ID - Hardware</strong> (can be null, can change upon factory reset, can be altered on a rooted device)
es: <strong>ID de Android: hardware</strong> (puede ser nulo, puede cambiar con el restablecimiento de f&aacute;brica, puede modificarse en un dispositivo rooteado)
ja: <strong>Android ID-ハードウェア</strong> （nullの可能性、出荷時設定へのリセット時に変更可能、ルート化されたデバイスで変更可能）
ko: <strong>Android ID-하드웨어</strong> (null 일 수 있음, 초기화시 변경 가능, 루팅 된 기기에서 변경 가능)
ru: <strong>Идентификатор Android - Аппаратное обеспечение</strong> (может быть нулевым, может изменяться после сброса к заводским настройкам, может быть изменено на корневом устройстве)
zh_cn: <strong>Android ID-硬件</strong> （可以为空，可以在恢复出厂设置时更改，可以在有根设备上更改）

source: <strong>Android ID</strong> (can be null, can change upon factory reset, can be altered on rooted phone)
es: <strong>ID de Android</strong> (puede ser nulo, puede cambiar con el restablecimiento de f&aacute;brica, puede modificarse en el tel&eacute;fono rooteado)
ja: <strong>Android ID</strong> （nullの可能性、出荷時設定へのリセット時に変更可能、根ざした電話で変更可能）
ko: <strong>Android ID</strong> (null 일 수 있음, 초기화시 변경 가능, 루팅 된 전화에서 변경 가능)
ru: <strong>Идентификатор Android</strong> (может быть нулевым, может быть изменен при сбросе настроек, может быть изменен на рутированном телефоне)
zh_cn: <strong>Android ID</strong> （可以为空，可以在恢复出厂设置时更改，可以在有根电话上更改）

source: <strong>Avoid using hardware identifiers</strong>, such as SSAID (Android ID), IMEI, MAC address, etc...
es: <strong>Evite usar identificadores de hardware</strong> , como SSAID (ID de Android), IMEI, direcci&oacute;n MAC, etc.
ja: SSAID（Android ID）、IMEI、MACアドレスなどの<strong>ハードウェア識別子の使用は避けてください</strong> ...
ko: SSAID (Android ID), IMEI, MAC 주소 등과 같은 <strong>하드웨어 식별자를 사용하지 마십시오</strong> .
ru: <strong>Избегайте использования аппаратных идентификаторов</strong> , таких как SSAID (идентификатор Android), IMEI, MAC-адрес и т. Д.
zh_cn: <strong>避免使用硬件标识符</strong> ，例如SSAID（Android ID），IMEI，MAC地址等。

source: <strong>BT MAC Address</strong> string (devices with Bluetooth, needs <code>android.permission.BLUETOOTH</code>)
es: Cadena de <strong>direcci&oacute;n MAC BT</strong> (dispositivos con Bluetooth, necesita <code>android.permission.BLUETOOTH</code> )
ja: <strong>BT MACアドレス</strong>文字列（Bluetooth搭載デバイス、 <code>android.permission.BLUETOOTH</code> が必要）
ko: <strong>BT MAC 주소</strong> 문자열 (블루투스가있는 기기, <code>android.permission.BLUETOOTH</code> 필요)
ru: Строка <strong>MAC-адреса BT</strong> (устройства с Bluetooth, требуется <code>android.permission.BLUETOOTH</code> )
zh_cn: <strong>BT MAC地址</strong>字符串（具有蓝牙的设备，需要 <code>android.permission.BLUETOOTH</code> ）

source: <strong>Best practices for unique identifiers:</strong>
es: <strong>Mejores pr&aacute;cticas para identificadores &uacute;nicos:</strong>
ja: <strong>一意の識別子のベストプラクティス：</strong>
ko: <strong>고유 식별자에 대한 모범 사례 :</strong>
ru: <strong>Лучшие практики для уникальных идентификаторов:</strong>
zh_cn: <strong>唯一标识符的最佳做法：</strong>

source: <strong>Bluetooth Address</strong> - Bluetooth adapter address
es: <strong>Direcci&oacute;n</strong> Bluetooth: direcci&oacute;n del adaptador Bluetooth
ja: <strong>Bluetoothアドレス</strong> -Bluetoothアダプターアドレス
ko: <strong>블루투스 주소</strong> -블루투스 어댑터 주소
ru: <strong>Адрес Bluetooth</strong> - адрес адаптера Bluetooth
zh_cn: <strong>蓝牙地址</strong> -蓝牙适配器地址

source: <strong>Bluetooth MAC Address - Hardware</strong> (devices with Bluetooth, needs <strong><code>android.permission.BLUETOOTH</code></strong>)
es: <strong>Direcci&oacute;n MAC de Bluetooth: hardware</strong> (dispositivos con Bluetooth, necesita <strong> <code>android.permission.BLUETOOTH</code> </strong> )
ja: <strong>Bluetooth MACアドレス-ハードウェア</strong> （Bluetoothを搭載したデバイス、 <strong> <code>android.permission.BLUETOOTH</code> </strong>が必要）
ko: <strong>블루투스 MAC 주소-하드웨어</strong> (블루투스가있는 기기, <strong> <code>android.permission.BLUETOOTH</code> </strong> 필요)
ru: <strong>Bluetooth MAC Address - Hardware</strong> (устройства с Bluetooth, требуется <strong> <code>android.permission.BLUETOOTH</code> </strong> )
zh_cn: <strong>蓝牙MAC地址-硬件</strong> （带有蓝牙的设备，需要<strong> <code>android.permission.BLUETOOTH</code> </strong> ）

source: <strong>From the Google Play Developer's console:</strong>
es: <strong>Desde la consola del desarrollador de Google Play:</strong>
ja: <strong>Google Playデベロッパーコンソールから：</strong>
ko: <strong>Google Play 개발자 콘솔에서 :</strong>
ru: <strong>Из консоли разработчика Google Play:</strong>
zh_cn: <strong>在Google Play开发者控制台中：</strong>

source: <strong>Google Instance ID</strong>
es: <strong>ID de instancia de Google</strong>
ja: <strong>GoogleインスタンスID</strong>
ko: <strong>Google 인스턴스 ID</strong>
ru: <strong>Идентификатор Google Instance</strong>
zh_cn: <strong>Google实例ID</strong>

source: <strong>IMEI - Hardware</strong> (only phones, needs <strong><code>android.permission.READ_PHONE_STATE</code></strong>)
es: <strong>IMEI - Hardware</strong> (solo tel&eacute;fonos, necesita <strong> <code>android.permission.READ_PHONE_STATE</code> </strong> )
ja: <strong>IMEI-ハードウェア</strong> （電話のみ、 <strong> <code>android.permission.READ_PHONE_STATE</code> </strong>が必要）
ko: <strong>IMEI-하드웨어</strong> (휴대 전화 만, <strong> <code>android.permission.READ_PHONE_STATE</code> </strong> 필요)
ru: <strong>IMEI - Аппаратное обеспечение</strong> (только телефоны, требуется <strong> <code>android.permission.READ_PHONE_STATE</code> </strong> )
zh_cn: <strong>IMEI-硬件</strong> （仅手机，需要<strong> <code>android.permission.READ_PHONE_STATE</code> </strong> ）

source: <strong>IMEI</strong> (only for Android devices with Phone use; needs <code>android.permission.READ_PHONE_STATE</code>)
es: <strong>IMEI</strong> (solo para dispositivos Android con uso del tel&eacute;fono; necesita <code>android.permission.READ_PHONE_STATE</code> )
ja: <strong>IMEI</strong> （電話を使用するAndroidデバイスのみ <code>android.permission.READ_PHONE_STATE</code> が必要です）
ko: <strong>IMEI</strong> (전화를 사용하는 Android 기기에만 해당, <code>android.permission.READ_PHONE_STATE</code> 필요)
ru: <strong>IMEI</strong> (только для устройств Android с телефоном; требуется <code>android.permission.READ_PHONE_STATE</code> )
zh_cn: <strong>IMEI</strong> （仅适用于使用Phone的Android设备；需要 <code>android.permission.READ_PHONE_STATE</code> ）

source: <strong>NOTE:</strong> From Android 6.x, it returns consistent fake mac address: <code>02:00:00:00:00:00</code>
es: <strong>NOTA:</strong> Desde Android 6.x, devuelve una direcci&oacute;n mac falsa consistente: <code>02:00:00:00:00:00</code>
ja: <strong>注：</strong> Android 6.x以降、一貫した偽のMACアドレスを返します： <code>02:00:00:00:00:00</code>
ko: <strong>참고 :</strong> Android 6.x에서 일관된 가짜 맥 주소를 반환합니다 : <code>02:00:00:00:00:00</code>
ru: <strong>ПРИМЕЧАНИЕ.</strong> В Android 6.x возвращается поддельный mac-адрес: <code>02:00:00:00:00:00</code> .
zh_cn: <strong>注意：</strong>从Android 6.x，它将返回一致的假MAC地址： <code>02:00:00:00:00:00</code>

source: <strong>Only use an Advertising ID for user profiling or ads use cases</strong>
es: <strong>Utilice solo una ID de publicidad para la creaci&oacute;n de perfiles de usuario o casos de uso de anuncios</strong>
ja: <strong>ユーザーIDのプロファイリングまたは広告のユースケースにのみ広告IDを使用する</strong>
ko: <strong>사용자 프로파일 링 또는 광고 사용 사례에만 광고 ID를 사용하십시오.</strong>
ru: <strong>Используйте рекламный идентификатор только для профилирования пользователей или для случаев использования рекламы.</strong>
zh_cn: <strong>仅将广告ID用于用户配置文件或广告用例</strong>

source: <strong>Pseudo-ID</strong> - It is generated based on physical device specifications
es: <strong>Pseudo-ID</strong> : se genera en funci&oacute;n de las especificaciones del dispositivo f&iacute;sico
ja: <strong>疑似ID-</strong>物理デバイスの仕様に基づいて生成されます
ko: <strong>의사 ID-</strong> 실제 장치 사양을 기반으로 생성됩니다.
ru: <strong>Псевдо-ID</strong> - генерируется на основе спецификаций физического устройства.
zh_cn: <strong>伪ID-</strong>根据物理设备规范生成

source: <strong>Pseudo-Unique ID - Software</strong> (for all Android devices)
es: <strong>ID pseudounica: software</strong> (para todos los dispositivos Android)
ja: <strong>疑似固有ID-ソフトウェア</strong> （すべてのAndroidデバイス用）
ko: <strong>의사 고유 ID-소프트웨어</strong> (모든 Android 장치 용)
ru: <strong>Pseudo-Unique ID - Программное обеспечение</strong> (для всех устройств Android)
zh_cn: <strong>伪唯一ID-软件</strong> （适用于所有Android设备）

source: <strong>Pseudo-Unique ID</strong> (for all Android devices)
es: <strong>ID pseudo-&uacute;nico</strong> (para todos los dispositivos Android)
ja: <strong>疑似固有ID</strong> （すべてのAndroidデバイス用）
ko: <strong>의사 고유 ID</strong> (모든 Android 장치 용)
ru: <strong>Псевдо-уникальный идентификатор</strong> (для всех устройств Android)
zh_cn: <strong>伪唯一ID</strong> （适用于所有Android设备）

source: <strong>REMEMBER</strong>, you are technically only missing out on around 0.5% of users <a href="http://developer.android.com/about/dashboards/index.html">who have API &lt; 9</a>. So you can focus on the rest: This is 99.5% of the users!
es: <strong>RECUERDE</strong> , t&eacute;cnicamente solo se est&aacute; perdiendo alrededor del 0.5% de los usuarios <a href="http://developer.android.com/about/dashboards/index.html">que tienen API &lt;9</a> . Para que pueda concentrarse en el resto: &iexcl;esto es el 99.5% de los usuarios!
ja: <strong>覚えて</strong>おいてください。あなたは技術的に<a href="http://developer.android.com/about/dashboards/index.html">APIが9</a>未満のユーザーの約0.5％だけを見逃しています 。 残りの部分に集中できます。これはユーザーの99.5％です。
ko: <strong>기억하십시오</strong> , <a href="http://developer.android.com/about/dashboards/index.html">API &lt;9</a> 인 사용자의 약 0.5 %만이 기술적으로 누락 된 것입니다. 따라서 나머지 부분에 집중할 수 있습니다. 사용자의 99.5 %입니다.
ru: <strong>ПОМНИТЕ</strong> , технически вы пропускаете только около 0,5% пользователей <a href="http://developer.android.com/about/dashboards/index.html">с API &lt;9</a> . Таким образом, вы можете сосредоточиться на остальном: это 99,5% пользователей!
zh_cn: <strong>请记住</strong> ，从技术上讲，您仅会错过大约0.5％的<a href="http://developer.android.com/about/dashboards/index.html">API &lt;9</a>用户。 因此，您可以专注于其余部分：这是99.5％的用户！

source: <strong>Settings.Secure.ANDROID_ID</strong> that returns the Android ID as an unique 64-bit hex string.
es: <strong>Settings.Secure.ANDROID_ID</strong> que devuelve la ID de Android como una cadena hexadecimal &uacute;nica de 64 bits.
ja: Android IDを一意の64ビット16進文字列として返す<strong>Settings.Secure.ANDROID_ID</strong> 。
ko: Android ID를 고유 한 64 비트 16 진수 문자열로 반환하는 <strong>Settings.Secure.ANDROID_ID</strong>
ru: <strong>Settings.Secure.ANDROID_ID,</strong> который возвращает идентификатор Android в виде уникальной 64-битной шестнадцатеричной строки.
zh_cn: <strong>Settings.Secure.ANDROID_ID</strong> ，以唯一的64位十六进制字符串形式返回Android ID。

source: <strong>TelephonyManger.getDeviceId()</strong> Returns the unique device ID, for example, the IMEI for GSM and the MEID or ESN for CDMA phones.
es: <strong>TelephonyManger.getDeviceId ()</strong> Devuelve la ID &uacute;nica del dispositivo, por ejemplo, el IMEI para GSM y el MEID o ESN para tel&eacute;fonos CDMA.
ja: <strong>TelephonyManger.getDeviceId（）</strong>一意のデバイスID（GSMの場合はIMEI、CDMA電話の場合はMEIDまたはESNなど<strong>）を</strong>返します。
ko: <strong>TelephonyManger.getDeviceId ()</strong> 고유 장치 ID (예 : GSM의 경우 IMEI, CDMA 전화의 경우 MEID 또는 ESN <strong>)를</strong> 반환합니다.
ru: <strong>TelephonyManger.getDeviceId ()</strong> Возвращает уникальный идентификатор устройства, например, IMEI для GSM и MEID или ESN для телефонов CDMA.
zh_cn: <strong>TelephonyManger.getDeviceId（）</strong>返回唯一的设备ID，例如，GSM的IMEI和CDMA电话的MEID或ESN。

source: <strong>The advantages of instance ID</strong>
es: <strong>Las ventajas de la identificaci&oacute;n de instancia</strong>
ja: <strong>インスタンスIDの利点</strong>
ko: <strong>인스턴스 ID의 장점</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Преимущества экземпляра ID</font></font></strong>
zh_cn: <strong>实例ID的优点</strong>

source: <strong>The disadvantages/issues</strong>
es: <strong>Las desventajas / problemas</strong>
ja: <strong>短所/問題</strong>
ko: <strong>단점 / 문제</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недостатки / проблемы</font></font></strong>
zh_cn: <strong>缺点/问题</strong>

source: <strong>UPDATE</strong>: As of recent versions of Android, many of the issues with <code>ANDROID_ID</code> have been resolved, and I believe this approach is no longer necessary. Please take a look at <a href="https://stackoverflow.com/a/2785493/231078">Anthony's answer</a>.
es: <strong>ACTUALIZACI&Oacute;N</strong> : a partir de versiones recientes de Android, muchos de los problemas con <code>ANDROID_ID</code> se han resuelto, y creo que este enfoque ya no es necesario. Por favor, eche un vistazo a <a href="https://stackoverflow.com/a/2785493/231078">la respuesta de Anthony</a> .
ja: <strong>更新</strong> ：Androidの最近のバージョンでは、 <code>ANDROID_ID</code> に関する問題の多くが解決されており、このアプローチは不要になったと思います。 <a href="https://stackoverflow.com/a/2785493/231078">アンソニーの答えを</a>見てください。
ko: <strong>업데이트</strong> : 최신 버전의 Android에서 <code>ANDROID_ID</code> 와 관련된 많은 문제가 해결되었으며 더 이상이 접근법이 필요하지 않다고 생각합니다. <a href="https://stackoverflow.com/a/2785493/231078">Anthony의 답변을</a> 살펴보십시오.
ru: <strong>ОБНОВЛЕНИЕ</strong> : В последних версиях Android многие проблемы с <code>ANDROID_ID</code> были решены, и я считаю, что такой подход больше не нужен. Пожалуйста, посмотрите на <a href="https://stackoverflow.com/a/2785493/231078">ответ Энтони</a> .
zh_cn: <strong>更新</strong> ：从Android的最新版本开始， <code>ANDROID_ID</code> 的许多问题已解决，我相信不再需要这种方法。 请看一下<a href="https://stackoverflow.com/a/2785493/231078">安东尼的回答</a> 。

source: <strong>Use a FirebaseInstanceId or a privately stored GUID</strong> whenever possible for all other use cases, except for payment fraud prevention and telephony.
es: <strong>Utilice un FirebaseInstanceId o un GUID almacenado de forma privada</strong> siempre que sea posible para todos los dem&aacute;s casos de uso, excepto para la prevenci&oacute;n del fraude de pagos y la telefon&iacute;a.
ja: 支払い詐欺防止とテレフォニーを除いて、他のすべてのユースケースで可能な限り<strong>、FirebaseInstanceIdまたはプライベートに格納されたGUIDを使用してください</strong> 。
ko: 지불 사기 방지 및 전화 통신을 제외한 다른 모든 사용 사례에 대해 가능 <strong>하면 FirebaseInstanceId 또는 비공개 저장된 GUID를 사용하십시오</strong> .
ru: <strong>Используйте FirebaseInstanceId или конфиденциальный GUID,</strong> когда это возможно, для всех других случаев использования, кроме предотвращения мошенничества с платежами и телефонии.
zh_cn: 对于所有其他用例，请尽可能<strong>使用FirebaseInstanceId或私有存储的GUID</strong> ，但要防止付款欺诈和电话。

source: <strong>User Email - Software</strong>
es: <strong>Correo electr&oacute;nico del usuario - Software</strong>
ja: <strong>ユーザーのメール-ソフトウェア</strong>
ko: <strong>사용자 이메일-소프트웨어</strong>
ru: <strong>Электронная почта пользователя - Программное обеспечение</strong>
zh_cn: <strong>用户电子邮件-软件</strong>

source: <strong>User Phone Number - Software</strong>
es: <strong>N&uacute;mero de tel&eacute;fono del usuario - Software</strong>
ja: <strong>ユーザーの電話番号-ソフトウェア</strong>
ko: <strong>사용자 전화 번호-소프트웨어</strong>
ru: <strong>Номер телефона пользователя - Программное обеспечение</strong>
zh_cn: <strong>用户电话号码-软件</strong>

source: <strong>WLAN MAC Address - Hardware</strong> (needs <strong><code>android.permission.ACCESS_WIFI_STATE</code></strong>)
es: <strong>Direcci&oacute;n MAC de WLAN: hardware</strong> (necesita <strong> <code>android.permission.ACCESS_WIFI_STATE</code> </strong> )
ja: <strong>WLAN MACアドレス-ハードウェア</strong> （ <strong> <code>android.permission.ACCESS_WIFI_STATE</code> </strong>が必要）
ko: <strong>WLAN MAC 주소-하드웨어</strong> ( <strong> <code>android.permission.ACCESS_WIFI_STATE</code> </strong> 필요)
ru: <strong>WLAN MAC-адрес - Аппаратное обеспечение</strong> (требуется <strong> <code>android.permission.ACCESS_WIFI_STATE</code> </strong> )
zh_cn: <strong>WLAN MAC地址-硬件</strong> （需要<strong> <code>android.permission.ACCESS_WIFI_STATE</code> </strong> ）

source: <strong>WLAN MAC Address</strong> string (needs <code>android.permission.ACCESS_WIFI_STATE</code>)
es: Cadena de <strong>direcci&oacute;n MAC de WLAN</strong> (necesita <code>android.permission.ACCESS_WIFI_STATE</code> )
ja: <strong>WLAN MACアドレス</strong>文字列（ <code>android.permission.ACCESS_WIFI_STATE</code> が必要）
ko: <strong>WLAN MAC 주소</strong> 문자열 ( <code>android.permission.ACCESS_WIFI_STATE</code> 필요)
ru: Строка <strong>MAC-адреса WLAN</strong> (требуется <code>android.permission.ACCESS_WIFI_STATE</code> )
zh_cn: <strong>WLAN MAC地址</strong>字符串（需要 <code>android.permission.ACCESS_WIFI_STATE</code> ）

source: A <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">Serial</a> field was added to the <code>Build</code> class in API level 9 (Android 2.3 - Gingerbread). Documentation says it represents the hardware serial number. Thus it should be unique, if it exists on the device.
es: Se agreg&oacute; un campo de <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">serie</a> a la clase <code>Build</code> en API nivel 9 (Android 2.3 - Gingerbread). La documentaci&oacute;n dice que representa el n&uacute;mero de serie del hardware. Por lo tanto, debe ser &uacute;nico, si existe en el dispositivo.
ja: <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">シリアル</a>フィールドがAPIレベル9（Android 2.3-Gingerbread）の <code>Build</code> クラスに追加されました。 ドキュメントには、ハードウェアのシリアル番号を表すと記載されています。 したがって、デバイス上に存在する場合、一意である必要があります。
ko: API 레벨 9 (Android 2.3-Gingerbread)의 <code>Build</code> 클래스에 <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">Serial</a> 필드가 추가되었습니다. 설명서에 하드웨어 일련 번호가 표시되어 있습니다. 따라서 장치에 존재하는 경우 고유해야합니다.
ru: Поле <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">Serial</a> было добавлено в класс <code>Build</code> на уровне API 9 (Android 2.3 - Gingerbread). Документация говорит, что это представляет серийный номер оборудования. При этом он должен быть уникальным, если он существует на устройстве.
zh_cn: 在API级别9（Android 2.3-Gingerbread）中，将&ldquo; <a href="http://developer.android.com/reference/android/os/Build.html#SERIAL">序列&rdquo;</a>字段添加到了 <code>Build</code> 类。 文档说它代表硬件序列号。 因此，如果设备上存在它，则它应该是唯一的。
