Repository: rueisnom/feedback
Catalog: xlf/10/53/72/105372.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If enum values range strictly from 0 to n - 1, a generic alternative is:
es: Si los valores de enumeración van estrictamente de 0 a n-1,una alternativa genérica es:
ja: 列挙値が厳密に 0 から n-1 までの範囲である場合、一般的な代替案は次のようになります。
ko: 열거 형 값의 범위가 0에서 n-1 사이 인 경우 일반적인 대안은 다음과 같습니다.
ru: Если значения перечисления находятся в строгом диапазоне от 0 до n-1,то это родовая альтернатива:
zh_cn: 如果枚举值的范围严格从0到n-1,一般的替代方案是:

source: If you have:
es: Si es así:
ja: あなたが持っているなら
ko: 당신이 가지고 있다면:
ru: Если так:
zh_cn: 如果你有。

source: If you need speed and type checking at build and run time, this helper method is better than using LINQ to cast each element:
es: Si necesitas comprobar la velocidad y el tipo en tiempo de construcción y ejecución,este método de ayuda es mejor que usar LINQ para lanzar cada elemento:
ja: ビルド時と実行時にスピードと型チェックが必要な場合は、LINQを使って各要素をキャストするよりも、このヘルパーメソッドの方が良いでしょう。
ko: 빌드 및 런타임시 속도 및 유형 검사가 필요한 경우이 도우미 방법은 LINQ를 사용하여 각 요소를 캐스팅하는 것보다 낫습니다.
ru: Если вам нужна проверка скорости и типа во время сборки и выполнения,то этот вспомогательный метод лучше,чем использование LINQ для приведения каждого элемента в соответствие:
zh_cn: 如果你在构建和运行时需要速度和类型检查,这种帮助方法比使用LINQ来铸造每个元素更好。

source: In this case, <code>Suit</code> and <code>Value</code> are both enumerations:
es: En este caso, <code>Suit</code> y <code>Value</code> son ambas enumeraciones:
ja: この場合、 <code>Suit</code> と <code>Value</code> は両方とも列挙型です。
ko: 이 경우 <code>Suit</code> 와 <code>Value</code> 는 모두 열거입니다.
ru: В этом случае <code>Suit</code> и <code>Value</code> являются перечислениями:
zh_cn: 在这种情况下， <code>Suit</code> 和 <code>Value</code> 都是枚举：

source: It fails on the <code>Suit</code> keyword, the second one.
es: Falla en la palabra clave <code>Suit</code> , la segunda.
ja: 2番目の <code>Suit</code> キーワードでは失敗します。
ko: 두 번째 키워드 인 <code>Suit</code> 키워드에서는 실패합니다.
ru: Не удается <code>Suit</code> ключевое слово Suit , второе.
zh_cn: 它在 <code>Suit</code> 关键字（第二个）上失败。

source: It is clean, simple, and, by @Jeppe-Stig-Nielsen's comment, fast.
es: Es limpio,simple,y,por el comentario de @Jeppe-Stig-Nielsen,rápido.
ja: すっきりしていて、シンプルで、@Jeppe-Stig-Nielsenさんのコメントによると、速いです。
ko: 깨끗하고 간단하며 @ Jeppe-Stig-Nielsen의 의견에 따르면 빠릅니다.
ru: Чисто,просто,и,по комментарию @Jeppe-Stig-Nielsen,быстро.
zh_cn: 它很干净,很简单,而且,通过@Jeppe-Stig-Nielsen的评论,速度很快。

source: It looks to me like you really want to print out the names of each enum, rather than the values. In which case <code>Enum.GetNames()</code> seems to be the right approach.
es: Me parece que realmente quieres imprimir los nombres de cada enumeraci&oacute;n, en lugar de los valores. En cuyo caso, <code>Enum.GetNames()</code> parece ser el enfoque correcto.
ja: 値ではなく、各列挙型の名前を出力したいようです。 その場合、 <code>Enum.GetNames()</code> が適切なアプローチのようです。
ko: 값이 아닌 각 열거 형의 이름을 실제로 인쇄하려는 것처럼 보입니다. 이 경우 <code>Enum.GetNames()</code> 가 올바른 접근 방식 인 것 같습니다.
ru: Мне кажется, что вы действительно хотите распечатать имена каждого перечисления, а не значения. В этом случае <code>Enum.GetNames()</code> кажется правильным подходом.
zh_cn: 在我看来，您确实想要打印每个枚举的名称，而不是值。 在这种情况下， <code>Enum.GetNames()</code> 似乎是正确的方法。

source: Just by combining the top answers, I threw together a very simple extension:
es: Sólo con la combinación de las respuestas de arriba,junté una extensión muy simple:
ja: 上の回答を組み合わせるだけで、非常に簡単な拡張を投げかけてみました。
ko: 최고의 답변을 결합하여 매우 간단한 확장을 함께 던졌습니다.
ru: Просто объединив верхние ответы,я собрал очень простое расширение:
zh_cn: 只是结合上面的答案,我抛出了一个非常简单的延伸。

source: My solution works in <a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> (3.5) and supports type checking <strong>at compile time</strong>:
es: Mi soluci&oacute;n funciona en <a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> (3.5) y admite la verificaci&oacute;n de tipos <strong>en tiempo de compilaci&oacute;n</strong> :
ja: 私のソリューションは<a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> （3.5）で動作し<strong>、コンパイル時の</strong>型チェック<strong>を</strong>サポート<strong>しています</strong> 。
ko: 내 솔루션은 <a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> (3.5)에서 작동 <strong>하며 컴파일 타임에</strong> 유형 검사 <strong>를</strong> 지원합니다.
ru: Мое решение работает в <a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> (3.5) и поддерживает проверку типов <strong>во время компиляции</strong> :
zh_cn: 我的解决方案在<a href="https://en.wikipedia.org/wiki/.NET_Compact_Framework">.NET Compact Framework</a> （3.5）中工作，并<strong>在编译时</strong>支持类型检查：

source: Now you call:
es: Ahora llama tú:
ja: 今すぐ電話して
ko: 이제 전화하십시오 :
ru: Теперь ты звонишь:
zh_cn: 现在你来了。

source: Of course you can return <code>IEnumerable&lt;T&gt;</code>, but that buys you nothing here.
es: Por supuesto, puede devolver <code>IEnumerable&lt;T&gt;</code> , pero eso no le compra nada aqu&iacute;.
ja: もちろん <code>IEnumerable&lt;T&gt;</code> 返すことはできますが、ここでは何も買いません。
ko: 물론 <code>IEnumerable&lt;T&gt;</code> 반환 할 수는 있지만 여기서는 아무것도 사지 않습니다.
ru: Конечно, вы можете вернуть <code>IEnumerable&lt;T&gt;</code> , но здесь вы ничего не купите.
zh_cn: 当然，您可以返回 <code>IEnumerable&lt;T&gt;</code> ，但是在这里您什么也买不到。

source: One can also use some sort of caching if performance matters, but I don't expect this to be an issue at all.
es: También se puede usar algún tipo de caché si el rendimiento es importante,pero no espero que esto sea un problema en absoluto.
ja: パフォーマンスが重要な場合は、キャッシングのようなものを使うこともできますが、これが問題になることは全く期待していません。
ko: 성능이 중요한 경우 일종의 캐싱을 사용할 수도 있지만 이것이 전혀 문제가되지는 않습니다.
ru: Можно также использовать некоторое кэширование,если производительность имеет значение,но я не ожидаю,что это будет проблемой вообще.
zh_cn: 如果性能重要的话,也可以使用某种缓存,但我认为这根本不会是个问题。

source: Some versions of the .NET framework do not support <code>Enum.GetValues</code>. Here's a good workaround from <a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0: Enum.GetValues in Compact Framework</a>:
es: Algunas versiones de .NET Framework no son compatibles con <code>Enum.GetValues</code> . Aqu&iacute; hay una buena soluci&oacute;n de <a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0: Enum.GetValues ​​en Compact Framework</a> :
ja: .NETフレームワークの一部のバージョンは、 <code>Enum.GetValues</code> をサポートしていません。 <a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0の</a>適切な回避策は次のとおりです ： Compact FrameworkのEnum.GetValues ：
ko: .NET 프레임 워크의 일부 버전은 <code>Enum.GetValues</code> 를 지원하지 않습니다. 다음은 <a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0</a> 의 좋은 해결 방법 입니다. Compact Framework의 Enum.GetValues :
ru: Некоторые версии .NET Framework не поддерживают <code>Enum.GetValues</code> . Вот хороший обходной путь от <a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0: Enum.GetValues ​​в Compact Framework</a> :
zh_cn: .NET框架的某些版本不支持 <code>Enum.GetValues</code> 。 这是<a href="https://web.archive.org/web/20100530072822/http://ideas.dalezak.ca/2008/11/enumgetvalues-in-compact-framework.html">Ideas 2.0</a>的一个很好的解决方法：Compact Framework中的Enum.GetValues ：

source: That's at least a little faster, ja?
es: Eso es al menos un poco más rápido,¿sí?
ja: 少しは速くなったかな?
ko: 조금 더 빠릅니다, ja?
ru: Это хотя бы немного быстрее,ja?
zh_cn: 这至少快了一点,是吗?

source: The <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">System.Enum.GetNames method</a> can be used to retrieve an array of strings which are the names of the enum values, as the name suggests.
es: El <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">m&eacute;todo System.Enum.GetNames</a> se puede utilizar para recuperar una matriz de cadenas que son los nombres de los valores de enumeraci&oacute;n, como su nombre indica.
ja: <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">System.Enum.GetNamesメソッド</a>を使用すると、名前が示すように、列挙値の名前である文字列の配列を取得できます。
ko: <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">System.Enum.GetNames 메서드</a> 를 사용하면 이름에서 알 수 있듯이 열거 형 값의 이름 인 문자열 배열을 검색 할 수 있습니다.
ru: Метод <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">System.Enum.GetNames</a> можно использовать для получения массива строк, которые являются именами значений перечисления, как следует из названия.
zh_cn: 顾名思义， <a href="https://msdn.microsoft.com/en-us/library/system.enum.getnames(v=vs.110).aspx">System.Enum.GetNames方法</a>可用于检索字符串数组，这些字符串是枚举值的名称。

source: The author uses a double for-loop to iterate through a pair of Enumerators (to create a full deck of cards):
es: El autor utiliza un doble for-loop para iterar a través de un par de Enumeradores (para crear una baraja completa de cartas):
ja: 作者は二重のフォーループを使用して、列挙者のペアを反復処理しています(カードの完全なデックを作成します)。
ko: 저자는 이중 for 루프를 사용하여 한 쌍의 열거자를 반복합니다 (전체 카드 데크 만들기).
ru: Автор использует двойную петлю for-loop для итерации через пару Enumerators (для создания полной колоды карт):
zh_cn: 笔者用双换循环的方式,通过一对枚举器进行迭代(建立一副完整的牌组)。

source: The enum itself must be decorated with the <a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">FlagsAttribute</a>:
es: La enumeraci&oacute;n en s&iacute; debe estar decorada con el <a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">atributo FlagsAttribute</a> :
ja: enum自体は<a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">FlagsAttribute</a>で装飾する必要があります。
ko: 열거 형 자체는 <a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">FlagsAttribute</a> 로 장식되어야합니다.
ru: Сам перечисление должно быть украшено <a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">атрибутом Flags</a> :
zh_cn: 枚举本身必须用<a href="http://msdn.microsoft.com/en-us/library/system.flagsattribute.aspx">FlagsAttribute</a>装饰：

source: The first will give you values in form on an array of **<code>object</code>**s, and the second will give you values in form of an array of **<code>String</code>**s.
es: El primero le dar&aacute; valores en forma en una matriz de ** <code>object</code> ** s, y el segundo le dar&aacute; valores en forma de una matriz de ** <code>String</code> ** s.
ja: 最初は** <code>object</code> **の配列の形式で値を提供し、2番目は** <code>String</code> **の配列の形式で値を提供します。
ko: 첫 번째는 ** <code>object</code> ** 배열에 값을 제공하고 두 번째는 ** <code>String</code> ** 배열에 값을 제공합니다.
ru: Первый даст вам значения в виде массива ** <code>object</code> ** с, а второй даст вам значения в виде массива ** <code>String</code> ** с.
zh_cn: 第一个将以** <code>object</code> **数组形式提供值，第二个将以** <code>String</code> **数组形式提供值。

source: The method <code>getListOfEnum</code> uses reflection to take any enum type and returns an <code>IEnumerable</code> of all enum values.
es: El m&eacute;todo <code>getListOfEnum</code> usa la reflexi&oacute;n para tomar cualquier tipo de enumeraci&oacute;n y devuelve un <code>IEnumerable</code> de todos los valores de enumeraci&oacute;n.
ja: <code>getListOfEnum</code> メソッドは、リフレクションを使用して任意の列挙型を取得し、すべての列挙値の <code>IEnumerable</code> を返します。
ko: <code>getListOfEnum</code> 메소드는 리플렉션을 사용하여 열거 형을 가져오고 모든 열거 형 값의 <code>IEnumerable</code> 을 리턴합니다.
ru: Метод <code>getListOfEnum</code> использует отражение, чтобы взять любой тип перечисления и возвращает <code>IEnumerable</code> всех значений перечисления.
zh_cn: 方法 <code>getListOfEnum</code> 使用反射来获取任何枚举类型，并返回所有枚举值的 <code>IEnumerable</code> 。

source: There are two ways to iterate an <code>Enum</code>:
es: Hay dos formas de iterar una <code>Enum</code> :
ja: <code>Enum</code> を反復するには2つの方法があります。
ko: <code>Enum</code> 을 반복하는 두 가지 방법이 있습니다.
ru: Есть два способа перебора <code>Enum</code> :
zh_cn: 有两种方法可以迭代 <code>Enum</code> ：

source: There you go, <code>IEnumerable&lt;Suit&gt;</code>.
es: Ah&iacute; tienes, <code>IEnumerable&lt;Suit&gt;</code> .
ja: はい、 <code>IEnumerable&lt;Suit&gt;</code> です。
ko: <code>IEnumerable&lt;Suit&gt;</code> 있습니다.
ru: Вот, <code>IEnumerable&lt;Suit&gt;</code> , IEnumerable &lt;Suit&gt; .
zh_cn: <code>IEnumerable&lt;Suit&gt;</code> 。

source: This question appears in Chapter 10 of "<a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C# Step by Step 2013</a>"
es: Esta pregunta aparece en el Cap&iacute;tulo 10 de " <a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C # paso a paso 2013</a> "
ja: この質問は、「 <a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C＃ステップバイステップ2013</a> 」の第10章に記載されています 。
ko: 이 질문은 " <a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C # Step by Step 2013</a> "의 10 장에 나타납니다.
ru: Этот вопрос появляется в главе 10 &laquo; <a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C # Step by Step 2013</a> &raquo;
zh_cn: 该问题出现在&ldquo; <a href="http://www.amazon.ca/Microsoft-Visual-2013-Step/dp/073568183X">C＃Step by Step 2013</a> &rdquo;的第10章中

source: Three ways:
es: Tres maneras:
ja: 3つの方法があります。
ko: 세 가지 방법 :
ru: Три способа:
zh_cn: 三种方式。

source: Use <code>Cast&lt;T&gt;</code>:
ja: <code>Cast&lt;T&gt;</code> 使用：
ko: <code>Cast&lt;T&gt;</code> :
ru: Используйте <code>Cast&lt;T&gt;</code> :
zh_cn: 使用 <code>Cast&lt;T&gt;</code> ：

source: Use it in a <code>foreach</code> loop as below:
es: &Uacute;selo en un bucle <code>foreach</code> como a continuaci&oacute;n:
ja: 以下のように <code>foreach</code> ループで使用します。
ko: 아래와 같이 <code>foreach</code> 루프에서 사용하십시오.
ru: Используйте его в цикле <code>foreach</code> , как показано ниже:
zh_cn: 在如下所示的 <code>foreach</code> 循环中使用它：

source: What if you know the type will be an <code>enum</code>, but you don't know what the exact type is at compile time?
es: &iquest;Qu&eacute; sucede si sabe que el tipo ser&aacute; una <code>enum</code> eraci&oacute;n , pero no sabe cu&aacute;l es el tipo exacto en tiempo de compilaci&oacute;n?
ja: 型が <code>enum</code> になることがわかっていて、コンパイル時に正確な型がわからない場合はどうなりますか？
ko: 형식이 <code>enum</code> 것을 알고 있지만 컴파일 타임에 정확한 형식이 무엇인지 모르는 경우 어떻게해야합니까?
ru: Что если вы знаете, что типом будет <code>enum</code> , но вы не знаете, какой это тип во время компиляции?
zh_cn: 如果您知道类型将是 <code>enum</code> ，但又不知道在编译时确切的类型该怎么办？

source: Will output:
es: Saldrá:
ja: 出力します。
ko: 출력합니다 :
ru: Выходит:
zh_cn: 将输出。

source: You won't get <code>Enum.GetValues()</code> in <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a>.
es: No obtendr&aacute; <code>Enum.GetValues()</code> en <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a> .
ja: <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a> <code>Enum.GetValues()</code> を取得しません。
ko: <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a> 에서는 <code>Enum.GetValues()</code> 를 얻지 못합니다.
ru: Вы не получите <code>Enum.GetValues()</code> в <a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight</a> .
zh_cn: 您不会在<a href="http://en.wikipedia.org/wiki/Microsoft_Silverlight">Silverlight中</a>获得 <code>Enum.GetValues()</code> 。

source: and <code>PlayingCard</code> is a card object with a defined <code>Suit</code> and <code>Value</code>:
es: y <code>PlayingCard</code> es un objeto de carta con un <code>Suit</code> y <code>Value</code> definidos:
ja: <code>PlayingCard</code> は、 <code>Suit</code> と <code>Value</code> 定義されたカードオブジェクトです。
ko: <code>PlayingCard</code> 는 <code>Suit</code> 와 <code>Value</code> 가 정의 된 카드 객체입니다.
ru: и <code>PlayingCard</code> - это объект карты с определенными мастью и достоинством :
zh_cn: 而 <code>PlayingCard</code> 是具有定义的 <code>Suit</code> 和 <code>Value</code> 的纸牌对象：
