Repository: rueisnom/feedback
Catalog: xlf/10/53/72/105372.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: 'Suit' is a 'type' but is used like a 'variable'
es: "Traje" es un "tipo" pero se usa como una "variable
ja: スーツ」は「型」ですが、「変数」のように使われます。
ko: '정장'은 '유형'이지만 '변수'처럼 사용됩니다.
ru: 'Suit' является 'типом',но используется как 'переменная'.
zh_cn: 'Suit'是一个 "类型",但使用起来却像 "变量 "一样。

source: (Actually, that's a bit more complicated than that - enum types are considered to have an "underlying" integer type, which means each enum value corresponds to an integer value (this is typically implicit, but can be manually specified). C# was designed in a way so that you could stuff <em>any</em> integer of that type into the enum variable, even if it isn't a "named" value.)
es: (En realidad, eso es un poco m&aacute;s complicado que eso: se considera que los tipos de enumeraci&oacute;n tienen un tipo entero "subyacente", lo que significa que cada valor de enumeraci&oacute;n corresponde a un valor entero (esto generalmente es impl&iacute;cito, pero puede especificarse manualmente). C # fue dise&ntilde;ado de alguna manera para que pueda introducir <em>cualquier</em> n&uacute;mero entero de ese tipo en la variable enum, incluso si no es un valor "con nombre").
ja: （実際、それはそれよりも少し複雑です-列挙型は「基礎となる」整数型を持つと見なされます。つまり、各列挙値は整数値に対応します（これは通常暗黙的ですが、手動で指定できます）。C＃は設計されました「名前付き」値でなくても、その型の<em>任意の</em>整数をenum変数に入れることができるような方法で）。
ko: (실제로, 그것은 그보다 조금 더 복잡합니다-열거 형은 "기본"정수 유형을 갖는 것으로 간주됩니다. 즉, 각 열거 값은 정수 값에 해당합니다 (이는 일반적으로 암시 적이지만 수동으로 지정할 수 있음). "이름이없는"값이 아니더라도 해당 유형의 정수를 열거 형 변수에 넣을 수있는 방식으로)
ru: (На самом деле, это немного сложнее - считается, что типы перечисления имеют &laquo;базовый&raquo; целочисленный тип, что означает, что каждое значение перечисления соответствует целочисленному значению (обычно это неявное, но может быть указано вручную). C # был разработан таким образом, чтобы вы могли вставить <em>любое</em> целое число этого типа в переменную enum, даже если это не &laquo;именованное&raquo; значение.)
zh_cn: （实际上，这要复杂得多-枚举类型被认为具有&ldquo;底层&rdquo;整数类型，这意味着每个枚举值都对应一个整数值（这通常是隐式的，但可以手动指定）。C＃是设计的以便您可以将该类型的<em>任何</em>整数填充到enum变量中，即使它不是&ldquo;命名&rdquo;值也是如此。）

source: (The current accepted answer has a cast that I don't think is needed (although I may be wrong).)
es: (La respuesta actual aceptada tiene un elenco que no creo que sea necesario (aunque puede que me equivoque).)
ja: (現在受け入れられている回答には、必要ないと思われるキャストが入っています(間違っているかもしれませんが)。
ko: (현재 허용되는 답변에는 내가 필요하지 않다고 생각되는 캐스트가 있습니다 (잘못되었을지라도).)
ru: (Текущий принятый ответ имеет гипс,который,как мне кажется,не нужен (хотя,возможно,я ошибаюсь)).
zh_cn: (目前接受的答案中,有一个我认为不需要的投稿(虽然我可能错了))。

source: <a href="http://en.wikipedia.org/wiki/Language_Integrated_Query">LINQ</a> Generic Way:
es: Manera gen&eacute;rica de <a href="http://en.wikipedia.org/wiki/Language_Integrated_Query">LINQ</a> :
ja: <a href="http://en.wikipedia.org/wiki/Language_Integrated_Query">LINQの</a>一般的な方法：
ko: <a href="http://en.wikipedia.org/wiki/Language_Integrated_Query">LINQ</a> 일반적인 방법 :
zh_cn: <a href="http://en.wikipedia.org/wiki/Language_Integrated_Query">LINQ</a>通用方式：

source: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Original Blog Post by Einar Ingebrigtsen</a>:
es: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Publicaci&oacute;n de blog original de Einar Ingebrigtsen</a> :
ja: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Einar Ingebrigtsenによるオリジナルのブログ投稿</a> ：
ko: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Einar Ingebrigtsen의 원본 블로그 게시물</a> :
ru: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Оригинальное сообщение в блоге Эйнара Ингебригтсена</a> :
zh_cn: <a href="http://web.archive.org/web/20101105013136/http://www.dolittle.no/blogs/einar/archive/2008/01/13/missing-enum-getvalues-when-doing-silverlight-for-instance.aspx">Einar Ingebrigtsen撰写的原始博客文章</a> ：

source: <code>Enum.GetValues(type)</code> // Since .NET 1.1, not in Silverlight or .NET Compact Framework
es: <code>Enum.GetValues(type)</code> // Desde .NET 1.1, no en Silverlight o .NET Compact Framework
ja: <code>Enum.GetValues(type)</code> // .NET 1.1以降、Silverlightまたは.NET Compact Frameworkにはありません
ko: <code>Enum.GetValues(type)</code> // Silverlight 또는 .NET Compact Framework가 아닌 .NET 1.1 이후
ru: <code>Enum.GetValues(type)</code> // Начиная с .NET 1.1, а не в Silverlight или .NET Compact Framework
zh_cn: <code>Enum.GetValues(type)</code> //从.NET 1.1开始，不在Silverlight或.NET Compact Framework中

source: <code>EnumLoop</code> has this completely generic definition:
es: <code>EnumLoop</code> tiene esta definici&oacute;n completamente gen&eacute;rica:
ja: <code>EnumLoop</code> には、次の完全に一般的な定義があります。
ko: <code>EnumLoop</code> 에는 다음과 같은 일반적인 정의가 있습니다.
ru: <code>EnumLoop</code> имеет это полностью общее определение:
zh_cn: <code>EnumLoop</code> 具有以下完全通用的定义：

source: <code>enum</code> types are called "enumeration types" not because they are containers that "enumerate" values (which they aren't), but because they are defined by <em>enumerating</em> the possible values for a variable of that type.
es: <code>enum</code> tipos de enumeraci&oacute;n se denominan "tipos de enumeraci&oacute;n" no porque sean contenedores que "enumeren" valores (que no lo son), sino porque se definen <em>enumerando</em> los valores posibles para una variable de ese tipo.
ja: <code>enum</code> 型は「列挙型」と呼ばれます。これは、値が「列挙」されるコンテナではないためではなく、その型の変数の可能な値を<em>列挙</em>することによって定義されるためです。
ko: <code>enum</code> 형은 값을 "열거하는"컨테이너가 아니기 때문에 해당 유형의 변수에 가능한 값을 <em>열거</em> 하여 정의되기 때문에 "열거 형"이라고합니다.
ru: Типы <code>enum</code> называются &laquo;типами перечисления&raquo; не потому, что они являются контейнерами, которые &laquo;перечисляют&raquo; значения (которые они не являются), а потому, что они определяются путем <em>перечисления</em> возможных значений для переменной этого типа.
zh_cn: <code>enum</code> 类型之所以被称为&ldquo;枚举类型&rdquo;，不是因为它们是&ldquo;枚举&rdquo;值（不是）的容器，而是因为它们是通过<em>枚举</em>该类型变量的可能值来定义的。

source: <code>type.GetEnumValues()</code> // Only on .NET 4 and above
es: <code>type.GetEnumValues()</code> // Solo en .NET 4 y superior
ja: <code>type.GetEnumValues()</code> // .NET 4以降のみ
ko: <code>type.GetEnumValues()</code> // .NET 4 이상에서만
ru: <code>type.GetEnumValues()</code> // Только в .NET 4 и выше
zh_cn: <code>type.GetEnumValues()</code> //仅在.NET 4及更高版本上

source: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> // Works everywhere
es: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> // Funciona en todas partes
ja: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> //どこでも機能します
ko: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> // 모든 곳에서 작동
ru: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> // Работает везде
zh_cn: <code>type.GetFields().Where(x =&gt; x.IsLiteral).Select(x =&gt; x.GetValue(null))</code> //随处可见

source: <em>I am not sure why <code>GetEnumValues</code> was introduced on type instances. It isn't very readable at all for me.</em>
es: <em>No estoy seguro de por <code>GetEnumValues</code> se introdujeron GetEnumValues en las instancias de tipo.</em> <em>No es muy legible para m&iacute;.</em>
ja: <em>型インスタンスに <code>GetEnumValues</code> が導入された理由がわかりません。</em> <em>それは私にはまったく読めません。</em>
ko: <em>왜 <code>GetEnumValues</code> 가 형식 인스턴스에 도입되었는지 잘 모르겠습니다.</em> <em>그것은 나에게 전혀 읽을 수있는 것이 아닙니다.</em>
ru: <em>Я не уверен, почему <code>GetEnumValues</code> был введен на экземплярах типов.</em> <em>Это не очень читабельно для меня.</em>
zh_cn: <em>我不确定为什么在类型实例上引入了 <code>GetEnumValues</code> 。</em> <em>这对我来说根本不是很可读。</em>

source: <strong>Note</strong>: The cast to <code>(Suit[])</code> is not strictly necessary, <a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">but it does make the code 0.5 ns faster</a>.
es: <strong>Nota</strong> : La conversi&oacute;n a <code>(Suit[])</code> no es estrictamente necesaria, <a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">pero hace que el c&oacute;digo sea 0.5 ns m&aacute;s r&aacute;pido</a> .
ja: <strong>注</strong> ： <code>(Suit[])</code> へのキャストは厳密には必要ありません<a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">が、コードを0.5 ns高速化し</a>ます。
ko: <strong>참고</strong> : <code>(Suit[])</code> 캐스트 할 필요는 <a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">없지만 코드를 0.5ns 더 빠르게</a> 만듭니다.
ru: <strong>Примечание</strong> : приведение к <code>(Suit[])</code> не является строго необходимым, <a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">но оно ускоряет выполнение кода на 0,5 нс</a> .
zh_cn: <strong>注意</strong> ：强制转换为 <code>(Suit[])</code> 并不是绝对必要的， <a href="https://gist.github.com/bartoszkp/9e059c3edccc07a5e588#gistcomment-2625454">但是它确实使代码快了0.5 ns</a> 。

source: A call would look like this:
es: Una llamada se vería así:
ja: 呼び出しはこのようになります。
ko: 전화는 다음과 같습니다.
ru: Звонок будет выглядеть так:
zh_cn: 一个电话会是这样的。

source: A simple and generic way to convert an enum to something you can interact:
es: Una forma simple y genérica de convertir un enum en algo con lo que se pueda interactuar:
ja: 列挙型を対話可能なものに変換するシンプルで汎用的な方法です。
ko: 열거 형을 상호 작용할 수있는 것으로 변환하는 간단하고 일반적인 방법 :
ru: Простой и общий способ преобразования enum в то,что вы можете взаимодействовать:
zh_cn: 一个简单而通用的方法,可以将一个词条转换为你可以交互的东西。

source: Add method <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> to your class, like:
es: Agregue el m&eacute;todo <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> a su clase, como:
ja: 次のように、クラス <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> をクラスに追加します。
ko: 다음과 같이 <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> 메소드를 클래스에 추가하십시오.
ru: Добавьте метод <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> в ваш класс, например:
zh_cn: 将方法 <code>public static IEnumerable&lt;T&gt; GetValues&lt;T&gt;()</code> 到您的类，例如：

source: Also you can bind to the public static members of the enum directly by using reflection:
es: También puede vincular al público a los miembros estáticos de la lista directamente mediante el uso de la reflexión:
ja: また、リフレクションを利用してenumのパブリックスタティックメンバに直接バインドすることもできます。
ko: 또한 리플렉션을 사용하여 열거 형의 공개 정적 멤버에 직접 바인딩 할 수 있습니다.
ru: Также вы можете связать с публичными статическими членами переписи непосредственно с помощью рефлексии:
zh_cn: 同时,你也可以通过使用反射直接绑定到enum的公共静态成员。

source: And it gives the following compile-time error:
es: Y da el siguiente error de tiempo de compilación:
ja: そして、以下のようなコンパイル時エラーが発生します。
ko: 그리고 다음과 같은 컴파일 타임 오류가 발생합니다.
ru: И это дает следующую ошибку во время компиляции:
zh_cn: 而它给出的编译错误如下。

source: And then:
es: Y luego:
ja: そして、その後。
ko: 그리고:
ru: А потом:
zh_cn: 然后。

source: And you can use it like below:
es: Y puedes usarlo como abajo:
ja: そして、以下のような使い方ができます。
ko: 그리고 당신은 아래와 같이 그것을 사용할 수 있습니다 :
ru: И ты можешь использовать его,как внизу:
zh_cn: 而且你可以像下面这样使用。

source: As with any code that involves <a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">reflection</a>, you should take steps to ensure it runs only once and results are cached.
es: Al igual que con cualquier c&oacute;digo que implique <a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">reflexi&oacute;n</a> , debe tomar medidas para asegurarse de que se ejecute solo una vez y que los resultados se almacenen en cach&eacute;.
ja: <a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">リフレクション</a>を含むすべてのコードと同様に、コードが1回だけ実行され、結果がキャッシュされるようにするための手順を実行する必要があります。
ko: <a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">리플렉션</a> 과 관련된 코드와 마찬가지로 코드가 한 번만 실행되고 결과가 캐시되도록 조치를 취해야합니다.
ru: Как и в случае любого кода, в котором используется <a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">рефлексия</a> , вы должны предпринять шаги, чтобы убедиться, что он выполняется только один раз и результаты кэшируются.
zh_cn: 与涉及<a href="https://docs.microsoft.com/en-us/dotnet/framework/reflection-and-codedom/reflection">反射的</a>任何代码一样，您应采取步骤确保其仅运行一次并缓存结果。

source: But that's not strictly enumerating, just looping. The second method is much faster than any other approach though...
es: Pero eso no es estrictamente enumerar,sólo hacer un bucle.El segundo método es mucho más rápido que cualquier otro enfoque,sin embargo...
ja: しかし、それは厳密には列挙ではなく、ただループしているだけです。2つ目の方法は、他の方法よりもはるかに高速なのですが...。
ko: 그러나 그것은 엄격하게 열거되지는 않고 반복됩니다. 두 번째 방법은 다른 접근법보다 훨씬 빠릅니다.
ru: Но это не строго перечисление,а просто петля.Второй метод намного быстрее,чем любой другой...
zh_cn: 但这不是严格意义上的枚举,只是循环。第二种方法虽然比其他方法要快得多......

source: By the way, incrementing the value is not a good way to enumerate the values of an enum. You should do this instead.
es: Por cierto,incrementar el valor no es una buena manera de enumerar los valores de un enum.Deberías hacer esto en su lugar.
ja: ところで、値をインクリメントするのは、enumの値を列挙するのにはよくありません。代わりにこれを行うべきです。
ko: 그건 그렇고, 값을 증가시키는 것은 열거 형의 값을 열거하는 좋은 방법이 아닙니다. 대신이 작업을 수행해야합니다.
ru: Кстати,увеличение значения-не самый лучший способ перечислить значения перечисления.Вместо этого следует сделать это.
zh_cn: 顺便说一下,递增值不是枚举一个枚举值的好方法。你应该这样做。

source: Call and pass your enum. Now you can iterate through it using <code>foreach</code>:
es: Llama y pasa tu enumeraci&oacute;n. Ahora puedes recorrerlo usando <code>foreach</code> :
ja: enumを呼び出して渡します。 これで、 <code>foreach</code> を使用してそれを反復できます。
ko: 열거 형을 부르고 전달하십시오. 이제 <code>foreach</code> 를 사용하여 반복 할 수 있습니다.
ru: Позвони и передай свое перечисление. Теперь вы можете перебрать его, используя <code>foreach</code> :
zh_cn: 调用并传递您的枚举。 现在，您可以使用 <code>foreach</code> 遍历它：

source: E.g. the following code does not compile:
es: Por ejemplo,el siguiente código no compila:
ja: 例えば、以下のコードはコンパイルされません。
ko: 예를 들어 다음 코드는 컴파일되지 않습니다.
ru: Например,следующий код не компилируется:
zh_cn: 例如:下面的代码无法编译。

source: EDIT: Should have suggested the <a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues</a> method instead. Oops.
es: EDITAR: Deber&iacute;a haber sugerido el m&eacute;todo <a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues ​​en su</a> lugar. Ups
ja: 編集：代わりに<a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues</a>メソッドを提案するべきでした。 おっと。
ko: 편집 : <a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues</a> 메서드를 대신 제안해야합니다. 죄송합니다.
ru: РЕДАКТИРОВАТЬ: должен был предложить метод <a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues</a> вместо этого. К сожалению.
zh_cn: 编辑：应该建议<a href="https://msdn.microsoft.com/en-us/library/system.enum.getvalues(v=vs.110).aspx">System.Enum.GetValues</a>方法来代替。 哎呀

source: For getting a list of int from an enum, use the following. It works!
es: Para obtener una lista de int de un enum,use lo siguiente.¡Funciona!
ja: enumからintのリストを取得するには、以下のようにします。うまくいきました!
ko: 열거 형에서 int 목록을 얻으려면 다음을 사용하십시오. 효과가있다!
ru: Для получения списка int из перечисления используйте следующее.Это работает!
zh_cn: 对于从一个枚举中获取int的列表,使用下面的方法。它的效果很好!

source: Having a helper class like <code>Enum&lt;T&gt;</code> is what is most readable and memorable for me:
es: Tener una clase auxiliar como <code>Enum&lt;T&gt;</code> es lo m&aacute;s legible y memorable para m&iacute;:
ja: <code>Enum&lt;T&gt;</code> ようなヘルパークラスを持つことは、私にとって最も読みやすく、思い出に残るものです。
ko: <code>Enum&lt;T&gt;</code> 와 같은 도우미 클래스를 갖는 것이 가장 읽기 쉽고 기억에 남는 것입니다.
ru: Наличие вспомогательного класса, такого как <code>Enum&lt;T&gt;</code> является для меня самым читаемым и запоминающимся:
zh_cn: 对我来说，拥有像 <code>Enum&lt;T&gt;</code> 这样的帮助器类是最容易阅读和记住的：

source: Here is a working example of creating select options for a <a href="https://en.wikipedia.org/wiki/Data_definition_language">DDL</a>:
es: Aqu&iacute; hay un ejemplo de trabajo para crear opciones de selecci&oacute;n para un <a href="https://en.wikipedia.org/wiki/Data_definition_language">DDL</a> :
ja: <a href="https://en.wikipedia.org/wiki/Data_definition_language">DDLの</a>選択オプションを作成する実際の例を次に示します。
ko: 다음은 <a href="https://en.wikipedia.org/wiki/Data_definition_language">DDL에</a> 대한 선택 옵션을 작성하는 실제 예입니다.
ru: Вот рабочий пример создания опций выбора для <a href="https://en.wikipedia.org/wiki/Data_definition_language">DDL</a> :
zh_cn: 这是为<a href="https://en.wikipedia.org/wiki/Data_definition_language">DDL</a>创建选择选项的工作示例：

source: How can you enumerate an <code>enum</code> in C#?
es: &iquest;C&oacute;mo se puede enumerar una <code>enum</code> eraci&oacute;n en C #?
ja: C＃で <code>enum</code> 型を列挙するにはどうすればよいですか？
ko: C #에서 열거 형을 어떻게 열거 할 수 있습니까?
ru: Как вы можете перечислить <code>enum</code> в C #?
zh_cn: 您如何 <code>enum</code> C＃中的枚举 ？

source: How to enumerate an enum
es: Cómo enumerar una lista
ja: 列挙の仕方
ko: 열거 형을 열거하는 방법
ru: Как перечислить перечисление
zh_cn: 如何枚举一个enum

source: I do not hold the opinion this is better, or even good. I am just stating yet another solution.
es: No tengo la opinión de que esto sea mejor,ni siquiera bueno.Sólo estoy exponiendo otra solución.
ja: 私はこれが良いという意見は持っていませんし、良いという意見も持っていません。私はまだ別の解決策を述べているだけです。
ko: 나는 이것이 더 낫거나 심지어 좋은 의견을 가지고 있지 않습니다. 방금 또 다른 해결책을 말하고 있습니다.
ru: Я не считаю,что это лучше или даже лучше.Я просто констатирую еще одно решение.
zh_cn: 我不认为这样做会更好,甚至是好的。我只是提出另一个解决方案。

source: I know it is a bit messy, but if you are fan of one-liners, here is one:
es: Sé que es un poco desordenado,pero si eres fanático de las frases de una sola línea,aquí tienes una:
ja: ちょっとごちゃごちゃしていますが、ワンライナーが好きな方はこちらをどうぞ。
ko: 조금 지저분하다는 것을 알고 있지만 한 줄짜리 팬이라면 여기에 하나가 있습니다.
ru: Я знаю,что это немного грязновато,но если вы фанат однолинейных фильмов,вот один:
zh_cn: 我知道有点乱,但如果你是单行本的粉丝,这里有一个。

source: I made some extensions for easy enum usage. Maybe someone can use it...
es: Hice algunas extensiones para facilitar el uso de la lista.Tal vez alguien pueda usarlo...
ja: enumを簡単に使えるように拡張機能を作ってみました。もしかしたら誰かに使ってもらえるかも・・・。
ko: 쉬운 열거 형 사용을 위해 몇 가지 확장을 만들었습니다. 누군가가 그것을 사용할 수 있습니다 ...
ru: Я сделал несколько расширений для удобства использования переписей.Может,кто-нибудь сможет его использовать...
zh_cn: 我做了一些扩展程序,方便枚举使用。也许有人可以用它.....

source: I think caching the array would speed it up considerably. It looks like you're getting a new array (through reflection) every time. Rather:
es: Creo que el almacenamiento de la matriz lo aceleraría considerablemente.Parece que cada vez se obtiene una nueva matriz (por reflexión).Más bien:
ja: 配列をキャッシュすればかなり速くなると思います。毎回(反射で)新しい配列を取得しているように見えます。むしろ。
ko: 어레이를 캐싱하면 속도가 상당히 빨라질 것이라고 생각합니다. 매번 (반사를 통해) 새로운 배열을 얻는 것처럼 보입니다. 차라리:
ru: Думаю,кэширование массива значительно ускорит его.Похоже,что каждый раз вы получаете новый массив (через отражение).Скорее:
zh_cn: 我认为缓存数组会大大加快它的速度。看起来你每次都会得到一个新的数组(通过反射)。相反的是。

source: I think this is more efficient than other suggestions because <code>GetValues()</code> is not called each time you have a loop. It is also more concise. And you get a compile-time error, not a runtime exception if <code>Suit</code> is not an <code>enum</code>.
es: Creo que esto es m&aacute;s eficiente que otras sugerencias porque <code>GetValues()</code> no se llama cada vez que tiene un bucle. Tambi&eacute;n es m&aacute;s conciso. Y obtiene un error en tiempo de compilaci&oacute;n, no una excepci&oacute;n en tiempo de ejecuci&oacute;n si <code>Suit</code> no es una <code>enum</code> eraci&oacute;n .
ja: <code>GetValues()</code> はループが発生するたびに呼び出されないため、これは他の提案よりも効率的です。 また、より簡潔です。 また、 <code>Suit</code> が <code>enum</code> でない場合、ランタイム例外ではなく、コンパイル時エラーが発生します。
ko: 루프가있을 때마다 <code>GetValues()</code> 가 호출되지 않기 때문에 이것이 다른 제안보다 효율적이라고 생각합니다. 더 간결합니다. <code>Suit</code> 가 <code>enum</code> 이 아닌 경우 런타임 예외가 아니라 컴파일 타임 오류가 발생합니다.
ru: Я думаю, что это более эффективно, чем другие предложения, потому что <code>GetValues()</code> не вызывается каждый раз, когда у вас есть цикл. Это также более кратко. И вы получите ошибку во время компиляции, а не исключение времени выполнения, если <code>Suit</code> не является <code>enum</code> .
zh_cn: 我认为这比其他建议更有效，因为每次有循环时不会调用 <code>GetValues()</code> 。 这也更加简洁。 而且，如果 <code>Suit</code> 不是 <code>enum</code> ，则会得到编译时错误，而不是运行时异常。

source: I think you can use
es: Creo que puedes usar
ja: を使うことができると思います。
ko: 나는 당신이 사용할 수 있다고 생각
ru: Я думаю,ты можешь использовать
zh_cn: 我想你可以用

source: I tried many ways and got the result from this code:
es: Lo intenté de muchas maneras y obtuve el resultado de este código:
ja: いろいろと試してみたのですが、このコードで結果が出ました。
ko: 나는 여러 가지 방법을 시도 했고이 코드에서 결과를 얻었습니다.
ru: Я перепробовал много способов и получил результат от этого кода:
zh_cn: 我试了很多方法,都是通过这个代码得到的结果。

source: I use ToString() then split and parse the spit array in flags.
es: Utilizo ToString()y luego separo y analizo la matriz de escupitajos en banderas.
ja: 私はToString()を使用して、フラグでスピット配列を分割してパースしています。
ko: ToString ()을 사용하고 spit 배열을 플래그로 분할하고 구문 분석합니다.
ru: Я использую ToString(),затем разделяю и разбираю массив слюны во флагах.
zh_cn: 我使用ToString(),然后在flags中分割并解析吐出数组。

source: I would use <code>Enum.GetValues(typeof(Suit))</code> instead.
es: En su lugar, usar&iacute;a <code>Enum.GetValues(typeof(Suit))</code> .
ja: 代わりに <code>Enum.GetValues(typeof(Suit))</code> を使用します。
ko: 대신 <code>Enum.GetValues(typeof(Suit))</code> 사용합니다.
ru: Я бы использовал <code>Enum.GetValues(typeof(Suit))</code> вместо этого.
zh_cn: 我会改用 <code>Enum.GetValues(typeof(Suit))</code> 。

source: I've heard vague rumours that this is terifically slow. Anyone know? &ndash; Orion Edwards Oct 15 '08 at 1:31 7
es: He escuchado vagos rumores de que esto es terriblemente lento. &iquest;Nadie sabe? - Orion Edwards Oct 15 '08 a las 1:31 7
ja: これは非常に遅いという漠然とした噂を聞いたことがあります。 誰か知ってる？ &ndash;オリオンエドワーズ2008年10月15日1:31 7
ko: 나는 이것이 상당히 느리다는 모호한 소문을 들었다. 누구 알아? &ndash; Orion Edwards 2008 년 10 월 15 일 1시 31 분 7
ru: Я слышал смутные слухи, что это очень медленно. Кто-нибудь знает? - Орион Эдвардс 15 октября 2008 года в 1:31 7
zh_cn: 我听过模糊的传言，说这太慢了。 有人知道吗 &ndash; Orion Edwards 08年10月15日在1:31 7

source: If anyone knows how to get rid of the <code>T valueType = new T()</code>, I'd be happy to see a solution.
es: Si alguien sabe c&oacute;mo deshacerse de <code>T valueType = new T()</code> , me encantar&iacute;a ver una soluci&oacute;n.
ja: <code>T valueType = new T()</code> を取り除く方法を知っている人がいれば、解決策を見つけたいと思います。
ko: 누구든지 <code>T valueType = new T()</code> 제거하는 방법을 알고 있다면 해결책을 보게되어 기쁩니다.
ru: Если кто-нибудь знает, как избавиться от <code>T valueType = new T()</code> , я был бы рад увидеть решение.
zh_cn: 如果有人知道如何摆脱 <code>T valueType = new T()</code> ，我将很高兴看到一个解决方案。

source: If enum values are contiguous and you can provide the first and last element of the enum, then:
es: Si los valores enum son contiguos y se puede proporcionar el primer y último elemento del enum,entonces:
ja: 列挙型の値が連続していて、列挙型の最初の要素と最後の要素を提供できる場合は
ko: 열거 형 값이 연속적이고 열거 형의 첫 번째 요소와 마지막 요소를 제공 할 수있는 경우 :
ru: Если значения перечисления совпадают и вы можете указать первый и последний элемент перечисления,то:
zh_cn: 如果枚举值是连续的,并且可以提供枚举的第一个和最后一个元素,那么。
