Repository: rueisnom/feedback
Catalog: xlf/28/01/97/93/28019793.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The advantage of option 1 is that you are strongly typing the view to your model, but it means making a call to the server each time you add a new item. The advantage of option 2 is that its all done client side, but if you make any changes to you model (e.g. add a validation attribute to a property) then you also need to manually update the html, making maintenance a bit harder.
es: La ventaja de la opción 1 es que estás tecleando fuertemente la vista a tu modelo,pero significa hacer una llamada al servidor cada vez que añades un nuevo elemento.La ventaja de la opción 2 es que ya está todo hecho en el lado del cliente,pero si haces algún cambio en tu modelo (por ejemplo,añadir un atributo de validación a una propiedad)entonces también necesitas actualizar manualmente el html,haciendo el mantenimiento un poco más difícil.
ja: オプション1の利点は、モデルにビューを強く入力することですが、新しいアイテムを追加するたびにサーバーへの呼び出しを行うことを意味します。オプション2の利点は、すべてクライアント側で行われることですが、モデルに変更を加えた場合(例えば、プロパティにバリデーション属性を追加するなど)、手動でhtmlを更新する必要があり、メンテナンスが少し難しくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">옵션 1의 장점은 모델에보기를 강력하게 입력한다는 것입니다. 그러나 새 항목을 추가 할 때마다 서버를 호출합니다. </font><font style="vertical-align: inherit;">옵션 2의 장점은 모든 클라이언트 측에서 수행되지만 모델을 변경하는 경우 (예 : 속성에 유효성 검사 속성 추가) HTML을 수동으로 업데이트해야하기 때문에 유지 관리가 조금 더 어려워집니다.</font></font>
ru: Преимущество варианта 1 заключается в том,что вы сильно набираете вид для вашей модели,но это означает звонок на сервер каждый раз,когда вы добавляете новый элемент.Преимущество варианта 2 заключается в том,что все это делается на клиентской стороне,но если вы вносите какие-либо изменения в свою модель (например,добавляете атрибут валидации в свойство),то вам также необходимо вручную обновить html,что немного усложняет обслуживание.
zh_cn: 选项1的优点是,你可以将视图输入到模型中,但这意味着每次添加一个新的项目时都要调用服务器。选项2的好处是,它是在客户端完成的,但如果你对模型做了任何修改(例如,在属性中添加一个验证属性),那么你还需要手动更新html,这使得维护起来有点困难。

source: Two possible approaches to your issue.
es: Dos posibles enfoques de su problema.
ja: あなたの問題に対する2つの可能なアプローチ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제에 대한 두 가지 가능한 접근 방식.</font></font>
ru: Два возможных подхода к вашему вопросу.
zh_cn: 对于你的问题,有两种可能的方法。

source: Use the <a href="https://github.com/danludwig/BeginCollectionItem">BeginItemCollection</a> helper for your partial view. This helper will render a hidden input for the <code>Index</code> value based on a GUID. You need this in both the partial view and the loop where you render existing items. Your partial would look something like
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use el </font><font style="vertical-align: inherit;">ayudante </font></font><a href="https://github.com/danludwig/BeginCollectionItem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginItemCollection</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para su vista parcial. </font><font style="vertical-align: inherit;">Este asistente representar&aacute; una entrada oculta para el </font><font style="vertical-align: inherit;">valor </font><font style="vertical-align: inherit;">del </font></font> <code>Index</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funci&oacute;n de un GUID. </font><font style="vertical-align: inherit;">Necesita esto tanto en la vista parcial como en el bucle donde representa los elementos existentes. </font><font style="vertical-align: inherit;">Tu parcial se ver&iacute;a algo as&iacute;</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">部分ビューに</font><font style="vertical-align: inherit;">は</font></font><a href="https://github.com/danludwig/BeginCollectionItem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginItemCollection</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヘルパーを</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">このヘルパーは</font><font style="vertical-align: inherit;">、GUIDに基づいて</font><font style="vertical-align: inherit;">、</font></font> <code>Index</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値の</font><font style="vertical-align: inherit;">非表示の入力をレンダリング</font><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">これは、部分ビューと、既存のアイテムをレンダリングするループの両方で必要です。</font><font style="vertical-align: inherit;">あなたの部分は次のようになります</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부분보기에 </font></font><a href="https://github.com/danludwig/BeginCollectionItem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginItemCollection</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도우미를 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 도우미는 </font><font style="vertical-align: inherit;">GUID를 기반으로 </font></font> <code>Index</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값에 </font><font style="vertical-align: inherit;">대한 숨겨진 입력을 렌더링합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">기존 항목을 렌더링하는 부분보기와 루프 모두에서이를 필요로합니다. </font><font style="vertical-align: inherit;">당신의 부분은 다음과 같이 보일 것입니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font><font style="vertical-align: inherit;">помощник </font></font><a href="https://github.com/danludwig/BeginCollectionItem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginItemCollection</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для частичного просмотра. </font><font style="vertical-align: inherit;">Этот помощник будет отображать скрытый ввод для </font><font style="vertical-align: inherit;">значения </font></font> <code>Index</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на основе GUID. </font><font style="vertical-align: inherit;">Это необходимо как в частичном представлении, так и в цикле, в котором вы визуализируете существующие элементы. </font><font style="vertical-align: inherit;">Ваш частичный будет выглядеть примерно так</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font><a href="https://github.com/danludwig/BeginCollectionItem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginItemCollection</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">帮助器用于部分视图。</font><font style="vertical-align: inherit;">该帮助器将</font><font style="vertical-align: inherit;">基于GUID </font><font style="vertical-align: inherit;">呈现</font></font> <code>Index</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值</font><font style="vertical-align: inherit;">的隐藏输入</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在局部视图和渲染现有项目的循环中都需要这样做。</font><font style="vertical-align: inherit;">你的局部看起来像</font></font>

source: Your problem is that the partial renders html based on a single <code>AdminProductDetailModel</code> object, yet you are trying to post back a collection. When you dynamically add a new object you continue to add duplicate controls that look like <code>&lt;input name="productTotalQuantity" ..&gt;</code> (this is also creating invalid html because of the duplicate <code>id</code> attributes) where as they need to be <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code>, <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> etc. in order to bind to a collection on post back.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Su problema es que el html de renderizado parcial se basa en un solo </font><font style="vertical-align: inherit;">objeto </font></font> <code>AdminProductDetailModel</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero est&aacute; intentando publicar una colecci&oacute;n. Cuando agrega din&aacute;micamente un nuevo objeto, contin&uacute;a agregando controles duplicados que se parecen a </font></font> <code>&lt;input name="productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (esto tambi&eacute;n est&aacute; creando html no v&aacute;lido debido a los </font><font style="vertical-align: inherit;">atributos de </font></font> <code>id</code> entificaci&oacute;n<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> duplicados </font><font style="vertical-align: inherit;">) donde, como deben ser, </font></font> <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> etc. para enlazar a una colecci&oacute;n en la publicaci&oacute;n posterior.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題は、単一の</font></font> <code>AdminProductDetailModel</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトに</font><font style="vertical-align: inherit;">基づいて部分的にHTMLをレンダリングする</font><font style="vertical-align: inherit;">ことですが、コレクションを</font><font style="vertical-align: inherit;">ポストバック</font><font style="vertical-align: inherit;">しようとしています。あなたが動的に新しいオブジェクトを追加するとき、あなたはそのように見える重複コントロールを追加していき</font></font> <code>&lt;input name="productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font><font style="vertical-align: inherit;">これもあるため、重複の無効なHTMLを作成している</font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、彼らがする必要があるとして、どこ属性）</font></font> <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">など。</font><font style="vertical-align: inherit;">ポストバック時に</font><font style="vertical-align: inherit;">コレクションにバインドします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제는 부분적으로 단일 </font></font> <code>AdminProductDetailModel</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체를 </font><font style="vertical-align: inherit;">기반으로 html을 렌더링 </font><font style="vertical-align: inherit;">하지만 컬렉션을 다시 게시하려고한다는 것입니다. 새 객체를 동적으로 추가 할 때 </font></font> <code>&lt;input name="productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (이것은 중복 </font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성으로 </font><font style="vertical-align: inherit;">인해 유효하지 않은 HTML을 생성 함) </font><font style="vertical-align: inherit;">처럼 보이는 </font></font> <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등을 통해 포스트 백에서 콜렉션에 바인드합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ваша проблема заключается в том, что частичное </font></font> <code>AdminProductDetailModel</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> html основано на одном </font><font style="vertical-align: inherit;">объекте </font><font style="vertical-align: inherit;">AdminProductDetailModel</font><font style="vertical-align: inherit;"> , но вы пытаетесь отправить обратно коллекцию. Когда вы динамически добавляете новый объект, вы продолжаете добавлять дубликаты элементов управления, которые выглядят как </font></font> <code>&lt;input name="productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (это также создает недопустимый html из-за дублированных </font><font style="vertical-align: inherit;">атрибутов </font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), где они должны быть </font></font> <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д., Чтобы связать коллекцию с обратной связью.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您的问题是部分渲染基于单个</font></font> <code>AdminProductDetailModel</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象的</font><font style="vertical-align: inherit;">html </font><font style="vertical-align: inherit;">，但是您尝试回发一个集合。动态添加新对象时，您将继续添加看起来像</font></font> <code>&lt;input name="productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重复控件</font><font style="vertical-align: inherit;">（由于</font></font> <code>id</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font><font style="vertical-align: inherit;">重复，这也会创建无效的html </font><font style="vertical-align: inherit;">），因此需要将它们作为</font></font> <code>&lt;input name="[0].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>&lt;input name="[1].productTotalQuantity" ..&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等，以便在回发时绑定到集合。</font></font>
