Repository: rueisnom/feedback
Catalog: xlf/28/01/97/93/28019793.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>Option 1</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Opci&oacute;n 1</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプション1</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">옵션 1</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Опция 1</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选项1</font></font></strong>

source: <strong>Option 2</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">opcion 2</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オプション2</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">옵션 2</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вариант 2</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选项2</font></font></strong>

source: And of course you need to change you POST method to accept a collection
es: Y por supuesto tienes que cambiar tu método POST para aceptar una colección
ja: そしてもちろん、コレクションを受け入れるように POST メソッドを変更する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 컬렉션을 수락하려면 POST 메소드를 변경해야합니다.</font></font>
ru: И,конечно же,вам нужно изменить метод POST,чтобы принять коллекцию.
zh_cn: 当然,你还需要改变你的POST方法来接受一个集合。

source: Finally, if you are using client side validation (jquery-validate-unobtrusive.js), then you need re-parse the validator each time you add new elements to the DOM as explained in <a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591">this answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Finalmente, si est&aacute; utilizando la validaci&oacute;n del lado del cliente (jquery-validate-unobtrusive.js), entonces debe volver a analizar el validador cada vez que agregue nuevos elementos al DOM como se explica en </font></font><a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最後に、クライアント側の検証（jquery-validate-unobtrusive.js）を使用している場合は、</font></font><a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この回答で</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明されているように、DOMに新しい要素を追加するたびにバリデーターを再解析する必要があり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막으로 클라이언트 측 유효성 검사 (jquery-validate-unobtrusive.js)를 사용하는 </font></font><a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우이 답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 설명한대로 DOM에 새 요소를 추가 할 때마다 유효성 검사기를 다시 구문 분석해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наконец, если вы используете проверку на стороне клиента (jquery-validate-unobtrusive.js), то вам необходимо повторно анализировать валидатор каждый раз, когда вы добавляете новые элементы в DOM, как объяснено в </font></font><a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом ответе</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最后，如果您正在使用客户端验证（jquery-validate-unobtrusive.js），则每次将新元素添加到DOM时都需要重新解析验证器，如</font></font><a href="https://stackoverflow.com/questions/26542509/validate-dynamically-added-fields/26542591#26542591"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本答案所述</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: I have added a button in my view. When this button is clicked partial view is added. In my form I can add as much partial view as I can. When Submitting this form data I am unable to send all the partial view data to controller. I have made a different model having all the attributes and I have made a list of that model to my main model. Can anyone please give me some trick so that I can send all the partial view content to my controller?
es: He añadido un botón en mi vista.Cuando se hace clic en este botón se añade una vista parcial.En mi formulario puedo añadir tanta vista parcial como pueda.Al enviar los datos de este formulario no puedo enviar todos los datos de la vista parcial al controlador.He hecho un modelo diferente que tiene todos los atributos y he hecho una lista de ese modelo a mi modelo principal.¿Alguien puede darme algún truco para que pueda enviar todo el contenido de la vista parcial a mi controlador?
ja: 私のビューにボタンを追加しました。このボタンをクリックすると部分表示が追加されます。私のフォームでは、部分表示をいくらでも追加することができます。このフォームデータを送信するときに、すべての部分表示データをコントローラに送信することができません。私はすべての属性を持つ別のモデルを作成し、そのモデルのリストを私のメインモデルに作成しました。部分ビューの内容をすべてコントローラに送信できるようにするためのコツを誰か教えてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내보기에 버튼을 추가했습니다. </font><font style="vertical-align: inherit;">이 버튼을 클릭하면 부분보기가 추가됩니다. </font><font style="vertical-align: inherit;">내 양식에서 나는 가능한 한 많은 부분보기를 추가 할 수 있습니다. </font><font style="vertical-align: inherit;">이 양식 데이터를 제출할 때 모든 부분보기 데이터를 컨트롤러로 보낼 수 없습니다. </font><font style="vertical-align: inherit;">모든 속성을 가진 다른 모델을 만들었으며 해당 모델 목록을 기본 모델로 만들었습니다. </font><font style="vertical-align: inherit;">누구나 일부 부분보기 내용을 컨트롤러에 보낼 수 있도록 트릭을 줄 수 있습니까?</font></font>
ru: Я добавил кнопку на мой взгляд.При нажатии на эту кнопку добавляется частичный вид.В моей форме я могу добавить как можно больше частичного вида.При отправке данных этой формы я не могу отправить все данные частичного вида контроллеру.Я создал другую модель,имеющую все атрибуты,и составил список этой модели для своей основной модели.Может ли кто-нибудь,пожалуйста,дать мне какой-нибудь трюк,чтобы я мог отправить все данные частичного вида на контроллер?
zh_cn: 我的视图中添加了一个按钮。当这个按钮被点击后,部分视图被添加。在我的表单中,我可以添加尽可能多的部分视图。当提交这个表单数据时,我无法将所有的部分视图数据发送给控制器。我做了一个不同的模型,它有所有的属性,我已经做了一个模型的列表到我的主模型。谁能给我一些小窍门,让我把所有的部分视图内容发送到我的控制器?

source: In My View
es: En mi opinión
ja: 私の見解では
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 관점에서</font></font>
ru: На мой взгляд
zh_cn: 在我看来

source: In My controller
es: En mi controlador
ja: マイコントローラで
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 컨트롤러에서</font></font>
ru: В моем контроллере
zh_cn: 在 "我的控制器 "中

source: In my Partial View
es: En mi vista parcial
ja: 私のパーシャルビューでは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 부분보기에서</font></font>
ru: В моем частичном представлении
zh_cn: 在我的部分视图中

source: Manually create the html elements representing a new object with a 'fake' indexer, place them in a hidden container, then in the Add button event, clone the html, update the indexers and Index value and append the cloned elements to the DOM. To make sure the html is correct, create one default object in a <code>for</code> loop and inspect the html it generates. An example of this approach is shown in <a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152">this answer</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cree manualmente los elementos html que representan un nuevo objeto con un indexador 'falso', col&oacute;quelos en un contenedor oculto, luego en el evento Agregar bot&oacute;n, clone el html, actualice los indexadores y el valor del &iacute;ndice y agregue los elementos clonados al DOM. </font><font style="vertical-align: inherit;">Para asegurarse de que el html es correcto, cree un objeto predeterminado en un </font><font style="vertical-align: inherit;">bucle </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e inspeccione el html que genera. </font><font style="vertical-align: inherit;">Un ejemplo de este enfoque se muestra en </font></font><a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta respuesta</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「偽の」インデクサーを使用して新しいオブジェクトを表すhtml要素を手動で作成し、それらを非表示のコンテナーに配置します。次に、[追加]ボタンイベントで、htmlを複製し、インデクサーとインデックス値を更新して、複製した要素をDOMに追加します。</font><font style="vertical-align: inherit;">htmlが正しいことを確認するには、</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループ</font><font style="vertical-align: inherit;">で1つのデフォルトオブジェクトを作成し、</font><font style="vertical-align: inherit;">それが生成するhtmlを調べます。</font><font style="vertical-align: inherit;">このアプローチの例は、</font><a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152"><font style="vertical-align: inherit;">この回答に</font></a><font style="vertical-align: inherit;">示され</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ています</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'가짜'인덱서를 사용하여 새 객체를 나타내는 html 요소를 수동으로 작성하고 숨겨진 컨테이너에 배치 한 다음 추가 단추 이벤트에서 html을 복제하고 인덱서 및 색인 값을 업데이트하고 복제 된 요소를 DOM에 추가하십시오. </font><font style="vertical-align: inherit;">html이 올바른지 확인하려면 </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루프 </font><font style="vertical-align: inherit;">에서 하나의 기본 객체를 만들고 </font><font style="vertical-align: inherit;">생성 된 html을 검사하십시오. </font><font style="vertical-align: inherit;">이 접근법의 </font></font><a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예가이 답변에 나와 있습니다.</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вручную создайте элементы html, представляющие новый объект с помощью &laquo;поддельного&raquo; индексатора, поместите их в скрытый контейнер, затем в событии кнопки &laquo;Добавить&raquo;, клонируйте HTML, обновите индексаторы и значение индекса и добавьте клонированные элементы в DOM. </font><font style="vertical-align: inherit;">Чтобы убедиться, что html верен, создайте один объект по умолчанию в </font><font style="vertical-align: inherit;">цикле </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и проверьте html, который он генерирует. </font><font style="vertical-align: inherit;">Пример такого подхода показан в </font></font><a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом ответе</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用&ldquo;假&rdquo;索引器手动创建代表新对象的html元素，将它们放置在隐藏的容器中，然后在&ldquo;添加&rdquo;按钮事件中克隆html，更新索引器和Index值，然后将克隆的元素附加到DOM。</font><font style="vertical-align: inherit;">为确保html正确，请在</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">循环中</font><font style="vertical-align: inherit;">创建一个默认对象，</font><font style="vertical-align: inherit;">然后检查它生成的html。</font><a href="https://stackoverflow.com/questions/24026374/adding-another-pet-to-a-model-form/24027152#24027152"><font style="vertical-align: inherit;">此答案中</font></a><font style="vertical-align: inherit;">显示了此方法的一个示例</font></font><font style="vertical-align: inherit;"></font>

source: Note the use of a 'fake' indexer to prevent this one being bound on post back ('#' and '%' wont match up so they are ignored by the <code>DefaultModelBinder</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta el uso de un indexador 'falso' para evitar que este se vincule en la publicaci&oacute;n posterior ('#' y '%' no coincidir&aacute;n, por lo que </font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> los </font><font style="vertical-align: inherit;">ignorar&aacute;</font><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これが</font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にバインドされるのを防ぐために「偽の」インデクサーを使用していることに注意してください（「＃」と「％」は一致しないため、これらは</font><font style="vertical-align: inherit;">DefaultModelBinder</font><font style="vertical-align: inherit;">によって無視され</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">포스트 백에 바인딩되는 것을 방지하기 위해 '가짜'인덱서를 사용하십시오 ( '#'와 '%'는 일치하지 않으므로 </font></font> <code>DefaultModelBinder</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의해 무시됩니다 </font><font style="vertical-align: inherit;">)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание на использование &laquo;фальшивого&raquo; индексатора для предотвращения его привязки к обратной записи (&laquo;#&raquo; и &laquo;%&raquo; не совпадают, поэтому </font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> их игнорирует </font><font style="vertical-align: inherit;">)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，使用&ldquo;假&rdquo;索引器来防止此索引器回发绑定（&ldquo;＃&rdquo;和&ldquo;％&rdquo;将不匹配，因此</font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会忽略它们</font><font style="vertical-align: inherit;">）</font></font>

source: Submit same Partial View called multiple times data to controller
es: Presentar la misma vista parcial llamada datos de múltiples veces al controlador
ja: 同じパーシャルビューを複数回呼び出してコントローラにデータを送信する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 번 호출 된 동일한 부분 뷰 데이터를 컨트롤러에 제출</font></font>
ru: Отправьте один и тот же частичный просмотр,вызванный многократными данными в контроллер.
zh_cn: 提交相同的部分视图多次调用数据给控制器

source: The <code>DefaultModelBinder</code> required that the indexer for collection items start at zero and be consecutive, or that the form values include a <code>Index=someValue</code> where the indexer is <code>someValue</code> (for example <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code>. This is explained in detail in Phil Haack's article <a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/">Model Binding To A List</a>. Using the Index approach is generally better because it also allows you to delete items from the list (otherwise it would be necessary to rename all existing controls so the indexer is consecutive).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> requiere que el indexador para los art&iacute;culos de colecci&oacute;n se inicia en cero y ser consecutivos, o que los valores del formulario incluye un </font></font> <code>Index=someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> donde el indexador es </font></font> <code>someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (por ejemplo, </font></font> <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Esto se explica en detalle en el art&iacute;culo de Phil Haack Enlace de </font></font><a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">modelo a una lista</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Usar el enfoque de &iacute;ndice es generalmente mejor porque tambi&eacute;n le permite eliminar elementos de la lista (de lo contrario, ser&iacute;a necesario cambiar el nombre de todos los controles existentes para que el indexador sea consecutivo).</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>DefaultModelBinder</code> は、<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コレクションアイテムのインデクサがゼロで開始し、連続して、またはフォームの値が含まれていることことが必要</font></font> <code>Index=someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インデクサは</font></font> <code>someValue</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（例えば</font></font> <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。これは、Phil Haackの記事</font></font><a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「リストへのモデルのバインド</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">で詳細に説明されてい</font><font style="vertical-align: inherit;">ます。リストから項目を削除することもできるので、インデックスアプローチを使用する方が一般に優れています（そうしないと、インデクサーが連続するように、すべての既存のコントロールの名前を変更する必要があります）。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>DefaultModelBinder</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수집 항목 인덱서는 0에서 시작하고 연속적 일 또는 양식 값이 포함되어 있다는 것이 요구 </font></font> <code>Index=someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인덱서는 </font></font> <code>someValue</code> 와<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (예를 들어 </font></font> <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 내용은 Phil Haack 기사 </font></font><a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model Binding to A List</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 자세히 설명되어 </font><font style="vertical-align: inherit;">있지만 일반적으로 Index 접근 방식을 사용하면 목록에서 항목을 삭제할 수 있으므로 더 좋습니다. 인덱서가 연속적이므로 모든 기존 컨트롤의 이름을 바꾸는 데 필요합니다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> требуется, чтобы индексатор для элементов коллекции начинаются с нуля и быть последовательными, или что значения формы включают в </font><font style="vertical-align: inherit;">себя </font></font> <code>Index=someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , где индексатор </font></font> <code>someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (например , </font></font> <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Это подробно объясняется в статье Фила Хаака &laquo; </font></font><a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Привязка модели к списку&raquo;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Использование подхода &laquo;Индекс&raquo;, как правило, лучше, поскольку позволяет также удалять элементы из списка (в противном случае это будет необходимо переименовать все существующие элементы управления, чтобы индексатор работал последовательно).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所述</font></font> <code>DefaultModelBinder</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要求用于集合项索引从零开始并且是连续的，或者说，表格值包括</font></font> <code>Index=someValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其中该索引是</font></font> <code>someValue</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（例如</font></font> <code>&lt;input name="[ABC].productTotalQuantity" ..&gt;&lt;input name="Index" value="ABC"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。这在Phil Haack的文章</font></font><a href="http://haacked.com/archive/2008/10/23/model-binding-to-a-list.aspx/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Model Binding to A List</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中有详细说明</font><font style="vertical-align: inherit;">。使用Index方法通常更好，因为它还允许您从列表中删除项目（否则可以需要重命名所有现有控件，以便索引器是连续的）。</font></font>
