Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: "Pretty links" is an often requested topic, but it is rarely fully explained. <a href="https://en.wikipedia.org/wiki/URL_redirection#Apache_HTTP_Server_mod_rewrite">mod_rewrite</a> is one way to make "pretty links", but it's complex and its syntax is very terse, hard to grok, and the documentation assumes a certain level of proficiency in HTTP. Can someone explain in simple terms how "pretty links" work and how mod_rewrite can be used to create them?
ja: 「かわいらしいリンク」は頻繁に要求されるトピックですが、完全に説明されることはほとんどありません。 <a href="https://en.wikipedia.org/wiki/URL_redirection#Apache_HTTP_Server_mod_rewrite">mod_rewrite</a>は「かわいらしいリンク」を作成する1つの方法ですが、複雑で、構文は非常に簡潔であり、理解するのが難しく、ドキュメントはHTTPのある程度の熟練度を前提としています。 「きれいなリンク」がどのように機能し、mod_rewriteを使用してリンクを作成できるかを誰かが簡単に説明できますか？
ko: "예쁜 링크"는 자주 요청되는 주제이지만 그에 대한 설명은 거의 없습니다. <a href="https://en.wikipedia.org/wiki/URL_redirection#Apache_HTTP_Server_mod_rewrite">mod_rewrite</a> 는 "예쁜 링크"를 만드는 한 가지 방법이지만, 복잡하고 구문이 매우 간결하고 이해하기 어려우며이 문서는 HTTP의 특정 수준의 숙련도를 가정합니다. 누군가 "예쁜 링크"가 어떻게 작동하는지 mod_rewrite를 사용하여 어떻게 만들 수 있는지 간단한 용어로 설명 할 수 있습니까?
ru: &laquo;Красивые ссылки&raquo; - часто запрашиваемая тема, но она редко полностью объясняется. <a href="https://en.wikipedia.org/wiki/URL_redirection#Apache_HTTP_Server_mod_rewrite">mod_rewrite</a> - это один из способов создания &laquo;симпатичных ссылок&raquo;, но он сложный и его синтаксис очень лаконичен, его сложно найти, а документация предполагает определенный уровень владения HTTP. Может кто-нибудь объяснить простыми словами, как работают "красивые ссылки" и как mod_rewrite может использоваться для их создания?
zh_cn: &ldquo;漂亮的链接&rdquo;是一个经常要求的主题，但是很少对其进行充分解释。 <a href="https://en.wikipedia.org/wiki/URL_redirection#Apache_HTTP_Server_mod_rewrite">mod_rewrite</a>是创建&ldquo;漂亮链接&rdquo;的一种方法，但是它很复杂，语法非常简洁，难以理解，并且文档假定HTTP具备一定的熟练程度。 有人可以简单地解释&ldquo;漂亮链接&rdquo;如何工作以及如何使用mod_rewrite创建它们吗？

source: "Removing" the PHP extension
ja: "PHPの拡張機能を削除する"
ko: PHP 확장 "제거"
ru: "Удаление" расширения PHP
zh_cn: "删除 "PHP扩展

source: &middot; <a href="https://stackoverflow.com/questions/234723/generic-htaccess-redirect-www-to-non-www">Generic htaccess redirect www to non-www</a>
ja: ・<a href="https://stackoverflow.com/questions/234723/generic-htaccess-redirect-www-to-non-www">一般的なhtaccessはwwwをwww以外にリダイレクトします</a>
ko: &middot; <a href="https://stackoverflow.com/questions/234723/generic-htaccess-redirect-www-to-non-www">일반 htaccess를 www가 아닌 ​​www로 리디렉션</a>
ru: &middot; <a href="https://stackoverflow.com/questions/234723/generic-htaccess-redirect-www-to-non-www">Общий htaccess перенаправить www на не-www</a>
zh_cn: &middot; <a href="https://stackoverflow.com/questions/234723/generic-htaccess-redirect-www-to-non-www">通用htaccess将www重定向到非www</a>

source: &middot; <a href="https://stackoverflow.com/questions/3634101/url-rewriting-for-different-protocols-in-htaccess">URL rewriting for different protocols in .htaccess</a>
ja: ・<a href="https://stackoverflow.com/questions/3634101/url-rewriting-for-different-protocols-in-htaccess">.htaccessのさまざまなプロトコルのURL書き換え</a>
ko: &middot; <a href="https://stackoverflow.com/questions/3634101/url-rewriting-for-different-protocols-in-htaccess">.htaccess의 다른 프로토콜에 대한 URL 재 작성</a>
ru: &middot; <a href="https://stackoverflow.com/questions/3634101/url-rewriting-for-different-protocols-in-htaccess">Перезапись URL для разных протоколов в .htaccess</a>
zh_cn: &middot; <a href="https://stackoverflow.com/questions/3634101/url-rewriting-for-different-protocols-in-htaccess">.htaccess中不同协议的URL重写</a>

source: &middot; <a href="https://stackoverflow.com/questions/4916222/htaccess-how-to-force-www-in-a-generic-way">.htaccess - how to force "www." in a generic way?</a>
ja: ・<a href="https://stackoverflow.com/questions/4916222/htaccess-how-to-force-www-in-a-generic-way">.htaccess-「www」を強制する方法</a> 一般的な方法で？
ko: &middot; <a href="https://stackoverflow.com/questions/4916222/htaccess-how-to-force-www-in-a-generic-way">.htaccess- "www"를 강제하는 방법</a> 일반적인 방법으로?
ru: &middot; <a href="https://stackoverflow.com/questions/4916222/htaccess-how-to-force-www-in-a-generic-way">.Htaccess - как заставить "www."</a> в общем?
zh_cn: &middot; <a href="https://stackoverflow.com/questions/4916222/htaccess-how-to-force-www-in-a-generic-way">.htaccess-如何强制使用&ldquo; www&rdquo;。</a> 以一般的方式？

source: &middot; <a href="https://stackoverflow.com/questions/9153262/tips-for-debugging-htaccess-rewrite-rules">Tips for debugging .htaccess rewrite rules</a>
ja: ・<a href="https://stackoverflow.com/questions/9153262/tips-for-debugging-htaccess-rewrite-rules">.htaccess書き換えルールをデバッグするためのヒント</a>
ko: &middot; <a href="https://stackoverflow.com/questions/9153262/tips-for-debugging-htaccess-rewrite-rules">.htaccess 재 작성 규칙 디버깅 팁</a>
ru: &middot; <a href="https://stackoverflow.com/questions/9153262/tips-for-debugging-htaccess-rewrite-rules">Советы по отладке правил перезаписи .htaccess</a>
zh_cn: &middot; <a href="https://stackoverflow.com/questions/9153262/tips-for-debugging-htaccess-rewrite-rules">调试.htaccess重写规则的提示</a>

source: &middot; <a href="https://stackoverflow.com/questions/945047/htaccess-not-working-mod-rewrite">.htaccess not working (mod_rewrite)</a>
ja: ・<a href="https://stackoverflow.com/questions/945047/htaccess-not-working-mod-rewrite">.htaccessが機能しない（mod_rewrite）</a>
ko: &middot; <a href="https://stackoverflow.com/questions/945047/htaccess-not-working-mod-rewrite">.htaccess가 작동하지 않습니다 (mod_rewrite)</a>
ru: &middot; <a href="https://stackoverflow.com/questions/945047/htaccess-not-working-mod-rewrite">.Htaccess не работает (mod_rewrite)</a>
zh_cn: &middot; <a href="https://stackoverflow.com/questions/945047/htaccess-not-working-mod-rewrite">.htaccess不起作用（mod_rewrite）</a>

source: &middot; Note that the leading slash is still correct in <code>&lt;VirtualHost&gt;</code> sections though. Which is why you often see it <code>^/?</code> optionalized for rule parity.
ja: ・ただし、 <code>&lt;VirtualHost&gt;</code> セクションの先頭のスラッシュは引き続き正しいことに注意してください。 よく見かけるのはこのためです <code>^/?</code> ルールのパリティのためにオプション化されました。
ko: <code>&lt;VirtualHost&gt;</code> 섹션에서 선행 슬래시는 여전히 옳습니다. 왜 당신은 종종 <code>^/?</code> 규칙 패리티에 대해 선택적입니다.
ru: &middot; Обратите внимание, что начальная косая черта все еще корректна в разделах <code>&lt;VirtualHost&gt;</code> . Вот почему вы часто видите это <code>^/?</code> необязательный для паритета правила.
zh_cn: &middot;请注意，尽管 <code>&lt;VirtualHost&gt;</code> 部分中的斜杠仍然是正确的。 这就是为什么您经常看到它的原因 <code>^/?</code> 可选用于规则奇偶校验。

source: &middot; Or when using a <code>RewriteCond %{REQUEST_URI}</code> you'd still match for a leading <code>/</code>.
ja: ・または、 <code>RewriteCond %{REQUEST_URI}</code> を使用する場合でも、先頭の <code>/</code> と一致します。
ko: 또는 <code>RewriteCond %{REQUEST_URI}</code> 를 사용하는 경우에도 선행 <code>/</code> 과 일치합니다.
ru: &middot; Или при использовании <code>RewriteCond %{REQUEST_URI}</code> вы все равно подходите для ведущего <code>/</code> .
zh_cn: &middot;或者，当使用 <code>RewriteCond %{REQUEST_URI}</code> 您仍然会匹配前导 <code>/</code> 。

source: &middot; See also <a href="https://webmasters.stackexchange.com/questions/27118/when-is-the-leading-slash-needed-in-mod-rewrite-patterns">Webmaster.SE: When is the leading slash (/) needed in mod_rewrite patterns?</a>
ja: ・<a href="https://webmasters.stackexchange.com/questions/27118/when-is-the-leading-slash-needed-in-mod-rewrite-patterns">Webmaster.SE</a>も参照してください：mod_rewriteパターンで先頭のスラッシュ（/）が必要になるのはいつですか？
ko: &middot; <a href="https://webmasters.stackexchange.com/questions/27118/when-is-the-leading-slash-needed-in-mod-rewrite-patterns">Webmaster.SE</a> 참고 : mod_rewrite 패턴에서 선행 슬래시 (/)는 언제 필요합니까?
ru: &middot; См. Также <a href="https://webmasters.stackexchange.com/questions/27118/when-is-the-leading-slash-needed-in-mod-rewrite-patterns">Webmaster.SE: когда требуется начальная косая черта (/) в шаблонах mod_rewrite?</a>
zh_cn: &middot;另请参阅<a href="https://webmasters.stackexchange.com/questions/27118/when-is-the-leading-slash-needed-in-mod-rewrite-patterns">Webmaster.SE：什么时候在mod_rewrite模式中需要使用斜杠（/）？</a>

source: <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#scriptaliasmatch"><code>ScriptAliasMatch</code></a> is primarily for CGI scripts, but also ought to works for PHP. It allows regexps just like any <code>RewriteRule</code>. In fact it's perhaps the most robust option to configurate a catch-all front controller.
ja: <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#scriptaliasmatch"> <code>ScriptAliasMatch</code> </a>は主にCGIスクリプト用ですが、PHPでも機能するはずです。 RewriteRuleと同じように正規表現を使用できます。 実際、それはおそらく、すべてを網羅するフロントコントローラーを構成するための最も堅牢なオプションでしょう。
ko: <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#scriptaliasmatch"> <code>ScriptAliasMatch</code> </a> 는 주로 CGI 스크립트 용이지만 PHP에서도 작동합니다. <code>RewriteRule</code> 과 마찬가지로 정규 표현식을 허용합니다. 실제로 모든 전면 컨트롤러를 구성하는 것이 가장 강력한 옵션 일 것입니다.
ru: <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#scriptaliasmatch"> <code>ScriptAliasMatch</code> </a> предназначен в первую очередь для CGI-скриптов, но также должен работать для PHP. Это позволяет регулярные выражения, как и любой <code>RewriteRule</code> . На самом деле это, пожалуй, самый надежный вариант для настройки универсального фронт-контроллера.
zh_cn: <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#scriptaliasmatch"> <code>ScriptAliasMatch</code> </a>主要用于CGI脚本，但也应该适用于PHP。 就像任何 <code>RewriteRule</code> 一样，它允许正则表达式 。 实际上，它可能是配置通用前端控制器的最强大的选项。

source: <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">Rewrite conditions</a> make rewrites even more powerful, allowing you to specify rewrites for more specific situations. There are a lot of conditions which you can read about in <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">the documentation</a>, but I'll touch on a few common examples and explain them:
ja: <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">書き換え条件</a>により、書き換えがさらに強力になり、特定の状況で書き換えを指定できるようになります。 <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">ドキュメント</a>で読むことができる多くの条件がありますが、いくつかの一般的な例に触れて説明します。
ko: <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">다시 쓰기 조건을</a> 사용하면 다시 쓰기가 더욱 강력 해져서보다 구체적인 상황에 대한 다시 쓰기 를 지정할 수 있습니다. <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">documentation</a> 에서 읽을 수있는 조건이 많이 있지만 몇 가지 일반적인 예를 터치하고 설명합니다.
ru: <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">Условия</a> перезаписи делают переписывание еще более мощным, позволяя вам задавать перезаписи для более конкретных ситуаций. Есть много условий, о которых вы можете прочитать в <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">документации</a> , но я затрону несколько общих примеров и объясню их:
zh_cn: <a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">重写条件</a>使重写功能更加强大，允许您为更特定的情况指定重写。 您可以在<a href="http://httpd.apache.org/docs/2.2/mod/mod_rewrite.html#rewritecond">文档中</a>阅读很多条件，但我将介绍一些常见示例并进行解释：

source: <code>$</code> indicates this is the end of the string we want to match
ja: <code>$</code> は、これが照合する文字列の終わりであることを示します
ko: <code>$</code> 는 이것이 우리가 일치시키고 싶은 문자열의 끝을 나타냅니다
ru: <code>$</code> указывает, что это конец строки, которую мы хотим сопоставить
zh_cn: <code>$</code> 表示这是我们要匹配的字符串的结尾

source: <code>%{REQUEST_FILENAME} !-d</code> will check to see if the file exists on the current server, and only execute the rewrite if it doesn't
ja: <code>%{REQUEST_FILENAME} !-d</code> は、ファイルが現在のサーバーに存在するかどうかを確認し、存在しない場合にのみ書き換えを実行します
ko: <code>%{REQUEST_FILENAME} !-d</code> 는 파일이 현재 서버에 있는지 확인하고 파일이없는 경우에만 다시 쓰기를 실행합니다.
ru: <code>%{REQUEST_FILENAME} !-d</code> проверит, существует ли файл на текущем сервере, и выполнит перезапись только в том случае, если его нет
zh_cn: <code>%{REQUEST_FILENAME} !-d</code> 将检查文件是否在当前服务器上，并且仅在不存在的情况下执行重写

source: <code>%{REQUEST_FILENAME} !-f</code> will check to see if the file exists on the current server, and only execute the rewrite if it doesn't
ja: <code>%{REQUEST_FILENAME} !-f</code> は、現在のサーバーにファイルが存在するかどうかを確認し、存在しない場合にのみ書き換えを実行します
ko: <code>%{REQUEST_FILENAME} !-f</code> 는 파일이 현재 서버에 있는지 확인하고 파일이없는 경우에만 다시 쓰기를 실행합니다.
ru: <code>%{REQUEST_FILENAME} !-f</code> проверит, существует ли файл на текущем сервере, и выполнит перезапись, только если его нет
zh_cn: <code>%{REQUEST_FILENAME} !-f</code> 将检查文件是否在当前服务器上，并且仅在不存在的情况下执行重写

source: <code>%{REQUEST_URI} \.(jpg|jpeg|gif|png)$ [NC]</code> will only execute the rewrite for files with a file extension of jpg, jpeg, gif or png (case insensitive).
ja: <code>%{REQUEST_URI} \.(jpg|jpeg|gif|png)$ [NC]</code> は、ファイル拡張子がjpg、jpeg、gif、またはpng（大文字と小文字を区別しない）のファイルに対してのみ書き換えを実行します。
ko: <code>%{REQUEST_URI} \.(jpg|jpeg|gif|png)$ [NC]</code> 는 파일 확장자가 jpg, jpeg, gif 또는 png (대소 문자 구분 안 함) 인 파일에 대해서만 다시 쓰기를 실행합니다.
ru: <code>%{REQUEST_URI} \.(jpg|jpeg|gif|png)$ [NC]</code> будет выполнять перезапись только для файлов с расширением jpg, jpeg, gif или png (без учета регистра).
zh_cn: <code>%{REQUEST_URI} \.(jpg|jpeg|gif|png)$ [NC]</code> 仅对文件扩展名为jpg，jpeg，gif或png（不区分大小写）的文件执行重写。

source: <code>&lt;IfModule *&gt;</code> wrappers begone!
ja: <code>&lt;IfModule *&gt;</code> ラッパーがなくなりました！
ko: <code>&lt;IfModule *&gt;</code> 래퍼가 시작되었습니다!
ru: <code>&lt;IfModule *&gt;</code> упаковщики
zh_cn: <code>&lt;IfModule *&gt;</code> 包装器即将出现！

source: <code>.*</code> matches anything, even an empty string. You don't want to use this pattern everywhere, but often in the last fallback rule.
ja: <code>.*</code> 、空の文字列であっても、すべてに一致します。 このパターンをどこでも使用する必要はありませんが、多くの場合、最後のフォールバックルールで使用します。
ko: <code>.*</code> 는 빈 문자열까지도 일치합니다. 이 패턴을 모든 곳에서 사용하고 싶지는 않지만 종종 마지막 대체 규칙에서 사용합니다.
ru: <code>.*</code> соответствует чему угодно, даже пустой строке. Вы не хотите использовать этот шаблон везде, но часто в последнем запасном правиле.
zh_cn: <code>.*</code> 匹配任何内容，甚至是空字符串。 您不想在所有地方都使用此模式，但通常在最后一个后备规则中使用。

source: <code>.htaccess</code> vs. <code>&lt;VirtualHost&gt;</code>
ja: <code>.htaccess</code> 対 <code>&lt;VirtualHost&gt;</code>
ko: <code>.htaccess</code> 대 <code>&lt;VirtualHost&gt;</code>
zh_cn: <code>.htaccess</code> 与 <code>&lt;VirtualHost&gt;</code>

source: <code>?</code> means that the preceding character is optional, so in this case both <code>/blog/1/foo/</code> and <code>/blog/1/foo</code> would rewrite to the same place
ja: <code>?</code> 前の文字はオプションであるため、この場合、 <code>/blog/1/foo/</code> と <code>/blog/1/foo</code> の両方が同じ場所に書き換えられます
ko: <code>?</code> 앞의 문자는 선택 사항이므로이 경우 <code>/blog/1/foo/</code> 와 <code>/blog/1/foo</code> 는 모두 같은 위치에 다시 씁니다.
ru: <code>?</code> означает, что предыдущий символ является необязательным, поэтому в этом случае и <code>/blog/1/foo/</code> и <code>/blog/1/foo</code> переписывают в одно и то же место
zh_cn: <code>?</code> 表示前面的字符是可选的，因此在这种情况下， <code>/blog/1/foo/</code> 和 <code>/blog/1/foo</code> 都将重写到同一位置

source: <code>RewriteRule</code> - starts the rewrite rule
ja: <code>RewriteRule</code> -書き換えルールを開始します
ko: <code>RewriteRule</code> - 다시 쓰기 규칙을 시작합니다
ru: <code>RewriteRule</code> - запускает правило перезаписи
zh_cn: <code>RewriteRule</code> -启动重写规则

source: <code>[NC,L,QSA]</code> are flags for the rewrite rule, separated by a comma, which I will explain more on later
ja: <code>[NC,L,QSA]</code> は、コンマで区切られた書き換えルールのフラグです。これについては、後で詳しく説明します
ko: <code>[NC,L,QSA]</code> 는 다시 쓰기 규칙에 대한 플래그이며 쉼표로 구분되며 나중에 자세히 설명하겠습니다.
ru: <code>[NC,L,QSA]</code> - это флаги для правила перезаписи, разделенные запятой, о которых я расскажу позже.
zh_cn: <code>[NC,L,QSA]</code> 是重写规则的标志，以逗号分隔，我将在后面解释

source: <code>[\w\-.,]+</code> adds periods and commas. Prefer an escaped <code>\-</code> dash in <code>[&hellip;]</code> charclasses.
ja: <code>[\w\-.,]+</code> はピリオドとコンマを追加します。 <code>[&hellip;]</code> 文字クラスではエスケープされた <code>\-</code> ダッシュを優先します。
ko: <code>[\w\-.,]+</code> 는 마침표와 쉼표를 추가합니다. <code>[&hellip;]</code> charclasses에서 이스케이프 된 <code>\-</code> 대시를 사용하십시오.
ru: <code>[\w\-.,]+</code> добавляет точки и запятые. Предпочитайте экранированную черту в <code>[&hellip;]</code> классах.
zh_cn: <code>[\w\-.,]+</code> 加上句点和逗号。 在 <code>[&hellip;]</code> charclass中更喜欢使用转义的 <code>\-</code> 破折号。

source: <code>[\w\-]+</code> for "slug"-style path segments, using letters, numbers, dash <code>-</code><em>and</em><code>_</code>
ja: <code>[\w\-]+</code> "スラッグ"スタイルのパスセグメントの場合、文字、数字、ダッシュ <code>-</code> <em>および</em> <code>_</code> を使用
ko: 문자, 숫자, 대시 <em>및</em> <code>_</code> 를 사용하여 "슬러그"스타일 경로 세그먼트의 경우 <code>[\w\-]+</code>
ru: <code>[\w\-]+</code> для сегментов пути в стиле &laquo;slug&raquo;, используя буквы, цифры, тире <code>-</code> <em>и</em> <code>_</code>
zh_cn: <code>[\w\-]+</code> 用于&ldquo;子弹&rdquo;式路径段，使用字母，数字，破折号 <code>-</code> <em>和</em> <code>_</code>

source: <code>[^/]+</code> is more often used for path segments. It matches anything but the forward slash.
ja: <code>[^/]+</code> はパスセグメントによく使用されます。 スラッシュ以外のすべてと一致します。
ko: <code>[^/]+</code> 는 경로 세그먼트에 더 자주 사용됩니다. 슬래시 이외의 항목과 일치합니다.
ru: <code>[^/]+</code> чаще используется для сегментов пути. Это соответствует чему угодно, кроме косой черты.
zh_cn: <code>[^/]+</code> 通常用于路径段。 除正斜杠外，它都匹配。

source: <code>\.</code> denotes a literal period. Otherwise <code>.</code> outside of <code>[&hellip;]</code> is placeholder for any symbol.
ja: <code>\.</code> 文字通りのピリオドを示します。 それ以外の場合 <code>.</code> <code>[&hellip;]</code> の外側は、任意のシンボルのプレースホルダーです。
ko: <code>\.</code> 리터럴 기간을 나타냅니다. 그렇지 않으면 <code>.</code> <code>[&hellip;]</code> 외부는 모든 기호의 자리 표시 자입니다.
ru: <code>\.</code> обозначает буквальный период. В противном случае <code>.</code> за пределами <code>[&hellip;]</code> является заполнителем для любого символа.
zh_cn: <code>\.</code> 表示原义时期。 否则 <code>.</code> <code>[&hellip;]</code> 外部是任何符号的占位符。

source: <code>\d+</code> only matches numeric strings.
ja: <code>\d+</code> は数値文字列のみに一致します。
ko: <code>\d+</code> 는 숫자 문자열과 만 일치합니다.
ru: <code>\d+</code> только числовым строкам.
zh_cn: <code>\d+</code> 仅匹配数字字符串。

source: <code>\w+</code> matches alphanumeric characters. It's basically shorthand for <code>[A-Za-z0-9_]</code>.
ja: <code>\w+</code> 英数字に一致します。 基本的には <code>[A-Za-z0-9_]</code> の省略形です。
ko: <code>\w+</code> 는 영숫자 문자와 일치합니다. 기본적으로 <code>[A-Za-z0-9_]</code> 의 약어입니다.
ru: <code>\w+</code> соответствует буквенно-цифровым символам. Это в основном сокращение для <code>[A-Za-z0-9_]</code> .
zh_cn: <code>\w+</code> 匹配字母数字字符。 它基本上是 <code>[A-Za-z0-9_]</code> 的简写。

source: <code>^</code> indicates the start of the page name - so it will rewrite <code>example.com/blog/...</code> but not <code>example.com/foo/blog/...</code>
ja: <code>^</code> はページ名の開始を示します-したがって、 <code>example.com/blog/...</code> は書き換えられますが、 <code>example.com/foo/blog/...</code> blog / ...は書き換えられません。
ko: <code>^</code> 는 페이지 이름의 시작을 나타냅니다. 따라서 <code>example.com/blog/...</code> 는 다시 작성하지 않습니다 <code>example.com/foo/blog/...</code>
ru: <code>^</code> обозначает начало имени страницы - поэтому он переписывает <code>example.com/blog/...</code> но не <code>example.com/foo/blog/...</code>
zh_cn: <code>^</code> 表示页面名称的开头-因此它将重写 <code>example.com/blog/...</code> ,但不会重写 <code>example.com/foo/blog/...</code>

source: <code>^blog/([0-9]+)/([A-Za-z0-9-\+]+)/?$</code> - This is called the pattern, however I'll just refer to it as the left hand side of the rule - what you want to rewrite from
ja: <code>^blog/([0-9]+)/([A-Za-z0-9-\+]+)/?$</code> -これはパターンと呼ばれますが、左側と呼ぶだけにしますルールの-書き換え元
ko: <code>^blog/([0-9]+)/([A-Za-z0-9-\+]+)/?$</code> -패턴이라고하는데, 그냥 왼쪽이라고하겠습니다 규칙의-당신이 다시 쓰고 싶은 것
ru: <code>^blog/([0-9]+)/([A-Za-z0-9-\+]+)/?$</code> - это называется шаблоном, однако я просто буду называть его левой стороной правила - с чего вы хотите переписать
zh_cn: <code>^blog/([0-9]+)/([A-Za-z0-9-\+]+)/?$</code> -这称为模式，但是我仅将其称为左侧规则-您要重写的内容

source: <code>blog/index.php?id=$1&amp;title=$2</code> - called the substitution, or right hand side of a rewrite rule - what you want to rewrite to
ja: <code>blog/index.php?id=$1&amp;title=$2</code> 置換と呼ばれる、または書き換えルールの右側-書き換え先
ko: <code>blog/index.php?id=$1&amp;title=$2</code> 대체 또는 재 작성 규칙의 오른쪽-재 작성하려는 항목
ru: <code>blog/index.php?id=$1&amp;title=$2</code> - называется заменой или правой частью правила перезаписи - то, что вы хотите переписать
zh_cn: <code>blog/index.php?id=$1&amp;title=$2</code> 称为替换或重写规则的右侧-您要重写的内容

source: <em>(One could use <a href="http://httpd.apache.org/docs/current/mod/mod_substitute.html"><code>mod_substitute</code></a> in conjunction to transform outgoing HTML pages and their contained links. Though this is usally more effort than just updating your HTML resources.)</em>
ja: <em>（ <a href="http://httpd.apache.org/docs/current/mod/mod_substitute.html"> <code>mod_substitute</code> </a>を組み合わせて使用​​して、送信されるHTMLページとそこに含まれるリンクを変換できます。 ただし 、これは通常、HTMLリソースを更新するだけではありません。）</em>
ko: <em>발신 HTML 페이지와 포함 된 링크를 변환하기 위해 <a href="http://httpd.apache.org/docs/current/mod/mod_substitute.html"> <code>mod_substitute</code> </a> 를 사용할 수 있습니다. HTML 리소스를 업데이트하는 것보다 일반적으로 더 많은 노력이 필요합니다.</em>
ru: <em>(Можно использовать <a href="http://httpd.apache.org/docs/current/mod/mod_substitute.html"> <code>mod_substitute</code> </a> совместно для преобразования исходящих HTML-страниц и содержащихся в них ссылок. Хотя обычно это больше усилий, чем просто обновление ваших HTML-ресурсов.)</em>
zh_cn: <em>（一个人可以结合使用<a href="http://httpd.apache.org/docs/current/mod/mod_substitute.html"> <code>mod_substitute</code> </a>来转换传出的HTML页面及其包含的链接。尽管这通常比更新HTML资源还要费劲。）</em>

source: <em>Disclaimer: Just a pet peeve.</em> You often hear pretty URL rewriting schemes referred to as "SEO" links or something. While this is useful for googling examples, it's a dated misnomer.
ja: <em>免責事項：ただの不満。</em> 「SEO」リンクなどと呼ばれるかなりのURL書き換えスキームをよく耳にします。 これはグーグルの例には役立ちますが、日付が誤っているためです。
ko: <em>면책 조항 : 단지 애완 동물 친구.</em> 종종 "SEO"링크 또는 무언가라는 URL 재 작성 체계가 들립니다. 이것은 인터넷 검색 예제에 유용하지만 날짜가 잘못되었습니다.
ru: <em>Отказ от ответственности: просто любимая мозоль.</em> Вы часто слышите красивые схемы перезаписи URL, называемые ссылками &laquo;SEO&raquo; или что-то в этом роде Хотя это полезно для примеров поиска в Google, это устаревшее неправильное название.
zh_cn: <em>免责声明：只是一个宠物。</em> 您经常听到漂亮的URL重写方案，称为&ldquo; SEO&rdquo;链接或其他内容。 尽管这对于谷歌搜索示例很有用，但它已过时。

source: <em>Frequent duplicates:</em>
ja: <em>頻繁な重複：</em>
ko: <em>자주 복제 :</em>
ru: <em>Частые дубликаты:</em>
zh_cn: <em>经常重复：</em>

source: <strong>Before asking your own question</strong>
ja: <strong>質問する前に</strong>
ko: <strong>자신의 질문을하기 전에</strong>
ru: <strong>Прежде чем задать свой вопрос</strong>
zh_cn: <strong>在问自己的问题之前</strong>

source: <strong>Compare <code>access.log</code> and <code>error.log</code></strong>
ja: <strong> <code>access.log</code> と <code>error.log</code> を比較する</strong>
ko: <strong> <code>access.log</code> 와 <code>error.log</code> 비교</strong>
ru: <strong>Сравните <code>access.log</code> и <code>error.log</code> </strong>
zh_cn: <strong>比较 <code>access.log</code> 和 <code>error.log</code> </strong>

source: <strong>Enable the RewriteLog</strong>
ja: <strong>RewriteLogを有効にする</strong>
ko: <strong>RewriteLog 활성화</strong>
ru: <strong>Включить RewriteLog</strong>
zh_cn: <strong>启用重写日志</strong>

source: <sub>* <em>If</em> allowed by the primary Apache configuration file; it's optional, but often enabled.</sub>
ja: <sub>*プライマリApache構成ファイルで許可されている<em>場合</em> 。</sub> <sub>これはオプションですが、多くの場合有効になっています。</sub>
ko: <sub>* 기본 Apache 구성 파일에서 허용하는 <em>경우</em></sub> <sub>선택 사항이지만 종종 사용됩니다.</sub>
ru: <sub>* <em>Если это</em> разрешено основным файлом конфигурации Apache;</sub> <sub>это необязательно, но часто включено.</sub>
zh_cn: <sub>* <em>如果</em>主要的Apache配置文件允许；</sub> <sub>它是可选的，但经常启用。</sub>
