Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: This rule says <em>whenever a request matches "/foo/bar", rewrite it to "/foo/baz".</em> The request will then be handled as if <code>/foo/baz</code> had been requested instead. This can be used for various effects, for example:
ja: このルールは<em>、リクエストが「/ foo / bar」に一致するたびに、それを「/ foo / baz」に書き換えます。</em> 要求は、 <code>/foo/baz</code> が代わりに要求された場合と同様に処理されます。 これは、たとえば次のようなさまざまな効果に使用できます。
ko: 이 규칙은 <em>요청이 "/ foo / bar"와 일치 할 때마다 "/ foo / baz"로 다시 작성합니다.</em> 그러면 요청은 <code>/foo/baz</code> 가 대신 요청 된 것처럼 처리됩니다. 다음과 같은 다양한 효과에 사용할 수 있습니다.
ru: Это правило гласит: <em>всякий раз, когда запрос соответствует &laquo;/ foo / bar&raquo;, переписывайте его в &laquo;/ foo / baz&raquo;.</em> Запрос будет обработан так, как если бы вместо него был запрошен <code>/foo/baz</code> . Это может быть использовано для различных эффектов, например:
zh_cn: 该规则表示， <em>每当请求匹配&ldquo; / foo / bar&rdquo;时，都将其重写为&ldquo; / foo / baz&rdquo;。</em> 然后将处理该请求，就好像已请求了 <code>/foo/baz</code> 一样。 这可以用于各种效果，例如：

source: This simply remaps 2009-2011 posts onto one script, and all other years implicitly to another handler. Note the <em>more specific rule coming first</em>. Each script might use different GET params.
ja: これは単に2009-2011の投稿を1つのスクリプトに再マッピングし、その他すべての年は暗黙的に別のハンドラーに再マッピングします。 <em>より具体的なルールが最初に来ることに</em>注意してください。 スクリプトごとに異なるGETパラメータを使用する場合があります。
ko: 이것은 2009-2011 게시물을 한 스크립트에 다시 매핑하고 다른 모든 연도는 다른 처리기에 암시 적으로 다시 매핑합니다. <em>보다 구체적인 규칙이 먼저 나옵니다</em> . 각 스크립트는 다른 GET 매개 변수를 사용할 수 있습니다.
ru: Это просто переназначает записи 2009-2011 годов в один сценарий, а все остальные годы неявно - в другой обработчик. Обратите внимание, что <em>более конкретное правило будет первым</em> . Каждый скрипт может использовать разные параметры GET.
zh_cn: 这只是将2009-2011年的帖子重新映射到一个脚本上，而其他所有年份则隐式地映射到另一个处理程序上。 请注意， <em>更具体的规则排在第一位</em> 。 每个脚本可能使用不同的GET参数。

source: This way you could just rename your <code>article.php</code> script to just <code>article</code> (without extension), but still have it processed as PHP script.
ja: この方法では、 <code>article.php</code> スクリプトの名前を単に（拡張子なしの） <code>article</code> に変更するだけで、PHPスクリプトとして処理することができます。
ko: 이 방법으로 <code>article.php</code> 스크립트의 이름을 <code>article</code> (확장자없이)으로 바꿀 수는 있지만 여전히 PHP 스크립트로 처리되도록 할 수 있습니다.
ru: Таким образом, вы можете просто переименовать ваш скрипт <code>article.php</code> в просто <code>article</code> (без расширения), но все равно обработать его как PHP-скрипт.
zh_cn: 这样，您可以将 <code>article.php</code> 脚本重命名为仅 <code>article</code> （不带扩展名），但仍将其作为PHP脚本进行处理。

source: This, again, matches anything and rewrites it to the file index.php with the originally requested URL appended in the <code>url</code> query parameter. I.e., for any and all requests coming in, the file index.php is executed and this file will have access to the original request in <code>$_GET['url']</code>, so it can do anything it wants with it.
ja: これもまた、すべてに一致し、最初に要求された <code>url</code> クエリパラメータに追加して、ファイルindex.phpに書き換えます。 つまり、入ってくるすべてのリクエストに対して、ファイルindex.phpが実行され、このファイルは <code>$_GET['url']</code> 内の元のリクエストにアクセスできるため、それを使用して何でも実行できます。
ko: 이것은 다시 무엇이든 일치시키고 <code>url</code> 쿼리 매개 변수에 원래 요청 된 URL을 추가하여 index.php 파일에 다시 씁니다. 즉, 들어오는 모든 요청에 ​​대해 index.php 파일이 실행 되고이 파일은 <code>$_GET['url']</code> 의 원래 요청에 액세스 할 수 있으므로 원하는 모든 작업을 수행 할 수 있습니다.
ru: Это снова сопоставляет что-либо и переписывает его в файл index.php с первоначально запрошенным URL-адресом, добавленным в параметр запроса <code>url</code> . Т.е. для всех поступающих запросов исполняется файл index.php, и этот файл будет иметь доступ к исходному запросу в <code>$_GET['url']</code> , поэтому он может делать с ним все, что захочет.
zh_cn: 再次匹配任何内容，并将其重写为文件index.php，并在 <code>url</code> 查询参数中附加最初请求的URL。 也就是说，对于所有传入的所有请求，都将执行文件index.php，并且该文件将有权访问 <code>$_GET['url']</code> 的原始请求，因此它可以执行任何所需的操作。

source: To actually use RewriteRules in per-directory configuration files you must:
ja: 実際にディレクトリ単位の設定ファイルで RewriteRules を使用するには、以下のようにしなければなりません。
ko: 디렉토리 별 구성 파일에서 실제로 RewriteRules를 사용하려면 다음을 수행해야합니다.
ru: Для фактического использования RewriteRules в конфигурационных файлах каждой директории необходимо:
zh_cn: 要在每个目录配置文件中实际使用RewriteRules,你必须。

source: To expand on <a href="https://stackoverflow.com/a/20563773/1011145">deceze's answer</a>, I wanted to provide a few examples and explanation of some other mod_rewrite functionality.
ja: <a href="https://stackoverflow.com/a/20563773/1011145">decezeの答え</a>を拡張するために、いくつかの他のmod_rewrite機能の例と説明を提供したいと思いました。
ko: <a href="https://stackoverflow.com/a/20563773/1011145">deceze의 답변</a> 을 확장하기 위해 다른 mod_rewrite 기능에 대한 몇 가지 예와 설명을 제공하고 싶었습니다.
ru: Чтобы расширить <a href="https://stackoverflow.com/a/20563773/1011145">ответ Десезе</a> , я хотел бы привести несколько примеров и объяснение некоторых других функций mod_rewrite.
zh_cn: 为了扩展<a href="https://stackoverflow.com/a/20563773/1011145">deceze的答案</a> ，我想提供一些示例和一些其他mod_rewrite功能的解释。

source: To understand what mod_rewrite does you first need to understand how a web server works. A web server responds to <a href="http://en.wikipedia.org/wiki/Http"><em>HTTP requests</em></a>. An HTTP request at its most basic level looks like this:
ja: mod_rewriteの内容を理解するには、まずWebサーバーの動作を理解する必要があります。 Webサーバーは<a href="http://en.wikipedia.org/wiki/Http"><em>HTTPリクエストに</em></a>応答し<em>ます</em> 。 最も基本的なレベルのHTTPリクエストは次のようになります。
ko: mod_rewrite의 기능을 이해하려면 먼저 웹 서버의 작동 방식을 이해해야합니다. 웹 서버는 <a href="http://en.wikipedia.org/wiki/Http"><em>HTTP 요청에</em></a> 응답 <em>합니다</em> . 가장 기본적인 수준의 HTTP 요청은 다음과 같습니다.
ru: Чтобы понять, что делает mod_rewrite, вам сначала нужно понять, как работает веб-сервер. Веб-сервер отвечает на <a href="http://en.wikipedia.org/wiki/Http"><em>запросы HTTP</em></a> . HTTP-запрос на самом базовом уровне выглядит следующим образом:
zh_cn: 要了解什么是mod_rewrite，首先需要了解Web服务器的工作方式。 Web服务器响应<a href="http://en.wikipedia.org/wiki/Http"><em>HTTP请求</em></a> 。 最基本的HTTP请求如下所示：

source: Trailing file "extensions"
ja: 後続のファイルの「拡張子
ko: 후행 파일 "확장명"
ru: Трейлинговый файл "расширения"
zh_cn: 拖尾文件 "扩展"

source: URL rewriting is primarily used for supporting <em>virtual</em> incoming paths. Commonly you just have one dispatcher script (<code>index.php</code>) or a few individual handlers (<code>articles.php</code>, <code>blog.php</code>, <code>wiki.php</code>, &hellip;). The latter <a href="https://stackoverflow.com/a/1298917">might clash</a> with similar virtual RewriteRule paths.
ja: URL書き換えは、主に<em>仮想</em>着信パスをサポートするために使用されます。 通常、1つのディスパッチャスクリプト（ <code>index.php</code> ）またはいくつかの個別のハンドラ（ <code>articles.php</code> 、 <code>blog.php</code> 、 <code>wiki.php</code> 、&hellip;） しかありません。 後者<a href="https://stackoverflow.com/a/1298917">は</a> 、同様の仮想RewriteRuleパスと競合する可能性があります。
ko: URL 재 작성은 주로 <em>가상</em> 수신 경로를 지원하는 데 사용됩니다. 일반적으로 하나의 디스패처 스크립트 ( <code>index.php</code> ) 또는 몇 개의 개별 처리기 ( <code>articles.php</code> , <code>blog.php</code> , <code>wiki.php</code> ,&hellip;) 만 있습니다. 후자 <a href="https://stackoverflow.com/a/1298917">는</a> 유사한 가상 RewriteRule 경로와 충돌 할 수 있습니다 .
ru: Перезапись URL в основном используется для поддержки <em>виртуальных</em> входящих путей. Обычно у вас есть только один диспетчерский скрипт ( <code>index.php</code> ) или несколько отдельных обработчиков ( <code>blog.php</code> , <code>wiki.php</code> , wiki.php ,&hellip;). Последние <a href="https://stackoverflow.com/a/1298917">могут конфликтовать</a> с похожими виртуальными путями RewriteRule.
zh_cn: URL重写主要用于支持<em>虚拟</em>传入路径。 通常，您只有一个调度程序脚本（ <code>index.php</code> ）或几个单独的处理程序（ <code>articles.php</code> ， <code>blog.php</code> ， <code>wiki.php</code> &hellip;）。 后者<a href="https://stackoverflow.com/a/1298917">可能</a>与类似的虚拟RewriteRule路径发生冲突 。

source: URLs don't really have file extensions. Which is what this entire reference is about (= URLs are virtual locators, not necessarily a direct filesystem image). However if you had a 1:1 file mapping before, you <em>can</em> craft simpler rules:
ja: URLにはファイル拡張子がありません。 これは、この参照全体に関するものです（= URLは仮想ロケーターであり、必ずしも直接のファイルシステムイメージではありません）。 ただし、以前に1：1のファイルマッピングがあった場合は、より簡単なルールを作成<em>でき</em>ます。
ko: URL에는 실제로 파일 확장자가 없습니다. 이 전체 참조 내용은 다음과 같습니다 (= URL은 가상 로케이터이며 반드시 직접 파일 시스템 이미지는 아님). 그러나 이전에 1 : 1 파일 매핑이 있었다면 더 간단한 규칙을 만들 <em>수 있습니다</em> .
ru: URL-адреса не имеют расширений файлов. Вот о чем вся эта ссылка (= URL-адреса являются виртуальными локаторами, не обязательно прямым образом файловой системы). Однако, если у вас раньше было отображение файла 1: 1, вы <em>можете</em> создать более простые правила:
zh_cn: 网址实际上没有文件扩展名。 整个引用所针对的是（URL是虚拟定位符，不一定是直接文件系统映像）。 但是，如果以前有1：1的文件映射，则<em>可以</em>制定更简单的规则：

source: Uniformity with alternative lists
ja: 代替リストによる統一性
ko: 대체 목록과의 균일 성
ru: Единообразие с альтернативными списками
zh_cn: 备选名单的统一性

source: Use mod_rewrite on the server to handle the request to the URL <code>/my/pretty/link</code> using any one of the methods described above.
ja: サーバーでmod_rewriteを使用して、上記のいずれかの方法でURL <code>/my/pretty/link</code> へのリクエストを処理します。
ko: 서버에서 mod_rewrite를 사용하여 위에서 설명한 방법 중 하나를 사용하여 URL <code>/my/pretty/link</code> 에 대한 요청을 처리하십시오.
ru: Используйте mod_rewrite на сервере для обработки запроса по <code>/my/pretty/link</code> URL / my / pretty /, используя любой из методов, описанных выше.
zh_cn: 使用上述任何一种方法，在服务器上使用mod_rewrite处理对URL <code>/my/pretty/link</code> 的请求。

source: Use the <a href="https://stackoverflow.com/questions/2261951/what-exactly-is-path-info-in-php">PATH_INFO</a>, Luke
ja: <a href="https://stackoverflow.com/questions/2261951/what-exactly-is-path-info-in-php">PATH_INFOを</a>使用して、Luke
ko: <a href="https://stackoverflow.com/questions/2261951/what-exactly-is-path-info-in-php">PATH_INFO</a> , Luke 사용
ru: Используйте <a href="https://stackoverflow.com/questions/2261951/what-exactly-is-path-info-in-php">PATH_INFO</a> , Люк
zh_cn: 使用<a href="https://stackoverflow.com/questions/2261951/what-exactly-is-path-info-in-php">PATH_INFO</a> ，卢克

source: Were it really be disabled, your RewriteRules still wouldn't work anyway.
ja: それが本当に無効化されていたとしても、あなたのRewriteRulesはいずれにしても動作しません。
ko: 실제로 비활성화되어 있으면 RewriteRules가 여전히 작동하지 않습니다.
ru: Если бы он действительно был отключен,твои правила переписывания все равно бы не сработали.
zh_cn: 如果它真的被禁用了,你的RewriteRules仍然无法工作。

source: What "pretty" URLs should conceptionally be used for is making websites <strong><em>user-friendly</em></strong>.
ja: 「きれいな」URLを概念的に使用する必要があるのは、Webサイトを<strong><em>ユーザーフレンドリーにすること</em></strong>です。
ko: 개념적으로 "예쁜"URL을 사용해야하는 것은 웹 사이트를 <strong><em>사용자에게 친숙</em></strong> 하게 만드는 것입니다.
ru: То, для чего &laquo;концептуально&raquo; должны быть использованы концептуально, - это сделать сайты <strong><em>удобными для пользователей</em></strong> .
zh_cn: 概念上应使用的&ldquo;漂亮&rdquo; URL是使网站变得<strong><em>用户友好</em></strong> 。

source: What mod_rewrite does <em>not</em> do
ja: mod_rewriteが<em>行わない</em>こと
ko: mod_rewrite가하지 <em>않는</em> 것
ru: Что не делает mod_rewrite
zh_cn: mod_rewrite不做什么

source: What seems enticing as generalized safeguard, often turns out to be an obstacle in practice.
ja: 一般的な安全装置として魅力的に見えるものは、実際には障害となることが多い。
ko: 일반화 된 보호 수단으로 유혹되는 것들은 종종 실제로 장애물로 밝혀졌습니다.
ru: То,что кажется заманчивым как обобщенная мера предосторожности,часто оказывается препятствием на практике.
zh_cn: 看似诱人的泛化保障,在实践中往往会变成障碍。

source: When opting for directory-style paths, you can make it reachable with and without a final
ja: ディレクトリ形式のパスを選択する場合、最終的な
ko: 디렉토리 스타일 경로를 선택할 때 최종 경로 유무에 관계없이 경로에 도달 할 수 있습니다
ru: При выборе режиссерских дорожек,вы можете сделать его доступным с и без окончательной
zh_cn: 当选择目录式的路径时,你可以让它在有和没有最终的

source: When you introduce virtual directory structures <code>/blog/article/123</code> this impacts relative resource references in HTML (such as <code>&lt;img src=mouse.png&gt;</code>). Which can be solved by:
ja: 仮想ディレクトリ構造 <code>/blog/article/123</code> を導入すると、これはHTMLの相対リソース参照（ <code>&lt;img src=mouse.png&gt;</code> など ）に影響します。 これは次の方法で解決できます。
ko: 가상 디렉토리 구조 <code>/blog/article/123</code> 을 도입하면 HTML의 상대 자원 참조 (예 : <code>&lt;img src=mouse.png&gt;</code> )에 영향을줍니다. 다음으로 해결할 수 있습니다.
ru: Когда вы вводите структуры виртуальных каталогов <code>/blog/article/123</code> , это влияет на относительные ссылки на ресурсы в HTML (например, <code>&lt;img src=mouse.png&gt;</code> ). Что может быть решено путем:
zh_cn: 当您引入虚拟目录结构 <code>/blog/article/123</code> 时,这会影响HTML中的相对资源引用（例如 <code>&lt;img src=mouse.png&gt;</code> ）。 可以通过以下方法解决：

source: Whenever something <em>doesn't work</em>
ja: 何か<em>がうまくいかない</em>ときはいつでも
ko: 무언가 <em>가 작동하지 않을</em> 때마다
ru: Всякий раз, когда что-то <em>не работает</em>
zh_cn: 每当某事<em>不起作用</em>

source: Which helps to narrow down overly generic rules and regex mishaps.
ja: これは、過度に一般的なルールや正規表現のミスを絞り込むのに役立ちます。
ko: 지나치게 일반적인 규칙과 정규식 사고를 좁히는 데 도움이됩니다.
ru: Что помогает сузить круг чрезмерно общих правил и регрессных неудач.
zh_cn: 这有助于缩小过于笼统的规则和语法错误。

source: Which is not to say you always <em>have to</em>. Content-Negotiation is just an automatism to virtual resources.
ja: 常にそうし<em>なけれ</em>ばならないということではありません。 コンテンツネゴシエーションは、仮想リソースの単なる自動化です。
ko: 항상 그렇다고 말하는 것은 아닙니다. 컨텐츠 협상은 가상 자원에 대한 자동화입니다.
ru: Что не означает, что вы всегда <em>должны</em> . Content-Negotiation - это просто автоматизация виртуальных ресурсов.
zh_cn: 这并不是说您始终<em>必须这样做</em> 。 内容协商只是虚拟资源的自动化。

source: Which is often used by PHP frameworks or WebCMS / portal scripts. The actual path splitting then is handled in PHP using <code>$_SERVER["REQUEST_URI"]</code>. So conceptionally it's pretty much the opposite of URL handling "per mod_rewrite". (Just use <a href="https://httpd.apache.org/docs/2.4/rewrite/remapping.html#fallback-resource"><code>FallBackResource</code></a> instead.)
ja: これは、PHPフレームワークまたはWebCMS /ポータルスクリプトでよく使用されます。 その後、実際のパス分割は <code>$_SERVER["REQUEST_URI"]</code> を使用してPHPで処理されます。 つまり、概念的には、「mod_rewriteごと」のURL処理とは正反対です。 （代わりに<a href="https://httpd.apache.org/docs/2.4/rewrite/remapping.html#fallback-resource"> <code>FallBackResource</code> </a>を使用してください 。）
ko: PHP 프레임 워크 또는 WebCMS / 포털 스크립트에서 자주 사용됩니다. 실제 경로 분할은 <code>$_SERVER["REQUEST_URI"]</code> 사용하여 PHP에서 처리됩니다. 개념적으로 그것은 "mod_rewrite 당"URL 처리와 거의 반대입니다. 대신 <a href="https://httpd.apache.org/docs/2.4/rewrite/remapping.html#fallback-resource"> <code>FallBackResource</code> 를</a> 사용하십시오.
ru: Который часто используется PHP-фреймворками или скриптами WebCMS / portal. Фактическое разбиение пути затем обрабатывается в PHP с использованием <code>$_SERVER["REQUEST_URI"]</code> . Таким образом, концептуально это в значительной степени противоположно обработке URL "per mod_rewrite". (Просто используйте <a href="https://httpd.apache.org/docs/2.4/rewrite/remapping.html#fallback-resource"> <code>FallBackResource</code> </a> .)
zh_cn: PHP框架或WebCMS /门户网站脚本经常使用该脚本。 然后使用 <code>$_SERVER["REQUEST_URI"]</code> 在PHP中处理实际的路径拆分。 因此，从概念上讲，它与&ldquo; per mod_rewrite&rdquo; URL处理几乎相反。 （只需使用<a href="https://httpd.apache.org/docs/2.4/rewrite/remapping.html#fallback-resource"> <code>FallBackResource</code> 即可</a> 。）

source: Which it doesn't per default. You can <a href="https://stackoverflow.com/questions/7218164/multiple-rewriterules-for-single-rewritecond-in-htaccess">chain them</a> using the <code>[S=2]</code> flag. Else you'll have to repeat them. While sometimes you can craft an "inverted" primary rule to [END] the rewrite processing early.
ja: デフォルトではありません。 <code>[S=2]</code> フラグを使用して<a href="https://stackoverflow.com/questions/7218164/multiple-rewriterules-for-single-rewritecond-in-htaccess">それら</a>を連鎖させることができます。 そうでなければ、それらを繰り返す必要があります。 場合によっては、「逆」のプライマリルールを作成して、書き換え処理を早く[終了]することもできます。
ko: 기본값이 아닌 <code>[S=2]</code> 플래그를 사용하여 연결할 수 있습니다. 그렇지 않으면 반복해야합니다. 재 작성 처리를 일찍 [END] 수행하기 위해 "반전 된"기본 규칙을 만들 수도 있습니다.
ru: Что это не по умолчанию. Вы можете <a href="https://stackoverflow.com/questions/7218164/multiple-rewriterules-for-single-rewritecond-in-htaccess">связать их,</a> используя флаг <code>[S=2]</code> . Иначе вам придется их повторять. Хотя иногда вы можете создать &laquo;перевернутое&raquo; первичное правило для [END] обработки перезаписи на ранней стадии.
zh_cn: 它不是默认值。 您可以使用 <code>[S=2]</code> 标志<a href="https://stackoverflow.com/questions/7218164/multiple-rewriterules-for-single-rewritecond-in-htaccess">链接它们</a> 。 否则，您将不得不重复它们。 尽管有时您可以制作&ldquo;反向&rdquo;主要规则以尽早[END]进行重写处理。

source: You can easily extend that rule to allow for <code>/article/title-string</code> placeholders:
ja: このルールを簡単に拡張して、 <code>/article/title-string</code> プレースホルダーを許可できます 。
ko: <code>/article/title-string</code> 플레이스 홀더를 허용하도록 해당 규칙을 쉽게 확장 할 수 있습니다.
ru: Вы можете легко расширить это правило, чтобы включить заполнители <code>/article/title-string</code> :
zh_cn: 您可以轻松地扩展该规则以允许 <code>/article/title-string</code> 占位符：

source: You can split them out into individual <code>RewriteRule</code>s should this get too complex.
ja: 複雑すぎる場合は、個別の <code>RewriteRule</code> に分割できます。
ko: 너무 복잡해지면 개별 <code>RewriteRule</code> 로 나눌 수 있습니다.
ru: Вы можете разделить их на отдельные <code>RewriteRule</code> , если это станет слишком сложным.
zh_cn: 如果这变得太复杂，则可以将它们分成单独的 <code>RewriteRule</code> 。

source: You can't match <code>RewriteRule index.php\?x=y</code>, because mod_rewrite compares just against relative paths per default. You can match them separately however via:
ja: <code>RewriteRule index.php\?x=y</code> と一致させることはできません。これは、mod_rewriteがデフォルトで相対パスと比較するだけだからです。 あなたはそれらを別々に一致させることができます：
ko: mod_rewrite는 기본값 당 상대 경로와 비교하기 때문에 <code>RewriteRule index.php\?x=y</code> 와 일치 할 수 없습니다. 그러나 다음을 통해 별도로 일치시킬 수 있습니다.
ru: Вы не можете сопоставить <code>RewriteRule index.php\?x=y</code> , потому что mod_rewrite сравнивает только относительные пути по умолчанию. Вы можете сопоставить их отдельно, однако через:
zh_cn: 您无法匹配 <code>RewriteRule index.php\?x=y</code> ，因为默认情况下mod_rewrite仅与相对路径进行比较。 您可以通过以下方式分别匹配它们：

source: You could alternatively craft further RewriteRules to rebind <code>.css</code> or <code>.png</code> paths to their original locations. But that's both unneeded, or incurs extra redirects and hampers caching.
ja: または、RewriteRulesをさらに作成して、 <code>.css</code> または <code>.png</code> パスを元の場所に再バインドすることもできます。 しかし、それはどちらも不要であるか、余分なリダイレクトが発生し、キャッシングが妨げられます。
ko: 다른 RewriteRules를 만들어 <code>.css</code> 또는 <code>.png</code> 경로를 원래 위치로 리 바인드 할 수도 있습니다. 그러나 그것은 불필요하거나 여분의 리디렉션이 발생하고 캐싱을 방해합니다.
ru: В качестве альтернативы вы можете создать дополнительные RewriteRules, чтобы привязать пути <code>.css</code> или <code>.png</code> к их исходным местоположениям. Но это и не нужно, или влечет за собой дополнительные перенаправления и затрудняет кеширование.
zh_cn: 您也可以制作其他RewriteRules，以将 <code>.css</code> 或 <code>.png</code> 路径重新绑定到其原始位置。 但这都不是必需的，否则会导致额外的重定向并阻碍缓存。

source: You shouldn't start your <code>.htaccess</code> RewriteRule patterns with <code>^/</code> normally:
ja: 通常、 <code>.htaccess</code> RewriteRuleパターンを <code>^/</code> 開始しないでください。
ko: 일반적으로 <code>^/</code> <code>.htaccess</code> RewriteRule 패턴을 시작하지 않아야합니다.
ru: Вы не должны начинать свои шаблоны <code>.htaccess</code> RewriteRule с <code>^/</code> обычно:
zh_cn: 通常，您不应该使用 <code>^/</code> 开始 <code>.htaccess</code> RewriteRule模式：

source: You're most commonly seeing RewriteRules to simulate a virtual directory structure. But you're not forced to be uncreative. You can as well use <code>-</code> hyphens for segmenting or structure.
ja: 最も一般的には、仮想ディレクトリ構造をシミュレートするためにRewriteRulesが表示されます。 しかし、あなたは創造的である必要はありません。 セグメント化または構造化のために <code>-</code> ハイフンを使用することもできます。
ko: 가상 디렉토리 구조를 시뮬레이션하기 위해 가장 일반적으로 RewriteRules가 표시됩니다. 그러나 창의력을 발휘하지 않아도됩니다. 분할 또는 구조에 하이픈을 사용할 수도 있습니다.
ru: Вы чаще всего видите RewriteRules для имитации структуры виртуальных каталогов. Но вы не обязаны быть нетворческими. Вы также можете использовать дефисы для сегментации или структуры.
zh_cn: 您最常见的情况是看到RewriteRules来模拟虚拟目录结构。 但是，您不会被迫独创。 您也可以使用 <code>-</code> 连字符进行分段或结构化。

source: You've probably seen this in many examples:
ja: いろんな例で見たことがあるでしょう。
ko: 많은 예에서 이것을 보았을 것입니다.
ru: Вы,наверное,видели это во многих примерах:
zh_cn: 你可能在很多例子中都看到过这种情况。

source: approach is easy to append onto any other RewriteRule.
ja: アプローチは、他の RewriteRule に簡単に追加することができます。
ko: 접근 방식은 다른 RewriteRule에 쉽게 추가 할 수 있습니다.
ru: Подход легко добавляется к любому другому RewriteRule.
zh_cn: 这种方法很容易附加到任何其他RewriteRule上。

source: in patterns
ja: 模様的に
ko: 패턴으로
ru: по схемам
zh_cn: 有规律

source: mod_rewrite does not magically make all your URLs "pretty". This is a common misunderstanding. If you have this link in your web site:
ja: mod_rewrite は魔法のようにすべての URL を "きれい" にするわけではありません。これはよくある誤解です。もしあなたのウェブサイトにこのリンクがあれば
ko: mod_rewrite가 모든 URL을 마술처럼 아름답게 만들지는 않습니다. 이것은 일반적인 오해입니다. 웹 사이트에이 링크가있는 경우 :
ru: mod_rewrite волшебным образом не делает все ваши URL "красивыми".Это распространенное недоразумение.Если у вас есть эта ссылка на вашем сайте:
zh_cn: mod_rewrite不会神奇地让你的所有URL都变得 "漂亮"。这是一个常见的误解。如果你的网站有这个链接,。

source: mod_rewrite is a way to <em>rewrite</em> the internal request handling. When the web server receives a request for the URL <code>/foo/bar</code>, you can <em>rewrite</em> that URL into something else before the web server will look for a file on disk to match it. Simple example:
ja: mod_rewriteは、内部リクエスト処理を<em>書き換える</em>方法です。 WebサーバーがURL <code>/foo/bar</code> のリクエストを受信した場合、Webサーバーが一致するディスク上のファイルを探す前に、そのURLを別のURLに<em>書き換える</em>ことができます。 簡単な例：
ko: mod_rewrite는 내부 요청 처리를 <em>다시 쓰는</em> 방법입니다. 웹 서버가 URL <code>/foo/bar</code> 에 대한 요청을 수신하면 웹 서버가 디스크에서 파일과 일치하는 파일을 찾기 전에 해당 URL을 다른 URL로 <em>다시 쓸</em> 수 있습니다. 간단한 예 :
ru: mod_rewrite - это способ <em>переписать</em> внутреннюю обработку запросов. Когда веб-сервер получает запрос на URL <code>/foo/bar</code> , вы можете <em>переписать</em> этот URL-адрес во что-то еще, прежде чем веб-сервер будет искать файл на диске, чтобы соответствовать ему. Простой пример:
zh_cn: mod_rewrite是一种<em>重写</em>内部请求处理的方法。 当Web服务器收到对URL <code>/foo/bar</code> 的请求时，您可以在将该URL <em>重写</em>为其他内容之前，Web服务器将在磁盘上查找与之匹配的文件。 简单的例子：

source: there's nothing mod_rewrite can do to make that pretty. In order to make this a pretty link, you have to:
ja: これをきれいにするために mod_rewrite ができることは何もありません。これをきれいなリンクにするためには
ko: 그것을 mod_rewrite가 예쁘게 만들기 위해 할 수있는 일은 없습니다. 이 링크를 예쁘게 만들려면 다음을 수행해야합니다.
ru: нет ничего,что может сделать mod_rewrite,чтобы сделать это красивым.Чтобы сделать это красивой ссылкой,вы должны:
zh_cn: 没有什么mod_rewrite可以让这个链接变得漂亮。为了让这个链接变得漂亮,你必须:
