Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: See <a href="https://serverfault.com/questions/214512/redirect-change-urls-or-redirect-http-to-https-in-apache-everything-you-ever">Everything you ever wanted to know about mod_rewrite</a> if you haven't already. Combining multiple RewriteRules often leads to interaction. This isn't something to prevent habitually per <code>[L]</code> flag, but a scheme you'll embrace once versed. You <strong>can <em>re-re-re</em>write</strong> virtual paths from one rule to another, until it reaches an actual target handler.
ja: <a href="https://serverfault.com/questions/214512/redirect-change-urls-or-redirect-http-to-https-in-apache-everything-you-ever">mod_rewriteについて</a>まだ知りたくない場合は、すべてを参照してください。 複数のRewriteRulesを組み合わせると、多くの場合、相互作用が発生します。 これは、 <code>[L]</code> フラグごとに習慣的に防止するものではありませんが、一度精通すれば採用できるスキームです。 実際のターゲットハンドラーに到達するまで、1つのルールから別のルールへの仮想パスを<strong>書き直す</strong>こと<strong>ができ</strong>ます。
ko: <a href="https://serverfault.com/questions/214512/redirect-change-urls-or-redirect-http-to-https-in-apache-everything-you-ever">mod_rewrite에 대해 알고 싶은 모든 것을</a> 참조하십시오. 여러 RewriteRules를 결합하면 종종 상호 작용이 발생합니다. 이것은 <code>[L]</code> 플래그에 따라 습관적으로 방지 할 수있는 것이 아니라 한 번 정복 한 계획입니다. 가상 경로가 실제 대상 핸들러에 도달 할 때까지 한 규칙에서 다른 규칙으로 가상 경로를 <strong><em>다시 다시</em> 작성할</strong> 수 <strong>있습니다</strong> .
ru: Посмотрите <a href="https://serverfault.com/questions/214512/redirect-change-urls-or-redirect-http-to-https-in-apache-everything-you-ever">все, что вы когда-либо хотели знать о mod_rewrite,</a> если вы еще этого не сделали. Объединение нескольких RewriteRules часто приводит к взаимодействию. Это не то, что обычно мешает использованию флага <code>[L]</code> , а схема, которую вы примете однажды. Вы <strong>можете <em>переписать</em></strong> виртуальные пути из одного правила в другое, пока оно не достигнет фактического целевого обработчика.
zh_cn: 如果尚未，请参阅<a href="https://serverfault.com/questions/214512/redirect-change-urls-or-redirect-http-to-https-in-apache-everything-you-ever">有关mod_rewrite的所有内容</a> 。 组合多个RewriteRules通常会导致交互。 这并不是每个 <code>[L]</code> 标记都可以防止的习惯，而是您一旦熟悉就会采用的方案。 您<strong>可以<em>重新</em>编写</strong>从一条规则到另一条规则的虚拟路径，直到它到达实际的目标处理程序为止。

source: See <a href="https://stackoverflow.com/q/265898">mod_rewrite, php and the .htaccess file</a>
ja: <a href="https://stackoverflow.com/q/265898">mod_rewrite、php、および.htaccessファイルを</a>参照してください
ko: <a href="https://stackoverflow.com/q/265898">mod_rewrite, php 및 .htaccess 파일을</a> 참조하십시오
ru: Смотрите <a href="https://stackoverflow.com/q/265898">mod_rewrite, php и файл .htaccess</a>
zh_cn: 参见<a href="https://stackoverflow.com/q/265898">mod_rewrite，php和.htaccess文件</a>

source: See <a href="https://stackoverflow.com/questions/2978907/how-can-i-get-my-htaccess-to-work-subdomains">How can i get my htaccess to work (subdomains)?</a>
ja: <a href="https://stackoverflow.com/questions/2978907/how-can-i-get-my-htaccess-to-work-subdomains">htaccessを機能させるにはどうすればよいですか（サブドメイン）を</a>参照してください？
ko: <a href="https://stackoverflow.com/questions/2978907/how-can-i-get-my-htaccess-to-work-subdomains">htaccess를 어떻게 작동시킬 수 있습니까 (하위 도메인)?를</a> 참조하십시오 .
ru: См. <a href="https://stackoverflow.com/questions/2978907/how-can-i-get-my-htaccess-to-work-subdomains">Как я могу заставить свой htaccess работать (субдомены)?</a>
zh_cn: 请参阅<a href="https://stackoverflow.com/questions/2978907/how-can-i-get-my-htaccess-to-work-subdomains">如何使htaccess正常工作（子域）？</a>

source: See <a href="https://wiki.apache.org/httpd/RewriteLog">Apache RewriteLog</a> docs. For debugging you can enable it in the vhost sections:
ja: <a href="https://wiki.apache.org/httpd/RewriteLog">Apache RewriteLogの</a>ドキュメントを参照してください。 デバッグの場合は、vhostセクションで有効にできます。
ko: <a href="https://wiki.apache.org/httpd/RewriteLog">Apache RewriteLog</a> 문서를 참조하십시오. 디버깅을 위해 vhost 섹션에서이를 활성화 할 수 있습니다.
ru: См. Документы <a href="https://wiki.apache.org/httpd/RewriteLog">Apache RewriteLog</a> . Для отладки вы можете включить его в разделах vhost:
zh_cn: 请参阅<a href="https://wiki.apache.org/httpd/RewriteLog">Apache RewriteLog</a>文档。 要进行调试，您可以在vhost部分中启用它：

source: See also <a href="https://stackoverflow.com/questions/2252238/how-can-i-match-query-string-variables-with-mod-rewrite">How can I match query string variables with mod_rewrite?</a>
ja: <a href="https://stackoverflow.com/questions/2252238/how-can-i-match-query-string-variables-with-mod-rewrite">クエリ文字列変数をmod_rewriteと一致させるに</a>はどうすればよいですか？もご覧ください。
ko: <a href="https://stackoverflow.com/questions/2252238/how-can-i-match-query-string-variables-with-mod-rewrite">쿼리 문자열 변수를 mod_rewrite와 어떻게 일치시킬 수 있습니까?를</a> 참조하십시오 .
ru: Смотрите также <a href="https://stackoverflow.com/questions/2252238/how-can-i-match-query-string-variables-with-mod-rewrite">Как я могу сопоставить переменные строки запроса с mod_rewrite?</a>
zh_cn: 另请参阅<a href="https://stackoverflow.com/questions/2252238/how-can-i-match-query-string-variables-with-mod-rewrite">如何将查询字符串变量与mod_rewrite匹配？</a>

source: See also <a href="https://stackoverflow.com/questions/704102/how-does-rewritebase-work-in-htaccess">How does RewriteBase work in .htaccess</a>
ja: <a href="https://stackoverflow.com/questions/704102/how-does-rewritebase-work-in-htaccess">RewriteBaseが.htaccessでどのように機能するかも</a>参照してください。
ko: <a href="https://stackoverflow.com/questions/704102/how-does-rewritebase-work-in-htaccess">.htaccess에서 RewriteBase의 작동 방식을</a> 참조하십시오.
ru: Смотрите также <a href="https://stackoverflow.com/questions/704102/how-does-rewritebase-work-in-htaccess">Как RewriteBase работает в .htaccess</a>
zh_cn: 另请参见<a href="https://stackoverflow.com/questions/704102/how-does-rewritebase-work-in-htaccess">RewriteBase如何在.htaccess中工作</a>

source: See also:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: See also: <a href="https://stackoverflow.com/questions/27744603/css-js-and-images-do-not-display-with-pretty-url">CSS, JS and images do not display with pretty url</a>
ja: 参照： <a href="https://stackoverflow.com/questions/27744603/css-js-and-images-do-not-display-with-pretty-url">CSS、JS、画像がきれいなURLで表示されない</a>
ko: <a href="https://stackoverflow.com/questions/27744603/css-js-and-images-do-not-display-with-pretty-url">CSS, JS 및 이미지가 예쁜 URL로 표시되지 않음</a>
ru: Смотрите также: <a href="https://stackoverflow.com/questions/27744603/css-js-and-images-do-not-display-with-pretty-url">CSS, JS и изображения не отображаются с красивым URL</a>
zh_cn: 另请参阅： <a href="https://stackoverflow.com/questions/27744603/css-js-and-images-do-not-display-with-pretty-url">CSS，JS和图像无法以漂亮的网址显示</a>

source: See also: <a href="https://stackoverflow.com/questions/3655893">How do I transform my URL path segments into query string key-value pairs?</a>
ja: 参照： <a href="https://stackoverflow.com/questions/3655893">URLパスセグメントをクエリ文字列のキーと値のペアに変換するにはどうすればよいですか？</a>
ko: <a href="https://stackoverflow.com/questions/3655893">URL 경로 세그먼트를 쿼리 문자열 키-값 쌍으로 변환하려면 어떻게합니까?</a>
ru: См. Также: <a href="https://stackoverflow.com/questions/3655893">Как преобразовать сегменты пути URL-адреса в пары ключ-значение строки запроса?</a>
zh_cn: 另请参阅： <a href="https://stackoverflow.com/questions/3655893">如何将URL路径段转换为查询字符串键值对？</a>

source: See also: <a href="https://stackoverflow.com/questions/4908122/removing-the-php-extension-with-mod-rewrite">Removing the .php extension with mod_rewrite</a>
ja: 参照： <a href="https://stackoverflow.com/questions/4908122/removing-the-php-extension-with-mod-rewrite">mod_rewriteによる.php拡張子の削除</a>
ko: <a href="https://stackoverflow.com/questions/4908122/removing-the-php-extension-with-mod-rewrite">mod_rewrite를 사용하여 .php 확장자 제거</a>
ru: Смотрите также: <a href="https://stackoverflow.com/questions/4908122/removing-the-php-extension-with-mod-rewrite">Удаление расширения .php с помощью mod_rewrite</a>
zh_cn: 另请参阅： <a href="https://stackoverflow.com/questions/4908122/removing-the-php-extension-with-mod-rewrite">使用mod_rewrite删除.php扩展名</a>

source: See also: <a href="https://wiki.apache.org/httpd/RewriteHTTPToHTTPS">https://wiki.apache.org/httpd/RewriteHTTPToHTTPS</a>
ja: 参照： <a href="https://wiki.apache.org/httpd/RewriteHTTPToHTTPS">https</a> : //wiki.apache.org/httpd/RewriteHTTPToHTTPS
ko: 참조 : <a href="https://wiki.apache.org/httpd/RewriteHTTPToHTTPS">https://wiki.apache.org/httpd/RewriteHTTPToHTTPS</a>
ru: Смотрите также: <a href="https://wiki.apache.org/httpd/RewriteHTTPToHTTPS">https://wiki.apache.org/httpd/RewriteHTTPToHTTPS</a>
zh_cn: 另请参阅： <a href="https://wiki.apache.org/httpd/RewriteHTTPToHTTPS">https</a> : //wiki.apache.org/httpd/RewriteHTTPToHTTPS

source: See the <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html">official documentation</a> for all the possible flags and options.
ja: 可能なすべてのフラグとオプションについては、 <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html">公式ドキュメント</a>を参照してください。
ko: 가능한 모든 플래그 및 옵션에 대해서는 <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html">공식 문서</a> 를 참조하십시오.
ru: Смотрите <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html">официальную документацию</a> для всех возможных флагов и опций.
zh_cn: 有关所有可能的标志和选项，请参见<a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html">官方文档</a> 。

source: See: <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility">http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility</a>
ja: 参照： <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility">http</a> : //httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility
ko: 참조 : <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility">http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility</a>
ru: Смотрите: <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility">http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility</a>
zh_cn: 请参阅： <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility">http</a> : //httpd.apache.org/docs/2.4/rewrite/remapping.html#backward-compatibility

source: Serverfault: <strong>Everything you ever wanted to know about mod_rewrite</strong>
ja: Serverfault： <strong>mod_rewriteについて知りたいことすべて</strong>
ko: Serverfault : <strong>mod_rewrite에 대해 알고 싶은 모든 것</strong>
ru: Ошибка сервера: <strong>все, что вы когда-либо хотели знать о mod_rewrite</strong>
zh_cn: Serverfault： <strong>您想了解的有关mod_rewrite的所有信息</strong>

source: SetType or SetHandler for extensionless <code>.php</code> scripts
ja: 拡張子のない <code>.php</code> スクリプトのSetTypeまたはSetHandler
ko: 확장없는 <code>.php</code> 스크립트를위한 SetType 또는 SetHandler
ru: SetType или SetHandler для сценариев без расширения <code>.php</code>
zh_cn: 用于无扩展名 <code>.php</code> 脚本的SetType或SetHandler

source: Shortening a few page names to internal file schemes is most simple:
ja: いくつかのページ名を内部ファイルスキームに短縮するのが最も簡単です。
ko: 내부 파일 체계로 몇 개의 페이지 이름을 줄이는 것이 가장 간단합니다.
ru: Сокращение нескольких имен страниц до внутренних файловых схем является наиболее простым:
zh_cn: 将几个页面名称缩短为内部文件方案是最简单的。

source: Since Apache 2.4 you can also use the <code>[END]</code> flag. A matching rule with it will <em>completely</em> terminate further alias/rewrite processing. (Whereas the <code>[L]</code> flag can oftentimes trigger a second round, for example when rewriting into or out of subdirectories.)
ja: Apache 2.4以降では、 <code>[END]</code> フラグも使用できます。 それと一致するルールは、以降のエイリアス/書き換え処理を<em>完全に</em>終了します。 （たとえば、 <code>[L]</code> フラグは、たとえばサブディレクトリの内外に書き換えるときなどに、2回目のラウンドをトリガーすることがよくあります。）
ko: Apache 2.4부터 <code>[END]</code> 플래그를 사용할 수도 있습니다. 이것과 일치하는 규칙은 추가 별칭 / 다시 쓰기 처리를 <em>완전히</em> 종료합니다. (예를 들어 <code>[L]</code> 플래그는 종종 하위 디렉토리에 또는 외부 디렉토리를 다시 쓸 때와 같이 두 번째 라운드를 트리거 할 수 있습니다.)
ru: Начиная с Apache 2.4 вы также можете использовать флаг <code>[END]</code> . Соответствующее ему правило <em>полностью</em> прекратит дальнейшую обработку псевдонима / перезаписи. (Принимая во внимание, что флаг <code>[L]</code> часто может инициировать второй раунд, например, при перезаписи в или из подкаталогов.)
zh_cn: 从Apache 2.4开始，您还可以使用 <code>[END]</code> 标志。 与之匹配的规则将<em>完全</em>终止进一步的别名/重写处理。 （而 <code>[L]</code> 标志通常可以触发第二轮，例如在重写子目录或从子目录中重写时。）

source: Slug-style placeholders
ja: スラッグスタイルのプレースホルダ
ko: 슬러그 스타일 플레이스 홀더
ru: Слизняки-плательщики
zh_cn: 软木塞式的占位符

source: Slugs with numeric prefixes
ja: 数字の接頭辞を持つナメクジ
ko: 숫자 접두사가있는 슬러그
ru: Пули с цифровыми префиксами
zh_cn: 带数字前缀的蛞蝓

source: So at some point you're rewriting your HTML pages to carry only pretty links, as <a href="https://stackoverflow.com/a/20563773#~What+mod_rewrite+does+not+do">outlined by deceze</a>. Meanwhile you'll still receive requests for the <em>old</em> paths, sometimes even from bookmarks. As <em>workaround</em>, you can ping-pong browsers to display/establish the new URLs.
ja: したがって、 <a href="https://stackoverflow.com/a/20563773#~What+mod_rewrite+does+not+do">decezeで概説されているように</a> 、ある時点でHTMLページを書き直して、きれいなリンクのみを運ぶようにします 。 その間、まだブックマークから、 <em>古い</em>パスのリクエストを受け取ることもあります。 <em>回避策</em>として、ブラウザにピンポンして新しいURLを表示/確立できます。
ko: 따라서 어느 시점에서 <a href="https://stackoverflow.com/a/20563773#~What+mod_rewrite+does+not+do">deceze</a> 로 요약 된 것처럼 예쁜 링크 만 전달하도록 HTML 페이지를 다시 작성합니다. 그 사이에도 여전히 <em>이전</em> 경로에 대한 요청이, 때로는 책갈피로부터도 수신됩니다. <em>해결 방법</em> 으로 핑퐁 브라우저를 사용하여 새 URL을 표시 / 설정할 수 있습니다.
ru: Так что в какой-то момент вы переписываете свои HTML-страницы, чтобы содержать только красивые ссылки, как <a href="https://stackoverflow.com/a/20563773#~What+mod_rewrite+does+not+do">обрисовано</a> в общих чертах deceze . Между тем вы все равно будете получать запросы на <em>старые</em> пути, иногда даже из закладок. В качестве <em>обходного пути</em> вы можете пинг-понг браузеры для отображения / установки новых URL-адресов.
zh_cn: 因此，在某些时候，您正在重写HTML页面，以仅包含漂亮的链接（如<a href="https://stackoverflow.com/a/20563773#~What+mod_rewrite+does+not+do">deceze概述）</a> 。 同时，您仍然会收到<em>旧</em>路径的请求，有时甚至来自书签。 <em>解决方法是</em> ，您可以对浏览器进行乒乓球显示/建立新的URL。

source: Stack Overflow has <em>many</em> other great resources to get started:
ja: Stack Overflowには<em>、</em>他にも<em>多く</em>の優れたリソースがあります。
ko: 스택 오버플로에는 시작할 수있는 다른 많은 리소스가 있습니다.
ru: Stack Overflow имеет <em>много</em> других полезных ресурсов для начала:
zh_cn: 堆栈溢出还有<em>许多</em>其他入门资源：

source: Static mapping
ja: 静的マッピング
ko: 정적 매핑
ru: Статическое картирование
zh_cn: 静态映射

source: Still you'd <em>often</em> want to have the most specific rules (fixed string <code>/forum/&hellip;</code> patterns, or more restrictive placeholders <code>[^/.]+</code>) in the <em>early</em> rules. Generic slurp-all rules (<code>.*</code>) are better left to the <em>later</em> ones. (An exception is a <code>RewriteCond -f/-d</code> guard as primary block.)
ja: それでも、 <em>多くの場合</em> 、 <em>初期の</em>ルールに最も具体的なルール（固定文字列 <code>/forum/&hellip;</code> パターン、またはより限定的なプレースホルダー <code>[^/.]+</code> ）を<em>含める必要があり</em>ます。 一般的なスラップオールルール（ <code>.*</code> ）は、 <em>後の</em>ルールに任せた方がよいでしょう。 （例外は、プライマリブロックとしての <code>RewriteCond -f/-d</code> ガードです。）
ko: 여전히 <em>초기</em> 규칙에서 가장 구체적인 규칙 (고정 문자열 <code>/forum/&hellip;</code> 패턴 또는보다 제한적인 자리 표시 자 <code>[^/.]+</code> )을 원할 것입니다. 일반적인 말 괄호 규칙 ( <code>.*</code> )이 <em>나중</em> 규칙에 더 유리합니다. (기본 블록으로서의 <code>RewriteCond -f/-d</code> 보호는 예외입니다.)
ru: Тем не менее, в <em>ранних</em> правилах вы <em>часто</em> хотели бы иметь самые конкретные правила (шаблоны с фиксированной строкой <code>/forum/&hellip;</code> или более ограничительные заполнители <code>[^/.]+</code> ). Обычные правила slurp-all ( <code>.*</code> ) Лучше оставить более <em>поздним</em> . (Исключением является защита <code>RewriteCond -f/-d</code> в качестве основного блока.)
zh_cn: 仍然需要在<em>早期</em>规则中使用最具体的规则（固定的字符串 <code>/forum/&hellip;</code> 模式，或更严格的占位符 <code>[^/.]+</code> ）。 通用的所有规则（ <code>.*</code> ）最好留给<em>后面</em>的规则。 （一个例外是 <code>RewriteCond -f/-d</code> 保护作为主要块。）

source: Stylesheets and images stop working
ja: スタイルシートと画像が動かなくなる
ko: 스타일 시트 및 이미지 작동이 중지됩니다
ru: Таблицы стилей и изображения перестают работать
zh_cn: 樣式表和圖像停止工作

source: That yields a detailed summary of how incoming request paths get modified by each rule:
ja: これにより、各ルールによってどのようにリクエストパスが変更されるかの詳細な要約が得られます。
ko: 그러면 각 요청에 따라 들어오는 요청 경로가 어떻게 수정되는지에 대한 자세한 요약이 제공됩니다.
ru: Это дает детальную информацию о том,как входящие пути запросов изменяются каждым правилом:
zh_cn: 这就得出了每个规则如何修改传入的请求路径的详细摘要。

source: The above rewrite would allow you to link to something like <code>/blog/1/foo/</code> and it would actually load <code>/blog/index.php?id=1&amp;title=foo</code>.
ja: 上記の書き換えにより、 <code>/blog/1/foo/</code> ようなものにリンクでき、実際には <code>/blog/index.php?id=1&amp;title=foo</code> がロードされます 。
ko: 위의 다시 쓰기를 사용하면 <code>/blog/1/foo/</code> 와 같은 링크에 연결할 수 있으며 실제로 <code>/blog/index.php?id=1&amp;title=foo</code> 로드 됩니다 .
ru: Переписанное выше позволит вам сделать ссылку на что-то вроде <code>/blog/1/foo/</code> и на самом деле загрузит <code>/blog/index.php?id=1&amp;title=foo</code> .
zh_cn: 上面的重写将允许您链接到 <code>/blog/1/foo/</code> ，它实际上将加载 <code>/blog/index.php?id=1&amp;title=foo</code> 。

source: The complete RewriteRule set, but <em>also</em> single out the presumed defective one.
ja: 完全なRewriteRuleセットですが、推定欠陥のあるもの<em>も</em>選択されます。
ko: 전체 RewriteRule 세트는 물론 결함이있는 것으로 간주합니다.
ru: Полный набор RewriteRule, но <em>также</em> и предполагаемый дефектный.
zh_cn: 完整的RewriteRule集，但<em>也</em>可以选择假定的缺陷集。

source: The default configuration of most web servers is to look for a file that matches the URL on the hard disk. If the <em>document root</em> of the server is set to, say, <code>/var/www</code>, it may look whether the file <code>/var/www/foo/bar.html</code> exists and serve it if so. If the file ends in ".php" it will invoke the PHP interpreter and <em>then</em> return the result. All this association is completely configurable; a file doesn't have to end in ".php" for the web server to run it through the PHP interpreter, and the URL doesn't have to match any particular file on disk for something to happen.
ja: ほとんどのWebサーバーのデフォルト構成では、ハードディスク上のURLと一致するファイルを探します。 サーバーの<em>ドキュメントルート</em>が <code>/var/www</code> に設定されている場合、ファイル <code>/var/www/foo/bar.html</code> が存在するかどうかを調べ、存在する場合はそれを提供します。 ファイルが「.php」で終わる場合は、PHPインタープリターが呼び出され、結果が返されます。 この関連付けはすべて完全に構成可能です。 WebサーバーがPHPインタープリターを介してファイルを実行するために、ファイルの末尾が「.php」である必要はありません。URLは、何かが発生するためにディスク上の特定のファイルと一致する必要はありません。
ko: 대부분의 웹 서버의 기본 구성은 하드 디스크의 URL과 일치하는 파일을 찾는 것입니다. 서버의 <em>문서 루트</em> 가 <code>/var/www</code> 로 설정되어 있으면 <code>/var/www/foo/bar.html</code> 파일이 있는지 확인하여 파일을 제공 할 수 있습니다. 파일이 ".php"로 끝나면 PHP 인터프리터를 호출 <em>한 다음</em> 결과 <em>를</em> 반환합니다. 이 모든 연관성을 완전히 구성 할 수 있습니다. 웹 서버가 PHP 인터프리터를 통해 파일을 실행하기 위해 파일이 ".php"로 끝나지 않아도되며 URL은 디스크의 특정 파일과 일치하지 않아도 발생합니다.
ru: Конфигурация по умолчанию для большинства веб-серверов заключается в поиске файла, соответствующего URL-адресу на жестком диске. Если <em>корневым</em> каталогом сервера является, скажем, <code>/var/www</code> , он может посмотреть, существует ли файл <code>/var/www/foo/bar.html</code> , и обработать его, если это так. Если файл оканчивается на &laquo;.php&raquo;, он вызовет интерпретатор PHP, а <em>затем</em> вернет результат. Вся эта ассоциация полностью настраивается; файл не должен заканчиваться на &laquo;.php&raquo;, чтобы веб-сервер мог запустить его через интерпретатор PHP, а URL-адрес не должен совпадать с каким-либо конкретным файлом на диске, чтобы что-то произошло.
zh_cn: 大多数Web服务器的默认配置是在硬盘上查找与URL匹配的文件。 如果服务器的<em>文档根目录</em>设置为 <code>/var/www</code> ，则可能会查看文件 <code>/var/www/foo/bar.html</code> 是否存在并提供文件。 如果文件以&ldquo; .php&rdquo;结尾，它将调用PHP解释器， <em>然后</em>返回结果。 所有这些关联都是完全可配置的。 文件不必以&ldquo; .php&rdquo;结尾，Web服务器就可以通过PHP解释器运行该文件，并且URL不必与磁盘上的任何特定文件匹配就可以进行操作。

source: The first set of brackets - <code>([0-9]+)</code> - matches a string with a minimum of 1 character in length and with only numeric values (i.e. 0-9). This can be referenced with <code>$1</code> in the right hand side of the rule
ja: 大括弧の最初のセット- <code>([0-9]+)</code> -は、長さが1文字以上で数値のみ（つまり0-9）のストリングと一致します。 これは、ルールの右側にある <code>$1</code> で参照できます
ko: 첫 번째 대괄호 세트 <code>([0-9]+)</code> 는 최소 1 자 길이의 문자열과 숫자 값 (예 : 0-9) 만 일치합니다. 이것은 규칙의 오른쪽에 <code>$1</code> 로 참조 될 수 있습니다
ru: Первый набор скобок - <code>([0-9]+)</code> - соответствует строке длиной не менее 1 символа и только числовыми значениями (т. Е. 0-9). На это можно сослаться с <code>$1</code> в правой части правила
zh_cn: 第一组方括号- <code>([0-9]+)</code> -匹配长度至少为1个字符且仅包含数字值（即0-9）的字符串。 可以在规则的右侧用 <code>$1</code> 进行引用

source: The following examples are PHP-centric and a bit more incremental, easier to adapt for similar cases. They're just summaries, often link to more variations or detailed Q&amp;As.
ja: 次の例はPHP中心であり、少しずつ増分されており、同様のケースに適応しやすくなっています。 これらは単なる要約であり、多くの場合、より多くのバリエーションや詳細なQ＆Aにリンクしています。
ko: 다음 예제는 PHP 중심이며 조금 더 점진적이며 유사한 경우에 더 쉽게 적용 할 수 있습니다. 그것들은 요약 일 뿐이며, 종종 더 많은 변형이나 상세한 Q &amp; A에 연결됩니다.
ru: Следующие примеры ориентированы на PHP и немного более инкрементны, их легче адаптировать для подобных случаев. Это просто резюме, часто ссылающиеся на дополнительные варианты или подробные вопросы и ответы.
zh_cn: 以下示例以PHP为中心，并且增量更多，更易于适应类似情况。 它们只是摘要，通常链接到更多变体或详细的问答。

source: The last flag indicates that this is the last rule that should be processed. This means that if and only if this rule matches, no further rules will be evaluated in the current rewrite processing run. If the rule does not match, all other rules will be tried in order as usual. If you do not set the <code>L</code> flag, all following rules will be applied to the <em>rewritten</em> URL afterwards.
ja: 最後のフラグは、これが処理する必要がある最後のルールであることを示します。 これは、このルールが一致する場合にのみ、現在の書き換え処理の実行でそれ以上のルールが評価されないことを意味します。 ルールが一致しない場合、他のすべてのルールが通常どおり順番に試行されます。 <code>L</code> フラグを設定しない場合、以降のすべてのルールが、 <em>書き換えられた</em> URLに後で適用さ<em>れ</em>ます。
ko: 마지막 플래그는 이것이 처리되어야하는 마지막 규칙임을 나타냅니다. 이는이 규칙이 일치하는 경우에만 현재 다시 쓰기 처리 실행에서 더 이상 규칙이 평가되지 않음을 의미합니다. 규칙이 일치하지 않으면 평소대로 다른 모든 규칙이 시도됩니다. <code>L</code> 플래그를 설정하지 않으면 나중에 다음 규칙이 <em>다시 작성된</em> URL에 적용됩니다.
ru: Последний флаг указывает, что это последнее правило, которое должно быть обработано. Это означает, что если и только если это правило совпадает, никакие дальнейшие правила не будут оцениваться в текущем прогоне обработки перезаписи. Если правило не совпадает, все остальные правила будут опробованы в обычном порядке. Если вы не установите флаг <code>L</code> , все последующие правила будут применены к <em>переписанному</em> URL после этого.
zh_cn: 最后一个标志指示这是应该处理的最后一条规则。 这意味着，当且仅当此规则匹配时，在当前重写处理运行中不会再评估其他规则。 如果该规则不匹配，则将照常尝试所有其他规则。 如果您未设置 <code>L</code> 标志，则随后的所有以下规则将应用于<em>重写的</em> URL。

source: The leading slash <code>^/</code> won't match
ja: 先頭のスラッシュ <code>^/</code> が一致しません
ko: 선행 슬래시 <code>^/</code> 는 일치하지 않습니다
ru: Начальная косая черта <code>^/</code> не будет совпадать
zh_cn: 前导斜杠 <code>^/</code> 不匹配

source: The no case flag means that the rewrite rule is case insensitive, so for the example rule above this would mean that both <code>/blog/1/foo/</code> and <code>/BLOG/1/foo/</code> (or any variation of this) would be matched.
ja: no caseフラグは、書き換えルールが大文字と小文字を区別しないことを意味します。したがって、上記の例のルールの場合、これは <code>/blog/1/foo/</code> と <code>/BLOG/1/foo/</code> （またはこれのバリエーション）の両方が一致することを意味します。
ko: 대소 문자 없음 플래그는 다시 쓰기 규칙이 대소 문자를 구분하지 않음을 의미하므로 위의 규칙 예에서는 <code>/blog/1/foo/</code> 및 <code>/BLOG/1/foo/</code> (또는이 변형)가 모두 일치 함을 의미합니다.
ru: Флаг отсутствия регистра означает, что правило перезаписи нечувствительно к регистру, поэтому для приведенного выше примера правила это будет означать, что оба <code>/blog/1/foo/</code> и <code>/BLOG/1/foo/</code> (или любой другой вариант этого) будут сопоставлены.
zh_cn: no case标志表示重写规则不区分大小写，因此对于上面的示例规则，这将意味着 <code>/blog/1/foo/</code> 和 <code>/BLOG/1/foo/</code> （或其任何变体）都将匹配。
