Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <sup>(Keep in mind to remove the slash in <code>^/</code> pattern prefixes for <code>.htaccess</code> usage.)</sup>
ja: <sup>（ <code>.htaccess</code> を使用する場合は、 <code>^/</code> パターン接頭辞のスラッシュを削除することを忘れないでください。）</sup>
ko: <sup>( <code>.htaccess</code> 사용을 위해 <code>^/</code> 패턴 접두사에서 슬래시를 제거하십시오.)</sup>
ru: <sup>(Не забудьте удалить косую черту в префиксах <code>^/</code> pattern для использования <code>.htaccess</code> .)</sup>
zh_cn: <sup>（请记住要删除 <code>.htaccess</code> 用法的 <code>^/</code> 模式前缀中的斜杠。）</sup>

source: <sup><a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html">Apache manual - mod_rewrite intro</a>, Copyright 2015 The Apache Software Foundation, AL-2.0</sup>
ja: <sup><a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html">Apacheマニュアル-mod_rewrite intro</a> 、Copyright 2015 The Apache Software Foundation、AL-2.0</sup>
ko: <sup><a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html">아파치 매뉴얼-mod_rewrite intro</a> , Copyright 2015 The Apache Software Foundation, AL-2.0</sup>
ru: <sup><a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html">Руководство по Apache - введение в mod_rewrite</a> , Copyright 2015 Фонд программного обеспечения Apache, AL-2.0</sup>
zh_cn: <sup><a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html">Apache手册-mod_rewrite简介</a> ，版权所有2015 The Apache Software Foundation，AL-2.0</sup>

source: A common misinterpetation is that a RewriteCond blocks multiple RewriteRules (because they're visually arranged together):
ja: よくある誤解は、RewriteCondが複数のRewriteRuleをブロックしているということです(視覚的に一緒に配置されているため)。
ko: 일반적인 오해는 RewriteCond가 여러 RewriteRules를 시각적으로 정렬하여 차단한다는 것입니다.
ru: Обычная ошибка заключается в том,что RewriteCond блокирует несколько RewriteRules (потому что они визуально расположены вместе):
zh_cn: 一个常见的误区是,一个RewriteCond阻挡了多个RewriteRules(因为它们在视觉上排列在一起)。

source: A common variation is to have optional prefixes <em>within</em> a rule. This usually makes sense if you have static strings or more constrained placeholders around:
ja: 一般的なバリエーションは、オプションのプレフィックス<em>を</em>ルール<em>内に</em>含めることです。 これは通常、静的な文字列や制約されたプレースホルダーがある場合に意味があります。
ko: 일반적인 변형은 규칙 <em>내에</em> 선택적 접두사 <em>를 사용</em> 하는 것입니다. 정적 문자열이나 더 제한된 자리 표시자가있는 경우 일반적으로 의미가 있습니다.
ru: Распространенным вариантом является наличие необязательных префиксов <em>в</em> правиле. Обычно это имеет смысл, если у вас есть статические строки или более ограниченные заполнители:
zh_cn: 一个常见的变化是<em>在</em>规则中具有可选的前缀。 如果您有静态字符串或更多受约束的占位符，通常这是有意义的：

source: A more directed approach to avoid carrying around <code>.php</code> suffixes in URLs is <a href="http://php.net/manual/en/security.hiding.php">configuring the PHP handler</a> for other file schemes. The simplest option is overriding the default MIME/handler type via <code>.htaccess</code>:
ja: URLで <code>.php</code> サフィックスの持ち越しを回避するためのより直接的なアプローチは、他のファイルスキーム用に<a href="http://php.net/manual/en/security.hiding.php">PHPハンドラー</a>を構成することです。 最も簡単なオプションは、デフォルトのMIME /ハンドラタイプを <code>.htaccess</code> でオーバーライドすることです。
ko: URL에서 <code>.php</code> 접미사를 사용하지 않는보다 직접적인 접근 방식은 다른 파일 체계에 맞게 <a href="http://php.net/manual/en/security.hiding.php">PHP 처리기</a> 를 구성하는 것 입니다. 가장 간단한 옵션은 <code>.htaccess</code> 를 통해 기본 MIME / 핸들러 유형을 재정의하는 것입니다.
ru: Более направленным подходом, позволяющим избежать переноса суффиксов <code>.php</code> в URL, является <a href="http://php.net/manual/en/security.hiding.php">настройка обработчика PHP</a> для других схем файлов. Самый простой вариант - переопределить тип MIME / обработчика по умолчанию через <code>.htaccess</code> :
zh_cn: 避免在URL中携带 <code>.php</code> 后缀的更直接的方法是为其他文件方案<a href="http://php.net/manual/en/security.hiding.php">配置PHP处理程序</a> 。 最简单的选项是通过 <code>.htaccess</code> 覆盖默认的MIME /处理程序类型：

source: A more practical use of alternative lists are mapping request paths to distinct scripts. For example to provide uniform URLs for an older and a newer web application based on dates:
ja: 代替リストのより実用的な使い方としては、リクエストパスを別個のスクリプトにマッピングすることがあります。例えば、古いウェブアプリケーションと新しいウェブアプリケーションのために、日付に基づいて統一されたURLを提供することができます。
ko: 대체 목록의보다 실용적인 사용은 요청 경로를 고유 한 스크립트로 맵핑하는 것입니다. 예를 들어 날짜를 기준으로 이전 및 최신 웹 응용 프로그램에 균일 한 URL을 제공하려면 다음을 수행하십시오.
ru: Более практичным использованием альтернативных списков является сопоставление путей запроса с отдельными сценариями.Например,для предоставления единообразных URL для старого и более нового веб-приложения на основе дат:
zh_cn: 替代列表的一个更实际的用途是将请求路径映射到不同的脚本。例如,根据日期为一个较旧的和一个较新的Web应用提供统一的URL。

source: A request for <code>/article/123</code> for example could map to <code>article.php</code> with a <code>/123</code> PATH_INFO implicitly. You'd either have to guard your rules then with the commonplace <code>RewriteCond</code><code>!-f</code>+<code>!-d</code>, and/or disable PATH_INFO support, or perhaps just disable <code>Options -MultiViews</code>.
ja: たとえば、 <code>/article/123</code> のリクエストは、暗黙的に <code>/123</code> PATH_INFOを使用して <code>article.php</code> にマップできます。 次に、一般的な <code>RewriteCond</code> <code>!-f</code> + <code>!-d</code> でルールを保護するか、PATH_INFOサポートを無効にするか、単に <code>Options -MultiViews</code> を無効にする必要があります。
ko: 예를 들어 <code>/article/123</code> 에 대한 요청은 암시 적으로 <code>/123</code> PATH_INFO를 사용하여 <code>article.php</code> 에 매핑 될 수 있습니다. 일반 <code>RewriteCond</code> <code>!-f</code> + <code>!-d</code> 규칙을 지키거나 PATH_INFO 지원을 비활성화하거나 <code>Options -MultiViews</code> 만 비활성화 해야 합니다.
ru: Например, запрос для <code>/article/123</code> может отображаться в <code>article.php</code> с неявным значением <code>/123</code> PATH_INFO. Тогда вам придется либо защищать свои правила с помощью обычного <code>RewriteCond</code> <code>!-f</code> + <code>!-d</code> и / или отключить поддержку PATH_INFO, либо, возможно, просто отключить <code>Options -MultiViews</code> .
zh_cn: 例如，对 <code>/article/123</code> 的请求可以隐式地映射到具有 <code>/123</code> PATH_INFO的 <code>article.php</code> 。 您要么必须使用常见的 <code>RewriteCond</code> <code>!-f</code> + <code>!-d</code> 来保护自己的规则，要么禁用PATH_INFO支持，要么仅禁用 <code>Options -MultiViews</code> 。

source: Again take note that such settings propagate from one <code>.htaccess</code> to subfolders. You always should disable script execution (<code>SetHandler None</code> and <code>Options -Exec</code> or <code>php_flag engine off</code> etc.) for static resources, and upload/ directories etc.
ja: このような設定は、1つの <code>.htaccess</code> からサブフォルダに伝達されることに注意してください。 静的リソース、アップロード/ディレクトリなどに対しては、スクリプトの実行を常に無効にする必要があります（ <code>SetHandler None</code> や <code>Options -Exec</code> またはphp_flag <code>php_flag engine off</code> など）。
ko: 이러한 설정은 하나의 <code>.htaccess</code> 에서 하위 폴더로 전파됩니다. 정적 리소스에 대해서는 항상 스크립트 실행 ( <code>SetHandler None</code> 및 <code>Options -Exec</code> 또는 <code>php_flag engine off</code> 등)을 비활성화하고 업로드 / 디렉토리 등을 사용해야합니다 .
ru: Снова обратите внимание, что такие настройки распространяются из одного <code>.htaccess</code> в подпапки. Вы всегда должны отключить выполнение скрипта ( <code>SetHandler None</code> и <code>Options -Exec</code> или <code>php_flag engine off</code> и т. Д.) Для статических ресурсов, а также для загрузки / каталогов и т. Д.
zh_cn: 再次注意，这些设置从一个 <code>.htaccess</code> 传播到子文件夹。 您始终应该为静态资源，上传/目录等禁用脚本执行（ <code>SetHandler None</code> 和 <code>Options -Exec</code> 或 <code>php_flag engine off</code> 等）。

source: Aliasing old .html paths to .php scripts
ja: 古い .html パスを .php スクリプトにエイリアスする
ko: 오래된 .html 경로를 .php 스크립트로 별칭 지정
ru: Псевдонизирование старых .html-путей к .php-скриптам.
zh_cn: 将旧的.html路径别名化为.php脚本

source: All of the below examples assume that you have already included <code>RewriteEngine On</code> in your <code>.htaccess</code> file.
ja: 以下の例はすべて、 <code>.htaccess</code> ファイルに <code>RewriteEngine On</code> がすでに含まれていることを前提としています。
ko: 아래 예제는 모두 <code>.htaccess</code> 파일에 <code>RewriteEngine On</code> 을 이미 포함했다고 가정합니다.
ru: Все приведенные ниже примеры предполагают, что вы уже включили <code>RewriteEngine On</code> в свой файл <code>.htaccess</code> .
zh_cn: 以下所有示例均假定您已在 <code>.htaccess</code> 文件中包括 <code>RewriteEngine On</code> 。

source: Alternatively you can utilize PHPs array parameters via <code>?p[]=$1&amp;p[]=$2&amp;p[]=3</code> query string here - if your script merely prefers them pre-split. (Though it's more common to just use a catch-all rule, and let the script itself expand the segments out of the REQUEST_URI.)
ja: あるいは、ここで <code>?p[]=$1&amp;p[]=$2&amp;p[]=3</code> クエリ文字列を介してPHPの配列パラメーターを利用することもできます-スクリプトが単に事前分割することを好む場合。 （キャッチオールルールを使用し、スクリプト自体がREQUEST_URIからセグメントを拡張することが一般的ですが）。
ko: 또는 <code>?p[]=$1&amp;p[]=$2&amp;p[]=3</code> 쿼리 문자열을 통해 PHP 배열 매개 변수를 활용할 수 있습니다. 스크립트가 단순히 사전 분할을 선호하는 경우. (포괄적 인 규칙 만 사용하고 스크립트 자체가 REQUEST_URI에서 세그먼트를 확장하도록하는 것이 더 일반적이지만)
ru: В качестве альтернативы вы можете использовать параметры массива PHP через <code>?p[]=$1&amp;p[]=$2&amp;p[]=3</code> строки запроса здесь - если ваш скрипт просто предпочитает их предварительно разделить. (Хотя более распространенным является использование правила перехвата всех и позволить самому сценарию расширять сегменты из REQUEST_URI.)
zh_cn: 或者，您可以在此处通过 <code>?p[]=$1&amp;p[]=$2&amp;p[]=3</code> 查询字符串来使用PHP数组参数-如果您的脚本只希望将它们预分割。 （尽管更普遍的是只使用包罗万象的规则，然后让脚本本身将这些段扩展到REQUEST_URI之外。）

source: Alternatives to mod_rewrite
ja: mod_rewrite の代替
ko: mod_rewrite의 대안
ru: Альтернативы mod_rewrite
zh_cn: mod_rewrite的替代产品

source: Among its many options, Apache provides <code>mod_alias</code> features - which sometimes work just as well as <code>mod_rewrite</code>s RewriteRules. Note that most of those must be set up in a <code>&lt;VirtualHost&gt;</code> section however, not in per-directory <code>.htaccess</code> config files.
ja: その多くのオプションの中で、Apacheは <code>mod_alias</code> 機能を提供します-これは <code>mod_rewrite</code> のRewriteRulesと同じように機能する場合があります。 ただし、これらのほとんどは <code>&lt;VirtualHost&gt;</code> セクションで設定する必要がありますが、ディレクトリごとの <code>.htaccess</code> 構成ファイルでは設定しないでください。
ko: 많은 옵션 중에서 Apache는 <code>mod_alias</code> 기능을 제공합니다. 때로는 <code>mod_rewrite</code> 의 RewriteRules와 마찬가지로 작동합니다. 그러나 이들 중 대부분은 디렉토리 별 <code>.htaccess</code> 구성 파일이 아니라 <code>&lt;VirtualHost&gt;</code> 섹션에서 설정해야합니다.
ru: Среди множества опций Apache предоставляет функции <code>mod_alias</code> , которые иногда работают так же хорошо, как и <code>mod_rewrite</code> s RewriteRules. Обратите внимание, что большинство из них должны быть настроены в разделе <code>&lt;VirtualHost&gt;</code> , но не в конфигурационных файлах <code>.htaccess</code> для каждого каталога.
zh_cn: Apache提供了许多选项，其中包括 <code>mod_alias</code> 功能-有时与 <code>mod_rewrite</code> 的RewriteRules一样有效。 请注意，其中大多数必须在 <code>&lt;VirtualHost&gt;</code> 部分中设置，而不是在每个目录的 <code>.htaccess</code> 配置文件中设置。

source: An excerpt from your <code>access.log</code> and <code>error.log</code> to verify what the existing rules resolved to. Better yet, a <code>rewrite.log</code> summary.
ja: 既存のルールが解決した内容を確認するための <code>access.log</code> および <code>error.log</code> からの抜粋。 さらに良いのは、 <code>rewrite.log</code> の概要です。
ko: <code>access.log</code> 및 <code>error.log</code> 에서 발췌하여 기존 규칙이 해결 된 내용을 확인합니다. 더 좋은 것은 <code>rewrite.log</code> 요약입니다.
ru: Выдержка из вашего <code>access.log</code> и <code>error.log</code> , чтобы проверить, к чему разрешают существующие правила. Еще лучше, резюме <code>rewrite.log</code> .
zh_cn: 您的 <code>access.log</code> 和 <code>error.log</code> 的摘录，以验证现有规则解决的问题。 更好的是一个 <code>rewrite.log</code> 摘要。

source: And a plain <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#alias"><code>Alias</code></a> helps with a few simple rewriting schemes as well.
ja: プレーンな<a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#alias"> <code>Alias</code> </a>は、いくつかの簡単な書き換えスキーマにも役立ちます。
ko: 그리고 일반 <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#alias"> <code>Alias</code> </a> 은 몇 가지 간단한 재 작성 체계에도 도움이됩니다.
ru: И простой <a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#alias"> <code>Alias</code> </a> помогает с несколькими простыми схемами переписывания.
zh_cn: 普通的<a href="http://httpd.apache.org/docs/2.2/mod/mod_alias.html#alias"> <code>Alias</code> </a>可以帮助一些简单的重写方案。

source: And it's commonly distributed for default <code>.htaccess</code> rulesets with many open source projects. There it's just meant as fallback, and keeps "ugly" URLs work as default.
ja: また、多くのオープンソースプロジェクトでデフォルトの <code>.htaccess</code> ルールセットに配布されます。 そこでは単にフォールバックとして意図されており、「醜い」URLをデフォルトとして機能させ続けます。
ko: 그리고 많은 오픈 소스 프로젝트와 함께 기본 <code>.htaccess</code> 규칙 세트에 일반적으로 배포됩니다. 그것은 단지 폴백 (fallback)과 같은 의미이며 "추악한"URL을 기본값으로 유지합니다.
ru: И он обычно распространяется для наборов правил <code>.htaccess</code> по умолчанию со многими проектами с открытым исходным кодом. Там он просто подразумевается как запасной вариант и по умолчанию сохраняет &laquo;некрасивые&raquo; URL-адреса.
zh_cn: 通常，它与许多开源项目一起分发给默认的 <code>.htaccess</code> 规则集。 在这里，它只是作为备用广告，并保留&ldquo;丑陋&rdquo;的URL作为默认URL。

source: And newcomer-friendly regex overviews even:
ja: そして、新参者に優しい正規表現の概要まで。
ko: 그리고 새로 온 친절한 정규식 개요 :
ru: И даже удобные для новичков регекс-обзоры:
zh_cn: 而对新人友好的regex概述甚至。

source: And the <a href="/questions/tagged/mod-rewrite">mod-rewrite</a><a href="https://stackoverflow.com/tags/mod-rewrite/info">tag wiki references</a>.
ja: そして、 <a href="/questions/tagged/mod-rewrite">mod-rewrite</a> <a href="https://stackoverflow.com/tags/mod-rewrite/info">タグのwiki参照</a> 。
ko: 그리고 <a href="/questions/tagged/mod-rewrite">mod-rewrite</a> <a href="https://stackoverflow.com/tags/mod-rewrite/info">태그 위키 참조</a> .
ru: И <a href="/questions/tagged/mod-rewrite">мод-переписать</a> <a href="https://stackoverflow.com/tags/mod-rewrite/info">теги вики-ссылок</a> .
zh_cn: 和<a href="/questions/tagged/mod-rewrite">mod-rewrite</a> <a href="https://stackoverflow.com/tags/mod-rewrite/info">标签wiki参考</a> 。

source: And the short <a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html#regex">Apache regex summary</a>.
ja: そして、短い<a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html#regex">Apache正規表現の要約</a> 。
ko: 그리고 짧은 <a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html#regex">아파치 정규식 요약</a> .
ru: И краткое <a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html#regex">резюме по Apache</a> .
zh_cn: 以及简短的<a href="http://httpd.apache.org/docs/2.4/rewrite/intro.html#regex">Apache regex摘要</a> 。

source: Another often encountered rule is this:
ja: もう一つよく遭遇するルールがこれです。
ko: 자주 발생하는 또 다른 규칙은 다음과 같습니다.
ru: Другое часто встречающееся правило:
zh_cn: 另一个经常遇到的规则是这样的。

source: Apache <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html">redirecting and remapping</a> guide.
ja: Apache <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html">リダイレクトおよび再マッピング</a>ガイド。
ko: 아파치 <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html">리디렉션 및 리매핑</a> 가이드.
ru: Руководство по <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html">перенаправлению и переназначению</a> Apache.
zh_cn: Apache <a href="http://httpd.apache.org/docs/2.4/rewrite/remapping.html">重定向和重新映射</a>指南。

source: Apache and PHP versions, OS type, filesystem, DOCUMENT_ROOT, and PHPs <code>$_SERVER</code> environment if it's about a parameter mismatch.
ja: ApacheとPHPのバージョン、OSタイプ、ファイルシステム、DOCUMENT_ROOT、およびパラメーターの不一致に関するPHPの <code>$_SERVER</code> 環境。
ko: 매개 변수 불일치에 관한 Apache 및 PHP 버전, OS 유형, 파일 시스템, DOCUMENT_ROOT 및 PHP <code>$_SERVER</code> 환경.
ru: Версии Apache и PHP, тип ОС, файловая система, DOCUMENT_ROOT и среда PHPs <code>$_SERVER</code> если речь идет о несоответствии параметров.
zh_cn: Apache和PHP版本，操作系统类型，文件系统，DOCUMENT_ROOT和PHP <code>$_SERVER</code> 环境，如果这与参数不匹配有关。

source: As said before, you don't often want too generic rewrite patterns. It does however make sense to combine static and specific comparisons with a <code>.*</code> sometimes.
ja: 前に述べたように、あまりにも一般的な書き換えパターンを必要とすることはあまりありません。 ただし、静的な比較と特定の比較を <code>.*</code> と組み合わせることは意味があります。
ko: 앞에서 말했듯이 너무 일반적인 재 작성 패턴을 원하지 않는 경우가 많습니다. 그러나 정적 및 특정 비교를 때때로. <code>.*</code> 와 결합하는 것이 합리적입니다.
ru: Как уже говорилось ранее, вам не часто нужны слишком общие шаблоны перезаписи. Однако иногда имеет смысл комбинировать статические и специфические сравнения с <code>.*</code> .
zh_cn: 如前所述，您通常不需要太通用的重写模式。 但是，有时将静态比较和特定比较与 <code>.*</code> 组合在一起是有意义的。

source: As you might know, Stack Overflow is very suitable for asking questions on mod_rewrite. Make them <a href="https://stackoverflow.com/help/on-topic">on-topic</a> by including prior research and attempts (avoid redundant answers), demonstrate basic <a href="/questions/tagged/regex">regex</a> understanding, and:
ja: ご存知かもしれませんが、Stack Overflowはmod_rewriteに関する質問に非常に適しています。 以前の調査と試行を含めて（冗長な回答を避けて） <a href="https://stackoverflow.com/help/on-topic">トピックをオントピックに</a>し、基本的な<a href="/questions/tagged/regex">正規表現の</a>理解を示し、次のようにします。
ko: 아시다시피, 스택 오버플로는 mod_rewrite에 대한 질문을하는 데 매우 적합합니다. 사전 연구 및 시도를 포함하여 <a href="https://stackoverflow.com/help/on-topic">주제</a> 에 대한 토픽 을 만들고 (중복 답변은 피함) 기본적인 <a href="/questions/tagged/regex">정규식</a> 이해를 보여줍니다.
ru: Как вы, возможно, знаете, Stack Overflow очень подходит для того, чтобы задавать вопросы по mod_rewrite. Сделайте их <a href="https://stackoverflow.com/help/on-topic">тематическими</a> , включив предыдущие исследования и попытки (избегайте лишних ответов), продемонстрируйте базовое понимание <a href="/questions/tagged/regex">регулярных выражений</a> и:
zh_cn: 您可能知道，Stack Overflow非常适合在mod_rewrite上提问。 通过包括先前的研究和尝试（避免重复的答案），使它们成为<a href="https://stackoverflow.com/help/on-topic">主题</a> ，展示对<a href="/questions/tagged/regex">正则表达式的</a>基本理解，并：

source: AskApache <a href="http://www.askapache.com/htaccess/htaccess.html">ultimate .htaccess guide</a>
ja: AskApache <a href="http://www.askapache.com/htaccess/htaccess.html">究極の.htaccessガイド</a>
ru: AskApache <a href="http://www.askapache.com/htaccess/htaccess.html">Ultimate .htaccess руководство</a>
zh_cn: AskApache Ultimate <a href="http://www.askapache.com/htaccess/htaccess.html">.htaccess指南</a>

source: Capture the remainder
ja: 残りをキャプチャする
ko: 나머지를 캡처
ru: Захватить остальное
zh_cn: 捕获剩余部分

source: Catch-all for a <a href="https://stackoverflow.com/questions/8595964/redirect-all-traffic-to-index-php-using-mod-rewrite">central dispatcher</a> / front-controller script
ja: <a href="https://stackoverflow.com/questions/8595964/redirect-all-traffic-to-index-php-using-mod-rewrite">中央のディスパッチャー</a> /フロントコントローラーのスクリプトのキャッチオール
ko: <a href="https://stackoverflow.com/questions/8595964/redirect-all-traffic-to-index-php-using-mod-rewrite">중앙 디스패처</a> / 전면 컨트롤러 스크립트를위한 포괄
ru: Catch-all для сценария <a href="https://stackoverflow.com/questions/8595964/redirect-all-traffic-to-index-php-using-mod-rewrite">центрального диспетчера</a> / фронт-контроллера
zh_cn: 全面掌握<a href="https://stackoverflow.com/questions/8595964/redirect-all-traffic-to-index-php-using-mod-rewrite">中央调度员</a> /前端控制器脚本

source: Change the link to a pretty link:
ja: 可愛いリンクに変更します。
ko: 링크를 예쁜 링크로 변경하십시오.
ru: Измените ссылку на симпатичную:
zh_cn: 把链接改成漂亮的链接。

source: Check that your server has <a href="https://stackoverflow.com/questions/9234289/verify-if-htaccess-file-is-running"><code>AllowOverride All</code> enabled</a>. Otherwise your per-directory <code>.htaccess</code> directives will go ignored, and RewriteRules won't work.
ja: サーバーで<a href="https://stackoverflow.com/questions/9234289/verify-if-htaccess-file-is-running"> <code>AllowOverride All</code> が有効になっ</a>ていることを確認します。 そうしないと、ディレクトリごとの <code>.htaccess</code> ディレクティブが無視され、RewriteRulesが機能しません。
ko: 서버에 <a href="https://stackoverflow.com/questions/9234289/verify-if-htaccess-file-is-running"> <code>AllowOverride All</code> 이 활성화</a> 되어 있는지 확인하십시오. 그렇지 않으면 디렉토리 별 <code>.htaccess</code> 지시문이 무시되고 RewriteRules가 작동하지 않습니다.
ru: Убедитесь, что на вашем сервере <a href="https://stackoverflow.com/questions/9234289/verify-if-htaccess-file-is-running">включена <code>AllowOverride All</code> </a> . В противном случае ваши директивы <code>.htaccess</code> для каждого каталога будут игнорироваться, а RewriteRules не будет работать.
zh_cn: 检查您的服务器是否<a href="https://stackoverflow.com/questions/9234289/verify-if-htaccess-file-is-running">启用了 <code>AllowOverride All</code> </a> 。 否则，按目录的 <code>.htaccess</code> 指令将被忽略，并且RewriteRules将不起作用。

source: Clients serialize URLs with <code>+</code> or <code>%20</code> for spaces. Yet in RewriteRules they're interpreted with literal characters for all relative path segments.
ja: クライアントは、スペースに <code>+</code> または <code>%20</code> を使用してURLをシリアル化します。 しかし、RewriteRulesでは、すべての相対パスセグメントに対してリテラル文字で解釈されます。
ko: 클라이언트는 공백으로 <code>+</code> 또는 <code>%20</code> URL을 직렬화합니다. 그러나 RewriteRules에서는 모든 상대 경로 세그먼트에 대한 리터럴 문자로 해석됩니다.
ru: Клиенты сериализуют URL-адреса с <code>+</code> или <code>%20</code> для пробелов. Тем не менее в RewriteRules они интерпретируются буквальными символами для всех относительных сегментов пути.
zh_cn: 客户端使用 <code>+</code> 或 <code>%20</code> 的空格序列化URL。 但是在RewriteRules中，它们使用所有相对路径段的文字字符进行解释。

source: Comment your <code>.htaccess</code>
ja: <code>.htaccess</code> にコメントする
ko: 당신의 <code>.htaccess</code> 를 주석
ru: Прокомментируйте ваш <code>.htaccess</code>
zh_cn: 评论您的 <code>.htaccess</code>

source: Disable <code>MultiViews</code> when virtual paths overlap
ja: 仮想パスが重複する場合は <code>MultiViews</code> 無効にする
ko: 가상 경로가 겹칠 때 <code>MultiViews</code> 비활성화
ru: Отключить <code>MultiViews</code> , когда виртуальные пути перекрываются
zh_cn: 虚拟路径重叠时禁用 <code>MultiViews</code>

source: Dispatching related URLs to different backends
ja: 異なるバックエンドへの関連URLのディスパッチ
ko: 관련 URL을 다른 백엔드로 디스패치
ru: Отправка связанных URL-адресов на различные бэкэнды
zh_cn: 将相关的URL发送至不同的后端

source: Do's and Dont's in <a href="https://stackoverflow.com/questions/286004/hidden-features-of-mod-rewrite">Hidden features of mod_rewrite</a>.
ja: <a href="https://stackoverflow.com/questions/286004/hidden-features-of-mod-rewrite">mod_rewriteの非表示機能にす</a>べきこととすべきでないこと。
ko: 해야 할 것과하지 말아야 할 <a href="https://stackoverflow.com/questions/286004/hidden-features-of-mod-rewrite">것은 mod_rewrite의 숨겨진 기능입니다</a> .
ru: Что можно и нельзя делать в <a href="https://stackoverflow.com/questions/286004/hidden-features-of-mod-rewrite">скрытых функциях mod_rewrite</a> .
zh_cn: 在<a href="https://stackoverflow.com/questions/286004/hidden-features-of-mod-rewrite">mod_rewrite</a>的隐藏功能中执行和不执行。

source: Don't use <code>RewriteBase</code> unless needed
ja: 必要な場合 <code>RewriteBase</code> 使用しないでください
ko: 필요한 경우가 아니면 <code>RewriteBase</code> 를 사용하지 마십시오
ru: Не используйте <code>RewriteBase</code> без необходимости
zh_cn: 除非需要，否则不要使用 <code>RewriteBase</code>

source: Each of these placeholders is usually wrapped in <code>(&hellip;)</code> parentheses as capture group. And the whole pattern often in <code>^&hellip;&hellip;&hellip;$</code> start + end markers. Quoting "patterns" is optional.
ja: これらの各プレースホルダーは通常、キャプチャグループとして <code>(&hellip;)</code> 括弧で囲まれます。 そして、パターン全体はしばしば <code>^&hellip;&hellip;&hellip;$</code> 開始+終了マーカーで示されます。 「パターン」の引用はオプションです。
ko: 이러한 각 자리 표시자는 일반적으로 캡처 그룹으로 <code>(&hellip;)</code> 괄호로 묶습니다. 그리고 전체 패턴은 종종 <code>^&hellip;&hellip;&hellip;$</code> 시작 + 끝 마커로 표시됩니다. "패턴"을 인용하는 것은 선택 사항입니다.
ru: Каждый из этих заполнителей обычно заключен в <code>(&hellip;)</code> скобки как группа захвата. И весь паттерн часто в маркерах <code>^&hellip;&hellip;&hellip;$</code> start + end. Цитировать &laquo;шаблоны&raquo; необязательно.
zh_cn: 这些占位符通常都用 <code>(&hellip;)</code> 括起来作为捕获组。 整个模式通常以 <code>^&hellip;&hellip;&hellip;$</code> 开头+结尾标记为准。 引用&ldquo;模式&rdquo;是可选的。

source: Each set of <code>(&hellip;)</code> parentheses represents a regular expression that we can capture as a variable in the right hand side of the rule. In this example:
ja: <code>(&hellip;)</code> 括弧の各セットは、ルールの右側で変数としてキャプチャできる正規表現を表します。 この例では：
ko: 각 <code>(&hellip;)</code> 괄호 세트는 규칙의 오른쪽에서 변수로 캡처 할 수있는 정규식을 나타냅니다. 이 예에서 :
ru: Каждый набор <code>(&hellip;)</code> скобок представляет регулярное выражение, которое мы можем записать в виде переменной в правой части правила. В этом примере:
zh_cn: 每组 <code>(&hellip;)</code> 括号都代表一个正则表达式，我们可以将其捕获为规则右侧的变量。 在此示例中：
