Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Else <a href="http://www.regular-expressions.info/quickstart.html">regexp.info</a> for easy-to-understand basics.
ja: その他、 <a href="http://www.regular-expressions.info/quickstart.html">理解</a>しやすい基本的なregexp.info 。
ko: 이해하기 쉬운 기본 사항에 대해서는 <a href="http://www.regular-expressions.info/quickstart.html">regexp.info</a> 를 참조하십시오.
ru: <a href="http://www.regular-expressions.info/quickstart.html">Еще regexp.info</a> для простых для понимания основ.
zh_cn: 其他<a href="http://www.regular-expressions.info/quickstart.html">regexp.info</a>提供了易于理解的基础知识。

source: Enable <a href="http://httpd.apache.org/docs/2.4/mod/mod_negotiation.html">MultiViews</a> to hide the <code>.php</code> extension
ja: <a href="http://httpd.apache.org/docs/2.4/mod/mod_negotiation.html">マルチビュー</a>を有効にして <code>.php</code> 拡張子を非表示にする
ko: <a href="http://httpd.apache.org/docs/2.4/mod/mod_negotiation.html">MultiViews</a> 가 <code>.php</code> 확장자를 숨기도록 설정
ru: Включить <a href="http://httpd.apache.org/docs/2.4/mod/mod_negotiation.html">MultiViews,</a> чтобы скрыть расширение <code>.php</code>
zh_cn: 启用<a href="http://httpd.apache.org/docs/2.4/mod/mod_negotiation.html">MultiViews</a>隐藏 <code>.php</code> 扩展名

source: Enable <code>mod_rewrite</code> and <code>.htaccess</code>
ja: <code>mod_rewrite</code> と <code>.htaccess</code> を有効にする
ko: <code>mod_rewrite</code> 및 <code>.htaccess</code> 활성화
ru: Включить <code>mod_rewrite</code> и <code>.htaccess</code>
zh_cn: 启用 <code>mod_rewrite</code> 和 <code>.htaccess</code>

source: Ensuring URLs are long-lived (AKA <a href="https://en.wikipedia.org/wiki/Permalink">permalinks</a>).
ja: URLが長期間有効であることを確認します（別名<a href="https://en.wikipedia.org/wiki/Permalink">パーマリンク</a> ）。
ko: URL의 수명이 길다 (AKA <a href="https://en.wikipedia.org/wiki/Permalink">permalinks</a> ).
ru: Обеспечение того, чтобы URL-адреса были долгоживущими ( <a href="https://en.wikipedia.org/wiki/Permalink">постоянные ссылки</a> AKA).
zh_cn: 确保URL是长期有效的（又称为<a href="https://en.wikipedia.org/wiki/Permalink">永久链接</a> ）。

source: Even a plain <a href="http://httpd.apache.org/docs/2.2/mod/core.html#errordocument"><code>ErrorDocument</code></a> directive could be used to let a PHP script handle virtual paths. Note that this is a kludgy workaround however, prohibits anything but GET requests, and floods the error.log by definition.
ja: 単純な<a href="http://httpd.apache.org/docs/2.2/mod/core.html#errordocument"> <code>ErrorDocument</code> </a>ディレクティブを使用しても、PHPスクリプトに仮想パスを処理させることができます。 これは扱いにくい回避策ですが、GETリクエスト以外は何も禁止し、定義によりerror.logをフラッディングすることに注意してください。
ko: PHP 스크립트가 가상 경로를 처리하도록 일반 <a href="http://httpd.apache.org/docs/2.2/mod/core.html#errordocument"> <code>ErrorDocument</code> </a> 지시문도 사용할 수 있습니다. 그러나 이것은 해결하기 어려운 해결책이지만 GET 요청 이외의 것은 금지하고 error.log를 정의에 따라 넘칩니다.
ru: Даже простая директива <a href="http://httpd.apache.org/docs/2.2/mod/core.html#errordocument"> <code>ErrorDocument</code> </a> может использоваться, чтобы позволить PHP-скрипту обрабатывать виртуальные пути. Обратите внимание, что это хитрый обходной путь, однако он запрещает все, кроме запросов GET, и по определению создает файл error.log.
zh_cn: 甚至可以使用简单的<a href="http://httpd.apache.org/docs/2.2/mod/core.html#errordocument"> <code>ErrorDocument</code> </a>指令来使PHP脚本处理虚拟路径。 请注意，这是一种繁琐的解决方法，但是禁止除GET请求之外的任何操作，并按定义泛洪error.log。

source: Firstly, mod_rewrite does not randomly disengage. (If it did, you'd have bigger problems).
ja: まず、mod_rewrite はランダムに解除されません。(もしそうだとしたら、より大きな問題を抱えることになるでしょう)。
ko: 첫째, mod_rewrite는 임의로 분리되지 않습니다. (그렇다면 더 큰 문제가 생길 것입니다).
ru: Во-первых,mod_rewrite не отключается случайным образом.(Если бы это было так,у вас были бы проблемы посерьезнее).
zh_cn: 首先,mod_rewrite不会随机脱离。如果有的话,你会有更大的问题)。

source: Flexible segments for virtual paths
ja: 仮想パス用の柔軟なセグメント
ko: 가상 경로를위한 유연한 세그먼트
ru: Гибкие сегменты для виртуальных путей
zh_cn: 用于虚拟路径的灵活段

source: For the also common
ja: また、一般的な
ko: 또한 일반적인
ru: Для тех,кто также часто
zh_cn: 对于同样常见的

source: Fret not.
ja: 気にするな
ko: 걱정하지 마세요.
ru: Не волнуйся.
zh_cn: 别担心。

source: Having readable and obvious resource schemes.
ja: 読みやすく、わかりやすいリソーススキームを持つこと。
ko: 읽기 쉽고 명백한 리소스 체계가 있습니다.
ru: Имея читабельные и очевидные схемы ресурсов.
zh_cn: 具有可读性和明显的资源方案;

source: However don't sacrifice unique requirements for conformism.
ja: しかし、適合性のために独自の要件を犠牲にしてはいけません。
ko: 그러나 적합성에 대한 고유 한 요구 사항을 희생하지 마십시오.
ru: Однако не жертвуйте уникальными требованиями для конформизма.
zh_cn: 然而,不要为了符合主义而牺牲独特的要求。

source: However you <strong>don't want</strong> that usually in your own <code>.htaccess</code> files.
ja: ただし、通常は自分の <code>.htaccess</code> ファイルにそれを入れ<strong>たくありません</strong> 。
ko: 그러나 일반적으로 자신의 <code>.htaccess</code> 파일 <strong>에는 원하지 않습니다</strong> .
ru: Однако обычно вы <strong>этого не хотите</strong> в своих собственных файлах <code>.htaccess</code> .
zh_cn: 但是，您<strong>通常不希望</strong>在自己的 <code>.htaccess</code> 文件中使用该文件。

source: If you copy examples from somewhere, take care to include a <code># comment and origin link</code>. While it's merely bad manners to omit attribution, it often really hurts maintenance later. Document any code or tutorial source. In particular while unversed you should be all the more interested in not treating them like magic blackboxes.
ja: どこかから例をコピーする場合は、 <code># comment and origin link</code> を含めるように注意してください 。 アトリビューションを省略するのは単にマナーが悪いだけですが、後でメンテナンスをするのはしばしば大変です。 コードまたはチュートリアルのソースを文書化します。 特に、理解していない間は、魔法のブラックボックスのように扱ってはいけないことに、もっともっと関心を持つべきです。
ko: 어딘가에서 예제를 복사하는 경우 <code># comment and origin link</code> 를 포함하도록주의 하십시오 . 속성을 생략하는 것은 나쁜 방법 일 뿐이지 만 나중에 유지 관리에 많은 영향을줍니다. 모든 코드 또는 튜토리얼 소스를 문서화하십시오. 특히 미지의 동안 당신은 그들을 마법의 블랙 박스처럼 취급하지 않는 것에 더 관심을 가져야합니다.
ru: Если вы копируете примеры откуда-то, постарайтесь включить <code># comment and origin link</code> . Несмотря на то, что пренебрегать атрибуцией просто нехорошо, это часто наносит ущерб обслуживанию. Документирование любого кода или учебного источника. В частности, когда вы не обращаете внимания, вы должны быть заинтересованы в том, чтобы не относиться к ним как к волшебным черным ящикам.
zh_cn: 如果您从某个地方复制示例，请注意包含 <code># comment and origin link</code> 。 尽管忽略归因只是一种不好的举止，但它通常确实会在以后损害维护。 记录任何代码或教程源。 尤其是当您不熟悉它时，您应该对不将它们像魔术黑匣子那样对待更加感兴趣。

source: If you have similar rules for multiple virtual page paths, then you can match and compact them with <code>|</code> alternative lists. And again just reassign them to internal GET parameters:
ja: 複数の仮想ページパスに同様のルールがある場合は、 <code>|</code> を使用してそれらを一致させて圧縮できます。 代替リスト。 そして再び、それらを内部GETパラメータに再割り当てします。
ko: 여러 가상 페이지 경로에 대해 유사한 규칙이있는 경우 <code>|</code> 대체 목록. 그리고 다시 내부 GET 매개 변수에 다시 할당하십시오.
ru: Если у вас есть похожие правила для нескольких путей к виртуальным страницам, вы можете сопоставить и сжать их с помощью <code>|</code> альтернативные списки. И снова просто переназначить их на внутренние параметры GET:
zh_cn: 如果您对多个虚拟页面路径具有相似的规则，则可以使用 <code>|</code> 对其进行匹配和压缩。 替代清单。 再次将它们重新分配给内部GET参数：

source: If you need up to five path segments, then copy this scheme along into five rules. You can of course use a more specific <code>[^/]+</code> placeholder each. Here the ordering isn't as important, as neither overlaps. So having the most frequently used paths first is okay.
ja: 最大5つのパスセグメントが必要な場合は、このスキームを5つのルールにコピーします。 もちろん、それぞれより具体的な <code>[^/]+</code> プレースホルダーを使用できます。 ここでは、どちらも重複していないため、順序はそれほど重要ではありません。 したがって、最も頻繁に使用されるパスを最初に持つことは問題ありません。
ko: 최대 5 개의 경로 세그먼트가 필요한 경우이 체계를 5 개의 규칙으로 복사하십시오. 물론보다 구체적인 <code>[^/]+</code> 자리 표시자를 각각 사용할 수 있습니다. 여기서 순서는 겹치지 않기 때문에 중요하지 않습니다. 따라서 가장 자주 사용되는 경로를 먼저 갖는 것이 좋습니다.
ru: Если вам нужно до пяти сегментов пути, скопируйте эту схему в пять правил. Конечно, вы можете использовать более конкретный <code>[^/]+</code> заполнитель каждый. Здесь порядок не так важен, так как ни один не перекрывается. Так что иметь наиболее часто используемые пути в первую очередь хорошо.
zh_cn: 如果最多需要五个路径段，则将此方案复制到五个规则中。 当然，您每个都可以使用更具体的 <code>[^/]+</code> 占位符。 这里的顺序并不重要，因为两者都不重叠。 因此首先拥有最常用的路径是可以的。

source: If you're using RewriteRules in a per-directory config file, then worrying about regex performance is pointless. Apache retains compiled PCRE patterns longer than a PHP process with a common routing framework. For high-traffic sites you should however consider moving rulesets into the vhost server configuration, once they've been battle-tested.
ja: RewriteRules をディレクトリ単位の設定ファイルで使用しているのであれば、 regex のパフォーマンスを心配することは無意味です。Apache は、一般的なルーティングフレームワークを持つ PHP プロセスよりもコンパイルされた PCRE パターンを長く保持します。しかし、トラフィックの多いサイトでは、一度テストされたルールセットを vhost サーバの設定に移動させることを検討すべきです。
ko: 디렉토리 별 구성 파일에서 RewriteRules를 사용하는 경우 정규 표현식 성능에 대한 걱정은 의미가 없습니다. Apache는 공통 라우팅 프레임 워크를 사용하여 PHP 프로세스보다 더 긴 컴파일 된 PCRE 패턴을 유지합니다. 트래픽이 많은 사이트의 경우 규칙 테스트가 완료되면 규칙 세트를 가상 호스트 서버 구성으로 이동하는 것을 고려해야합니다.
ru: Если вы используете RewriteRules в конфигурационном файле для каждой директории,то бессмысленно беспокоиться о производительности regex.Apache сохраняет скомпилированные шаблоны PCRE дольше,чем PHP-процесс с общим фреймворком маршрутизации.Для сайтов с высоким трафиком,однако,следует подумать о переносе наборов правил в конфигурацию сервера vhost,после того,как они будут протестированы в битве.
zh_cn: 如果你在每个目录的配置文件中使用RewriteRules,那么担心regex性能是没有意义的。Apache保留编译后的PCRE模式的时间比使用通用路由框架的PHP进程要长。但是对于高流量的网站,你应该考虑将规则集移到vhost服务器配置中,一旦它们经过了实战测试,你就应该考虑将它们移到vhost服务器配置中。

source: In this case, prefer the optionalized <code>^/?</code> directory separator prefix. This allows to move RewriteRules freely between PerDir and server config files.
ja: この場合、オプションの <code>^/?</code> ディレクトリセパレータプレフィックス。 これにより、PerDirとサーバー構成ファイルの間でRewriteRulesを自由に移動できます。
ko: 이 경우 선택 사항 인 <code>^/?</code> 디렉토리 구분 기호 접두사. 이를 통해 PerDir과 서버 구성 파일간에 RewriteRules를 자유롭게 이동할 수 있습니다.
ru: В этом случае предпочтите необязательный <code>^/?</code> префикс разделителя каталогов. Это позволяет свободно перемещать RewriteRules между PerDir и файлами конфигурации сервера.
zh_cn: 在这种情况下，最好使用可选的 <code>^/?</code> 目录分隔符前缀。 这允许在PerDir和服务器配置文件之间自由移动RewriteRules。

source: Include <em>full</em> examples of input URLs, falsly rewritten target paths, your real directory structure.
ja: 入力URL、改ざんされたターゲットパス、実際のディレクトリ構造の<em>完全</em>な例を含めます。
ko: 입력 URL, 잘못 작성된 대상 경로, 실제 디렉토리 구조의 <em>전체</em> 예제를 포함하십시오.
ru: Включите <em>полные</em> примеры входных URL-адресов, ошибочно переписанных целевых путей, вашей реальной структуры каталогов.
zh_cn: 包括输入URL的<em>完整</em>示例，错误重写的目标路径以及您的真实目录结构。

source: Introducing shortcuts like <code>http://example.com/article/531</code> to existing PHP scripts is also easy. The numeric placeholder can just be remapped to a <code>$_GET</code> parameter:
ja: <code>http://example.com/article/531</code> のようなショートカットを既存のPHPスクリプトに導入することも簡単です。 数値プレースホルダーは、 <code>$_GET</code> パラメーターに再マッピングすることができます。
ko: 기존 PHP 스크립트에 <code>http://example.com/article/531</code> 과 같은 바로 가기를 소개하는 것도 쉽습니다. 숫자 자리 표시자는 <code>$_GET</code> 매개 변수로 다시 매핑 할 수 있습니다.
ru: Введение ярлыков, таких как <code>http://example.com/article/531</code> , в существующие сценарии PHP также очень просто. Числовой заполнитель можно просто переназначить на параметр <code>$_GET</code> :
zh_cn: 向现有的PHP脚本引入诸如 <code>http://example.com/article/531</code> 之类的快捷方式也很容易。 可以将数字占位符重新映射到 <code>$_GET</code> 参数：

source: It <em>does</em> make sense in <code>&lt;VirtualHost&gt;</code> sections - if it was combined with another fallback option, such as ScriptAliasMatch. (But nobody ever does that).
ja: <code>&lt;VirtualHost&gt;</code> セクションで意味があります-ScriptAliasMatchなどの別のフォールバックオプションと組み合わせた場合。 （しかし、誰もそれをしません）。
ko: ScriptAliasMatch와 같은 다른 폴백 옵션과 결합 된 경우 <code>&lt;VirtualHost&gt;</code> 섹션에서 의미가 있습니다. (그러나 아무도 그렇게하지 않습니다).
ru: Это <em>имеет</em> смысл в разделах <code>&lt;VirtualHost&gt;</code> - если он был объединен с другой альтернативной опцией, такой как ScriptAliasMatch. (Но никто никогда не делает это).
zh_cn: 如果将它与另一个回退选项（例如ScriptAliasMatch）结合使用，则在 <code>&lt;VirtualHost&gt;</code> 部分中<em>确实</em>有意义。 （但是没有人这样做）。

source: It makes sense to use with individual web applications in deeper subdirectories. It can shorten RewriteRule patterns in such cases. Generally it's best to prefer relative path specifiers in per-directory rule sets.
ja: より深いサブディレクトリにある個々のウェブアプリケーションで使用するのは理にかなっています。このような場合、RewriteRule パターンを短縮することができます。一般的には、ディレクトリ単位のルールセットで相対パス指定子を使うのがベストです。
ko: 더 깊은 하위 디렉토리의 개별 웹 응용 프로그램과 함께 사용하는 것이 좋습니다. 이러한 경우 RewriteRule 패턴을 단축 할 수 있습니다. 일반적으로 디렉토리 별 규칙 세트에서 상대 경로 지정자를 선호하는 것이 가장 좋습니다.
ru: Это имеет смысл использовать с отдельными веб-приложениями в более глубоких подкаталогах.В таких случаях он может сократить шаблоны RewriteRule.Обычно лучше всего предпочитать относительные спецификаторы путей в наборах правил для каждой директории.
zh_cn: 它与更深的子目录中的单个Web应用程序一起使用是有意义的。在这种情况下,它可以缩短RewriteRule模式。一般来说,在每个目录规则集中最好使用相对路径指定器。

source: It's meant to prevent HTTP <code>500</code> errors. What it usually accomplishes is gracing your users with HTTP <code>404</code> errors instead. (Not <em>so much</em> more user-friendly if you think about it.)
ja: HTTP <code>500</code> エラーを防ぐためのものです。 通常は、代わりにHTTP <code>404</code> エラーでユーザーを監視します。 （考えれば<em>、それほど</em>ユーザーフレンドリーではありません。）
ko: HTTP <code>500</code> 오류를 방지하기위한 것입니다. 일반적으로 달성하는 것은 HTTP <code>404</code> 오류로 사용자를 매기는 것입니다. (생각하면 <em>훨씬</em> 사용자 친화적이지 않습니다.)
ru: Он предназначен для предотвращения ошибок HTTP <code>500</code> . Обычно это дает вашим пользователям ошибки HTTP <code>404</code> . (Не <em>намного</em> удобнее, если подумать.)
zh_cn: 这是为了防止HTTP <code>500</code> 错误。 它通常完成的工作是使用户遭受HTTP <code>404</code> 错误的困扰。 （如果您考虑的话，它并不会更加人性化。）

source: It's not "SEO"-URLs
ja: それは「SEO」ではなく「URL」です。
ko: "SEO"가 아닙니다. URL
ru: Это не "SEO" -URLs.
zh_cn: 这不是 "SEO"--URLs

source: It's not <em>that pretty</em> in browser address bars, but you can use spaces in URLs. For rewrite patterns use backslash-escaped <code>\␣</code> spaces. Else just <code>"</code>-quote the whole pattern or substitution:
ja: ブラウザのアドレスバーではそれほど<em>きれい</em>ではありません<em>が</em> 、URLでスペースを使用できます。 書き換えパターンには、バックスラッシュでエスケープした <code>\␣</code> スペースを使用します。 または、パターン全体または置換全体を引用します。
ko: 브라우저 주소 표시 줄에는 그다지 좋지 않지만 URL에 공백을 사용할 수 있습니다. 다시 쓰기 패턴의 경우 백 슬래시 이스케이프 된 <code>\␣</code> 공백을 사용하십시오. 그렇지 않으면 <code>"</code> 전체 패턴 또는 대체를 인용하십시오.
ru: Это не так <em>красиво</em> в адресной строке браузера, но вы можете использовать пробелы в URL. Для перезаписи шаблонов используйте пробелы с обратной косой чертой <code>\␣</code> Остальное просто <code>"</code> - процитируйте весь шаблон или подстановку:
zh_cn: 浏览器地址栏中的效果不是<em>很好</em> ，但是您可以在URL中使用空格。 对于重写模式，请使用反斜杠转义的 <code>\␣</code> 空格。 否则只用 <code>"</code> 引用整个模式或替换：

source: Left hand side of the rule
ja: ルールの左手側
ko: 규칙의 왼쪽
ru: Левая сторона правила
zh_cn: 规则的左手边

source: Lets take this example:
ja: この例を見てみましょう。
ko: 이 예제를 보자.
ru: Давайте возьмем этот пример:
zh_cn: 就拿这个例子来说吧。

source: Look through our <a href="https://stackoverflow.com/questions/tagged/mod-rewrite?sort=frequent">most popular mod-rewrite</a> questions and answers.
ja: <a href="https://stackoverflow.com/questions/tagged/mod-rewrite?sort=frequent">最も人気のあるmod-rewriteの</a>質問と回答をご覧ください。
ko: <a href="https://stackoverflow.com/questions/tagged/mod-rewrite?sort=frequent">가장 인기있는 모드 재 작성</a> 질문과 답변을 살펴보십시오.
ru: Посмотрите наши <a href="https://stackoverflow.com/questions/tagged/mod-rewrite?sort=frequent">самые популярные моды переписать</a> вопросы и ответы.
zh_cn: 查看我们<a href="https://stackoverflow.com/questions/tagged/mod-rewrite?sort=frequent">最受欢迎的mod-rewrite</a>问题和答案。

source: Many basic virtual URL schemes can be achieved without using RewriteRules. Apache allows PHP scripts to be invoked without <code>.php</code> extension, and with a virtual <code>PATH_INFO</code> argument.
ja: RewriteRulesを使用しなくても、多くの基本的な仮想URLスキームを実現できます。 Apacheでは、 <code>.php</code> 拡張子なしで、仮想 <code>PATH_INFO</code> 引数を使用してPHPスクリプトを呼び出すことができます。
ko: RewriteRules를 사용하지 않고도 많은 기본 가상 URL 체계를 달성 할 수 있습니다. Apache는 PHP 스크립트를 <code>.php</code> 확장자없이 가상 <code>PATH_INFO</code> 인수로 호출 할 수 있도록합니다.
ru: Многие базовые схемы виртуальных URL могут быть реализованы без использования RewriteRules. Apache позволяет вызывать сценарии PHP без расширения <code>.php</code> и с виртуальным аргументом <code>PATH_INFO</code> .
zh_cn: 不使用RewriteRules即可实现许多基本的虚拟URL方案。 Apache允许在不带 <code>.php</code> 扩展名且带有虚拟 <code>PATH_INFO</code> 参数的情况下调用PHP脚本。

source: Many copy+paste examples contain a <code>RewriteBase /</code> directive. Which happens to be the implicit default anyway. So you don't actually need this. It's a workaround for fancy VirtualHost rewriting schemes, and misguessed DOCUMENT_ROOT paths for some shared hosters.
ja: 多くのコピーと貼り付けの例には、 <code>RewriteBase /</code> ディレクティブが含まれています。 とにかく、これは暗黙のデフォルトです。 したがって、実際にはこれは必要ありません。 これは、派手なVirtualHostリライティングスキームの回避策であり、一部の共有ホスティング事業者のDOCUMENT_ROOTパスを誤解しています。
ko: 많은 복사 + 붙여 넣기 예에는 <code>RewriteBase /</code> 지시문이 포함되어 있습니다. 어쨌든 암시 적 기본값이됩니다. 따라서 실제로는 필요하지 않습니다. 멋진 VirtualHost 다시 쓰기 체계에 대한 해결 방법이며 일부 공유 호스팅 업체의 DOCUMENT_ROOT 경로를 잘못 추측했습니다.
ru: Многие примеры копирования + вставки содержат директиву <code>RewriteBase /</code> . Что в любом случае оказывается неявным значением по умолчанию. Так что вам на самом деле это не нужно. Это обходной путь для причудливых схем перезаписи VirtualHost и неправильных путей DOCUMENT_ROOT для некоторых общих хостеров.
zh_cn: 许多复制+粘贴示例都包含 <code>RewriteBase /</code> 指令。 无论如何，这恰好是隐式默认值。 因此，您实际上不需要此。 这是一种不错的VirtualHost重写方案的解决方法，并且为某些共享托管者误导了DOCUMENT_ROOT路径。

source: Most rules you'll encounter map a constrained set of <code>/&hellip;/</code> resource path segments to individual GET parameters. Some scripts <a href="https://stackoverflow.com/q/3655893">handle a variable number of options</a> however. The Apache regexp engine doesn't allow optionalizing an arbitrary number of them. But you can easily expand it into a rule block yourself:
ja: 遭遇するほとんどのルールは、制約付きの <code>/&hellip;/</code> リソースパスセグメントのセットを個々のGETパラメータにマッピングします。 ただし<a href="https://stackoverflow.com/q/3655893">、</a>一部のスクリプトは可変数のオプションを処理します 。 Apache regexpエンジンでは、それらの任意の数をオプションにすることはできません。 ただし、自分で簡単にルールブロックに拡張できます。
ko: 발생하는 대부분의 규칙은 제한된 /.../ 자원 경로 세그먼트 세트를 개별 GET 매개 변수에 맵핑합니다. 그러나 일부 스크립트 <a href="https://stackoverflow.com/q/3655893">는 다양한 옵션을 처리합니다</a> . Apache regexp 엔진은 임의의 수의 옵션을 선택할 수 없습니다. 그러나 쉽게 규칙 블록으로 쉽게 확장 할 수 있습니다.
ru: Большинство правил, с которыми вы столкнетесь, отображают ограниченный набор сегментов пути <code>/&hellip;/</code> resource на отдельные параметры GET. Однако некоторые сценарии <a href="https://stackoverflow.com/q/3655893">обрабатывают переменное количество параметров</a> . Движок регулярных выражений Apache не позволяет произвольно выбирать их число. Но вы можете легко развернуть его в блок правил самостоятельно:
zh_cn: 您将遇到的大多数规则将一组受约束的 <code>/&hellip;/</code> 资源路径段映射到各个GET参数。 但是，某些脚本<a href="https://stackoverflow.com/q/3655893">处理可变数量的选项</a> 。 Apache regexp引擎不允许任意选择它们。 但是您可以自己轻松地将其扩展为规则块：

source: Mostly just output <code>[^/]+</code> generic placeholders, but likely suffices for trivial sites.
ja: ほとんどの場合、出力は <code>[^/]+</code> 一般的なプレースホルダーだけですが、ささいなサイトではおそらく十分です。
ko: 일반적으로 <code>[^/]+</code> 일반 자리 표시 자만 출력하지만 사소한 사이트에는 충분합니다.
ru: В основном просто выводим <code>[^/]+</code> общие заполнители, но, скорее всего, достаточно для тривиальных сайтов.
zh_cn: 通常只输出 <code>[^/]+</code> 通用占位符，但对于琐碎的网站可能就足够了。

source: None of the modern search engines are really disturbed by <code>.html</code> and <code>.php</code> in path segments, or <code>?id=123</code> query strings for that matter. Search engines of old, such as AltaVista, <em>did</em> avoid crawling websites with potentially ambigious access paths. Modern crawlers are often even craving for deep web resources.
ja: 最新の検索エンジンはどれも、パスセグメントの <code>.html</code> と <code>.php</code> によって実際に邪魔されることはありません。 AltaVistaなどの古い検索エンジンは、潜在的にあいまいなアクセスパスを持つWebサイトのクロールを回避しました。 最近のクローラーは、多くの場合、深いWebリソースを欲しがっています。
ko: 현대 검색 엔진은 경로 세그먼트의 <code>.html</code> 및 <code>.php</code> 또는 그 문제에 대한 <code>?id=123</code> 쿼리 문자열로 실제로 방해받지 않습니다. AltaVista와 같은 오래된 검색 엔진은 잠재적으로 모호한 액세스 경로를 가진 웹 사이트를 크롤링 <em>하지 않았습니다</em> . 최신 크롤러는 종종 깊은 웹 리소스를 원합니다.
ru: Ни одна из современных поисковых систем действительно не обеспокоена <code>.html</code> и <code>.php</code> в сегментах пути или <code>?id=123</code> строк запроса в этом отношении. Старые поисковые системы, такие как AltaVista, избегали сканирования веб-сайтов с потенциально неоднозначными путями доступа. Современные сканеры часто даже жаждут глубоких веб-ресурсов.
zh_cn: 没有现代的搜索引擎真正受到路径段中的 <code>.html</code> 和 <code>.php</code> 或此问题的 <code>?id=123</code> 查询字符串的干扰。 诸如AltaVista之类的老式搜索引擎<em>的确</em>避免了对具有潜在歧义访问路径的网站进行爬网。 现代的爬虫甚至甚至渴望获得深层的Web资源。

source: Note how this example just uses <code>[END]</code> instead of <code>[L]</code> to safely alternate. For older Apache 2.2 versions you can use other workarounds, besides also remapping query string parameters for example: <a href="https://stackoverflow.com/questions/11629896/mod-rewrite-redirect-url-with-query-string-to-pretty-url">Redirect ugly to pretty URL, remap back to the ugly path, without infinite loops</a>
ja: この例では、安全に切り替えるために <code>[L]</code> ではなく <code>[END]</code> を使用していることに注意してください。 古いApache 2.2バージョンの場合、クエリ文字列パラメーターの再マッピングに加えて、他の回避策を使用できます。たとえば<a href="https://stackoverflow.com/questions/11629896/mod-rewrite-redirect-url-with-query-string-to-pretty-url">、醜いURLにリダイレクトし、無限ループなしで醜いパスに再マップします。</a>
ko: 이 예제는 <code>[L]</code> 대신 <code>[END]</code> 를 사용하여 안전하게 대체하는 방법에 유의하십시오. 이전 Apache 2.2 버전의 경우 쿼리 문자열 매개 변수를 다시 매핑하는 것 외에도 다른 해결 방법을 사용할 수 있습니다.
ru: Обратите внимание, что этот пример просто использует <code>[END]</code> вместо <code>[L]</code> для безопасного чередования. В более старых версиях Apache 2.2 вы можете использовать другие обходные пути, кроме того, например, переназначение параметров строки запроса, например: <a href="https://stackoverflow.com/questions/11629896/mod-rewrite-redirect-url-with-query-string-to-pretty-url">перенаправить некрасиво на симпатичный URL, переназначить обратно на некрасивый путь без бесконечных циклов</a>
zh_cn: 请注意，本示例仅使用 <code>[END]</code> 而非 <code>[L]</code> 进行安全交替。 对于较旧的Apache 2.2版本，除了重新映射查询字符串参数外，您还可以使用其他解决方法： <a href="https://stackoverflow.com/questions/11629896/mod-rewrite-redirect-url-with-query-string-to-pretty-url">将丑陋重定向到漂亮的URL，重新映射回丑陋的路径，而没有无限循环</a>

source: Note that <em>your script</em><strong>must</strong> be able (or be adapted) to map those titles back to database-ids. RewriteRules alone can't create or guess information out of thin air.
ja: <em>スクリプト</em> <strong>は</strong> 、これらのタイトルをデータベースIDにマップできるようにする（または適合させる） <strong>必要</strong>があることに注意して<em>ください</em> 。 RewriteRulesだけでは、薄い空気から情報を作成したり推測したりすることはできません。
ko: <em>스크립트</em> <strong>가</strong> 해당 제목을 다시 데이터베이스 ID에 매핑 할 수 <strong>있어야합니다</strong> . 규칙만으로는 정보가 허술한 정보를 만들거나 추측 할 수 없습니다.
ru: Обратите внимание, что <em>ваш скрипт</em> <strong>должен</strong> иметь возможность (или быть адаптирован) для сопоставления этих заголовков с идентификаторами базы данных. Только RewriteRules не может создавать или угадывать информацию из воздуха.
zh_cn: 请注意， <em>您的脚本</em> <strong>必须</strong>能够（或适应）将这些标题映射回数据库ID。 仅RewriteRules不能凭空创造或猜测信息。
