Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Note that MultiViews has a different/broader purpose though. It incurs a <em>very minor</em> performance penalty, because Apache always looks for other files with matching basenames. It's actually meant for <a href="https://en.wikipedia.org/wiki/Content_negotiation">Content-Negotiation</a>, so browsers receive the best alternative among available resources (such as <code>article.en.php</code>, <code>article.fr.php</code>, <code>article.jp.mp4</code>).
ja: ただし、MultiViewsには別の目的や幅広い目的があります。 Apacheは常に一致するベース名を持つ他のファイルを検索するため、パフォーマンスは<em>非常にわずかに</em>低下します。 これは実際には<a href="https://en.wikipedia.org/wiki/Content_negotiation">Content-Negotiationを対象</a>としているため、ブラウザーは利用可能なリソース（ <code>article.en.php</code> 、 <code>article.fr.php</code> 、 <code>article.jp.mp4</code> など ）の中で最良の選択肢を受け取ります。
ko: MultiViews는 다른 / 광범위한 목적을 가지고 있습니다. Apache는 항상 기본 이름이 일치하는 다른 파일을 찾기 때문에 성능이 <em>약간</em> 저하됩니다. 실제로 <a href="https://en.wikipedia.org/wiki/Content_negotiation">Content-Negotiation을</a> 의미하므로 브라우저는 사용 가능한 리소스 중에서 가장 좋은 대안을받습니다 (예 : <code>article.en.php</code> , <code>article.fr.php</code> , <code>article.jp.mp4</code> ).
ru: Обратите внимание, что MultiViews имеет другое / более широкое назначение. Это приводит к <em>очень незначительным потерям</em> производительности, потому что Apache всегда ищет другие файлы с соответствующими базовыми именами. На самом деле он предназначен для <a href="https://en.wikipedia.org/wiki/Content_negotiation">Content-Negotiation</a> , поэтому браузеры получают лучшую альтернативу среди доступных ресурсов (таких как <code>article.en.php</code> , <code>article.fr.php</code> , <code>article.jp.mp4</code> ).
zh_cn: 请注意，尽管MultiViews具有不同/更广泛的用途。 由于Apache始终会寻找具有匹配基名的其他文件，因此它对性能的<em>影响很小</em> 。 它实际上是用于<a href="https://en.wikipedia.org/wiki/Content_negotiation">内容协商的</a> ，因此浏览器会在可用资源（例如 <code>article.en.php</code> ， <code>article.fr.php</code> ， <code>article.jp.mp4</code> ）中获得最佳选择。

source: Note that RewriteCond/RewriteRule combos can be more complex, with matches (<code>%1</code> and <code>$1</code>) interacting in both directions even:
ja: RewriteCond / RewriteRuleコンボはより複雑になる可能性があることに注意してください。一致（ <code>%1</code> と <code>$1</code> ）は両方向で相互作用します。
ko: RewriteCond / RewriteRule 콤보는 다음과 같은 경우에도 일치하는 항목 ( <code>%1</code> 및 <code>$1</code> )을 사용하여 더 복잡 할 수 있습니다.
ru: Обратите внимание, что комбинации RewriteCond / RewriteRule могут быть более сложными, при этом совпадения ( <code>%1</code> и <code>$1</code> ) взаимодействуют даже в обоих направлениях:
zh_cn: 请注意，RewriteCond / RewriteRule组合可能更复杂，甚至匹配（ <code>%1</code> 和 <code>$1</code> ）在两个方向上都可以交互：

source: Note that this doesn't copy a query string along, etc.
ja: これは、クエリ文字列をコピーしないことに注意してください。
ko: 이것은 쿼리 문자열을 복사하지 않습니다.
ru: Обратите внимание,что при этом не копируется строка запроса и т.д.
zh_cn: 注意,这并不能复制一个查询字符串沿等。

source: Now take this with a grain of salt. Not every advise can be generalized to all contexts. This is just a simple summary of well-known and a few unobvious stumbling blocks:
ja: 今は、塩分を含んだ状態で受け止めてください。すべてのアドバイスがすべての文脈に一般化できるわけではありません。これは、よく知られていることと、いくつかの明らかでない躓きを簡単にまとめたものです。
ko: 이제 소금 한알로 이것을 가져 가십시오. 모든 조언을 모든 상황에 대해 일반화 할 수있는 것은 아닙니다. 이것은 잘 알려진 몇 가지 명백한 걸림돌에 대한 간단한 요약입니다.
ru: Теперь возьми это с зерном соли.Не каждый совет можно обобщить во всех контекстах.Это всего лишь краткое изложение хорошо известных и нескольких неочевидных камней преткновения:
zh_cn: 现在,我们要谨慎对待这一点。并非每一条建议都能一概而论。这只是简单总结了一些众所周知的和一些不明显的绊脚石。

source: Now the more complex pattern <code>(?:/([^/])+)?</code> there simply wraps a <em>non-capturing</em><code>(?:&hellip;)</code> group, and makes it optional <code>)?</code>. The contained placeholder <code>([^/]+)</code> would be substitution pattern <code>$2</code>, but be empty if there's no middle <code>/&hellip;/</code> path.
ja: 次に、より複雑なパターン <code>(?:/([^/])+)?</code> 単に<em>非キャプチャ</em> <code>(?:&hellip;)</code> グループをラップし、それをオプションにします <code>)?</code> 。 含まれるプレースホルダー <code>([^/]+)</code> は置換パターン <code>$2</code> ですが、中間の <code>/&hellip;/</code> パスがない場合は空になります。
ko: 이제 더 복잡한 패턴 <code>(?:/([^/])+)?</code> 단순히 <em>캡처하지 않는</em> <code>(?:&hellip;)</code> 그룹을 래핑하고 선택적으로 만듭니다 <code>)?</code> . 포함 된 자리 표시 자 <code>([^/]+)</code> 는 대체 패턴 <code>$2</code> 이지만 중간 <code>/&hellip;/</code> 경로가 없으면 비어 있습니다.
ru: Теперь более сложный шаблон <code>(?:/([^/])+)?</code> там просто оборачивает <em>незаписывающую</em> <code>(?:&hellip;)</code> группу и делает ее необязательной <code>)?</code> , Содержащийся заполнитель <code>([^/]+)</code> будет шаблоном подстановки <code>$2</code> , но будет пустым, если нет среднего пути <code>/&hellip;/</code> .
zh_cn: 现在更复杂的模式 <code>(?:/([^/])+)?</code> 那里只是包装了一个<em>非捕获</em> <code>(?:&hellip;)</code> 组，并使其成为可选的 <code>)?</code> 。 包含的占位符 <code>([^/]+)</code> 将是替换模式 <code>$2</code> ，但如果没有中间 <code>/&hellip;/</code> 路径， 则为空。

source: Now this <code>/virtual/path</code> shows up in PHP as <a href="https://secure.php.net/manual/en/reserved.variables.server.php#~PATH_INFO"><code>$_SERVER["PATH_INFO"]</code></a> where you can handle any extra arguments however you like.
ja: これで、この <code>/virtual/path</code> はPHPでは<a href="https://secure.php.net/manual/en/reserved.variables.server.php#~PATH_INFO"> <code>$_SERVER["PATH_INFO"]</code> </a>として表示され、追加の引数を好きなように処理できます。
ko: 이제이 <code>/virtual/path</code> 는 PHP에서 <a href="https://secure.php.net/manual/en/reserved.variables.server.php#~PATH_INFO"> <code>$_SERVER["PATH_INFO"]</code> </a> 되어 원하는대로 추가 인수를 처리 할 수 ​​있습니다.
ru: Теперь этот <code>/virtual/path</code> отображается в PHP как <a href="https://secure.php.net/manual/en/reserved.variables.server.php#~PATH_INFO"> <code>$_SERVER["PATH_INFO"]</code> </a> где вы можете обрабатывать любые дополнительные аргументы так, как вам нравится.
zh_cn: 现在，此 <code>/virtual/path</code> 在PHP中显示为<a href="https://secure.php.net/manual/en/reserved.variables.server.php#~PATH_INFO"> <code>$_SERVER["PATH_INFO"]</code> </a> ，您可以在其中处理所需的任何其他参数。

source: Now this can have some security and performance implications, because all extensionless files would be piped through PHP now. Therefore you can alternatively set this behaviour for individual files only:
ja: これは、セキュリティやパフォーマンスに影響を与える可能性があります。そのため、個々のファイルに対してのみこの動作を設定することもできます。
ko: 이제 모든 확장 파일이 PHP를 통해 파이프되기 때문에 보안 및 성능에 영향을 줄 수 있습니다. 따라서 개별 파일에 대해서만이 동작을 설정할 수 있습니다.
ru: Теперь это может иметь некоторые последствия для безопасности и производительности,потому что все файлы без расширений теперь будут проходить через PHP.Поэтому вы можете альтернативно установить такое поведение только для отдельных файлов:
zh_cn: 现在,这可能会对安全和性能产生一些影响,因为所有无扩展的文件都会通过PHP进行管道传输。因此你可以选择只对单个文件设置这个行为。

source: Now this handles both <code>http://example.com/blog/123</code> and <code>/blog/123/</code>. And the
ja: これで <code>http://example.com/blog/123</code> と <code>/blog/123/</code> 両方が処理されます。 そしてその
ko: 이제 <code>http://example.com/blog/123</code> 및 <code>/blog/123/</code> 모두를 처리합니다. 그리고
ru: Теперь это обрабатывает как <code>http://example.com/blog/123</code> ,так и <code>/blog/123/</code> . И
zh_cn: 现在，它可以处理 <code>http://example.com/blog/123</code> 和 <code>/blog/123/</code> 。 和

source: Now you could just skip passing the <code>title=$2</code> anyway, because your script will typically rely on the database-id anyway. The <code>-title-slug</code> has become arbitrary URL decoration.
ja: スクリプトは通常、とにかくdatabase-idに依存しているため、とにかく、 <code>title=$2</code> を渡すことをスキップできます。 <code>-title-slug</code> は任意のURL装飾になりました。
ko: 스크립트는 일반적으로 데이터베이스 ID에 의존하기 때문에 <code>title=$2</code> 전달을 건너 뛸 수 있습니다. <code>-title-slug</code> 는 임의의 URL 장식이되었습니다.
ru: Теперь вы можете просто пропустить передачу <code>title=$2</code> любом случае, потому что ваш скрипт в любом случае будет полагаться на идентификатор базы данных. <code>-title-slug</code> стал произвольным украшением URL.
zh_cn: 现在您无论如何都可以跳过传递 <code>title=$2</code> ，因为您的脚本通常总是依赖于数据库ID。 <code>-title-slug</code> 已成为任意URL装饰。

source: Nowadays <a href="http://httpd.apache.org/docs/2.4/en/mod/core.html#acceptpathinfo"><code>AcceptPathInfo On</code></a> is often enabled by default. Which basically allows <code>.php</code> and other resource URLs to carry a virtual argument:
ja: 現在、 <a href="http://httpd.apache.org/docs/2.4/en/mod/core.html#acceptpathinfo"> <code>AcceptPathInfo On</code> </a>は多くの場合、デフォルトで有効になっています。 これは基本的に <code>.php</code> と他のリソースURLが仮想引数を運ぶことを可能にします：
ko: 요즘 <a href="http://httpd.apache.org/docs/2.4/en/mod/core.html#acceptpathinfo"> <code>AcceptPathInfo On</code> </a> 은 종종 기본적으로 활성화되어 있습니다. 기본적으로 <code>.php</code> 및 기타 리소스 URL이 가상 인수를 전달할 수 있습니다.
ru: В настоящее время <a href="http://httpd.apache.org/docs/2.4/en/mod/core.html#acceptpathinfo"> <code>AcceptPathInfo On</code> </a> часто включен по умолчанию. Что в основном позволяет URL-адресам <code>.php</code> и других ресурсов содержать виртуальный аргумент:
zh_cn: 如今，默认情况下通常启用<a href="http://httpd.apache.org/docs/2.4/en/mod/core.html#acceptpathinfo"> <code>AcceptPathInfo On</code> </a> 。 它基本上允许 <code>.php</code> 和其他资源URL携带虚拟参数：

source: Numeric identifiers
ja: 数値識別子
ko: 숫자 식별자
ru: Числовые идентификаторы
zh_cn: 数字标识符

source: Obviously <a href="https://stackoverflow.com/questions/869092/how-to-enable-mod-rewrite-for-apache-2-2">have <code>mod_rewrite</code> enabled</a> in your <code>httpd.conf</code> modules section.
ja: <code>httpd.conf</code> モジュールセクションで<a href="https://stackoverflow.com/questions/869092/how-to-enable-mod-rewrite-for-apache-2-2"> <code>mod_rewrite</code> が有効になっていること</a>は明らかです。
ko: <code>httpd.conf</code> 모듈 섹션에서 <a href="https://stackoverflow.com/questions/869092/how-to-enable-mod-rewrite-for-apache-2-2"> <code>mod_rewrite</code> 를 활성화</a> 하십시오.
ru: Очевидно, <a href="https://stackoverflow.com/questions/869092/how-to-enable-mod-rewrite-for-apache-2-2">что <code>mod_rewrite</code> включен</a> в разделе модулей <code>httpd.conf</code> .
zh_cn: 显然，在您的 <code>httpd.conf</code> 模块部分中<a href="https://stackoverflow.com/questions/869092/how-to-enable-mod-rewrite-for-apache-2-2">启用</a>了 <code>mod_rewrite</code> 。

source: Occasionally it's suitable to alternate between <code>/</code>-delimiters and <code>:</code> or <code>.</code> in the same rule even. Or have two RewriteRules again to map variants onto different scripts.
ja: <code>/</code> -delimitersと <code>:</code> またはを交互に使用するのが適切な場合があり <code>.</code> 同じルールでさえ。 または、2つのRewriteRulesを再度使用して、バリアントを異なるスクリプトにマップします。
ko: 때때로 <code>/</code> 구분 기호와 <code>:</code> 또는 사이를 번갈아 사용하는 것이 적합합니다 <code>.</code> 같은 규칙으로도. 또는 변형을 다른 스크립트에 매핑하려면 두 개의 RewriteRules를 다시 사용하십시오.
ru: Иногда целесообразно чередовать <code>/</code> -delimiters и <code>:</code> или <code>.</code> в том же правиле даже. Или снова используйте два RewriteRules для сопоставления вариантов с разными сценариями.
zh_cn: 偶尔适合在 <code>/</code> -分隔符和 <code>:</code> 或之间切换 <code>.</code> 同样的规则 或者再次使用两个RewriteRules将变体映射到不同的脚本。

source: Oft-used placeholders
ja: よく使われるプレースホルダ
ko: 자주 사용되는 자리 표시 자
ru: Часто используемые пайщики
zh_cn: 经常使用的占位符

source: Often simply by adding <code>&lt;base href="/index"&gt;</code> into your HTML <code>&lt;head&gt;</code> section. This implicitly rebinds relative references to what they were before.
ja: 多くの場合、HTMLの <code>&lt;head&gt;</code> セクションに <code>&lt;base href="/index"&gt;</code> を追加するだけです。 これにより、相対的な参照が以前のものに暗黙的に再バインドされます。
ko: 종종 <code>&lt;base href="/index"&gt;</code> 를 HTML <code>&lt;head&gt;</code> 섹션에 추가하면됩니다. 이것은 이전에 있던 것에 대한 상대적 참조를 암시 적으로 리 바인드합니다.
ru: Часто просто добавив <code>&lt;base href="/index"&gt;</code> в раздел HTML <code>&lt;head&gt;</code> . Это косвенно связывает относительные ссылки на то, что они были раньше.
zh_cn: 通常，只需将 <code>&lt;base href="/index"&gt;</code> 到HTML <code>&lt;head&gt;</code> 部分中即可。 这隐式地将相对引用重新绑定到以前的内容。

source: Often you can figure out how a RewriteRule misbehaves just from looking at your <code>error.log</code> and <code>access.log</code>. Correlate access times to see which request path originally came in, and which path/file Apache couldn't resolve to (error 404/500).
ja: 多くの場合、 <code>error.log</code> と <code>access.log</code> を確認するだけで、RewriteRuleの動作が正しくないことがわかります。 アクセス時間を相互に関連付けて、最初に着信したリクエストパスと、Apacheが解決できなかったパス/ファイルを確認します（エラー404/500）。
ko: <code>error.log</code> 및 <code>access.log</code> 를 보면 RewriteRule이 어떻게 오작동하는지 파악할 수 있습니다. 액세스 시간을 연관시켜 원래 요청 경로와 Apache가 해석 할 수없는 경로 / 파일을 확인하십시오 (오류 404/500).
ru: Часто вы можете понять, как RewriteRule ведет себя неправильно, просто взглянув на свои <code>error.log</code> и <code>access.log</code> . Соотнесите время доступа, чтобы увидеть, какой путь запроса был изначально введен, и какой путь / файл не удалось разрешить Apache (ошибка 404/500).
zh_cn: 通常，仅通过查看 <code>error.log</code> 和 <code>access.log</code> ，您就可以弄清楚RewriteRule的行为方式。 关联访问时间，以查看最初进入哪个请求路径以及Apache无法解析的路径/文件（错误404/500）。

source: Only using server-absolute references <code>href="/old.html"</code> or <code>src="/logo.png"</code>
ja: サーバー絶対参照 <code>href="/old.html"</code> または <code>src="/logo.png"</code> のみを使用
ko: 서버 절대 참조 만 사용 <code>href="/old.html"</code> 또는 <code>src="/logo.png"</code>
ru: Только с использованием серверных абсолютных ссылок <code>href="/old.html"</code> или <code>src="/logo.png"</code>
zh_cn: 仅使用服务器绝对引用 <code>href="/old.html"</code> 或 <code>src="/logo.png"</code>

source: Optional segments
ja: オプションセグメント
ko: 선택적 세그먼트
ru: Дополнительные сегменты
zh_cn: 可选部分

source: Optional trailing <code>/</code> slash
ja: オプションの末尾 <code>/</code> スラッシュ
ko: 선택적 후행 <code>/</code> 슬래시
ru: Дополнительный трейлинг <code>/</code> косая черта
zh_cn: 可选的尾随 <code>/</code> 斜杠

source: Ordering is important
ja: 注文が重要
ko: 주문이 중요하다
ru: Заказ важен
zh_cn: 订购是很重要的

source: Other Apache rewriting schemes
ja: 他の Apache の書き換えスキーム
ko: 다른 Apache 재 작성 체계
ru: Другие схемы переписывания Apache
zh_cn: 其他Apache重写方案

source: Other common names, aliases, terms for clean URLs: <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> URLs, user-friendly URLs, <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a>-friendly URLs, <a href="https://en.wikipedia.org/wiki/Clean_URL#Slug">slugging</a>, and MVC URLs (probably a misnomer)
ja: その他の一般的な名前、エイリアス、クリーンなURLの用語： <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> URL、ユーザーフレンドリーなURL、 <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a>フレンドリーなURL、 <a href="https://en.wikipedia.org/wiki/Clean_URL#Slug">slugging</a> 、MVC URL（おそらく誤った名称）
ko: 클린 URL에 대한 다른 일반적인 이름, 별명, 용어 : <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> URL, 사용자 친화적 URL, <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a> 친화적 URL, <a href="https://en.wikipedia.org/wiki/Clean_URL#Slug">슬러 깅</a> 및 MVC URL (아마도 잘못된 이름)
ru: Другие распространенные имена, псевдонимы, термины для чистых URL-адресов: <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful-</a> URL-адреса, удобные для пользователя URL-адреса, оптимизированные для <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a> URL-адреса, <a href="https://en.wikipedia.org/wiki/Clean_URL#Slug">блокировка</a> и URL-адреса MVC (вероятно, неправильно)
zh_cn: 其他通用名称，别名，干净URL的术语： <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> URL，用户友好的URL， <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a>友好的URL， <a href="https://en.wikipedia.org/wiki/Clean_URL#Slug">慢速运行</a>和MVC URL（可能是用词不当）

source: Other common uses are remapping obsolete <code>.html</code> paths to newer <code>.php</code> handlers, or just aliasing directory names only for individual (actual/real) files.
ja: 他の一般的な用途は、古い <code>.html</code> パスを新しい <code>.php</code> ハンドラーに再マッピングすること、または個々の（実際の/実際の）ファイルに対してのみディレクトリ名をエイリアスすることです。
ko: 다른 일반적인 용도는 더 이상 사용되지 않는 <code>.html</code> 경로를 최신 <code>.php</code> 처리기로 다시 매핑하거나 개별 (실제 / 실제) 파일에 대해서만 별칭을 지정하는 것입니다.
ru: Другим распространенным применением является переназначение устаревших путей <code>.html</code> в новые обработчики <code>.php</code> или просто наложение имен каталогов только для отдельных (реальных / реальных) файлов.
zh_cn: 其他常见用法是将过时的 <code>.html</code> 路径重新映射到较新的 <code>.php</code> 处理程序，或者仅为单独的（实际/实际）文件别名目录名称。

source: Other delimiters than just <code>/</code> path slashes
ja: <code>/</code> スラッシュ以外の区切り文字
ko: 그냥 <code>/</code> 경로 슬래시 이외의 다른 구분 기호
ru: Другие разделители, кроме косых черт
zh_cn: 除 <code>/</code> 斜杠以外的其他定界符

source: Our <a href="/questions/tagged/regex">regex</a><a href="https://stackoverflow.com/tags/regex/info">tag wiki</a> for a syntax compendium.
ja: 構文の概要に関する<a href="/questions/tagged/regex">正規表現</a> <a href="https://stackoverflow.com/tags/regex/info">タグwiki</a> 。
ko: 구문 개요를위한 <a href="/questions/tagged/regex">정규식</a> <a href="https://stackoverflow.com/tags/regex/info">태그 위키</a> .
ru: Наш <a href="https://stackoverflow.com/tags/regex/info">тег</a> <a href="/questions/tagged/regex">регулярного выражения</a> вики для синтаксического сборника.
zh_cn: 我们的<a href="/questions/tagged/regex">regex</a> <a href="https://stackoverflow.com/tags/regex/info">标签wiki，</a>用于语法汇编。

source: Ping-Pong (redirects and rewrites in unison)
ja: ピンポン(リダイレクトとリライトが一体となったもの
ko: 탁구 (일대일 리디렉션 및 재 작성)
ru: Пинг-понг (перенаправляет и переписывает в унисон)
zh_cn: 乒乓球(转发和改写不同步)

source: Practically it just suppresses the more useful log entries, or server notification mails. You'd be <strong>none the wiser</strong> as to why your RewriteRules never work.
ja: 実際には、より有用なログエントリまたはサーバー通知メールを抑制します。 RewriteRulesが機能しない理由について、あなた<strong>は賢明で</strong>はあり<strong>ません</strong> 。
ko: 실제로 더 유용한 로그 항목 또는 서버 알림 메일을 억제합니다. 왜 RewriteRules가 작동하지 않는지에 <strong>대해 더 현명한 사람은</strong> 아닙니다.
ru: Практически это просто подавляет более полезные записи журнала или почтовые уведомления сервера. Вы не будете <strong>знать,</strong> почему ваши RewriteRules никогда не работают.
zh_cn: 实际上，它只是禁止显示更有用的日志条目或服务器通知邮件。 对于您的RewriteRules为何行不通，您将毫无<strong>智慧</strong> 。

source: Prepend each list of rules with <code>RewriteEngine On</code> still. While mod_rewrite is implicitly active in <code>&lt;VirtualHost&gt;</code> and <code>&lt;Directory&gt;</code> sections, the per-directory <code>.htaccess</code> files need it individually summoned.
ja: ルールの各リストの <code>RewriteEngine On</code> を追加します。 mod_rewriteは <code>&lt;VirtualHost&gt;</code> および <code>&lt;Directory&gt;</code> セクションで暗黙的にアクティブですが、ディレクトリごとの <code>.htaccess</code> ファイルは個別に呼び出す必要があります。
ko: <code>RewriteEngine On</code> 을 사용 하여 각 규칙 목록을 앞에 추가하십시오. <code>&lt;VirtualHost&gt;</code> 및 <code>&lt;Directory&gt;</code> 섹션에서 mod_rewrite가 암시 적으로 활성화되어 있지만 디렉토리 별 <code>.htaccess</code> 파일은 개별적으로 소환해야합니다.
ru: Предварительно добавьте каждый список правил с помощью <code>RewriteEngine On</code> . Хотя mod_rewrite неявно активен в разделах <code>&lt;VirtualHost&gt;</code> и <code>&lt;Directory&gt;</code> , для каждого каталога <code>.htaccess</code> файлы должны вызываться по отдельности.
zh_cn: 将规则的每个列表 <code>RewriteEngine On</code> 。 虽然 <code>&lt;VirtualHost&gt;</code> 和 <code>&lt;Directory&gt;</code> 部分中的mod_rewrite隐式处于活动状态，但每个目录的 <code>.htaccess</code> 文件需要分别将其召唤。

source: Prevalent <code>.htaccess</code> pitfalls
ja: 普及している <code>.htaccess</code> の落とし穴
ko: 널리 퍼진 <code>.htaccess</code> 함정
ru: Распространенные подводные камни <code>.htaccess</code>
zh_cn: 普遍的 <code>.htaccess</code> 陷阱

source: Primarily you put these rewrite rules into your <em>web server configuration file</em>. Apache also allows* you to put them into a file called <code>.htaccess</code> within your document root (i.e. next to your .php files).
ja: 主に、これらの書き換えルールを<em>Webサーバー構成ファイルに配置します</em> 。 Apacheを使用すると、ドキュメントルート内の <code>.htaccess</code> というファイル（つまり、.phpファイルの横）にファイルを配置することもできます*。
ko: 기본적으로 이러한 다시 쓰기 규칙을 <em>웹 서버 구성 파일에</em> 넣습니다. 또한 아파치는 문서 루트 내 (즉, .php 파일 옆)에 <code>.htaccess</code> 라는 파일에 파일을 넣을 수 있도록한다.
ru: Прежде всего, вы помещаете эти правила перезаписи в <em>файл конфигурации</em> вашего <em>веб-сервера</em> . Apache также позволяет * помещать их в файл с именем <code>.htaccess</code> в корневом каталоге вашего документа (то есть рядом с вашими файлами .php).
zh_cn: 首先，您将这些重写规则放入<em>Web服务器配置文件中</em> 。 Apache还允许*将它们放入文档根目录下的 <code>.htaccess</code> 文件中（即.php文件旁边）。

source: Providing discoverability through <code>/common/tree/nesting</code>.
ja: <code>/common/tree/nesting</code> を通じて発見可能性を提供します 。
ko: <code>/common/tree/nesting</code> 을 통한 검색 가능성 제공
ru: Обеспечение возможности обнаружения посредством <code>/common/tree/nesting</code> .
zh_cn: 通过 <code>/common/tree/nesting</code> 提供可发现性。

source: QUERY_STRING exempt from RewriteRules
ja: QUERY_STRING は RewriteRules から除外されます。
ko: QUERY_STRING이 RewriteRules에서 면제
ru: QUERY_STRING исключен из правил перезаписи
zh_cn: QUERY_STRING豁免于RewriteRules。

source: Redirect subdomain to a folder
ja: サブドメインをフォルダにリダイレクト
ko: 하위 도메인을 폴더로 리디렉션
ru: Перенаправление вложенного домена в папку
zh_cn: 将子域重定向到一个文件夹

source: Redirect to <code>HTTPS://</code>
ja: <code>HTTPS://</code> にリダイレクトします
ko: <code>HTTPS://</code> 로 리디렉션
ru: Перенаправление на <code>HTTPS://</code>
zh_cn: 重定向到 <code>HTTPS://</code>

source: Reference: mod_rewrite, URL rewriting and “pretty links” explained
ja: 参考:mod_rewrite、URLの書き換えと「きれいなリンク」の説明
ko: 참조 : mod_rewrite, URL 재 작성 및 "pretty 링크"설명
ru: Ссылка:mod_rewrite,переписывание URL и объяснение "красивых ссылок".
zh_cn: 参考:mod_rewrite,URL重写和 "漂亮链接 "的解释

source: Remove <code>www.</code> from hostname
ja: <code>www.</code> 削除します。 ホスト名から
ko: <code>www.</code> 제거하십시오 . 호스트 이름에서
ru: Удалить <code>www.</code> от имени хоста
zh_cn: 删除 <code>www.</code> 来自主机名

source: Rewrite Conditions
ja: 書き換え条件
ko: 재 작성 조건
ru: Переписать условия
zh_cn: 重写条件

source: Rewrite Example
ja: リライトの例
ko: 재 작성 예
ru: Перезапись Пример
zh_cn: 重写示例

source: Rewrite from URL like "/page" to a script such as "/index.php/page"
ja: page」のようなURLから「index.phppage」のようなスクリプトに書き換える
ko: "/ page"와 같은 URL에서 "/index.php/page"와 같은 스크립트로 다시 작성
ru: Перезапись с URL типа "страница" на скрипт типа "index.phppage".
zh_cn: 将 "page "这样的URL重写成 "index.phppage "这样的脚本

source: RewriteConds just mask one RewriteRule
ja: RewriteConds は単に 1 つの RewriteRule をマスクするだけです。
ko: RewriteConds는 하나의 RewriteRule 만 마스크합니다.
ru: RewriteConds просто замаскируйте один RewriteRule.
zh_cn: RewriteConds只是屏蔽一个RewriteRule

source: See <a href="http://httpd.apache.org/docs/2.2/urlmapping.html">http://httpd.apache.org/docs/2.2/urlmapping.html</a> for further tips.
ja: その他のヒントについては、 <a href="http://httpd.apache.org/docs/2.2/urlmapping.html">http：//httpd.apache.org/docs/2.2/urlmapping.html</a>を参照してください 。
ko: 추가 팁은 <a href="http://httpd.apache.org/docs/2.2/urlmapping.html">http://httpd.apache.org/docs/2.2/urlmapping.html</a> 을 참조 하십시오 .
ru: См. <a href="http://httpd.apache.org/docs/2.2/urlmapping.html">Http://httpd.apache.org/docs/2.2/urlmapping.html</a> для получения дополнительных советов.
zh_cn: 有关更多提示，请参见<a href="http://httpd.apache.org/docs/2.2/urlmapping.html">http://httpd.apache.org/docs/2.2/urlmapping.html</a> 。
