Repository: rueisnom/feedback
Catalog: xlf/20/56/37/72/20563772.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The query string append flag allows us to pass in extra variables to the specified URL which will get added to the original get parameters. For our example this means that something like <code>/blog/1/foo/?comments=15</code> would load <code>/blog/index.php?id=1&amp;title=foo&amp;comments=15</code>
ja: クエリ文字列の追加フラグを使用すると、追加の変数を指定されたURLに渡して、元の取得パラメーターに追加することができます。 この例では、これは <code>/blog/1/foo/?comments=15</code> ようなものが <code>/blog/index.php?id=1&amp;title=foo&amp;comments=15</code> をロードすることを意味します
ko: 쿼리 문자열 추가 플래그를 사용하면 추가 변수를 지정된 URL로 전달하여 원래 get 매개 변수에 추가 할 수 있습니다. 이 예에서 이것은 <code>/blog/1/foo/?comments=15</code> 것이 <code>/blog/index.php?id=1&amp;title=foo&amp;comments=15</code> 를 로드 함을 의미합니다
ru: Флаг добавления строки запроса позволяет нам передавать дополнительные переменные по указанному URL, которые будут добавлены к исходным параметрам получения. Для нашего примера это означает, что что-то вроде <code>/blog/1/foo/?comments=15</code> <code>/blog/index.php?id=1&amp;title=foo&amp;comments=15</code> = 15 загрузит /blog/index.php?id=1&amp;title=foo&amp;comments=15
zh_cn: 查询字符串附加标志允许我们将额外的变量传递到指定的URL，该URL将被添加到原始的get参数中。 对于我们的示例，这意味着 <code>/blog/1/foo/?comments=15</code> 会加载 <code>/blog/index.php?id=1&amp;title=foo&amp;comments=15</code>

source: The rewrite will attempt to load the same file on another domain
ja: 書き換えは、別のドメインで同じファイルをロードしようとします。
ko: 다시 쓰기는 다른 도메인에 동일한 파일을로드하려고 시도합니다
ru: При перезаписи будет сделана попытка загрузить этот же файл в другой домен.
zh_cn: 重写将尝试在另一个域中加载相同的文件。

source: The rule is split into 4 sections:
ja: ルールは4つのセクションに分かれています。
ko: 규칙은 4 개의 섹션으로 나뉩니다.
ru: Правило разделено на 4 секции:
zh_cn: 该规则分为4个部分。

source: The second set of parentheses matches a string with a minimum of 1 character in length, containing only alphanumeric characters (A-Z, a-z, or 0-9) or <code>-</code> or <code>+</code> (note <code>+</code> is escaped with a backslash as without escaping it this will execute as a <a href="http://www.regular-expressions.info/repeat.html">regex repetition character</a>). This can be referenced with <code>$2</code> in the right hand side of the rule
ja: 括弧の2番目のセットは、英数字（AZ、az、または0-9）または <code>-</code> または <code>+</code> （ <code>+</code> はエスケープせずにエスケープされないため、バックスラッシュでエスケープされることに注意）のみを含む、長さが1文字以上の文字列と一致します。 <a href="http://www.regular-expressions.info/repeat.html">正規表現の繰り返し文字</a>として）。 これは、ルールの右側にある <code>$2</code> で参照できます
ko: 두 번째 괄호 세트는 영숫자 (AZ, az 또는 0-9) 또는 <code>-</code> 또는 <code>+</code> (참고 <code>+</code> 는 이스케이프하지 않고 백 슬래시로 이스케이프 처리됨)를 포함하여 최소 1 자 길이의 문자열과 일치합니다. <a href="http://www.regular-expressions.info/repeat.html">정규 표현식 반복 문자로</a> ). 이것은 규칙의 오른쪽에 <code>$2</code> 로 참조 될 수 있습니다
ru: Второй набор скобок соответствует строке длиной не менее 1 символа, содержащей только буквенно-цифровые символы (AZ, az или 0-9) или <code>-</code> или <code>+</code> (note <code>+</code> экранируется с обратной косой чертой, поскольку без экранирования он будет выполнен в качестве <a href="http://www.regular-expressions.info/repeat.html">символа повторения регулярных выражений</a> ). На это можно сослаться с <code>$2</code> в правой части правила
zh_cn: 第二组括号匹配一个长度至少为1个字符的字符串，该字符串仅包含字母数字字符（AZ，az或0-9）或 <code>-</code> 或 <code>+</code> （请注意 <code>+</code> 以反斜杠转义，因为会转义而不会转义）作为<a href="http://www.regular-expressions.info/repeat.html">正则表达式的重复字符</a> ）。 可以在规则的右侧用 <code>$2</code> 进行引用

source: The simplest option to also eschew <code>.php</code> "file extensions" in URLs is enabling:
ja: URLで <code>.php</code> "ファイル拡張子"も回避する最も簡単なオプションは、次のようにします。
ko: URL에서 <code>.php</code> "파일 확장자"를 피하는 가장 간단한 옵션은 다음과 같습니다.
ru: Простейшая опция, позволяющая также избегать <code>.php</code> &laquo;расширений файлов&raquo; в URL, включает:
zh_cn: 在网址中也避开 <code>.php</code> &ldquo;文件扩展名&rdquo;的最简单选择是启用：

source: The web server is an application listening on a port, accepting HTTP requests coming in on that port and returning a response. A web server is entirely free to respond to any request in any way it sees fit/in any way you have configured it to respond. This response is not a file, it's an <em>HTTP response</em> which may or may not have anything to do with physical files on any disk. A web server doesn't have to be Apache, there are many other web servers which are all just programs which run persistently and are attached to a port which respond to HTTP requests. You can write one yourself. This paragraph was intended to divorce you from any notion that URLs directly equal files, which is really important to understand. :)
ja: Webサーバーは、ポートでリッスンするアプリケーションであり、そのポートで着信するHTTPリクエストを受け入れ、応答を返します。 Webサーバーは、適切に見える方法で、または応答するように構成した方法で、要求に完全に自由に応答できます。 この応答はファイルではなく、 <em>HTTP応答</em>であり、ディスク上の物理ファイルとは関係ない場合があります。 WebサーバーはApacheである必要はありません。永続的に実行され、HTTP要求に応答するポートに接続されている単なるプログラムである他の多くのWebサーバーがあります。 自分で書くことができます。 この段落は、URLがファイルと直接等しいという概念から離れることを目的としており、理解することが非常に重要です。 :)
ko: 웹 서버는 포트에서 수신하는 응용 프로그램으로, 해당 포트에서 들어오는 HTTP 요청을 수락하고 응답을 반환합니다. 웹 서버는 응답하도록 구성한 방식에 맞게 어떤 방식 으로든 요청에 ​​응답 할 수 있습니다. 이 응답은 파일이 아니며 <em>HTTP 응답</em> 이므로 디스크의 실제 파일과 관련이 있거나 없을 수 있습니다. 웹 서버는 아파치 일 필요는 없으며, 지속적으로 실행되고 HTTP 요청에 응답하는 포트에 연결된 프로그램 일 뿐인 다른 많은 웹 서버가 있습니다. 직접 쓸 수 있습니다. 이 단락은 URL이 파일과 직접 동일한 개념으로 이해하기 위해 작성되었습니다. 이해해야합니다. :)
ru: Веб-сервер - это приложение, которое прослушивает порт, принимает HTTP-запросы, поступающие на этот порт, и возвращает ответ. Веб-сервер полностью свободен отвечать на любой запрос любым способом, который он сочтет нужным / любым способом, которым вы настроили его для ответа. Этот ответ не является файлом, это <em>ответ HTTP,</em> который может иметь или не иметь никакого отношения к физическим файлам на любом диске. Веб-сервер не обязательно должен быть Apache, есть много других веб-серверов, которые являются просто программами, которые работают постоянно и подключены к порту, который отвечает на HTTP-запросы. Вы можете написать один самостоятельно. Этот абзац был призван отделить вас от любых представлений о том, что URL-адреса напрямую совпадают с файлами, что действительно важно понять. :)
zh_cn: Web服务器是在端口上侦听的应用程序，它接受来自该端口的HTTP请求并返回响应。 Web服务器完全可以自由选择以其认为合适的方式/以您配置为响应的任何方式来响应任何请求。 此响应不是文件，它是<em>HTTP响应</em> ，它与任何磁盘上的物理文件可能有关系也可能没有关系。 Web服务器不必是Apache，还有许多其他Web服务器都只是永久运行的程序，并附加到响应HTTP请求的端口上。 您可以自己写一个。 本段旨在使您脱离URL直接等于文件的任何观念，这一点很重要。 :)

source: There are various online tools to generate RewriteRules for most GET-parameterish URLs:
ja: ほとんどの GET-parameterish URL 用の RewriteRules を生成するための様々なオンラインツールがあります。
ko: 대부분의 GET 매개 변수 URL에 대해 RewriteRules를 생성하는 다양한 온라인 도구가 있습니다.
ru: Существуют различные онлайн-инструменты для генерации RewriteRules для большинства GET-параметрических URL:
zh_cn: 有各种在线工具可以为大多数GET-参数型URL生成RewriteRules。

source: There's a lot mod_rewrite can do and very complex matching rules you can create, including chaining several rewrites, proxying requests to a completely different service or machine, returning specific HTTP status codes as responses, redirecting requests etc. It's very powerful and can be used to great good if you understand the fundamental HTTP request-response mechanism. It does <em>not</em> automatically make your links pretty.
ja: mod_rewriteでできることはたくさんあり、非常に複雑なマッチングルールを作成できます。たとえば、複数の書き換えのチェーン、完全に異なるサービスまたはマシンへのリクエストのプロキシ、特定のHTTPステータスコードをレスポンスとして返す、リクエストのリダイレクトなどです。これは非常に強力で、基本的なHTTP要求/応答メカニズムを理解している場合は非常に便利です。 リンクが自動的にきれいになるわけではありませ<em>ん</em> 。
ko: mod_rewrite가 수행 할 수있는 작업과 여러 번의 다시 쓰기 연결, 완전히 다른 서비스 또는 시스템에 대한 요청 프록시, 특정 HTTP 상태 코드를 응답으로 반환, 요청 리디렉션 등을 포함하여 생성 할 수있는 매우 복잡한 일치 규칙이 있습니다. 매우 강력하고 사용할 수 있습니다. 기본 HTTP 요청-응답 메커니즘을 이해하면 좋습니다. 자동으로 링크를 예쁘게 만들지는 <em>않습니다</em> .
ru: Mod_rewrite может многое сделать, и вы можете создать очень сложные правила сопоставления, включая цепочку нескольких переписываний, передачу запросов на совершенно другой сервис или компьютер, возврат определенных кодов состояния HTTP в виде ответов, перенаправление запросов и т. Д. Это очень мощный инструмент, который можно использовать для очень хорошо, если вы понимаете фундаментальный механизм HTTP-запроса-ответа. Это не делает ваши ссылки красивыми.
zh_cn: mod_rewrite可以做很多事情，您可以创建非常复杂的匹配规则，包括链接多个重写，将请求代理到完全不同的服务或机器，返回特定的HTTP状态代码作为响应，重定向请求等。它非常强大，可用于如果您了解基本的HTTP请求-响应机制，那就太好了。 它不会自动使您的链接漂亮。

source: Therefore you'll often see mixed <code>/article/529-title-slug</code> paths used in practice:
ja: したがって、実際に使用される <code>/article/529-title-slug</code> パスが混在することがよくあります。
ko: 따라서 실제로 사용되는 혼합 <code>/article/529-title-slug</code> 경로가 종종 표시됩니다.
ru: Поэтому вы часто будете видеть смешанные пути <code>/article/529-title-slug</code> , используемые на практике:
zh_cn: 因此，您经常会在实践中看到混合使用 <code>/article/529-title-slug</code> 路径：

source: These are options that are added in square brackets at the end of your rewrite rule to specify certain conditions. Again, there are a lot of different flags which you can read up on in <a href="http://httpd.apache.org/docs/2.2/rewrite/flags.html">the documentation</a>, but I'll go through some of the more common flags:
ja: これらは、特定の条件を指定するために、書き換えルールの最後に角かっこで追加されるオプションです。 繰り返しになりますが<a href="http://httpd.apache.org/docs/2.2/rewrite/flags.html">、ドキュメント</a>で確認できるさまざまなフラグがたくさんありますが、より一般的なフラグのいくつかについて説明します。
ko: 재 작성 규칙 끝에 특정 조건을 지정하기 위해 대괄호 안에 추가되는 옵션입니다. 다시 말하지만, <a href="http://httpd.apache.org/docs/2.2/rewrite/flags.html">문서</a> 에서 읽을 수있는 많은 다른 플래그가 있지만 더 일반적인 플래그 중 일부를 살펴 보겠습니다.
ru: Это параметры, которые добавляются в квадратные скобки в конце правила перезаписи для указания определенных условий. Опять же, есть много различных флагов, о которых вы можете прочитать в <a href="http://httpd.apache.org/docs/2.2/rewrite/flags.html">документации</a> , но я рассмотрю некоторые из наиболее распространенных флагов:
zh_cn: 这些选项在重写规则的末尾添加在方括号中，以指定某些条件。 同样，您可以在<a href="http://httpd.apache.org/docs/2.2/rewrite/flags.html">文档中</a>阅读很多不同的标志，但是我将介绍一些更常见的标志：

source: This common trick involves sending a 30x/Location <em>redirect</em> whenever an incoming URL follows the obsolete/ugly naming scheme. Browsers will then <em>rerequest</em> the new/pretty URL, which afterwards is rewritten (just internally) to the original or new location.
ja: この一般的なトリックには、着信URLが廃止された/醜い命名スキームに従う場合は常に、30x / Location <em>リダイレクト</em>を送信することが含まれます。 その後、 <em>ブラウザー</em>は新しい/かなりのURLを<em>再要求</em>します。このURLは、後で（内部的にのみ）元の場所または新しい場所に書き換えられます。
ko: 이 일반적인 속임수는 들어오는 URL이 더 이상 사용되지 않는 추악한 이름 지정 체계를 따르는 경우 30 배 / 위치 <em>리디렉션을</em> 보내는 것입니다. 그런 다음 브라우저는 새 / 예쁜 URL을 다시 요청하며,이 URL은 나중에 내부 또는 원래 위치로 다시 작성됩니다.
ru: Эта распространенная хитрость заключается в отправке <em>перенаправления</em> 30x / Location всякий раз, когда входящий URL-адрес следует устаревшей / уродливой схеме именования. Браузеры затем <em>запросят</em> новый / красивый URL, который впоследствии будет переписан (только внутри) в исходное или новое местоположение.
zh_cn: 这个常见技巧是，只要传入URL遵循过时/难看的命名方案，就发送30x / Location <em>重定向</em> 。 然后，浏览器将重新<em>请求</em>新的/漂亮的URL，然后将其（仅在内部）重写为原始或新的位置。

source: This doesn't tell you which RewriteRule is the culprit. But inaccessible final paths like <code>/docroot/21-.itle?index.php</code> may give away where to inspect further. Otherwise disable rules until you get some predictable paths.
ja: これは、どのRewriteRuleが原因かはわかりません。 しかし、 <code>/docroot/21-.itle?index.php</code> のようなアクセスできない最終パスは、どこをさらに調査するかを与える可能性があります。 それ以外の場合は、予測可能なパスが得られるまでルールを無効にします。
ko: 이것은 어느 RewriteRule이 범인인지는 알려주지 않습니다. 그러나 <code>/docroot/21-.itle?index.php</code> 와 같은 액세스 할 수없는 최종 경로는 추가 검사 위치를 제공 할 수 있습니다. 그렇지 않으면 예측 가능한 경로를 얻을 때까지 규칙을 비활성화하십시오.
ru: Это не говорит вам, какой RewriteRule является виновником. Но недоступные конечные пути, такие как <code>/docroot/21-.itle?index.php</code> , могут указывать , где проводить дальнейшую проверку. В противном случае отключите правила, пока не получите предсказуемые пути.
zh_cn: 这并不能告诉您是哪个RewriteRule是罪魁祸首。 但是 <code>/docroot/21-.itle?index.php</code> 之类无法访问的最终路径可能会放弃进一步检查的位置。 否则，请禁用规则，直到获得一些可预测的路径。

source: This flag isn't one I used in the example above, but is one I thought is worth mentioning. This allows you to specify a http redirect, with the option to include a status code (e.g. <code>R=301</code>). For example if you wanted to do a 301 redirect on /myblog/ to /blog/ you would simply write a rule something like this:
ja: このフラグは上の例で使用したものではありませんが、言及する価値があると思いました。 これにより、ステータスコード（例： <code>R=301</code> ）を含めるオプションを使用して、httpリダイレクトを指定できます。 たとえば、/ myblog /を/ blog /に301リダイレクトする場合は、次のようなルールを記述します。
ko: 이 플래그는 위 예제에서 사용한 것이 아니지만 언급 할 가치가있는 것으로 생각됩니다. 이를 통해 상태 코드를 포함하는 옵션 (예 : <code>R=301</code> )과 함께 http 리디렉션을 지정할 수 있습니다. 예를 들어, / myblog /에서 / blog /로 301 리디렉션을 수행하려면 다음과 같은 규칙을 작성하면됩니다.
ru: Этот флаг не тот, который я использовал в приведенном выше примере, но я думаю, стоит упомянуть. Это позволяет вам указать перенаправление http с возможностью включения кода состояния (например, <code>R=301</code> ). Например, если вы хотите сделать редирект 301 в / myblog / to / blog /, вы просто напишите правило примерно так:
zh_cn: 这个标志不是我在上面的示例中使用的一个标志，但是我认为值得一提。 这使您可以指定http重定向，并可以选择包括状态码（例如 <code>R=301</code> ）。 例如，如果您想在/ myblog /上执行301重定向到/ blog /，则只需编写如下规则：

source: This has Apache select <code>article.php</code> for HTTP requests on <code>/article</code> due to the matching basename. And this works well together with the aforementioned PATH_INFO feature. So you can just use URLs like <code>http://example.com/article/virtual/title</code>. Which makes sense if you have a traditional web application with multiple PHP invocation points/scripts.
ja: これには、ベース名が一致するため、 <code>/article</code> の HTTPリクエスト用にApache select <code>article.php</code> があります。 そして、これは前述のPATH_INFO機能と一緒にうまく機能します。 したがって、 <code>http://example.com/article/virtual/title</code> //example.com/article/virtual/titleのようなURLを使用できます。 これは、複数のPHP呼び出しポイント/スクリプトを持つ従来のWebアプリケーションがある場合に意味があります。
ko: 일치하는 기본 이름으로 인해 <code>/article</code> 의 HTTP 요청에 대해 Apache select <code>article.php</code> 가 있습니다. 그리고 이것은 위에서 언급 한 PATH_INFO 기능과 함께 잘 작동합니다. 따라서 <code>http://example.com/article/virtual/title</code> 과 같은 URL을 사용할 수 있습니다. 여러 PHP 호출 지점 / 스크립트가있는 전통적인 웹 응용 프로그램이있는 경우 의미가 있습니다.
ru: При этом Apache выбирает <code>article.php</code> для HTTP-запросов на <code>/article</code> из-за совпадения базового имени. И это хорошо работает вместе с вышеупомянутой функцией PATH_INFO. Таким образом, вы можете просто использовать URL-адреса, такие как <code>http://example.com/article/virtual/title</code> . Что имеет смысл, если у вас есть традиционное веб-приложение с несколькими точками вызова / сценариями PHP.
zh_cn: 由于匹配的基本名称，因此在 <code>/article</code> 上有Apache select <code>article.php</code> 用于HTTP请求。 并与前面提到的PATH_INFO功能一起很好地工作。 因此，您可以只使用 <code>http://example.com/article/virtual/title</code> 之类的 URL。 如果您有一个具有多个PHP调用点/脚本的传统Web应用程序，则这很有意义。

source: This is a very common practice, which will prepend your domain with <code>www.</code> (if it isn't there already) and execute a 301 redirect. For example, loading up <code>http://example.com/blog/</code> it would redirect you to <code>http://www.example.com/blog/</code>
ja: これは非常に一般的な方法であり、ドメインの <code>www.</code> が付加されます。 （まだ存在しない場合）、301リダイレクトを実行します。 たとえば、 <code>http://example.com/blog/</code> をロードすると、 http：//www.example.com/blog/にリダイレクトされ <code>http://www.example.com/blog/</code>
ko: 이것은 매우 일반적인 관행이며 도메인을 <code>www.</code> 앞에 추가합니다 . (없는 경우) 301 리디렉션을 실행하십시오. 예를 들어 <code>http://example.com/blog/</code> 를 로드하면 <code>http://www.example.com/blog/</code> 로 리디렉션됩니다 .
ru: Это очень распространенная практика, которая добавляет ваш домен к <code>www.</code> (если его там еще нет) и выполните перенаправление 301. Например, при загрузке <code>http://example.com/blog/</code> он перенаправит вас на <code>http://www.example.com/blog/</code> .
zh_cn: 这是一种非常普遍的做法，它将在您的域名之前加上 <code>www.</code> （如果尚不存在）并执行301重定向。 例如，加载 <code>http://example.com/blog/</code> 会将其重定向到 <code>http://www.example.com/blog/</code>

source: This is just as valid a request for a URL, and it has more obviously nothing to do with files.
ja: これはURLへのリクエストと同様に有効であり、ファイルとはより明らかに何の関係もありません。
ko: 이것은 URL에 대한 유효한 요청이며 파일과는 더 관련이 없습니다.
ru: Это такой же правильный запрос на URL,и,что более очевидно,он не имеет никакого отношения к файлам.
zh_cn: 这和URL的请求一样有效,而且更明显的是与文件无关。

source: This is often seen in old tutorials. And it used to be correct for ancient Apache 1.x versions. Nowadays request paths are conveniently <em>fully <strong>directory-relative</strong></em> in <code>.htaccess</code> RewriteRules. Just leave the leading <code>/</code> out.
ja: これは古いチュートリアルでよく見られます。 かつては、Apache 1.xの古いバージョンでは適切でした。 現在、リクエストパスは <code>.htaccess</code> RewriteRulesで<em>完全に<strong>ディレクトリ相対</strong></em>になっています。 先導する <code>/</code> 外すだけです。
ko: 이것은 종종 오래된 튜토리얼에서 볼 수 있습니다. 그리고 그것은 고대 아파치 1.x 버전에 맞았습니다. 요즘 요청 경로는 <code>.htaccess</code> RewriteRules에서 편리 <em>하게 <strong>디렉토리에 상대적</strong></em> 입니다. 그냥 앞 <code>/</code> 밖으로 나가십시오.
ru: Это часто встречается в старых уроках. И это было правильно для древних версий Apache 1.x. В настоящее время пути запросов удобно <em>полностью <strong>относительны к каталогам</strong></em> в <code>.htaccess</code> RewriteRules. Просто оставьте ведущий <code>/</code> выход.
zh_cn: 这在旧教程中很常见。 而且它过去对于古老的Apache 1.x版本是正确的。 如今，请求路径在 <code>.htaccess</code> RewriteRules中很方便是<em>完全<strong>相对于目录的</strong></em> 。 只是离开领先 <code>/</code> 退出。

source: This is slightly less common, but is a good example of a rule that doesn't execute if the filename is a directory or file that exists on the server.
ja: これは少し一般的ではありませんが、ファイル名がサーバ上に存在するディレクトリやファイルの場合には実行されないルールの良い例です。
ko: 이것은 일반적이지 않지만 파일 이름이 서버에 존재하는 디렉토리 또는 파일 인 경우 실행되지 않는 규칙의 좋은 예입니다.
ru: Это немного менее распространено,но является хорошим примером правила,которое не выполняется,если имя файла является каталогом или файлом,который существует на сервере.
zh_cn: 这种情况稍显少见,但也是一个很好的例子,如果文件名是服务器上存在的目录或文件,则不执行该规则。

source: This is somewhat dependent on your server setup and the used PHP SAPI. Common alternatives include <code>ForceType application/x-httpd-php</code> or <code>AddHandler php5-script</code>.
ja: これは、サーバーの設定と使用されているPHP SAPIによって多少異なります。 一般的な代替手段には、 <code>ForceType application/x-httpd-php</code> または <code>AddHandler php5-script</code> があります 。
ko: 이것은 서버 설정과 사용 된 PHP SAPI에 따라 다소 다릅니다. 일반적인 대안으로는 <code>ForceType application/x-httpd-php</code> 또는 <code>AddHandler php5-script</code> 가 있습니다.
ru: Это в некоторой степени зависит от настроек вашего сервера и используемого PHP SAPI. Распространенные альтернативы включают <code>ForceType application/x-httpd-php</code> или <code>AddHandler php5-script</code> .
zh_cn: 这在某种程度上取决于您的服务器设置和使用的PHP SAPI。 常见的替代方法包括 <code>ForceType application/x-httpd-php</code> 或 <code>AddHandler php5-script</code> 。

source: This is the simple request of a browser to a web server requesting the <em>URL</em><code>/foo/bar.html</code> from it. It is important to stress that it does not request a <em>file</em>, it requests just some arbitrary URL. The request may also look like this:
ja: これは、 <code>/foo/bar.html</code> という<em>URL</em>を要求するWebサーバーへのブラウザーの単純な要求です。 <em>ファイルを</em>要求するのではなく、任意のURLを要求するだけであることを強調することが重要です。 リクエストは次のようになります。
ko: 이것은 웹 서버에 브라우저에서 <em>URL</em> <code>/foo/bar.html</code> 을 요청하는 간단한 요청입니다. <em>파일을</em> 요청하지 않고 임의의 URL 만 요청한다는 점을 강조하는 것이 중요합니다. 요청은 다음과 같습니다.
ru: Это простой запрос браузера к веб-серверу с запросом <em>URL</em> <code>/foo/bar.html</code> . Важно подчеркнуть, что он не запрашивает <em>файл</em> , он запрашивает только какой-то произвольный URL. Запрос также может выглядеть так:
zh_cn: 这是浏览器对Web服务器的简单请求，从中请求<em>URL</em> <code>/foo/bar.html</code> 。 需要强调的是，它不请求<em>文件</em> ，它仅请求某个任意URL。 该请求也可能如下所示：

source: This isn't as convenient as having Apache separate input path segments into <code>$1</code>, <code>$2</code>, <code>$3</code> and passing them as distinct <code>$_GET</code> variables to PHP. It's merely emulating "pretty URLs" with less configuration effort.
ja: これは、Apacheが個別の入力パスセグメントを <code>$1</code> 、 <code>$2</code> 、 <code>$3</code> 分け、それらを個別の <code>$_GET</code> 変数としてPHPに渡すほど便利ではありません。 構成作業を少なくして、「きれいなURL」をエミュレートするだけです。
ko: 이것은 아파치가 별도의 입력 경로 세그먼트를 <code>$1</code> , <code>$2</code> , <code>$3</code> 로 나누고 별개의 <code>$_GET</code> 변수로 PHP에 전달하는 것만 큼 편리하지 않습니다. 적은 노력으로 "예쁜 URL"을 모방 할뿐입니다.
ru: Это не так удобно, как разделять Apache сегменты входного пути на <code>$1</code> , <code>$2</code> , <code>$3</code> и передавать их в виде отдельных переменных <code>$_GET</code> в PHP. Он просто эмулирует &laquo;красивые URL&raquo; с меньшими усилиями по настройке.
zh_cn: 这不像让Apache将输入路径段分成 <code>$1</code> ， <code>$2</code> ， <code>$3</code> 并将它们作为不同的 <code>$_GET</code> 变量传递给PHP那样方便。 它只是以较少的配置工作来模拟&ldquo;漂亮的URL&rdquo;。

source: This nets quicker and more exact answers, and makes them more useful to others.
ja: これにより、より迅速かつ正確な回答が得られ、他の人にとってより有用なものになります。
ko: 이를 통해 더 빠르고 정확한 답변을 얻을 수 있으며 다른 사람들에게 더 유용합니다.
ru: Эти сети дают более быстрые и точные ответы и делают их более полезными для других.
zh_cn: 这种网罗更快、更准确的答案,使其对别人更有用。

source: This optionalized any <code>/&hellip;/&hellip;/&hellip;</code> trailing path segments. Which then of course requires the handling script to split them up, and <em>variabl-ify</em> extracted parameters itself (which is what <em>Web-"MVC"</em> frameworks do).
ja: これにより、任意の <code>/&hellip;/&hellip;/&hellip;</code> 後続パスセグメントがオプション化されました。 もちろん、それらを分割するための処理スクリプトと、抽出されたパラメーター自体を<em>variabl-ify</em>する必要があります（これは<em>Web- "MVC"</em>フレームワークが行うことです）。
ko: 이것은 /.../&hellip;/&hellip; 후행 경로 세그먼트를 선택적으로 설정했습니다. 물론,이를 처리하기 위해 처리 스크립트가 필요하며 추출 된 매개 변수 자체를 <em>variabl-ify</em> ( <em>웹- "MVC"</em> 프레임 워크가하는 것)가 필요합니다.
ru: Это позволяет произвольно использовать любые <code>/&hellip;/&hellip;/&hellip;</code> конечные сегменты пути. Что, конечно же, требует, чтобы скрипт обработки разделял их, и <em>переменные</em> извлекали параметры сами (что и делают <em>веб-</em> фреймворки <em>MVC</em> ).
zh_cn: 这是可选的任何 <code>/&hellip;/&hellip;/&hellip;</code> 尾随路径段。 然后，这当然需要处理脚本将其拆分，并可变化提取的参数本身（这是<em>Web&ldquo; MVC&rdquo;</em>框架的作用）。

source: This rule matches anything (<code>.*</code>) and <em>captures</em> it (<code>(..)</code>), then rewrites it to append ".html". In other words, if <code>/foo/bar</code> was the requested URL, it will be handled as if <code>/foo/bar.html</code> had been requested. See <a href="http://regular-expressions.info">http://regular-expressions.info</a> for more information about regular expression matching, capturing and replacements.
ja: このルールは、あらゆるもの（ <code>.*</code> ）に一致し、それを<em>キャプチャー</em> （ <code>(..)</code> ）してから、「。html」を追加するように書き換えます。 つまり、 <code>/foo/bar</code> が要求されたURLであった場合、 / foo / <code>/foo/bar.html</code> が要求された場合と同様に処理されます。 正規表現の一致、キャプチャ、および置換の詳細については、 <a href="http://regular-expressions.info">http：//regular-expressions.info</a>を参照してください。
ko: 이 규칙은 모든 항목 ( <code>.*</code> )을 일치시키고 <em>캡처</em> ( <code>(..)</code> ) 한 다음 ".html"을 추가하도록 다시 씁니다. 즉, <code>/foo/bar</code> 가 요청 된 URL 인 경우 <code>/foo/bar.html</code> 이 요청 된 것처럼 처리됩니다. 정규식 일치, 캡처 및 대체에 대한 자세한 내용은 <a href="http://regular-expressions.info">http://regular-expressions.info</a> 를 참조하십시오.
ru: Это правило соответствует чему-либо ( <code>.*</code> ) И <em>захватывает</em> его ( <code>(..)</code> ), а затем переписывает его, добавляя &laquo;.html&raquo;. Другими словами, если <code>/foo/bar</code> был запрошенным URL, он будет обрабатываться так, как если бы был запрошен <code>/foo/bar.html</code> . Смотрите <a href="http://regular-expressions.info">http://regular-expressions.info</a> для получения дополнительной информации о сопоставлении регулярных выражений, захвате и заменах.
zh_cn: 此规则匹配任何内容（ <code>.*</code> ）并<em>捕获</em>它（ <code>(..)</code> ），然后将其重写以附加&ldquo; .html&rdquo;。 换句话说，如果 <code>/foo/bar</code> 是请求的URL，则将如同请求 <code>/foo/bar.html</code> 一样进行处理。 有关正则表达式匹配，捕获和替换的更多信息，请参见<a href="http://regular-expressions.info">http://regular-expressions.info</a> 。
