Repository: rueisnom/feedback
Catalog: xlf/19/96/00/77/19960077.*.001.xlf
Languages: es, ja, ko, ru

source: <code>Series.isin</code> accepts various types as inputs. The following are all valid ways of getting what you want:
es: <code>Series.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> acepta varios tipos como entradas. </font><font style="vertical-align: inherit;">Las siguientes son todas formas v&aacute;lidas de obtener lo que desea:</font></font>
ja: <code>Series.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、さまざまなタイプを入力として受け入れます。</font><font style="vertical-align: inherit;">以下は、必要なものを取得するためのすべての有効な方法です。</font></font>
ko: <code>Series.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 다양한 유형을 입력으로 허용합니다. </font><font style="vertical-align: inherit;">다음은 원하는 것을 얻는 유효한 방법입니다.</font></font>
ru: <code>Series.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> принимает различные типы в качестве входных данных. </font><font style="vertical-align: inherit;">Ниже приведены все действительные способы получить то, что вы хотите:</font></font>

source: <strong>implement in</strong>:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">implementar en</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внедрить в</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: <strong>implement not in</strong> as in of rest countries:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">implementar no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como en el resto de pa&iacute;ses:</font></font>
ja: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">残りの国では</font><strong><font style="vertical-align: inherit;">ない実装</font></strong><font style="vertical-align: inherit;">：</font></font>
ko: <strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나머지 국가 </font><strong><font style="vertical-align: inherit;">에서</font></strong><font style="vertical-align: inherit;"> 와 같이 </font><strong><font style="vertical-align: inherit;">구현하지 마십시오</font></strong><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">осуществлять не так,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как в остальных странах:</font></font>

source: Alternative solution that uses <a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method">.query()</a> method:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n alternativa que utiliza el </font><font style="vertical-align: inherit;">m&eacute;todo </font></font><a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.query ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.query（）</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">を使用する代替ソリューション</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.query ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">를 사용하는 대체 솔루션 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Альтернативное решение, использующее </font></font><a href="http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">метод .query ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: As a worked example:
es: Como ejemplo práctico:
ja: 実務例として。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실례로 :</font></font>
ru: В качестве сработанного примера:

source: But this seems like a horrible kludge. Can anyone improve on it?
es: Pero esto parece un horrible golpe.¿Alguien puede mejorarlo?
ja: しかし、これは恐ろしいほどの不良品のように思えます。誰か改善してくれませんか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 이것은 끔찍한 kludge처럼 보인다. </font><font style="vertical-align: inherit;">누구든지 그것을 향상시킬 수 있습니까?</font></font>
ru: Но это похоже на ужасное пятно.Кто-нибудь может его улучшить?

source: Collating possible solutions from the answers:
es: Recopilando posibles soluciones a partir de las respuestas:
ja: 答えから考えられる解決策をまとめる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">답변에서 가능한 솔루션을 정리합니다.</font></font>
ru: Сбор возможных решений из ответов:

source: Filter DataFrame Based on ONE Column (also applies to Series)
es: Filtro DataFrame basado en una columna (también se aplica a las series)
ja: 1カラムに基づくフィルタDataFrame(シリーズにも適用されます
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 열을 기준으로 데이터 프레임 필터링 (시리즈에도 적용)</font></font>
ru: Фильтр-кадр DataFrame На основе ОДНОЙ колонки (также относится к серии)

source: Filter on MANY Columns
es: Filtro en MUCHAS Columnas
ja: 多数のカラムにフィルタをかける
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 열에서 필터링</font></font>
ru: Фильтр на колоннах MANY

source: For "IN" use: <code>something.isin(somewhere)</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para uso "IN": </font></font> <code>something.isin(somewhere)</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「IN」の場合：</font></font> <code>something.isin(somewhere)</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"IN"사용 : </font></font> <code>something.isin(somewhere)</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для &laquo;IN&raquo; используйте : </font></font> <code>something.isin(somewhere)</code>

source: For IN: <code>df[df['A'].isin([3, 6])]</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para IN: </font></font> <code>df[df['A'].isin([3, 6])]</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">INの場合：</font></font> <code>df[df['A'].isin([3, 6])]</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IN의 경우 : </font></font> <code>df[df['A'].isin([3, 6])]</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для IN: </font></font> <code>df[df['A'].isin([3, 6])]</code>

source: For NOT IN:
es: Por NO ENTRAR:
ja: NOT INのために。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NOT IN의 경우 :</font></font>
ru: Для НЕ В:

source: From this, <strong>to retain rows where at least one column is <code>True</code></strong>, we can use <code>any</code> along the first axis:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de esto, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">para retener filas donde al menos una columna es </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos usar </font></font> <code>any</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> largo del primer eje:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これから</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、少なくとも1つの列が</font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">である行を保持する</font></strong><font style="vertical-align: inherit;">には、最初の軸に沿って</font></font> <code>any</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이로부터 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">적어도 하나의 열이 </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font><strong><font style="vertical-align: inherit;">행을 유지</font></strong><font style="vertical-align: inherit;"> 하려면 첫 번째 축을 따라 </font></font> <code>any</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Исходя из этого, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чтобы сохранить строки, в которых хотя бы один столбец равен </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы можем использовать </font></font> <code>any</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по первой оси:</font></font>

source: How can I achieve the equivalents of SQL's <code>IN</code> and <code>NOT IN</code>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo puedo lograr los equivalentes de SQL's </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>NOT IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQLの</font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>NOT IN</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相当するものをどのように実現でき</font><font style="vertical-align: inherit;">ますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQL의 </font></font> <code>IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>NOT IN</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해당하는 것을 어떻게 얻을 수 </font><font style="vertical-align: inherit;">있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу получить эквиваленты SQL </font></font> <code>IN</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а </font></font> <code>NOT IN</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>

source: How to filter Pandas dataframe using 'in' and 'not in' like in SQL
es: Cómo filtrar el marco de datos de Pandas usando "en" y "no en" como en SQL
ja: SQLのように'in'と'not in'を使用してPandasのデータフレームをフィルタリングする方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQL에서와 같이 'in'과 'not in'을 사용하여 Pandas 데이터 프레임을 필터링하는 방법</font></font>
ru: Как отфильтровать фрейм данных Pandas,используя 'in' и 'not in',как это делается в SQL.

source: How to implement 'in' and 'not in' for a pandas DataFrame?
es: ¿Cómo implementar "en" y "no en" para un DataFrame de pandas?
ja: パンダのDataFrameに'in'と'not in'を実装するには?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">팬더 DataFrame에 대해 'in'과 'not in'을 구현하는 방법은 무엇입니까?</font></font>
ru: Как внедрить "в" и "не в" для панд DataFrame?

source: I have a list with the required values. Here's the scenario:
es: Tengo una lista con los valores requeridos.Aquí está el escenario:
ja: 必要な値のリストを持っています シナリオはこんな感じです
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필요한 값이있는 목록이 있습니다. </font><font style="vertical-align: inherit;">시나리오는 다음과 같습니다.</font></font>
ru: У меня есть список с нужными значениями.Вот сценарий:

source: I wanted to filter out dfbc rows that had a BUSINESS_ID that was also in the BUSINESS_ID of dfProfilesBusIds
es: Quería filtrar las filas de dfbc que tenían un BUSINESS_ID que también estaba en el BUSINESS_ID de dfProfilesBusIds
ja: dfProfilesBusIdsのBUSINESS_IDにもあるBUSINESS_IDを持つdfbc行をフィルタリングしたいと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BUSINESS_ID가 dfProfilesBusIds 인 BUSINESS_ID가있는 dfbc 행을 필터링하고 싶었습니다.</font></font>
ru: Я хотел отфильтровать строки dfbc,которые имеют BUSINESS_ID,который также находится в BUSINESS_ID dfProfilesBusIds.

source: I've been usually doing generic filtering over rows like this:
es: Normalmente he estado haciendo un filtrado genérico sobre filas como esta:
ja: 普段はこんな感じで行に対して汎用的なフィルタリングをしていました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 보통 다음과 같은 행에 대해 일반적인 필터링을 수행했습니다.</font></font>
ru: Обычно я делаю общую фильтрацию по таким рядам:

source: In addition to the methods described above, you can also use the numpy equivalent: <a href="https://docs.scipy.org/doc/numpy/reference/generated/numpy.isin.html"><code>numpy.isin</code></a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s de los m&eacute;todos descritos anteriormente, tambi&eacute;n puede usar el equivalente </font></font><a href="https://docs.scipy.org/doc/numpy/reference/generated/numpy.isin.html"> <code>numpy.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">numpy.isin</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のメソッドに加えて、同等のnumpyを使用することもできます：</font></font><a href="https://docs.scipy.org/doc/numpy/reference/generated/numpy.isin.html"> <code>numpy.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위에서 설명한 방법 외에도 numpy와 동등한 </font></font><a href="https://docs.scipy.org/doc/numpy/reference/generated/numpy.isin.html"> <code>numpy.isin</code> 을</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수도 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В дополнение к методам, описанным выше, вы также можете использовать </font></font><a href="https://docs.scipy.org/doc/numpy/reference/generated/numpy.isin.html"> <code>numpy.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> эквивалент: </font><font style="vertical-align: inherit;">numpy.isin</font><font style="vertical-align: inherit;"> .</font></font>

source: It is a lot more unwieldy to specify, however, so don't use it unless you know what you're doing.
es: Sin embargo,es mucho más difícil de especificar,así que no lo uses a menos que sepas lo que estás haciendo.
ja: とはいえ、指定するのが面倒くさいので、わかっている人以外は使わないようにしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 지정하기가 훨씬 더 어려우므로 수행중인 작업을 모르는 경우 사용하지 마십시오.</font></font>
ru: Однако,указывать его гораздо сложнее,поэтому не используйте его,если не знаете,что делаете.

source: Lastly, there's also <code>DataFrame.query</code> which has been covered in <a href="https://stackoverflow.com/a/45190397/4909087">this answer</a>. numexpr FTW!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por &uacute;ltimo, tambi&eacute;n hay </font></font> <code>DataFrame.query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se ha cubierto en </font></font><a href="https://stackoverflow.com/a/45190397/4909087"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">numexpr FTW!</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最後に、</font><a href="https://stackoverflow.com/a/45190397/4909087"><font style="vertical-align: inherit;">この回答で</font></a><font style="vertical-align: inherit;">カバーされている</font></font> <code>DataFrame.query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もあり</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">numexpr FTW！</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막 </font><a href="https://stackoverflow.com/a/45190397/4909087"><font style="vertical-align: inherit;">으로이 답변</font></a><font style="vertical-align: inherit;"> 에서 다루는 </font></font> <code>DataFrame.query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">numexpr FTW!</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наконец, есть также </font></font> <code>DataFrame.query</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который был рассмотрен в </font></font><a href="https://stackoverflow.com/a/45190397/4909087"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом ответе</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Numxpr FTW!</font></font>

source: My current way of doing this is as follows:
es: Mi forma actual de hacer esto es la siguiente:
ja: 現在の私のやり方は以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 수행하는 현재 방법은 다음과 같습니다.</font></font>
ru: В настоящее время я делаю это следующим образом:

source: Notable Mentions: <code>numpy.isin</code>, <code>query</code>, list comprehensions (string data)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Menciones notables: </font></font> <code>numpy.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , comprensi&oacute;n de listas (datos de cadena)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">主な</font></font> <code>numpy.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">numpy.isin</font><font style="vertical-align: inherit;">、</font></font> <code>query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、リスト内包表記（文字列データ）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주목할만한 언급 : </font></font> <code>numpy.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , list comprehensions (string data)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечательные упоминания: </font></font> <code>numpy.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>query</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , списки (строковые данные)</font></font>

source: Note that if you want to search every column, you'd just omit the column selection step and do
es: Ten en cuenta que si quieres buscar en todas las columnas,sólo tienes que omitir el paso de selección de columna y hacer
ja: すべてのカラムを検索したい場合は、カラム選択ステップを省略して
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 열을 검색하려면 열 선택 단계를 생략하고 수행하십시오.</font></font>
ru: Обратите внимание,что если вы хотите провести поиск по каждому столбцу,вы просто пропустите шаг выбора столбца и сделаете следующее

source: Or for "NOT IN": <code>~something.isin(somewhere)</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O para "NO EN": </font></font> <code>~something.isin(somewhere)</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または「NOT IN」の場合：</font></font> <code>~something.isin(somewhere)</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 "NOT IN"의 경우 : </font></font> <code>~something.isin(somewhere)</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или для &laquo;НЕ В&raquo;: </font></font> <code>~something.isin(somewhere)</code>
