Repository: rueisnom/feedback
Catalog: xlf/19/96/00/77/19960077.*.001.xlf
Languages: es, ja, ko, ru

source: Pandas offers two methods: <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html"><strong><code>Series.isin</code></strong></a> and <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin"><strong><code>DataFrame.isin</code></strong></a> for Series and DataFrames, respectively.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas ofrece dos m&eacute;todos: </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html"><strong> <code>Series.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin"><strong> <code>DataFrame.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para Series y DataFrames, respectivamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：パンダは、二つの方法提供しています</font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html"><strong> <code>Series.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin"><strong> <code>DataFrame.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それぞれ、シリーズおよびデータフレームのために。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas는 </font><font style="vertical-align: inherit;">Series와 DataFrames에 대해 각각 </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html"><strong> <code>Series.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin"><strong> <code>DataFrame.isin</code> 의</strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 가지 방법을 제공합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pandas предлагает два метода: </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html"><strong> <code>Series.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin"><strong> <code>DataFrame.isin</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для Series и DataFrames соответственно.</font></font>

source: Pandas routines are usually iterative when working with strings, because string operations are hard to vectorise. <a href="https://stackoverflow.com/questions/54028199/for-loops-with-pandas-when-should-i-care">There is a lot of evidence to suggest that list comprehensions will be faster here.</a>. We resort to an <code>in</code> check now.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las rutinas de los pandas suelen ser iterativas cuando se trabaja con cadenas, porque las operaciones de cadena son dif&iacute;ciles de vectorizar. </font></font><a href="https://stackoverflow.com/questions/54028199/for-loops-with-pandas-when-should-i-care"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay mucha evidencia que sugiere que las comprensiones de listas ser&aacute;n m&aacute;s r&aacute;pidas aqu&iacute;. </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Se recurre a una </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cheque ahora.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文字列操作はベクトル化するのが難しいため、文字列を操作する場合、通常Pandasルーチンは反復的です。</font></font><a href="https://stackoverflow.com/questions/54028199/for-loops-with-pandas-when-should-i-care"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは、リスト内包表記の方が高速であることを示唆する多くの証拠があります。</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">私たちは、に頼る</font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なりましチェック。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문자열 작업은 벡터화하기 어렵 기 때문에 문자열 작업시 팬더 루틴은 일반적으로 반복됩니다. </font></font><a href="https://stackoverflow.com/questions/54028199/for-loops-with-pandas-when-should-i-care"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">목록 이해가 더 빠를 것이라는 많은 증거가 있습니다. </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">우리는 리조트 </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지금 확인.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Процедуры Pandas обычно итеративны при работе со строками, потому что строковые операции трудно векторизовать. </font></font><a href="https://stackoverflow.com/questions/54028199/for-loops-with-pandas-when-should-i-care"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует много доказательств того, что составление списков здесь будет быстрее. </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Мы прибегаем к </font></font> <code>in</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> настоящее чеку.</font></font>

source: Similarly, <strong>to retain rows where ALL columns are <code>True</code></strong>, use <code>all</code> in the same manner as before.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De manera similar, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">para retener filas donde TODAS las columnas son </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , use </font></font> <code>all</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la misma manera que antes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同様に、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての列が</font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">である</font><strong><font style="vertical-align: inherit;">行を保持する</font></strong><font style="vertical-align: inherit;">には、以前と同じ方法で</font></font> <code>all</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마찬가지로 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 열이 </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font><strong><font style="vertical-align: inherit;">행을 유지</font></strong><font style="vertical-align: inherit;"> 하려면 </font><font style="vertical-align: inherit;">이전과 동일한 방식으로 </font></font> <code>all</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Аналогично, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чтобы сохранить строки, в которых ВСЕ столбцы имеют значение </font></font> <code>True</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , используйте </font></font> <code>all</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> же, как и раньше.</font></font>

source: Sometimes, you will want to apply an 'in' membership check with some search terms over multiple columns,
es: A veces,querrá aplicar una verificación de membresía "in" con algunos términos de búsqueda en varias columnas,
ja: 場合によっては、複数の列にまたがるいくつかの検索語句で「イン」メンバーシップチェックを適用したいこともあるでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우에 따라 여러 열에 대해 일부 검색어와 함께 'in'멤버십 확인을 적용하려고 할 수 있습니다.</font></font>
ru: Иногда Вы захотите применить проверку "в" членства с некоторыми поисковыми терминами по нескольким столбцам,

source: The most common scenario is applying an <code>isin</code> condition on a specific column to filter rows in a DataFrame.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El escenario m&aacute;s com&uacute;n es aplicar una </font><font style="vertical-align: inherit;">condici&oacute;n </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en una columna espec&iacute;fica para filtrar filas en un DataFrame.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最も一般的なシナリオは</font><font style="vertical-align: inherit;">、特定の列に</font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">条件を</font><font style="vertical-align: inherit;">適用</font><font style="vertical-align: inherit;">して、DataFrameの行をフィルター処理することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 일반적인 시나리오는 </font><font style="vertical-align: inherit;">특정 열에 </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조건을 </font><font style="vertical-align: inherit;">적용하여 </font><font style="vertical-align: inherit;">DataFrame에서 행을 필터링하는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наиболее распространенный сценарий - применение </font><font style="vertical-align: inherit;">условия </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к определенному столбцу для фильтрации строк в DataFrame.</font></font>

source: To apply the <code>isin</code> condition to both columns "A" and "B", use <code>DataFrame.isin</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para aplicar la </font><font style="vertical-align: inherit;">condici&oacute;n </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a ambas columnas "A" y "B", use </font></font> <code>DataFrame.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">条件を列 "A"と "B"の両方に</font><font style="vertical-align: inherit;">適用するには</font><font style="vertical-align: inherit;">、</font></font> <code>DataFrame.isin</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">열 "A"와 "B"모두에 </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조건 </font><font style="vertical-align: inherit;">을 적용하려면 </font></font> <code>DataFrame.isin</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы применить </font><font style="vertical-align: inherit;">условие </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к обоим столбцам &laquo;A&raquo; и &laquo;B&raquo;, используйте </font></font> <code>DataFrame.isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Why is it worth considering? NumPy functions are usually a bit faster than their pandas equivalents because of lower overhead. Since this is an elementwise operation that does not depend on index alignment, there are very few situations where this method is not an appropriate replacement for pandas' <code>isin</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Por qu&eacute; vale la pena considerarlo? </font><font style="vertical-align: inherit;">Las funciones NumPy suelen ser un poco m&aacute;s r&aacute;pidas que sus equivalentes pandas debido a una menor sobrecarga. </font><font style="vertical-align: inherit;">Dado que esta es una operaci&oacute;n elementwise que no depende de la alineaci&oacute;n &iacute;ndice, hay muy pocas situaciones en las que este m&eacute;todo no es un sustituto adecuado para pandas </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なぜそれを検討する価値があるのですか？</font><font style="vertical-align: inherit;">オーバーヘッドが少ないため、NumPy関数は通常、対応するパンダよりも少し高速です。</font><font style="vertical-align: inherit;">これは、インデックスの配置に依存しない要素ごとの操作であるため、このメソッドがpandasの</font></font> <code>isin</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">適切な置き換えにならない状況はほとんどありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고려할 가치가있는 이유는 무엇입니까? </font><font style="vertical-align: inherit;">NumPy 함수는 일반적으로 오버 헤드가 낮아 팬더에 비해 약간 빠릅니다. </font><font style="vertical-align: inherit;">이는 인덱스 정렬에 의존하지 않는 요소 별 연산이므로이 방법이 pandas ' </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 적절한 대체 방법이 아닌 상황은 거의 없습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Почему стоит задуматься? </font><font style="vertical-align: inherit;">Функции NumPy обычно немного быстрее, чем их эквиваленты в pandas, из-за меньших накладных расходов. </font><font style="vertical-align: inherit;">Так как это поэлементная операция, которая не зависит от выравнивания индекса, очень мало ситуаций, когда этот метод не является подходящей заменой для </font></font> <code>isin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> панд </font><font style="vertical-align: inherit;">.</font></font>

source: You can use <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html"><code>pd.Series.isin</code></a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html"> <code>pd.Series.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html"> <code>pd.Series.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html"> <code>pd.Series.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html"> <code>pd.Series.isin</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
