Repository: rueisnom/feedback
Catalog: xlf/90/81/9081.*.001.xlf
Languages: es, ja, ru, zh_cn

source: <a href="http://beyondgrep.com/">ack</a> works with similar arguments as grep, and accepts <code>-C</code>. But it's usually better for searching through code.
es: <a href="http://beyondgrep.com/">ack</a> funciona con argumentos similares a grep y acepta <code>-C</code> . Pero generalmente es mejor buscar a trav&eacute;s del c&oacute;digo.
ja: <a href="http://beyondgrep.com/">ack</a>はgrepと同様の引数で動作し、 <code>-C</code> を受け入れます。 ただし、通常はコード全体を検索する方が適しています。
ru: <a href="http://beyondgrep.com/">ack</a> работает с аргументами, аналогичными grep, и принимает <code>-C</code> . Но обычно это лучше для поиска по коду.
zh_cn: <a href="http://beyondgrep.com/">ack</a>使用与grep类似的参数，并接受 <code>-C</code> 。 但是通常通过代码搜索会更好。

source: <code>-5</code> gets you <code>5</code> lines above and below the match 'thestring' is equivalent to <code>-C 5</code> or <code>-A 5 -B 5</code>.
es: <code>-5</code> te da <code>5</code> l&iacute;neas arriba y abajo del partido 'thestring' es equivalente a <code>-C 5</code> o <code>-A 5 -B 5</code> .
ja: <code>-5</code> を指定すると、一致の上下 <code>5</code> 行になります。'thestring 'は <code>-C 5</code> または <code>-A 5 -B 5</code> と同等です。
ru: <code>-5</code> возвращает вас на <code>5</code> строк выше и ниже совпадения &laquo;thestring&raquo; эквивалентно <code>-C 5</code> или <code>-A 5 -B 5</code> .
zh_cn: <code>-5</code> 使您在匹配'thestring'上方和下方的 <code>5</code> 行等效于 <code>-C 5</code> 或 <code>-A 5 -B 5</code> 。

source: <code>-A</code> and <code>-B</code> will work, as will <code>-C n</code> (for <code>n</code> lines of context), or just <code>-n</code> (for <code>n</code> lines of context... as long as n is 1 to 9).
es: <code>-A</code> y <code>-B</code> funcionar&aacute;n, al igual que <code>-C n</code> (para <code>n</code> l&iacute;neas de contexto), o simplemente <code>-n</code> (para <code>n</code> l&iacute;neas de contexto ... siempre que n sea de 1 a 9).
ja: <code>-A</code> および <code>-B</code> は、 <code>-C n</code> （ <code>n</code> 行のコンテキストの場合）または <code>-n</code> （ <code>n</code> 行のコンテキストの場合... nが1〜9である限り）と同様に機能します。
ru: <code>-A</code> и <code>-B</code> будут работать так же, как <code>-C n</code> (для <code>n</code> строк контекста) или просто <code>-n</code> (для <code>n</code> строк контекста ... до тех пор, пока n равно от 1 до 9).
zh_cn: <code>-A</code> 和 <code>-B</code> 将起作用， <code>-C n</code> （对于 <code>n</code> 行上下文）或 <code>-n</code> （对于 <code>n</code> 行上下文...只要n为1到9）都将起作用。

source: <code>-C</code>, <code>--context NUM</code> - Show NUM lines before and after each match.
es: <code>-C</code> , <code>--context NUM</code> - Muestra NUM l&iacute;neas antes y despu&eacute;s de cada partido.
ja: <code>-C</code> 、-- <code>--context NUM</code> 各一致の前後にNUM行を表示します。
ru: <code>-C</code> , <code>--context NUM</code> - Показывать NUM строк до и после каждого совпадения.
zh_cn: <code>-C</code> ，-- <code>--context NUM</code> 在每次匹配之前和之后显示NUM行。

source: <sup>Note: Replace <code>a</code> and <code>b</code> variables with number of lines before and after.</sup>
es: <sup>Nota: Reemplace las variables <code>b</code> con el n&uacute;mero de l&iacute;neas antes y despu&eacute;s.</sup>
ja: <sup>注： <code>a</code> および <code>b</code> 変数を前後の行数に置き換えます。</sup>
ru: <sup>Примечание: замените переменные <code>a</code> и <code>b</code> числом строк до и после.</sup>
zh_cn: <sup>注意：用前后的行数替换 <code>a</code> 和 <code>b</code> 变量。</sup>

source: For <strong>BSD</strong> or <strong>GNU</strong><code>grep</code> you can use <code>-B num</code> to set how many lines before the match and <code>-A num</code> for the number of lines after the match.
es: Para <strong>BSD</strong> o <strong>GNU</strong> <code>grep</code> puede usar <code>-B num</code> para establecer cu&aacute;ntas l&iacute;neas antes del partido y <code>-A num</code> para el n&uacute;mero de l&iacute;neas despu&eacute;s del partido.
ja: <strong>BSD</strong>または<strong>GNU</strong> <code>grep</code> の場合、 <code>-B num</code> を使用して、一致前の行数を設定し、 <code>-A num</code> を使用して、一致後の行数を設定できます。
ru: Для <strong>BSD</strong> или <strong>GNU</strong> <code>grep</code> вы можете использовать <code>-B num</code> , чтобы указать, сколько строк перед совпадением, и <code>-A num</code> для количества строк после совпадения.
zh_cn: 对于<strong>BSD</strong>或<strong>GNU</strong> <code>grep</code> ,您可以使用 <code>-B num</code> 设置匹配之前的行数，而 <code>-A num</code> 设置匹配之后的行数。

source: Grep has an option called <code>Context Line Control</code>, you can use the <code>--context</code> in that, simply,
es: Grep tiene una opci&oacute;n llamada <code>Context Line Control</code> , puede usar el <code>--context</code> en eso, simplemente,
ja: Grepには <code>Context Line Control</code> と呼ばれるオプションがあり、その中で <code>--context</code> を使用できます。
ru: В Grep есть опция, называемая <code>Context Line Control</code> , вы можете использовать <code>--context</code> , просто
zh_cn: Grep有一个名为 <code>Context Line Control</code> 的选项，您可以在其中使用 <code>--context</code> ，

source: Here is the <a href="https://www.unix.com/302098992-post2.html?s=4309a3b1b120fabe0d81368129bc8921">@Ygor solution</a> in <code>awk</code>
es: Aqu&iacute; est&aacute; la <a href="https://www.unix.com/302098992-post2.html?s=4309a3b1b120fabe0d81368129bc8921">soluci&oacute;n @Ygor</a> en <code>awk</code>
ja: これが <code>awk</code> の<a href="https://www.unix.com/302098992-post2.html?s=4309a3b1b120fabe0d81368129bc8921">@Ygorソリューション</a>です
ru: Вот <a href="https://www.unix.com/302098992-post2.html?s=4309a3b1b120fabe0d81368129bc8921">решение @Ygor</a> в <code>awk</code>
zh_cn: 这是 <code>awk</code> 中的<a href="https://www.unix.com/302098992-post2.html?s=4309a3b1b120fabe0d81368129bc8921">@Ygor解决方案</a>

source: I normally use
es: Normalmente uso
ja: 普通に使っています
ru: Я обычно использую
zh_cn: 我一般用的是

source: I use to do the compact way
es: Yo solía hacer la forma compacta
ja: 私はコンパクトな方法を使用しています。
ru: Я использую компактный способ
zh_cn: 我用的是紧凑的方式

source: I would like to <code>grep</code> for a string, but also show the preceding five lines and the following five lines as well as the matched line. How would I be able to do this?
es: Me gustar&iacute;a buscar una cadena, pero tambi&eacute;n mostrar las cinco l&iacute;neas anteriores y las siguientes cinco l&iacute;neas, as&iacute; como la l&iacute;nea coincidente. &iquest;C&oacute;mo podr&iacute;a hacer esto?
ja: 文字列を <code>grep</code> したいのですが、前の5行と次の5行、および一致した行も表示します。 どうすればこれを実行できますか？
ru: Я хотел бы использовать <code>grep</code> для строки, но также показать предыдущие пять строк и следующие пять строк, а также сопоставленную строку. Как я смогу сделать это?
zh_cn: 我想 <code>grep</code> 一个字符串，但还要显示前五行和后五行以及匹配的行。 我将如何做到这一点？

source: If you care about the performance, use <a href="https://github.com/BurntSushi/ripgrep"><code>ripgrep</code></a> which has similar syntax to <code>grep</code>, e.g.
es: Si le importa el rendimiento, use <a href="https://github.com/BurntSushi/ripgrep"> <code>ripgrep</code> ,</a> que tiene una sintaxis similar a <code>grep</code> , p. Ej.
ja: パフォーマンスを気にする場合は、 <code>grep</code> と同様の構文を持つ<a href="https://github.com/BurntSushi/ripgrep"> <code>ripgrep</code> </a>を使用してください 。
ru: Если вы заботитесь о производительности, используйте <a href="https://github.com/BurntSushi/ripgrep"> <code>ripgrep</code> </a> , синтаксис которого похож на <code>grep</code> , например
zh_cn: 如果您关心性能，请使用<a href="https://github.com/BurntSushi/ripgrep"> <code>ripgrep</code> </a> ，其语法与 <code>grep</code> 相似，例如

source: If you want the same number of lines before and after you can use <code>-C num</code>.
es: Si desea el mismo n&uacute;mero de l&iacute;neas antes y despu&eacute;s, puede usar <code>-C num</code> .
ja: 前後に同じ数の行が必要な場合は、 <code>-C num</code> を使用できます。
ru: Если вам нужно одинаковое количество строк до и после, вы можете использовать <code>-C num</code> .
zh_cn: 如果您希望前后使用相同数量的行，则可以使用 <code>-C num</code> 。

source: It's especially useful for system which doesn't support grep's <code>-A</code>, <code>-B</code> and <code>-C</code> parameters.
es: Es especialmente &uacute;til para el sistema que no admite los par&aacute;metros grep <code>-A</code> , <code>-B</code> y <code>-C</code> .
ja: これは、grepの <code>-A</code> 、 <code>-B</code> 、および <code>-C</code> パラメーターをサポートしていないシステムで特に役立ちます。
ru: Это особенно полезно для системы, которая не поддерживает параметры <code>-A</code> , <code>-B</code> и <code>-C</code> grep.
zh_cn: 这对于不支持grep的 <code>-A</code> ， <code>-B</code> 和 <code>-C</code> 参数的系统特别有用。

source: Many GNU tools also have an <a href="http://www.gnu.org/software/grep/doc/grep_toc.html#SEC_Contents">info page</a> that may have more useful information in addition to the man page.
es: Muchas herramientas de GNU tambi&eacute;n tienen una <a href="http://www.gnu.org/software/grep/doc/grep_toc.html#SEC_Contents">p&aacute;gina de informaci&oacute;n</a> que puede tener informaci&oacute;n m&aacute;s &uacute;til adem&aacute;s de la p&aacute;gina de manual.
ja: 多くのGNUツールには、manページに加えて、より有用な情報を含むかもしれない<a href="http://www.gnu.org/software/grep/doc/grep_toc.html#SEC_Contents">infoページ</a>もあります。
ru: Многие инструменты GNU также имеют <a href="http://www.gnu.org/software/grep/doc/grep_toc.html#SEC_Contents">информационную страницу,</a> которая может содержать более полезную информацию в дополнение к странице руководства.
zh_cn: 许多GNU工具还具有一个<a href="http://www.gnu.org/software/grep/doc/grep_toc.html#SEC_Contents">信息页面</a> ，该信息页面除手册页面外可能还有更多有用的信息。

source: Many of the tools like grep also have really great man files too. I find myself referring to <a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?grep">grep's man page</a> a lot because there is so much you can do with it.
es: Muchas de las herramientas como grep tambi&eacute;n tienen archivos man realmente geniales. Me encuentro refiri&eacute;ndome mucho a <a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?grep">la p&aacute;gina de manual de grep</a> porque hay mucho que puedes hacer con ella.
ja: grepのようなツールの多くにも、非常に優れたmanファイルがあります。 自分でできることはたくさんあるので、 <a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?grep">grepのmanページ</a>をよく参照しています。
ru: Многие инструменты, такие как grep, также имеют действительно отличные файлы man. Я часто обращаюсь к <a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?grep">справочной странице grep,</a> потому что с ней можно многое сделать.
zh_cn: 许多工具（例如grep）也具有非常好的man文件。 我发现自己经常参考<a href="http://unixhelp.ed.ac.uk/CGI/man-cgi?grep">grep的手册页，</a>因为您可以做很多事情。

source: Search for "17655" in "/some/file.txt" showing 10 lines context before and after (using Awk), output preceded with line number followed by a colon. Use this on Solaris when 'grep' does not support the "-[ACB]" options.
es: Busque "17655" en "somefile.txt" mostrando 10 líneas de contexto antes y después (usando Awk),salida precedida por el número de línea seguido de dos puntos.Use esto en Solaris cuando 'grep' no soporte las opciones "-[ACB]".
ja: somefile.txt "で "17655 "を検索すると、(Awkを使用して)前後に10行のコンテキストが表示され、出力の前に行番号とコロンが表示されます。Solarisで'grep'が"-[ACB]"オプションをサポートしていない場合に使用します。
ru: Ищите "17655" в "somefile.txt",показывая 10 строк контекста до и после (используя Awk),выводите перед номером строки,за которым следует двоеточие.Используйте это на Solaris,когда 'grep' не поддерживает опции "-[ACB]".
zh_cn: 在 "somefile.txt "中搜索 "17655",显示前后10行上下文(使用Awk),输出前有行号,后有冒号。当'grep'不支持"-[ACB]"选项时,在Solaris上使用。

source: Should do the trick
es: Debería hacer el truco
ja: 芸がないといけない
ru: Нужно придумать что-нибудь
zh_cn: 应该做的事

source: That is the equivalent of
es: Eso es el equivalente de
ja: に相当します。
ru: Это эквивалент
zh_cn: 这就相当于

source: That will grep "myfile" for "astring", and show 5 lines before and after each match
es: Eso hará que "myfile" sea "astring",y mostrará 5 líneas antes y después de cada partido.
ja: これは "myfile" に "astring" を grep し、各マッチの前後に 5 行を表示します。
ru: Это будет grep "myfile" для "astring",и покажет 5 строк до и после каждой спички
zh_cn: 这将为 "astring "提供grep "myfile",并在每次匹配前后显示5行

source: The tool is built on top of <a href="https://github.com/rust-lang-nursery/regex">Rust's regex engine</a> which makes it very <a href="http://blog.burntsushi.net/ripgrep/">efficient</a> on the large data.
es: La herramienta est&aacute; construida sobre <a href="https://github.com/rust-lang-nursery/regex">el motor regex</a> de Rust, lo que lo hace muy <a href="http://blog.burntsushi.net/ripgrep/">eficiente</a> en los datos grandes.
ja: このツールは、 <a href="https://github.com/rust-lang-nursery/regex">Rustの正規表現エンジンの</a>上に構築されているため、大きなデータに対して非常に<a href="http://blog.burntsushi.net/ripgrep/">効率的</a>です。
ru: Инструмент построен на <a href="https://github.com/rust-lang-nursery/regex">основе движка регулярных выражений Rust,</a> что делает его очень <a href="http://blog.burntsushi.net/ripgrep/">эффективным</a> для больших данных.
zh_cn: 该工具建立在<a href="https://github.com/rust-lang-nursery/regex">Rust的正则表达式引擎</a>之上，这使其在大数据上非常<a href="http://blog.burntsushi.net/ripgrep/">高效</a> 。

source: There are also parameters such as <code>-A</code>/<code>--after-context</code> and <code>-B</code>/<code>--before-context</code>.
es: Tambi&eacute;n hay par&aacute;metros como <code>-A</code> / <code>--after-context</code> y <code>-B</code> / <code>--before-context</code> .
ja: <code>-A</code> / <code>--before-context</code> や <code>-B</code> / --before-contextなどのパラメーターもあります 。
ru: Есть также такие параметры, как <code>-A</code> / <code>--after-context</code> и <code>-B</code> / <code>--before-context</code> .
zh_cn: 还有一些参数，例如 <code>-A</code> / <code>--after-context</code> 和 <code>-B</code> / <code>--before-context</code> 。

source: This will show 3 lines before and 3 lines after.
es: Esto mostrará 3 líneas antes y 3 líneas después.
ja: これで前に3行、後に3行表示されます。
ru: Будет показано 3 строки до и 3 строки после.
zh_cn: 这样就会显示前3行,后3行。

source: Use grep
es: Usa el grep
ja: grepを使用する
ru: Использовать смазку
zh_cn: 使用grep

source: grep a file, but show several surrounding lines
es: ...pero muestran varias líneas circundantes...
ja: ファイルをgrepするが、周囲の複数の行を表示する
ru: смажьте файл,но покажите несколько окружающих строк.
zh_cn: grep一个文件,但显示周边几行
