Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong><em>Even more fantastically,</em></strong> It makes an operation to search array values much, much easier.
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A&uacute;n m&aacute;s fant&aacute;stico,</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace que una operaci&oacute;n para buscar valores de matriz sea mucho, mucho m&aacute;s f&aacute;cil.</font></font>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さらに素晴らしく、</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列の値を検索する操作がはるかに簡単になります。</font></font>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더욱 환상적으로</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열 값을 훨씬 더 쉽게 검색 할 수 있습니다.</font></font>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Еще более фантастически,</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> это делает операцию поиска значений массива намного, намного проще.</font></font>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更妙的是，</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它使搜索数组值的操作变得非常容易。</font></font>

source: <strong><em>The following Table expresses the values required to parse the line in terms of number of Calls and % expansions to be appended to the string.</em></strong>
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La siguiente tabla expresa los valores necesarios para analizar la l&iacute;nea en t&eacute;rminos de n&uacute;mero de llamadas y% de expansiones que se agregar&aacute;n a la cadena.</font></font></em></strong>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次の表は、行を解析するために必要な値を、文字列に追加される呼び出しの数と拡張％で表しています。</font></font></em></strong>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 표는 문자열에 추가 할 호출 수 및 % 확장 측면에서 행을 구문 분석하는 데 필요한 값을 나타냅니다.</font></font></em></strong>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В следующей таблице приведены значения, необходимые для анализа строки, с точки зрения количества вызовов и% расширений, добавляемых в строку.</font></font></em></strong>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下表根据要添加到字符串的Calls数量和％扩展表示表达解析该行所需的值。</font></font></em></strong>

source: <strong>A typical batch Pseudo Array, and how to parse:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un pseudoarray de lotes t&iacute;pico y c&oacute;mo analizar:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">典型的なバッチ疑似配列と解析方法：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 배치 의사 배열 및 구문 분석 방법 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типичная партия Pseudo Array и как ее анализировать:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">典型的批处理伪数组，以及如何解析：</font></font></strong>

source: <strong>Although, to be sure today I usually make the base of the structures the name of the script, as I find this is more useful, and may or may not use ordered arrays depending on need.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aunque, para estar seguro hoy, generalmente hago que la base de las estructuras sea el nombre del script, ya que encuentro que esto es m&aacute;s &uacute;til, y puede o no usar matrices ordenadas dependiendo de la necesidad.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、今日は念のため、構造のベースをスクリプトの名前にしていますが、これはより便利であり、必要に応じて順序付き配列を使用する場合と使用しない場合があります。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오늘 확실히하기 위해, 나는 구조의 기본을 스크립트의 이름으로 사용하지만, 이것이 더 유용하다는 것을 알기 때문에 필요에 따라 정렬 된 배열을 사용하거나 사용하지 않을 수 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя, чтобы быть уверенным сегодня, я обычно делаю основу структур именем скрипта, так как считаю, что это более полезно, и может или не может использовать упорядоченные массивы в зависимости от необходимости.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尽管可以肯定的是，今天我通常以结构的名称作为脚本的名称，因为我发现它更有用，并且可以根据需要使用或不使用有序数组。</font></font></strong>

source: <strong>Below we make some Dumb Pseudo Arrays and a manual ordered Pseudo Array, plus create an Ordered Pseudo Array catching the output of a DIR Command.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A continuaci&oacute;n, hacemos algunas Pseudo matrices tontas y un Pseudo Array ordenado manualmente, adem&aacute;s de crear una Pseudo Array ordenada que captura la salida de un comando DIR.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下では、いくつかのダム疑似配列と手動で順序付けされた疑似配列を作成し、さらに、DIRコマンドの出力をキャッチする順序付けされた疑似配列を作成します。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래에서는 Dumb Pseudo Array와 수동 정렬 Pseudo Array를 만들고 DIR Command의 출력을 포착하는 Ordered Pseudo Array를 생성합니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ниже мы сделаем несколько Dumb Pseudo Arrays и упорядоченный вручную Pseudo Array, а также создадим Ordered Pseudo Array, перехватывающий вывод команды DIR.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在下面，我们制作了一些哑哑伪数组和手动有序伪数组，并创建了一个有序伪数组来捕获DIR命令的输出。</font></font></strong>

source: <strong>But what about where you might have to collect large sets of dynamically generated data, and group it into pre-made categories and then mix that up to report it.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero, &iquest;qu&eacute; hay de d&oacute;nde podr&iacute;a tener que recopilar grandes conjuntos de datos generados din&aacute;micamente, y agruparlos en categor&iacute;as prefabricadas y luego mezclar eso para informarlo?</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、動的に生成されたデータの大規模なセットを収集し、それを事前に作成されたカテゴリにグループ化し、それを混合してレポートする必要がある場合についてはどうでしょうか。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 동적으로 생성 된 대량의 데이터 집합을 수집하고 미리 만든 범주로 그룹화 한 다음이를 혼합하여보고해야하는 경우는 어떻습니까?</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но как насчет того, где вам, возможно, придется собирать большие наборы динамически сгенерированных данных, группировать их в заранее подготовленные категории и затем смешивать их, чтобы сообщить об этом.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，您可能需要在何处收集大量动态生成的数据，并将其分组为预制类别，然后将其混合起来以进行报告。</font></font></strong>

source: <strong>Initially you might create simple arrays of substrings I'll define like this:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Inicialmente, puede crear matrices simples de subcadenas que definir&eacute; as&iacute;:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初に、次のように定義する部分文字列の単純な配列を作成する場合があります。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">처음에는 다음과 같이 정의 할 간단한 하위 문자열 배열을 만들 수 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Изначально вы можете создать простые массивы подстрок, которые я определю так:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初，您可能会创建一些简单的子字符串数组，如下所示：</font></font></strong>

source: <strong>Just, what a pain, and this isn't even when you need to have a dynamic set of objects, this is all manual.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simplemente, qu&eacute; dolor, y esto ni siquiera es cuando necesitas tener un conjunto din&aacute;mico de objetos, todo esto es manual.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただ、なんて面倒なことでしょう。動的なオブジェクトセットが必要な場合でも、これはすべて手動です。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다이나믹 한 객체 세트가 필요할 때조차도 고통스럽지 않습니다. 이것은 모두 수동입니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто, какая боль, и это даже не когда вам нужен динамический набор объектов, это все вручную.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只是，这很痛苦，而且甚至在您需要动态对象集时也是如此，这全是手动的。</font></font></strong>

source: <strong>Now, 13 sites, this isn't all that bad, I'm sure you're saying. right? You can just add one at the end and then put in the info and done.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora, 13 sitios, esto no es tan malo, estoy seguro de que lo est&aacute;s diciendo. </font><font style="vertical-align: inherit;">&iquest;derecho? </font><font style="vertical-align: inherit;">Simplemente puede agregar uno al final y luego poner la informaci&oacute;n y listo.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">さて、13のサイト、これはそれほど悪いことではありません、私はあなたが言っていると確信しています。</font><font style="vertical-align: inherit;">正しい？</font><font style="vertical-align: inherit;">最後に1つ追加するだけで、情報を入力して完了できます。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 13 개 사이트가 나쁘지는 않습니다. 당신이 말하는 것입니다. </font><font style="vertical-align: inherit;">권리? </font><font style="vertical-align: inherit;">끝에 하나를 추가 한 다음 정보를 입력하고 완료 할 수 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь, 13 сайтов, это не так уж и плохо, я уверен, что вы говорите. </font><font style="vertical-align: inherit;">верно? </font><font style="vertical-align: inherit;">Вы можете просто добавить один в конце, а затем ввести информацию и готово.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，在13个站点中，这还不是很糟糕，我相信您是在说。</font><font style="vertical-align: inherit;">对？</font><font style="vertical-align: inherit;">您可以只在最后添加一个，然后放入信息并完成。</font></font></strong>

source: <strong>Or as shown in in this example code.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O como se muestra en este c&oacute;digo de ejemplo.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、このコード例に示すように。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는이 예제 코드에 표시된대로.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Или, как показано в этом примере кода.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或如本示例代码所示。</font></font></strong>

source: <strong>Population of an array construct using a Macro</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Poblaci&oacute;n de una construcci&oacute;n de matriz utilizando una macro</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マクロを使用した配列構成の入力</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매크로를 사용한 배열 구성의 인구</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Заполнение массива с помощью макроса</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用宏填充数组构造</font></font></strong>

source: <strong>Since the example I started with ended up being the first place I tried these you can see this intermediate amalgam step I'll define like this:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como el ejemplo con el que comenc&eacute; termin&oacute; siendo el primer lugar donde prob&eacute; estos, puede ver este paso intermedio de amalgama que definir&eacute; as&iacute;:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が始めた例が最初にこれらを試したところだったので、次のように定義するこの中間アマルガムのステップを見ることができます：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 시작한 예제가 처음부터 시작된 이후로 내가 시도한이 중간 아말감 단계를 볼 수 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так как пример, с которого я начинал, оказался первым местом, где я попробовал это, вы можете увидеть этот промежуточный шаг амальгамы, который я определю так:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于我开始的示例最终是我尝试的第一个地方，因此您可以看到我定义的中间汞齐步骤，如下所示：</font></font></strong>

source: <strong>So what can you do? Well, here's what I did:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Entonces que puedes hacer? </font><font style="vertical-align: inherit;">Bueno, esto es lo que hice:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それで、あなたは何ができますか？</font><font style="vertical-align: inherit;">さて、これが私がしたことです：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 당신은 무엇을 할 수 있습니까? </font><font style="vertical-align: inherit;">글쎄, 여기 내가 한 일이 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так что ты можешь сделать? </font><font style="vertical-align: inherit;">Ну, вот что я сделал:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所以，你可以做什么？</font><font style="vertical-align: inherit;">好吧，这是我所做的：</font></font></strong>

source: <strong>The following rules apply to expansion depth using Call:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las siguientes reglas se aplican a la profundidad de expansi&oacute;n usando Llamada:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のルールは、呼び出しを使用した拡張深度に適用されます。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 규칙은 통화를 사용하여 확장 깊이에 적용됩니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Следующие правила применяются к глубине расширения с помощью Call:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下规则适用于使用Call的扩展深度：</font></font></strong>

source: <strong>The value of E increases in proportion to C like so:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El valor de E aumenta en proporci&oacute;n a C as&iacute;:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eの値は、Cに比例して次のように増加します。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">E의 값은 다음과 같이 C에 비례하여 증가합니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Значение E увеличивается пропорционально C примерно так:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">E的值与C成正比，如下所示：</font></font></strong>

source: <strong>Then it just keeps getting worse:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Luego, sigue empeorando:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その後、悪化し続けます：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 계속 악화됩니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тогда это только ухудшается:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后它只会变得越来越糟：</font></font></strong>

source: A simple approach to populating multiple Arrays using a function.
es: Un enfoque simple para poblar múltiples Arrays usando una función.
ja: 関数を使用して複数の配列を埋め込んでいくシンプルなアプローチです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수를 사용하여 여러 배열을 채우는 간단한 방법.</font></font>
ru: Простой подход к заполнению нескольких массивов с помощью функции.
zh_cn: 用一个函数填充多个数组的简单方法。

source: All together:
es: Todos juntos:
ja: 全部一緒に。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모두 함께:</font></font>
ru: Все вместе:
zh_cn: 都在一起。

source: An unusual, impractical, however still somewhat interesting way to create linked data within a batch file is to assign variables within variables within variables, with the aid (Or abuse) of <code>Call</code> to extract the desired values.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una forma inusual, poco pr&aacute;ctica, pero todav&iacute;a algo interesante de crear datos vinculados dentro de un archivo por lotes es asignar variables dentro de variables dentro de variables, con la ayuda (o abuso) de </font></font> <code>Call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para extraer los valores deseados.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バッチファイル内でリンクされたデータを作成する珍しい、実用的ではありませんが、それでもやや興味深い方法は、</font></font> <code>Call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して</font><font style="vertical-align: inherit;">変数内の変数内に変数を割り当て</font><font style="vertical-align: inherit;">、目的の値を抽出することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배치 파일 내에서 링크 된 데이터를 생성하는 비정상적이고 비현실적이지만 다소 흥미로운 방법 </font><font style="vertical-align: inherit;">은 원하는 값을 추출하기 위해 </font></font> <code>Call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 도움 (또는 남용)을 사용하여 변수 내의 변수 내에 변수를 할당 </font><font style="vertical-align: inherit;">하는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Необычным, непрактичным, но все же несколько интересным способом создания связанных данных в пакетном файле является назначение переменных внутри переменных в переменных с помощью (или неправильного) </font></font> <code>Call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для извлечения желаемых значений.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在批处理文件中创建链接数据的一种不常见，不切实际但仍然有些有趣的方法是在</font></font> <code>Call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的帮助（或滥用）下分配变量内的变量，</font><font style="vertical-align: inherit;">以提取所需的值。</font></font>

source: And rapidly retrieve them by Doing:
es: Y rápidamente los recupera haciendo:
ja: そして、Doingで迅速にそれらを取得します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 다음을 수행하여 신속하게 검색하십시오.</font></font>
ru: И быстро вернуть их,сделав это:
zh_cn: 并迅速检索到他们通过Doing。

source: And the Input Args to be processed by the macro is appended in doubleqouted form:
es: Y los Aros de Entrada que serán procesados por la macro se adjuntan en forma de doble cuadrado:
ja: また、マクロで処理する入力引数はダブルクォート形式で追加されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 매크로에 의해 처리 될 Input Args는 doubleqouted 형식으로 추가됩니다 :</font></font>
ru: А Входные Арги,которые будут обрабатываться макросом,добавляются в виде двойного квадрата:
zh_cn: 而要被宏处理的Input Args是以双括号的形式添加。

source: And yet another means to populate linked data structures.
es: Y otro medio más para poblar las estructuras de datos vinculadas.
ja: また、リンクされたデータ構造を入力するための別の手段もあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 또 다른 수단은 연결된 데이터 구조를 채우는 것입니다.</font></font>
ru: И еще одно средство для заполнения связанных структур данных.
zh_cn: 而另一种手段是填充链接数据结构。

source: Another way to achieve the previous process is to use an additional FOR command to change the delayed expansion of the index by an equivalent replaceable parameter, and then use the delayed expansion for the array element. This method runs faster than previous CALL:
es: Otra forma de lograr el proceso anterior es utilizar un comando FOR adicional para cambiar la expansión retardada del índice por un parámetro sustituible equivalente,y luego utilizar la expansión retardada para el elemento de la matriz.Este método funciona más rápido que el anterior CALL:
ja: 前の処理を実現する別の方法は、追加のforコマンドを使用してインデックスの遅延展開を等価な置換可能なパラメータで変更し、その遅延展開を配列要素に使用することです。この方法は、前のcallよりも高速に実行されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 프로세스를 수행하는 또 다른 방법은 추가 FOR 명령을 사용하여 동등한 교체 가능한 매개 변수로 인덱스의 지연 확장을 변경 한 다음 배열 요소에 지연 확장을 사용하는 것입니다. </font><font style="vertical-align: inherit;">이 방법은 이전 CALL보다 빠르게 실행됩니다.</font></font>
ru: Другим способом достижения предыдущего процесса является использование дополнительной команды FOR для изменения отложенного расширения индекса на эквивалентный заменяемый параметр,а затем использование отложенного расширения для элемента массива.Этот метод работает быстрее,чем предыдущий CALL:
zh_cn: 另一种实现前一个过程的方法是使用额外的for命令,用一个等效的可替换参数来改变索引的延迟扩展,然后用延迟扩展的索引来改变数组元素。这种方法比前面的call运行速度快。

source: Arrays, linked lists and other data structures in cmd.exe (batch) script
es: Matrices,listas vinculadas y otras estructuras de datos en escritura cmd.exe (por lotes)
ja: cmd.exe(バッチ)スクリプトでの配列、リンクされたリスト、およびその他のデータ構造
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cmd.exe (배치) 스크립트의 배열, 링크 된 목록 및 기타 데이터 구조</font></font>
ru: Массивы,связанные списки и другие структуры данных в командном сценарии cmd.exe (пакетном)
zh_cn: cmd.exe(批处理)脚本中的数组、链接列表和其他数据结构
