Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: We then update all of the ordered Arrays to contain more elements manually.
es: Luego actualizamos todos los arreglos ordenados para contener más elementos manualmente.
ja: 次に、順序付けされたすべての配列を更新して、より多くの要素を手動で含むようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 정렬 된 모든 배열을 업데이트하여 더 많은 요소를 수동으로 포함합니다.</font></font>
ru: Затем мы обновляем все упорядоченные массивы,чтобы они содержали больше элементов вручную.
zh_cn: 然后我们手动更新所有的有序数组,以包含更多的元素。

source: Well here again these can be useful too, and you can build them on the fly in your code adding more properties as needed.
es: Bueno,aquí también pueden ser útiles,y puedes construirlos sobre la marcha en tu código añadiendo más propiedades según sea necesario.
ja: さて、ここで再びこれらはあまりにも有用であることができ、あなたは必要に応じてより多くのプロパティを追加し、あなたのコードのフライでそれらを構築することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서도 역시 유용 할 수 있으며 필요에 따라 더 많은 속성을 추가하여 코드에서 즉시 빌드 할 수 있습니다.</font></font>
ru: Ну и здесь они тоже могут быть полезны,и вы можете построить их на лету в вашем коде,добавляя дополнительные свойства по мере необходимости.
zh_cn: 那么在这里,这些也是很有用的,你可以在你的代码中根据需要添加更多的属性。

source: Which expands to:
es: Lo cual se expande a:
ja: どっちが拡大するんだ?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음으로 확장 :</font></font>
ru: Который расширяется до..:
zh_cn: 其中扩大到:

source: While i had to edit it a bit because this is also an earlier version of these as well, I thought it was one of the instances where it might best show the benefits. If I find a better example in one of my other scripts I might update it there as well.
es: Aunque tuve que editarlo un poco porque esta también es una versión anterior de estos,pensé que era una de las instancias donde mejor podría mostrar los beneficios.Si encuentro un ejemplo mejor en uno de mis otros scripts podría actualizarlo allí también.
ja: これはまた、これらの初期バージョンでもあるので、私はそれを少し編集しなければならなかったが、私はそれが最高の利点を示す可能性がありますインスタンスの一つだと思った。もし他のスクリプトでもっと良い例を見つけたら、そこでも更新するかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것도 이전 버전이기 때문에 조금 편집해야했지만 이점을 가장 잘 보여주는 인스턴스 중 하나라고 생각했습니다. </font><font style="vertical-align: inherit;">다른 스크립트 중 하나에서 더 좋은 예를 찾으면 거기에서도 업데이트 할 수 있습니다.</font></font>
ru: Хотя мне пришлось его немного отредактировать,потому что это тоже более ранняя версия,я подумал,что это один из тех случаев,когда он может лучше всего показать преимущества.Если я найду лучший пример в одном из моих других сценариев,я могу обновить его там также.
zh_cn: 虽然我不得不编辑了一下,因为这也是一个早期的版本,但我认为这是其中一个例子,它可能最能显示出它的好处。如果我在我的其他脚本中找到一个更好的例子,我可能会在那里更新。

source: Windows shell scripting really isn't designed to work with arrays, let alone complex data structures. For the most part, everything's a string in the windows shell, but, there are some things you can do to "work with" arrays, like declaring <code>n</code> variables <code>VAR_1, VAR_2, VAR_3...</code> using a loop and filtering on the prefix <code>VAR_</code>, or creating a delimited string and then using the <code>FOR</code> construct that iterates over a delimited string.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las secuencias de comandos de shell de Windows realmente no est&aacute;n dise&ntilde;adas para funcionar con matrices, y mucho menos con estructuras de datos complejas. </font><font style="vertical-align: inherit;">En su mayor parte, todo es una cadena en el shell de Windows, pero hay algunas cosas que puede hacer para "trabajar con" matrices, como declarar </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> variables </font></font> <code>VAR_1, VAR_2, VAR_3...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando un bucle y filtrando en el prefijo </font></font> <code>VAR_</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , o creando una cadena delimitada y luego usando la </font><font style="vertical-align: inherit;">construcci&oacute;n </font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que itera sobre una cadena delimitada.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windowsシェルスクリプトは、複雑なデータ構造はもちろんのこと、配列を処理するようには設計されていません。</font><font style="vertical-align: inherit;">ほとんどの場合、すべてがWindowsシェルの文字列ですが</font><font style="vertical-align: inherit;">、ループを使用してプレフィックス</font> <code>VAR_</code> で<font style="vertical-align: inherit;">フィルタリング</font><font style="vertical-align: inherit;">する</font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数</font></font> <code>VAR_1, VAR_2, VAR_3...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">宣言など、配列を「操作」するためにできることがいくつか</font><font style="vertical-align: inherit;">あります</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、または区切られた文字列を作成してから、区切ら</font><font style="vertical-align: inherit;">れた文字列を反復</font><font style="vertical-align: inherit;">する</font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構文を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows 셸 스크립팅은 복잡한 데이터 구조는 물론 배열과 함께 작동하도록 설계되지 않았습니다. </font><font style="vertical-align: inherit;">대부분의 경우, 모든 것은 윈도우 쉘의 문자열이지만, </font><font style="vertical-align: inherit;">루프를 사용하고 접두사 </font> <code>VAR_</code> 를<font style="vertical-align: inherit;"> 필터링하여 </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font></font> <code>VAR_1, VAR_2, VAR_3...</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">VAR_3을</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 선언하는 것과 같이 배열로 "작업"하기 위해 할 수있는 일이 있습니다 </font><font style="vertical-align: inherit;">또는 구분 된 문자열을 만든 다음 구분 된 문자열 </font><font style="vertical-align: inherit;">을 반복 </font><font style="vertical-align: inherit;">하는 </font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구문 </font><font style="vertical-align: inherit;">을 사용 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сценарии оболочки Windows действительно не предназначены для работы с массивами, не говоря уже о сложных структурах данных. </font><font style="vertical-align: inherit;">По большей части, все это строка в оболочке Windows, но есть некоторые вещи, которые вы можете сделать, чтобы &laquo;работать&raquo; с массивами, например, объявление </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> переменных </font></font> <code>VAR_1, VAR_2, VAR_3...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с использованием цикла и фильтрации по префиксу </font></font> <code>VAR_</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или создание строки с разделителями, а затем использование </font><font style="vertical-align: inherit;">конструкции </font></font> <code>FOR</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которая выполняет итерацию по строке с разделителями.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows Shell脚本实际上并不是设计用于数组，更不用说复杂的数据结构了。</font><font style="vertical-align: inherit;">在大多数情况下，所有内容都是Windows Shell中的字符串，但是，您可以做一些事情来&ldquo;处理&rdquo;数组，例如</font><font style="vertical-align: inherit;">使用循环</font><font style="vertical-align: inherit;">声明</font></font> <code>n</code> 个<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量</font></font> <code>VAR_1, VAR_2, VAR_3...</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并过滤前缀</font></font> <code>VAR_</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，或创建一个定界字符串，然后使用对</font><font style="vertical-align: inherit;">定界字符串进行迭代</font><font style="vertical-align: inherit;">的</font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">构造。</font></font>

source: You end up having 30, 40,50 of these and it's hard to remember which is which by looking at the end of a long string and copying them around, etc.
es: Terminas teniendo 30,40,50 de estos y es difícil recordar cuál es cuál mirando el final de una larga cuerda y copiándolos alrededor,etc.
ja: これが30個、40個、50個もあって、長い文字列の最後を見てどれがどれなのかを覚えるのは大変です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 이것들 중 30, 40,50을 가지고 결국 긴 줄의 끝을보고 그것들을 복사하는 것 등을 기억하기가 어렵습니다.</font></font>
ru: В итоге вы получаете 30,40,50 таких,и трудно вспомнить,какой из них,глядя на конец длинной струны,копируя их вокруг и т.д..
zh_cn: 你最终会有30,40,50个这样的东西,而你很难记住哪一个是哪一个,只需要看一下长长的字符串的末尾,然后把它们复制过来,等等。

source: You may also use parameters of FOR commands as indexes: <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code>. You must use !index! to store values in array elements when the index is changed inside a FOR or IF: <code>set elem[!index!]=New value</code>. To get the value of an element when the index changes inside FOR/IF, enclose the element in double percent symbols and precede the command with <code>call</code>. For example, to move a range of array elements four places to the left:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n puede usar par&aacute;metros de comandos FOR como &iacute;ndices: </font></font> <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">&iexcl;Debes usar! Index! </font><font style="vertical-align: inherit;">para almacenar valores en elementos de matriz cuando el &iacute;ndice se cambia dentro de un FOR o IF: </font></font> <code>set elem[!index!]=New value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Para obtener el valor de un elemento cuando el &iacute;ndice cambia dentro de FOR / IF, encierre el elemento en s&iacute;mbolos de doble porcentaje y preceda el comando con </font></font> <code>call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Por ejemplo, para mover un rango de elementos de matriz cuatro lugares a la izquierda:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FORコマンドのパラメーターをインデックスとして使用することもできます</font></font> <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">！index！を使用する必要があります。</font><font style="vertical-align: inherit;">FORまたはIF内でインデックスが変更されたときに配列要素に値を格納するには、次のように</font></font> <code>set elem[!index!]=New value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">FOR / IF内でインデックスが変更されたときに要素の値を取得するには、要素を二重パーセント記号で囲み、コマンドの前に</font></font> <code>call</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">付け</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">たとえば、配列要素の範囲を左に4桁移動するには、次のようにします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FOR 명령의 매개 변수를 색인으로 사용할 수도 있습니다. </font></font> <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">! index를 사용해야합니다! </font><font style="vertical-align: inherit;">FOR 또는 IF 내에서 인덱스가 변경 될 때 배열 요소에 값을 저장하려면 </font></font> <code>set elem[!index!]=New value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">FOR / IF 내에서 색인이 변경 될 때 요소의 값을 얻으려면 요소를 이중 백분율 기호로 묶고 명령 앞에 </font></font> <code>call</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">예를 들어, 배열 요소 범위를 왼쪽으로 네 자리 이동하려면</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете использовать параметры команд FOR в качестве индексов: </font></font> <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Вы должны использовать! Индекс! </font><font style="vertical-align: inherit;">сохранить значения в элементах массива, когда индекс изменяется внутри FOR или IF: </font></font> <code>set elem[!index!]=New value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Чтобы получить значение элемента при изменении индекса внутри FOR / IF, заключите элемент в символы с двойным процентом и перед командой </font></font> <code>call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Например, чтобы переместить диапазон элементов массива на четыре позиции влево:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您还可以将FOR命令的参数用作索引：</font></font> <code>for /L %%i in (1,1,3) do echo !elem[%%i]!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">您必须使用！index！</font><font style="vertical-align: inherit;">在FOR或IF内更改索引时将值存储在数组元素中：</font></font> <code>set elem[!index!]=New value</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">要在FOR / IF内的索引更改时获取元素的值，请用双百分号将元素括起来，并在命令前加上</font></font> <code>call</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例如，将一系列数组元素向左移动四个位置：</font></font>

source: You realise you need to have different retention times per site, and later, per directory.
es: Te das cuenta de que tienes que tener diferentes tiempos de retención por sitio,y más tarde,por directorio.
ja: サイトごと、後にはディレクトリごとに保持時間が異なる必要があることに気づくのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사이트마다, 그리고 나중에 디렉터리마다 다른 보존 시간이 필요하다는 것을 알고 있습니다.</font></font>
ru: Вы понимаете,что у вас должно быть разное время хранения для каждого сайта,и позже,для каждого каталога.
zh_cn: 你意识到,你需要对每个站点有不同的留存时间,以后,每个目录的留存时间也不同。

source: You stopped adding more paths, but sometime you have to remove old ones or it causes problems when they are gone, and if you forget to update the total number of site sin the list you might miss running the script on some.
es: Dejaste de añadir más rutas,pero a veces tienes que eliminar las viejas o causa problemas cuando ya no están,y si te olvidas de actualizar el número total de sitios sin la lista puedes perderte de ejecutar el guión en algunos.
ja: あなたはより多くのパスの追加を停止しましたが、いつかは古いものを削除しなければならないか、それがなくなったときに問題が発生し、あなたがリストのサイトの合計数を更新することを忘れた場合は、いくつかの上でスクリプトを実行していない可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은 경로 추가를 중지했지만 언젠가는 이전 경로를 제거해야합니다.</font></font>
ru: Вы перестали добавлять новые пути,но иногда вам приходится удалять старые,или это вызывает проблемы,когда они отсутствуют,и если вы забудете обновить общее количество сайтов,вы можете пропустить запуск скрипта на некоторых из них.
zh_cn: 你停止添加更多的路径,但有的时候,你必须删除旧的路径,否则会造成问题,如果你忘了更新站点总数sin列表,你可能会错过在一些上运行脚本。

source: around the equal-to sign:
es: alrededor del signo de igualdad:
ja: 等倍記号の周りに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">등호 주변 :</font></font>
ru: вокруг знака "равный-равному":
zh_cn: 在等号的周围。

source: bubble sort
es: tipo de burbuja
ja: 泡沫状
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버블 정렬</font></font>
ru: вид пузыря
zh_cn: 泡沫类

source: doesn't give the desired result because it means: show the value of the <code>elem[</code> variable, followed by <code>i</code>, followed by the value of the <code>]</code> variable.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no da el resultado deseado porque significa: muestra el valor de la </font><font style="vertical-align: inherit;">variable </font></font> <code>elem[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , seguido de </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , seguido del valor de la </font><font style="vertical-align: inherit;">variable </font></font> <code>]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、</font></font> <code>elem[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数の</font><font style="vertical-align: inherit;">値を表示し</font><font style="vertical-align: inherit;">、その後に</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、その後に</font></font> <code>]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数の</font><font style="vertical-align: inherit;">値を表示し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>elem[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수 </font><font style="vertical-align: inherit;">의 값을 표시 한 </font><font style="vertical-align: inherit;">다음 </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음에 </font></font> <code>]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변수를 </font><font style="vertical-align: inherit;">표시한다는 의미이므로 원하는 결과를 제공하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не дает желаемого результата, потому что это означает: показать значение </font><font style="vertical-align: inherit;">переменной </font></font> <code>elem[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , затем </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , а затем значение </font><font style="vertical-align: inherit;">переменной </font></font> <code>]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无法给出理想的结果，因为这意味着：显示</font></font> <code>elem[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量的值，后跟</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后显示</font></font> <code>]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量</font><font style="vertical-align: inherit;">的值</font><font style="vertical-align: inherit;">。</font></font>

source: gnome sort
es: tipo de gnomo
ja: ノームソート
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그놈 정렬</font></font>
ru: вид гномов
zh_cn: 侏儒类

source: quick sort
es: una clase rápida...
ja: クイックソート
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">빠른 정렬</font></font>
ru: быстрая сортировка
zh_cn: 快速分类

source: when a directory is added or removed you have to add it/remove it fro each site making it harder to use the ordering, and easier to miss sites as they aren;t easy to ID.
es: cuando se agrega o elimina un directorio,hay que agregarlo o quitarlo de cada sitio,lo que dificulta el uso del ordenamiento y facilita la pérdida de sitios,ya que no son fáciles de identificar.
ja: ディレクトリが追加されるか、または削除されたときに、それを追加する必要がありますitremoveそれをfroそれが順序を使用することが困難になる各サイト、およびそれらがIDに容易ではないのでサイトを見逃すことが容易に。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">디렉토리를 추가하거나 제거 할 때 각 사이트에서 디렉토리를 추가 / 제거해야 순서를 사용하기가 어려워지고 식별하기 쉽지 않은 사이트를 놓치기 쉽습니다.</font></font>
ru: Когда каталог добавляется или удаляется,вы должны добавить itremove его на каждом сайте,что делает его труднее использовать заказ,и легче пропустить сайты,как они не являются;не легко идентифицировать.
zh_cn: 当一个目录被添加或删除时,你必须从每个站点中添加或删除它,这样就很难使用排序,而且更容易错过站点,因为它们不容易识别。

source: will actually be set to the value
es: se fijará en realidad en el valor
ja: は実際には
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 값으로 설정됩니다</font></font>
ru: на самом деле будет установлено значение
zh_cn: 实际上将被设置为
