Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This means that from the cmd.exe point of view, <code>SET NORMAL_NAME=123</code> is exactly the same as <code>SET A#$'()*+,-.?@[\]_{}~=123</code> and also the same as <code>SET VECTOR[1]=123</code>; all three are normal variables. This way, <em>it is up to you</em> to write variable names in the form of array elements:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto significa que desde el punto de vista de cmd.exe, </font></font> <code>SET NORMAL_NAME=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es exactamente lo mismo que </font></font> <code>SET A#$'()*+,-.?@[\]_{}~=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y tambi&eacute;n lo mismo que </font></font> <code>SET VECTOR[1]=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Los tres son variables normales. </font><font style="vertical-align: inherit;">De esta manera, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">depende de usted</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> escribir nombres de variables en forma de elementos de matriz:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、cmd.exeの観点から見ると、</font></font> <code>SET NORMAL_NAME=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>SET A#$'()*+,-.?@[\]_{}~=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">まったく</font><font style="vertical-align: inherit;">同じであり、</font></font> <code>SET VECTOR[1]=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とも同じです。</font><font style="vertical-align: inherit;">[1] = 123</font><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">3つすべてが通常の変数です。</font><font style="vertical-align: inherit;">このように、</font><font style="vertical-align: inherit;">配列名の形式で変数名を書くのは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなた次第です</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이는 cmd.exe의 관점에서 </font></font> <code>SET NORMAL_NAME=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>SET A#$'()*+,-.?@[\]_{}~=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font><font style="vertical-align: inherit;">정확히 </font><font style="vertical-align: inherit;">동일하며 </font></font> <code>SET VECTOR[1]=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 동일 함을 의미합니다. </font><font style="vertical-align: inherit;">[1] = 123</font><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">세 가지 모두 정규 변수입니다. </font><font style="vertical-align: inherit;">이런 식 </font><font style="vertical-align: inherit;">으로 배열 요소의 형태로 변수 이름을 작성 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하는 것은 사용자의 몫입니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это означает, что с точки зрения cmd.exe </font></font> <code>SET NORMAL_NAME=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в точности совпадает с </font></font> <code>SET A#$'()*+,-.?@[\]_{}~=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а также с </font></font> <code>SET VECTOR[1]=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">все три нормальные переменные. </font><font style="vertical-align: inherit;">Таким образом, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должны написать имена переменных в виде элементов массива:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这意味着从cmd.exe角度来看，</font></font> <code>SET NORMAL_NAME=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>SET A#$'()*+,-.?@[\]_{}~=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全相同，也与</font></font> <code>SET VECTOR[1]=123</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相同</font><font style="vertical-align: inherit;">[1] = 123</font><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">这三个都是正常变量。</font><font style="vertical-align: inherit;">这样，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由您决定</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以数组元素的形式编写变量名称：</font></font>

source: This was fine for small 2-D Arrays.
es: Esto estaba bien para las pequeñas matrices 2-D.
ja: 小型の2次元アレイの場合はこれで良かった。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소형 2D 어레이에는 적합했습니다.</font></font>
ru: Это было прекрасно для маленьких двухмерных массивов.
zh_cn: 这对于小的二维阵列来说是很好的。

source: This way, <code>echo %elem[2]%</code> will show <code>Second one</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De esta manera, </font></font> <code>echo %elem[2]%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mostrar&aacute; el </font></font> <code>Second one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このように、</font></font> <code>echo %elem[2]%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>Second one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を表示し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이런 식으로 </font></font> <code>echo %elem[2]%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>Second one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 표시 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, </font></font> <code>echo %elem[2]%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> покажет </font></font> <code>Second one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样，</font></font> <code>echo %elem[2]%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将显示</font></font> <code>Second one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: This way, the Batch file <em>behaves</em> like it manages arrays. I think the important point here is not to discuss if Batch manages arrays or not, but the fact that you may manage arrays in Batch files in an equivalent way of other programming languages.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De esta manera, el archivo Batch se </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">comporta</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como si manejara matrices. </font><font style="vertical-align: inherit;">Creo que el punto importante aqu&iacute; no es discutir si Batch gestiona matrices o no, sino el hecho de que puede gestionar matrices en archivos Batch de una manera equivalente a otros lenguajes de programaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このように、バッチファイル</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列を管理</font><em><font style="vertical-align: inherit;">する</font></em><font style="vertical-align: inherit;">ように</font><em><font style="vertical-align: inherit;">動作</font></em><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">ここで重要な点は、Batchが配列を管理するかどうかを議論することではなく、他のプログラミング言語と同等の方法でBatchファイル内の配列を管理できるということです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이런 식으로 배치 파일 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배열을 관리하는 것처럼 </font><em><font style="vertical-align: inherit;">동작</font></em><font style="vertical-align: inherit;"> 합니다. </font><font style="vertical-align: inherit;">여기서 중요한 점은 Batch가 배열을 관리하는지 여부를 논의하는 것이 아니라 다른 프로그래밍 언어와 동일한 방식으로 Batch 파일의 배열을 관리 할 수 ​​있다는 사실입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, пакетный файл </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ведет себя так,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как будто он управляет массивами. </font><font style="vertical-align: inherit;">Я думаю, что здесь важно не обсуждать, управляет ли Batch массивами или нет, а то, что вы можете управлять массивами в пакетных файлах аналогично другим языкам программирования.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样，批处理文件的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行为</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就像管理数组一样。</font><font style="vertical-align: inherit;">我认为这里的重点不是讨论Batch是否管理数组，而是您可以用与其他编程语言等效的方式来管理Batch文件中的数组这一事实。</font></font>

source: To be fair, this script example may not be very explicit in showing what is happening, and I had to make changes on the fly to fix a new object style, but essentially: It creates connection objects, and then dynamically extends them to include sub folders, and maintain running totals for each subfolder and site in KB, MB, and GB, and pics which of the values to report after summing up all of the directories for a given folder etc dynamically.
es: Para ser justos,este ejemplo de guión puede no ser muy explícito para mostrar lo que está sucediendo,y tuve que hacer cambios sobre la marcha para arreglar un nuevo estilo de objeto,pero esencialmente:Crea objetos de conexión,y luego los extiende dinámicamente para incluir subcarpetas,y mantiene los totales de ejecución para cada subcarpeta y sitio en KB,MB,y GB,y pics cuál de los valores a reportar después de resumir todos los directorios para una carpeta dada etc.dinámicamente.
ja: 公平に言うと、このスクリプトの例は、何が起こっているのかを明示的に示しているわけではないかもしれません。それは、接続オブジェクトを作成し、動的にサブフォルダを含むようにそれらを拡張し、KB、MB、GBで各サブフォルダとサイトの実行中の合計を維持し、与えられたフォルダなどのためのディレクトリのすべてを動的に合計した後に報告する値のうちのどれをピックします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공평하게 말하면,이 스크립트 예제는 무슨 일이 일어나고 있는지를 명확하게 나타내지 않을 수 있으며 새로운 객체 스타일을 수정하기 위해 즉시 변경해야했지만 기본적으로 연결 객체를 만든 다음 하위를 포함하도록 동적으로 확장합니다 폴더, 각 하위 폴더 및 사이트에 대한 누적 합계를 KB, MB 및 GB로 표시하고 지정된 폴더 등의 모든 디렉토리를 동적으로 합한 후보고 할 값을 pics로 표시합니다.</font></font>
ru: Честно говоря,этот пример скрипта может быть не очень явным,чтобы показать,что происходит,и мне пришлось вносить изменения на лету,чтобы исправить новый стиль объекта,но по сути:Он создает объекты подключения,а затем динамически расширяет их,чтобы включить в них вложенные папки,и поддерживает запущенные суммарные значения для каждой вложенной папки и сайта в KB,MB и GB,а также изображения того,какие значения после динамического суммирования всех каталогов для данной папки и т.д.должны быть отражены в отчетах.
zh_cn: 平心而论,这个脚本的例子可能不是很明确地显示了正在发生的事情,而且我不得不临时修改,以修复一个新的对象样式,但从本质上讲,它创建了连接对象,然后动态地扩展到每个子文件夹,包括子文件夹中的子文件夹,以KB、MB和GB为单位,并在汇总后,将哪个值作为报告的值,用图片显示出来。它创建了连接对象,然后动态地扩展它们以包括子文件夹,并保持每个子文件夹和站点的运行总量,以KB、MB和GB为单位,并在动态地汇总了所有给定文件夹的目录等后,将其中的值汇总起来,然后将其上报。

source: To combat the issue with needing to re-order sets of Data on the fly I considered using a form of linked lists I toyed with, but since I wanted to easily add items to each grouping of sites while retaining order between sites I settled on a simple method.
es: Para combatir el problema de la necesidad de reordenar los conjuntos de datos sobre la marcha consideré la posibilidad de utilizar una forma de listas vinculadas con las que jugué,pero como quería añadir fácilmente elementos a cada grupo de sitios,manteniendo el orden entre los sitios,me decidí por un método simple.
ja: データのセットをフライで再注文する必要があるという問題に対処するために、私は私がおもちゃにしたリンクされたリストの形式を使用することを検討しましたが、私はサイト間の順序を保持しながら、簡単にサイトの各グループ化にアイテムを追加したかったので、私はシンプルな方法に落ち着きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉석에서 데이터 세트를 다시 주문해야하는 문제를 해결하기 위해 장난감으로 묶인 링크 된 목록 형식을 사용하는 것을 고려했지만, 사이트간에 순서를 유지하면서 각 사이트 그룹에 항목을 쉽게 추가하고 싶었 기 때문에 간단한 방법.</font></font>
ru: Для борьбы с проблемой с необходимостью переупорядочивания наборов данных на лету я подумал об использовании формы связанных списков,с которыми я играл,но так как я хотел легко добавлять элементы в каждую группу сайтов,сохраняя при этом порядок между сайтами,я остановился на простом методе.
zh_cn: 为了解决需要对数据集进行重新排序的问题,我考虑过使用我玩过的链接列表的形式,但由于我想方便地将项目添加到每个站点的分组中,同时保留站点之间的顺序,所以我选择了一个简单的方法。

source: To make the assignment safe against all characters, use the quoted syntax (supposing you have the <a href="http://ss64.com/nt/cmd.html">command extensions</a> enabled, which is the default for the Windows command prompt anyway):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para que la asignaci&oacute;n sea segura contra todos los caracteres, use la sintaxis citada (suponiendo que tenga </font><font style="vertical-align: inherit;">habilitadas las </font></font><a href="http://ss64.com/nt/cmd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">extensiones de comando</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que de todos modos es el valor predeterminado para el s&iacute;mbolo del sistema de Windows):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての文字に対して割り当てを安全にするには、引用符で囲まれた構文を使用します（</font><font style="vertical-align: inherit;">とにかくWindowsコマンドプロンプトのデフォルトである</font></font><a href="http://ss64.com/nt/cmd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンド拡張機能が</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有効になっ</font><font style="vertical-align: inherit;">ていると仮定します</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 문자에 대해 안전하게 대입하려면 인용 된 구문을 사용하십시오 ( </font><font style="vertical-align: inherit;">어쨌든 Windows 명령 프롬프트의 기본값 인 </font></font><a href="http://ss64.com/nt/cmd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명령 확장자를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하도록 설정 한 경우).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы сделать присваивание безопасным для всех символов, используйте синтаксис в кавычках (предположим, что у вас </font><font style="vertical-align: inherit;">включены </font></font><a href="http://ss64.com/nt/cmd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">расширения команд</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которые в любом случае используются по умолчанию для командной строки Windows):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了使分配对所有字符都是安全的，请使用引用的语法（假设您已</font><font style="vertical-align: inherit;">启用</font></font><a href="http://ss64.com/nt/cmd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令扩展名</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这始终是Windows命令提示符的默认设置）：</font></font>

source: To offset the string length limitation limitation, the variable used as the starting point can be changed in combination with the depth level to target.
es: Para compensar la limitación de la limitación de la longitud de la cuerda,la variable utilizada como punto de partida puede cambiarse en combinación con el nivel de profundidad al objetivo.
ja: 文字列の長さ制限を相殺するために、開始点として使用する変数を、ターゲットとする深度レベルと組み合わせて変更することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스트링 길이 제한 한계를 상쇄하기 위해 시작점으로 사용되는 변수를 깊이 수준과 함께 대상으로 변경할 수 있습니다.</font></font>
ru: Для смещения ограничения длины строки,переменная,используемая в качестве начальной точки,может быть изменена в сочетании с уровнем глубины на целевую.
zh_cn: 为了抵消字符串长度的限制,可以结合目标的深度级别来改变作为起始点的变量,以抵消字符串长度的限制。

source: To say nothing of when I need to match and populate content in those multi-dimensional arrays dynamically, where the simple usage there breaks down.
es: Por no hablar de cuando necesito emparejar y poblar el contenido de esas matrices multidimensionales dinámicamente,donde el simple uso se rompe.
ja: 多次元配列のコンテンツを動的にマッチさせたり、埋め込んだりする必要がある場合は言うまでもありませんが、ここでは単純な使い方が崩れてしまいます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다차원 배열의 컨텐츠를 동적으로 일치시키고 채워야 할 때에 대한 간단한 설명은 없습니다.</font></font>
ru: Не говоря уже о том,когда мне нужно динамически сопоставлять и заполнять содержимое в этих многомерных массивах,где простое использование там ломается.
zh_cn: 更不用说当我需要动态地匹配和填充这些多维数组中的内容时,简单的使用方法就会崩溃。

source: To solve this problem you must use <em>Delayed Expansion</em>, that is, insert <code>setlocal EnableDelayedExpansion</code> command at the beginning, enclose index variables in percent symbols, and enclose the array elements in exclamation marks:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para resolver este problema, debe usar la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">expansi&oacute;n retardada</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es decir, insertar el </font><font style="vertical-align: inherit;">comando </font></font> <code>setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al principio, encerrar las variables de &iacute;ndice en s&iacute;mbolos de porcentaje y encerrar los elementos de la matriz en signos de exclamaci&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この問題を解決するに</font><font style="vertical-align: inherit;">は、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遅延拡張を</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用する必要があります</font><font style="vertical-align: inherit;">。つまり</font><font style="vertical-align: inherit;">、最初に</font></font> <code>setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドを</font><font style="vertical-align: inherit;">挿入</font><font style="vertical-align: inherit;">し、インデックス変数をパーセント記号で囲み、配列要素を感嘆符で囲みます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문제를 해결하려면 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지연 확장</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용해야합니다 </font><font style="vertical-align: inherit;">. 즉 </font><font style="vertical-align: inherit;">, 시작 부분에 </font></font> <code>setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령을 </font><font style="vertical-align: inherit;">삽입 </font><font style="vertical-align: inherit;">하고 인덱스 변수를 백분율 기호로 묶고 배열 요소를 느낌표로 묶어야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы решить эту проблему, вы должны использовать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Delayed Expansion</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то есть вставить </font><font style="vertical-align: inherit;">команду </font></font> <code>setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в начале, заключить индексные переменные в символы процента и заключить элементы массива в восклицательные знаки:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要解决此问题，必须使用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Delayed Expansion</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，即，</font><font style="vertical-align: inherit;">在开始处</font><font style="vertical-align: inherit;">插入</font></font> <code>setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令，将索引变量括在百分号中，并将数组元素括在感叹号中：</font></font>

source: Use of the double pipe after the Call string can test for when this failure occurs, allowing intervention:
es: El uso de la doble tubería después de la cadena de llamada puede probar cuándo se produce este fallo,permitiendo la intervención:
ja: コール文字列の後にダブルパイプを使用することで、この失敗がいつ発生するかをテストし、介入を可能にすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호출 문자열 다음에 이중 파이프를 사용하면이 장애가 발생하는시기를 테스트하여 개입 할 수 있습니다.</font></font>
ru: Использование двойной трубы после строки вызова может проверить,когда произошел сбой,позволяя вмешательство:
zh_cn: 在调用字符串后使用双管,可以测试这种故障何时发生,允许干预。

source: We also take the Dumb Pseudo Arrays and convert them into Ordered arrays (removing the original Dumb Pseudo Array variables after).
es: También tomamos los pseudo-matrices tontas y los convertimos en matrices ordenadas (eliminando las variables originales de las pseudo-matrices tontas después).
ja: また、ダム疑似配列を取り、順序付き配列に変換します(元のダム疑似配列変数を後から削除します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 Dumb Pseudo Array를 가져 와서 Ordered arrays로 변환합니다 (이후 원래 Dumb Pseudo Array 변수 제거).</font></font>
ru: Мы также берем немые псевдомассивы и преобразовываем их в упорядоченные массивы (после этого удаляем исходные переменные немых псевдомассивов).
zh_cn: 我们还取哑巴伪数组,并将其转换为有序数组(去掉原有的哑巴伪数组变量后)。
