Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The following program simulates vectors (arrays) operations in <code>cmd</code>. The subroutines presented in it were initially designed for some special cases like storing the program parameters in an array or looping through filenames in a "<code>for</code>" loop and storing them in an array. In these cases, in an <code>enabled delayed expansion</code> block, the "<code>!</code>" characters - if present in values of the parameters or in the "<code>for</code>" loop variable's value - would get interpreted. That's why, in these cases, the subroutines must be used inside a <code>disabled delayed expansion</code> block:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El siguiente programa simula operaciones de vectores (matrices) en </font></font> <code>cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Las subrutinas presentadas en &eacute;l se dise&ntilde;aron inicialmente para algunos casos especiales, como almacenar los par&aacute;metros del programa en una matriz o recorrer los nombres de los archivos en un </font><font style="vertical-align: inherit;">ciclo </font><font style="vertical-align: inherit;">" </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " y almacenarlos en una matriz. En estos casos, en un </font><font style="vertical-align: inherit;">bloque de </font></font> <code>enabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , los caracteres " </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ", Si est&aacute;n presentes en los valores de los par&aacute;metros o en el </font><font style="vertical-align: inherit;">valor de la variable de bucle </font><font style="vertical-align: inherit;">" </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ", se interpretar&iacute;an. Es por eso que, en estos casos, las subrutinas deben usarse dentro de un </font><font style="vertical-align: inherit;">bloque de </font></font> <code>disabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のプログラムは、</font></font> <code>cmd</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ベクトル（配列）操作をシミュレートします</font><font style="vertical-align: inherit;">。そこに示されているサブルーチンは、プログラムパラメータを配列に格納したり、ファイル名を「</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」ループでループして配列に格納したりする</font><font style="vertical-align: inherit;">など、いくつかの特別な場合のために設計され</font><font style="vertical-align: inherit;">ました。これらの場合、</font></font> <code>enabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブロックでは、「</font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」文字（パラメーターの値または「</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」ループ変数の値に存在する場合）が解釈されます。そのため、これらのケースでは、</font></font> <code>disabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">された</font><font style="vertical-align: inherit;">遅延拡張</font><font style="vertical-align: inherit;">ブロック</font><font style="vertical-align: inherit;">内でサブルーチンを使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 프로그램은 </font></font> <code>cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 벡터 (배열) 연산을 시뮬레이션 </font><font style="vertical-align: inherit;">합니다. 여기에 제공된 서브 루틴은 처음에 프로그램 매개 변수를 배열에 저장하거나 파일 이름을 " </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "루프 </font><font style="vertical-align: inherit;">에서 반복하여 배열에 저장하는 것과 같은 특수한 경우를 위해 설계되었습니다 </font><font style="vertical-align: inherit;">. 이러한 경우, </font></font> <code>enabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 블록에서 " </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "문자 (매개 </font><font style="vertical-align: inherit;">변수의 값 </font><font style="vertical-align: inherit;">또는 " </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "루프 변수의 값 </font><font style="vertical-align: inherit;">에있는 경우) 문자 </font><font style="vertical-align: inherit;">가 해석됩니다. 이러한 경우에 서브 루틴은 </font></font> <code>disabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 블록 </font><font style="vertical-align: inherit;">내에서 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Следующая программа имитирует операции векторов (массивов) в </font></font> <code>cmd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Подпрограммы, представленные в нем, изначально были разработаны для некоторых особых случаев, таких как хранение параметров программы в массиве или циклическое прохождение имен файлов в </font><font style="vertical-align: inherit;">цикле </font><font style="vertical-align: inherit;">&laquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; и их сохранение в массиве. В этих случаях в </font></font> <code>enabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> блоке </font><font style="vertical-align: inherit;">отложенного расширения</font><font style="vertical-align: inherit;"> интерпретируются </font><font style="vertical-align: inherit;">символы </font><font style="vertical-align: inherit;">&laquo; </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; - если они присутствуют в значениях параметров или в </font><font style="vertical-align: inherit;">значении переменной цикла </font><font style="vertical-align: inherit;">&laquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;. Вот почему в этих случаях подпрограммы должны использоваться внутри </font></font> <code>disabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> блока </font><font style="vertical-align: inherit;">отложенного расширения</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下程序在</font></font> <code>cmd</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模拟矢量（数组）操作</font><font style="vertical-align: inherit;">。它中提供的子例程最初是为某些特殊情况设计的，例如将程序参数存储在数组中或在&ldquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;循环中</font><font style="vertical-align: inherit;">遍历文件名</font><font style="vertical-align: inherit;">并将它们存储在数组中。在这些情况下，在</font></font> <code>enabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">块中，将解释&ldquo; </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;字符（如果存在于参数值或&ldquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;循环变量的值中）。因此，在这些情况下，必须在</font></font> <code>disabled delayed expansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">块</font><font style="vertical-align: inherit;">内使用子例程</font><font style="vertical-align: inherit;">：</font></font>

source: The included script is somewhat basic, merely built to show proof of concept - not a practical application by any means.
es: El guión incluido es algo básico,construido simplemente para mostrar una prueba de concepto-no una aplicación práctica de ninguna manera.
ja: 付属のスクリプトはやや基本的なもので、概念の証明を示すために作られただけで、実用的なアプリケーションではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">포함 된 스크립트는 다소 기본적인 개념으로, 개념 증명을 보여주기 위해 만들어졌으며, 실제 응용 프로그램은 아닙니다.</font></font>
ru: Входящий в комплект скрипт является несколько базовым,просто построенным,чтобы показать доказательство концепции-а не практического применения ни в коем случае.
zh_cn: 包含的脚本有些基础,只是为了展示概念证明而建立的--无论如何都不是实际应用。

source: The number of directories you have to check, using different users, at the same site begins increasing.
es: El número de directorios que hay que revisar,usando diferentes usuarios,en el mismo sitio comienza a aumentar.
ja: 同じサイトでも、ユーザーを変えてチェックしなければならないディレクトリが増え始める。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한 사이트에서 다른 사용자를 사용하여 확인해야하는 디렉토리 수가 증가하기 시작합니다.</font></font>
ru: Количество каталогов,которые вы должны проверить,используя разных пользователей,на одном и том же сайте начинает увеличиваться.
zh_cn: 在同一个网站,使用不同的用户,你要检查的目录数量开始增加。

source: The only "advanced" construct is the do-it-all weirdo <code>for</code> loop, which, mixed with the strange "rules" of variable substitution (<code>%var%</code>, <code>%%var</code>, <code>!var!</code>, are different stuff because of the idiotic parser), makes writing even trivial algorithms a collection of strange hacks (see e.g. here for <a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file">an implementation of quicksort</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La &uacute;nica construcci&oacute;n de "avanzada" es el hacer-lo-todo tipo raro </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bucle, que, mezclado con las "reglas" de la sustituci&oacute;n de variables extra&ntilde;as ( </font></font> <code>%var%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>%%var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>!var!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , Son cosas diferentes, debido a que el analizador idiota ), hace que la escritura de algoritmos incluso triviales sea una colecci&oacute;n de hacks extra&ntilde;os (ver, por ejemplo, aqu&iacute; para </font></font><a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una implementaci&oacute;n de quicksort</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">唯一の「高度な」構成は、すべて</font><font style="vertical-align: inherit;">を実行する変な</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループであり、変数置換の奇妙な「ルール」と混合されます（</font></font> <code>%var%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>%%var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>!var!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）は、ばかばかしいパーサーのために別のものです）、些細なアルゴリズムでさえ奇妙なハックのコレクションを作成します（たとえば</font></font><a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、クイックソートの実装については</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここを参照してください</font><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유일한 "고급"구조는 - 그것 - 모든 이상한입니다 </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이상한 변수 치환의 "규칙"(혼합, 루프, </font></font> <code>%var%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>%%var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>!var!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때문에 바보 파서의 다른 물건입니다 ), 사소한 알고리즘을 이상한 해킹 모음으로 작성합니다 (예 : </font></font><a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">quicksort 구현에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대해서는 여기 참조 </font><font style="vertical-align: inherit;">).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Только &laquo;продвинутым&raquo; конструкция является сделать-это все-чудак </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> петли, которая смешивается со странными &laquo;правил&raquo; подстановки переменной ( </font></font> <code>%var%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>%%var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>!var!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , Разные вещи из - </font><font style="vertical-align: inherit;">за идиотской парсер ), делает написание даже тривиальных алгоритмов набором странных хаков (см., например, здесь для </font></font><a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">реализации быстрой сортировки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">唯一的&ldquo;高级&rdquo;构造是do-it-all weirdo </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">循环，它与变量替换（</font></font> <code>%var%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>%%var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>!var!</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的奇怪&ldquo;规则&rdquo;混合在一起，这</font><font style="vertical-align: inherit;">是因为它是愚蠢的解析器），甚至可以将琐碎的算法编写成一个奇怪的hacks集合（请参阅此处</font></font><a href="https://stackoverflow.com/questions/133154/how-do-i-implement-quicksort-using-a-batch-file"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的quicksort实现</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: The value of C (Calls required to parse the Variable) commences at 0, increments by 1 for the 2nd expansion, Then doubles for Each subsequent Expansion
es: El valor de C (llamadas necesarias para analizar la variable)comienza en 0,aumenta en 1 para la segunda expansión,y luego se duplica para cada expansión subsiguiente.
ja: C (変数を解析するのに必要な呼び出し)の値は 0 から始まり、2回目の展開では1ずつインクリメントし、それ以降の展開では2倍になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C (변수를 구문 분석하는 데 필요한 호출)의 값은 0에서 시작하여 두 번째 확장의 경우 1 씩 증가한 후 후속 확장마다 두 배가됩니다.</font></font>
ru: Значение C (Вызовы,необходимые для разбора переменной)начинается с 0,увеличивается на 1 для 2-го расширения,затем удваивается для каждого последующего расширения
zh_cn: C(解析变量所需的调用)的值从0开始,第二次扩展时递增1,之后每次扩展时都会增加一倍。

source: Then you need to add the names of the sites in for reporting, so you add another term to each string at place 5 so you don't have to change your function..
es: Luego tienes que añadir los nombres de los sitios para informar,así que añades otro término a cada cadena en el lugar 5 para que no tengas que cambiar tu función..
ja: その後、レポートのためにサイト名を追加する必要がありますので、あなたは、あなたの関数を変更する必要がないように、5の場所に各文字列に別の用語を追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음보고를 위해 사이트 이름을 추가해야하므로 5 번 위치의 각 문자열에 다른 용어를 추가하여 기능을 변경할 필요가 없습니다.</font></font>
ru: Затем вам нужно добавить имена сайтов для отчетов,так что вы добавляете еще один термин в каждую строку в месте 5,чтобы вам не пришлось менять свою функцию...
zh_cn: 然后,你需要把网站的名称添加进来,以便报告,所以你在每一个字符串的第5位添加另一个术语,这样你就不用改变你的功能了。

source: Then you realise you'll need to keep them in order by their site names (or IPs, but the names are easier for most people to remember and you need to be able to let other people have a look) so you change the order in all 13 spots, the call to expand the variables, and the function.
es: Entonces te das cuenta de que tendrás que mantenerlos en orden por sus nombres de sitio (o IP,pero los nombres son más fáciles de recordar para la mayoría de la gente y tienes que dejar que otras personas echen un vistazo)así que cambias el orden en los 13 puntos,la llamada para expandir las variables y la función.
ja: そして、サイト名(またはIPですが、ほとんどの人が覚えやすい名前の方が覚えやすく、他の人にも見てもらえるようにする必要があります)の順に並べる必要があることに気がつきました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 사이트 이름 (또는 IP를 기준으로 순서를 유지해야하지만 대부분의 사람들이 이름을 기억하기 쉽고 다른 사람이 볼 수있게해야 함)을 알고 순서를 변경해야합니다. 13 개 지점, 변수 확장 호출 및 함수.</font></font>
ru: Тогда вы понимаете,что вам нужно держать их в порядке по названиям сайтов (или IP-адресам,но имена легче запомнить большинству людей,и вы должны быть в состоянии позволить другим людям взглянуть),поэтому вы меняете порядок во всех 13 местах,вызов для расширения переменных и функцию.
zh_cn: 然后你会意识到你需要把它们按站点名称(或者说是IP,但这些名称对大多数人来说更容易记住,你需要让别人看一眼),所以你要把所有13个点的顺序都改了,调用扩展变量,函数。

source: This is simply wrong! Variable <code>a</code> will remain empty (supposing it was empty initially) and <code>echo %a%</code> will return <code>ECHO is on.</code> A variable called <code>a</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Esto simplemente est&aacute; mal! </font><font style="vertical-align: inherit;">La variable </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permanecer&aacute; vac&iacute;a (suponiendo que estuviera vac&iacute;a inicialmente) y </font></font> <code>echo %a%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&aacute; que </font></font> <code>ECHO is on.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una variable llamada </font></font> <code>a</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは単に間違っています！</font><font style="vertical-align: inherit;">変数</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は空のままになり（最初は空であったと仮定）、</font></font> <code>echo %a%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>ECHO is on.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことを返し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">変数</font></font> <code>a</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 단순히 잘못입니다! </font><font style="vertical-align: inherit;">변수 </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 비어 있습니다 (초기 비어 있다고 가정). </font></font> <code>echo %a%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>ECHO is on.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 반환 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">변수라는</font></font> <code>a</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это просто неправильно! </font><font style="vertical-align: inherit;">Переменная </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> останется пустой (если изначально она была пустой), и </font></font> <code>echo %a%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет, что </font></font> <code>ECHO is on.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Переменная называется</font></font> <code>a</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这简直是​​错的！</font><font style="vertical-align: inherit;">变量</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将保持为空（假设它最初为空），并且</font></font> <code>echo %a%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将返回</font></font> <code>ECHO is on.</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">称为</font> <code>a</code> <font style="vertical-align: inherit;">的变量</font></font><font style="vertical-align: inherit;"></font>
