Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As mentioned, it is impractical, not to mention terribly inefficient, however I find it interesting enough to merit mentioning.
es: Como ya he dicho,es poco práctico,por no decir terriblemente ineficiente,sin embargo lo encuentro bastante interesante como para merecer ser mencionado.
ja: 前述したように、それは非現実的であることは言うまでもなく、ひどく非効率的であるが、私は言及する価値がある十分に興味深いと思う。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언급했듯이, 비효율적이라고 말할 수는 없지만 실용적이지만 언급 할 가치가 있습니다.</font></font>
ru: Как уже упоминалось,это непрактично,не говоря уже об ужасной неэффективности,однако я нахожу это достаточно интересным и заслуживающим упоминания.
zh_cn: 如前所述,它是不切实际的,更不用说效率极低,然而,我觉得它足够有趣,值得一提。

source: As such an array is essentially a list of sub-strings you need to exports as variables, and adding or changing their ordering means changing your code.
es: Como tal matriz es esencialmente una lista de subcadenas que hay que exportar como variables,y añadir o cambiar su orden significa cambiar su código.
ja: このように、配列は基本的に変数としてエクスポートする必要があるサブ文字列のリストであり、それらの順序を追加したり変更したりすることはコードを変更することを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 배열은 본질적으로 변수로 내 보내야하는 하위 문자열 목록이므로 순서를 추가하거나 변경하면 코드가 변경됩니다.</font></font>
ru: Поскольку такой массив,по сути,представляет собой список подстрок,которые необходимо экспортировать как переменные,а добавление или изменение их порядка следования означает изменение вашего кода.
zh_cn: 因此,数组本质上就是一个子字符串的列表,你需要将其作为变量导出,而添加或改变它们的顺序意味着改变你的代码。

source: As you can probably see, these structures work very well where you have sets of forking hierarchical data that you need to apply manually and show data in a specific sequential order.
es: Como probablemente se puede ver,estas estructuras funcionan muy bien cuando se tienen conjuntos de datos jerárquicos bifurcados que hay que aplicar manualmente y mostrar los datos en un orden secuencial específico.
ja: おそらくお分かりのように、これらの構造は、手動で適用して特定の順序でデータを表示する必要があるフォーク階層データのセットを持っている場合に非常にうまく機能します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보시다시피, 이러한 구조는 수동으로 적용하고 특정 순차 순서로 데이터를 표시해야하는 일련의 분기 계층 구조 데이터가있는 경우 매우 잘 작동합니다.</font></font>
ru: Как вы,вероятно,видите,эти структуры очень хорошо работают там,где у вас есть наборы иерархических данных форкинга,которые вы должны применить вручную и показать данные в определенном последовательном порядке.
zh_cn: 正如你可能看到的那样,这些结构在你有一组分叉的分层数据,需要手动应用并以特定的顺序显示数据的情况下,这些结构的效果非常好。

source: But, I want to create arrays, linked list etc...
es: Pero,quiero crear matrices,lista de enlaces,etc...
ja: しかし、配列やリンクリストなどを作成したい。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 배열, 링크 된 목록 등을 만들고 싶습니다.</font></font>
ru: Но я хочу создать массивы,связанный список и т.д...
zh_cn: 但是,我想创建数组、链接列表等。

source: Cause its help not full in: /?
es: Porque su ayuda no está completa:?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도움말이 가득 차지 않게하십시오 : /?</font></font>
ru: Потому что его помощь не полна:?
zh_cn: 因为它的帮助不是满满的。?

source: Concerning this statement:
es: En cuanto a esta declaración:
ja: この発言について
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 진술에 관하여 :</font></font>
ru: По поводу этого заявления:
zh_cn: 关于这一声明:

source: Could Cmd.exe be defined as full by Turing-Machine definition? ( Turing-Complete )
es: ¿Podría definirse el Cmd.exe como completo por la definición de Turing-Machine?(Turing-Completo )
ja: Cmd.exeはTuring-Machineの定義でフルと定義できますか?(Turing-Complete )
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Turing-Machine 정의에서 Cmd.exe를 전체로 정의 할 수 있습니까? </font><font style="vertical-align: inherit;">(튜링 완료)</font></font>
ru: Может ли Cmd.exe быть определен как полный по определению Turing-Machine?(Turing-Complete )
zh_cn: Cmd.exe可以用图灵机定义为完整吗?(Turing-Complete )

source: Depending on the length of the string contained within a variable, A variable depth of Eleven can be achieved - That is to say, from the same starting point, eleven data points can be stored / extracted. Due to the relationship between the values of how many Expansions are required to access a particular depth of the variable, a function could easily be built to extract a value at that depth.
es: Dependiendo de la longitud de la cadena contenida en una variable,se puede lograr una profundidad variable de Once-es decir,desde el mismo punto de partida,se pueden almacenar once puntos de datos extraídos.Debido a la relación entre los valores de cuántas expansiones se requieren para acceder a una profundidad determinada de la variable,se podría construir fácilmente una función para extraer un valor a esa profundidad.
ja: 変数に含まれる文字列の長さに応じて、11の変数の深さを達成することができます-つまり、同じ開始点から11のデータ・ポイントを抽出して保存することができます。変数の特定の深さにアクセスするために必要なExpansionの数の値の関係から、その深さの値を抽出する関数を簡単に構築することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변수에 포함 된 문자열의 길이에 따라 11의 변수 깊이를 얻을 수 있습니다. 즉, 동일한 시작점에서 11 개의 데이터 포인트를 저장 / 추출 할 수 있습니다. </font><font style="vertical-align: inherit;">변수의 특정 깊이에 액세스하는 데 필요한 확장 횟수 값 사이의 관계로 인해 해당 깊이에서 값을 추출하는 함수를 쉽게 구축 할 수 있습니다.</font></font>
ru: В зависимости от длины строки,содержащейся в переменной,может быть достигнута переменная глубина одиннадцать-т.е.из одной и той же начальной точки могут быть извлечены одиннадцать точек данных.В связи с зависимостью между значениями того,сколько Expansions требуется для доступа к определенной глубине переменной,можно легко построить функцию для извлечения значения на этой глубине.
zh_cn: 根据变量中包含的字符串的长度,可以实现11个变量的深度--也就是说,从相同的起点,可以存储11个数据点进行提取。由于访问变量的特定深度需要多少个扩展值之间的关系,可以很容易地建立一个函数来提取该深度的值。

source: E (% Expansion) begins with a value of 1
es: E (% de expansión)comienza con un valor de 1
ja: E (% Expansion)は値が 1 から始まります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">E (% 확장)는 1의 값으로 시작합니다</font></font>
ru: E (% Расширение)начинается со значения 1
zh_cn: E(膨胀率)以1的值为起点

source: Essentially, the preface to expanding the population macro is:
es: Esencialmente,el prefacio a la expansión del macro de la población es:
ja: 本質的には、人口マクロを拡大するための序章である。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 모집단 확대에 대한 서문은 다음과 같습니다.</font></font>
ru: По сути,предисловие к расширению макронаселения:
zh_cn: 从本质上讲,扩大人口宏观的前言是:

source: Example Results:
es: Ejemplo de resultados:
ja: 結果の例。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과 예 :</font></font>
ru: Пример результатов:
zh_cn: 结果示例。

source: Finally we Dynamically report some of the values from the Array by doing a pre-defined For L Loop for values 7 to 9, and Generating a Random value to print the 4th example value of the array.
es: Finalmente reportamos dinámicamente algunos de los valores de la matriz haciendo un bucle L predefinido para los valores 7 a 9,y generando un valor aleatorio para imprimir el 4º valor de ejemplo de la matriz.
ja: 最後に、あらかじめ定義された値7から9までのFor Lループを実行し、配列の4番目の例の値を表示するためにランダムな値を生成することで、配列からの値の一部を動的にレポートします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마지막으로 7에서 9까지의 값에 대해 사전 정의 된 For L 루프를 수행하고 임의의 값을 생성하여 배열의 네 번째 예제 값을 인쇄하여 Array의 일부 값을 동적으로보고합니다.</font></font>
ru: Наконец,мы динамически сообщаем некоторые значения из массива,выполняя предопределенный цикл For L Loop для значений с 7 по 9,и генерируем случайное значение для печати 4-го примера значения массива.
zh_cn: 最后,我们通过对值7到9做一个预设的For L循环来动态报告数组中的一些值,并生成一个随机值来打印数组的第4个示例值。

source: For all the rest of your question I recommend to read <a href="https://stackoverflow.com/users/778560">Aacini</a>'s great and comprehensive <a href="https://stackoverflow.com/a/10167990">answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para el resto de su pregunta, le recomiendo leer </font><font style="vertical-align: inherit;">la excelente y completa </font><a href="https://stackoverflow.com/a/10167990"><font style="vertical-align: inherit;">respuesta de </font></a></font><a href="https://stackoverflow.com/users/778560"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aacini</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">残りの質問については、</font></font><a href="https://stackoverflow.com/users/778560"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aacini</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のすばらしい包括的な</font></font><a href="https://stackoverflow.com/a/10167990"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">回答</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を読むことをお勧めします</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나머지 질문에 </font></font><a href="https://stackoverflow.com/users/778560"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대해서는 Aacini</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 훌륭하고 포괄적 인 </font></font><a href="https://stackoverflow.com/a/10167990"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 읽는 것이 좋습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На все остальные ваши вопросы я рекомендую прочитать </font><font style="vertical-align: inherit;">отличный и исчерпывающий </font><a href="https://stackoverflow.com/a/10167990"><font style="vertical-align: inherit;">ответ </font></a></font><a href="https://stackoverflow.com/users/778560"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Аасини</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于其余的所有问题，我建议您阅读</font></font><a href="https://stackoverflow.com/users/778560"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aacini</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的详尽综合</font></font><a href="https://stackoverflow.com/a/10167990"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解答</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: From the 12th expansion onwards, the number of Calls and <code>%</code> expansions appended to the string exceed the line length limit, resulting in failure to build a string of the length needed to expand at this point.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de la 12&ordf; expansi&oacute;n, la cantidad de llamadas y </font></font> <code>%</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> expansiones agregadas a la cadena excede el l&iacute;mite de longitud de la l&iacute;nea, lo que resulta en la imposibilidad de construir una cadena de la longitud necesaria para expandirse en este punto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">12番目の拡張以降、</font><font style="vertical-align: inherit;">文字列に追加された</font><font style="vertical-align: inherit;">呼び出しと</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">拡張の</font><font style="vertical-align: inherit;">数が</font><font style="vertical-align: inherit;">行の長さの制限を超えているため、この時点で拡張するために必要な長さの文字列を構築できません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">12 번째 확장부터는 </font><font style="vertical-align: inherit;">문자열에 추가 된 </font><font style="vertical-align: inherit;">통화 수 및 </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 확장이 회선 길이 제한을 초과하여이 시점에서 확장하는 데 필요한 길이의 문자열을 작성하지 못했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Начиная с двенадцатого расширения число вызовов и </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> расширений, добавленных к строке, превышают предел длины строки, что приводит к невозможности построить строку длины, необходимой для расширения в этой точке.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从第12个扩展开始，</font><font style="vertical-align: inherit;">附加到字符串</font><font style="vertical-align: inherit;">的Calls和</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">扩展</font><font style="vertical-align: inherit;">的数量</font><font style="vertical-align: inherit;">超过了行长度限制，导致无法构建此时扩展所需长度的字符串。</font></font>

source: Here is another code example of this step in usage:
es: Aquí hay otro ejemplo de código de este paso en el uso:
ja: ここでは、このステップの使用法の別のコード例を示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은이 단계의 다른 코드 예제입니다.</font></font>
ru: Приведем еще один пример кода этого этапа использования:
zh_cn: 下面是这个步骤使用中的另一个代码示例。

source: However I find it a pain for long arrays of data, especially when I need multi-value content.
es: Sin embargo,me resulta doloroso para las largas series de datos,especialmente cuando necesito un contenido de varios valores.
ja: しかし、長いデータの配列、特に多値コンテンツが必要な場合には苦痛を感じます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 특히 다중 값 콘텐츠가 필요한 경우 긴 데이터 배열에 어려움이 있습니다.</font></font>
ru: Однако я нахожу это занозой для длинных массивов данных,особенно когда мне нужен многозначный контент.
zh_cn: 但是我发现对于长数组的数据,特别是当我需要多值内容的时候,我觉得很麻烦。

source: I constructed the below macro to mimic piping by assigning input arguments to a variable processed by an internal for loop at the moment it's expanded.
es: Construí la macro de abajo para imitar la tubería asignando argumentos de entrada a una variable procesada por un bucle interno para el momento en que se expande.
ja: 展開した瞬間に内部のforループで処理される変数に入力引数を代入することで配管を模倣するマクロを以下のように構築しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 매크로가 확장되는 순간 내부 for 루프로 처리되는 변수에 입력 인수를 할당하여 파이프를 모방하도록 아래 매크로를 구성했습니다.</font></font>
ru: Я построил приведенный ниже макрос для имитации конвейера,присваивая входные аргументы переменной,обрабатываемой внутренним циклом for в момент ее расширения.
zh_cn: 我构造了下面这个宏,通过在扩展的时候将输入参数分配给一个内部的for循环处理的变量,来模仿流水线。

source: I create a variable to hold the method for adding members to make adding them simpler.
es: Creo una variable para mantener el método de agregar miembros para hacer que agregarlos sea más simple.
ja: メンバーの追加を簡単にするために、メンバーを追加するためのメソッドを保持するための変数を作成しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">멤버를 추가하는 방법을 유지하여 변수를 간단하게 추가 할 수있는 변수를 만듭니다.</font></font>
ru: Я создаю переменную,удерживающую метод добавления членов,чтобы упростить их добавление.
zh_cn: 为了让添加成员的方法更简单,我创建了一个变量来固定成员的添加方法。

source: I elaborated on the reasons I have to use array notation in Batch files at <a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981">this post</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Expliqu&eacute; las razones por las que tengo que usar la notaci&oacute;n de matriz en los archivos por lotes en </font></font><a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta publicaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、バッチファイルで配列表記を使用する必要がある理由について詳しく説明しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 포스트의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 배치 파일에서 배열 표기법을 사용해야하는 이유에 대해 자세히 설명했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом посте</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> я подробно остановился на причинах, по которым я должен использовать запись массива в пакетных файлах </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我在</font></font><a href="https://stackoverflow.com/questions/10544646/dir-output-into-bat-array/10569981#10569981"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇文章中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">详细说明了我必须在Batch文件中使用数组符号的原因</font><font style="vertical-align: inherit;">。</font></font>

source: I ended up resorting to implementing a sort of poor-mans Structure or Object-array (of strings) in my cmd scripts where the need fits.
es: Terminé recurriendo a la implementación de una especie de Estructura de Hombre-Pobre o Arreglo de Objetos (de cuerdas)en mis guiones de cmd donde la necesidad encaja.
ja: 私は結局、必要に応じて cmd スクリプトにある種の貧乏人の構造やオブジェクト配列(文字列の)を実装することに頼ることになってしまいました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필자는 cmd 스크립트에서 필요에 맞는 일종의 가난한 사람 구조 또는 객체 배열 (문자열)을 구현하기로 결정했습니다.</font></font>
ru: В конце концов,я прибегнул к реализации своего рода "Структура бедняков" или "Объектный массив" (строк)в моих командных сценариях,где необходимость подходит.
zh_cn: 我最终诉诸于在我的cmd脚本中实现了一种可怜的结构或对象数组(字符串),在需要的地方,我的cmd脚本。

source: I found that it became hard when you ended up needing multiple arrays of information which you needed to update or add features to across the board.
es: Descubrí que se hizo difícil cuando terminaste necesitando múltiples matrices de información que necesitabas actualizar o añadir características a todo el tablero.
ja: 更新や機能追加が必要な情報の配列が複数必要になったときに、それが難しくなることがわかりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전반적으로 기능을 업데이트하거나 추가하는 데 필요한 여러 정보 배열이 필요할 때 어려움을 겪었습니다.</font></font>
ru: Я обнаружил,что это стало трудным,когда вам понадобилось несколько массивов информации,которые вам нужно было обновить или добавить новые функции.
zh_cn: 我发现,当你最终需要多个信息数组,而你需要更新或添加功能时,这就变得困难了。

source: I have found, how to define simple variables:
es: He encontrado,como definir variables simples:
ja: 単純な変数を定義する方法を見つけました
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 변수를 정의하는 방법을 찾았습니다.</font></font>
ru: Я нашел,как определить простые переменные:
zh_cn: 我找到了,如何定义简单变量。

source: I hit upon the Idea of using a "For" loop and the "set" command to allow the parsing of variables, allowing me to create Pseudo Arrays, both ordered and linked-list style, and more importantly, Pseudo Objects akin to structures.
es: Me di cuenta de la idea de usar un bucle "For" y el comando "set" para permitir el análisis sintáctico de las variables,permitiéndome crear pseudo-arreglos,tanto ordenados como enlazados,y lo que es más importante,pseudo-objetos similares a estructuras.
ja: 私は、"For "ループと "set "コマンドを使用して変数の解析を可能にするというアイデアに行き当たりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변수의 구문 분석을 허용하기 위해 "For"루프와 "set"명령을 사용한다는 아이디어에 발 맞추어 순서와 링크 목록 스타일로 의사 배열을 생성 할 수있게되었으며, 더 중요한 것은 의사 오브젝트를 구조와 유사하게 만들 수있었습니다.</font></font>
ru: Я наткнулся на идею использования цикла "For" и команды "set",позволяющей разобрать переменные,что позволяет мне создавать Псевдомассивы,как упорядоченные,так и связанные со списком,и,что более важно,Псевдообъекты,похожие на структуры.
zh_cn: 我想到了使用 "For "循环和 "set "命令来实现变量的解析,这样我就可以创建Pseudo Arrays,既可以是有序的,也可以是链接列表式的,更重要的是,Pseudo Objects类似于结构的Pseudo Objects。
