Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I made a bubble sort implementation in batch using pseudo-arrays a while ago. Not sure why you'd use it (although I will admit to doing so in another batch file) as it gets pretty slow as the list size increases. It was more to set myself a little challenge. <em>Someone</em> might find this useful.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hice una implementaci&oacute;n de clasificaci&oacute;n de burbujas en lote usando pseudo-arrays hace un tiempo. </font><font style="vertical-align: inherit;">No estoy seguro de por qu&eacute; lo usar&iacute;as (aunque admitir&eacute; que lo har&eacute; en otro archivo por lotes) ya que se vuelve bastante lento a medida que aumenta el tama&ntilde;o de la lista. </font><font style="vertical-align: inherit;">Era m&aacute;s que ponerme un peque&ntilde;o desaf&iacute;o. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Alguien</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede encontrar esto &uacute;til.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">先ほど、疑似配列を使用してバブルソート実装をバッチで作成しました。</font><font style="vertical-align: inherit;">リストのサイズが大きくなるとかなり遅くなるため、なぜそれを使用するのかはわかりません（ただし、別のバッチファイルで使用することは認めます）。</font><font style="vertical-align: inherit;">少し挑戦するだけでした。 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">誰か</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がこれを役に立つと思うかもしれません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">얼마 전에 의사 배열을 사용하여 일괄 처리로 버블 정렬 구현을 만들었습니다. </font><font style="vertical-align: inherit;">목록 크기가 증가함에 따라 꽤 느려서 왜 다른 배치 파일에서 그렇게 할 것입니까? </font><font style="vertical-align: inherit;">나 자신에게 약간의 도전을하는 것이 더 낫다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이것이 유용하다고 생각할 수도 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я сделал реализацию пузырьковой сортировки в пакетном режиме с использованием псевдо-массивов некоторое время назад. </font><font style="vertical-align: inherit;">Не уверен, почему вы используете его (хотя я допущу это в другом пакетном файле), так как он становится довольно медленным по мере увеличения размера списка. </font><font style="vertical-align: inherit;">Это было больше, чтобы поставить перед собой небольшую задачу. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кто-то</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может найти это полезным.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不久前，我使用伪数组批量创建了冒泡排序实现。</font><font style="vertical-align: inherit;">不知道为什么要使用它（尽管我会在另一个批处理文件中使用它），因为随着列表大小的增加它会变得非常慢。</font><font style="vertical-align: inherit;">给自己设置一些挑战更多。 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有人</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可能会觉得这很有用。</font></font>

source: I point this out as it should make it easy to see how we make the minor jump from ordered arrays to Pseudo objects.
es: Señalo esto como debería hacer fácil ver cómo hacemos el salto menor de las matrices ordenadas a los pseudo-objetos.
ja: 順序付き配列から疑似オブジェクトへのマイナーなジャンプをどのように行うかを簡単に理解できるようにする必要があるので、私はこの点を指摘します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순서가 지정된 배열에서 Pseudo 객체로의 작은 이동을 쉽게 확인할 수 있도록 이것을 지적합니다.</font></font>
ru: Я обращаю на это внимание,так как это должно сделать его легким,чтобы увидеть,как мы делаем небольшой прыжок из упорядоченных массивов в Псевдо-объекты.
zh_cn: 我指出这一点,因为这应该很容易让人看到我们如何从有序数组到伪对象的小跳转。

source: I want to realize some algorithms as:
es: Quiero realizar algunos algoritmos como:
ja: としていくつかのアルゴリズムを実現したい。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 일부 알고리즘을 실현하고 싶습니다.</font></font>
ru: Я хочу реализовать некоторые алгоритмы,как..:
zh_cn: 我想实现一些算法为。

source: I was playing with cmd.exe, but in its help I didn't find any info, how to define arrays.
es: Estaba jugando con cmd.exe,pero en su ayuda no encontré ninguna información,como definir los arreglos.
ja: 私はcmd.exeで遊んでいたが、そのヘルプでは、どのように配列を定義する方法、情報を見つけることができませんでした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cmd.exe를 가지고 놀고 있었지만 그 도움으로 배열을 정의하는 방법에 대한 정보를 찾지 못했습니다.</font></font>
ru: Я играл с cmd.exe,но в его помощи не нашел никакой информации,как определить массивы.
zh_cn: 我在玩cmd.exe,但在它的帮助中我没有找到任何信息,如何定义数组。

source: IE the structure would be a "Site Object" which would have multiple properties, which might be objects with sub properties themselves. Since CMD is not actually Object oriented, its a bit of a kludge, just as arrays are.
es: IE la estructura sería un "Objeto del Sitio" que tendría múltiples propiedades,que podrían ser objetos con sub-propiedades en sí mismas.Dado que el CMD no está realmente orientado a los objetos,es un poco torpe,al igual que los arreglos.
ja: IE 構造体は、複数のプロパティを持つ「サイト・オブジェクト」になります。CMD は実際にはオブジェクト指向ではないので、配列と同じように、そのビットの kludge です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IE 구조는 여러 속성을 가진 "사이트 개체"가되며 하위 속성을 가진 개체 일 수 있습니다. </font><font style="vertical-align: inherit;">CMD는 실제로 객체 지향적이지 않기 때문에 배열과 마찬가지로 약간의 문제가 있습니다.</font></font>
ru: IE структура будет "Объект сайта",который будет иметь несколько свойств,которые могут быть объектами с под-свойствами.Так как CMD на самом деле не ориентирован на объект,это немного kludge,точно так же как и массивы.
zh_cn: IE结构将是一个 "站点对象",它将有多个属性,可能是带有子属性的对象。由于CMD实际上不是面向对象,所以它有点麻烦,就像数组一样。

source: If you want to use <em>another variable</em> as index, you must know that the replacement of variables enclosed in percent symbols by their values is parsed <em>from left to right</em>; this means that:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea utilizar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">otra variable</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como &iacute;ndice, debe saber que el reemplazo de las variables encerradas en s&iacute;mbolos de porcentaje por sus valores se analiza </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de izquierda a derecha</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">esto significa que:</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別の変数</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をインデックスとして</font><font style="vertical-align: inherit;">使用する場合は</font><font style="vertical-align: inherit;">、パーセント記号で囲まれた変数の値による置換が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">左から右に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解析されることを知っている必要があります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">この意味は：</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 변수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 인덱스 </font><font style="vertical-align: inherit;">로 사용하려면 </font><font style="vertical-align: inherit;">백분율 기호로 묶인 변수를 값으로 대체하는 것이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왼쪽에서 오른쪽으로</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구문 분석됨을 알아야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이것은 다음을 의미합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите использовать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">другую переменную в</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> качестве индекса, вы должны знать, что замена переменных, заключенных в символы процента, на их значения анализируется </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">слева направо</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">это означает, что:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要使用</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一个变量</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为索引，则必须知道，用百分号括起来的变量用其值替换是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从左到右进行</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解析的</font><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">这意味着：</font></font>

source: In <a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823">this post</a> there is a Batch file that reads a text file and stores the indexes of the lines in a vector, then does a Buble Sort of vector elements based on line contents; the equivalent result is a sort over file contents.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta publicaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay un archivo Batch que lee un archivo de texto y almacena los &iacute;ndices de las l&iacute;neas en un vector, luego realiza una Clasificaci&oacute;n de elementos vectoriales basados ​​en el contenido de la l&iacute;nea; </font><font style="vertical-align: inherit;">el resultado equivalente es una ordenaci&oacute;n sobre el contenido del archivo.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このポスト</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、テキストファイルを読み込み、ベクター内の行インデックスを格納するバッチファイルが存在しないブーブレソート行の内容に基づいて、ベクトルの要素; </font><font style="vertical-align: inherit;">同等の結果は、ファイルの内容をソートしたものです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 게시물에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 텍스트 파일을 읽고 벡터의 라인의 인덱스를 저장하는 배치 파일이 수행하는 Buble 정렬 라인의 내용을 기반으로 한 벡터 요소의; </font><font style="vertical-align: inherit;">동등한 결과는 파일 내용에 대한 정렬입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом посте</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> есть пакетный файл, который читает текстовый файл и сохраняет индексы строк в векторе, а затем выполняет сортировку векторов по элементам Buble на основе содержимого строк; </font><font style="vertical-align: inherit;">эквивалентный результат - сортировка содержимого файла.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=2823"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇文章中，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有一个批处理文件，该文件读取文本文件并将行的索引存储在向量中，然后根据行内容对向量元素进行大量排序；</font><font style="vertical-align: inherit;">等效的结果是对文件内容进行排序。</font></font>

source: In <a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126">this post</a> there is a basic Relational Data Base application in Batch based on indexes stored in files.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta publicaci&oacute;n,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay una aplicaci&oacute;n b&aacute;sica de base de datos relacionales en Batch basada en &iacute;ndices almacenados en archivos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、この記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のファイルに保存されたインデックスに基づいて、バッチで、基本的なリレーショナルデータベースのアプリケーションがあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 게시물</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 파일에 저장 인덱스에 따라 배치의 기본 관계형 데이터베이스 응용 프로그램이 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом посте</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> базовое приложение реляционной базы данных в Batch основано на индексах, хранящихся в файлах</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3126"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇文章</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有基于存储在文件索引在批处理基本关系数据库应用程序。</font></font>

source: In <a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244">this post</a> there is a complete multiple linked-list application in Batch that assembles a large data structure taken from a subdirectory and displays it in the form of TREE command.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta publicaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay una aplicaci&oacute;n completa de listas enlazadas m&uacute;ltiples en Batch que ensambla una gran estructura de datos tomada de un subdirectorio y la muestra en forma de comando TREE.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、この記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のサブディレクトリとTREEコマンドの形式で表示し、それをから取られた大規模なデータ構造を組み立てる一括で完全な複数の連結リストのアプリケーションがあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 게시물</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조립 대형 데이터 구조가 TREE 명령의 형태로 하위 디렉토리 및 디스플레이 그것을에서 가져온 것을 배치에서 완벽한 여러 연결된 목록 응용 프로그램이 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом посте</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в Batch представлено полное приложение с несколькими связанными списками, которое собирает большую структуру данных, взятую из подкаталога, и отображает ее в виде команды TREE.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="http://www.dostips.com/forum/viewtopic.php?f=3&amp;t=3244"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇文章中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，Batch中有一个完整的多个链表应用程序，该应用程序组装了一个从子目录获取的大型数据结构，并以TREE命令的形式显示。</font></font>

source: In Windows Batch files a <em>variable name</em> should begin with a letter and may include any valid character, where <em>valid characters</em> are: #$'()*+,-.?@[]_`{}~ besides letters and digits.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En los archivos de Windows Batch, un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">nombre de variable</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe comenzar con una letra y puede incluir cualquier car&aacute;cter v&aacute;lido, donde </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">los caracteres v&aacute;lidos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son: # $ '() * +, -.? @ [] _ ​​`{} ~ Adem&aacute;s de letras y d&iacute;gitos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windowsバッチファイルでは、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変数名</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は文字で始まる必要があり、有効な文字を含めることができます。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有効な文字</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は次のとおり</font><em><font style="vertical-align: inherit;">です</font></em><font style="vertical-align: inherit;">：＃$ '（）* +、-。？@ [] _ `{}〜文字と数字のほかに。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows 배치 파일에서 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변수 이름</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 문자로 시작해야하며 유효한 문자를 포함 할 수 있습니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유효한 문자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 다음과 같습니다. # $ '() * +,-.? @ [] _`{} ~ 문자와 숫자 외에.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В пакетных файлах Windows </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">имя переменной</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должно начинаться с буквы и может содержать любой допустимый символ, где </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">допустимые символы</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : # $ '() * +, -.? @ [] _ ​​`{} ~ Помимо букв и цифр.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在Windows Batch文件中，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量名</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应以字母开头，并且可以包含任何有效字符，其中</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有效字符</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为：＃$'（）* +，-。？@ [] _`{}〜除字母和数字外。</font></font>

source: In a similar script to the FTP delete, we need to check the sizes of multiple directories, I am going to dumb tis one down quite a bit and look at just one check:
es: En un script similar al de la eliminación del FTP,necesitamos comprobar el tamaño de varios directorios,voy a bajar un poco el tamaño de uno de ellos y mirar un solo cheque:
ja: FTPの削除と似たようなスクリプトで、複数のディレクトリのサイズをチェックする必要がありますが、私はかなりの量を減らして、1つだけのチェックを見ようとしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FTP 삭제와 비슷한 스크립트에서 여러 디렉토리의 크기를 확인해야합니다. 나는 조금 아래를 멍청하게하고 한 번만 확인합니다.</font></font>
ru: В сценарии,похожем на FTP delete,нам нужно проверить размеры нескольких каталогов,я собираюсь сделать это довольно глупо,и посмотреть только на одну проверку:
zh_cn: 在类似于FTP删除的脚本中,我们需要检查多个目录的大小,我就把它的大小减弱了不少,只看一个检查。
