Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In all the playing around I've done with bath arrays in the past few month's, how did I miss using <code>Set ArrayName[</code> as a means of accessing or storing the Array. <a href="https://stackoverflow.com/a/35632781/12343998">Thanks</a><a href="https://stackoverflow.com/users/1683264/rojo">@Rojo</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En todos los juegos que he hecho con los arreglos de ba&ntilde;o en los &uacute;ltimos meses, &iquest;c&oacute;mo extra&ntilde;&eacute; el uso de </font></font> <code>Set ArrayName[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como un medio para acceder o almacenar el Array? </font></font><a href="https://stackoverflow.com/a/35632781/12343998"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gracias </font></font></a><a href="https://stackoverflow.com/users/1683264/rojo"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Rojo</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">過去数か月の間に</font></font> <code>Set ArrayName[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行ったすべての遊びの中で、配列</font><font style="vertical-align: inherit;">へのアクセスまたは格納の手段として</font><font style="vertical-align: inherit;">Set ArrayName [</font><font style="vertical-align: inherit;">を使用できなかったのは</font><font style="vertical-align: inherit;">なぜですか</font><font style="vertical-align: inherit;">。 </font></font><a href="https://stackoverflow.com/a/35632781/12343998"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ありがとう</font></font></a><a href="https://stackoverflow.com/users/1683264/rojo"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Rojo</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지난 몇 달 동안 목욕 배열을 사용하여 수행 한 모든 놀이에서 배열에 </font><font style="vertical-align: inherit;">액세스하거나 저장하는 수단으로 </font></font> <code>Set ArrayName[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용하여 어떻게 놓쳤습니까? </font></font><a href="https://stackoverflow.com/a/35632781/12343998"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">감사합니다 </font></font></a><a href="https://stackoverflow.com/users/1683264/rojo"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Rojo</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">За все время, что я делал с массивами бань за последние несколько месяцев, как мне не хватало использования </font></font> <code>Set ArrayName[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в качестве средства доступа или хранения массива. </font></font><a href="https://stackoverflow.com/a/35632781/12343998"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Спасибо </font></font></a><a href="https://stackoverflow.com/users/1683264/rojo"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Rojo</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在过去的几个月中，我在使用</font></font> <code>Set ArrayName[</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">数组进行的所有工作中，我怎么会错过使用</font><font style="vertical-align: inherit;">Set ArrayName [</font><font style="vertical-align: inherit;">作为访问或存储Array的方法。 </font></font><a href="https://stackoverflow.com/a/35632781/12343998"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">谢谢</font></font></a><a href="https://stackoverflow.com/users/1683264/rojo"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Rojo</font></font></a>

source: Initially I would do things similar to Aacini, a simple line of variables with an incremental counter, manually, or assigning them through a simple loop from a quick list of variables.
es: Inicialmente haría cosas similares a Aacini,una simple línea de variables con un contador incremental,manualmente,o asignándolas a través de un simple bucle de una lista rápida de variables.
ja: 最初はAaciniと似たようなことをするのですが、インクリメンタルカウンターを使ったシンプルな変数の列を手動で作ったり、変数のクイックリストからシンプルなループで代入したりしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">처음에는 증분 카운터가있는 간단한 변수 라인 인 Aacini와 비슷한 작업을 수행하거나 빠른 변수 목록에서 간단한 루프를 통해 변수를 할당합니다.</font></font>
ru: Изначально я бы делал вещи,похожие на Aacini,простую строку переменных с инкрементальным счетчиком,вручную,или присваивал бы их через простой цикл из быстрого списка переменных.
zh_cn: 最初我会做类似于Aacini的事情,用增量的计数器,手动或通过一个简单的循环从一个快速的变量列表中分配变量,简单的一行变量,就可以做类似于Aacini的事情。

source: It is all terribly hackish and inconvenient when it comes down to it. The command-line shell just wasn't designed for heavy programming. I agree with @MatteoItalia -- if you need serious scripting, use a real scripting language.
es: Todo es terriblemente pirata e inconveniente cuando se trata de eso.El armazón de la línea de comandos no fue diseñado para una programación pesada.Estoy de acuerdo con @MatteoItalia...si necesitas una programación seria,usa un lenguaje de programación real.
ja: いざとなれば、すべてがひどくハックされていて、不便です。コマンドラインシェルは重いプログラミングのために設計されたものではありません。私は @MatteoItalia さんの意見に同意します --本格的なスクリプトが必要なら、本物のスクリプト言語を使いましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 올 때 그것은 매우 해킹적이고 불편합니다. </font><font style="vertical-align: inherit;">명령 행 쉘은 방대한 프로그래밍을 위해 설계되지 않았습니다. </font><font style="vertical-align: inherit;">@MatteoItalia에 동의합니다. 심각한 스크립팅이 필요한 경우 실제 스크립팅 언어를 사용하십시오.</font></font>
ru: Все это ужасно хакерское и неудобное,когда дело доходит до этого.Оболочка командной строки просто не предназначена для тяжелого программирования.Я согласен с @MatteoItalia --если вам нужен серьезный скриптинг,используйте реальный язык сценариев.
zh_cn: 归根结底,这都是非常可怕的黑客行为,很不方便。命令行shell并不是为重度编程而设计的。我同意@MatteoItalia的观点----如果你需要严肃的脚本,就用真正的脚本语言。

source: It is also possible to store the program parameters in an "array" or loop through the filenames in a directory using a "<code>for</code>" loop and store them in an "array" (without interpreting "<code>!</code>" in their values) without using the presented subroutines in the program above:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n es posible almacenar los par&aacute;metros del programa en una "matriz" o recorrer los nombres de archivo en un directorio usando un </font><font style="vertical-align: inherit;">bucle </font><font style="vertical-align: inherit;">" </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " y almacenarlos en una "matriz" (sin interpretar " </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " En sus valores) sin usar el presentado subrutinas en el programa anterior:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「配列」にプログラムパラメータを格納するか、「</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」ループ</font><font style="vertical-align: inherit;">を使用してディレクトリ内のファイル名を</font><font style="vertical-align: inherit;">ループし、「配列」に格納する（</font><font style="vertical-align: inherit;">値の</font><font style="vertical-align: inherit;">「</font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">を解釈</font><font style="vertical-align: inherit;">せずに）上記のプログラムのサブルーチン：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그램 매개 변수를 "배열"에 저장하거나 " </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "루프 </font><font style="vertical-align: inherit;">를</font><font style="vertical-align: inherit;"> 사용하여 디렉토리에서 파일 이름을 통해 </font><font style="vertical-align: inherit;">루프하고 </font><font style="vertical-align: inherit;">제시된 값을 사용하지 않고 "값 </font><font style="vertical-align: inherit;">을 해석하지 않고" "배열"에 저장할 수 있습니다 </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 위 프로그램의 서브 루틴 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также возможно сохранять параметры программы в &laquo;массиве&raquo; или циклически перебирать имена файлов в каталоге, используя </font><font style="vertical-align: inherit;">цикл </font><font style="vertical-align: inherit;">&laquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;, и сохранять их в &laquo;массиве&raquo; (без интерпретации &laquo; </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; В их значениях) без использования представленных Подпрограммы в программе выше:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也可以将程序参数存储在&ldquo;数组&rdquo;中，或使用&ldquo; </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;循环</font><font style="vertical-align: inherit;">在目录中的文件名中</font><font style="vertical-align: inherit;">循环，然后将其存储在&ldquo;数组&rdquo;中（</font><font style="vertical-align: inherit;">其值</font><font style="vertical-align: inherit;">不解释&ldquo; </font></font> <code>!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;），而无需使用显示的上面程序中的子例程：</font></font>

source: Joined to the outside of the Define.Array macro For loop using:
es: Se unió al exterior de la macro Define.Array para el uso de bucles:
ja: Define.Arrayマクロの外側に結合されています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음을 사용하여 Define.Array 매크로 For 루프 외부에 결합했습니다.</font></font>
ru: Присоединен к внешней стороне макроса Define.Array Для использования петли:
zh_cn: 加入到Define.Array宏的外部使用For循环。

source: Located here is a script that demonstrates the use of nested for loops to sort and compare elements in Arrays
es: Aquí hay un guión que demuestra el uso de anidados para bucles para clasificar y comparar elementos en Matrices
ja: ここにあるのは、入れ子になったループを使って、配列の要素を並べ替えたり比較したりするスクリプトです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열에있는 요소를 정렬하고 비교하기 위해 중첩 된 for 루프를 사용하는 방법을 보여주는 스크립트가 여기 있습니다.</font></font>
ru: Здесь расположен скрипт,который демонстрирует использование вложенных для циклов элементов в массивах для сортировки и сравнения
zh_cn: 这里有一个脚本,演示了使用嵌套循环来对Arrays中的元素进行排序和比较的脚本。

source: My tip is, if you want to do your scripting in a sane way, use a <em>real</em> scripting language, and leave batch for simple, quick hacks and for backwards compatibility.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi sugerencia es que, si quieres hacer scripts de una manera sensata, usa un </font><font style="vertical-align: inherit;">lenguaje de scripting </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">real</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y deja el lote para hacks simples y r&aacute;pidos y para compatibilidad con versiones anteriores.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私のヒントは、スクリプトを健全な方法で実行したい場合は、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スクリプト言語を</font><font style="vertical-align: inherit;">使用し、</font><font style="vertical-align: inherit;">単純で迅速なハッキングと下位互換性のためにバッチを残します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제 팁은 제정신 방식으로 스크립팅을하고 싶다면 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 스크립팅 언어를 </font><font style="vertical-align: inherit;">사용하고 </font><font style="vertical-align: inherit;">단순하고 빠른 해킹과 하위 호환성을 위해 배치를 남겨 두는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мой совет: если вы хотите делать свои сценарии разумным способом, используйте </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">настоящий</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> язык сценариев и оставьте пакет для простых, быстрых хаков и обратной совместимости.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的提示是，如果您想以一种明智的方式进行</font><font style="vertical-align: inherit;">脚本编写</font><font style="vertical-align: inherit;">，请使用一种</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真正的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">脚本语言，并保留批处理功能，以进行简单，快速的破解并向后兼容。</font></font>

source: Note that index values are not limited to numbers, but they may be any string that contain valid characters; this point allows to define what in other programming languages are called <a href="https://en.wikipedia.org/wiki/Associative_array">associative arrays</a>. At <a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840">this answer</a> there is a detailed explanation of the method used to solve a problem using an associative array. Note also that the space is a valid character in variable names, so you must pay attention to not insert spaces in variable names that may go unnoticed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que los valores de &iacute;ndice no est&aacute;n limitados a n&uacute;meros, sino que pueden ser cualquier cadena que contenga caracteres v&aacute;lidos; </font><font style="vertical-align: inherit;">Este punto permite definir lo que en otros lenguajes de programaci&oacute;n se llaman </font></font><a href="https://en.wikipedia.org/wiki/Associative_array"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">matrices asociativas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En </font></font><a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay una explicaci&oacute;n detallada del m&eacute;todo utilizado para resolver un problema utilizando una matriz asociativa. </font><font style="vertical-align: inherit;">Tenga en cuenta tambi&eacute;n que el espacio es un car&aacute;cter v&aacute;lido en los nombres de variables, por lo que debe prestar atenci&oacute;n para no insertar espacios en los nombres de variables que puedan pasar desapercibidos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インデックス値は数値に限定されず、有効な文字を含む任意の文字列である可能性があることに注意してください。</font><font style="vertical-align: inherit;">この点により、他のプログラミング言語では</font></font><a href="https://en.wikipedia.org/wiki/Associative_array"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">連想配列</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれるものを定義でき</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">で、</font></font><a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この答え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">連想配列を使用して問題を解決するために使用される方法の詳細な説明があります。</font><font style="vertical-align: inherit;">スペースは変数名で有効な文字であることにも注意してください。そのため、気づかれない可能性がある変数名にスペースを挿入しないように注意する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인덱스 값은 숫자로 제한되지 않지만 유효한 문자가 포함 된 문자열 일 수 있습니다. </font><font style="vertical-align: inherit;">이 시점에서 다른 프로그래밍 언어에서 </font></font><a href="https://en.wikipedia.org/wiki/Associative_array"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연관 배열</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이라고하는 것을 정의 할 수 </font><font style="vertical-align: inherit;">있습니다</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">에서는 </font></font><a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 응답</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 연관 배열을 이용하여 문제를 해결하는 데 사용되는 방법의 상세한 설명이있다. </font><font style="vertical-align: inherit;">또한 공백은 변수 이름에 유효한 문자이므로 변수 이름에 공백이 삽입되지 않도록주의해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что значения индекса не ограничиваются числами, но они могут быть любой строкой, содержащей допустимые символы; </font><font style="vertical-align: inherit;">эта точка позволяет определить, что в других языках программирования называется </font></font><a href="https://en.wikipedia.org/wiki/Associative_array"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ассоциативными массивами</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В </font></font><a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом ответе</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> есть подробное объяснение метода, используемого для решения проблемы с использованием ассоциативного массива. </font><font style="vertical-align: inherit;">Также обратите внимание, что пробел является допустимым символом в именах переменных, поэтому вы должны обратить внимание на то, чтобы не вставлять пробелы в именах переменных, которые могут остаться незамеченными.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，索引值不限于数字，而是可以是包含有效字符的任何字符串。</font><font style="vertical-align: inherit;">这一点允许定义其他编程语言中的什么称为</font></font><a href="https://en.wikipedia.org/wiki/Associative_array"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关联数组</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在</font></font><a href="https://stackoverflow.com/questions/35639223/find-all-ocurences-of-letter-change-to-diffrent-letter/35642840#35642840"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此答案中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，将详细说明用于使用关联数组解决问题的方法。</font><font style="vertical-align: inherit;">还要注意，空格是变量名中的有效字符，因此必须注意不要在变量名中插入可能不被注意的空格。</font></font>

source: Ok. I'll try to be as clear as possible to not be misunderstood...
es: Ok.Trataré de ser lo más claro posible para no ser malinterpretado...
ja: わかりました、誤解されないように出来るだけわかりやすくしておきます...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">확인. </font><font style="vertical-align: inherit;">나는 오해되지 않도록 가능한 한 명확하게 노력할 것입니다 ...</font></font>
ru: Хорошо.Я постараюсь быть как можно более ясным,чтобы не быть неправильно понятым...
zh_cn: 好吧,我会尽量说清楚,以免被误解。

source: References/instances/structs are stuff for a real language, cmd scripting is just a bunch of extensions that grew over the very primitive interpreter that was command.com, you can do some basic scripting, but anything more complicated than a bunch of calls to other commands is doomed to become ugly and incomprehensible.
es: Las referencias en las instrucciones de acceso son cosas para un lenguaje real,los scripts de cmd son sólo un montón de extensiones que crecieron sobre el muy primitivo intérprete que era command.com,puedes hacer algunos scripts básicos,pero cualquier cosa más complicada que un montón de llamadas a otros comandos está condenada a convertirse en algo feo e incomprensible.
ja: 基本的なスクリプトを書くことはできますが、他のコマンドを呼び出すだけの複雑なものは、醜くて理解しにくいものになる運命にあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참조 / 인스턴스 / 구조는 실제 언어를위한 것입니다 .cmd 스크립팅은 command.com 인 매우 원시적 인 인터프리터에서 확장 된 확장 기능입니다. 기본적인 스크립팅을 수행 할 수는 있지만 다른 명령은 추악하고 이해할 수 없게 될 운명입니다.</font></font>
ru: Ссылки-инструкции-это материал для настоящего языка,командный скриптинг-это просто куча расширений,которые выросли по сравнению с очень примитивным интерпретатором,который был command.com,вы можете делать некоторые базовые скрипты,но что-либо более сложное,чем куча обращений к другим командам,обречено стать уродливым и непонятным.
zh_cn: Referencesinstancesstructs是真正的语言的东西,cmd脚本只是一堆在command.com这个非常原始的解释器上生长出来的扩展,你可以做一些基本的脚本,但任何比一堆调用其他命令更复杂的东西都注定会变得丑陋和不可理解。

source: Seriously speaking: I never heard that batch has arrays, maybe you can emulate them with some strange trick, but I wouldn't call it a good idea.
es: Hablando en serio:Nunca he oído que ese lote tenga matrices,tal vez puedas emularlas con algún truco extraño,pero no lo llamaría una buena idea.
ja: 真面目な話。バッチに配列があるなんて聞いたことがない、もしかしたら変な仕掛けでエミュレートできるかもしれないが、それを良いアイデアとは言わないだろう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">진지하게 말하면 : 배치에 배열이 있다고 들었습니다. 어쩌면 이상한 트릭으로 배열을 모방 할 수는 있지만 좋은 생각은 아닙니다.</font></font>
ru: Серьезно:Я никогда не слышал,чтобы у этой партии были массивы,может,ты сможешь эмулировать их каким-нибудь странным трюком,но я бы не назвал это хорошей идеей.
zh_cn: 认真地说。我没听说过那批有数组,也许你可以用一些奇怪的技巧来模拟,但我不会说这是个好主意。
