Repository: rueisnom/feedback
Catalog: xlf/10/16/63/86/10166386.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Similarly, you can use the same basic idea to create a struct-like set of variables like <code>ITEM_NAME, ITEM_DATA</code> or w/e. I even found <a href="http://www.robvanderwoude.com/battech_array.php">this link</a> that talks about simulating an associative array in CMD.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Del mismo modo, puede usar la misma idea b&aacute;sica para crear un conjunto de variables de estructura similar a </font></font> <code>ITEM_NAME, ITEM_DATA</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o w / e. </font><font style="vertical-align: inherit;">Incluso encontr&eacute; </font></font><a href="http://www.robvanderwoude.com/battech_array.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este enlace</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que habla sobre la simulaci&oacute;n de una matriz asociativa en CMD.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同様に、同じ基本的な考え方を使用して、</font></font> <code>ITEM_NAME, ITEM_DATA</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、w / e </font><font style="vertical-align: inherit;">などの構造体のような変数のセットを作成できます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">CMDでの連想配列のシミュレーションについて説明している</font></font><a href="http://www.robvanderwoude.com/battech_array.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このリンク</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も見つけました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">마찬가지로 동일한 기본 아이디어를 사용하여 </font></font> <code>ITEM_NAME, ITEM_DATA</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 w / e </font><font style="vertical-align: inherit;">와 같은 </font><font style="vertical-align: inherit;">구조 체형</font><font style="vertical-align: inherit;"> 변수 세트를 작성할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">나는 심지어 </font><font style="vertical-align: inherit;">CMD에서 연관 배열을 시뮬레이션하는 것에 대해 이야기하는 </font></font><a href="http://www.robvanderwoude.com/battech_array.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 링크</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">발견 </font><font style="vertical-align: inherit;">했습니다</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Точно так же вы можете использовать ту же основную идею для создания подобного структуре набора переменных, таких как </font></font> <code>ITEM_NAME, ITEM_DATA</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или w / e. </font><font style="vertical-align: inherit;">Я даже нашел </font></font><a href="http://www.robvanderwoude.com/battech_array.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту ссылку,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которая говорит об имитации ассоциативного массива в CMD.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同样，您可以使用相同的基本思想来创建一组类似于结构的变量，例如</font></font> <code>ITEM_NAME, ITEM_DATA</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或w / e。</font><font style="vertical-align: inherit;">我什至发现了</font></font><a href="http://www.robvanderwoude.com/battech_array.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个链接</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它讨论了如何在CMD中模拟关联数组。</font></font>

source: So for the code to work, you must get rid of the
es: Así que para que el código funcione,debes deshacerte de la
ja: そのため、コードを動作させるためには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 코드가 작동하려면</font></font>
ru: Так что для того,чтобы код сработал,вы должны избавиться от
zh_cn: 所以要想让代码发挥作用,你必须摆脱掉

source: So much more efficient. It allows array constructs to be Rapidly stored using:
es: Mucho más eficiente.Permite que las construcciones de arreglos se almacenen rápidamente usando:
ja: とても効率的です。これを使えば、配列構造体を高速に格納することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">훨씬 더 효율적입니다. </font><font style="vertical-align: inherit;">다음을 사용하여 배열 구성을 빠르게 저장할 수 있습니다.</font></font>
ru: Гораздо эффективнее.Это позволяет быстро хранить конструкции массива:
zh_cn: 如此一来,效率提高了很多。它允许使用数组构造快速存储使用。

source: So, I also want to know, does Cmd.exe have references or instances, structs etc?
es: Entonces,también quiero saber,¿el Cmd.exe tiene referencias o instancias,estructuras,etc.?
ja: そこで、私はまた、Cmd.exeは参照やインスタンス、構造体などを持っているかどうかを知りたいですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 Cmd.exe에 참조 또는 인스턴스, 구조체 등이 있습니까?</font></font>
ru: Итак,я также хочу знать,есть ли в Cmd.exe ссылки или экземпляры,структуры и т.д.?
zh_cn: 那么,我也想知道,Cmd.exe是否有引用或实例、结构等?

source: So, does it able in cmd.exe ( I mean: does in cmd.exe exist any array keywords? )
es: Entonces,¿puede en cmd.exe(Quiero decir:¿existe en cmd.exe alguna palabra clave de la matriz? )
ja: だから、それはcmd.exeでできるのですか(私が意味する:cmd.exeでは、任意の配列キーワードが存在するのですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 cmd.exe에서 가능합니까 (즉, cmd.exe에 배열 키워드가 있습니까?)</font></font>
ru: Итак,способен ли он в cmd.exe(я имею в виду:существуют ли в cmd.exe какие-либо ключевые слова массива?).
zh_cn: 那么,它是否能在cmd.exe中(我的意思是:cmd.exe中是否存在任何数组关键字?

source: Solution to the recursion level issue: Removal of the <code>Setlocal EnableDelayedExpansion</code> switch from the macro and turning Delayed expansion on prior to expanding the macro resolves this issue.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n al problema del nivel de recursi&oacute;n: la eliminaci&oacute;n del </font><font style="vertical-align: inherit;">conmutador </font></font> <code>Setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la macro y </font><font style="vertical-align: inherit;">la </font><font style="vertical-align: inherit;">activaci&oacute;n</font><font style="vertical-align: inherit;"> de la expansi&oacute;n retardada antes de expandir la macro resuelve este problema.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">再帰レベルの問題の解決策：</font><font style="vertical-align: inherit;">マクロから</font></font> <code>Setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スイッチを</font><font style="vertical-align: inherit;">削除</font><font style="vertical-align: inherit;">し、マクロを展開する前に遅延展開をオンにすると、この問題が解決します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">재귀 수준 문제에 대한 해결 방법 : </font><font style="vertical-align: inherit;">매크로에서 </font></font> <code>Setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 스위치를 제거하고 매크로를 확장하기 전에 지연 확장을 켜면이 문제가 해결됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение проблемы уровня рекурсии: удаление </font><font style="vertical-align: inherit;">переключателя </font></font> <code>Setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из макроса и включение отложенного расширения перед расширением макроса решает эту проблему.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">递归级别问题的解决方案：</font><font style="vertical-align: inherit;">从宏中</font><font style="vertical-align: inherit;">删除</font></font> <code>Setlocal EnableDelayedExpansion</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开关，并在扩展宏之前启用&ldquo;延迟扩展&rdquo;可以解决此问题。</font></font>

source: Take for instance a scenario where you need to log into multiple FTP servers, delete files older than X days from certain paths.
es: Tomemos,por ejemplo,un escenario en el que se necesita iniciar sesión en múltiples servidores FTP,eliminar archivos de más de X días de ciertas rutas.
ja: あなたが複数のFTPサーバーにログインする必要があるシナリオを例に挙げると、特定のパスからX日よりも古いファイルを削除します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 여러 FTP 서버에 로그인하고 특정 경로에서 X 일보다 오래된 파일을 삭제해야하는 시나리오를 생각해보십시오.</font></font>
ru: Возьмем,к примеру,сценарий,в котором вам нужно войти на несколько FTP-серверов,удалить файлы старше X дней с определенных путей.
zh_cn: 以某一场景为例,你需要登录多个FTP服务器,从特定路径中删除超过X天的文件。

source: The Macro increments counts for the class name and index name using those names as the variable for the count. Each time the macro is expanded for a given class name or index name, the value of that count will be incremented. Class names will be appended with the next class index number with each expansion. The first use of <code>Class</code> will become <code>Class[1]</code> the second <code>Class[2]</code> and so on. Index names should be different for each expansion of the macro for the sake of accurate referencing. Each element contained within a class name is assigned to it's own indexed value for the current class index. Eg <code>Class[1][1]</code><code>Class[1][2]</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los incrementos de macro cuentan para el nombre de clase y el nombre de &iacute;ndice utilizando esos nombres como la variable para el recuento. </font><font style="vertical-align: inherit;">Cada vez que la macro se expande para un nombre de clase o nombre de &iacute;ndice dado, el valor de ese recuento se incrementar&aacute;. </font><font style="vertical-align: inherit;">Los nombres de clase se agregar&aacute;n con el siguiente n&uacute;mero de &iacute;ndice de clase con cada expansi&oacute;n. </font><font style="vertical-align: inherit;">El primer uso de </font></font> <code>Class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se convertir&aacute; en </font></font> <code>Class[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la segunda </font></font> <code>Class[2]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y as&iacute; sucesivamente. </font><font style="vertical-align: inherit;">Los nombres de &iacute;ndice deben ser diferentes para cada expansi&oacute;n de la macro en aras de una referencia precisa. </font><font style="vertical-align: inherit;">Cada elemento contenido dentro de un nombre de clase se asigna a su propio valor indexado para el &iacute;ndice de clase actual. </font><font style="vertical-align: inherit;">Ej. </font></font> <code>Class[1][1]</code> <code>Class[1][2]</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マクロは、クラス名とインデックス名のカウントを、それらの名前をカウントの変数として使用して増分します。</font><font style="vertical-align: inherit;">マクロが特定のクラス名またはインデックス名に対して展開されるたびに、そのカウントの値が増加します。</font><font style="vertical-align: inherit;">クラス名には、展開ごとに次のクラスインデックス番号が付加されます。</font><font style="vertical-align: inherit;">最初の使用</font></font> <code>Class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">となるであろう</font></font> <code>Class[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第二</font></font> <code>Class[2]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などがあります。</font><font style="vertical-align: inherit;">正確な参照のために、インデックス名はマクロの展開ごとに異なる必要があります。</font><font style="vertical-align: inherit;">クラス名に含まれる各要素は、現在のクラスインデックスの独自のインデックス値に割り当てられます。</font><font style="vertical-align: inherit;">例：</font></font> <code>Class[1][1]</code> <code>Class[1][2]</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매크로는 클래스 이름과 인덱스 이름을 카운트 변수로 사용하여 클래스 이름과 인덱스 이름을 카운트합니다. </font><font style="vertical-align: inherit;">주어진 클래스 이름 또는 인덱스 이름에 대해 매크로가 확장 될 때마다 해당 카운트 값이 증가합니다. </font><font style="vertical-align: inherit;">클래스 이름에는 각 확장마다 다음 클래스 인덱스 번호가 추가됩니다. </font></font> <code>Class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">처음 사용할 때는 </font></font> <code>Class[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 두 번째 </font></font> <code>Class[2]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등이됩니다. </font><font style="vertical-align: inherit;">정확한 참조를 위해 매크로의 각 확장마다 인덱스 이름이 달라야합니다. </font><font style="vertical-align: inherit;">클래스 이름에 포함 된 각 요소는 현재 클래스 인덱스에 대한 자체 인덱스 값에 할당됩니다. </font><font style="vertical-align: inherit;">예를 들어 </font></font> <code>Class[1][1]</code> <code>Class[1][2]</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Макрос увеличивает счетчики для имени класса и имени индекса, используя эти имена в качестве переменной для счетчика. </font><font style="vertical-align: inherit;">Каждый раз, когда макрос раскрывается для заданного имени класса или имени индекса, значение этого числа будет увеличиваться. </font><font style="vertical-align: inherit;">К именам классов будет добавляться следующий индекс класса с каждым расширением. </font><font style="vertical-align: inherit;">Первое использование </font></font> <code>Class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> станет </font></font> <code>Class[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> второй </font></font> <code>Class[2]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и так далее. </font><font style="vertical-align: inherit;">Имена индексов должны быть разными для каждого расширения макроса для точной ссылки. </font><font style="vertical-align: inherit;">Каждому элементу, содержащемуся в имени класса, присваивается его собственное индексированное значение для текущего индекса класса. </font><font style="vertical-align: inherit;">Например, </font></font> <code>Class[1][1]</code> <code>Class[1][2]</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">宏使用这些名称作为计数变量来递增类名称和索引名称的计数。</font><font style="vertical-align: inherit;">每次为给定的类名或索引名扩展宏时，该计数的值都会增加。</font><font style="vertical-align: inherit;">每次扩展时，类名称都将附加下一个类索引号。</font></font> <code>Class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的第一次使用</font><font style="vertical-align: inherit;">将成为</font></font> <code>Class[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，第二个</font><font style="vertical-align: inherit;">成为</font></font> <code>Class[2]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，依此类推。</font><font style="vertical-align: inherit;">为了准确引用，每个宏扩展的索引名称都应该不同。</font><font style="vertical-align: inherit;">类名称中包含的每个元素都被分配给它自己的当前类索引的索引值。</font><font style="vertical-align: inherit;">例如</font></font> <code>Class[1][1]</code> <code>Class[1][2]</code>

source: The basis of the principle is that with the use of Call, A variable can be expanded at increasing levels of depth, until the variable is found to be empty. The limitation is in the line length limit, as the number of <code>%</code> expansions that need to be used to expand the variable increases proportionally to the number of Calls used to Parse over the variable for each level of expansion to be achieved.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La base del principio es que con el uso de Call, una variable se puede expandir a niveles de profundidad crecientes, hasta que la variable est&eacute; vac&iacute;a. </font><font style="vertical-align: inherit;">La limitaci&oacute;n est&aacute; en el l&iacute;mite de longitud de l&iacute;nea, ya que el n&uacute;mero de </font></font> <code>%</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> expansiones que deben usarse para expandir la variable aumenta proporcionalmente al n&uacute;mero de Llamadas utilizadas para analizar sobre la variable para cada nivel de expansi&oacute;n a alcanzar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原理の基礎は、Callを使用すると、変数が空であることがわかるまで、変数を深さのレベルを上げて拡張できることです。</font><font style="vertical-align: inherit;">変数を展開するために使用する必要</font><font style="vertical-align: inherit;">がある</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">展開の数は、達成される展開の各レベルで変数を解析するために使用される呼び出しの数に比例して増加するため、</font><font style="vertical-align: inherit;">制限は行の長さの制限に</font><font style="vertical-align: inherit;">あります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원리는 Call을 사용하여 변수가 비어있을 때까지 깊이를 증가시키면서 변수를 확장 할 수 있다는 것입니다. </font><font style="vertical-align: inherit;">변수를 확장하는 데 사용해야하는 </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 확장 수가 달성 될 각 확장 레벨에 대해 변수를 구문 분석하는 데 사용 된 호출 수에 비례하여 증가하므로 </font><font style="vertical-align: inherit;">한계는 라인 길이 제한 </font><font style="vertical-align: inherit;">에 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Основой этого принципа является то, что с помощью Call переменная может быть расширена с увеличением глубины, пока переменная не окажется пустой. </font><font style="vertical-align: inherit;">Ограничение заключается в ограничении длины строки, поскольку число </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> расширений, которое необходимо использовать для расширения переменной, увеличивается пропорционально количеству вызовов, используемых для анализа переменной для каждого уровня расширения, который должен быть достигнут.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该原理的基础是，通过使用Call，可以以增加的深度扩展变量，直到发现该变量为空。</font><font style="vertical-align: inherit;">限制在于行长度限制，因为</font><font style="vertical-align: inherit;">对于要实现的每个扩展级别，用于扩展变量的扩展</font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的数量与用于解析变量的调用的数量成比例地增加。</font></font>

source: The example Function provided assigns values to Array Indices using Call with a parameter for the element name - An unexpanded Variable that has previously been set with the values of all indices to be populated. The second parameter is used to define the index number for the Array being populated, and is associated with the Element name for future access of the Array.
es: La función de ejemplo que se proporciona asigna valores a los índices de matrices utilizando la llamada con un parámetro para el nombre del elemento-una variable no expandida que ha sido previamente establecida con los valores de todos los índices a ser poblados.El segundo parámetro se utiliza para definir el número de índice del Arreglo que se está poblando,y se asocia con el nombre del elemento para el acceso futuro del Arreglo.
ja: この関数の例では、要素名のパラメータを持つCallを使用して、配列のインデックスに値を代入します。2 番目のパラメータは、格納される配列のインデックス番号を定義するために使用され、将来の配列アクセスのために要素名と関連付けられます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제공된 함수 예제는 요소 이름에 대한 매개 변수와 함께 Call을 사용하여 값을 배열 색인에 지정합니다. 이전에 채워질 모든 색인의 값으로 설정된 확장되지 않은 변수입니다. </font><font style="vertical-align: inherit;">두 번째 매개 변수는 채워지는 어레이의 색인 번호를 정의하는 데 사용되며 나중에 어레이에 액세스하기위한 요소 이름과 연관됩니다.</font></font>
ru: В приведенном примере функция присваивает значения индексам массива с помощью вызова с параметром имени элемента-Незаданная переменная,которая ранее была установлена со значениями всех индексов,которые будут заполнены.Второй параметр используется для определения номера индекса для заполняемого массива и связан с именем элемента для будущего доступа к массиву.
zh_cn: 所提供的示例函数使用Call为数组索引分配值,该函数使用了一个元素名称的参数--一个未展开的变量,该变量之前已经设置了所有要填充的索引值。第二个参数用于定义被填充的数组的索引号,并与元素名相关联,以便将来访问数组时使用。

source: The example also demonstrates how to create and access nested arrays, as well as how to build strings for use in array population during For Loops.
es: El ejemplo también demuestra cómo crear y acceder a conjuntos anidados,así como cómo construir cuerdas para su uso en la población de conjuntos durante los For Loops.
ja: また、この例では、入れ子になった配列を作成してアクセスする方法や、For Loops の間に配列の母集団で使用するための文字列を作成する方法も示しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 예제는 또한 중첩 배열을 만들고 액세스하는 방법과 For 루프 동안 배열 채우기에 사용할 문자열을 작성하는 방법을 보여줍니다.</font></font>
ru: В примере также показано,как создавать вложенные массивы и получать к ним доступ,а также как строить строки для использования в заселении массивов во время циклов For Loops.
zh_cn: 该示例还演示了如何创建和访问嵌套数组,以及如何在For Loops期间建立字符串用于数组群集。
