Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: The prime factors of 10 are 5 and 2, so in base 10 we can represent any fraction of the form a/(2<sup>b</sup>5<sup>c</sup>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los factores primos de 10 son 5 y 2, por lo que en la base 10 podemos representar cualquier fracci&oacute;n de la forma a / (2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 5 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">c</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10の素因数は5と2であるため、base 10では、a /（2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 5 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">c</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">形式の任意の割合を表すことができ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10의 소인수는 5와 2이므로 밑 10에서 a / (2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 5 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">c</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">형식의 분수를 나타낼 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Первичные множители 10 равны 5 и 2, поэтому в базе 10 мы можем представить любую дробь вида a / (2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 5 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">c</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>

source: The sign is stored in the first component as a single bit. It's easy to explain: <code>0</code> means the float is a positive number; <code>1</code> means it's negative. Because <code>9.2</code> is positive, our sign value is <code>0</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El signo se almacena en el primer componente como un solo bit. </font><font style="vertical-align: inherit;">Es f&aacute;cil de explicar: </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa que el flotador es un n&uacute;mero positivo; </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa que es negativo. </font><font style="vertical-align: inherit;">Como </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es positivo, nuestro valor de signo es </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符号は、最初のコンポーネントに1ビットとして格納されます。</font><font style="vertical-align: inherit;">説明するのは簡単です</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、フロートが正の数であることを意味します。</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は負であることを意味します。</font><font style="vertical-align: inherit;">ので</font></font> <code>9.2</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">肯定的である、私たちの符号値は</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부호는 첫 번째 구성 요소에 단일 비트로 저장됩니다. </font><font style="vertical-align: inherit;">설명하기 쉽습니다. </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 부동 소수점이 양수임을 의미합니다. </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 음수임을 의미합니다. </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 양수 </font><font style="vertical-align: inherit;">이므로 </font><font style="vertical-align: inherit;">부호 값은 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Знак сохраняется в первом компоненте как один бит. </font><font style="vertical-align: inherit;">Это легко объяснить: </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает, что число с плавающей точкой является положительным числом; </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает, что это отрицательно. </font><font style="vertical-align: inherit;">Поскольку </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> положительно, наше значение знака равно </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: There are infinitely many real numbers (so many that you can't enumerate them), and there are infinitely many rational numbers (it is possible to enumerate them).
es: Hay infinitos números reales (tantos que no se pueden enumerar),y hay infinitos números racionales (es posible enumerarlos).
ja: 実数は無限にあり(列挙できないほど多い)、有理数は無限にある(列挙できる)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실수는 무한히 많고 (너무 많아서 열거 할 수 없음), 합리적인 수는 무한히 많습니다 (열거 가능합니다).</font></font>
ru: Существует бесконечно много вещественных чисел (их так много,что их нельзя перечислить),и бесконечно много рациональных чисел (их можно перечислить).

source: There's a lot of complexity behind that function, and it'd be quite the tangent to explain, but if you're interested, the important resource for our purposes is the <a href="http://docs.python.org/2/library/struct.html">struct</a> module.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay mucha complejidad detr&aacute;s de esa funci&oacute;n, y ser&iacute;a bastante tangente explicarlo, pero si le interesa, el recurso importante para nuestros prop&oacute;sitos es el </font><font style="vertical-align: inherit;">m&oacute;dulo de </font></font><a href="http://docs.python.org/2/library/struct.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">estructura</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この関数の背後には多くの複雑さがあり、説明するのはかなり難しいかもしれませんが、興味がある場合は、私たちの目的にとって重要なリソースは</font></font><a href="http://docs.python.org/2/library/struct.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">struct</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">モジュールです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 함수에는 많은 복잡성이 있으며 설명하는 것이 매우 중요하지만 관심이 있으시면 우리 목적의 중요한 자원은 </font></font><a href="http://docs.python.org/2/library/struct.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">struct</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 모듈입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У этой функции много сложностей, и ее было бы довольно сложно объяснить, но если вам интересно, важным ресурсом для наших целей является </font><font style="vertical-align: inherit;">модуль </font></font><a href="http://docs.python.org/2/library/struct.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">struct</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: This involves more than just a simple addition, because the bits stored in our third component actually represent the <em>fractional</em> part of the mantissa, to the right of the <a href="http://en.wiktionary.org/wiki/radix_point">radix point</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto implica m&aacute;s que una simple adici&oacute;n, porque los bits almacenados en nuestro tercer componente en realidad representan la </font><font style="vertical-align: inherit;">parte </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fraccional</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la mantisa, a la derecha del </font></font><a href="http://en.wiktionary.org/wiki/radix_point"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">punto de ra&iacute;z</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3番目のコンポーネントに格納されたビットは、実際に</font><font style="vertical-align: inherit;">は、</font><a href="http://en.wiktionary.org/wiki/radix_point"><font style="vertical-align: inherit;">基数ポイントの</font></a><font style="vertical-align: inherit;">右側の仮数の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">小数</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">部分を</font><font style="vertical-align: inherit;">表すため、これには単なる加算だけではありません</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세 번째 컴포넌트에 저장된 비트는 실제로 </font><font style="vertical-align: inherit;">가수 </font><a href="http://en.wiktionary.org/wiki/radix_point"><font style="vertical-align: inherit;">지점</font></a><font style="vertical-align: inherit;"> 의 오른쪽에있는 가수 </font><font style="vertical-align: inherit;">의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 부분을 </font><font style="vertical-align: inherit;">나타 내기 때문에 단순한 추가 이상이 필요 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">합니다</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это включает в себя нечто большее, чем простое сложение, потому что биты, хранящиеся в нашем третьем компоненте, на самом деле представляют </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">дробную</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> часть мантиссы, справа от </font></font><a href="http://en.wiktionary.org/wiki/radix_point"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">радикальной точки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: This isn't a full answer (<a href="https://stackoverflow.com/a/21895757/1072468">mhlester</a> already covered a lot of good ground I won't duplicate), but I would like to stress how much the representation of a number depends on the base you are working in.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta no es una respuesta completa ( </font></font><a href="https://stackoverflow.com/a/21895757/1072468"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mhlester</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ya cubri&oacute; mucho terreno bueno que no duplicar&eacute;), pero me gustar&iacute;a enfatizar cu&aacute;nto depende la representaci&oacute;n de un n&uacute;mero de la base en la que est&aacute; trabajando.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは完全な答えではありませんが（</font></font><a href="https://stackoverflow.com/a/21895757/1072468"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mhlesterは</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すでに重複しない多くの優れた理由をカバーしてい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">）、数値の表現が作業している基数にどれだけ依存するかを強調したいと思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 완전한 대답은 아닙니다 ( </font></font><a href="https://stackoverflow.com/a/21895757/1072468"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mhlester는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이미 복제하지 않을 좋은 근거를 많이 다루었습니다).하지만 숫자의 표현은 작업중인베이스에 얼마나 의존하는지 강조하고 싶습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не полный ответ ( </font></font><a href="https://stackoverflow.com/a/21895757/1072468"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mhlester</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> уже охватил много хороших вопросов, которые я не буду дублировать), но я хотел бы подчеркнуть, насколько представление числа зависит от базы, на которой вы работаете.</font></font>

source: To drive this point home, let's look at 1/2. It might surprise you that even though this perfectly simple number has an exact representation in base 10 and 2, it requires a repeating representation in base 3.
es: Para llevar este punto a casa,veamos el 12.Te sorprenderá que aunque este número perfectamente simple tiene una representación exacta en la base 10 y 2,requiere una representación repetida en la base 3.
ja: このポイントをおさらいするために、12を見てみましょう。驚くかもしれませんが、この完全に単純な数は基数10と基数2で正確に表現されていますが、基数3では繰り返し表現が必要になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 지점을 집으로 몰아 가려면 1/2을 봅시다. </font><font style="vertical-align: inherit;">이 완벽하게 간단한 숫자가 10과 2의 정확한 표현이지만, 3의 반복 표현이 필요하다는 사실에 놀랄 것입니다.</font></font>
ru: Чтобы отвезти эту точку домой,давайте посмотрим на 12.Вас может удивить,что хотя это совершенно простое число имеет точное представление в базе 10 и 2,оно требует повторяющегося представления в базе 3.

source: Try this
es: Pruebe esto.
ja: これを試してみてください
ko: 이 시도
ru: Попробуйте это

source: Turn negative exponent into division:
es: Convierte el exponente negativo en división:
ja: 負の指数を除算に変える
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">음의 지수를 나누기 :</font></font>
ru: Превратите отрицательный показатель в деление:

source: When dealing with decimal numbers, we "move the decimal point" by multiplying or dividing by powers of 10. In binary, we can do the same thing by multiplying or dividing by powers of 2. Since our third element has 52 bits, we divide it by <strong>2<sup>52</sup></strong> to move it 52 places to the right:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando tratamos con n&uacute;meros decimales, "movemos el punto decimal" multiplicando o dividiendo por potencias de 10. En binario, podemos hacer lo mismo multiplicando o dividiendo por potencias de 2. Dado que nuestro tercer elemento tiene 52 bits, dividimos por </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">52</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para moverlo 52 lugares a la derecha:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10進数を処理する場合、10の累乗で乗算または除算して「小数点を移動」します。2進数では、2の累乗で乗算または除算することで同じことができます。3番目の要素には52ビットがあるため、その</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">52は、</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それを右に52の場所を移動するには：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">십진수를 다룰 때, 우리는 10의 거듭 제곱으로 곱하거나 나눔으로써 "소수점을 움직입니다". 이진수로, 우리는 2의 거듭 제곱으로 나눠서 같은 일을 할 수 있습니다. 하여 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(52)는</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그것을 오른쪽으로 52 곳을 이동합니다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имея дело с десятичными числами, мы &laquo;перемещаем десятичную точку&raquo; путем умножения или деления на степени 10. В двоичном коде мы можем сделать то же самое, умножив или разделив на степени 2. Поскольку наш третий элемент имеет 52 бита, мы делим это на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">52,</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы переместить это 52 места вправо:</font></font>

source: When we call that function with our example, <code>9.2</code>, here's what we get:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando llamamos a esa funci&oacute;n con nuestro ejemplo, </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , esto es lo que obtenemos:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この例の</font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でこの</font><font style="vertical-align: inherit;">関数を呼び出すと</font><font style="vertical-align: inherit;">、次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예제 </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">해당 함수를 호출하면 다음과 </font><font style="vertical-align: inherit;">같이 얻을 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда мы вызываем эту функцию в нашем примере </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы получаем следующее:</font></font>
