Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: Because often-times, they are approximating rationals that cannot be represented finitely in base 2 (the digits repeat), and in general they are approximating real (possibly irrational) numbers which may not be representable in finitely many digits in <em>any</em> base.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que a menudo son aproximaciones racionales que no se pueden representar de manera finita en la base 2 (se repiten los d&iacute;gitos), y en general se est&aacute;n aproximando a n&uacute;meros reales (posiblemente irracionales) que pueden no ser representables en muchos d&iacute;gitos en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> base.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くの場合、それらは、基数2（数字が繰り返される）で有限に表現できない有理数を概算し、一般に、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基数の</font><font style="vertical-align: inherit;">有限な数で表現できない可能性のある実数（無理数）を概算しています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">종종, 그들은 밑수 2 (숫자 반복)에서 유한하게 표현 될 수없는 합리적 근사치이며, 일반적으로 그것들은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임의의</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 밑수 </font><font style="vertical-align: inherit;">에서 유한하게 많은 숫자로 표현할 수없는 실제 (비합리적) 수에 근사 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Потому что часто они являются приближенными рациональными числами, которые невозможно представить конечным образом в базе 2 (повторение цифр), и в целом они являются приближенными действительными (возможно, иррациональными) числами, которые не могут быть представлены в конечном числе цифр в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">любой</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> базе.</font></font>

source: Binary to decimal:
es: Binario a decimal:
ja: 2進数から10進数へ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이진수를 십진수로 :</font></font>
ru: Двоичные до десятичных:

source: But of course you would still run into the same kind of trouble when <code>pi</code>, <code>sqrt</code>, <code>log</code>, <code>sin</code>, etc. are involved.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero, por supuesto, a&uacute;n se encontrar&iacute;a con el mismo tipo de problemas cuando </font><font style="vertical-align: inherit;">est&aacute;n involucrados </font></font> <code>pi</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sqrt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、もちろん、</font></font> <code>pi</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>sqrt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>log</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>sin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などが関係している</font><font style="vertical-align: inherit;">場合でも、同じような問題が発生し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 </font></font> <code>pi</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sqrt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등이 관련 </font><font style="vertical-align: inherit;">될 때 여전히 같은 종류의 문제가 발생 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но, конечно, вы все равно столкнетесь с такими же проблемами, когда </font><font style="vertical-align: inherit;">задействованы </font></font> <code>pi</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sqrt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sin</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д.</font></font>

source: Calculating the Number
es: Calculando el número
ja: 数の計算
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 계산</font></font>
ru: Вычисление числа

source: Consider the fraction 2/3
es: Considere la fracción 23
ja: 分数23を考える
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분수 2/3를 고려하십시오</font></font>
ru: Рассмотрим дробь 23

source: Convert to decimal:
es: Conviértelo a decimal:
ja: 10進数に変換します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">십진수로 변환 :</font></font>
ru: Преобразовать в десятичную дробь:

source: Exponent (middle component): Subtract <strong>2<sup>(# of bits) - 1</sup> - 1</strong> to get the true exponent
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Exponente (componente medio): reste </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(# de bits) - 1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener el verdadero exponente</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指数（中間部品）：減算</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（ビット数）1 -</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1 -</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真の指数を取得します</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수 (중간 구성 요소) : 빼기 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(비트 수) 1 -</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 진정한 지수를 얻을 수 있습니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Экспонента (средний компонент): вычтите </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(количество бит) - 1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить истинную экспоненту</font></font>

source: First, a few functions to <em>see</em> the components that make a 32- and 64-bit <code>float</code>. Gloss over these if you only care about the output (example in Python):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Primero, algunas funciones para </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ver</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> los componentes que forman un </font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 32 y 64 bits </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Pase por alto estos si solo le importa la salida (ejemplo en Python):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まず、</font><font style="vertical-align: inherit;">32ビットと64ビットを</font> <code>float</code> <font style="vertical-align: inherit;">するコンポーネント</font><font style="vertical-align: inherit;">を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">確認</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する</font><font style="vertical-align: inherit;">ためのいくつかの関数</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">出力（Pythonの例）のみに関心がある場合は、これらをグロスします。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 </font><font style="vertical-align: inherit;">32 비트 및 64 비트 </font> <code>float</code> <font style="vertical-align: inherit;"> 를 만드는 구성 요소를 확인 </font><font style="vertical-align: inherit;">하는 몇 가지 기능이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">출력에만 관심이 있다면 (파이썬의 예) 다음과 같이 광택을 내십시오.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во-первых, несколько функций, чтобы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">увидеть</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> компоненты, которые делают 32- и 64-битные числа с </font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если вы заботитесь только о выходных данных (например, в Python), добавьте их в список:</font></font>

source: Floating Point Binary
es: Punto flotante binario
ja: 浮動小数点二進法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 이진</font></font>
ru: Двоичная система с плавающей точкой

source: Floating point numbers are (simplifying slightly) a positional numbering system with a restricted number of digits and a movable radix point.
es: Los números de punto flotante son (simplificando ligeramente)un sistema de numeración posicional con un número restringido de dígitos y un punto de radix móvil.
ja: 浮動小数点数は、(少し単純化して)制限された桁数と移動可能な基数点を持つ位置番号付けシステムです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 숫자는 제한된 자릿수와 기수를 가진 위치 번호 시스템입니다 (약간 단순화).</font></font>
ru: Числа с плавающей точкой-это (слегка упрощающая)система позиционной нумерации с ограниченным числом цифр и подвижной точкой радиуса.

source: For example, the decimal number <code>9.2</code> can be expressed exactly as a ratio of two decimal integers (<code>92/10</code>), both of which can be expressed exactly in binary (<code>0b1011100/0b1010</code>). However, the same ratio stored as a floating point number is never exactly equal to <code>9.2</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, el n&uacute;mero decimal </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede expresar exactamente como una relaci&oacute;n de dos enteros decimales ( </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), que se pueden expresar exactamente en binario ( </font></font> <code>0b1011100/0b1010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Sin embargo, la misma proporci&oacute;n almacenada como un n&uacute;mero de coma flotante nunca es exactamente igual a </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例えば、小数点数</font></font> <code>9.2</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2進整数（の比として正確に表すことができる</font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バイナリ（正確に表現することができ、どちらも）、</font></font> <code>0b1011100/0b1010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">ただし、浮動小数点数として保存された同じ比率が</font></font> <code>9.2</code> に完全<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に等しくなることはありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, 10 진수 </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 2 개의 10 진수 정수 ( </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">의 비율로 정확하게 표현 될 수 있으며 </font><font style="vertical-align: inherit;">, 둘 모두 2 진 ( </font></font> <code>0b1011100/0b1010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )으로 </font><font style="vertical-align: inherit;">정확하게 표현 될 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 부동 소수점 숫자로 저장된 동일한 비율은 </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 정확히 동일하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, десятичное число </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может быть выражено точно как отношение двух десятичных целых чисел ( </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), оба из которых могут быть выражены точно в двоичном виде ( </font></font> <code>0b1011100/0b1010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Однако, то же самое отношение, сохраненное как число с плавающей запятой, никогда точно не равно </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: For hardware accelerated arithmetic only a limited amount of rational numbers can be represented. Every not-representable number is approximated. Some numbers (i.e. irrational) can never be represented no matter the system.
es: Para la aritmética acelerada por hardware sólo se puede representar una cantidad limitada de números racionales.Cada número no representable es aproximado.Algunos números (es decir,irracionales)nunca pueden ser representados sin importar el sistema.
ja: ハードウェアで高速化された算術では、限られた量の有理数しか表現できません。表現できないすべての数は近似されます。いくつかの数(すなわち非合理的な数)は、どのようなシステムであっても表現することができません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하드웨어 가속 산술의 경우 제한된 양의 합리적인 숫자 만 나타낼 수 있습니다. </font><font style="vertical-align: inherit;">표현할 수없는 모든 수는 근사치입니다. </font><font style="vertical-align: inherit;">시스템에 관계없이 일부 숫자 (즉, 비이성적)는 표현할 수 없습니다.</font></font>
ru: Для аппаратной ускоренной арифметики может быть представлено только ограниченное количество рациональных чисел.Каждое непрезентабельное число аппроксимируется.Некоторые числа (т.е.иррациональные)никогда не могут быть представлены независимо от системы.

source: Further reading
es: Más lecturas
ja: 続きを読む
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추가 자료</font></font>
ru: Дополнительное чтение

source: How can such an apparently simple number be "too big" to express in <strong>64 bits</strong> of memory?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo puede un n&uacute;mero aparentemente simple ser "demasiado grande" para expresarlo en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64 bits</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de memoria?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのように見える単純な数が</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64ビット</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のメモリで</font><font style="vertical-align: inherit;">表現するには「大きすぎる」の</font><font style="vertical-align: inherit;">はなぜでしょうか。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64 비트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 메모리 </font><font style="vertical-align: inherit;">에서 표현하기에 그렇게 단순한 숫자가 어떻게 "너무 클"수 </font><font style="vertical-align: inherit;">있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как такое простое число может быть &laquo;слишком большим&raquo;, чтобы его можно было выразить в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64 битах</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> памяти?</font></font>

source: However the big problem is that such a format is a pain to do calculations on. For two reasons.
es: Sin embargo,el gran problema es que tal formato es un dolor para hacer cálculos.Por dos razones.
ja: しかし、大きな問題は、このような形式で計算をするのは面倒だということです。理由は2つあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 큰 문제는 이러한 형식이 계산하기가 어렵다는 것입니다. </font><font style="vertical-align: inherit;">두 가지 이유가 있습니다.</font></font>
ru: Однако большая проблема заключается в том,что такой формат является занудой для вычислений.По двум причинам.

source: If after your calculation you end up with an unrepresentable result because the numerator or denominator you need to find the closest representable result. This is non-trivil.
es: Si después de tu cálculo terminas con un resultado no representable porque el numerador o denominador que necesitas para encontrar el resultado representable más cercano.Esto no es un trivial.
ja: あなたの計算の後、分子または分母が最も近い表現可能な結果を見つける必要があるので、あなたは表現不可能な結果で終わる場合。これは非代表的なものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계산 후 분자 또는 분모 때문에 표현할 수없는 결과가 나오면 가장 가까운 표현 가능한 결과를 찾아야합니다. </font><font style="vertical-align: inherit;">이것은 사소한 일이 아닙니다.</font></font>
ru: Если после вычисления вы получите непрезентабельный результат из-за того,что числитель или знаменатель вам необходимо найти наиболее близкий к представлению результат.Это не тривиль.

source: If you want to have exactly one representation of each number then after each calculation you need to reduce the fraction to it's lowest terms. That means that for every operation you basically need to do a greatest common divisor calculation.
es: Si quieres tener exactamente una representación de cada número,entonces después de cada cálculo necesitas reducir la fracción a sus términos más bajos.Eso significa que para cada operación necesitas básicamente hacer un cálculo de divisor común mayor.
ja: 各数値を正確に 1 つの表現にしたい場合は、各計算の後に分数を最小の項に減らす必要があります。つまり、すべての演算で基本的に最大公約数の計算を行う必要があるということです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 숫자를 정확히 하나의 표현으로 나타내려면 각 계산 후에 분수를 가장 낮은 항으로 줄여야합니다. </font><font style="vertical-align: inherit;">즉, 모든 연산에 대해 기본적으로 가장 큰 제수 계산을 수행해야합니다.</font></font>
ru: Если вы хотите иметь ровно одно представление каждого числа,то после каждого вычисления вам нужно уменьшить дробь до ее наименьших членов.Это означает,что для каждой операции Вам,в основном,необходимо выполнять наибольшее общее вычисление делителя.
