Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: In decimal notation, that's the same as dividing <code>675539944105574</code> by <code>4503599627370496</code> to get <code>0.1499999999999999</code>. (This is one example of a ratio that can be expressed exactly in binary, but only approximately in decimal; for more detail, see: <a href="http://www.wolframalpha.com/input/?i=675539944105574+%2F+4503599627370496">675539944105574 / 4503599627370496</a>.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En notaci&oacute;n decimal, es lo mismo que dividir </font></font> <code>675539944105574</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por </font></font> <code>4503599627370496</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener </font></font> <code>0.1499999999999999</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(Este es un ejemplo de una relaci&oacute;n que se puede expresar exactamente en binario, pero solo aproximadamente en decimal; para m&aacute;s detalles, consulte: </font></font><a href="http://www.wolframalpha.com/input/?i=675539944105574+%2F+4503599627370496"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">675539944105574/4503599627370496</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10進表記では、これは</font></font> <code>675539944105574</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>4503599627370496</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">割っ</font><font style="vertical-align: inherit;">て</font><font style="vertical-align: inherit;">0.1499999999999999</font><font style="vertical-align: inherit;">を得るのと</font></font> <code>0.1499999999999999</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">（これは、正確に2進数で表現できる比率の1つの例ですが、おおよそ10進数でのみです。詳細については、</font></font><a href="http://www.wolframalpha.com/input/?i=675539944105574+%2F+4503599627370496"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">675539944105574/4503599627370496を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10 진법으로, 그 분할과 동일합니다 </font></font> <code>675539944105574</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하여 </font></font> <code>4503599627370496</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 얻을 </font></font> <code>0.1499999999999999</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(이것은 이진수로 정확하게 표현 될 수 있지만 대략 10 진수로만 표현 될 수있는 비율의 한 예입니다. 자세한 내용은 </font></font><a href="http://www.wolframalpha.com/input/?i=675539944105574+%2F+4503599627370496"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">675539944105574/4503599627370496을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В десятичной записи это то же самое, что деление </font></font> <code>675539944105574</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>4503599627370496</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для получения </font></font> <code>0.1499999999999999</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(Это один пример соотношения, которое может быть выражено точно в двоичном формате, но только приблизительно в десятичном виде; более подробно см. </font></font><a href="http://www.wolframalpha.com/input/?i=675539944105574+%2F+4503599627370496"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">675539944105574/4503599627370496</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .)</font></font>

source: In good-ol' base 10, we typically write it out as something like
es: En la base 10 de "good-ol",típicamente lo escribimos como algo como
ja: 古き良きベース10では、一般的には次のように書き出します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">good-ol 'base 10에서는 일반적으로 다음과 같이 작성합니다.</font></font>
ru: В базе 10 "Гуд-ол" мы обычно выписываем это как что-то вроде

source: In most programming languages, floating point numbers are represented a lot like <a href="http://en.wikipedia.org/wiki/Scientific_notation">scientific notation</a>: with an exponent and a mantissa (also called the significand). A very simple number, say <code>9.2</code>, is actually this fraction:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En la mayor&iacute;a de los lenguajes de programaci&oacute;n, los n&uacute;meros de coma flotante se representan de manera muy similar a </font></font><a href="http://en.wikipedia.org/wiki/Scientific_notation"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la notaci&oacute;n cient&iacute;fica</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : con un exponente y una mantisa (tambi&eacute;n llamada significado). </font><font style="vertical-align: inherit;">Un n&uacute;mero muy simple, digamos </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es en realidad esta fracci&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ほとんどのプログラミング言語では、浮動小数点数は</font><font style="vertical-align: inherit;">指数</font></font><a href="http://en.wikipedia.org/wiki/Scientific_notation"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表記</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と仮数（仮数とも呼ばれる）を使用して、</font><font style="vertical-align: inherit;">科学表記法と</font><font style="vertical-align: inherit;">よく似てい</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">非常に単純な数値、たとえば</font></font> <code>9.2</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、実際には次の割合です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 프로그래밍 언어에서 부동 소수점 숫자는 </font></font><a href="http://en.wikipedia.org/wiki/Scientific_notation"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">과학적 표기법</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 비슷하게 </font><font style="vertical-align: inherit;">표현됩니다</font><font style="vertical-align: inherit;"> . 지수와 가수 (의미라고도 함). </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font><font style="vertical-align: inherit;">같은 매우 간단한 숫자 </font><font style="vertical-align: inherit;">는 실제로이 분수입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В большинстве языков программирования числа с плавающей запятой представлены во многом как </font></font><a href="http://en.wikipedia.org/wiki/Scientific_notation"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">научная нотация</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : с показателем степени и мантиссой (также называемой значением). </font><font style="vertical-align: inherit;">Очень простое число, скажем </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , на самом деле это дробь:</font></font>

source: In other words, we have an exact, finite representation for the same number by switching bases! The take-away is that even though you can convert any number to any base, <em>all rational numbers have exact finite representations in some bases but not in others</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En otras palabras, &iexcl;tenemos una representaci&oacute;n exacta y finita para el mismo n&uacute;mero cambiando de base! </font><font style="vertical-align: inherit;">La conclusi&oacute;n es que, aunque puede convertir cualquier n&uacute;mero a cualquier base, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todos los n&uacute;meros racionales tienen representaciones finitas exactas en algunas bases pero no en otras</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、基数を切り替えることで、同じ数を正確かつ有限に表現できます。</font><font style="vertical-align: inherit;">要点は、任意の数値を任意の基数に変換できても、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての有理数は、一部の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基数で</font><em><font style="vertical-align: inherit;">は正確な有限表現を持ち</font></em><font style="vertical-align: inherit;">、他の基数で</font><em><font style="vertical-align: inherit;">はそうではないということ</font></em><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다시 말해, 우리는 밑을 바꾸어 같은 숫자에 대해 정확하고 유한 한 표현을합니다! </font><font style="vertical-align: inherit;">테이크 아웃은 어떤 숫자를 어떤 염기로 변환 할 수 있지만 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 합리적인 숫자는 어떤 염기에서는 정확한 유한 표현을하지만 다른 것은 아닙니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другими словами, мы имеем точное, конечное представление для того же числа путем переключения баз! </font><font style="vertical-align: inherit;">Вывод состоит в том, что даже если вы можете преобразовать любое число в любое основание, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">все рациональные числа имеют точные конечные представления в одних основаниях, но не в других</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Interpreting the Data
es: Interpretación de los datos
ja: データの解釈
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터 해석</font></font>
ru: Интерпретация данных

source: It would certainly be possible to define a fraction format, with (for example) a 32-bit numerator and a 32-bit denominator. It would be able to represent numbers that IEEE double precision floating point could not, but equally there would be many numbers that can be represented in double precision floating point that could not be represented in such a fixed-size fraction format.
es: Ciertamente sería posible definir un formato de fracción,con (por ejemplo)un numerador de 32 bits y un denominador de 32 bits.Sería capaz de representar números que el IEEE en coma flotante de doble precisión no podría,pero igualmente habría muchos números que pueden ser representados en coma flotante de doble precisión que no podrían ser representados en un formato de fracción de tamaño fijo.
ja: 確かに、(例えば)32ビットの分子と32ビットの分母を持つ分数形式を定義することは可能でしょう。IEEE倍精度浮動小数点では表現できない数を表現することができますが、倍精度浮動小数点で表現できる数の中には、このような固定サイズの分数形式では表現できない数もたくさんあるでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 32 비트 분자와 32 비트 분모를 사용하여 분수 형식을 정의 할 수 있습니다. </font><font style="vertical-align: inherit;">IEEE 배정 밀도 부동 소수점으로는 불가능한 숫자를 나타낼 수 있지만, 배정도 부동 소수점으로 표현할 수있는 숫자는 고정 크기 분수 형식으로 표현할 수없는 숫자가 될 수 있습니다.</font></font>
ru: Конечно,можно было бы определить формат дроби,например,с 32-разрядным числителем и 32-разрядным знаменателем.Можно было бы представлять числа,которые не могли бы быть представлены в IEEE с плавающей точкой двойной точности,но в равной степени было бы много чисел,которые можно было бы представлять в формате с плавающей точкой двойной точности,которые не могли бы быть представлены в таком формате дробей с фиксированным размером.

source: Mantissa (also called Significand, or Fraction)
es: Mantisa (también llamada Significante,o Fracción)
ja: マンティッサ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가수 (Significand 또는 분수라고도 함)</font></font>
ru: Мантисса (также называется Significand,или Fraction)

source: Mantissa (last component): Divide by <strong>2<sup>(# of bits)</sup></strong> and add <code>1</code> to get the true mantissa
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mantissa (&uacute;ltimo componente): divida entre </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(# de bits)</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y agregue </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener la verdadera mantisa</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仮数（最後のコンポーネント）：</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（ビット数）で</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除算し</font><font style="vertical-align: inherit;">、</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">加算</font><font style="vertical-align: inherit;">して真の仮数を取得します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가수 (마지막 구성 요소) : 나누기 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(비트 수)</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 추가 </font></font> <code>1</code> 은<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 진정한 가수를 얻을 수 있습니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мантисса (последний компонент): разделите на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(количество бит)</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и добавьте </font></font> <code>1</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить истинную мантиссу</font></font>

source: Multiply exponent:
es: Multiplica el exponente:
ja: 指数を乗算します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수를 곱하십시오 :</font></font>
ru: Умножь экспоненту:

source: Negative exponent to division:
es: Exponente negativo a la división:
ja: 除算に負の指数。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나누기의 음수 지수 :</font></font>
ru: Отрицательный показатель по подразделению:

source: Now that we've built the number, it's possible to reconstruct it into a simple fraction:
es: Ahora que hemos construido el número,es posible reconstruirlo en una simple fracción:
ja: 数ができたので、単純な分数に再構築することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 숫자를 만들었으므로 간단한 분수로 재구성 할 수 있습니다.</font></font>
ru: Теперь,когда мы построили число,можно реконструировать его в простую фракцию:

source: Now that we've transformed the third component into a fractional number, adding <code>1</code> gives the true mantissa.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora que hemos transformado el tercer componente en un n&uacute;mero fraccionario, sumar </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> da la verdadera mantisa.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3番目のコンポーネントを小数に変換したので、</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">追加</font><font style="vertical-align: inherit;">すると真の仮数が得られます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 세 번째 구성 요소를 소수로 변환 했으므로 </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">하면 진정한 가수가됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь, когда мы преобразовали третий компонент в дробное число, добавление </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> дает истинную мантиссу.</font></font>

source: Number bases
es: Bases de números
ja: 拠点数
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수베이스</font></font>
ru: Числовые базы

source: On the other hand the only prime factor of 2 is 2, so in base 2 we can only represent fractions of the form a/(2<sup>b</sup>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por otro lado, el &uacute;nico factor primo de 2 es 2, por lo que en base 2 solo podemos representar fracciones de la forma a / (2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、2の唯一の素因数は2であるため、ベース2では、a /（2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">形式の分数しか表現できません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면에 2의 유일한 소인수는 2이므로 밑이 2 인 경우 a / (2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">b</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) </font><font style="vertical-align: inherit;">형식의 분수 만 나타낼 수 있습니다</font></font>

source: Putting all three parts together, we're given this binary number:
es: Al juntar las tres partes,se nos da este número binario:
ja: 3つのパーツを合わせると、この2進数になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세 부분을 모두 합하면이 이진수가 부여됩니다.</font></font>
ru: Складывая все три части вместе,мы получаем это двоичное число:

source: Python's <code>float</code> is a 64-bit, double-precision number. In other languages such as C, C++, Java and C#, double-precision has a separate type <code>double</code>, which is often implemented as 64 bits.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Python </font><font style="vertical-align: inherit;">es un n&uacute;mero de doble precisi&oacute;n de 64 bits. </font><font style="vertical-align: inherit;">En otros lenguajes como C, C ++, Java y C #, la precisi&oacute;n doble tiene un tipo </font></font> <code>double</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> separado </font><font style="vertical-align: inherit;">, que a menudo se implementa como 64 bits.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pythonの</font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は64ビットの倍精度数です。</font><font style="vertical-align: inherit;">C、C ++、Java、C＃などの他の言語では、倍精度には別の型</font></font> <code>double</code> があり<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、これは多くの場合64ビットとして実装されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파이썬의 </font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 64 비트, 배정 밀도 숫자입니다. </font><font style="vertical-align: inherit;">C, C ++, Java 및 C #과 같은 다른 언어에서는 배정 밀도가 별도의 유형 </font></font> <code>double</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가지며 </font><font style="vertical-align: inherit;">종종 64 비트로 구현됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Число </font><font style="vertical-align: inherit;">с </font></font> <code>float</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Python </font><font style="vertical-align: inherit;">- это 64-разрядное число с двойной точностью. </font><font style="vertical-align: inherit;">В других языках, таких как C, C ++, Java и C #, двойная точность имеет отдельный тип </font></font> <code>double</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который часто реализуется как 64-битный.</font></font>

source: Recapping the Components
es: Recapitulando los componentes
ja: コンポーネントのまとめ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성 요소 리 캐핑</font></font>
ru: Получение компонентов

source: Representing as a Fraction
es: Representando como una fracción
ja: 分数として表現する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분수로 표현</font></font>
ru: Представление как фракция

source: Seeing the Data
es: Viendo los datos
ja: データを見る
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터보기</font></font>
ru: Просмотр данных

source: Shift mantissa to a whole number:
es: Cambie la mantisa a un número entero:
ja: mantissaを整数にシフトします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가수를 정수로 이동하십시오.</font></font>
ru: Сдвиньте мантиссу на целое число:

source: Shift the decimal point:
es: Cambie el punto decimal:
ja: 小数点をシフトします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소수점을 이동하십시오.</font></font>
ru: Сдвиньте десятичную точку:
