Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: Sign (first component): <code>0</code> for positive, <code>1</code> for negative
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Signo (primer componente): </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para positivo, </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para negativo</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">符号（最初のコンポーネント）：</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は正、</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は負</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부호 (첫 번째 구성 요소) : </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 양수, </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 음수</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Знак (первый компонент): </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для положительного, </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для отрицательного</font></font>

source: So here's where number bases are crutial. If we were trying to represent 2/3 in base 3, then
es: Así que aquí es donde las bases de los números son cruciales.Si tratáramos de representar 23 en la base 3,entonces
ja: ここで数字のベースが重要になってきます。23をベース3で表現しようとすると
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 숫자의 기초가 중요합니다. </font><font style="vertical-align: inherit;">베이스 3에서 2/3를 나타내려고한다면</font></font>
ru: Итак,вот где базы номеров-круизные.Если мы пытались представить 23 в базе 3,то

source: Some Languages do offer fraction types, but usually they do it in combination with arbitary precision, this avoids needing to worry about approximating fractions but it creates it's own problem, when a number passes through a large number of calculation steps the size of the denominator and hence the storage needed for the fraction can explode.
es: Algunos lenguajes ofrecen tipos de fracciones,pero generalmente lo hacen en combinación con la precisión arbórea,esto evita tener que preocuparse por aproximar las fracciones pero crea su propio problema,cuando un número pasa por un gran número de pasos de cálculo el tamaño del denominador y por lo tanto el almacenamiento necesario para la fracción puede explotar.
ja: いくつかの言語では分数型を提供していますが、通常は任意の精度と組み合わせて提供しています。これにより、分数の近似を心配する必要はありませんが、それ自体に問題があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 언어는 분수 유형을 제공하지만 일반적으로 임의 정밀도와 조합하여 사용하므로 분수 근사에 대해 걱정할 필요는 없지만 숫자가 많은 수의 계산 단계를 거쳐 분모의 크기와 따라서 분수에 필요한 저장 공간이 폭발 할 수 있습니다.</font></font>
ru: Некоторые Языки действительно предлагают типы дроби,но обычно они делают это в сочетании с произвольной точностью,это позволяет избежать необходимости беспокоиться об аппроксимации дроби,но это создает свою собственную проблему,когда число проходит через большое количество шагов вычисления размер знаменателя и,следовательно,хранение,необходимое для дроби может взорваться.

source: Some languages also offer decimal floating point types, these are mainly used in scenarios where it is imporant that the results the computer gets match pre-existing rounding rules that were written with humans in mind (chiefly financial calculations). These are slightly more difficult to work with than binary floating point, but the biggest problem is that most computers don't offer hardware support for them.
es: Algunos idiomas también ofrecen tipos de coma flotante decimal,que se utilizan principalmente en escenarios en los que es importante que los resultados que obtiene la computadora coincidan con las reglas de redondeo preexistentes que se escribieron teniendo en cuenta a los humanos (principalmente cálculos financieros).Es ligeramente más difícil trabajar con ellos que con la coma flotante binaria,pero el mayor problema es que la mayoría de las computadoras no ofrecen soporte de hardware para ellos.
ja: 一部の言語では、10進数の浮動小数点型も提供していますが、これは主に、コンピュータが取得する結果が、人間を念頭に置いて書かれた既存の丸めルールと一致することが重要な場合に使用されます(主に金融計算)。これらは、2 進浮動小数点型よりも作業がやや困難ですが、最大の問題は、ほとんどのコンピュータがハードウェアでサポートしていないことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 언어는 10 진수 부동 소수점 유형도 제공하는데, 이는 주로 컴퓨터가 사람을 염두에두고 작성된 기존 반올림 규칙 (주로 재무 계산)과 일치하는 것이 중요하지 않은 시나리오에서 사용됩니다. </font><font style="vertical-align: inherit;">이것들은 바이너리 부동 소수점보다 작동하기가 약간 어렵지만 가장 큰 문제는 대부분의 컴퓨터가 하드웨어 지원을 제공하지 않는다는 것입니다.</font></font>
ru: Некоторые языки также предлагают типы десятичных вычислений с плавающей точкой,они в основном используются в сценариях,где важно,чтобы результаты,полученные компьютером,соответствовали ранее существовавшим правилам округления,которые были написаны с учетом человека (главным образом,финансовые вычисления).С ними немного сложнее работать,чем с двоичными вычислениями с плавающей точкой,но самая большая проблема заключается в том,что большинство компьютеров не предлагают аппаратной поддержки для них.

source: Subtract the exponent:
es: Reste el exponente:
ja: 指数を引く。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수를 빼십시오 :</font></font>
ru: Вычитайте экспоненту:

source: The exponent is stored in the middle component as 11 bits. In our case, <code>0b10000000010</code>. In decimal, that represents the value <code>1026</code>. A quirk of this component is that you must subtract a number equal to <strong>2<sup>(# of bits) - 1</sup> - 1</strong> to get the true exponent; in our case, that means subtracting <code>0b1111111111</code> (decimal number <code>1023</code>) to get the true exponent, <code>0b00000000011</code> (decimal number 3).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El exponente se almacena en el componente medio como 11 bits. </font><font style="vertical-align: inherit;">En nuestro caso, </font></font> <code>0b10000000010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En decimal, eso representa el valor </font></font> <code>1026</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Una peculiaridad de este componente es que debe restar un n&uacute;mero igual a </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(# de bits) - 1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener el verdadero exponente; </font><font style="vertical-align: inherit;">en nuestro caso, eso significa restar </font></font> <code>0b1111111111</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (n&uacute;mero decimal </font></font> <code>1023</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) para obtener el verdadero exponente, </font></font> <code>0b00000000011</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (n&uacute;mero decimal 3).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指数は、11ビットとして中央のコンポーネントに格納されます。</font><font style="vertical-align: inherit;">この場合、</font></font> <code>0b10000000010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">10進数では、これは値</font></font> <code>1026</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を表します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このコンポーネントの癖を使用すると、に等しい数を減算しなければならないことである</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 - （ビット数）</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真の指数を取得します。</font><font style="vertical-align: inherit;">この例では、</font></font> <code>0b1111111111</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（10進数の</font></font> <code>1023</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）を</font><font style="vertical-align: inherit;">減算 </font><font style="vertical-align: inherit;">して、真の指数</font></font> <code>0b00000000011</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（10進数の3）</font><font style="vertical-align: inherit;">を取得します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수는 중간 구성 요소에 11 비트로 저장됩니다. </font><font style="vertical-align: inherit;">이 경우 </font></font> <code>0b10000000010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">10 진수는 </font></font> <code>1026</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값을 나타냅니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 구성 요소의 특질은 당신이 동일한 숫자 빼기해야한다는 것입니다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">- 1 (비트 수)</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 진정한 지수를 얻을 수를; </font><font style="vertical-align: inherit;">우리의 경우, 이는 </font><font style="vertical-align: inherit;">실제 지수 </font> <code>0b00000000011</code> <font style="vertical-align: inherit;"> (10 진수 3) </font><font style="vertical-align: inherit;">을 얻기 위해 </font></font> <code>0b1111111111</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (10 진수 </font></font> <code>1023</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )을 </font><font style="vertical-align: inherit;">빼는 것을 의미 </font><font style="vertical-align: inherit;">합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Показатель степени хранится в среднем компоненте как 11 битов. </font><font style="vertical-align: inherit;">В нашем случае </font></font> <code>0b10000000010</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В десятичном виде это представляет значение </font></font> <code>1026</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Причудой этого компонента является то, что вы должны вычесть число, равное </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(число битов) - 1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить истинный показатель степени; </font><font style="vertical-align: inherit;">в нашем случае это означает вычитание </font></font> <code>0b1111111111</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (десятичное число </font></font> <code>1023</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) для получения истинного показателя степени, </font></font> <code>0b00000000011</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (десятичное число 3).</font></font>

source: The floating-point representation is a finite one (like anything in a computer) so unavoidably many many many numbers are impossible to represent. In particular, 64 bits only allow you to distinguish among only 18,446,744,073,709,551,616 different values (which is nothing compared to infinity). With the standard convention, 9.2 is not one of them. Those that can are of the form m.2^e for some integers m and e.
es: La representación en punto flotante es finita (como cualquier cosa en una computadora),por lo que inevitablemente muchos muchos muchos números son imposibles de representar.En particular,los 64 bits sólo permiten distinguir entre sólo 18.446.744.073.709.551.616 valores diferentes (que no es nada comparado con el infinito).Con la convención estándar,9.2 no es uno de ellos.Los que pueden son de la forma m.2^e para algunos enteros m y e.
ja: 浮動小数点表現は有限なので(コンピュータの中の何かと同じように)、やむを得ず多くの多くの数を表現することは不可能です。特に64ビットでは、18,446,744,073,709,551,616通りの値しか区別できません(これは無限大に比べれば何のことはありません)。標準規格では、9.2はそのうちの一つではありません。識別できるものは、いくつかの整数mとeに対してm.2^eの形をしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 표현은 유한 한 것이므로 (컴퓨터의 다른 것) 불가피하게 많은 수의 숫자를 표현할 수 없습니다. </font><font style="vertical-align: inherit;">특히 64 비트를 사용하면 18,446,744,073,709,551,616의 서로 다른 값 (무한대와 비교 한 값) 만 구별 할 수 있습니다. </font><font style="vertical-align: inherit;">표준 규칙에서 9.2는 그중 하나가 아닙니다. </font><font style="vertical-align: inherit;">일부 정수 m 및 e의 경우 m.2 ^ e 형식 일 수 있습니다.</font></font>
ru: Представление с плавающей точкой является конечным (как и все остальное в компьютере),поэтому неизбежно много многих чисел невозможно представить.В частности,64 бита позволяют различать только 18 446 744 073 709 551 616 различных значений (что ничто по сравнению с бесконечностью).При стандартной конвенции 9,2 не является одним из них.Те,которые могут иметь форму m.2^e для некоторых целых чисел m и e.

source: The mantissa is stored in the third component as 52 bits. However, there's a quirk to this component as well. To understand this quirk, consider a number in scientific notation, like this:
es: La mantisa se almacena en el tercer componente como 52 bits.Sin embargo,hay una peculiaridad en este componente también.Para entender esta peculiaridad,considere un número en notación científica,como este:
ja: マンティッサは第3コンポーネントに52ビットとして格納されています。しかし、この構成要素にも奇妙な点があります。この奇妙さを理解するために、科学的な表記法で数字を考えてみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가수는 세 번째 구성 요소에 52 비트로 저장됩니다. </font><font style="vertical-align: inherit;">그러나이 구성 요소에도 단점이 있습니다. </font><font style="vertical-align: inherit;">이 문제를 이해하려면 다음과 같이 과학적 표기법을 사용하십시오.</font></font>
ru: Мантисса хранится в третьем компоненте в виде 52 бит.Однако,есть причуда и в этом компоненте.Чтобы понять эту причудливость,рассмотрим число в научной нотации,как это:

source: The mantissa would be the <code>6.0221413</code>. Recall that the mantissa in scientific notation always begins with a single non-zero digit. The same holds true for binary, except that binary only has two digits: <code>0</code> and <code>1</code>. So the binary mantissa <em>always</em> starts with <code>1</code>! When a float is stored, the <code>1</code> at the front of the binary mantissa is omitted to save space; we have to place it back at the front of our third element to get the <em>true</em> mantissa:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La mantisa ser&iacute;a el </font></font> <code>6.0221413</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Recuerde que la mantisa en notaci&oacute;n cient&iacute;fica siempre comienza con un solo d&iacute;gito distinto de cero. </font><font style="vertical-align: inherit;">Lo mismo es cierto para el binario, excepto que el binario solo tiene dos d&iacute;gitos: </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iexcl;Entonces la mantisa binaria </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">siempre</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comienza con </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ! </font><font style="vertical-align: inherit;">Cuando se almacena un flotador, el </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el frente de la mantisa binaria se omite para ahorrar espacio; </font><font style="vertical-align: inherit;">tenemos que volver a colocarlo al frente de nuestro tercer elemento para obtener la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">verdadera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mantisa:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仮数は</font></font> <code>6.0221413</code> になり<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">科学表記の仮数は常にゼロ以外の1桁で始まることを思い出してください。</font><font style="vertical-align: inherit;">同じことがバイナリーにも当てはまりますが、バイナリーの桁数は</font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>1</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2つだけ</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">したがって、バイナリ仮数は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に</font></font></em><font style="vertical-align: inherit;"></font> <code>1</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">始まります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">floatが格納されている場合、</font><font style="vertical-align: inherit;">2進数の仮数の前の</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はスペースを節約するために省略されます。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仮数</font><font style="vertical-align: inherit;">を取得するには、3番目の要素の前に配置する必要があり</font><em><font style="vertical-align: inherit;">ます</font></em><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가수는 </font></font> <code>6.0221413</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">과학적 표기법의 가수는 항상 0이 아닌 하나의 숫자로 시작합니다. </font><font style="vertical-align: inherit;">이진에는 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>1</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 자리 만 있다는 점을 제외하고는 이진에 대해서도 마찬가지입니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">따라서 이진 가수는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상 </font></font></em><font style="vertical-align: inherit;"></font> <code>1</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 시작합니다 </font><font style="vertical-align: inherit;">! </font><font style="vertical-align: inherit;">플로트가 저장되면 </font><font style="vertical-align: inherit;">공간을 절약하기 위해 이진 가수 앞의 </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 생략됩니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">진정한</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가수 </font><font style="vertical-align: inherit;">를 얻으려면 세 번째 요소 앞에 다시 배치해야 </font><em><font style="vertical-align: inherit;">합니다</font></em><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>6.0221413</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет </font><font style="vertical-align: inherit;">6.0221413</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Напомним, что мантисса в научной нотации всегда начинается с одной ненулевой цифры. </font><font style="vertical-align: inherit;">То же самое относится и к двоичному, за исключением того, что двоичный имеет только две цифры: </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Таким образом, двоичная мантисса </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всегда</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> начинается с </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ! </font><font style="vertical-align: inherit;">При сохранении числа с плавающей запятой, </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в передней части двоичной мантиссы опускается для экономии места; </font><font style="vertical-align: inherit;">мы должны поместить его обратно в начало нашего третьего элемента, чтобы получить </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">истинную</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мантиссу:</font></font>
