Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: When we look at those representations, we tend to associate each of them with the fraction 2/3, even though only the first representation is mathematically equal to the fraction. The second and third representations/approximations have an error on the order of 0.001, which is actually much worse than the error between 9.2 and 9.1999999999999993. In fact, the second representation isn't even rounded correctly! <em>Nevertheless, we don't have a problem with 0.666 as an approximation of the number 2/3, <strong>so we shouldn't really have a problem with how 9.2 is approximated in most programs</strong>.</em> (Yes, in some programs it matters.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando miramos esas representaciones, tendemos a asociar cada una de ellas con la fracci&oacute;n 2/3, aunque solo la primera representaci&oacute;n es matem&aacute;ticamente igual a la fracci&oacute;n. </font><font style="vertical-align: inherit;">Las representaciones / aproximaciones segunda y tercera tienen un error del orden de 0.001, que en realidad es mucho peor que el error entre 9.2 y 9.1999999999999993. </font><font style="vertical-align: inherit;">De hecho, &iexcl;la segunda representaci&oacute;n ni siquiera se redondea correctamente! </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, no tenemos un problema con 0.666 como una aproximaci&oacute;n del n&uacute;mero 2/3, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">por lo que realmente no deber&iacute;amos tener un problema con la aproximaci&oacute;n de 9.2 en la mayor&iacute;a de los programas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(S&iacute;, en algunos programas es importante).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらの表現を見ると、最初の表現のみが数学的に分数に等しい場合でも、それぞれを分数2/3に関連付ける傾向があります。</font><font style="vertical-align: inherit;">2番目と3番目の表現/近似には、0.001のオーダーのエラーがあります。これは、9.2と9.1999999999999993の間のエラーより実際にははるかに悪いものです。</font><font style="vertical-align: inherit;">実際、2番目の表現は正しく丸められていません！</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それでも、2/3の概算として0.666の問題</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はないので、ほとんどのプログラムで9.2がどのように概算されるかについては、実際には問題ありません</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（はい、一部のプログラムでは重要です。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 표현을 볼 때 첫 번째 표현 만 수학적으로 분수와 동일하더라도 각 표현을 분수 2/3과 연관시키는 경향이 있습니다. </font><font style="vertical-align: inherit;">두 번째 및 세 번째 표현 / 근사값은 0.001 정도의 오차를 가지며, 이는 실제로 9.2와 9.1999999999999993 사이의 오차보다 훨씬 나쁩니다. </font><font style="vertical-align: inherit;">실제로 두 번째 표현은 올바르게 반올림되지 않습니다! </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그럼에도 불구하고, 우리는 숫자 2/3의 근사치로 0.666에 문제 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가 없으므로, 대부분의 프로그램에서 9.2가 어떻게 근사되는지에 대해서는 문제가되지 않습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(예, 일부 프로그램에서는 중요합니다.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда мы смотрим на эти представления, мы склонны связывать каждое из них с дробью 2/3, даже если только первое представление математически равно дроби. </font><font style="vertical-align: inherit;">Второе и третье представления / приближения имеют ошибку порядка 0,001, что на самом деле намного хуже, чем ошибка между 9,2 и 9,1999999999999993. </font><font style="vertical-align: inherit;">На самом деле, второе представление даже не округлено правильно! </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тем не менее, у нас нет проблемы с 0,666 в качестве аппроксимации числа 2/3, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">поэтому у нас не должно быть проблем с приближением 9,2 в большинстве программ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Да, в некоторых программах это имеет значение.)</font></font>

source: Where the exponent is <code>-49</code> and the mantissa is <code>5179139571476070</code>. The reason it is impossible to represent <em>some</em> decimal numbers this way is that both the exponent and the mantissa must be integers. In other words, all floats must be an <em>integer</em> multiplied by an <em>integer power of 2</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Donde el exponente es </font></font> <code>-49</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y la mantisa es </font></font> <code>5179139571476070</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La raz&oacute;n por la que es imposible representar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">algunos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> n&uacute;meros decimales de esta manera es que tanto el exponente como la mantisa deben ser enteros. </font><font style="vertical-align: inherit;">En otras palabras, todos los flotadores deben ser un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n&uacute;mero entero</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> multiplicado por una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">potencia entera de 2</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指数は</font></font> <code>-49</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、仮数は</font></font> <code>5179139571476070</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一部の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 10進数をこの方法で</font><font style="vertical-align: inherit;">表すことができ</font><font style="vertical-align: inherit;">ないのは、指数と仮数の両方が整数でなければならないためです。</font><font style="vertical-align: inherit;">つまり、すべての浮動小数点数は</font><font style="vertical-align: inherit;">、</font><em><font style="vertical-align: inherit;">整数の2の累乗を</font></em><font style="vertical-align: inherit;">掛け</font><font style="vertical-align: inherit;">た</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">整数で</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なければなりません</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지수가 </font></font> <code>-49</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이고 가수가 </font></font> <code>5179139571476070</code> 인 경우<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그것을 표현하는 것은 불가능 이유는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 진수이 방법은 지수와 가수 모두 정수이어야한다는 것입니다. </font><font style="vertical-align: inherit;">다시 말해, 모든 float는 </font><em><font style="vertical-align: inherit;">정수에 2</font></em><font style="vertical-align: inherit;"> 의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정수를</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 곱한 </font><em><font style="vertical-align: inherit;">정수</font></em><font style="vertical-align: inherit;"> 여야합니다 </font><font style="vertical-align: inherit;">.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Где показатель степени равен </font></font> <code>-49</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а мантисса равна </font></font> <code>5179139571476070</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Причиной невозможности представления </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">некоторых</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> десятичных чисел таким образом является то, что и показатель степени, и мантисса должны быть целыми числами. </font><font style="vertical-align: inherit;">Другими словами, все числа с плавающей точкой должны быть </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">целым числом,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> умноженным на </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">целую степень 2</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Which equals:
es: Que es igual:
ja: どっちも同じだ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어느 것이 :</font></font>
ru: Что равнозначно:

source: Which we can then convert from binary to decimal:
es: Que luego podemos convertir de binario a decimal:
ja: 2進数から10進数に変換することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러면 바이너리에서 10 진수로 변환 할 수 있습니다.</font></font>
ru: Который мы можем затем преобразовать из двоичного в десятичный:

source: While all of the other answers are good there is still one thing missing:
es: Aunque todas las demás respuestas son buenas,todavía falta una cosa:
ja: 他の答えは良いが、一つだけ足りないものがある。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 모든 답변은 훌륭하지만 여전히 누락 된 것이 하나 있습니다.</font></font>
ru: Несмотря на то,что все остальные ответы хороши,одной вещи все еще не хватает:

source: Why are floating point numbers inaccurate
es: ¿Por qué los números en coma flotante son inexactos
ja: なぜ浮動小数点数は不正確なのか
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 숫자가 정확하지 않은 이유</font></font>
ru: Почему числа с плавающей точкой неточны

source: Why are floating point numbers inaccurate?
es: ¿Por qué los números en coma flotante son inexactos?
ja: なぜ浮動小数点数は不正確なのか?
ko: 부동 소수점 숫자가 왜 정확하지 않습니까?
ru: Почему числа с плавающей точкой неточны?

source: Why can we not represent 9.2 in binary floating point?
es: ¿Por qué no podemos representar 9,2 en punto flotante binario?
ja: なぜ9.2を2進数の浮動小数点で表現できないのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 바이너리 부동 소수점으로 9.2를 표현할 수 없습니까?</font></font>
ru: Почему мы не можем представить 9.2 в двоичной плавающей точке?

source: Why do computers use this representation?
es: ¿Por qué las computadoras usan esta representación?
ja: なぜコンピュータはこの表現を使うのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴퓨터가 왜이 표현을 사용합니까?</font></font>
ru: Почему компьютеры используют это представление?

source: Why do some numbers lose accuracy when stored as floating point numbers?
es: ¿Por qué algunos números pierden precisión cuando se almacenan como números de punto flotante?
ja: 浮動小数点数として保存すると精度が落ちる数値があるのはなぜですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 숫자로 저장할 때 일부 숫자의 정확도가 떨어지는 이유는 무엇입니까?</font></font>
ru: Почему некоторые числа теряют точность при хранении в виде чисел с плавающей точкой?

source: You might come up with a different numeration system, 10 based for instance, where 9.2 would have an exact representation. But other numbers, say 1/3, would still be impossible to represent.
es: Se podría pensar en un sistema de numeración diferente,basado en el 10 por ejemplo,donde el 9.2 tendría una representación exacta.Pero otros números,digamos 13,serían aún imposibles de representar.
ja: 例えば、10をベースにした別の記数法を思いつくかもしれませんが、9.2は正確に表現できます。しかし、他の数字、例えば13は、まだ表現することは不可能です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 9.2에서 정확한 표현을하는 다른 분자 시스템을 예로들 수 있습니다. </font><font style="vertical-align: inherit;">그러나 1/3이라는 다른 숫자는 여전히 표현하기가 불가능합니다.</font></font>
ru: Вы можете придумать другую систему нумерации,10 основанную,например,на том,что 9.2 будет иметь точное представление.Но другие числа,скажем 13,все равно невозможно будет представить.

source: You'll see I've split the return value into three components. These components are:
es: Verás que he dividido el valor de retorno en tres componentes.Estos componentes son:
ja: 戻り値を3つのコンポーネントに分割しました。これらのコンポーネントは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반환 값을 세 가지 구성 요소로 나눈 것을 볼 수 있습니다. </font><font style="vertical-align: inherit;">이러한 구성 요소는 다음과 같습니다.</font></font>
ru: Вы увидите,что я разделил возвращаемое значение на три компонента.Эти компоненты:
