Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: '<code>decimalValue</code>' is your value to convert.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">' </font></font> <code>decimalValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ' es su valor para convertir.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">' </font></font> <code>decimalValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 'は、変換する値です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">' </font></font> <code>decimalValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> '는 변환 할 값입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">' </font></font> <code>decimalValue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ' - ваша ценность для конвертации.</font></font>

source: (1/2)<sub>10</sub> = 0.5<sub>10</sub> = 0.1<sub>2</sub> = 0.1111...<sub>3</sub>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1/2) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.5 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1111 ... </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（1/2）</font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.5 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1111 ... </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1/2) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.5 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.1111 ... </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1/2) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0,5 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0,1 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0,1111 ... </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>

source: (2/3)<sub>10</sub> = 0.2<sub>3</sub>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2/3) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.2 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2/3）</font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.2 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2/3) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0.2 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2/3) </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> = 0,2 </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sub>

source: 1.0010011001100110011001100110011001100110011001100110 x 10<sup>11</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1,0010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>

source: 1.0011 x 10<sup>11</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.0011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1,0011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11</font></font></sup>

source: 1.1499999999999999 x 2<sup>3</sup> (inexact!)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.1499999999999999 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (&iexcl;inexacto!)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.1499999999999999 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（不正確！）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1.1499999999999999 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font><font style="vertical-align: inherit;">inexact </font><font style="vertical-align: inherit;">!)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1,1499999999999999 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (неточно!)</font></font>

source: 10010011001100110011001100110011001100110011001100110 x 10<sup>11-110100</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-110100</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-110100</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-110100</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10010011001100110011001100110011001100110011001100110 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-110100</font></font></sup>

source: 10011 x 10<sup>-1</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10-1</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 х 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>

source: 10011 x 10<sup>11-100</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-100</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-100</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-100</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10011 x 10 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">11-100</font></font></sup>

source: 19 / 2<sup>1</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup>

source: 19 x 2<sup>-1</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">X 2 19 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19 x </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2-1</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">19 х 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-1</font></font></sup>

source: 5179139571476070 * 2<sup> -49</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 * 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 * 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5,179,139,571,476,070 * 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 * 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>

source: 5179139571476070 / 2<sup>49</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">49</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">49</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">49</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070/2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">49</font></font></sup>

source: 5179139571476070 x 2<sup>-49</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5,179,139,571,476,070 &times; 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-49</font></font></sup>

source: 5179139571476070 x 2<sup>3-52</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3-52</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3-52</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3-52</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5179139571476070 x 2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3-52</font></font></sup>

source: <a href="http://docs.python.org/3.4/tutorial/floatingpoint.html">Floating Point Arithmetic: Issues and Limitations</a> (docs.python.org)
es: <a href="http://docs.python.org/3.4/tutorial/floatingpoint.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aritm&eacute;tica de coma flotante: problemas y limitaciones</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (docs.python.org)</font></font>
ja: <a href="http://docs.python.org/3.4/tutorial/floatingpoint.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">浮動小数点演算：問題と制限</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（docs.python.org）</font></font>
ko: <a href="http://docs.python.org/3.4/tutorial/floatingpoint.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 산술 : 문제 및 제한 사항</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (docs.python.org)</font></font>
ru: <a href="http://docs.python.org/3.4/tutorial/floatingpoint.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Арифметика с плавающей точкой: проблемы и ограничения</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (docs.python.org)</font></font>

source: <a href="http://download.oracle.com/docs/cd/E19957-01/806-3568/ncg_goldberg.html">What Every Computer Scientist Should Know About Floating-Point Arithmetic</a> (Goldberg 1991)
es: <a href="http://download.oracle.com/docs/cd/E19957-01/806-3568/ncg_goldberg.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo que todo inform&aacute;tico debe saber sobre la aritm&eacute;tica de coma flotante</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Goldberg 1991)</font></font>
ja: <a href="http://download.oracle.com/docs/cd/E19957-01/806-3568/ncg_goldberg.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべてのコンピューター科学者が浮動小数点演算について知っておくべきこと</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（Goldberg 1991）</font></font>
ko: <a href="http://download.oracle.com/docs/cd/E19957-01/806-3568/ncg_goldberg.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 컴퓨터 과학자가 부동 소수점 산술에 대해 알아야 할 사항</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Goldberg 1991)</font></font>
ru: <a href="http://download.oracle.com/docs/cd/E19957-01/806-3568/ncg_goldberg.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Что каждый компьютерный ученый должен знать об арифметике с плавающей запятой</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Goldberg 1991)</font></font>

source: <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">IEEE Double-precision floating-point format</a> (Wikipedia)
es: <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IEEE Formato de punto flotante de doble precisi&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Wikipedia)</font></font>
ja: <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IEEE倍精度浮動小数点形式</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（Wikipedia）</font></font>
ko: <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IEEE 배정 밀도 부동 소수점 형식</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Wikipedia)</font></font>
ru: <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IEEE формат с плавающей точкой двойной точности</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Википедия)</font></font>
