Repository: rueisnom/feedback
Catalog: xlf/21/89/57/56/21895756.*.001.xlf
Languages: es, ja, ko, ru

source: <a href="http://floating-point-gui.de/">The Floating-Point Guide: What Every Programmer Should Know About Floating-Point Arithmetic, or, Why don&rsquo;t my numbers add up?</a> (floating-point-gui.de)
es: <a href="http://floating-point-gui.de/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La gu&iacute;a de punto flotante: lo que todo programador debe saber sobre la aritm&eacute;tica de punto flotante o, &iquest;por qu&eacute; no se suman mis n&uacute;meros? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(coma flotante-gui.de)</font></font>
ja: <a href="http://floating-point-gui.de/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">浮動小数点ガイド：すべてのプログラマーが浮動小数点演算について知っておくべきこと、または、なぜ私の数値が加算されないのですか？</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（floating-point-gui.de）</font></font>
ko: <a href="http://floating-point-gui.de/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 안내서 : 모든 프로그래머가 부동 소수점 산술에 대해 알아야 할 사항 또는 왜 숫자가 합산되지 않습니까? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(floating-point-gui.de)</font></font>
ru: <a href="http://floating-point-gui.de/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Руководство с плавающей точкой: что должен знать каждый программист об арифметике с плавающей точкой, или, Почему мои числа не складываются? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(floating-point-gui.de)</font></font>

source: <code>9.2</code> may be simply <code>92/10</code>, but <strong>10</strong> cannot be expressed as <strong>2<sup>n</sup></strong> if <strong>n</strong> is limited to integer values.
es: <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede ser simplemente </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no puede expresarse como </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; limitado a valores enteros.</font></font>
ja: <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は単に</font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ですが</font><font style="vertical-align: inherit;">、</font><strong><font style="vertical-align: inherit;">n</font></strong><font style="vertical-align: inherit;">が整数値に制限されている</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として表すことはできません</font><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ko: <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 단순히 </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일 수 있지만 </font><strong><font style="vertical-align: inherit;">n</font></strong><font style="vertical-align: inherit;"> 이 정수 값으로 제한 </font><font style="vertical-align: inherit;">되면 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 표현할 수 없습니다 </font><font style="vertical-align: inherit;">.</font></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может быть просто </font></font> <code>92/10</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">10</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не может быть выражено как </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n,</font></font></sup></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ограничено целочисленными значениями.</font></font>

source: <strong>It is impossible to represent irrational numbers (e.g. &pi;, <code>sqrt(2)</code>, <code>log(3)</code>, etc.) precisely!</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Es imposible representar n&uacute;meros irracionales (por ejemplo, &pi;, </font></font> <code>sqrt(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc.) con precisi&oacute;n!</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">無理数（例えば、&pi;、</font></font> <code>sqrt(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>log(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">など）を正確</font><font style="vertical-align: inherit;">に表すことは不可能</font><font style="vertical-align: inherit;">です！</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비합리적인 숫자 (예 : &pi;, </font></font> <code>sqrt(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등)를 정확하게 </font><font style="vertical-align: inherit;">나타내는 것은 불가능합니다 </font><font style="vertical-align: inherit;">!</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Невозможно </font><font style="vertical-align: inherit;">точно </font><font style="vertical-align: inherit;">представить иррациональные числа (например, &pi;, </font></font> <code>sqrt(2)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>log(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д.)!</font></font></strong>

source: A fraction can only be expressed exactly using a finite number of digits in a positional numbering system if the prime factors of the denominator (when the fraction is expressed in it's lowest terms) are factors of the base.
es: Una fracción sólo puede expresarse exactamente utilizando un número finito de dígitos en un sistema de numeración posicional si los factores primos del denominador (cuando la fracción se expresa en sus términos más bajos)son factores de la base.
ja: 分数は、分母の素因数が(分数が最も低い項で表現されている場合)ベースの因数である場合にのみ、位置番号システムの有限の桁数を使用して正確に表現することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">분모의 소인수 (분수가 가장 낮은 항으로 표현 될 때)가 밑수의 인자 인 경우, 위치 넘버링 시스템에서 유한 자릿수를 사용하여 분수를 정확하게 표현할 수 있습니다.</font></font>
ru: Дробь может быть точно выражена с помощью конечного числа цифр в позиционной системе нумерации только в том случае,если основными факторами знаменателя (когда дробь выражается в ее наименьших терминах)являются факторы базы.

source: Already you can see the mantissa is only 4 digits followed by a whole lot of zeroes. But let's go through the paces.
es: Ya se puede ver que la mantisa es de sólo 4 dígitos seguidos de un montón de ceros.Pero vayamos a través de los pasos.
ja: もうお分かりでしょうが、マンティッサはたった4桁の数字で、その後にはたくさんのゼロが続いています。でも、順番に見ていきましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 가수가 4 자리이며 그 뒤에 0이 많이있는 것을 볼 수 있습니다. </font><font style="vertical-align: inherit;">그러나 속도를 봅시다.</font></font>
ru: Уже видно,что мантисса-это всего 4 цифры,за которыми следуют целые нули.Но давайте пройдемся по шагам.

source: Also note that double-precision floating-points numbers are <em>extremely</em> accurate. They can represent any number in a very wide range with as much as 15 exact digits. For daily life computations, 4 or 5 digits are more than enough. You will never really need those 15, unless you want to count every millisecond of your lifetime.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n tenga en cuenta que los n&uacute;meros de coma flotante de doble precisi&oacute;n son </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">extremadamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> precisos. </font><font style="vertical-align: inherit;">Pueden representar cualquier n&uacute;mero en un rango muy amplio con hasta 15 d&iacute;gitos exactos. </font><font style="vertical-align: inherit;">Para los c&aacute;lculos de la vida diaria, 4 o 5 d&iacute;gitos son m&aacute;s que suficientes. </font><font style="vertical-align: inherit;">Nunca necesitar&aacute; esos 15, a menos que quiera contar cada milisegundo de su vida.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、倍精度浮動小数点数は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正確です。</font><font style="vertical-align: inherit;">15桁までの非常に広い範囲の任意の数値を表すことができます。</font><font style="vertical-align: inherit;">日常の計算では、4桁または5桁で十分です。</font><font style="vertical-align: inherit;">ライフタイムの1ミリ秒ごとにカウントしたい場合を除き、これらの15は実際には必要ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배정 밀도 부동 소수점 숫자는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 정확합니다. </font><font style="vertical-align: inherit;">그들은 15 자리까지 정확한 숫자로 매우 넓은 범위의 숫자를 나타낼 수 있습니다. </font><font style="vertical-align: inherit;">일상 생활 계산의 경우 4 자리 또는 5 자리이면 충분합니다. </font><font style="vertical-align: inherit;">당신이 당신의 일생의 모든 밀리 초를 계산하지 않는 한, 당신은 정말로 그 15를 필요로하지 않을 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также обратите внимание, что числа с плавающей запятой двойной точности </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">чрезвычайно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> точны. </font><font style="vertical-align: inherit;">Они могут представлять любое число в очень широком диапазоне с 15 точными цифрами. </font><font style="vertical-align: inherit;">Для ежедневных вычислений 4 или 5 цифр более чем достаточно. </font><font style="vertical-align: inherit;">Вам никогда не понадобятся эти 15, если вы не хотите считать каждую миллисекунду своей жизни.</font></font>

source: Although if you would limit your math needs to rational numbers only the problem of precision becomes manageable. You would need to store a pair of (possibly very big) integers <code>a</code> and <code>b</code> to hold the number represented by the fraction <code>a/b</code>. All your arithmetic would have to be done on fractions just like in highschool math (e.g. <code>a/b * c/d = ac/bd</code>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aunque si limitara sus necesidades matem&aacute;ticas a n&uacute;meros racionales, solo el problema de la precisi&oacute;n se vuelve manejable. </font><font style="vertical-align: inherit;">Lo que se necesita para almacenar un par de (posiblemente muy grande) n&uacute;meros enteros </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para contener el n&uacute;mero representado por la fracci&oacute;n </font></font> <code>a/b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Toda su aritm&eacute;tica tendr&iacute;a que hacerse en fracciones al igual que en matem&aacute;ticas de secundaria (por ejemplo, </font></font> <code>a/b * c/d = ac/bd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたがあなたの数学の必要性を有理数に制限するならば、精度の問題だけが扱いやすくなる。</font><font style="vertical-align: inherit;">分数</font> <code>a/b</code> で<font style="vertical-align: inherit;">表される数値を保持するには</font><font style="vertical-align: inherit;">、（非常に大きな）整数のペア</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を格納する必要があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">算数はすべて高校の数学のように分数で実行する必要があります（例：</font> <code>a/b * c/d = ac/bd</code> <font style="vertical-align: inherit;">）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수학의 필요성을 합리적인 수로 제한한다면 정밀도 문제 만 관리 할 수있게됩니다. </font><font style="vertical-align: inherit;">분수 </font> <code>a/b</code> 로<font style="vertical-align: inherit;"> 표시되는 숫자를 보유하려면 </font><font style="vertical-align: inherit;">(아마도 큰) 정수 쌍 </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 저장해야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">모든 산술은 고등학교 수학과 같은 분수에서 수행해야합니다 (예 : </font> <code>a/b * c/d = ac/bd</code> <font style="vertical-align: inherit;"> ).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя, если вы ограничите свои математические потребности рациональными числами, только проблема точности станет управляемой. </font><font style="vertical-align: inherit;">Вам нужно будет хранить пару (возможно, очень больших) целых чисел </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы хранить число, представленное дробью </font></font> <code>a/b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вся ваша арифметика должна делаться на дроби, как в математике старшей школы (например, </font></font> <code>a/b * c/d = ac/bd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>

source: And multiply to reveal the final representation of the number we started with (<code>9.2</code>) after being stored as a floating point value:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y multiplique para revelar la representaci&oacute;n final del n&uacute;mero con el que comenzamos ( </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) despu&eacute;s de ser almacenado como un valor de coma flotante:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、乗算し</font><font style="vertical-align: inherit;">て、浮動小数点値として格納された後</font><font style="vertical-align: inherit;">（</font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）で</font><font style="vertical-align: inherit;">開始した数値の最終的な表現を明らかにし</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부동 소수점 값으로 저장된 후 </font><font style="vertical-align: inherit;">( </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )로 </font><font style="vertical-align: inherit;">시작한 숫자의 최종 표현을 나타내려면 곱하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И умножьте, чтобы показать окончательное представление числа, с которого мы начали ( </font></font> <code>9.2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) после сохранения в виде значения с плавающей запятой:</font></font>

source: And that actually is why they are called irrational. No amount of bit storage in the world would be enough to hold even one of them. Only <em>symbolic</em> arithmetic is able to preserve their precision.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y esa es la raz&oacute;n por la que se les llama irracionales. </font><font style="vertical-align: inherit;">Ninguna cantidad de almacenamiento de bits en el mundo ser&iacute;a suficiente para contener incluso uno de ellos. </font><font style="vertical-align: inherit;">Solo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aritm&eacute;tica </font><em><font style="vertical-align: inherit;">simb&oacute;lica</font></em><font style="vertical-align: inherit;"> puede preservar su precisi&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、それが実際に彼らが不合理と呼ばれている理由です。</font><font style="vertical-align: inherit;">世界のビットストレージの量は、それらの1つでも保持するのに十分ではありません。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シンボリック</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">算術</font><font style="vertical-align: inherit;">のみ</font><font style="vertical-align: inherit;">が精度を保持できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 그것이 실제로 그들이 비이성적이라고 불리는 이유입니다. </font><font style="vertical-align: inherit;">세계의 비트 저장 공간 중 하나라도 저장하기에 충분하지 않습니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기호</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 산술 </font><font style="vertical-align: inherit;">만 </font><font style="vertical-align: inherit;">정밀도를 유지할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И именно поэтому они называются иррациональными. </font><font style="vertical-align: inherit;">Никакого количества битового хранилища в мире не хватит даже для одного из них. </font><font style="vertical-align: inherit;">Только </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">символическая</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> арифметика способна сохранить их точность.</font></font>

source: Assemble the binary scientific notation:
es: Ensamblar la notación científica binaria:
ja: 二進法の科学表記を組み立てる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이진 과학 표기법을 조립하십시오.</font></font>
ru: Соберите бинарную научную нотацию:

source: Because it's a simple format to work with and it is sufficiently accurate for most purposes. Basically the same reason scientists use "scientific notation" and round their results to a reasonable number of digits at each step.
es: Porque es un formato simple para trabajar y es suficientemente preciso para la mayoría de los propósitos.Básicamente por la misma razón por la que los científicos utilizan la "notación científica" y redondean sus resultados a un número razonable de dígitos en cada paso.
ja: なぜなら、それは作業するためのシンプルなフォーマットであり、ほとんどの目的のために十分に正確だからです。基本的に科学者が "科学的表記法 "を使用し、各ステップで妥当な桁数に丸めて結果を表示するのと同じ理由です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작업하기에 간단한 형식이기 때문에 대부분의 경우 충분히 정확하기 때문입니다. </font><font style="vertical-align: inherit;">기본적으로 과학자들이 "과학적 표기법"을 사용하고 각 단계에서 적당한 수의 숫자로 결과를 반올림하는 것과 같은 이유입니다.</font></font>
ru: Потому что это простой формат для работы и достаточно точный для большинства целей.В основном по той же причине ученые используют "научную нотацию" и округляют свои результаты до разумного числа цифр на каждом шаге.
