Repository: rueisnom/feedback
Catalog: xlf/39/85/21/4/3985214.*.001.xlf
Languages: es, ja, ko, zh_cn

source: <code>$redact</code><em>"restricts the contents of the documents based on information stored in the documents themselves"</em>. So it will run only <em>inside of the document</em>. It basically scans your document top to the bottom, and checks if it matches with your <code>if</code> condition which is in <code>$cond</code>, if there is match it will either keep the content(<code>$$DESCEND</code>) or remove(<code>$$PRUNE</code>).
es: <code>$redact</code> <em>"restringe el contenido de los documentos en funci&oacute;n de la informaci&oacute;n almacenada en los propios documentos"</em> . Por lo tanto, se ejecutar&aacute; solo <em>dentro del documento</em> . B&aacute;sicamente escanea su documento de arriba a abajo y verifica si coincide con su condici&oacute;n <code>if</code> que est&aacute; en <code>$cond</code> , si hay coincidencia mantendr&aacute; el contenido ( <code>$$DESCEND</code> ) o eliminar&aacute; ( <code>$$PRUNE</code> ).
ja: <code>$redact</code> <em>"ドキュメント自体に格納されている情報に基づいてドキュメントの内容を制限します"</em> 。 したがって<em>、ドキュメントの内部で</em>のみ実行さ<em>れます</em> 。 基本的にドキュメントを上から下にスキャンし、 <code>$cond</code> ある <code>if</code> 条件と一致するかどうかを確認します。一致がある場合は、コンテンツを保持する（ <code>$$DESCEND</code> ）または削除する（ <code>$$PRUNE</code> ）かのいずれかです。
ko: <code>$redact</code> <em>"문서 자체에 저장된 정보를 기반으로 문서의 내용을 제한합니다"</em> . 따라서 <em>문서 내부</em> 에서만 실행됩니다. 기본적으로 문서를 맨 아래까지 스캔하고 <code>$cond</code> 있는 <code>if</code> 조건과 일치하는지 확인합니다. 일치하는 경우 내용 ( <code>$$DESCEND</code> ) 또는 remove ( <code>$$PRUNE</code> )를 유지합니다.
zh_cn: <code>$redact</code> <em>&ldquo;根据存储在文档本身中的信息来限制文档的内容&rdquo;</em> 。 因此它将仅<em>在文档内部</em>运行。 它基本上从上到下扫描您的文档，并检查它是否与 <code>$cond</code> <code>if</code> 条件匹配，如果匹配，则将保留内容（ <code>$$DESCEND</code> ）或remove（ <code>$$PRUNE</code> ）。

source: <code>$slice</code> is helpful when you know the index of the element, but sometimes you want whichever array element matched your criteria. You can return the matching element with the <code>$</code> operator.
es: <code>$slice</code> es &uacute;til cuando conoce el &iacute;ndice del elemento, pero a veces desea cualquier elemento de matriz que coincida con sus criterios. Puede devolver el elemento coincidente con el operador <code>$</code> .
ja: <code>$slice</code> は、要素のインデックスがわかっている場合に役立ちますが、条件に一致する配列要素が必要になる場合があります。 <code>$</code> 演算子を使用して、一致する要素を返すことができます。
ko: <code>$slice</code> 는 요소의 인덱스를 알고 있지만 때로는 어떤 기준 요소와 일치하는 배열 요소를 원할 때 유용합니다. <code>$</code> 연산자를 사용하여 일치하는 요소를 반환 할 수 있습니다.
zh_cn: 当您知道元素的索引时， <code>$slice</code> 会很有帮助，但有时您希望任何符合条件的数组元素。 您可以使用 <code>$</code> 运算符返回匹配的元素。

source: <strong>Caution:</strong> This answer provides a solution that was relevant <em>at that time</em>, before the new features of MongoDB 2.2 and up were introduced. See the other answers if you are using a more recent version of MongoDB.
es: <strong>Precauci&oacute;n:</strong> esta respuesta proporciona una soluci&oacute;n que era relevante <em>en ese momento</em> , antes de que se introdujeran las nuevas caracter&iacute;sticas de MongoDB 2.2 y versiones posteriores. Vea las otras respuestas si est&aacute; utilizando una versi&oacute;n m&aacute;s reciente de MongoDB.
ja: <strong>注意：</strong>この回答は、MongoDB 2.2以降の新機能が導入される前の、 <em>当時</em>関連<em>してい</em>たソリューションを提供します。 より新しいバージョンのMongoDBを使用している場合は、他の回答を参照してください。
ko: <strong>주의 :</strong> 이 답변은 MongoDB 2.2 이상의 새로운 기능이 도입되기 전에 <em>당시</em> 관련 솔루션을 제공합니다. 최신 버전의 MongoDB를 사용하는 경우 다른 답변을 참조하십시오.
zh_cn: <strong>警告：</strong>在引入MongoDB 2.2及更高版本的新功能之前，此答案提供了当时相关的解决方案。 如果您使用的是MongoDB的最新版本，请参阅其他答案。

source: <strong>MongoDB 3.2 Update</strong>
es: <strong>Actualizaci&oacute;n de MongoDB 3.2</strong>
ja: <strong>MongoDB 3.2アップデート</strong>
ko: <strong>MongoDB 3.2 업데이트</strong>
zh_cn: <strong>MongoDB 3.2更新</strong>

source: Another interesing way is to use <a href="http://docs.mongodb.org/manual/reference/operator/aggregation/redact/"><strong>$redact</strong></a>, which is one of the new aggregation features of <strong>MongoDB 2.6</strong>. If you are using 2.6, you don't need an $unwind which might cause you performance problems if you have large arrays.
es: Otra forma <a href="http://docs.mongodb.org/manual/reference/operator/aggregation/redact/"><strong>interesante</strong></a> es usar <strong>$ redact</strong> , que es una de las nuevas caracter&iacute;sticas de agregaci&oacute;n de <strong>MongoDB 2.6</strong> . Si est&aacute; utilizando 2.6, no necesita un desenrollado $ que podr&iacute;a causar problemas de rendimiento si tiene matrices grandes.
ja: 別の興味深い方法は、 <a href="http://docs.mongodb.org/manual/reference/operator/aggregation/redact/"><strong>$ redact</strong></a>を使用すること<strong>です</strong> 。これは、 <strong>MongoDB 2.6の</strong>新しい集約機能の1つです。 2.6を使用している場合は、大きな配列がある場合にパフォーマンスの問題を引き起こす可能性がある$ unwindは必要ありません。
ko: 또 다른 중요한 방법은 <strong>MongoDB 2.6</strong> 의 새로운 집계 기능 중 하나 인 <a href="http://docs.mongodb.org/manual/reference/operator/aggregation/redact/"><strong>$ redact</strong></a> 를 사용하는 것입니다. 2.6을 사용하는 경우 큰 배열이있는 경우 성능 문제를 일으킬 수있는 $ unwind가 필요하지 않습니다.
zh_cn: 另一种有趣的方式是使用<a href="http://docs.mongodb.org/manual/reference/operator/aggregation/redact/"><strong>$ redact</strong></a> ，这是<strong>MongoDB 2.6</strong>的新聚合功能之一。 如果您使用的是2.6，则不需要$ unwind，如果您有大阵列，则可能会导致性能问题。

source: Better you can query in matching array element using <code>$slice</code> is it helpful to returning the significant object in an array.
es: Mejor puede consultar en un elemento de matriz coincidente usando <code>$slice</code> es &uacute;til devolver el objeto significativo en una matriz.
ja: <code>$slice</code> を使用して一致する配列要素でクエリを実行できる方が、配列で重要なオブジェクトを返すのに役立ちます。
ko: <code>$slice</code> 사용하여 배열 요소를 일치시키는 쿼리를하는 것이 더 좋습니다. 배열에서 중요한 객체를 반환하는 것이 도움이됩니다.
zh_cn: 更好的是，您可以使用 <code>$slice</code> 在匹配的数组元素中进行查询，这有助于返回数组中的有效对象。

source: Do query:
ja: クエリをしてください。
ko: 쿼리를 수행하십시오.
zh_cn: 做查询。

source: Here I just want to add some more complex usage.
es: Aquí sólo quiero añadir un uso más complejo.
ja: ここでは、もう少し複雑な使い方を追加したいと思います。
ko: 여기에 좀 더 복잡한 사용법을 추가하고 싶습니다.
zh_cn: 在这里,我只想再增加一些复杂的用法。

source: How can I do this?
es: ¿Cómo puedo hacer esto?
ja: どうすればいいのでしょうか?
ko: 어떻게해야합니까?
zh_cn: 如何才能做到这一点呢?

source: However, I'd like to get the document <em>(Document 1)</em> only with the array that contains <code>color=red</code>:
es: Sin embargo, me gustar&iacute;a obtener el documento <em>(Documento 1)</em> solo con la matriz que contiene <code>color=red</code> :
ja: ただし、 <code>color=red</code> を含む配列のみを使用してドキュメント<em>（ドキュメント1）</em>を取得したいと思います。
ko: 그러나 <code>color=red</code> 가 포함 된 배열로만 문서 <em>(문서 1)</em> 를 얻고 싶습니다.
zh_cn: 但是，我只想使用包含 <code>color=red</code> 的数组来获取文档<em>（文档1）</em> ：

source: If you really <em>need</em> the correct output directly from MongoDB, you can <strong>use a map-reduce</strong> to filter the shapes.
es: Si realmente <em>necesita</em> la salida correcta directamente de MongoDB, puede <strong>usar un mapa-reducir</strong> para filtrar las formas.
ja: MongoDBから直接正しい出力が本当に<em>必要な</em>場合<strong>は、map-reduce</strong>を使用して形状をフィルタリングできます。
ko: 실제로 MongoDB에서 직접 올바른 출력이 <em>필요한</em> 경우 <strong>map-reduce</strong> 를 <strong>사용</strong> 하여 모양을 필터링 할 수 <strong>있습니다</strong> .
zh_cn: 如果确实<em>需要</em>直接从MongoDB输出正确的输出，则可以<strong>使用map-reduce</strong>过滤形状。

source: In 2.2 you can also do this using the <a href="http://docs.mongodb.org/manual/reference/operator/projection/positional/#proj._S_"><code>$ projection operator</code></a>, where the <code>$</code> in a projection object field name represents the index of the field's first matching array element from the query. The following returns the same results as above:
es: En 2.2 tambi&eacute;n puede hacer esto usando el <a href="http://docs.mongodb.org/manual/reference/operator/projection/positional/#proj._S_"> <code>$ projection operator</code> </a> , donde el <code>$</code> en un nombre de campo de objeto de proyecci&oacute;n representa el &iacute;ndice del primer elemento de matriz coincidente del campo de la consulta. Lo siguiente devuelve los mismos resultados que arriba:
ja: 2.2では、 <a href="http://docs.mongodb.org/manual/reference/operator/projection/positional/#proj._S_"> <code>$ projection operator</code> </a>を使用してこれを行うこともできます。プロジェクションオブジェクトフィールド名の <code>$</code> は、クエリからのフィールドの最初に一致する配列要素のインデックスを表します。 以下は、上記と同じ結果を返します。
ko: 2.2에서는 <a href="http://docs.mongodb.org/manual/reference/operator/projection/positional/#proj._S_"> <code>$ projection operator</code> </a> 사용하여이 작업을 수행 할 수도 있습니다. 여기서 투영 객체 필드 이름의 <code>$</code> 는 쿼리에서 필드의 첫 번째 일치하는 배열 요소의 인덱스를 나타냅니다. 다음은 위와 동일한 결과를 반환합니다.
zh_cn: 在2.2中，您也可以使用<a href="http://docs.mongodb.org/manual/reference/operator/projection/positional/#proj._S_"> <code>$ projection operator</code> </a>执行此操作 ，其中投影对象字段名称中的 <code>$</code> 表示查询中该字段的第一个匹配数组元素的索引。 以下返回与上面相同的结果：

source: In the example above, first <code>$match</code> returns the whole <code>shapes</code> array, and $redact strips it down to the expected result.
es: En el ejemplo anterior, la primera <code>$match</code> devuelve toda la matriz de <code>shapes</code> , y $ redact la despoja al resultado esperado.
ja: 上記の例では、最初の <code>$match</code> は <code>shapes</code> 配列全体を返し、$ redactはそれを期待される結果まで削除します。
ko: 위의 예에서 첫 번째 <code>$match</code> 는 전체 <code>shapes</code> 배열을 반환하고 $ redact는이를 예상 결과로 줄입니다.
zh_cn: 在上面的示例中，第一个 <code>$match</code> 返回整个 <code>shapes</code> 数组，然后$ redact将其剥离为预期结果。

source: Likewise you can find for the multiple
es: De la misma manera puedes encontrar para los múltiples
ja: 同様に、複数の
ko: 마찬가지로 당신은 여러에 대한 찾을 수 있습니다
zh_cn: 同样的,你也可以发现,对于多个

source: MongoDB 2.2's new <a href="http://docs.mongodb.org/manual/reference/projection/elemMatch/"><code>$elemMatch</code></a> projection operator provides another way to alter the returned document to contain only the <strong><em>first</em></strong> matched <code>shapes</code> element:
es: El nuevo operador de proyecci&oacute;n <a href="http://docs.mongodb.org/manual/reference/projection/elemMatch/"> <code>$elemMatch</code> </a> MongoDB 2.2 proporciona otra forma de alterar el documento devuelto para contener solo el <strong><em>primer</em></strong> elemento de <code>shapes</code> coincidentes:
ja: MongoDB 2.2の新しい<a href="http://docs.mongodb.org/manual/reference/projection/elemMatch/"> <code>$elemMatch</code> </a>投影演算子は、 <strong><em>最初に</em></strong>一致した <code>shapes</code> 要素のみを含むように返されたドキュメントを変更する別の方法を提供します。
ko: MongoDB 2.2의 새로운 <a href="http://docs.mongodb.org/manual/reference/projection/elemMatch/"> <code>$elemMatch</code> </a> 프로젝션 연산자는 <strong><em>첫 번째로</em></strong> 일치하는 <code>shapes</code> 요소 만 포함하도록 반환 된 문서를 변경하는 다른 방법을 제공합니다.
zh_cn: MongoDB 2.2的新的<a href="http://docs.mongodb.org/manual/reference/projection/elemMatch/"> <code>$elemMatch</code> </a>投影运算符提供了另一种方法来更改返回的文档，使其仅包含第<strong><em>一个</em></strong>匹配的 <code>shapes</code> 元素：

source: Note that <code>{$not:"$color"}</code> is necessary, because it will scan the top document as well, and if <code>$redact</code> does not find a <code>color</code> field on the top level this will return <code>false</code> that might strip the whole document which we don't want.
es: Tenga en cuenta que <code>{$not:"$color"}</code> es necesario, porque tambi&eacute;n escanear&aacute; el documento superior, y si <code>$redact</code> no encuentra un campo de <code>color</code> en el nivel superior, esto devolver&aacute; <code>false</code> que podr&iacute;a quitar todo el documento que no quiero
ja: <code>{$not:"$color"}</code> も必要です。これは、最上位のドキュメントもスキャンするためです。 <code>$redact</code> が最上位の <code>color</code> フィールドを見つけられない場合は、 <code>false</code> が返され、ドキュメント全体が削除される可能性があります。したくない。
ko: <code>{$not:"$color"}</code> 는 최상위 문서도 스캔하기 때문에 필요하며 <code>$redact</code> 가 최상위 레벨에서 <code>color</code> 필드를 찾지 못하면 <code>false</code> 를 반환하여 전체 문서를 제거 할 수 있습니다. 원하지 않아요
zh_cn: 请注意， <code>{$not:"$color"}</code> 是必需的，因为它也会扫描顶层文档，并且如果 <code>$redact</code> 在顶层没有找到 <code>color</code> 字段，则将返回 <code>false</code> ，这可能会剥离整个文档。不想要

source: Results in:
es: Resultados:
ja: 結果が出ています。
ko: 결과 :
zh_cn: 结果是:

source: Retrieve only the queried element in an object array in MongoDB collection
es: Recuperar sólo el elemento consultado en un conjunto de objetos de la colección de MongoDB
ja: MongoDBコレクションのオブジェクト配列の中から、クエリの対象となる要素だけを取得する
ko: MongoDB 컬렉션의 객체 배열에서 쿼리 된 요소 만 검색
zh_cn: 只检索MongoDB集合中的对象数组中的被查询元素。

source: Returns matched document <em>(Document 1)</em>, but always with ALL array items in <code>shapes</code>:
es: Devuelve el documento coincidente <em>(Documento 1)</em> , pero siempre con TODOS los elementos de la matriz en <code>shapes</code> :
ja: 一致したドキュメント<em>（ドキュメント1）を</em>返しますが、常に <code>shapes</code> すべての配列項目を使用します 。
ko: 일치하는 문서 <em>(문서 1)를</em> 반환하지만 항상 <code>shapes</code> 모든 배열 항목을 반환합니다.
zh_cn: 返回匹配的文档<em>（文档1）</em> ，但始终具有 <code>shapes</code> 所有数组项：

source: Starting with the 3.2 release, you can use the new <a href="https://docs.mongodb.org/master/reference/operator/aggregation/filter/#exp._S_filter"><code>$filter</code></a> aggregation operator to filter an array during projection, which has the benefit of including <em>all</em> matches, instead of just the first one.
es: A partir de la versi&oacute;n 3.2, puede usar el nuevo operador de agregaci&oacute;n <a href="https://docs.mongodb.org/master/reference/operator/aggregation/filter/#exp._S_filter"> <code>$filter</code> </a> para filtrar una matriz durante la proyecci&oacute;n, que tiene la ventaja de incluir <em>todas las</em> coincidencias, en lugar de solo la primera.
ja: 3.2リリース以降では、新しい<a href="https://docs.mongodb.org/master/reference/operator/aggregation/filter/#exp._S_filter"> <code>$filter</code> </a>集計演算子を使用して、射影中に配列をフィルター処理できます。これには、最初のものだけでなく、 <em>すべての</em>一致を含めるという利点があります。
ko: 3.2 릴리스부터는 새로운 <a href="https://docs.mongodb.org/master/reference/operator/aggregation/filter/#exp._S_filter"> <code>$filter</code> </a> 집계 연산자를 사용하여 프로젝션 중에 배열을 필터링 할 수 있습니다. 첫 번째 배열 대신 <em>모든</em> 일치 항목을 포함시키는 이점이 있습니다.
zh_cn: 从3.2版本开始，您可以使用新的<a href="https://docs.mongodb.org/master/reference/operator/aggregation/filter/#exp._S_filter"> <code>$filter</code> </a>聚合运算符在投影过程中对数组进行过滤，其优点是包括<em>所有</em>匹配项，而不仅仅是第一个匹配项。

source: Suppose you have the following documents in my collection:
es: Suponga que tiene los siguientes documentos en mi colección:
ja: 私のコレクションの中に以下のような書類があるとします。
ko: 내 컬렉션에 다음과 같은 문서가 있다고 가정합니다.
zh_cn: 假设你在我的收藏里有以下文件:

source: Thanks to <em><a href="https://stackoverflow.com/users/1259510/johnnyhk">JohnnyHK</a></em>.
es: Gracias a <em><a href="https://stackoverflow.com/users/1259510/johnnyhk">JohnnyHK</a></em> .
ja: <em><a href="https://stackoverflow.com/users/1259510/johnnyhk">JohnnyHKに</a></em>感謝し<em>ます</em> 。
ko: <em><a href="https://stackoverflow.com/users/1259510/johnnyhk">JohnnyHK</a></em> 에게 감사합니다.
zh_cn: 感谢<em><a href="https://stackoverflow.com/users/1259510/johnnyhk">JohnnyHK</a></em> 。

source: The easiest way is to just filter the shapes <strong>in the client</strong>.
es: La forma m&aacute;s f&aacute;cil es simplemente filtrar las formas <strong>en el cliente</strong> .
ja: 最も簡単な方法は<strong>、クライアントの</strong>形状<strong>を</strong>フィルターするだけ<strong>です</strong> 。
ko: 가장 쉬운 방법은 <strong>클라이언트</strong> 에서 도형 <strong>을</strong> 필터링하는 것입니다.
zh_cn: 最简单的方法是只过滤<strong>客户端中</strong>的形状。

source: The field selector parameter is limited to complete properties. It cannot be used to select part of an array, only the entire array. I tried using the <a href="http://www.mongodb.org/display/DOCS/Updating#Updating-The%24positionaloperator">$ positional operator</a>, but that didn't work.
es: El par&aacute;metro del selector de campo est&aacute; limitado a propiedades completas. No se puede utilizar para seleccionar parte de una matriz, solo toda la matriz. Intent&eacute; usar el <a href="http://www.mongodb.org/display/DOCS/Updating#Updating-The%24positionaloperator">operador posicional $</a> , pero eso no funcion&oacute;.
ja: フィールドセレクタパラメータは、完全なプロパティに制限されています。 配列全体だけを選択して、配列の一部を選択することはできません。 <a href="http://www.mongodb.org/display/DOCS/Updating#Updating-The%24positionaloperator">$位置演算子</a>を使ってみましたが、うまくいきませんでした。
ko: 필드 선택기 매개 변수는 완전한 특성으로 제한됩니다. 배열의 일부를 선택하는 데 사용할 수 없으며 전체 배열 만 선택할 수 있습니다. <a href="http://www.mongodb.org/display/DOCS/Updating#Updating-The%24positionaloperator">$ positional operator</a> 사용하려고 시도했지만 작동하지 않았습니다.
zh_cn: 字段选择器参数仅限于完整属性。 它不能用于选择数组的一部分，只能选择整个数组。 我尝试使用<a href="http://www.mongodb.org/display/DOCS/Updating#Updating-The%24positionaloperator">$位置运算符</a> ，但这没有用。

source: The new <a href="http://docs.mongodb.org/manual/applications/aggregation/">Aggregation Framework</a> in MongoDB 2.2+ provides an alternative to Map/Reduce. The <a href="http://docs.mongodb.org/manual/reference/aggregation/unwind/#_S_unwind"><code>$unwind</code></a> operator can be used to separate your <code>shapes</code> array into a stream of documents that can be matched:
es: El nuevo <a href="http://docs.mongodb.org/manual/applications/aggregation/">Marco de agregaci&oacute;n</a> en MongoDB 2.2+ proporciona una alternativa a Map / Reduce. El operador <a href="http://docs.mongodb.org/manual/reference/aggregation/unwind/#_S_unwind"> <code>$unwind</code> </a> se puede utilizar para separar su matriz de <code>shapes</code> en una secuencia de documentos que pueden coincidir:
ja: MongoDB 2.2以降の新しい<a href="http://docs.mongodb.org/manual/applications/aggregation/">集約フレームワーク</a>は、Map / Reduceの代替手段を提供します。 <a href="http://docs.mongodb.org/manual/reference/aggregation/unwind/#_S_unwind"> <code>$unwind</code> </a>演算子を使用して、 <code>shapes</code> 配列を、照合可能なドキュメントのストリームに分離できます。
ko: MongoDB 2.2+의 새로운 <a href="http://docs.mongodb.org/manual/applications/aggregation/">Aggregation Framework</a> 는 Map / Reduce의 대안을 제공합니다. <a href="http://docs.mongodb.org/manual/reference/aggregation/unwind/#_S_unwind"> <code>$unwind</code> </a> 연산자를 사용하여 <code>shapes</code> 배열을 일치시킬 수있는 문서 스트림으로 분리 할 수 ​​있습니다.
zh_cn: MongoDB 2.2+中的新<a href="http://docs.mongodb.org/manual/applications/aggregation/">聚合框架</a>提供了Map / Reduce的替代方法。 <a href="http://docs.mongodb.org/manual/reference/aggregation/unwind/#_S_unwind"> <code>$unwind</code> </a>运算符可用于将您的 <code>shapes</code> 数组分成可匹配的文档流：

source: The syntax for find in mongodb is
es: La sintaxis para encontrar en mongodb es
ja: mongodbでのfindの構文は以下の通りです。
ko: mongodb에서 find의 구문은 다음과 같습니다.
zh_cn: mongodb中查找的语法是

source: This will give you the desired result.
es: Esto le dará el resultado deseado.
ja: これで希望の結果が得られます。
ko: 원하는 결과를 얻을 수 있습니다.
zh_cn: 这样一来,就能达到理想的效果。

source: Use aggregation function and <code>$project</code> to get specific object field in document
es: Use la funci&oacute;n de agregaci&oacute;n y <code>$project</code> para obtener un campo de objeto espec&iacute;fico en el documento
ja: 集計関数と <code>$project</code> を使用してドキュメント内の特定のオブジェクトフィールドを取得する
ko: 집계 함수와 <code>$project</code> 를 사용하여 문서의 특정 객체 필드를 가져옵니다.
zh_cn: 使用聚合函数和 <code>$project</code> 获取文档中的特定对象字段

source: You just need to run query
es: Sólo tienes que hacer una consulta
ja: クエリを実行する必要があります。
ko: 당신은 단지 쿼리를 실행해야합니다
zh_cn: 你只需要运行查询

source: along with $project it will be more appropriate other wise matching elements will be clubbed together with other elements in document.
es: junto con el proyecto de $ será más apropiado que otros elementos de coincidencia se apalanquen junto con otros elementos en el documento.
ja: projectと一緒に$projectと一緒にするのがより適切ですが、他にも一致する要素はドキュメント内の他の要素と一緒にクラブ化されます。
ko: $ project와 함께 다른 현명한 일치 요소가 문서의 다른 요소와 함께 클럽 화되는 것이 더 적합합니다.
zh_cn: 随着$项目,它将更适合其他匹配的元素将与文件中的其他元素结合在一起。

source: and the second query that you have written, that is
es: y la segunda pregunta que has escrito,es decir
ja: と、2つ目のクエリを書いていますが、それは
ko: 그리고 두 번째로 작성한 쿼리는
zh_cn: 和你写的第二个疑问,那就是

source: as you expected it'll gives the exact field from array that matches color:'red'.
es: como esperabas,te dará el campo exacto de la matriz que coincide con el color:"rojo".
ja: 期待通り、配列の中の正確なフィールドを与えてくれます。
ko: 예상대로 배열에서 색상 : '빨간색'과 일치하는 정확한 필드를 제공합니다.
zh_cn: 如你所料,它将从数组中给出与color:''red'相匹配的字段。

source: in this you have used the <code>$elemMatch</code> operator in query part, whereas if you use this operator in the projection part then you will get the desired result. You can write down your query as
es: en esto, ha usado el operador <code>$elemMatch</code> en la parte de consulta, mientras que si usa este operador en la parte de proyecci&oacute;n, obtendr&aacute; el resultado deseado. Puede escribir su consulta como
ja: この例では、クエリパーツで <code>$elemMatch</code> 演算子を使用していますが、この演算子をプロジェクションパーツで使用すると、目的の結果が得られます。 次のようにクエリを書き留めることができます
ko: 여기에서는 쿼리 부분에서 <code>$elemMatch</code> 연산자를 사용했지만 투영 부분에서이 연산자를 사용하면 원하는 결과를 얻을 수 있습니다. 검색어를 다음과 같이 작성할 수 있습니다
zh_cn: 在这种情况下，您在查询部分中使用了 <code>$elemMatch</code> 运算符，而如果在投影部分中使用了此运算符，则将获得所需的结果。 您可以将查询记为

source: output of this query is
es: El resultado de esta consulta es
ja: このクエリの出力は
ko: 이 쿼리의 출력은
zh_cn: 这个查询的输出是
