Repository: rueisnom/feedback
Catalog: xlf/94/93/14/949314.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: I already wrote a tool (using a hook from Git) in which I can inject workitemidentifiers into the message of a Git changeset.
ja: Git のチェンジセットのメッセージに workitemidentifier を注入するツールを(Git のフックを使って)すでに書いています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이미 Git 체인지 셋의 메시지에 workitemidentifiers를 주입 할 수있는 도구 (Git의 후크를 사용)를 작성했다.</font></font>
ru: Я уже написал инструмент (с помощью крючка от Git'а),в котором я могу вводить идентификаторы рабочих элементов в сообщение Git changeset.
zh_cn: 我已经写了一个工具(使用Git中的一个钩子),在这个工具中,我可以将workitemidentifier注入到Git更改集的消息中。

source: I needed something a little more different: display the full sha1 of the commit, but append an asterisk to the end if the working directory is not clean. Unless I wanted to use multiple commands, none of the options in the previous answers work.
ja: コミットの完全な sha1 を表示し、作業ディレクトリがクリーンでない場合は最後にアスタリスクを追加します。複数のコマンドを使いたい場合を除いて、以前の回答にあるオプションはどれも機能しません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조금 더 다른 것이 필요했습니다. 커밋의 전체 sha1을 표시하지만 작업 디렉토리가 깨끗하지 않으면 끝에 별표를 추가하십시오. </font><font style="vertical-align: inherit;">여러 명령을 사용하고 싶지 않으면 이전 답변의 옵션 중 어느 것도 작동하지 않습니다.</font></font>
ru: Мне нужно было что-то немного другое:отобразить полную Sha1 коммита,но добавить звездочку в конец,если рабочий каталог не чистый.Если только я не хотел использовать несколько команд,ни одна из опций в предыдущих ответах не работает.
zh_cn: 我需要的是更多不同的东西:显示提交的完整的sha1,但如果工作目录不干净,就在最后加上一个星号。除非我想使用多个命令,否则前面的答案中的选项都不能用。

source: I would like to retain (for now) the ability to link Git changesets to workitems stored in TFS.
ja: Git のチェンジセットを TFS に保存されている workitems にリンクさせる機能を(とりあえず)保持しておきたいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git 변경 세트를 TFS에 저장된 작업 항목에 연결하는 기능을 유지하고 싶습니다 (현재).</font></font>
ru: Я хотел бы сохранить (пока)возможность связывать Git changesets с рабочими элементами,хранящимися в TFS.
zh_cn: 我想保留(暂时)将Git更改集与存储在TFS中的工作项目链接起来的能力。

source: If won't work, check in <code>.git/refs/heads</code> folder what kind of heads do you have present.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">動作しない場合は、</font></font> <code>.git/refs/heads</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フォルダーで、どのような種類のヘッドが存在するかを</font><font style="vertical-align: inherit;">確認し</font><font style="vertical-align: inherit;">てください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동하지 않으면 </font></font> <code>.git/refs/heads</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 폴더에서 어떤 종류의 헤드가 </font><font style="vertical-align: inherit;">있는지 확인하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если не сработает, проверьте в </font><font style="vertical-align: inherit;">папке </font></font> <code>.git/refs/heads</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> какие у вас есть головки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果不起作用，请在</font></font> <code>.git/refs/heads</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文件夹中</font><font style="vertical-align: inherit;">检查</font><font style="vertical-align: inherit;">您有什么样的头。</font></font>

source: If you don't want to append the asterisk, this works like all the other commands in the previous answers:
ja: アスタリスクを追加したくない場合、これは以前の回答にある他のコマンドと同じように動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">별표를 추가하지 않으려면 이전 답변의 다른 모든 명령과 같이 작동합니다.</font></font>
ru: Если вы не хотите добавлять звездочку,это работает,как и все другие команды в предыдущих ответах:
zh_cn: 如果你不想附加星号,这个功能和前面答案中的其他命令一样。

source: If you have windows then you may consider using wsl.exe:
ja: Windowsをお持ちの場合は、wsl.exeの使用を検討してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">창이있는 경우 wsl.exe 사용을 고려할 수 있습니다.</font></font>
ru: Если у вас есть окна,то вы можете подумать об использовании wsl.exe:
zh_cn: 如果你有windows,那么你可以考虑使用wsl.exe。

source: If you need to store the hash in a variable during a script, you can use
ja: スクリプト中にハッシュを変数に格納する必要がある場合は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스크립트 도중 해시를 변수에 저장해야하는 경우</font></font>
ru: Если вам нужно сохранить хэш в переменной во время сценария,вы можете использовать
zh_cn: 如果你在脚本中需要将哈希存储在一个变量中,你可以使用

source: If you only want the shortened hash:
ja: 短縮ハッシュだけなら
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단축 된 해시 만 원하는 경우 :</font></font>
ru: Если ты хочешь только укороченный гашиш:
zh_cn: 如果你只想要缩短的哈希。

source: If you want a specific number of digits of the hash you can add:
ja: あなたが追加することができますハッシュの特定の桁数が必要な場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시의 특정 자릿수를 원하는 경우 다음을 추가 할 수 있습니다.</font></font>
ru: Если вам нужно определенное количество цифр гашиша,вы можете добавить:
zh_cn: 如果你想要一个特定数字的哈希数,你可以添加。

source: If you want the super-hacky way to do it:
ja: 超ハチャメチャな方法がいいなら
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">슈퍼 해키 방법을 원한다면 :</font></font>
ru: Если ты хочешь суперхалтурный способ сделать это:
zh_cn: 如果你想用超级黑客的方式来做。

source: If you're going for speed though, <a href="https://stackoverflow.com/a/12913817/72321">the approach mentioned by Deestan</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたがスピードを求めているなら</font></font><a href="https://stackoverflow.com/a/12913817/72321"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ディースタンが述べたアプローチ</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속도 </font></font><a href="https://stackoverflow.com/a/12913817/72321"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">를 내려면 Deestan이 언급 한 접근 방식</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы идете на скорости, хотя, </font></font><a href="https://stackoverflow.com/a/12913817/72321"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подход, упомянутый Дестаном</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您追求速度，</font></font><a href="https://stackoverflow.com/a/12913817/72321"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Deestan提到的方法</font></font></a>

source: It's very similar to the of @outofculture though a bit shorter.
ja: 少し短いですが、@outofcultureのものと非常に似ています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조금 짧지 만 @outofculture와 매우 유사합니다.</font></font>
ru: Это очень похоже на @outofculture,хотя и немного короче.
zh_cn: 这和@outofculture的文章很相似,虽然短了一点。

source: Note that git now supports storing some head refs in the pack-ref file instead of as a file in the /refs/heads/ folder. <a href="https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html">https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gitは、/ refs / heads /フォルダー内のファイルとしてではなく、pack-refファイルへのいくつかのヘッド参照の保存をサポートするようになりました。 </font></font><a href="https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git은 / refs / heads / 폴더의 파일 대신 pack-ref 파일에 일부 헤드 참조 저장을 지원합니다. </font></font><a href="https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что git теперь поддерживает сохранение некоторых ref-ссылок в файле pack-ref, а не в виде файла в папке / refs /head /. </font></font><a href="https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意，git现在支持将一些head refs存储在pack-ref文件中，而不是作为/ refs / heads /文件夹中的文件存储。 </font></font><a href="https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.kernel.org/pub/software/scm/git/docs/git-pack-refs.html</font></font></a>

source: On git bash, simply run $ git log -1
ja: git bash で $ git log -1 を実行します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git bash에서 $ git log -1을 실행하십시오.</font></font>
ru: На git bash,просто запустите $ git log -1
zh_cn: 在git bash上,只需运行$ git log -1

source: Or, as as command:
ja: または、命令通りに。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 명령으로</font></font>
ru: Или,как приказ:
zh_cn: 或者说,作为命令。

source: Or, if you only want the first 10 characters (like github.com does)
ja: または、最初の10文字だけが必要な場合(github.comのように
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 github.com처럼 처음 10자를 원한다면</font></font>
ru: Или,если вам нужны только первые 10 символов (как это делает github.com).
zh_cn: 或者,如果你只想要前10个字符(像github.com一样)的话

source: Parse it:
ja: 解析して
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것을 파싱하십시오 :</font></font>
ru: Разберись с этим:
zh_cn: 解析它。

source: Perhaps you want an alias so you don't have to remember all the nifty details. After doing one of the below steps, you will be able to simply type:
ja: おそらく、あなたはすべての気の利いた詳細を覚えておく必要がないように、エイリアスが欲しいのではないでしょうか。以下の手順のいずれかを行った後、単にタイプすることができるようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 별명을 원할 것이므로 모든 멋진 세부 사항을 기억할 필요는 없습니다. </font><font style="vertical-align: inherit;">아래 단계 중 하나를 수행 한 후 간단히 다음을 입력 할 수 있습니다.</font></font>
ru: Возможно,вам нужен псевдоним,чтобы вам не пришлось запоминать все ловкие детали.Выполнив один из следующих шагов,вы сможете просто набрать текст:
zh_cn: 也许你想要一个别名,这样你就不必记住所有的细节。在做完下面的一个步骤后,你就可以简单地打字了。

source: Result: <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe*</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">結果：</font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe*</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과 : </font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe*</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Результат: </font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe*</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结果：</font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe*</code>

source: Result: <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">結果：</font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결과 : </font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Результат: </font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结果：</font></font> <code>f5366ccb21588c0d7a5f7d9fa1d3f85e9f9d1ffe</code>

source: The most succinct way I know:
ja: 私が知っている最も簡潔な方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 아는 가장 간결한 방법 :</font></font>
ru: Самый лаконичный способ,который я знаю:
zh_cn: 这是我知道的最简洁的方法。

source: There's always <code>git describe</code> as well. By default it gives you --
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">常に</font></font> <code>git describe</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もあります。</font><font style="vertical-align: inherit;">デフォルトでは次のようになります-</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상 </font></font> <code>git describe</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 있습니다. </font><font style="vertical-align: inherit;">기본적으로 그것은 당신에게-</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Там всегда есть </font></font> <code>git describe</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а также. </font><font style="vertical-align: inherit;">По умолчанию это дает вам -</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">总是有</font></font> <code>git describe</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">默认情况下，它为您提供-</font></font>

source: This also works over http which is useful for local package archives (I know: for public web sites it's not recommended to make the .git directory accessable):
ja: これはローカルのパッケージアーカイブに便利な http 経由でも動作します (一般のウェブサイトでは .git ディレクトリにアクセスできるようにすることは推奨されません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 또한 로컬 패키지 아카이브에 유용한 http를 통해 작동합니다 (공개 웹 사이트의 경우 .git 디렉토리에 액세스 할 수 없도록 권장하지 않음).</font></font>
ru: Это также работает по http,что полезно для локальных архивов пакетов (я знаю:для публичных сайтов не рекомендуется делать доступным каталог .git):
zh_cn: 这也可以通过http来实现,这对于本地包存档是很有用的(我知道:对于公共网站来说,不建议让.git目录可以访问)。

source: This method can be useful when you've repository files, but <code>git</code> command has been not installed.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この方法は、リポジトリファイルはあるが</font></font> <code>git</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コマンドがインストールされていない</font><font style="vertical-align: inherit;">場合に役立ちます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법은 파일을 리포지토리에 저장했지만 </font></font> <code>git</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령이 설치되지 않은 경우에 </font><font style="vertical-align: inherit;">유용 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот метод может быть полезен, когда у вас есть файлы репозитория, но </font><font style="vertical-align: inherit;">команда </font></font> <code>git</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не установлена.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当您拥有存储库文件但</font><font style="vertical-align: inherit;">尚未安装</font></font> <code>git</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命令</font><font style="vertical-align: inherit;">时，此方法很有用</font><font style="vertical-align: inherit;">。</font></font>

source: This value may be used to git checkout later but it becomes pointing to its SHA. To make it to point to the actual current branch by its name do:
ja: この値は後で git checkout に使われるかもしれませんが、その SHA を指すようになります。実際の現在のブランチを指すようにするには、そのブランチ名を指定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 값은 나중에 체크 아웃을 git하기 위해 사용될 수 있지만 SHA를 가리키게됩니다. </font><font style="vertical-align: inherit;">이름으로 실제 현재 분기를 가리 키도록하려면 다음을 수행하십시오.</font></font>
ru: Это значение может быть использовано для проверки git'а позже,но оно будет указывать на его SHA.Чтобы оно указывало на текущую текущую ветку по имени do:
zh_cn: 这个值可能会在以后用于 git checkout,但它会变成指向它的 SHA。要使其指向当前分支的实际分支,可以用它的名字来做。

source: This, of course, will fail in detached-head mode, as HEAD won't be "ref:...", but the hash itself - but you know, I don't think you expect that much smarts in your bash one-liners. If you don't think semicolons are cheating, though...
ja: これはもちろん、head が "ref:..." ではなくハッシュそのものになるので、detached-head モードでは失敗します-しかし、バッシュのワンライナーにそこまでの賢さを期待しているとは思えません。セミコロンがズルいと思わないのであれば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HEAD가 "ref : ..."는 아니지만 해시 자체는 아니기 때문에 분리 헤드 모드에서는 실패합니다. 그러나 당신은 알고 있습니다. 라이너. </font><font style="vertical-align: inherit;">세미콜론이 바람을 피우고 있다고 생각하지 않는다면 ...</font></font>
ru: Это,конечно,провалится в режиме отщепления головы,так как HEAD не будет "ref:...",но сам хэш-но знаете,я не думаю,что вы ожидаете столько ума в ваших бэш-однолинерах.Если ты не думаешь,что точка с запятой обманывает...
zh_cn: 当然,这在detached-head模式下会失败,因为head不会是 "ref:...........",而是hash本身--但你知道,我想你对你的bash单行本中的聪明才智期望不高。如果你不觉得分号是作弊的话.....。

source: To get the full SHA:
ja: 完全なSHAを取得するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 SHA를 얻으려면 :</font></font>
ru: Чтобы получить полный SHA:
zh_cn: 为了获得完整的SHA。

source: To get the shortened version:
ja: 短縮版を取得するには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단축 버전을 얻으려면 :</font></font>
ru: Чтобы получить укороченную версию:
zh_cn: 为了获得简略版。

source: To turn arbitrary extended object reference into SHA-1, use simply <strong><a href="http://git-scm.com/docs/git-rev-parse">git-rev-parse</a></strong>, for example
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意の拡張オブジェクト参照をSHA-1に</font></font><strong><a href="http://git-scm.com/docs/git-rev-parse"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変換するには</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">単に</font><strong><font style="vertical-align: inherit;">git-rev-parseを</font></strong><font style="vertical-align: inherit;">使用します。</font><font style="vertical-align: inherit;">次に例を示します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임의의 확장 객체 참조를 SHA-1로 바꾸려면 </font></font><strong><a href="http://git-scm.com/docs/git-rev-parse"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-rev-parse</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы превратить произвольную расширенную ссылку на объект в SHA-1, используйте просто </font></font><strong><a href="http://git-scm.com/docs/git-rev-parse"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-rev-parse</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , например</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要将任意扩展对象引用转换为SHA-1，</font><font style="vertical-align: inherit;">例如</font><font style="vertical-align: inherit;">，只需使用</font></font><strong><a href="http://git-scm.com/docs/git-rev-parse"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-rev-parse</font></font></a></strong><font style="vertical-align: inherit;"></font>

source: Use <code>git rev-list --max-count=1 HEAD</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>git rev-list --max-count=1 HEAD</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font> <code>git rev-list --max-count=1 HEAD</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font> <code>git rev-list --max-count=1 HEAD</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>git rev-list --max-count=1 HEAD</code>

source: in your home-dir in file ".gitconfig" add the following
ja: ホームディレクトリの ".gitconfig" ファイルに次のように追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파일 ".gitconfig"의 홈 디렉토리에 다음을 추가하십시오.</font></font>
ru: в вашем домашнем каталоге в файле ".gitconfig" добавьте следующее.
zh_cn: 在你的home-dir文件".gitconfig "中添加以下内容

source: is significantly faster than any other method listed here so far.
ja: は、これまでここに挙げた他のどの方法よりも大幅に高速です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지금까지 여기에 나열된 다른 방법보다 훨씬 빠릅니다.</font></font>
ru: значительно быстрее,чем любой другой метод,перечисленный здесь до сих пор.
zh_cn: 比这里列出的任何其他方法都要快得多。

source: then you will have an easier command to remember:
ja: のようなコマンドを覚えておくと、覚えやすいでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러면 기억하기 쉬운 명령이 있습니다.</font></font>
ru: тогда вам будет легче запомнить команду:
zh_cn: 那么你会有一个更容易记住的命令。

source: you will see, these lines following your command.
ja: コマンドに続くこれらの行が表示されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 줄들은 당신의 명령을 따른다.</font></font>
ru: вы увидите,эти строки следуют вашей команде.
zh_cn: 你会看到,这几行跟着你的命令。
