Repository: rueisnom/feedback
Catalog: xlf/94/93/14/949314.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: 1) Teach git the explicit way by editing the global config (my original answer):
ja: 1)グローバル設定を編集して git に明示的な方法を教える (私のオリジナルの答え)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) 전역 설정 (원래 답변)을 편집하여 git에게 명시적인 방법을 가르치십시오.</font></font>
ru: 1)Обучайте git прямому способу,редактируя глобальную конфигурацию (мой оригинальный ответ):
zh_cn: 1)通过编辑全局配置(我的原始答案)来教git的显式方法。

source: 2) Or if you like a shortcut to teach git a shortcut, as recently commented by Adrien:
ja: 2)あるいは、最近Adrienさんがコメントされているように、gitに教えるショートカットが好きな場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) 또는 최근 Adrien이 언급 한 것처럼 git에게 단축키를 가르치는 단축키를 좋아하는 경우 :</font></font>
ru: 2)Или если вам нравится ярлык для обучения git'а,как недавно прокомментировал Адриан:
zh_cn: 2)或者,如果你喜欢捷径,可以教给git一个捷径,就像最近Adrien评论的那样。

source: <strong><em>Sidenote:</em></strong> If you want to turn <em>references</em> (<strong>branches</strong> and <strong>tags</strong>) into SHA-1, there is <code>git show-ref</code> and <code>git for-each-ref</code>.
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">補足：</font></font></em></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブランチ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）をSHA-1に変換し</font><font style="vertical-align: inherit;">たい場合</font><font style="vertical-align: inherit;">は、</font></font> <code>git show-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>git for-each-ref</code> があり<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <strong><em><font style="vertical-align: inherit;"></font></em></strong><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 </font></font></em><font style="vertical-align: inherit;"><strong><em><font style="vertical-align: inherit;">:</font></em></strong><em><font style="vertical-align: inherit;"> 참조</font></em><font style="vertical-align: inherit;"> (</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 브랜치</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )를 SHA-1로</font><font style="vertical-align: inherit;">바꾸려면</font></font> <code>git show-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및</font></font> <code>git for-each-ref</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있습니다.</font></font>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sidenote:</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Если вы хотите превратить</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ссылки</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ветви</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теги</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) в SHA-1, есть</font></font> <code>git show-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и</font></font> <code>git for-each-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">旁注：</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果要将</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分支</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标签</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）转换为SHA-1，则可以使用</font></font> <code>git show-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>git for-each-ref</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <sup>You need to run above command in your git root folder.</sup>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のコマンドをgitルートフォルダーで実行する必要があります。</font></font></sup>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git root 폴더에서 위 명령을 실행해야합니다.</font></font></sup>
ru: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам нужно выполнить указанную выше команду в вашей корневой папке git.</font></font></sup>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您需要在git根文件夹中运行以上命令。</font></font></sup>

source: Abbreviated commit hash
ja: 省略されたコミットハッシュ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">약식 커밋 해시</font></font>
ru: сокращённое обязательство хэш
zh_cn: 缩写的提交哈希

source: Another one, using git log:
ja: もう一つは、git logを使ったもの。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자식 로그를 사용하는 다른 하나 :</font></font>
ru: Еще один,с помощью гит-журнала:
zh_cn: 另一个,使用git日志。

source: Basically, git stores the location of HEAD in .git/HEAD, in the form <code>ref: {path from .git}</code>. This command reads that out, slices off the "ref: ", and reads out whatever file it pointed to.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的に、gitはHEADの場所を</font></font> <code>ref: {path from .git}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">形式で.git / HEADに保存します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このコマンドはそれを読み取り、「ref：」を切り取り、それが指しているファイルをすべて読み取ります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 git은 HEAD의 위치를 </font></font> <code>ref: {path from .git}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 형식으로 .git / HEAD에 저장합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 명령은 그 내용을 읽고 "ref :"를 잘라 내고 지정한 파일을 읽습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">По сути, git хранит местоположение HEAD в .git / HEAD в форме </font></font> <code>ref: {path from .git}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Эта команда считывает это, вырезает &laquo;ref:&raquo; и считывает любой файл, на который она указала.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上，git以</font></font> <code>ref: {path from .git}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的形式将HEAD的位置存储在.git / HEAD中</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">该命令将其读出，切出&ldquo; ref：&rdquo;，并读出其指向的任何文件。</font></font>

source: Click <a href="https://git-scm.com/docs/git-show#_examples">here</a> for more <code>git show</code> examples.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クリックして</font></font><a href="https://git-scm.com/docs/git-show#_examples"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くのため</font></font> <code>git show</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은 </font> <code>git show</code> <font style="vertical-align: inherit;"> 예제 </font><font style="vertical-align: inherit;">를 </font><font style="vertical-align: inherit;">보려면 </font></font><a href="https://git-scm.com/docs/git-show#_examples"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">클릭 </font><font style="vertical-align: inherit;">하십시오</font><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нажмите </font></font><a href="https://git-scm.com/docs/git-show#_examples"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы </font></font> <code>git show</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> больше </font><font style="vertical-align: inherit;">примеров с </font><font style="vertical-align: inherit;">git show</font><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">单击</font></font><a href="https://git-scm.com/docs/git-show#_examples"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以获取更多</font></font> <code>git show</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例。</font></font>

source: Commit hash
ja: コミットハッシュ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">커밋 해시</font></font>
ru: Устройте хэш
zh_cn: 承诺哈希

source: Example output:
ja: 出力例。
ko: 출력 예 :
ru: Пример вывода:
zh_cn: 输出示例:

source: Explanation: describes (using annotated tags) the current commit, but only with tags containing "NOT A TAG". Since tags cannot have spaces, this never matches a tag and since we want to show a result <code>--always</code>, the command falls back displaying the full (<code>--abbrev=0</code>) sha1 of the commit and it appends an asterisk if the working directory is <code>--dirty</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明：（注釈付きタグを使用して）現在のコミットを説明しますが、「NOT A TAG」を含むタグのみが含まれます。</font><font style="vertical-align: inherit;">タグにスペースを</font></font> <code>--always</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことはできないため、これはタグに一致せず、結果を</font><font style="vertical-align: inherit;">常に</font><font style="vertical-align: inherit;">表示したいので</font><font style="vertical-align: inherit;">--always</font><font style="vertical-align: inherit;">、コマンド</font><font style="vertical-align: inherit;">はコミット</font><font style="vertical-align: inherit;">の完全な（</font></font> <code>--abbrev=0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）sha1を</font><font style="vertical-align: inherit;">表示し</font><font style="vertical-align: inherit;">、作業ディレクトリの場合はアスタリスクを追加しますは</font></font> <code>--dirty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명 : 주석이 달린 태그를 사용하여 현재 커미트를 설명하지만 "NOT A TAG"가 포함 된 태그 만 설명합니다. </font><font style="vertical-align: inherit;">태그는 공백을 가질 수 없으므로 태그와 일치하지 않으며 결과 </font></font> <code>--always</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 표시하려고하기 때문에 </font><font style="vertical-align: inherit;">명령 </font><font style="vertical-align: inherit;">은 커밋 </font><font style="vertical-align: inherit;">의 전체 ( </font></font> <code>--abbrev=0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) sha1을 표시하고 작업 디렉토리 인 경우 별표를 추가합니다. 이다 </font></font> <code>--dirty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Объяснение: описывает (используя аннотированные теги) текущий коммит, но только с тегами, содержащими &laquo;НЕ A TAG&raquo;. </font><font style="vertical-align: inherit;">Поскольку у тегов не может быть пробелов, это никогда не соответствует тегу, и поскольку мы хотим показать результат - </font></font> <code>--always</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , команда возвращается к отображению полного ( </font></font> <code>--abbrev=0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) sha1 коммита и добавляет звездочку, если рабочий каталог является </font></font> <code>--dirty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">说明：描述（使用带注释的标签）当前提交，但仅使用包含&ldquo; NOT A TAG&rdquo;的标签。</font><font style="vertical-align: inherit;">由于标签不能有空格，因此它永远不会与标签匹配，并且由于我们希望显示结果</font></font> <code>--always</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，该命令将回退以显示</font><font style="vertical-align: inherit;">提交</font><font style="vertical-align: inherit;">的完整（</font></font> <code>--abbrev=0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）sha1，并且如果工作目录在目录后附加星号是</font></font> <code>--dirty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Following up on the <a href="https://stackoverflow.com/a/949391/890242">accepted answer</a>, here are two ways to set this up:
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/949391/890242"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">承認</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">された</font><font style="vertical-align: inherit;">回答の</font><font style="vertical-align: inherit;">フォローアップとして、</font><font style="vertical-align: inherit;">これを設定する2つの方法を</font><font style="vertical-align: inherit;">次に</font><font style="vertical-align: inherit;">示します。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/949391/890242"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">허용 된 답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 이어 다음 </font><font style="vertical-align: inherit;">과 같이 두 가지 방법으로 설정할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Следуя </font></font><a href="https://stackoverflow.com/a/949391/890242"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принятому ответу</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вот два способа установить это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">跟踪已</font></font><a href="https://stackoverflow.com/a/949391/890242"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接受的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，以下是两种设置方法：</font></font>

source: For completeness, since no-one has suggested it yet. <code>.git/refs/heads/master</code> is a file that contains only one line: the hash of the latest commit on <code>master</code>. So you could just read it from there.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全を期すため、まだ誰も提案していないため。 </font></font> <code>.git/refs/heads/master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、1行だけが含まれているファイルです：</font></font> <code>master</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最新のコミットのハッシュ</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">だから、そこから読むことができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아무도 그것을 아직 제안하지 않았기 때문에 완전성을 위해. </font></font> <code>.git/refs/heads/master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 한 줄만 포함 된 파일입니다 : </font></font> <code>master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 최신 커밋 해시 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">거기서 읽을 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для полноты, так как никто еще не предложил это. </font></font> <code>.git/refs/heads/master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это файл, который содержит только одну строку: хэш последней фиксации на </font></font> <code>master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Так что вы можете просто прочитать это оттуда.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了完整起见，因为没有人建议过。 </font></font> <code>.git/refs/heads/master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是仅包含一行的文件：</font></font> <code>master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上最新提交的哈希</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，您可以从那里阅读它。</font></font>

source: From here on, use <code>git lastcommit</code> to show the last commit's hash.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここからは、</font></font> <code>git lastcommit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">、最後のコミットのハッシュを表示します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에서 </font></font> <code>git lastcommit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 마지막 커밋의 해시를 표시하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С этого </font><font style="vertical-align: inherit;">момента </font><font style="vertical-align: inherit;">используйте </font></font> <code>git lastcommit</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы показать хэш последнего коммита.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从这里开始，使用</font></font> <code>git lastcommit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">显示最后一次提交的哈希值。</font></font>

source: Further, using %H is another way to get the long hash.
ja: さらに、%H を使用することは、長いハッシュを取得する別の方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 % H를 사용하는 것이 긴 해시를 얻는 또 다른 방법입니다.</font></font>
ru: Далее,использование %H-это еще один способ получить длинный хэш.
zh_cn: 进一步说,使用%H是另一种获得长哈希的方法。

source: Here is another direct-access implementation:
ja: ここにもダイレクトアクセスの実装があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 또 다른 직접 액세스 구현입니다.</font></font>
ru: Вот еще одна реализация с прямым доступом:
zh_cn: 这里是另一个直接访问的实现方式。

source: Here is another way of doing it with :)
ja: ここでは、別の方法でそれを行うことができます :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 다른 방법이 있습니다 :)</font></font>
ru: Вот другой способ сделать это с :)
zh_cn: 这里有另一种方法:)

source: Here is one-liner in Bash shell using direct read from git files:
ja: gitファイルからの直接読み込みを利用したBashシェルのワンライナーです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 git 파일에서 직접 읽은 Bash 셸의 한 줄짜리입니다.</font></font>
ru: Вот один лайнер в оболочке Bash,использующий прямое считывание из git-файлов:
zh_cn: 下面是Bash shell中的单行本,使用直接从git文件中读取的单行本。

source: Here is the one liner that does:
ja: そんなワンライナーがこちら。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 라이너는 다음과 같습니다.</font></font>
ru: Вот единственный лайнер:
zh_cn: 这里有一个内衬是这样的。

source: How can I easily retrieve the hash from the current commit from Git?
ja: Git から現在のコミットのハッシュを簡単に取得するには?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git의 현재 커밋에서 해시를 쉽게 검색하려면 어떻게해야합니까?</font></font>
ru: Как я могу легко извлечь хэш из текущего коммита из Git'а?
zh_cn: 如何从Git中轻松获取当前提交的哈希?

source: How to retrieve the hash for the current commit in Git
ja: Git で現在のコミットのハッシュを取得する方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Git에서 현재 커밋에 대한 해시를 검색하는 방법</font></font>
ru: Как получить хэш для текущего коммита в Git'е.
zh_cn: 如何在Git中检索当前提交的哈希值?

source: However, I would also like to store the identifier of the Git commit (the hash) into a custom TFS workitem field. This way I can examine a workitem in TFS and see what Git changesets are associated with the workitem.
ja: しかし、Git コミットの識別子 (ハッシュ)をカスタムの TFS の workitem フィールドに保存したいとも考えています。これにより、TFS で workitem を調べて、その workitem に関連付けられている Git の変更セットを確認することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 Git 커밋 (해시)의 식별자를 사용자 정의 TFS 작업 항목 필드에 저장하고 싶습니다. </font><font style="vertical-align: inherit;">이렇게하면 TFS에서 작업 항목을 검사하고 Git 변경 세트가 작업 항목과 어떤 관련이 있는지 확인할 수 있습니다.</font></font>
ru: Тем не менее,я также хотел бы сохранить идентификатор Git-комата (хэш)в пользовательском поле рабочего элемента TFS.Таким образом,я могу изучить рабочий элемент в TFS и посмотреть,какие Git'овские changesets связаны с этим рабочим элементом.
zh_cn: 但是,我还想把 Git 提交的标识符(哈希)存储到一个自定义的 TFS 工作项字段中。这样我就可以在 TFS 中检查一个工作项,并查看与该工作项相关联的 Git 修改集。
