Repository: rueisnom/feedback
Catalog: xlf/34/81/82/8/3481828.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="http://www.regular-expressions.info/characters.html">there</a> are 12 characters with special meanings: the backslash <code>\</code>, the caret <code>^</code>, the dollar sign <code>$</code>, the period or dot <code>.</code>, the vertical bar or pipe symbol <code>|</code>, the question mark <code>?</code>, the asterisk or star <code>*</code>, the plus sign <code>+</code>, the opening parenthesis <code>(</code>, the closing parenthesis <code>)</code>, and the opening square bracket <code>[</code>, the opening curly brace <code>{</code>, These special characters are often called "metacharacters".
es: <a href="http://www.regular-expressions.info/characters.html">Hay</a> 12 caracteres con significados especiales: la barra invertida <code>\</code> , el s&iacute;mbolo de intercalaci&oacute;n <code>^</code> , el signo de d&oacute;lar <code>$</code> , el punto o el punto <code>.</code> , el s&iacute;mbolo de barra vertical o tubo <code>|</code> , el signo de interrogaci&oacute;n <code>?</code> , el asterisco o la estrella <code>*</code> , el signo m&aacute;s <code>+</code> , el par&eacute;ntesis de apertura <code>(</code> el par&eacute;ntesis de cierre <code>)</code> y el corchete de apertura <code>[</code> , la llave de apertura <code>{</code> , estos caracteres especiales a menudo se denominan "metacaracteres".
ja: 特殊な意味を持つ12文字<a href="http://www.regular-expressions.info/characters.html">があり</a>ます：バックスラッシュ <code>\</code> 、キャレット <code>^</code> 、ドル記号 <code>$</code> 、ピリオドまたはドット <code>.</code> 、縦棒またはパイプ記号 <code>|</code> 、疑問符 <code>?</code> 、アスタリスクまたはスター <code>*</code> 、プラス記号 <code>+</code> 、左括弧 <code>(</code> 、右括弧 <code>)</code> 、および左大括弧 <code>[</code> 、左中括弧 <code>{</code> 、これらの特殊文字は、しばしば「メタ文字」と呼ばれます。
ko: 특별한 의미를 가진 12 개의 문자가 있습니다 : 백 슬래시 <code>\</code> , 캐럿 <code>^</code> , 달러 기호 <code>$</code> , 마침표 또는 점 <code>.</code> , 수직 막대 또는 파이프 기호 <code>|</code> , 물음표 <code>?</code> , 별표 또는 별표 <code>*</code> , 더하기 부호 <code>+</code> , 여는 괄호 <code>(</code> , 닫는 괄호 <code>)</code> 및 여는 대괄호 <code>[</code> , 여는 중괄호 <code>{</code> , 이러한 특수 문자는 종종 "메타 문자"라고합니다.
ru: <a href="http://www.regular-expressions.info/characters.html">Есть</a> 12 символов с особым значением: обратная косая черта <code>\</code> , символ каретки <code>^</code> , знак доллара <code>$</code> , точка или точка <code>.</code> , вертикальная черта или символ трубы <code>|</code> знак вопроса <code>?</code> , звездочка или звездочка <code>*</code> , знак плюс <code>+</code> , открывающая скобка <code>(</code> , закрывающая скобка <code>)</code> и открывающая квадратная скобка <code>[</code> , открывающая фигурная скобка <code>{</code> , эти специальные символы часто называют &laquo;метасимволами&raquo;.
zh_cn: <a href="http://www.regular-expressions.info/characters.html">有</a> 12个具有特殊含义的字符：反斜杠 <code>\</code> ，脱字号 <code>^</code> ，美元符号 <code>$</code> ，句点或点 <code>.</code> ，竖线或竖线符号 <code>|</code> ，问号 <code>?</code> ，星号或星号 <code>*</code> ，加号 <code>+</code> ，左括号 <code>(</code> ，右括号 <code>)</code> 和左方括号 <code>[</code> ，大括号 <code>{</code> ) ，这些特殊字符通常称为&ldquo;元字符&rdquo;。

source: <a href="https://explainjava.com/split-string-java/">Here</a> is a big overview of these methods and the most common examples (how to split by dot, slash, question mark, etc.)
es: <a href="https://explainjava.com/split-string-java/">Aqu&iacute;</a> hay una gran descripci&oacute;n de estos m&eacute;todos y los ejemplos m&aacute;s comunes (c&oacute;mo dividir por punto, barra, signo de interrogaci&oacute;n, etc.)
ja: これらのメソッドと最も一般的な例の大まかな概要を<a href="https://explainjava.com/split-string-java/">以下に</a>示します（ドット、スラッシュ、疑問符などで分割する方法）。
ko: <a href="https://explainjava.com/split-string-java/">다음</a> 은 이러한 방법과 가장 일반적인 예 (점, 슬래시, 물음표 등으로 나누는 방법)에 대한 큰 개요입니다.
ru: <a href="https://explainjava.com/split-string-java/">Вот</a> большой обзор этих методов и наиболее распространенных примеров (как разделить на точки, косая черта, знак вопроса и т. Д.)
zh_cn: <a href="https://explainjava.com/split-string-java/">这</a>是这些方法和最常见示例（如何按点，斜杠，问号等进行拆分）的概述。

source: <strong><em>String Split with multiple characters using Regex</em></strong>
es: <strong><em>Divisi&oacute;n de cadenas con m&uacute;ltiples caracteres usando Regex</em></strong>
ja: <strong><em>正規表現を使用した複数の文字による文字列分割</em></strong>
ko: <strong><em>정규식을 사용하여 여러 문자로 문자열 분할</em></strong>
ru: <strong><em>Разделение строк с несколькими символами с использованием регулярных выражений</em></strong>
zh_cn: <strong><em>使用正则表达式将字符串拆分为多个字符</em></strong>

source: <strong>Use Pattern.split and precompile the pattern if using a complex delimiter and you care about performance.</strong>
es: <strong>Use Pattern.split y precompile el patr&oacute;n si usa un delimitador complejo y le preocupa el rendimiento.</strong>
ja: <strong>複雑な区切り文字を使用し、パフォーマンスを重視する場合は、Pattern.splitを使用してパターンをプリコンパイルします。</strong>
ko: <strong>복잡한 구분 기호를 사용하고 성능에 관심이있는 경우 Pattern.split을 사용하고 패턴을 사전 컴파일하십시오.</strong>
ru: <strong>Используйте Pattern.split и прекомпилируйте шаблон, если используете сложный разделитель, и вы заботитесь о производительности.</strong>
zh_cn: <strong>如果使用复杂的定界符并且您关心性能，请使用Pattern.split并预编译模式。</strong>

source: <strong>Use String.split for a one-character delimiter or you don't care about performance</strong>
es: <strong>Use String.split para un delimitador de un car&aacute;cter o no le importa el rendimiento</strong>
ja: <strong>1文字の区切り文字としてString.splitを使用するか、パフォーマンスを気にしない</strong>
ko: <strong>한 문자 구분 기호로 String.split을 사용하거나 성능에 신경 쓰지 마십시오.</strong>
ru: <strong>Используйте String.split для односимвольного разделителя, или вы не заботитесь о производительности</strong>
zh_cn: <strong>将String.split用于一个字符分隔符，或者您不关心性能</strong>

source: An alternative to processing the string directly would be to use a regular expression with capturing groups. This has the advantage that it makes it straightforward to imply more sophisticated constraints on the input. For example, the following splits the string into two parts, and ensures that both consist only of digits:
es: Una alternativa al procesamiento directo de la cadena sería utilizar una expresión regular con grupos de captura.Esto tiene la ventaja de que hace que sea sencillo implicar restricciones más sofisticadas en la entrada.Por ejemplo,a continuación se divide la cadena en dos partes,y se asegura que ambas consistan sólo en dígitos:
ja: 文字列を直接処理する代わりに、グループをキャプチャする正規表現を使用することができます。これには、入力に対してより洗練された制約を簡単に与えることができるという利点があります。例えば、以下の例では、文字列を2つの部分に分割し、両方とも数字のみで構成されることを保証しています。
ko: 문자열을 직접 처리하는 대안은 캡처 그룹과 함께 정규식을 사용하는 것입니다. 이것은 입력에 대한보다 복잡한 제약을 암시하는 것이 간단하다는 장점이 있습니다. 예를 들어, 다음은 문자열을 두 부분으로 나누고 둘 다 숫자로만 구성되도록합니다.
ru: Альтернативой прямой обработке строки было бы использование регулярного выражения с группами захвата.Преимущество такого подхода заключается в том,что он подразумевает более сложные ограничения на входные данные.Например,следующее разбивает строку на две части и гарантирует,что обе части состоят только из цифр:
zh_cn: 直接处理字符串的另一种方法是使用带有捕获组的正则表达式。这样做的好处是可以直接对输入进行更复杂的约束。例如,下面的例子是将字符串分成两部分,并确保两部分都只由数字组成。

source: And as expected it will print:
es: Y como se esperaba,se imprimirá:
ja: そして予想通り印刷されます。
ko: 그리고 예상대로 인쇄됩니다.
ru: И,как и ожидалось,он напечатает:
zh_cn: 果然不出所料,它会打印出来。

source: As mentioned by everyone, split() is the best option which may be used in your case. An alternative method can be using substring().
es: Como todos han mencionado,split()es la mejor opción que se puede utilizar en su caso.Un método alternativo puede ser el uso de substring().
ja: みんなが言っているように、split()はあなたの場合に使用できる最良のオプションです。別の方法として、 substring()を使うこともできます。
ko: 모두가 언급했듯이 split ()은 귀하의 경우에 사용될 수있는 최상의 옵션입니다. 대체 방법은 substring ()을 사용할 수 있습니다.
ru: Как все уже упоминали,функция split()является лучшим вариантом,который может быть использован в вашем случае.Альтернативным методом может быть использование подстроки().
zh_cn: 正如大家所提到的,split()是最好的选择,在你的情况下可以使用。另一种方法是使用substring()。

source: As the pattern is fixed in this instance, it can be compiled in advance and stored as a static member (initialised at class load time in the example). The regular expression is:
es: Como el patrón es fijo en este caso,puede ser compilado por adelantado y almacenado como un miembro estático (inicializado en el tiempo de carga de la clase en el ejemplo).La expresión regular es:
ja: このインスタンスではパターンが固定されているので、あらかじめコンパイルして静的メンバとして格納しておくことができます(例ではクラスのロード時に初期化されています)。正規表現は
ko: 이 인스턴스에서 패턴이 고정되면 패턴을 미리 컴파일하여 정적 멤버 (예 : 클래스로드시 초기화 됨)로 저장할 수 있습니다. 정규식은 다음과 같습니다.
ru: Так как в данном примере шаблон фиксирован,его можно заранее скомпилировать и сохранить в виде статического члена (в примере инициализируется во время загрузки класса).Регулярное выражение:
zh_cn: 由于这个实例中的模式是固定的,所以可以提前编译并作为静态成员存储(在示例中的类加载时初始化)。正则表达式为。

source: Assume that if <code>-</code> does not exists in your string, it returns the given string, and you will not get any exception.
es: Suponga que si <code>-</code> no existe en su cadena, devuelve la cadena dada y no obtendr&aacute; ninguna excepci&oacute;n.
ja: <code>-</code> が文字列に存在しない場合は、指定された文字列を返し、例外は発生しないと想定します。
ko: <code>-</code> 문자열에 - 가 없으면 주어진 문자열을 반환하고 예외가 발생하지 않는다고 가정하십시오.
ru: Предположим, что если <code>-</code> не существует в вашей строке, он возвращает данную строку, и вы не получите никакого исключения.
zh_cn: 假设字符串中不存在 <code>-</code> ，则返回给定的字符串，并且不会出现任何异常。

source: Assuming, that
es: Asumiendo,que
ja: 仮に
ko: 가정하면
ru: Если предположить,что
zh_cn: 假设:

source: But do not expect the same output across all JDK versions. I have seen <a href="https://bugs.openjdk.java.net/browse/JDK-8043324">one bug</a> which exists in some JDK versions where the first null string has been ignored. This bug is not present in the latest JDK version, but it exists in some versions between JDK 1.7 late versions and 1.8 early versions.
es: Pero no espere el mismo resultado en todas las versiones de JDK. He visto <a href="https://bugs.openjdk.java.net/browse/JDK-8043324">un error</a> que existe en algunas versiones de JDK donde la primera cadena nula ha sido ignorada. Este error no est&aacute; presente en la &uacute;ltima versi&oacute;n de JDK, pero existe en algunas versiones entre las versiones finales JDK 1.7 y 1.8 versiones anteriores.
ja: ただし、すべてのJDKバージョンで同じ出力を期待しないでください。 最初のnull文字列が無視された一部のJDKバージョンに存在する<a href="https://bugs.openjdk.java.net/browse/JDK-8043324">バグ</a>を1つ見ました。 このバグは最新のJDKバージョンには存在しませんが、JDK 1.7の最新バージョンと1.8の初期バージョンの間の一部のバージョンに存在します。
ko: 그러나 모든 JDK 버전에서 동일한 출력을 기대하지는 마십시오. 첫 번째 null 문자열이 무시 된 일부 JDK 버전에 존재하는 <a href="https://bugs.openjdk.java.net/browse/JDK-8043324">버그</a> 가 하나 있습니다. 이 버그는 최신 JDK 버전에는 없지만 JDK 1.7 최신 버전과 1.8 초기 버전의 일부 버전에 존재합니다.
ru: Но не ожидайте одинакового вывода во всех версиях JDK. Я видел <a href="https://bugs.openjdk.java.net/browse/JDK-8043324">одну ошибку,</a> которая существует в некоторых версиях JDK, где первая пустая строка была проигнорирована. Эта ошибка отсутствует в последней версии JDK, но существует в некоторых версиях между поздними версиями JDK 1.7 и ранними версиями 1.8.
zh_cn: 但是不要期望所有JDK版本都具有相同的输出。 我已经看到某些JDK版本中存在<a href="https://bugs.openjdk.java.net/browse/JDK-8043324">一个错误</a> ，其中第一个空字符串已被忽略。 此错误在最新的JDK版本中不存在，但在JDK 1.7后期版本和1.8早期版本之间的某些版本中存在。

source: Check out the <code>split()</code> method in the <code>String</code> class on javadoc.
es: Consulte el m&eacute;todo <code>split()</code> en la clase <code>String</code> en javadoc.
ja: javadocの <code>String</code> クラスの <code>split()</code> メソッドを確認してください。
ko: javadoc의 <code>String</code> 클래스에서 <code>split()</code> 메소드를 확인하십시오.
ru: Проверьте метод <code>split()</code> в классе <code>String</code> на javadoc.
zh_cn: 在javadoc的 <code>String</code> 类中签出 <code>split()</code> 方法。

source: Check out the <code>split()</code> method in the <code>String</code> class.
es: Echa un vistazo al m&eacute;todo <code>split()</code> en la clase <code>String</code> .
ja: <code>String</code> クラスの <code>split()</code> メソッドを確認してください。
ko: <code>String</code> 클래스에서 <code>split()</code> 메소드를 확인하십시오.
ru: Проверьте метод <code>split()</code> в классе <code>String</code> .
zh_cn: 在 <code>String</code> 类中签出 <code>split()</code> 方法。

source: Else, you can use StringTokenizer:
es: Si no,puedes usar StringTokenizer:
ja: それ以外の場合は、StringTokenizerを使用することができます。
ko: 그렇지 않으면 StringTokenizer를 사용할 수 있습니다.
ru: Иначе,ты можешь использовать StringTokenizer:
zh_cn: Else,你可以使用StringTokenizer。

source: For example, if <code>"-333"</code> should return in <code>[,333]</code> or if it is an error. Can <code>"333-333-33"</code> be separated in <code>[333,333-33] or [333-333,33]</code> or is it an error? And so on.
es: Por ejemplo, si <code>"-333"</code> deber&iacute;a regresar en <code>[,333]</code> o si es un error. &iquest;Puede <code>"333-333-33"</code> separarse en <code>[333,333-33] or [333-333,33]</code> o es un error? Y as&iacute;.
ja: たとえば、 <code>"-333"</code> が <code>[,333]</code> 返される場合、またはエラーの場合。 <code>"333-333-33"</code> を <code>[333,333-33] or [333-333,33]</code> ことはできますか、それともエラーですか？ 等々。
ko: 예를 들어 <code>"-333"</code> 이 <code>[,333]</code> 으로 반환되거나 오류 인 경우입니다. <code>"333-333-33"</code> 을 <code>[333,333-33] or [333-333,33]</code> 에서 분리 할 수 ​​있습니까 , 아니면 오류입니까? 등등.
ru: Например, если <code>"-333"</code> должно возвращаться в <code>[,333]</code> или если это ошибка. Можно ли <code>"333-333-33"</code> в <code>[333,333-33] or [333-333,33]</code> или это ошибка? И так далее.
zh_cn: 例如，如果 <code>"-333"</code> 应返回 <code>[,333]</code> 或是错误。 是否可以在 <code>[333,333-33] or [333-333,33]</code> <code>"333-333-33"</code> 分开，还是错误？ 等等。

source: For simple use cases <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"><code>String.split()</code></a> should do the job. If you use guava, there is also a <a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a> class which allows chaining of different string operations and supports <a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">CharMatcher</a>:
es: Para casos de uso simple, <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String.split()</code> </a> deber&iacute;a hacer el trabajo. Si usa guayaba, tambi&eacute;n hay una clase <a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a> que permite el encadenamiento de diferentes operaciones de cadena y admite <a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">CharMatcher</a> :
ja: 単純な使用例では、 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String.split()</code> </a>が適切に機能します。 <a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">guava</a>を使用する場合、さまざまな文字列操作のチェーンを可能にし、 CharMatcherをサポートする<a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a>クラスもあります。
ko: 간단한 사용 사례의 경우 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String.split()</code> </a> 이 작업을 수행해야합니다. 구아바를 사용하는 경우 다른 문자열 작업을 연결하고 <a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">CharMatcher를</a> 지원하는 <a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a> 클래스도 있습니다.
ru: Для простых случаев использования <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String.split()</code> </a> должен делать эту работу. Если вы используете guava, есть также класс <a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter,</a> который позволяет связывать различные строковые операции и поддерживает <a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">CharMatcher</a> :
zh_cn: 对于简单的用例， <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String.split()</code> </a>应该可以完成工作。 如果使用番石榴，则还有一个<a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a>类，该类允许链接不同的字符串操作并支持<a href="https://google.github.io/guava/releases/snapshot-jre/api/docs/com/google/common/base/CharMatcher.html">CharMatcher</a> ：

source: Good test candidates should include:
es: Los buenos candidatos para el examen deben incluir:
ja: 良いテストの候補者は、次のようなものが含まれている必要があります。
ko: 좋은 시험 응시자는 다음을 포함해야합니다.
ru: Хорошие тестовые кандидаты должны включать в себя:
zh_cn: 优秀的考生应包括:

source: Google Guava Splitter:
ja: Googleグアバのスプリッター。
ko: 구글 구아바 스플리터 :
ru: Гугл Гуава Сплиттер:
zh_cn: 谷歌番石榴分裂器。

source: Here are two ways two achieve it.
es: Aquí hay dos formas de lograrlo.
ja: ここでは、2つの方法で実現しています。
ko: 두 가지 방법으로 달성 할 수 있습니다.
ru: Вот два способа достичь этого.
zh_cn: 下面是两个实现的方法两个。

source: Here many examples for split string but I little code optimized.
es: Aquí hay muchos ejemplos de cadenas divididas pero poco código optimizado.
ja: ここでは、文字列を分割するための多くの例がありますが、私は少しコードが最適化されています。
ko: 분할 문자열에 대한 많은 예제가 있지만 코드 최적화가 거의 없습니다.
ru: Здесь много примеров для сплит-строк,но я немного оптимизировал код.
zh_cn: 这里有很多拆分字符串的例子,但我对代码进行了少许优化。

source: How to split a string in Java
es: Cómo dividir una cadena en Java
ja: Javaで文字列を分割する方法
ko: Java에서 문자열을 분할하는 방법
ru: Как разделить строку на Java
zh_cn: 如何在Java中分割一个字符串

source: I have a string, <code>"004-034556"</code>, that I want to split into two strings:
es: Tengo una cadena, <code>"004-034556"</code> , que quiero dividir en dos cadenas:
ja: 2つの文字列に分割したい文字列 <code>"004-034556"</code> があります。
ko: 문자열 <code>"004-034556"</code> 이 있는데 두 문자열로 분할하고 싶습니다.
ru: У меня есть строка <code>"004-034556"</code> , которую я хочу разделить на две строки:
zh_cn: 我有一个字符串 <code>"004-034556"</code> ，我想分成两个字符串：

source: I just wanted to write an algorithm instead of using Java built-in functions:
es: Sólo quería escribir un algoritmo en lugar de usar las funciones incorporadas de Java:
ja: Javaの組み込み関数を使うのではなく、アルゴリズムを書きたかっただけです。
ko: Java 내장 함수를 사용하는 대신 알고리즘을 작성하고 싶었습니다.
ru: Я просто хотел написать алгоритм вместо использования встроенных функций Java:
zh_cn: 我只是想写一个算法,而不是用Java内置的函数来代替。

source: I would recommend using commong-lang, since usually it contains a lot of stuff that's usable. However, if you don't need it for anything else than doing a split, then implementing yourself or escaping the regex is a better option.
es: Recomendaría usar el lenguaje común,ya que normalmente contiene un montón de cosas que son utilizables.Sin embargo,si no lo necesitas para nada más que para hacer un split,entonces implementarse o escapar del regex es una mejor opción.
ja: commong-lang を使うことをお勧めします。しかし、スプリット以外に必要ないのであれば、自分で実装するか正規表現をエスケープする方が良いでしょう。
ko: 일반적으로 사용 가능한 많은 것들이 포함되어 있기 때문에 commong-lang을 사용하는 것이 좋습니다. 그러나 분할을 수행하는 것 외에 다른 작업이 필요하지 않으면 자신을 구현하거나 정규 표현식을 탈출하는 것이 더 나은 옵션입니다.
ru: Я бы порекомендовал использовать обычный язык,так как обычно он содержит много полезного.Однако,если он вам не нужен ни для чего,кроме как для разделения,то лучшим вариантом будет реализация себя или уход от регекса.
zh_cn: 我建议使用commong-lang,因为通常它包含了很多可以使用的东西。但是,如果你除了做拆分之外不需要它,那么自己实现或者转义的regex是更好的选择。

source: If performance is an issue, and your delimiter is not one of the above, you should pre-compile a regular expression pattern which you can then reuse.
es: Si el rendimiento es un problema,y su delimitador no es uno de los anteriores,debe precompilar un patrón de expresión regular que luego puede reutilizar.
ja: パフォーマンスに問題があり、デリミタが上記のいずれでもない場合は、正規表現パターンを事前にコンパイルして再利用する必要があります。
ko: 성능이 문제이고 분리 문자가 위의 것이 아닌 경우 정규 표현식 패턴을 사전 컴파일 한 후 재사용 할 수 있습니다.
ru: Если производительность является проблемой,и ваш разделитель не является одним из вышеперечисленных,то необходимо предварительно скомпилировать шаблон регулярного выражения,который затем можно будет использовать повторно.
zh_cn: 如果性能是一个问题,而你的分隔符不是上述的一种,你应该预先编译一个正则表达式模式,然后你可以重复使用。

source: If performance is not an issue, or if the delimiter is a single character that is not a regular expression special character (i.e., not one of <code>.$|()[{^?*+\</code>) then you can use <code>String.split</code>.
es: Si el rendimiento no es un problema, o si el delimitador es un solo car&aacute;cter que no es un car&aacute;cter especial de expresi&oacute;n regular (es decir, no es uno de <code>.$|()[{^?*+\</code> ), Puede usar <code>String.split</code> .
ja: パフォーマンスに問題がない場合、または区切り文字が正規表現の特殊文字ではない単一の文字（つまり、 <code>.$|()[{^?*+\</code> ）である場合は、 <code>String.split</code> を使用できます。
ko: 성능이 문제가 아니거나 분리 문자가 정규 표현식 특수 문자가 아닌 단일 문자 (예 : <code>.$|()[{^?*+\</code> 중 하나가 아닌) 인 경우 <code>String.split</code> 을 사용할 수 있습니다.
ru: Если производительность не является проблемой или если разделитель представляет собой один символ, который не является специальным символом регулярного выражения (т. <code>String.split</code> Не является одним из <code>.$|()[{^?*+\</code> ), Тогда вы можете использовать String.split .
zh_cn: 如果性能不是问题，或者分隔符是不是正则表达式特殊字符的单个字符（即，不是 <code>.$|()[{^?*+\</code> ），那么可以使用 <code>String.split</code> 。

source: If the array length is not 2, then the string was not in the format: <code>string-string</code>.
es: Si la longitud de la matriz no es 2, entonces la cadena no ten&iacute;a el formato: <code>string-string</code> .
ja: 配列の長さが2でない場合、文字列は <code>string-string</code> の形式ではありませんでした。
ko: 배열 길이가 2가 아닌 경우 문자열은 <code>string-string</code> 형식이 아닙니다.
ru: Если длина массива не равна 2, тогда строка была не в формате: <code>string-string</code> .
zh_cn: 如果数组长度不是2，则字符串的格式不为： <code>string-string</code> 。

source: If you'd like to limit the number of resulting parts, then you can supply the desired number as 2nd argument of <code>split()</code> method.
es: Si desea limitar el n&uacute;mero de partes resultantes, puede proporcionar el n&uacute;mero deseado como segundo argumento del m&eacute;todo <code>split()</code> .
ja: 結果のパーツの数を制限したい場合は、 <code>split()</code> メソッドの2番目の引数として必要な数を指定できます。
ko: 결과 부분의 수를 제한하려면 <code>split()</code> 메서드의 두 번째 인수로 원하는 숫자를 제공 할 수 있습니다.
ru: Если вы хотите ограничить количество получаемых деталей, вы можете указать нужное число в качестве второго аргумента метода <code>split()</code> .
zh_cn: 如果您想限制生成零件的数量，则可以提供所需的数量作为 <code>split()</code> 方法的第二个参数。

source: If you'd like to retain the split character in the resulting parts, then make use of <a href="http://www.regular-expressions.info/lookaround.html">positive lookaround</a>. In case you want to have the split character to end up in left hand side, use positive lookbehind by prefixing <code>?&lt;=</code> group on the pattern.
es: Si desea conservar el car&aacute;cter dividido en las partes resultantes, utilice <a href="http://www.regular-expressions.info/lookaround.html">una apariencia positiva</a> . En caso de que desee que el car&aacute;cter dividido termine en el lado izquierdo, use una mirada hacia atr&aacute;s positiva con el prefijo <code>?&lt;=</code> Group en el patr&oacute;n.
ja: 結果のパーツの分割文字を保持したい場合は、 <a href="http://www.regular-expressions.info/lookaround.html">ポジティブルックアラウンド</a>を利用してください。 分割文字を左側に配置したい場合は、パターンの前に <code>?&lt;=</code> グループを付けて、肯定的な後読みを使用します。
ko: 결과 부분에 분할 문자를 유지하려면 <a href="http://www.regular-expressions.info/lookaround.html">긍정적 인 둘러보기를</a> 사용 하십시오 . 분할 문자를 왼쪽으로 끝내려면 패턴에 접두사 <code>?&lt;=</code> 그룹을 지정하여 긍정적 인 lookbehind를 사용하십시오.
ru: Если вы хотите сохранить символ разделения в результирующих частях, используйте <a href="http://www.regular-expressions.info/lookaround.html">позитивный обзор</a> . Если вы хотите, чтобы символ разделения находился в левой части, используйте положительный вид сзади с префиксом <code>?&lt;=</code> Group в шаблоне.
zh_cn: 如果您想在结果部分中保留分割字符，请使用<a href="http://www.regular-expressions.info/lookaround.html">正向环视</a> 。 如果要使分割字符以左结尾，请在模式前面加上 <code>?&lt;=</code> group，以使用正向后视。
