Repository: rueisnom/feedback
Catalog: xlf/34/81/82/8/3481828.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This split (regex) takes a regex as an argument. Remember to escape the regex special characters, like period/dot.
es: Esta división (regex)toma un regex como argumento.Recuerde escapar de los caracteres especiales de la regex,como el punto y coma.
ja: このスプリット(正規表現)は正規表現を引数に取ります。ピリオドなどの正規表現の特殊文字をエスケープすることを忘れないでください。
ko: 이 분할 (정규식)은 정규식을 인수로 사용합니다. 마침표 / 점과 같은 정규 표현식 특수 문자를 피하십시오.
ru: Это разделение (регекс)принимает регекс в качестве аргумента.Не забывайте избегать специальных символов регекса,таких как точка пародонта.
zh_cn: 这个 split (regex)以一个 regex 作为参数。记住要转义掉gex中的特殊字符,比如句号dot。

source: This will split your string into 2 parts. The first element in the array will be the part containing the stuff before the <code>-</code>, and the 2nd element in the array will contain the part of your string after the <code>-</code>.
es: Esto dividir&aacute; su cadena en 2 partes. El primer elemento en la matriz ser&aacute; la parte que contiene las cosas antes de <code>-</code> , y el segundo elemento en la matriz contendr&aacute; la parte de su cadena despu&eacute;s de <code>-</code> .
ja: これにより、文字列が2つの部分に分割されます。 配列の最初の要素は <code>-</code> の前の要素を含む部分であり、配列の2番目の要素は <code>-</code> の後の文字列の部分です。
ko: 이렇게하면 줄이 두 부분으로 나뉩니다. 배열의 첫 번째 요소는 <code>-</code> 앞에 물건을 포함하는 부분이되고 배열의 두 번째 요소는 <code>-</code> 뒤에 문자열 부분을 포함합니다.
ru: Это разделит вашу строку на 2 части. Первым элементом в массиве будет часть, содержащая материал перед <code>-</code> , а 2-й элемент в массиве будет содержать часть вашей строки после <code>-</code> .
zh_cn: 这会将您的字符串分成两部分。 数组中的第一个元素将是在 <code>-</code> 之前包含内容的部分，而数组中的第二个元素将在 <code>-</code> 之后包含字符串的一部分。

source: To split a string, use <code>String.split(regex)</code>:
es: Para dividir una cadena, use <code>String.split(regex)</code> :
ja: 文字列を分割するには、 <code>String.split(regex)</code> を使用します。
ko: 문자열을 분할하려면 <code>String.split(regex)</code> .
ru: Чтобы разбить строку, используйте <code>String.split(regex)</code> :
zh_cn: 要拆分字符串，请使用 <code>String.split(regex)</code> ：

source: To split a string, uses String.split(regex). Review the following examples:
es: Para dividir una cadena,usa String.split(regex).Revise los siguientes ejemplos:
ja: 文字列を分割するには、String.split(regex)を使用します。以下の例を確認してください。
ko: 문자열을 분할하려면 String.split (regex)를 사용하십시오. 다음 예를 검토하십시오.
ru: Для разделения строки используется String.split(regex).Просмотрите следующие примеры:
zh_cn: 要分割一个字符串,使用String.split(regex)。请看下面的例子。

source: To summarize: there are at least five ways to split a string in Java:
es: Para resumir:hay al menos cinco maneras de dividir una cadena en Java:
ja: 要約すると、Javaで文字列を分割する方法は少なくとも5つあります。
ko: 요약 : Java에서 문자열을 분할하는 방법은 최소한 다섯 가지가 있습니다.
ru: Подводя итог:существует как минимум пять способов разделения строки на Java:
zh_cn: 总结一下:在Java中至少有5种方法可以拆分字符串。

source: To test beforehand if the string contains certain character(s), just use <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"><code>String#contains()</code></a>.
es: Para probar de antemano si la cadena contiene ciertos caracteres, solo use la <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"> <code>String#contains()</code> </a> .
ja: 文字列に特定の文字が含まれているかどうかを事前にテストするには、 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"> <code>String#contains()</code> を</a>使用します。
ko: 문자열에 특정 문자가 포함되어 있는지 미리 테스트하려면 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"> <code>String#contains()</code> </a> .
ru: Чтобы заранее проверить, содержит ли строка определенный символ (ы), просто используйте <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"> <code>String#contains()</code> </a> .
zh_cn: 要预先测试字符串是否包含某些字符，只需使用<a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#contains-java.lang.CharSequence-"> <code>String#contains()</code> 即可</a> 。

source: Use <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">org.apache.commons.lang.StringUtils'</a> split method which can split strings based on the character or string you want to split.
es: Use <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">el</a> m&eacute;todo de divisi&oacute;n org.apache.commons.lang.StringUtils que puede dividir cadenas en funci&oacute;n del car&aacute;cter o cadena que desea dividir.
ja: 分割する文字または文字列に基づいて文字列を分割できる<a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">org.apache.commons.lang.StringUtilsの</a>分割メソッドを使用します。
ko: 분할하려는 문자 또는 문자열을 기준으로 문자열을 분할 할 수있는 <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">org.apache.commons.lang.StringUtils의</a> split 메소드를 사용하십시오.
ru: Используйте метод разделения <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">org.apache.commons.lang.StringUtils,</a> который может разделять строки на основе символа или строки, которую вы хотите разделить.
zh_cn: 使用<a href="http://commons.apache.org/proper/commons-lang/javadocs/api-2.6/org/apache/commons/lang/StringUtils.html#split(java.lang.String,%20char)">org.apache.commons.lang.StringUtils的</a> split方法，该方法可以根据要拆分的字符或字符串拆分字符串。

source: WAY 1: As you have to split two numbers by a special character you can use regex
es: VÍA 1:Como tienes que dividir dos números por un carácter especial puedes usar regex
ja: 方法 1.2つの数値を特殊文字で分割する必要がある場合は、正規表現である
ko: 방법 1 : 특수 문자로 두 숫자를 나눌 때 정규식을 사용할 수 있습니다
ru: WAY 1:Так как вы должны разделить две цифры специальным символом,вы можете использовать регекс
zh_cn: 方法1:因为你必须用一个特殊的字符来分割两个数字,你可以使用regex

source: WAY 2: Using the string split method
es: CAMINO 2:Usando el método de división de la cadena
ja: WAY 2.文字列分割法を使う
ko: WAY 2 : 문자열 분리 방법 사용
ru: WAY 2:Использование метода разделения строк
zh_cn: 方法2:使用字符串分割法

source: When there is a positive-width match at the beginning of the input sequence then an empty leading substring is included at the beginning of the resulting array. A zero-width match at the beginning however never produces such empty leading substring.
es: Cuando hay una coincidencia de anchura positiva al principio de la secuencia de entrada,entonces se incluye una subcadena principal vacía al principio de la matriz resultante.Sin embargo,una coincidencia de ancho cero al principio nunca produce una subcadena principal tan vacía.
ja: 入力シーケンスの先頭に正の幅のマッチがあった場合、結果として得られる配列の先頭には空の部分文字列が含まれます。しかし、先頭にゼロ幅のマッチがあった場合、そのような空の先頭部分文字列は生成されません。
ko: 입력 시퀀스의 시작 부분에 양의 너비가 일치하면 결과 배열의 시작 부분에 빈 선행 부분 문자열이 포함됩니다. 그러나 처음에 너비가 0이면 일치하는 빈 선행 부분 문자열이 생성되지 않습니다.
ru: При положительном совпадении по ширине в начале входной последовательности в начало результирующего массива включается пустая ведущая подстрока.Однако при нулевом значении ширины в начале массива такая пустая ведущая подстрока никогда не появится.
zh_cn: 当输入序列的开头有一个正宽度的匹配,那么在生成的数组的开头就会包含一个空的前导子串。但是,在开始时的零宽度匹配不会产生这样的空前导数组。

source: With Java 8:
es: Con Java 8:
ja: Java 8で。
ko: 자바 8 :
ru: С Java 8:
zh_cn: 随着Java 8。

source: With defining the according test results, you can specify the behaviour.
es: Con la definición de los resultados de las pruebas correspondientes,se puede especificar el comportamiento.
ja: テスト結果を定義することで、動作を指定することができます。
ko: 해당 테스트 결과를 정의하면 동작을 지정할 수 있습니다.
ru: Определив результаты теста,вы можете задать поведение.
zh_cn: 有了根据测试结果的定义,你可以指定行为。

source: You can simply do as follows:
es: Puedes hacer simplemente lo siguiente:
ja: 単純に以下のようにすればいいのです。
ko: 다음과 같이 간단하게 수행 할 수 있습니다.
ru: Вы можете просто сделать следующее:
zh_cn: 你可以简单地做到以下几点。

source: You can simply use StringTokenizer to split a string in two or more parts whether there are any type of delimiters:
es: Simplemente puede utilizar StringTokenizer para dividir una cadena en dos o más partes si hay algún tipo de delimitadores:
ja: 区切り文字の種類に関わらず、StringTokenizerを使って文字列を2つ以上の部分に分割することができます。
ko: StringTokenizer를 사용하여 구분 기호 유형이 있는지 여부에 관계없이 문자열을 둘 이상의 부분으로 분할 할 수 있습니다.
ru: Вы можете просто использовать StringTokenizer,чтобы разделить строку на две или более частей,независимо от того,существует ли какой-либо тип разделителей:
zh_cn: 你可以简单地使用StringTokenizer将一个字符串分成两部分或更多部分,无论是否有任何类型的分隔符。

source: You can split a string by a hyphen/character by using the following statement:
es: Se puede dividir una cadena por un guión usando la siguiente declaración:
ja: 文字列をハイフン文字で分割するには、以下のステートメントを使用します。
ko: 다음 명령문을 사용하여 문자열을 하이픈 / 문자로 분할 할 수 있습니다.
ru: Вы можете разделить строку по дефисному символу,используя следующее утверждение:
zh_cn: 你可以使用下面的语句,用连字符来分割一个字符串。

source: You can split a string by a line break by using the following statement:
es: Puedes dividir una cadena por un salto de línea usando la siguiente declaración:
ja: 文字列を改行で分割するには、以下のようなステートメントを使用します。
ko: 다음 명령문을 사용하여 줄 바꿈으로 문자열을 분할 할 수 있습니다.
ru: Вы можете разделить строку на разрыв,используя следующий оператор:
zh_cn: 你可以使用下面的语句来分割一个字符串。

source: You can try like this also
es: Puedes intentarlo así también
ja: こんな風にしてみてもいいかもしれません。
ko: 이것도 시도해 볼 수 있습니다
ru: Вы можете попробовать так же
zh_cn: 你也可以尝试这样做

source: You can use Split():
es: Puedes usar Split():
ja: Split()を使うことができます。
ko: Split ()을 사용할 수 있습니다 :
ru: Вы можете использовать Split():
zh_cn: 你可以使用Split()。

source: You can use the method <code>split</code>:
es: Puedes usar el m&eacute;todo <code>split</code> :
ja: あなたはメソッド <code>split</code> を使うことができます：
ko: <code>split</code> 메소드를 사용할 수 있습니다.
ru: Вы можете использовать метод <code>split</code> :
zh_cn: 您可以使用 <code>split</code> 方法：

source: You should write some unit-tests for input strings and the desired results and behaviour.
es: Debería escribir algunas pruebas de unidad para las cadenas de entrada y los resultados y el comportamiento deseados.
ja: 入力文字列のユニットテストをいくつか書いて、望ましい結果と振る舞いを考えてみましょう。
ko: 입력 문자열과 원하는 결과 및 동작에 대한 단위 테스트를 작성해야합니다.
ru: Вы должны написать несколько юнит-тестов для входных строк и желаемых результатов и поведения.
zh_cn: 你应该写一些输入字符串的单元测试,以及期望的结果和行为。

source: should do thing you want. String class has many method to operate with string.
es: debería hacer lo que tú quieres.La clase de cuerda tiene muchos métodos para operar con cuerda.
ja: を使用して、文字列を操作する必要があります。文字列クラスには、文字列を操作するためのメソッドがたくさんあります。
ko: 당신이 원하는 일을해야합니다. 문자열 클래스에는 문자열로 작동하는 많은 방법이 있습니다.
ru: должен делать то,что ты хочешь.В классе String есть много методов для работы со строкой.
zh_cn: 应该做你想要的事情。String类有很多方法来操作字符串。

source: we will get three strings: <code>[0, 0, 4]</code> and not four as was the case in Java 7 and before. Also check this similar <a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">question</a>.
es: obtendremos tres cadenas: <code>[0, 0, 4]</code> y no cuatro como era el caso en Java 7 y antes. Tambi&eacute;n revise esta <a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">pregunta</a> similar.
ja: 3つの文字列 <code>[0, 0, 4]</code> を取得し、Java 7以前の場合のように4つではありません。 この同様の<a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">質問</a>も確認してください。
ko: Java 7 이전과는 달리 <code>[0, 0, 4]</code> 세 개의 문자열을 얻을 수 있습니다. 이 비슷한 <a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">질문</a> 도 확인하십시오.
ru: мы получим три строки: <code>[0, 0, 4]</code> а не четыре, как это было в Java 7 и ранее. Также проверьте этот похожий <a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">вопрос</a> .
zh_cn: 我们将得到三个字符串： <code>[0, 0, 4]</code> 而不是Java 7及以前版本中的四个。 还要检查类似的<a href="https://stackoverflow.com/questions/22718744/why-in-java-8-split-sometimes-removes-empty-strings-at-start-of-result-array">问题</a> 。

source: which encapsulate this function. Of course you can use String.split(..) as mentioned in the other answers for the implementation.
es: que encapsulan esta función.Por supuesto que puede usar String.split(..)como se menciona en las otras respuestas para la implementación.
ja: この関数をカプセル化した もちろん、実装のための他の回答で述べたようにString.split(...)を使用することができます。
ko: 이 기능을 캡슐화합니다. 물론 구현에 대한 다른 답변에서 언급 한 것처럼 String.split (..)을 사용할 수 있습니다.
ru: которые инкапсулируют эту функцию.Конечно,для реализации можно использовать String.split(...),как указано в других ответах.
zh_cn: 其中封装了这个函数。当然,你可以使用String.split(...),如其他答案中提到的实现。

source: you don't really need regular expressions for your split
es: no necesitas expresiones regulares para tu separación
ja: スプリットに正規表現は必要ありません。
ko: 분할에 정규식이 필요하지 않습니다.
ru: тебе не нужны регулярные выражения для твоего раскола.
zh_cn: 你其实不需要正则表达式来表达你的分词。

source: you happen to already use apache commons lang in your app
es: Resulta que ya usas Apache Commons Lang en tu aplicación...
ja: あなたのアプリで既に apache commons lang を使用している場合
ko: 이미 앱에서 Apache Commons Lang을 사용하고 있습니다.
ru: вы уже используете apache Commons lang в вашем приложении.
zh_cn: 你已经在你的应用程序中使用了apache commons语言
