Repository: rueisnom/feedback
Catalog: xlf/34/81/82/8/3481828.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In case you want to have the split character to end up in right hand side, use positive lookahead by prefixing <code>?=</code> group on the pattern.
es: En caso de que desee que el car&aacute;cter dividido termine en el lado derecho, utilice una b&uacute;squeda anticipada positiva con el prefijo <code>?=</code> Group en el patr&oacute;n.
ja: 分割文字を右端にしたい場合は、パターンの <code>?=</code> グループを接頭辞として正の先読みを使用します。
ko: 분할 문자를 오른쪽으로 끝내려면 패턴에서 접두사 <code>?=</code> 그룹을 사용하여 긍정적 인 미리보기를 사용하십시오.
ru: Если вы хотите, чтобы символ разделения находился справа, используйте положительный прогноз, добавив префикс <code>?=</code> Group к шаблону.
zh_cn: 如果您希望分割字符以右侧结尾，请在模式前面加上 <code>?=</code> 组，以使用正向超前。

source: In this answer I also want to point out <strong>one change that has taken place for <code>split</code> method in Java 8</strong>. The <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String#split()</a> method makes use of <code>Pattern.split</code>, and now it will remove empty strings at the start of the result array. Notice this <a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">change</a> in documentation for Java 8:
es: En esta respuesta tambi&eacute;n quiero se&ntilde;alar <strong>un cambio que ha tenido lugar para el m&eacute;todo de <code>split</code> en Java 8</strong> . El m&eacute;todo <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String # split ()</a> utiliza <code>Pattern.split</code> y ahora eliminar&aacute; cadenas vac&iacute;as al comienzo de la matriz de resultados. Observe este <a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">cambio</a> en la documentaci&oacute;n para Java 8:
ja: この回答<strong>では、Java 8の <code>split</code> メソッドで行わ</strong>れた<strong>1つの変更について</strong>も指摘したいと思います。 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String＃split（）</a>メソッドは、 <code>Pattern.split</code> を利用し、結果の配列の先頭にある空の文字列を削除します。 Java 8のドキュメントにおけるこの<a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">変更</a>に注意してください 。
ko: 이 답변 <strong>에서 Java 8의 <code>split</code> 메소드에 대해 한 가지 변경 사항</strong> 을 지적하고 싶습니다. <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String # split ()</a> 메서드는 <code>Pattern.split</code> 을 사용하므로 결과 배열이 시작될 때 빈 문자열을 제거합니다. Java 8에 대한 설명서에서이 <a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">변경</a> 사항을 확인하십시오.
ru: В этом ответе я также хочу указать на <strong>одно изменение, которое произошло в методе <code>split</code> в Java 8</strong> . Метод <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String # split ()</a> использует <code>Pattern.split</code> , и теперь он удалит пустые строки в начале массива результатов. Обратите внимание на это <a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">изменение</a> в документации для Java 8:
zh_cn: 在这个答案中，我还想指出<strong>Java 8中 <code>split</code> 方法的一个变化</strong> 。 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-">String＃split（）</a>方法利用了 <code>Pattern.split</code> ，现在它将在结果数组的开头删除空字符串。 请注意Java 8文档中的这一<a href="https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#split-java.lang.CharSequence-int-">更改</a> ：

source: In your case, you want to split a string when there is a "-".
es: En tu caso,quieres dividir una cuerda cuando hay un "-".
ja: あなたの場合は、"-"があるときに文字列を分割したいと思います。
ko: 귀하의 경우 "-"가있을 때 문자열을 분할하려고합니다.
ru: В вашем случае,вы хотите разделить строку,когда есть "-".
zh_cn: 在你的情况下,当有"-"时,你想把一个字符串拆分。

source: It means for the following example:
es: Significa para el siguiente ejemplo:
ja: 以下の例のための意味です。
ko: 다음 예제를 의미합니다.
ru: Это означает для следующего примера:
zh_cn: 对于下面的例子,它的意思是:

source: Just use the appropriate method: <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"><code>String#split()</code></a>.
es: Simplemente use el m&eacute;todo apropiado: <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String#split()</code> </a> .
ja: 適切なメソッドを使用してください： <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String#split()</code> </a> 。
ko: 적절한 방법을 사용하십시오 : <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String#split()</code> </a> .
ru: Просто используйте соответствующий метод: <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String#split()</code> </a> .
zh_cn: 只需使用适当的方法： <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#split-java.lang.String-"> <code>String#split()</code> 即可</a> 。

source: Method signature:
es: Firma del método:
ja: メソッドの署名。
ko: 메소드 서명 :
ru: Подпись метода:
zh_cn: 方法签名:

source: Note that this takes a <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">regular expression</a>, so remember to escape <a href="http://www.regular-expressions.info/characters.html">special characters</a> if necessary.
es: Tenga en cuenta que esto toma una <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">expresi&oacute;n regular</a> , as&iacute; que recuerde escapar de <a href="http://www.regular-expressions.info/characters.html">caracteres especiales</a> si es necesario.
ja: これは<a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">正規表現を</a>とるため、必要に応じて<a href="http://www.regular-expressions.info/characters.html">特殊文字</a>をエスケープすることを忘れないでください。
ko: <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">정규 표현식</a> 이 필요하므로 필요한 경우 <a href="http://www.regular-expressions.info/characters.html">특수 문자</a> 를 이스케이프해야합니다.
ru: Обратите внимание, что для этого требуется <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">регулярное выражение</a> , поэтому при необходимости не используйте <a href="http://www.regular-expressions.info/characters.html">специальные символы</a> .
zh_cn: 请注意，这需要一个<a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#sum">正则表达式</a> ，因此请记住在必要时转义<a href="http://www.regular-expressions.info/characters.html">特殊字符</a> 。

source: Note, this does not take a regular expression. For that, use <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"><code>String#matches()</code></a> instead.
es: Tenga en cuenta que esto no toma una expresi&oacute;n regular. Para eso, use <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"> <code>String#matches()</code> </a> lugar.
ja: これは正規表現を取りません。 そのためには、代わりに<a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"> <code>String#matches()</code> を</a>使用します。
ko: 정규 표현식은 사용하지 않습니다. 이를 위해 대신 <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"> <code>String#matches()</code> </a> 사용하십시오.
ru: Обратите внимание, это не требует регулярного выражения. Для этого используйте вместо <a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"> <code>String#matches()</code> </a> .
zh_cn: 注意，这不需要正则表达式。 为此，请使用<a href="http://docs.oracle.com/javase/8/docs/api/java/lang/String.html#matches-java.lang.String-"> <code>String#matches()</code> </a>代替。

source: One way to do this is to run through the String in a for-each loop and use the required split character.
es: Una forma de hacerlo es correr a través de la cuerda en un bucle para cada uno y utilizar el carácter dividido requerido.
ja: これを行う方法の1つは、Stringをfor-eachループで実行し、必要な分割文字を使用することです。
ko: 이를 수행하는 한 가지 방법은 for-each 루프에서 문자열을 실행하고 필요한 분할 문자를 사용하는 것입니다.
ru: Один из способов сделать это-пробегать через Строку в цикле for-each и использовать требуемый разделительный символ.
zh_cn: 一种方法是在for-each循环中运行String,并使用所需的分割字符。

source: Please don't use <a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer</a> class as it is a legacy class that is retained for compatibility reasons, and its use is discouraged in new code. And we can make use of the split method as suggested by others as well.
es: No use la clase <a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer</a> ya que es una clase heredada que se retiene por razones de compatibilidad, y su uso no se recomienda en el nuevo c&oacute;digo. Y tambi&eacute;n podemos utilizar el m&eacute;todo de divisi&oacute;n seg&uacute;n lo sugerido por otros.
ja: <a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer</a>クラスは互換性のために保持されているレガシークラスであり、新しいコードでは使用しないようにしてください。 また、他の人から提案されているように、splitメソッドを使用することもできます。
ko: 호환성을 위해 유지되는 레거시 클래스이므로 <a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer</a> 클래스를 사용하지 마십시오. 새 코드에서는 사용하지 않는 것이 좋습니다. 그리고 우리는 다른 사람들이 제안한 split 방법을 사용할 수 있습니다.
ru: Пожалуйста, не используйте класс <a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer, так</a> как это унаследованный класс, который сохраняется из соображений совместимости, и его использование не рекомендуется в новом коде. И мы можем использовать метод разделения, как предложено другими.
zh_cn: 请不要使用<a href="https://docs.oracle.com/javase/7/docs/api/java/util/StringTokenizer.html">StringTokenizer</a>类，因为它是出于兼容性原因而保留的旧类，并且在新代码中不鼓励使用它。 我们也可以使用其他人建议的split方法。

source: So you can choose the best option for you depending on what you need, e.g. return type (array, list, or iterable).
es: Así que puedes elegir la mejor opción para ti dependiendo de lo que necesites,por ejemplo,el tipo de retorno (matriz,lista o iterable).
ja: そのため、戻り値の型(配列、リスト、反復可能)など、必要なものに応じて最適なものを選ぶことができます。
ko: 따라서 반환 유형 (배열, 목록 또는 반복 가능)과 같이 필요한 항목에 따라 가장 적합한 옵션을 선택할 수 있습니다.
ru: Таким образом,вы можете выбрать наилучший для вас вариант в зависимости от того,что вам нужно,например,тип возврата (массив,список или итерабельный).
zh_cn: 所以你可以根据你的需求选择最适合你的选项,比如返回类型(数组、列表或迭代)。

source: So, if you want to split on e.g. period/dot <code>.</code> which means "<a href="http://www.regular-expressions.info/dot.html">any character</a>" in regex, use either <a href="http://www.regular-expressions.info/characters.html">backslash <code>\</code></a> to escape the individual special character like so <code>split("\\.")</code>, or use <a href="http://www.regular-expressions.info/charclass.html">character class <code>[]</code></a> to represent literal character(s) like so <code>split("[.]")</code>, or use <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"><code>Pattern#quote()</code></a> to escape the entire string like so <code>split(Pattern.quote("."))</code>.
es: Entonces, si desea dividir, por ejemplo, punto / punto <code>.</code> lo que significa " <a href="http://www.regular-expressions.info/dot.html">cualquier car&aacute;cter</a> " en la expresi&oacute;n regular, utilice la <a href="http://www.regular-expressions.info/characters.html">barra diagonal inversa <code>\</code> </a> para escapar del car&aacute;cter especial individual como <code>split("\\.")</code> , o utilice la <a href="http://www.regular-expressions.info/charclass.html">clase de caracteres <code>[]</code> </a> para representar los caracteres literales como <code>split("[.]")</code> , o use el <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"> <code>Pattern#quote()</code> </a> para escapar de toda la cadena como <code>split(Pattern.quote("."))</code> .
ja: したがって、たとえばピリオド/ドットで分割したい場合 <code>.</code> つまり、正規表現では「 <a href="http://www.regular-expressions.info/dot.html">任意の文字</a> 」を意味し、 <a href="http://www.regular-expressions.info/characters.html">バックスラッシュ <code>\</code> </a>を使用してso <code>split("\\.")</code> ような個々の特殊文字をエスケープするか、 <a href="http://www.regular-expressions.info/charclass.html">文字クラス <code>[]</code> </a>を使用してso <code>split("[.]")</code> ようにリテラル文字を表します。 ] "） 、または<a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"> <code>Pattern#quote()</code> </a>を使用して、文字列全体をそのようにエスケープします（ <code>split(Pattern.quote("."))</code> 。
ko: 따라서 예를 들어 period / dot로 분할하려면 이는 정규식에서 " <a href="http://www.regular-expressions.info/dot.html">모든 문자</a> "를 의미합니다. <a href="http://www.regular-expressions.info/characters.html">백 슬래시 <code>\</code> </a> 를 사용하여 <code>split("\\.")</code> 과 같은 개별 특수 문자를 이스케이프하거나 <a href="http://www.regular-expressions.info/charclass.html">문자 클래스 <code>[]</code> </a> 를 사용하여 <code>split("[.]")</code> 와 같은 리터럴 문자를 나타냅니다 . ] ") 또는 <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"> <code>Pattern#quote()</code> </a> 를 사용하여 <code>split(Pattern.quote("."))</code> 같이 전체 문자열을 이스케이프하십시오.
ru: Итак, если вы хотите разделить, например, точка / точка <code>.</code> что означает &laquo; <a href="http://www.regular-expressions.info/dot.html">любой символ</a> &raquo; в регулярном выражении, используйте либо <a href="http://www.regular-expressions.info/characters.html">обратную косую черту <code>\</code> </a> для экранирования отдельного специального символа, такого как <code>split("\\.")</code> , либо используйте <a href="http://www.regular-expressions.info/charclass.html">символьный класс <code>[]</code> </a> для представления литеральных символов, таких как <code>split("[.]")</code> , или используйте <a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"> <code>Pattern#quote()</code> </a> для экранирования всей строки, например <code>split(Pattern.quote("."))</code> .
zh_cn: 因此，如果您想分割例如period / dot <code>.</code> 这表示正则表达式中的&ldquo; <a href="http://www.regular-expressions.info/dot.html">任何字符</a> &rdquo;，请使用<a href="http://www.regular-expressions.info/characters.html">反斜杠 <code>\</code> </a>来转义单个特殊字符，例如 <code>split("\\.")</code> ，或使用<a href="http://www.regular-expressions.info/charclass.html">字符类 <code>[]</code> </a>来表示文字字符，例如 <code>split("[.]")</code> ，或使用<a href="http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html#quote-java.lang.String-"> <code>Pattern#quote()</code> </a>像 <code>split(Pattern.quote("."))</code> 这样转义整个字符串。

source: StringTokenizer (legacy class):
es: StringTokenizer (clase de legado):
ja: StringTokenizer(レガシークラス)。
ko: StringTokenizer (레거시 클래스) :
ru: StringTokenizer (класс наследия):
zh_cn: StringTokenizer(传统类)。

source: That means the first string will contain the characters before <code>'-'</code>, and the second string will contain the characters after <code>'-'</code>. I also want to check if the string has <code>'-'</code> in it. If not, I will throw an exception. How can I do this?
es: Eso significa que la primera cadena contendr&aacute; los caracteres antes de <code>'-'</code> , y la segunda cadena contendr&aacute; los caracteres despu&eacute;s de <code>'-'</code> . Tambi&eacute;n quiero verificar si la cadena tiene <code>'-'</code> . Si no, lanzar&eacute; una excepci&oacute;n. &iquest;C&oacute;mo puedo hacer esto?
ja: つまり、最初の文字列には <code>'-'</code> の前の文字が含まれ、2番目の文字列には <code>'-'</code> の後の文字が含まれます。 文字列に <code>'-'</code> が含まれているかどうかも確認したいと思います。 そうでない場合は、例外をスローします。 これどうやってするの？
ko: 즉, 첫 번째 문자열에는 <code>'-'</code> 앞의 문자가 포함되고 두 번째 문자열에는 <code>'-'</code> 다음의 문자가 포함됩니다. 또한 문자열에 <code>'-'</code> 가 있는지 확인하고 싶습니다. 그렇지 않다면 예외를 던질 것입니다. 어떻게해야합니까?
ru: Это означает, что первая строка будет содержать символы перед <code>'-'</code> , а вторая строка будет содержать символы после <code>'-'</code> . Я также хочу проверить, есть ли в строке <code>'-'</code> . Если нет, я брошу исключение. Как я могу это сделать?
zh_cn: 这意味着第一个字符串将包含 <code>'-'</code> 之前的字符，第二个字符串将包含 <code>'-'</code> 之后的字符。 我还想检查字符串中是否包含 <code>'-'</code> 。 如果没有，我将抛出异常。 我怎样才能做到这一点？

source: The easiest way is to use <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils#split(java.lang.String, char)</a>. That's more convenient than the one provided by Java out of the box if you don't need regular expressions. Like its manual says, it works like this:
es: La forma m&aacute;s f&aacute;cil es usar <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils # split (java.lang.String, char)</a> . Eso es m&aacute;s conveniente que el proporcionado por Java fuera de la caja si no necesita expresiones regulares. Como dice su manual, funciona as&iacute;:
ja: 最も簡単な方法は、 <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils＃split（java.lang.String、char）</a>を使用することです。 正規表現が必要ない場合は、Javaが標準で提供しているものよりも便利です。 そのマニュアルが言うように、それはこのように機能します：
ko: 가장 쉬운 방법은 <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils # split (java.lang.String, char)를 사용하는 것</a> 입니다. 정규 표현식이 필요없는 경우 Java에서 제공하는 것보다 편리합니다. 매뉴얼이 말했듯이 다음과 같이 작동합니다.
ru: Самый простой способ - использовать <a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils # split (java.lang.String, char)</a> . Это удобнее, чем тот, который предоставляется Java из коробки, если вам не нужны регулярные выражения. Как сказано в его руководстве, он работает так:
zh_cn: 最简单的方法是使用<a href="http://commons.apache.org/proper/commons-lang/javadocs/api-3.1/org/apache/commons/lang3/StringUtils.html#split%28java.lang.String,%20char%29">StringUtils＃split（java.lang.String，char）</a> 。 如果您不需要正则表达式，那比开箱即用的Java提供的便利。 如其手册所述，它的工作方式如下：

source: The fastest way, which also consumes the least resource could be:
es: La forma más rápida,que también consume el menor recurso podría ser:
ja: 最速の方法は、また、最小のリソースを消費する可能性があります。
ko: 가장 적은 리소스를 소비하는 가장 빠른 방법은 다음과 같습니다.
ru: Самым быстрым способом,который также потребляет меньше всего ресурсов,может быть:
zh_cn: 最快的方式,也是消耗资源最少的方式,可能是。

source: The parentheses denote the capturing groups; the string that matched that part of the regexp can be accessed by the Match.group() method, as shown. The \d matches and single decimal digit, and the + means "match one or more of the previous expression). The - has no special meaning, so just matches that character in the input. Note that you need to double-escape the backslashes when writing this as a Java string. Some other examples:
es: Los paréntesis denotan los grupos de captura;la cadena que coincidió con esa parte del regexp puede ser accedida por el método Match.group(),como se muestra.La \d coincide con un solo dígito decimal,y el+significa "coincide con una o más de la expresión anterior").El-no tiene un significado especial,así que sólo coincide con ese carácter en la entrada.Ten en cuenta que debes evitar las barras invertidas cuando escribas esto como una cadena de Java.Algunos otros ejemplos:
ja: 正規表現のその部分にマッチした文字列は、以下に示すように Match.group()メソッドでアクセスできます。\d はマッチする文字列と 10 進数の 1 桁、+は「前の式の 1 つ以上にマッチする」ことを意味します。)は特別な意味を持たないので、入力中のその文字にマッチします。これをJava文字列として書くときは、バックスラッシュをダブルエスケープする必要があることに注意してください。他にもいくつかの例があります。
ko: 괄호는 캡처 그룹을 나타냅니다. 정규 표현식의 해당 부분과 일치하는 문자열은 표시된대로 Match.group () 메서드로 액세스 할 수 있습니다. \ d는 10 진수와 일치하며, +는 "이전 식의 하나 이상 일치"를 의미합니다.-특별한 의미가 없으므로 입력에서 해당 문자와 ​​일치합니다. 백 슬래시를 두 번 이스케이프해야합니다. 이것을 Java 문자열로 쓸 때 다른 몇 가지 예 :
ru: Круглые скобки обозначают группы захвата;строка,соответствующая этой части регеxp,может быть доступна методом Match.group(),как показано на рисунке.\d совпадает с одной десятичной цифрой,а+означает "совпадает с одним или несколькими предыдущими выражениями".)The-не имеет особого значения,поэтому просто совпадает с этим символом во входных данных.Обратите внимание,что при написании этой строки в виде Java-строки вам нужно будет дважды записать обратные слеши.Некоторые другие примеры:
zh_cn: 括号中的括号表示捕获组;与该部分regexp匹配的字符串可以通过Match.group()方法访问,如图所示。\d表示匹配和单位小数,+表示 "匹配前面的一个或多个表达式"。)而-没有特殊的含义,所以只是匹配输入中的那个字符。注意,当你把它写成Java字符串时,需要双倍地去掉反斜线。其他一些例子。

source: The requirements left room for interpretation. I recommend writing a method,
es: Los requisitos dejaron espacio para la interpretación.Recomiendo escribir un método,
ja: 要件は解釈の余地を残していました。方法を書くことをお勧めします。
ko: 요구 사항은 해석의 여지가되었습니다. 방법을 쓰는 것이 좋습니다.
ru: Требования оставили место для перевода.Я рекомендую написать метод,
zh_cn: 要求留下了解释的空间。我建议写一个方法。

source: The split method has an optimization to avoid using a regular expression if the delimeter is a single character and not in the above list. Otherwise, it has to compile a regular expression, and this is not ideal.
es: El método de división tiene una optimización para evitar el uso de una expresión regular si el delimitador es un solo carácter y no está en la lista anterior.De lo contrario,tiene que compilar una expresión regular,y esto no es lo ideal.
ja: 分割メソッドは、デリメータが1文字で上記リストにない場合に正規表現を使用しないように最適化されています。そうでない場合は正規表現をコンパイルしなければならず、これは理想的ではありません。
ko: 분할 방법은 델리 미터가 단일 문자이고 위 목록에없는 경우 정규식을 사용하지 않도록 최적화되었습니다. 그렇지 않으면 정규 표현식을 컴파일해야하며 이는 이상적이지 않습니다.
ru: Метод split имеет оптимизацию,чтобы избежать использования регулярного выражения,если разделитель является одним символом,а не в приведенном выше списке.В противном случае,он должен скомпилировать регулярное выражение,и это не идеально.
zh_cn: 分割方法有一个优化,如果delimeter是单个字符,且不在上面的列表中,则可以避免使用正则表达式。否则,它必须编译一个正则表达式,这并不理想。

source: There are only two methods you really need to consider.
es: Sólo hay dos métodos que debes considerar.
ja: 本当に考えなければならない方法は2つしかありません。
ko: 실제로 고려해야 할 두 가지 방법이 있습니다.
ru: Есть только два метода,которые вам действительно нужно рассмотреть.
zh_cn: 真正需要考虑的方法只有两种,你真正需要考虑的只有两种。

source: This last option still creates a new <code>Matcher</code> object. You can also cache this object and reset it for each input for maximum performance, but that is somewhat more complicated and not thread-safe.
es: Esta &uacute;ltima opci&oacute;n a&uacute;n crea un nuevo objeto <code>Matcher</code> . Tambi&eacute;n puede almacenar en cach&eacute; este objeto y restablecerlo para cada entrada para obtener el m&aacute;ximo rendimiento, pero eso es algo m&aacute;s complicado y no es seguro para subprocesos.
ja: この最後のオプションでも、新しい <code>Matcher</code> オブジェクトが作成されます。 このオブジェクトをキャッシュして、最大のパフォーマンスを得るために入力ごとにリセットすることもできますが、これはやや複雑でスレッドセーフではありません。
ko: 이 마지막 옵션은 여전히 ​​새 <code>Matcher</code> 객체를 만듭니다. 최대 성능을 위해이 객체를 캐시하고 각 입력에 대해 재설정 할 수도 있지만 다소 복잡하고 스레드로부터 안전하지 않습니다.
ru: Эта последняя опция все еще создает новый объект <code>Matcher</code> . Вы также можете кэшировать этот объект и сбрасывать его для каждого входа для максимальной производительности, но это несколько сложнее и не поточно-ориентировано.
zh_cn: 最后一个选项仍然创建一个新的 <code>Matcher</code> 对象。 您也可以缓存该对象并为每个输入重置它，以实现最佳性能，但这会更加复杂并且不是线程安全的。
