Repository: rueisnom/feedback
Catalog: xlf/25/87/34/5/2587345.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <b>Converts from UTC to Local time before printing</b>
es: <b>Convierte de UTC a hora local antes de imprimir</b>
ja: <b>印刷前にUTCから現地時間に変換します</b>
ko: <b>인쇄하기 전에 UTC에서 현지 시간으로 변환</b>
ru: <b>Преобразует из UTC в Местное время перед печатью</b>
zh_cn: <b>在打印之前从UTC转换为本地时间</b>

source: <b>Prints the stored UTC time directly</b>
es: <b>Imprime la hora UTC almacenada directamente</b>
ja: <b>保存されているUTC時間を直接出力します</b>
ko: <b>저장된 UTC 시간을 직접 인쇄합니다</b>
ru: <b>Печатает сохраненное время UTC напрямую</b>
zh_cn: <b>直接打印存储的UTC时间</b>

source: According to <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html</a> the format "yyyy/mm/dd" solves the usual problems. He says: "Stick to "YYYY/MM/DD" for your date strings whenever possible. It's universally supported and unambiguous. With this format, all times are local." I've set tests: <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http://jsfiddle.net/jlanus/ND2Qg/432/</a> This format: + avoids the day and month order ambiguity by using y m d ordering and a 4-digit year + avoids the UTC vs. local issue not complying with ISO format by using slashes + danvk, the <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">dygraphs</a> guy, says that this format is good in all browsers.
es: De acuerdo con <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html,</a> el formato "aaaa / mm / dd" resuelve los problemas habituales. &Eacute;l dice: "Adhi&eacute;rase a" AAAA / MM / DD "para sus cadenas de fecha siempre que sea posible. Es universalmente compatible y sin ambig&uuml;edades. Con este formato, todos los horarios son locales". He establecido pruebas: <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http://jsfiddle.net/jlanus/ND2Qg/432/</a> Este formato: + evita la ambig&uuml;edad del pedido de d&iacute;a y mes mediante el uso de pedidos ymd y un a&ntilde;o de 4 d&iacute;gitos + evita el problema UTC vs. local no cumplir con el formato ISO mediante el uso de barras inclinadas + danvk, el tipo de <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">gr&aacute;ficos</a> , dice que este formato es bueno en todos los navegadores.
ja: <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.htmlに</a>よると、「yyyy / mm / dd」という形式で通常の問題が解決されます。 「可能な限り、日付文字列を「YYYY / MM / DD」に固執してください。これは、普遍的にサポートされており、明確です。この形式では、常にローカルです。」 テストを設定しました： <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http</a> : //jsfiddle.net/jlanus/ND2Qg/432/この形式：+ ymd順序と4桁の年を使用することで日と月のあいまいさを回避します+ UTCとローカルの問題を回避しませんスラッシュ+ danvk（ <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">dygraphsの</a>男）を使用してISO形式に準拠すると、この形式はすべてのブラウザーで適切であると述べています。
ko: <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html</a> 에 따르면 "yyyy / mm / dd"형식은 일반적인 문제를 해결합니다. "언제나 가능하면 날짜 문자열을"YYYY / MM / DD "로 고정하십시오. 보편적으로 지원되며 모호하지 않습니다.이 형식으로 모든 시간은 현지 시간입니다." 테스트를 설정했습니다 : <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http://jsfiddle.net/jlanus/ND2Qg/432/</a> 이 형식 : +는 ymd 순서를 사용하여 일 및 월 순서 모호성을 피하고 4 자리 연도 + UTC 대 로컬 문제를 피합니다 <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">dygraphs</a> guy 인 슬래시 + danvk를 사용하여 ISO 형식을 준수하면이 형식이 모든 브라우저에서 적합하다고 말합니다.
ru: Согласно <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html</a> формат "гггг / мм / дд" решает обычные проблемы. Он говорит: &laquo;Придерживайтесь&laquo; ГГГГ / ММ / ДД &raquo;для ваших строк дат, когда это возможно. Это универсально поддерживается и однозначно. С этим форматом все времена локальные&raquo;. Я установил тесты: <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http://jsfiddle.net/jlanus/ND2Qg/432/</a> Этот формат: + позволяет избежать двусмысленности порядка дня и месяца, используя порядок ymd и год из 4 цифр + избегает UTC по сравнению с локальной проблемой, а не соблюдение формата ISO с помощью slashes + danvk, парень <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">dygraphs</a> , говорит, что этот формат хорош во всех браузерах.
zh_cn: 根据<a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html</a>的格式，&ldquo; yyyy / mm / dd&rdquo;解决了常见问题。 他说：&ldquo;请尽可能将日期字符串粘贴到&ldquo; YYYY / MM / DD&rdquo;。它被普遍支持且明确。使用这种格式，所有时间都在本地。 我已经设置了测试： <a href="http://jsfiddle.net/jlanus/ND2Qg/432/">http</a> : //jsfiddle.net/jlanus/ND2Qg/432/这种格式：+通过使用ymd排序和4位数字的年份避免了日和月顺序的歧义+避免了UTC与本地问题的冲突<a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">dygraphs</a>家伙通过使用斜线+ danvk来符合ISO格式，他说这种格式在所有浏览器中都很好。

source: All implementations store their date values internally as 64-bit numbers that represent the number of milliseconds (ms) since 1970-01-01 UTC (GMT is the same thing as UTC). This date is the ECMAScript epoch that is also used by other languages such as Java and POSIX systems such as UNIX. Dates occurring after the epoch are positive numbers and dates prior are negative.
es: Todas las implementaciones almacenan sus valores de fecha internamente como números de 64 bits que representan el número de milisegundos (ms)desde 1970-01-01 UTC (GMT es lo mismo que UTC).Esta fecha es la época de ECMAScript que también es utilizada por otros lenguajes como Java y sistemas POSIX como UNIX.Las fechas posteriores a la época son números positivos y las anteriores son negativas.
ja: すべての実装では、1970-01-01 UTC(GMTはUTCと同じ意味です)からのミリ秒(ms)の数を表す64ビットの数値として、日付の値を内部的に保存します。この日付は、Java などの他の言語や UNIX などの POSIX システムでも使用されている ECMAScript のエポックです。このエポックより後に発生した日付は正の数、それより前の日付は負の数になります。
ko: 모든 구현은 1970-01-01 UTC (GMT는 UTC와 동일 함) 이후 밀리 초 (ms) 수를 나타내는 64 비트 숫자로 내부적으로 날짜 값을 저장합니다. 이 날짜는 ECMAScript 시대이며 Java와 같은 다른 언어와 UNIX와 같은 POSIX 시스템에서도 사용됩니다. 신기원 이후에 발생한 날짜는 양수이고 이전 날짜는 음수입니다.
ru: Все реализации внутренне хранят свои значения даты в виде 64-битных чисел,которые представляют собой количество миллисекунд (мс),начиная с 1970-01-01 UTC (GMT то же самое,что и UTC).Эта дата является эпохой ECMAScript,которая также используется в других языках,таких как Java и POSIX систем,таких как UNIX.Даты,возникающие после эпохи,являются положительными числами,а предыдущие-отрицательными.
zh_cn: 所有的实现都将其日期值在内部存储为64位的数字,代表自1970-01-01-01 UTC以来的毫秒数(GMT与UTC相同)。这个日期是ECMAScript的纪元,其他语言(如Java和POSIX系统(如UNIX)也使用这个纪元。在这个纪元之后发生的日期是正数,之前的日期是负数。

source: An example:
es: Un ejemplo:
ja: 一例です。
ko: 예를 들면 :
ru: Пример:
zh_cn: 举个例子:

source: And formatting back to string (you will notice both cases give exactly the same result):
es: Y volviendo a dar formato a la cadena (notará que ambos casos dan exactamente el mismo resultado):
ja: そして、文字列に戻してフォーマットします(どちらの場合も全く同じ結果が得られることに気づくでしょう)。
ko: 그리고 문자열로 다시 서식을 지정하면 두 경우 모두 정확히 동일한 결과를 얻을 수 있습니다.
ru: И форматирование обратно в строку (вы заметите,что оба случая дают один и тот же результат):
zh_cn: 和格式化回字符串(你会发现这两种情况下给出的结果完全一样)。

source: Another solution is to build an associative array with date format and then reformat data.
es: Otra solución es construir un conjunto asociativo con formato de fecha y luego reformatear los datos.
ja: もうひとつの解決策は、日付形式の連想配列を構築してからデータを再フォーマットすることです。
ko: 다른 해결책은 날짜 형식으로 연관 배열을 작성한 다음 데이터를 다시 형식화하는 것입니다.
ru: Другим решением является создание ассоциативного массива с форматом даты и последующее переформатирование данных.
zh_cn: 另一个解决方案是建立一个带有日期格式的关联数组,然后重新格式化数据。

source: As of ECMAScript 2017 (edition 8), implementations were required to parse their output for <em>Date#toString</em> and <em>Date#toUTCString</em>, but the format of those strings was not specified.
es: A partir de ECMAScript 2017 (edici&oacute;n 8), se requiri&oacute; que las implementaciones analizaran su salida para <em>Date # toString</em> y <em>Date # toUTCString</em> , pero no se especific&oacute; el formato de esas cadenas.
ja: ECMAScript 2017（エディション8）以降、実装は<em>Date＃toString</em>および<em>Date＃toUTCStringの</em>出力を解析する必要がありましたが、これらの文字列の形式は指定されていませんでした。
ko: ECMAScript 2017 (버전 8)부터 구현은 <em>Date # toString</em> 및 <em>Date # toUTCString에</em> 대한 출력을 구문 분석해야하지만 해당 문자열의 형식은 지정되지 않았습니다.
ru: Начиная с ECMAScript 2017 (редакция 8), реализации должны были анализировать свои выходные данные для <em>Date # toString</em> и <em>Date # toUTCString</em> , но формат этих строк не был указан.
zh_cn: 从ECMAScript 2017（版本8）开始，要求实现解析<em>Date＃toString</em>和<em>Date＃toUTCString的输出</em> ，但未指定这些字符串的格式。

source: As of ECMAScript 2019 (edition 9) the format for <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date#toString</em></a> and <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date#toUTCString</em></a>, have been specified as (respectively):
es: A partir de ECMAScript 2019 (edici&oacute;n 9), el formato para <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date # toString</em></a> y <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date # toUTCString</em></a> , se ha especificado como (respectivamente):
ja: ECMAScript 2019（エディション9）以降、 <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date＃toString</em></a>および<a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date＃toUTCString</em></a>の形式は（それぞれ）次のように指定されています。
ko: ECMAScript 2019 (9 버전)부터 <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date # toString</em></a> 및 <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date # toUTCString</em></a> 형식은 (각각) 다음과 같이 지정되었습니다.
ru: Начиная с ECMAScript 2019 (издание 9) формат для <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date # toString</em></a> и <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date # toUTCString</em></a> , был определен как (соответственно):
zh_cn: 从ECMAScript 2019（版本9）开始， <a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.tostring"><em>Date＃toString</em></a>和<a href="http://ecma-international.org/ecma-262/9.0/#sec-date.prototype.toutcstring"><em>Date＃toUTCString</em></a>的格式分别指定为：

source: Both are correct, but they are being interpreted as dates with two different timezones. So you compared apples and oranges:
es: Ambas son correctas,pero están siendo interpretadas como fechas con dos zonas horarias diferentes.Así que comparaste manzanas y naranjas:
ja: 両方とも正しいですが、彼らは2つの異なる時間帯の日付として解釈されています。リンゴとオレンジを比較したのですね。
ko: 둘 다 정확하지만 두 시간대가 다른 날짜로 해석되고 있습니다. 따라서 사과와 오렌지를 비교했습니다.
ru: Оба они верны,но интерпретируются как даты с двумя разными часовыми поясами.Итак,вы сравнили яблоки и апельсины:
zh_cn: 两者都是正确的,但都被解释为两个不同时间段的日期。所以你把苹果和橘子做了比较。

source: But I still strongly recommend <a href="http://momentjs.com/">Moment.js</a> which is as <a href="http://momentjs.com/docs/#/parsing/">simple yet powerful</a>:
es: Pero todav&iacute;a recomiendo <a href="http://momentjs.com/">Moment.js,</a> que es tan <a href="http://momentjs.com/docs/#/parsing/">simple pero potente</a> :
ja: しかし、私はまだ<a href="http://momentjs.com/docs/#/parsing/">シンプルで強力な</a> <a href="http://momentjs.com/">Moment.js</a>を強くお勧めします ：
ko: 그러나 나는 여전히 <a href="http://momentjs.com/docs/#/parsing/">간단하지만 강력한</a> <a href="http://momentjs.com/">Moment.js</a> 를 강력히 추천합니다.
ru: Но я все еще настоятельно рекомендую <a href="http://momentjs.com/">Moment.js,</a> который так же <a href="http://momentjs.com/docs/#/parsing/">прост, но мощный</a> :
zh_cn: 但是我仍然强烈推荐<a href="http://momentjs.com/">Moment.js</a> ， 它既 <a href="http://momentjs.com/docs/#/parsing/">简单又强大</a> ：

source: But it gets worse. A quirk of ECMA-262 is that the ISO 8601 date&ndash;only format (YYYY-MM-DD) is required to be parsed as UTC, whereas ISO 8601 requires it to be parsed as local. Here is the output from FF with the long and short ISO date formats with no time zone specifier.
es: Pero se pone peor. Una peculiaridad de ECMA-262 es que se requiere que el formato de fecha ISO 8601 (AAAA-MM-DD) se analice como UTC, mientras que ISO 8601 requiere que se analice como local. Aqu&iacute; est&aacute; la salida de FF con los formatos de fecha ISO largos y cortos sin especificador de zona horaria.
ja: しかし、それはさらに悪化します。 ECMA-262の奇妙な点は、ISO 8601の日付のみの形式（YYYY-MM-DD）をUTCとして解析する必要があるのに対し、ISO 8601はローカルとして解析する必要があることです。 以下は、タイムゾーン指定子のないISOの長い形式と短い形式のFFからの出力です。
ko: 그러나 악화됩니다. ECMA-262의 단점은 ISO 8601 날짜 전용 형식 (YYYY-MM-DD)을 UTC로 구문 분석해야하는 반면 ISO 8601은 로컬 형식으로 구문 분석해야한다는 것입니다. 다음은 시간대 지정자가없는 길고 짧은 ISO 날짜 형식의 FF 출력입니다.
ru: Но это становится хуже. Причудой ECMA-262 является то, что формат ISO 8601 только для даты (YYYY-MM-DD) должен быть проанализирован как UTC, в то время как ISO 8601 требует, чтобы он был проанализирован как локальный. Вот вывод из FF с длинными и короткими форматами даты ISO без указания часового пояса.
zh_cn: 但情况变得更糟。 ECMA-262的一个怪癖是要求将ISO 8601仅限日期格式（YYYY-MM-DD）解析为UTC，而ISO 8601则要求将其解析为本地。 这是FF的输出，带有长和短ISO日期格式，没有时区说明符。

source: But, even for ISO 8601 format strings, some implementations get it wrong. Here is a comparison output of Chrome and Firefox when this answer was originally written for 1/1/1970 (the epoch) on my machine using ISO 8601 format strings that <em>should</em> be parsed to exactly the same value in all implementations:
es: Pero, incluso para las cadenas de formato ISO 8601, algunas implementaciones se equivocan. Aqu&iacute; hay una salida de comparaci&oacute;n de Chrome y Firefox cuando esta respuesta se escribi&oacute; originalmente para el 1/1/1970 (la &eacute;poca) en mi m&aacute;quina usando cadenas de formato ISO 8601 que <em>deber&iacute;an</em> analizarse exactamente con el mismo valor en todas las implementaciones:
ja: しかし、ISO 8601形式の文字列であっても、一部の実装ではそれが間違っています。 すべての実装でまったく同じ値に解析される<em>必要</em>があるISO 8601形式の文字列を使用して私のマシンで1/1/1970（エポック）に対してこの回答が最初に書かれたときのChromeとFirefoxの比較出力は次のとおりです。
ko: 그러나 ISO 8601 형식 문자열의 경우에도 일부 구현에서는 잘못 구현됩니다. 다음은이 답변이 모든 구현에서 정확히 동일한 값으로 구문 분석 <em>해야하는</em> ISO 8601 형식 문자열을 사용하여 내 컴퓨터에서 1/1/1970 (에포크)로 작성된 경우 Chrome과 Firefox의 비교 출력입니다.
ru: Но даже для строк формата ISO 8601 некоторые реализации ошибаются. Вот сравнительный вывод Chrome и Firefox, когда этот ответ был изначально написан для моей машины 01.01.1970 (эпоха), используя строки формата ISO 8601, которые <em>должны</em> быть проанализированы с одинаковым значением во всех реализациях:
zh_cn: 但是，即使对于ISO 8601格式的字符串，某些实现也会弄错它。 这是Chrome和Firefox的比较输出，当此答案最初是在我的计算机上使用1970年1月1日（纪元）时使用ISO 8601格式的字符串编写的， <em>应该</em>在所有实现中将其解析为完全相同的值：

source: Case One:
es: Caso uno:
ja: ケース・ワン
ko: 사례 하나 :
ru: Дело первое:
zh_cn: 案例一:

source: Case Two:
es: Caso dos:
ja: ケース・ツー
ko: 사례 2 :
ru: Дело 2:
zh_cn: 情况二:

source: During recent experience writing a JS interpreter I wrestled plenty with the inner workings of ECMA/JS dates. So, I figure I'll throw in my 2 cents here. Hopefully sharing this stuff will help others with any questions about the differences among browsers in how they handle dates.
es: Durante la reciente experiencia de escribir un intérprete JS luché mucho con el funcionamiento interno de las fechas del ECMAJS.Así que,me imagino que voy a tirar mis dos centavos aquí.Espero que compartir estas cosas ayude a otros con cualquier pregunta sobre las diferencias entre los navegadores en el manejo de las fechas.
ja: 最近、JSインタープリターを書いていた時に、ECMAJSの日付の内側の仕組みと格闘したことがあります。そこで、私の2セントをここに投じることにしました。願わくば、この内容を共有することで、ブラウザ間での日付の扱い方の違いについての疑問が、他の人の助けになることを願っています。
ko: 최근 JS 통역사를 쓴 경험을 통해 ECMA / JS 날짜의 내부 작업에 많은 어려움을 겪었습니다. 그래서 여기에 2 센트를 넣을 것이라고 생각합니다. 이 자료를 공유하면 브라우저가 날짜를 처리하는 방식의 차이점에 대한 질문에 다른 사람들이 도움이 될 수 있기를 바랍니다.
ru: Во время недавнего опыта написания JS переводчика я много боролся с внутренними работами ECMAJS даты.Так что,я решил,что брошу сюда свои 2 цента.Надеюсь,что обмен этими вещами поможет другим в любых вопросах о различиях между браузерами в том,как они обращаются с датами.
zh_cn: 在最近写JS翻译器的过程中,我在ECMAJS日期的内涵上纠结了很多。所以,我想在这里抛出我的2分钱。希望分享这些东西能帮助到其他的人,让他们了解到浏览器之间在处理日期方面的差异。

source: E.g. in moment.js you might write:
es: Por ejemplo,en moment.js podrías escribir:
ja: 例えば、moment.jsでは以下のように書くことができます。
ko: 예를 들어 moment.js에서는 다음과 같이 작성할 수 있습니다.
ru: Например,в мгновение ока.Ты можешь написать:
zh_cn: 例如,在moment.js中,你可以写出:

source: Fri Jul 08 2005 00:00:00 GMT-0700 (PST)
ja: 2005年7月8日(金)00:00:00:00 GMT-0700 (PST)
ko: 2005 년 7 월 08 일 00:00:00 GMT-0700 (PST)
zh_cn: Fri Jul 08 2005 00:00:00:00 GMT-0700 (PST)

source: Here is a short, flexible snippet to convert a datetime-string in a cross-browser-safe fashion as nicel detailed by @drankin2112.
es: Aquí hay un fragmento corto y flexible para convertir una cadena de fecha y hora en una forma segura para el navegador,como se detalla en @drankin2112.
ja: ここでは、@drankin2112さんが詳しく説明しているように、クロスブラウザセーフな方法で日付の文字列を変換するための、短くて柔軟なスニペットを紹介します。
ko: 다음은 @ drankin2112에 의해 자세히 설명 된대로 브라우저 간 안전한 방식으로 날짜 시간 문자열을 변환하는 짧고 유연한 스 니펫입니다.
ru: Вот короткий,гибкий фрагмент для конвертации строки даты в кросс-броузер-безопасную моды,как никель,подробно описанную @drankin2112.
zh_cn: 下面是一个简短灵活的片段,可以将日期时间字符串转换为跨浏览器安全的方式,就像@drankin2112所描述的那样。

source: However, since parsing of even the formats specified in ECMA-262 is not consistent, it is recommended to never rely on the built&ndash;in parser and to always manually parse strings, say using a library and provide the format to the parser.
es: Sin embargo, dado que el an&aacute;lisis de incluso los formatos especificados en ECMA-262 no es coherente, se recomienda no confiar nunca en el analizador incorporado y analizar siempre manualmente las cadenas, digamos usando una biblioteca y proporcionar el formato al analizador.
ja: ただし、ECMA-262で指定された形式の解析でも一貫性がないため、組み込みパーサーに依存せず、常にライブラリを使用して文字列を手動で解析し、形式をパーサーに提供することをお勧めします。
ko: 그러나 ECMA-262에 지정된 형식의 구문 분석도 일관되지 않으므로 내장 구문 분석기에 의존하지 말고 라이브러리를 사용하여 구문 분석기에 형식을 제공하는 등 항상 문자열을 수동으로 구문 분석하는 것이 좋습니다.
ru: Однако, поскольку синтаксический анализ даже форматов, указанных в ECMA-262, не является согласованным, рекомендуется никогда не полагаться на встроенный синтаксический анализатор и всегда анализировать строки вручную, например, используя библиотеку, и предоставлять формат анализатору.
zh_cn: 但是，由于即使对ECMA-262中指定的格式进行的解析也不是一致的，因此建议不要使用内置的解析器，而应始终手动解析字符串（例如使用库并将其提供给解析器）。

source: However, the ISO 8601 format is different. It's one of only two formats outlined in ECMAScript 2015 (ed 6) specifically that must be parsed the same way by all implementations (the other is the format specified for <a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toString</a>).
es: Sin embargo, el formato ISO 8601 es diferente. Es uno de los dos &uacute;nicos formatos descritos en ECMAScript 2015 (ed. 6) espec&iacute;ficamente que todas las implementaciones deben analizar de la misma manera (el otro es el formato especificado para <a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toString</a> ).
ja: ただし、ISO 8601形式は異なります。 これは、ECMAScript 2015（ed 6）で概説されている2つの形式のうちの1つであり、すべての実装で同じ方法で解析する必要があります（もう1つは<a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toStringに</a>指定された形式です）。
ko: 그러나 ISO 8601 형식이 다릅니다. ECMAScript 2015 (ed 6)에 요약 된 두 가지 형식 중 하나이며 특히 모든 구현에서 동일한 방식으로 구문 분석해야합니다 (다른 형식은 <a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toString에</a> 지정된 형식 임 ).
ru: Однако формат ISO 8601 отличается. Это один из двух форматов, специально описанных в ECMAScript 2015 (ред. 6), который должен быть проанализирован одинаково во всех реализациях (другой - формат, указанный для <a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toString</a> ).
zh_cn: 但是，ISO 8601格式不同。 它是ECMAScript 2015（第6版）中概述的仅有的两种格式之一，所有实现必须以相同的方式进行解析（另一种是为<a href="http://ecma-international.org/ecma-262/6.0/index.html#sec-date.prototype.tostring">Date.prototype.toString</a>指定的格式）。

source: I hope this answer was helpful.
es: Espero que esta respuesta haya sido útil.
ja: この回答が参考になれば幸いです。
ko: 이 답변이 도움이 되었기를 바랍니다.
ru: Надеюсь,этот ответ был полезен.
zh_cn: 希望这个回答对你有帮助。

source: I normally don't use the ISO format for string input. The only time that using that format is beneficial to me is when dates need to be sorted as strings. The ISO format is sortable as-is while the others are not. If you have to have cross-browser compatibility, either specify the timezone or use a compatible string format.
es: Normalmente no uso el formato ISO para la entrada de cadenas.La única vez que el uso de ese formato es beneficioso para mí es cuando las fechas necesitan ser ordenadas como cadenas.El formato ISO es clasificable tal cual,mientras que los otros no lo son.Si tienes que tener compatibilidad con los navegadores,especifica la zona horaria o usa un formato de cadena compatible.
ja: 私は通常、文字列入力にISOフォーマットを使用しません。そのフォーマットを使うことが私にとって有益なのは、日付を文字列としてソートする必要があるときだけです。ISO フォーマットはそのままソートできますが、他のフォーマットはそうではありません。クロスブラウザの互換性が必要な場合は、タイムゾーンを指定するか、互換性のある文字列フォーマットを使用してください。
ko: 나는 일반적으로 문자열 입력에 ISO 형식을 사용하지 않습니다. 해당 형식을 사용하는 것이 유익한 유일한 날짜는 날짜를 문자열로 정렬해야 할 때입니다. ISO 형식은있는 그대로 정렬 할 수 있지만 다른 형식은 정렬 할 수 없습니다. 브라우저 간 호환성이 필요한 경우 시간대를 지정하거나 호환 가능한 문자열 형식을 사용하십시오.
ru: Обычно я не использую ISO-формат для ввода строк.Единственное время,когда я использую этот формат,это время,когда даты должны быть отсортированы как строки.Формат ИСО сортируется как есть,в то время как другие нет.Если вам нужна кросс-браузерная совместимость,либо укажите часовой пояс,либо используйте совместимый строковый формат.
zh_cn: 我通常不使用ISO格式来输入字符串。唯一一次使用这种格式对我有好处的是,当日期需要作为字符串排序时。ISO格式是可以分类的,而其他格式则不能。如果你必须要有跨浏览器的兼容性,要么指定时区,要么使用兼容的字符串格式。
