Repository: rueisnom/feedback
Catalog: xlf/25/87/34/5/2587345.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I removed the <code>Date.parse()</code> call since it's used automatically on a string argument. I also compared the dates using <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">ISO8601 format</a> so you could visually compare the dates between your local dates and the UTC dates. The times are 7 hours apart, which is the timezone difference and why your tests showed two different dates.
es: <code>Date.parse()</code> llamada Date.parse () ya que se usa autom&aacute;ticamente en un argumento de cadena. Tambi&eacute;n <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">compar&eacute;</a> las fechas con el formato ISO8601 para que pueda comparar visualmente las fechas entre sus fechas locales y las fechas UTC. Los tiempos est&aacute;n separados por 7 horas, que es la diferencia de zona horaria y por qu&eacute; sus pruebas mostraron dos fechas diferentes.
ja: <code>Date.parse()</code> 呼び出しは文字列引数で自動的に使用されるため、削除しました。 また、 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">ISO8601形式</a>を使用して日付を比較したので、ローカルの日付とUTC日付の日付を視覚的に比較できます。 時間は7時間離れています。これはタイムゾーンの違いであり、テストで2つの異なる日付が表示された理由です。
ko: <code>Date.parse()</code> 호출은 문자열 인수에서 자동으로 사용되므로 제거했습니다. 또한 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">ISO8601 형식을</a> 사용하여 날짜를 비교하여 현지 날짜와 UTC 날짜 사이의 날짜를 시각적으로 비교할 수 있습니다. 시간은 7 시간 간격이며, 이는 시간대 차이이며 테스트에서 두 가지 다른 날짜가 표시된 이유입니다.
ru: Я удалил <code>Date.parse()</code> так как он автоматически используется в строковом аргументе. Я также сравнил даты, используя <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">формат ISO8601,</a> чтобы вы могли визуально сравнить даты между вашими локальными датами и датами UTC. Время составляет 7 часов, что является разницей в часовых поясах и почему ваши тесты показали две разные даты.
zh_cn: 我删除了 <code>Date.parse()</code> 调用，因为它自动用于字符串参数。 我还使用<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/toISOString">ISO8601格式</a>比较了日期，因此您可以直观地比较本地日期和UTC日期之间的日期。 时间相隔7个小时，这是时区差异，也是为什么测试显示两个不同的日期。

source: I would recommend that date strings are parsed manually and the <a href="http://bclary.com/2004/11/07/#a-15.9.3.1">Date constructor</a> used with year, month and day arguments to avoid ambiguity:
es: Recomendar&iacute;a que las cadenas de fecha se analicen manualmente y el <a href="http://bclary.com/2004/11/07/#a-15.9.3.1">constructor de fecha se</a> use con argumentos de a&ntilde;o, mes y d&iacute;a para evitar la ambig&uuml;edad:
ja: あいまいさを避けるために、日付文字列を手動で解析し、 <a href="http://bclary.com/2004/11/07/#a-15.9.3.1">Dateコンストラクター</a>を年、月、日の引数と共に使用することをお勧めします。
ko: 모호성을 피하기 위해 날짜 문자열을 수동으로 구문 분석하고 <a href="http://bclary.com/2004/11/07/#a-15.9.3.1">Date 생성자</a> 를 연도, 월 및 일 인수와 함께 사용하는 것이 좋습니다.
ru: Я бы порекомендовал, чтобы строки даты анализировались вручную, а <a href="http://bclary.com/2004/11/07/#a-15.9.3.1">конструктор Date</a> использовался с аргументами year, month и day, чтобы избежать двусмысленности:
zh_cn: 我建议手动解析日期字符串，并将<a href="http://bclary.com/2004/11/07/#a-15.9.3.1">Date构造函数</a>与年，月和日参数一起使用，以避免产生歧义：

source: In my timezone (EST, which is -05:00), the result is 18000000 because that's how many ms are in 5 hours (it's only 4 hours during daylight savings months). The value will be different in different time zones. This behaviour is specified in ECMA-262 so all browsers do it the same way.
es: En mi zona horaria (EST,que es -05:00),el resultado es 18000000 porque así son los ms en 5 horas (son sólo 4 horas durante los meses de ahorro de luz diurna).El valor será diferente en diferentes zonas horarias.Este comportamiento está especificado en el ECMA-262,así que todos los navegadores lo hacen de la misma manera.
ja: 私のタイムゾーン(EST、つまり-05:00)では、5時間で何ミリ秒になるかということで、結果は18000000になります(サマータイムの期間中は4時間です)。この値はタイムゾーンによって異なります。この動作はECMA-262で指定されているので、すべてのブラウザが同じ方法で行います。
ko: 내 시간대 (EST, -05 : 00)에서 결과는 18000000입니다. 이는 5 시간 동안의 ms 수 (일광 절약 시간 동안 4 시간에 불과)이기 때문입니다. 시간대에 따라 값이 달라집니다. 이 동작은 ECMA-262에 지정되어 있으므로 모든 브라우저가 동일한 방식으로 작동합니다.
ru: В моем часовом поясе (EST,что составляет -05:00)результат 18000000,потому что это столько мс за 5 часов (это всего 4 часа в светлые месяцы).Значение будет разным в разных часовых поясах.Такое поведение указано в ECMA-262,поэтому все браузеры делают это одинаково.
zh_cn: 在我所在的时区(美国东部时间,也就是-05:00),结果是18000000,因为这就是5个小时内有多少毫秒(在夏令时节只有4个小时)。在不同的时区中,这个值会有不同的表现。这个行为是在ECMA-262中指定的,所以所有的浏览器都是这样做的。

source: In the first case, the "Z" specifier indicates that the input is in UTC time so is not offset from the epoch and the result is 0
es: En el primer caso,el especificador "Z" indica que la entrada está en la hora UTC,por lo que no está desfasada de la época y el resultado es 0
ja: 最初のケースでは、"Z "指定子は入力がUTC時間であるためエポックからオフセットされていないことを示し、結果は0である。
ko: 첫 번째 경우 "Z"지정자는 입력이 UTC 시간이므로 에포크에서 오프셋되지 않고 결과가 0임을 나타냅니다.
ru: В первом случае спецификатор "Z" указывает,что вход находится в UTC времени,поэтому не смещен от эпохи,а результат равен 0
zh_cn: 在第一种情况下,"Z "指定器表示输入的时间是UTC时间,所以不偏移,结果是0

source: In the second case, the "-0500" specifier indicates that the input is in GMT-05:00 and both browsers interpret the input as being in the -05:00 timezone. That means that the UTC value is offset from the epoch, which means adding 18000000ms to the date's internal time value.
es: En el segundo caso,el especificador "-0500" indica que la entrada está en GMT-05:00 y ambos navegadores interpretan que la entrada está en la zona horaria de -05:00.Eso significa que el valor UTC está desfasado de la época,lo que significa que se añade 18000000ms al valor de la hora interna de la fecha.
ja: 2番目のケースでは、"-0500 "指定子は入力がGMT-05:00であることを示し、両方のブラウザは入力を-05:00タイムゾーンにあると解釈します。これは、UTC値がエポックからオフセットされていることを意味し、日付の内部時間値に18000000msが加算されていることを意味します。
ko: 두 번째 경우 "-0500"지정자는 입력이 GMT-05 : 00에 있고 두 브라우저 모두 입력이 -05 : 00 시간대에있는 것으로 해석합니다. 이는 UTC 값이 에포크 (epoch)에서 오프셋됨을 의미하며, 이는 날짜의 내부 시간 값에 18000000ms를 추가 함을 의미합니다.
ru: Во втором случае спецификатор "-0500" указывает,что вход находится в GMT-05:00 и оба браузера интерпретируют вход как находящийся во временной зоне -05:00.Это означает,что значение UTC смещено от эпохи,что означает добавление 18000000мс к внутреннему значению даты.
zh_cn: 在第二种情况下,"-0500 "表示输入的时间是GMT-05:00,两个浏览器都将输入的时间解释为-05:00时区。这意味着UTC值与时区偏移了,这意味着在日期的内部时间值上增加了18000000ms。

source: Most current browsers do treat the other input formats equally, including the frequently used '1/1/1970' (M/D/YYYY) and '1/1/1970 00:00:00 AM' (M/D/YYYY hh:mm:ss ap) formats. All of the following formats (except the last) are treated as local time input in all browsers. The output of this code is the same in all browsers in my timezone. The last one is treated as -05:00 regardless of the host timezone because the offset is set in the timestamp:
es: La mayoría de los navegadores actuales tratan los otros formatos de entrada de igual manera,incluyendo los formatos frecuentemente usados "111970" (MDYYY)y "111970 00:00:00 AM" (MDYYY hh:mm:ss ap).Todos los siguientes formatos (excepto el último)se tratan como entrada de hora local en todos los navegadores.La salida de este código es la misma en todos los navegadores de mi zona horaria.El último se trata como -05:00 sin importar la zona horaria del host porque el desplazamiento se establece en la marca de tiempo:
ja: 現在のほとんどのブラウザでは、よく使われる '111970' (MDYYYY)と '111970 00:00:00:00 AM' (MDYYYY hh:mm:ss ap)フォーマットを含めて、他の入力フォーマットも同じように扱われます。以下のフォーマット(最後のものを除く)はすべてのブラウザでローカルタイムの入力として扱われます。このコードの出力は、私のタイムゾーンのすべてのブラウザで同じです。最後のものは、タイムスタンプにオフセットが設定されているため、ホストのタイムゾーンに関係なく-05:00として扱われます。
ko: 대부분의 최신 브라우저는 자주 사용되는 '1/1/1970'(M / D / YYYY) 및 '1/1/1970 00:00:00 AM'(M / D / YYYY hh)을 포함하여 다른 입력 형식을 동일하게 취급합니다. : mm : ss ap) 형식입니다. 다음 형식 (마지막 제외)은 모두 모든 브라우저에서 현지 시간 입력으로 처리됩니다. 이 코드의 출력은 내 시간대의 모든 브라우저에서 동일합니다. 오프셋은 타임 스탬프에서 설정되므로 마지막 시간대는 호스트 시간대와 상관없이 -05 : 00으로 처리됩니다.
ru: Большинство современных браузеров одинаково относятся к другим форматам ввода,включая часто используемые форматы '111970' (MDYYY)и '111970 00:00:00 AM' (MDYYYY hh:mm:ss ap).Все следующие форматы (за исключением последнего)рассматриваются во всех браузерах как локальный ввод времени.Вывод этого кода одинаков во всех браузерах в моем часовом поясе.Последний формат обрабатывается как -05:00 независимо от часового пояса хоста,потому что смещение задается в метке времени:
zh_cn: 目前大多数浏览器对其他输入格式都是一视同仁,包括常用的 "111970"(MDYYYYYY)和 "111970 00:00:00:00:00 AM"(MDYYYY hh:mm:ss ap)格式。以下所有的格式(除了最后一种)在所有浏览器中都被视为本地时间输入。这个代码的输出在我所在的时区的所有浏览器中都是一样的。最后一个是-05:00,因为时间戳中设置了偏移量,所以无论主机时区如何,最后一个都会被处理为-05:00。

source: On the output side, all browsers translate time zones the same way but they handle the string formats differently. Here are the <code>toString</code> functions and what they output. Notice the <code>toUTCString</code> and <code>toISOString</code> functions output 5:00 AM on my machine. Also, the timezone name may be an abbreviation and may be different in different implementations.
es: En el lado de salida, todos los navegadores traducen las zonas horarias de la misma manera, pero manejan los formatos de cadena de manera diferente. Estas son las funciones de <code>toString</code> y lo que generan. Observe que las funciones <code>toUTCString</code> y <code>toISOString</code> salen a las 5:00 AM en mi m&aacute;quina. Adem&aacute;s, el nombre de la zona horaria puede ser una abreviatura y puede ser diferente en diferentes implementaciones.
ja: 出力側では、すべてのブラウザーが同じ方法でタイムゾーンを変換しますが、文字列形式の処理は異なります。 次に <code>toString</code> 関数とその出力を示します。 私のマシンでは <code>toISOString</code> 関数とtoISOString関数が5:00 AMを出力することに注意して <code>toUTCString</code> 。 また、タイムゾーン名は略語であり、実装によって異なる場合があります。
ko: 출력 측에서 모든 브라우저는 시간대를 동일한 방식으로 변환하지만 문자열 형식을 다르게 처리합니다. 다음은 <code>toString</code> 함수와 출력 내용입니다. 내 컴퓨터에서 <code>toUTCString</code> 및 <code>toISOString</code> 함수 출력 오전 5시를 확인하십시오. 또한 시간대 이름은 약어 일 수 있으며 구현에 따라 다를 수 있습니다.
ru: Что касается вывода, все браузеры переводят часовые пояса одинаково, но по-разному обрабатывают строковые форматы. Вот функции <code>toString</code> и то, что они выводят. Обратите внимание, что функции <code>toUTCString</code> и <code>toISOString</code> выводятся на моей машине в 5:00 утра. Кроме того, название часового пояса может быть сокращением и может отличаться в разных реализациях.
zh_cn: 在输出端，所有浏览器都以相同的方式转换时区，但是它们对字符串格式的处理方式不同。 这是 <code>toString</code> 函数及其输出。 请注意，我的机器上凌晨5:00输出的 <code>toUTCString</code> 和 <code>toISOString</code> 函数。 另外，时区名称可能是缩写，在不同的实现中可能会有所不同。

source: Parsing example:
es: Ejemplo de análisis:
ja: 構文解析の例。
ko: 구문 분석 예 :
ru: Пример разбора:
zh_cn: 解析示例:

source: See <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScript and Dates, What a Mess!</a> for more.
es: Ver <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScript y fechas, &iexcl;qu&eacute; desastre!</a> para m&aacute;s.
ja: <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScriptと日付を</a>参照してください。 多くのための。
ko: <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScript와 날짜, 엉망인 것을보십시오!</a> 이상.
ru: Смотрите <a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScript и даты, что за беспорядок!</a> для большего.
zh_cn: 看到<a href="http://blog.dygraphs.com/2012/03/javascript-and-dates-what-mess.html">JavaScript和日期，真是麻烦！</a> 更多。

source: So the first is parsed as local because it's ISO 8601 date and time with no timezone, and the second is parsed as UTC because it's ISO 8601 date only.
es: Así que el primero se analiza como local porque es la fecha y la hora ISO 8601 sin zona horaria,y el segundo se analiza como UTC porque es sólo la fecha ISO 8601.
ja: つまり、1つ目はISO 8601の日付と時刻でタイムゾーンがないのでローカルとして解析され、2つ目はISO 8601の日付のみなのでUTCとして解析されます。
ko: 따라서 첫 번째는 표준 시간대가없는 ISO 8601 날짜 및 시간이므로 로컬로 구문 분석되고 두 번째는 ISO 8601 날짜이므로 UTC로 구문 분석됩니다.
ru: Так что первый анализируется как локальный,потому что это ISO 8601 дата и время без часового пояса,а второй-как UTC,потому что это только дата ISO 8601.
zh_cn: 所以第一个被解析为本地,因为它是ISO 8601的日期和时间,没有时区,第二个被解析为UTC,因为它是ISO 8601的日期。

source: So, to answer the original question directly, <code>"YYYY-MM-DD"</code> is required by ECMA-262 to be interpreted as UTC, while the other is interpreted as local. That's why:
es: Entonces, para responder directamente a la pregunta original, ECMA-262 requiere que <code>"YYYY-MM-DD"</code> se interprete como UTC, mientras que el otro se interpreta como local. Es por eso:
ja: したがって、元の質問に直接回答するには、ECMA-262で <code>"YYYY-MM-DD"</code> をUTCとして解釈する必要があり、もう1つはローカルとして解釈される必要があります。 それが理由です：
ko: 따라서 원래 질문에 직접 대답하려면 ECMA-262에서 <code>"YYYY-MM-DD"</code> 를 UTC로 해석하고 다른 하나를 로컬로 해석해야합니다. 그 이유는 다음과 같습니다.
ru: Итак, чтобы ответить на исходный вопрос напрямую, ECMA-262 требует, чтобы <code>"YYYY-MM-DD"</code> интерпретировался как UTC, а другой - как локальный. Вот почему:
zh_cn: 因此，为了直接回答原始问题，ECMA-262要求将 <code>"YYYY-MM-DD"</code> 解释为UTC，而将另一个解释为本地。 这就是为什么：

source: The 3rd argument determines strict parsing (available as of 2.3.0). Without it moment.js may also give incorrect results.
es: El tercer argumento determina el análisis sintáctico estricto (disponible a partir de 2.3.0).Sin él moment.js también puede dar resultados incorrectos.
ja: 3番目の引数は厳密なパースを決定します(2.3.0で利用可能)。これがないと、moment.jsも正しくない結果になる可能性があります。
ko: 세 번째 인수는 엄격한 구문 분석을 결정합니다 (2.3.0부터 사용 가능). 그것없이 moment.js는 또한 잘못된 결과를 줄 수 있습니다.
ru: Третий аргумент определяет строгий синтаксический анализ (доступен начиная с версии 2.3.0).Без него moment.js также может давать некорректные результаты.
zh_cn: 第3个参数决定了严格的解析(从2.3.0起可用)。如果没有它,moment.js也可能会给出不正确的结果。

source: The <a href="https://stackoverflow.com/a/2587398/6695569">accepted answer from CMS</a> is correct, I have just added some features :
es: La <a href="https://stackoverflow.com/a/2587398/6695569">respuesta aceptada de CMS</a> es correcta, acabo de agregar algunas caracter&iacute;sticas:
ja: <a href="https://stackoverflow.com/a/2587398/6695569">CMSから</a>の受け入れられた答えは正しいです、私はちょうどいくつかの機能を追加しました：
ko: <a href="https://stackoverflow.com/a/2587398/6695569">CMS의 대답</a> 은 정확합니다. 방금 몇 가지 기능을 추가했습니다.
ru: <a href="https://stackoverflow.com/a/2587398/6695569">Принятый ответ от CMS</a> правильный, я только что добавил некоторые функции:
zh_cn: <a href="https://stackoverflow.com/a/2587398/6695569">CMS接受的答案</a>是正确的，我刚刚添加了一些功能：

source: The Input Side
es: El lado de la entrada
ja: 入力側
ko: 입력측
ru: Входная сторона
zh_cn: 输入端

source: The Output Side
es: El lado de salida
ja: 出力側
ko: 출력측
ru: Выходная сторона
zh_cn: 输出端

source: The bottom line is this for parsing date strings. The ONLY ISO 8601 string that you can safely parse across browsers is the long form <strong>with an offset</strong> (either &plusmn;HH:mm or "Z"). If you do that you can safely go back and forth between local and UTC time.
es: La conclusi&oacute;n es esto para analizar cadenas de fechas. La &Uacute;NICA cadena ISO 8601 que puede analizar de forma segura en los navegadores es la forma larga <strong>con un desplazamiento</strong> (&plusmn; HH: mm o "Z"). Si lo hace, puede ir y venir con seguridad entre la hora local y la hora UTC.
ja: 一番下の行は、日付文字列を解析するためのこれです。 ブラウザ間で安全に解析できる唯一のISO 8601文字列は、 <strong>オフセット付き</strong>の長い形式（&plusmn;HH：mmまたは "Z"）です。 これを行うと、現地時間とUTC時間の間を安全に行き来できます。
ko: 결론은 날짜 문자열을 구문 분석하는 것입니다. 브라우저에서 안전하게 구문 분석 할 수있는 유일한 ISO 8601 문자열 <strong>은 오프셋</strong> 이있는 긴 형식 (&plusmn; HH : mm 또는 "Z")입니다. 그렇게하면 현지 시간과 UTC 시간 사이를 안전하게 이동할 수 있습니다.
ru: Суть в том, что это для разбора строк даты. ЕДИНСТВЕННАЯ строка ISO 8601, которую можно безопасно анализировать в разных браузерах, - это длинная форма <strong>со смещением</strong> (&plusmn; ЧЧ: мм или &laquo;Z&raquo;). Если вы сделаете это, вы можете безопасно переходить между местным и UTC временем.
zh_cn: 底线是用于解析日期字符串的。 您可以在浏览器中安全解析的唯一ISO 8601字符串是<strong>带偏移量</strong>的长格式（&plusmn;HH：mm或&ldquo; Z&rdquo;）。 如果这样做，您可以安全地在本地时间和UTC时间之间来回切换。

source: The code <code>new Date('12/4/2013').toString()</code> goes through the following internal pseudo-transformation:
es: El c&oacute;digo <code>new Date('12/4/2013').toString()</code> pasa por la siguiente pseudo-transformaci&oacute;n interna:
ja: コード <code>new Date('12/4/2013').toString()</code> は、次の内部疑似変換を行います。
ko: <code>new Date('12/4/2013').toString()</code> 는 다음과 같은 내부 의사 변환을 거칩니다.
ru: Код <code>new Date('12/4/2013').toString()</code> проходит через следующее внутреннее псевдопреобразование:
zh_cn: 代码 <code>new Date('12/4/2013').toString()</code> 经过以下内部伪转换：

source: The following code is interpreted as the same date in all current browsers, but with the local timezone offset:
es: El siguiente código se interpreta como la misma fecha en todos los navegadores actuales,pero con el desplazamiento de la zona horaria local:
ja: 以下のコードは、現在のすべてのブラウザで同じ日付として解釈されますが、ローカルタイムゾーンのオフセットを使用しています。
ko: 다음 코드는 모든 현재 브라우저에서 동일한 날짜로 해석되지만 현지 시간대 오프셋이 사용됩니다.
ru: Следующий код интерпретируется как одна и та же дата во всех текущих браузерах,но со смещением локального часового пояса:
zh_cn: 下面的代码在所有的浏览器中都被解释为相同的日期,但在当地时区偏移。

source: The other way of creating these same local/UTC dates would be:
es: La otra forma de crear estas mismas fechas UTC locales sería:
ja: これらの同じlocalUTCの日付を作成する他の方法は、次のようになります。
ko: 동일한 현지 / UTC 날짜를 만드는 다른 방법은 다음과 같습니다.
ru: Другим способом создания этих же локальных дат было бы:
zh_cn: 创建这些相同的地方性的UTC日期的另一种方式是:

source: The third case, where there is no specifier, <em>should</em> be treated as local for the host system. FF correctly treats the input as local time while Chrome treats it as UTC, so producing different time values. For me this creates a 5 hour difference in the stored value, which is problematic. Other systems with different offsets will get different results.
es: El tercer caso, donde no hay especificador, <em>debe</em> tratarse como local para el sistema host. FF trata correctamente la entrada como hora local, mientras que Chrome la trata como UTC, por lo que produce diferentes valores de hora. Para m&iacute;, esto crea una diferencia de 5 horas en el valor almacenado, lo cual es problem&aacute;tico. Otros sistemas con diferentes compensaciones obtendr&aacute;n diferentes resultados.
ja: 指定子がない3番目のケースは、ホストシステムのローカルとして扱う<em>必要</em>があります。 FFは入力を現地時間として正しく処理しますが、Chromeは入力をUTCとして処理するため、異なる時間値が生成されます。 私にとっては、これにより、保存された値に5時間の差が生じ、問題が生じます。 オフセットが異なる他のシステムでは、異なる結果が得られます。
ko: 지정자가없는 세 번째 경우는 호스트 시스템의 로컬로 처리 <em>해야</em> 합니다. FF는 입력을 현지 시간으로 올바르게 처리하는 반면 Chrome은 입력을 UTC로 처리하므로 다른 시간 값을 생성합니다. 나에게 이것은 저장된 값에서 5 시간의 차이를 생성하는데 문제가 있습니다. 오프셋이 다른 다른 시스템은 다른 결과를 얻습니다.
ru: Третий случай, когда нет спецификатора, <em>должен</em> рассматриваться как локальный для хост-системы. FF правильно обрабатывает ввод как местное время, в то время как Chrome обрабатывает его как UTC, таким образом производя различные значения времени Для меня это создает 5-часовую разницу в сохраненном значении, что проблематично. Другие системы с другим смещением получат разные результаты.
zh_cn: 第三种情况，没有说明符， <em>应</em>视为主机系统的本地情况。 FF正确地将输入视为本地时间，而Chrome将其视为UTC，因此会产生不同的时间值。 对我来说，这会造成5个小时的储值差异，这是有问题的。 具有不同偏移量的其他系统将获得不同的结果。

source: There is some method to the madness. As a general rule, if a browser can interpret a date as an ISO-8601, it will. "2005-07-08" falls into this camp, and so it is parsed as UTC. "Jul 8, 2005" cannot, and so it is parsed in the local time.
es: Hay algún método para la locura.Como regla general,si un navegador puede interpretar una fecha como un ISO-8601,lo hará."2005-07-08" cae en este campo,y por lo tanto se analiza como UTC."8 de Julio de 2005" no puede,y por lo tanto se analiza en la hora local.
ja: 狂気にはいくつかの方法があります。一般的なルールとして、ブラウザが日付を ISO-8601 として解釈できるならば、そうします。"2005-07-08" はこのキャンプに該当し、UTC として解析されます。"July 8,2005" は解釈できないので、ローカルタイムで解析されます。
ko: 광기에 대한 몇 가지 방법이 있습니다. 일반적으로 브라우저가 날짜를 ISO-8601로 해석 할 수 있다면 그렇게됩니다. "2005-07-08"이이 캠프에 속하므로 UTC로 구문 분석됩니다. "2005 년 7 월 8 일"은 현지 시간으로 구문 분석 할 수 없습니다.
ru: Есть какой-то метод для безумия.Как правило,если браузер может интерпретировать дату как ISO-8601,он это сделает."2005-07-08" попадает в этот лагерь,и поэтому он разбирается как UTC."8 июля 2005 года" не может,и поэтому она анализируется по местному времени.
zh_cn: 乱七八糟的事情是有一定方法的。一般来说,如果浏览器能将日期解释为ISO-8601,它就会解释为ISO-8601。"2005-07-08 "属于这个阵营,所以它被解析为UTC。"2005年7月8日 "不能,所以它被解析为当地时间。

source: This <a href="https://code.google.com/p/flexible-js-formatting/">light weight date parsing library</a> should solve all similar problems. I like the library because it is quite easy to extend. It's also possible to i18n it (not very straight forward, but not that hard).
es: Esta <a href="https://code.google.com/p/flexible-js-formatting/">biblioteca de an&aacute;lisis de fechas de peso ligero</a> deber&iacute;a resolver todos los problemas similares. Me gusta la biblioteca porque es bastante f&aacute;cil de extender. Tambi&eacute;n es posible hacerlo (no muy sencillo, pero no tan dif&iacute;cil).
ja: この<a href="https://code.google.com/p/flexible-js-formatting/">軽量の日付解析ライブラリ</a>は、同様の問題をすべて解決するはずです。 拡張が非常に簡単なので、ライブラリが好きです。 i18nにすることも可能です（それほど単純ではありませんが、それほど難しくありません）。
ko: 이 <a href="https://code.google.com/p/flexible-js-formatting/">간단한 날짜 구문 분석 라이브러리</a> 는 모든 유사한 문제를 해결해야합니다. 확장하기가 쉽기 때문에 라이브러리가 마음에 듭니다. i18n으로 할 수도 있습니다 (매우 간단하지는 않지만 그렇게 어렵지는 않습니다).
ru: Эта <a href="https://code.google.com/p/flexible-js-formatting/">легковесная библиотека разбора даты</a> должна решить все подобные проблемы. Мне нравится библиотека, потому что ее довольно легко расширить. Это также возможно (не очень прямо, но не так сложно).
zh_cn: 这个<a href="https://code.google.com/p/flexible-js-formatting/">轻量级的日期解析库</a>应该解决所有类似的问题。 我喜欢该库，因为它很容易扩展。 也有可能（不是很简单，但是就不那么难了）。

source: This difference has been fixed as of 2020, but other quirks exist between browsers when parsing ISO 8601 format strings.
es: Esta diferencia se ha fijado a partir de 2020,pero existen otras peculiaridades entre los navegadores al analizar las cadenas del formato ISO 8601.
ja: この違いは2020年現在では修正されていますが、ISO 8601形式の文字列を解析する際には、ブラウザ間で他のクセが存在します。
ko: 이 차이는 2020 년부터 수정되었지만 ISO 8601 형식 문자열을 구문 분석 할 때 브라우저간에 다른 문제가 있습니다.
ru: Эта разница была исправлена с 2020 года,но при разборе строк формата ISO 8601 между браузерами существуют и другие причуды.
zh_cn: 从2020年起,这种差异已被修复,但在解析ISO 8601格式字符串时,浏览器之间还存在其他怪癖。

source: This does:
es: Esto lo hace:
ja: これはそうです。
ko: 이것은 :
ru: Так и есть:
zh_cn: 这样做。

source: This doesn't produce equivalent results:
es: Esto no produce resultados equivalentes:
ja: これでは同等の結果は得られません。
ko: 이것은 동등한 결과를 생성하지 않습니다.
ru: Это не дает эквивалентных результатов:
zh_cn: 这并不能产生同等的结果。

source: This method is useful for date formatted in an unussual way.
es: Este método es útil para la fecha formateada de manera no habitual.
ja: この方法は、日付が不自然な形でフォーマットされている場合に便利です。
ko: 이 방법은 날짜가 비정상적인 방식으로 유용합니다.
ru: Этот метод полезен при форматировании даты нестандартным образом.
zh_cn: 这种方法对日期格式化的方法很有用。

source: This works across browsers (after IE9):
es: Esto funciona en todos los navegadores (después de IE9):
ja: これは、ブラウザ全体(IE9以降)で動作します。
ko: 이것은 IE9 이후의 브라우저에서 작동합니다.
ru: Это работает во всех браузерах (после IE9):
zh_cn: 这在各个浏览器中都能使用(IE9之后)。

source: Thu Jul 07 2005 17:00:00 GMT-0700 (PST)
ja: Thu Jul 07 2005 17:00:00:00 GMT-0700 (PST)
ko: 2005 년 7 월 7 일 목요일 17:00:00 GMT-0700 (PST)
ru: Ту Июль 07 2005 17:00:00 GMT-0700 (PST)
zh_cn: Thu Jul 07 2005 17:00:00:00 GMT-0700 (PST)
