Repository: rueisnom/feedback
Catalog: xlf/25/87/34/5/2587345.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Until the 5th edition spec came out, the <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"><code>Date.parse</code></a> method was completely <em>implementation dependent</em> (<code>new Date(string)</code> is equivalent to <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"><code>Date.parse(string)</code></a> except the latter returns a number rather than a <code>Date</code>). In the 5th edition spec the requirement was added to support a <a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">simplified <em>(and slightly incorrect)</em> ISO-8601</a> (also see <a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">What are valid Date Time Strings in JavaScript?</a>). But other than that, there was <em>no</em> requirement for what <code>Date.parse</code> / <code>new Date(string)</code> should accept other than that they had to accept whatever <em>Date#toString</em> output (without saying what that was).
es: Hasta que sali&oacute; la especificaci&oacute;n de la quinta edici&oacute;n, el m&eacute;todo <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse</code> </a> era completamente <em>dependiente de la implementaci&oacute;n</em> (la <code>new Date(string)</code> es equivalente a <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse(string)</code> </a> excepto que esta &uacute;ltima devuelve un n&uacute;mero en lugar de una <code>Date</code> ). En la especificaci&oacute;n de la quinta edici&oacute;n, el requisito se agreg&oacute; para admitir un <a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">ISO-8601 simplificado <em>(y ligeramente incorrecto)</em></a> (tambi&eacute;n vea <a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">&iquest;Qu&eacute; son las cadenas de fecha y hora v&aacute;lidas en JavaScript?</a> ). Pero aparte de eso, no hab&iacute;a <em>ning&uacute;n</em> requisito para lo que <code>Date.parse</code> / <code>new Date(string)</code> deber&iacute;a aceptar, aparte de eso, ten&iacute;an que aceptar cualquier salida de <em>Date # toString</em> (sin decir lo que era).
ja: 第5版の仕様が発表されるまで、 <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse</code> </a>メソッドは完全に<em>実装に依存していました</em> （ <code>new Date(string)</code> は、 <code>Date</code> ではなく数値を返すことを除いて、 <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse(string)</code> </a>と同等です）。 第5版の仕様では、 <a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">簡略化された<em>（わずかに正しくない）</em> ISO-8601</a>をサポートするための要件が​​追加されました<em>（</em> <a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">JavaScriptで有効な日時文字列とは何ですか？</a> ） しかし、それ以外は、 <code>Date.parse</code> / <code>new Date(string)</code> が何を受け入れる必要があるか<em>という</em>要件はあり<em>ません</em>でした。
ko: 5 판이 나올 때까지 <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse</code> </a> 메소드는 <em>구현에 따라</em> 완전히 <em>다릅니다</em> ( <code>new Date(string)</code> 은 <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse(string)</code> </a> 동일하지만 후자는 <code>Date</code> 가 아닌 숫자를 반환합니다). 5 판 개정판에서는 <a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">단순화 된 <em>(약간 틀린)</em> ISO-8601</a> 을 지원하기 위해 요구 사항이 추가되었습니다 ( <a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">JavaScript에서 유효한 날짜 시간 문자열이란 무엇입니까? 참조</a> ). 그러나 그 외에는 <code>Date.parse</code> / <code>new Date(string)</code> 가 <em>Date # toString</em> 출력 (무엇을 말하지 않고 ) 을 수락 해야하는 것 외에는 어떤 것을 수락 해야하는지에 <em>대한</em> 요구 사항이 <em>없었</em> 습니다.
ru: До выхода спецификации 5-го издания метод <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse</code> </a> полностью <em>зависел от реализации</em> ( <code>new Date(string)</code> эквивалентна <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse(string)</code> </a> за исключением того, что последний возвращает число, а не <code>Date</code> ). В спецификации 5-го издания было добавлено требование для поддержки <a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">упрощенного <em>(и немного некорректного)</em> ISO-8601</a> (также см. <a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">Что такое допустимые строки даты и времени в JavaScript?</a> ). Но кроме этого, не было требования для того, что <code>Date.parse</code> / <code>new Date(string)</code> должен принимать, кроме того, что они должны были принимать любой вывод <em>Date # toString</em> (не говоря, что это было).
zh_cn: 在第5版规范发布之前， <a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse</code> </a>方法完全<em>依赖</em>于<em>实现</em> （ <code>new Date(string)</code> 等效于<a href="http://bclary.com/2004/11/07/#a-15.9.4.2"> <code>Date.parse(string)</code> ,</a>但后者返回一个数字而不是 <code>Date</code> ）。 在第5版规范中，添加了该要求以支持<a href="http://www.ecma-international.org/ecma-262/5.1/#sec-15.9.1.15">简化的<em>（并且略有错误）</em> ISO-8601</a> （另请参见<a href="https://stackoverflow.com/questions/51715259/what-are-valid-date-time-strings-in-javascript/">JavaScript中有效的日期时间字符串是什么？</a> ）。 但是除此之外，除了必须接受任何<em>Date＃toString</em>输出（不说那是什么）之外， <em>没有</em>要求 <code>Date.parse</code> / <code>new Date(string)</code> 应该接受什么。

source: Use <a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a> to parse dates:
es: Use <a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a> para analizar fechas:
ja: <a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a>を使用して日付を解析します。
ko: <a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a> 를 사용하여 날짜를 구문 분석하십시오.
ru: Используйте <a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a> для разбора дат:
zh_cn: 使用<a href="https://momentjs.com/docs/#/parsing/string-format/">moment.js</a>解析日期：

source: While <a href="https://stackoverflow.com/a/2587398">CMS is correct</a> that passing strings into the parse method is generally unsafe, the new <a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">ECMA-262 5th Edition</a> (aka ES5) specification in section 15.9.4.2 suggests that <code>Date.parse()</code> actually should handle ISO-formatted dates. The old specification made no such claim. Of course, old browsers and some current browsers still do not provide this ES5 functionality.
es: Si bien <a href="https://stackoverflow.com/a/2587398">CMS tiene raz&oacute;n en</a> que pasar cadenas al m&eacute;todo de an&aacute;lisis generalmente no es seguro, la nueva <a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">especificaci&oacute;n ECMA-262 5th Edition</a> (tambi&eacute;n conocida como ES5) en la secci&oacute;n 15.9.4.2 sugiere que <code>Date.parse()</code> realidad deber&iacute;a manejar fechas con formato ISO. La antigua especificaci&oacute;n no hizo tal afirmaci&oacute;n. Por supuesto, los navegadores antiguos y algunos navegadores actuales a&uacute;n no ofrecen esta funcionalidad ES5.
ja: <a href="https://stackoverflow.com/a/2587398">CMSは正しい</a>ので、解析メソッドに文字列を渡すことは一般的に安全ではありませんが、セクション15.9.4.2の新しい<a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">ECMA-262 5th Edition</a> （別名ES5）仕様では、 <code>Date.parse()</code> が実際にISO形式の日付を処理する必要があることを示唆しています。 古い仕様ではそのような主張はありませんでした。 もちろん、古いブラウザと一部の現在のブラウザは、このES5機能をまだ提供していません。
ko: <a href="https://stackoverflow.com/a/2587398">CMS가</a> 문자열을 구문 분석 방법으로 전달하는 것이 일반적으로 안전하지 않은 것은 맞지만 15.9.4.2 섹션의 새로운 <a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">ECMA-262 5th Edition</a> (일명 ES5) 사양에서는 <code>Date.parse()</code> 실제로 ISO 형식의 날짜를 처리해야한다고 제안합니다. 구 사양은 그런 주장을하지 않았다. 물론 이전 브라우저와 일부 최신 브라우저는 여전히이 ES5 기능을 제공하지 않습니다.
ru: Хотя <a href="https://stackoverflow.com/a/2587398">CMS верна</a> , передача строк в метод синтаксического анализа, как правило, небезопасна, новая спецификация <a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">ECMA-262 5-го издания</a> (aka ES5) в разделе 15.9.4.2 предполагает, что <code>Date.parse()</code> фактически должна обрабатывать даты в формате ISO. Старая спецификация не предъявляла таких требований. Конечно, старые браузеры и некоторые современные браузеры по-прежнему не предоставляют эту функциональность ES5.
zh_cn: 尽管<a href="https://stackoverflow.com/a/2587398">CMS是正确的</a> ，通常将字符串传递到parse方法是不安全的，但15.9.4.2节中的新<a href="http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf">ECMA-262第5版</a> （aka ES5）规范建议 <code>Date.parse()</code> 实际上应处理ISO格式的日期。 旧的规范没有这样的要求。 当然，旧的浏览器和某些当前的浏览器仍然不提供此ES5功能。

source: While there is some variance in the input string formats that the major browsers will parse as dates, they essentially interpret them the same as far as time zones and daylight saving is concerned even though parsing is largely implementation dependent.
es: Si bien hay cierta variación en los formatos de las cadenas de entrada que los principales navegadores analizarán como fechas,esencialmente las interpretan de la misma manera en lo que respecta a las zonas horarias y el ahorro de luz diurna,aunque el análisis sintáctico depende en gran medida de la aplicación.
ja: 主要なブラウザが日付としてパースする入力文字列の形式には多少の違いがありますが、タイムゾーンやサマータイムに関しては、基本的には同じように解釈されます。
ko: 주요 브라우저가 날짜로 구문 분석하는 입력 문자열 형식에는 약간의 차이가 있지만, 구문 분석이 구현에 크게 의존하더라도 시간대와 일광 절약에 관한 한 기본적으로 동일하게 해석합니다.
ru: Несмотря на то,что существуют некоторые различия в форматах входных строк,которые основные браузеры будут разбирать как даты,они,по сути,интерпретируют их так же,как и часовые пояса и летнее время,даже несмотря на то,что разбор в значительной степени зависит от реализации.
zh_cn: 虽然主要的浏览器会将输入的字符串格式解析为日期,但就时区和夏令时而言,它们的解释基本上是一样的,尽管解析方式主要取决于实现。

source: Why does Date.parse give incorrect results
es: ¿Por qué Date.parse da resultados incorrectos
ja: Date.parse が正しくない結果を出すのはなぜですか?
ko: Date.parse가 왜 잘못된 결과를 제공합니까?
ru: Почему Date.parse дает неверные результаты.
zh_cn: 为什么Date.parse会给出不正确的结果?

source: Why is the second parse incorrect?
es: ¿Por qué el segundo análisis es incorrecto?
ja: 2番目の構文が間違っているのはなぜですか?
ko: 두 번째 구문 분석이 왜 올바르지 않습니까?
ru: Почему второй разбор неправильный?
zh_cn: 为什么第二种解析不正确?

source: Your browser should provide the same timestamp result as <code>Date.parse</code> with:
es: Su navegador debe proporcionar el mismo resultado de marca de tiempo que <code>Date.parse</code> con:
ja: ブラウザは、 <code>Date.parse</code> と同じタイムスタンプの結果を次のように提供する必要があります。
ko: 브라우저는 다음과 함께 <code>Date.parse</code> 와 동일한 타임 스탬프 결과를 제공해야합니다.
ru: Ваш браузер должен предоставить тот же результат отметки времени, что и <code>Date.parse</code> :
zh_cn: 您的浏览器应提供与 <code>Date.parse</code> 相同的时间戳结果， 并带有：

source: Your second example isn't wrong. It is the specified date in UTC, as implied by <code>Date.prototype.toISOString()</code>, but is represented in your local timezone.
es: Tu segundo ejemplo no est&aacute; mal. Es la fecha especificada en UTC, como lo implica <code>Date.prototype.toISOString()</code> , pero est&aacute; representada en su zona horaria local.
ja: 2番目の例は間違っていません。 これは、 <code>Date.prototype.toISOString()</code> で暗黙的に示されるUTCでの指定日付ですが、ローカルタイムゾーンで表されます。
ko: 두 번째 예는 틀리지 않습니다. <code>Date.prototype.toISOString()</code> 의해 암시 된대로 UTC로 지정된 날짜이지만 현지 시간대로 표시됩니다.
ru: Ваш второй пример не ошибается. Это указанная дата в UTC, как подразумевается <code>Date.prototype.toISOString()</code> , но она представлена ​​в вашем местном часовом поясе.
zh_cn: 您的第二个示例没有错。 它是UTC中指定的日期，如 <code>Date.prototype.toISOString()</code> 所示 ，但以您当地的时区表示。

source: ddd MMM DD YYYY HH:mm:ss ZZ [(timezone name)]
es: ddd MMM DD YYYY HH:mm:ss ZZ [(nombre de la zona horaria)]
ja: ddd MMM DD YYYY HH:mm:ss ZZ [(タイムゾーン名)]
ko: ddd MMM DD YYYY HH : mm : ss ZZ [(시간대 이름)]
ru: ddd MMM DD YYYY HH:mm:ss ZZ [(название часового пояса)]
zh_cn: ddd MMM DD YYYY HH:mm:ss ZZ [(时区名称)]

source: e.g. Tue 10 Jul 2018 13:09:58 GMT
es: por ejemplo,mar 10 de julio de 2018 13:09:58 GMT
ja: 例)2018年7月10日(火)13:09:58 GMT
ko: 예 : 화요일 10 Jul 2018 13:09:58 GMT
ru: например,Tue 10 Jul 2018 13:09:58 GMT
zh_cn: 例如:Tue 10 Jul 2018 13:09:58 GMT

source: e.g. Tue Jul 10 2018 18:39:58 GMT+0530 (IST)
es: por ejemplo,mar 10 de julio de 2018 18:39:58 GMT+0530 (IST)
ja: 例:Tue Jul 10 2018 18:39:58 GMT+0530 (IST)
ko: 예 : 2018 년 7 월 10 일 화요일 18:39:58 GMT + 0530 (IST)
ru: например,Tue Jul 10 2018 18:39:58 GMT+0530 (IST)
zh_cn: 例如:Tue Jul 10 2018 18:39:58 GMT+0530 (IST)

source: has default day and time
es: tiene un día y una hora predeterminados
ja: にはデフォルトの曜日と時間があります。
ko: 기본 날짜와 시간이 있습니다
ru: имеет дефолт по умолчанию день и время
zh_cn: 有默认的日期和时间

source: parse slashes, dashes, colons and spaces
es: analizar barras,guiones,dos puntos y espacios
ja: スラッシュ、ダッシュ、コロン、スペースを解析します。
ko: 슬래시, 대시, 콜론 및 공백 구문 분석
ru: слеши,тире,двоеточия и пробелы
zh_cn: 斜线、破折号、冒号和空格解析

source: providing 2 more formats that <em>Date.parse</em> should parse reliably in new implementations (noting that support is not ubiquitous and non&ndash;compliant implementations will remain in use for some time).
es: proporcionando 2 formatos m&aacute;s que <em>Date.parse</em> deber&iacute;a analizar de manera confiable en nuevas implementaciones (se&ntilde;alando que el soporte no es ubicuo y las implementaciones no conformes seguir&aacute;n en uso durante alg&uacute;n tiempo).
ja: <em>Date.parse</em>が新しい実装で確実に解析する必要のある2つの追加フォーマットを提供します（サポートはユビキタスではなく、非準拠の実装はしばらく使用され続けることに注意してください）。
ko: <em>Date.parse</em> 가 새로운 구현에서 안정적으로 구문 분석해야하는 2 가지 형식을 추가로 제공합니다 (지원이 어디에서나 사용되지 않으며 비준수 구현은 얼마 동안 계속 사용됨).
ru: предоставление еще 2 форматов, которые <em>Date.parse</em> должен надежно анализировать в новых реализациях (отмечая, что поддержка не является повсеместной, и несовместимые реализации будут использоваться в течение некоторого времени).
zh_cn: 提供了<em>Date.parse</em>应该在新的实现中可靠地解析的另外2种格式（请注意，支持并不普遍，并且不兼容的实现将在一段时间内继续使用）。

source: trim and clean input spaces
es: recortar y limpiar los espacios de entrada
ja: トリムアンドクリーン入力スペース
ko: 입력 공간 정리 및 청소
ru: чистые и аккуратные входные отверстия
zh_cn: 裁剪和清洁的输入空间
