Repository: rueisnom/feedback
Catalog: xlf/12/07/40/6/1207406.*.001.xlf
Languages: es, ja, ko, zh_cn

source: Python 2 users: replace <code>range</code> by <code>xrange</code> to avoid creating a hardcoded list
es: Usuarios de Python 2: reemplace el <code>range</code> por <code>xrange</code> para evitar crear una lista codificada
ja: Python 2ユーザー：ハードコードされたリストの作成を避けるために、 <code>range</code> を <code>xrange</code> で置き換えます
ko: Python 2 사용자 : 하드 코딩 된 목록을 생성하지 않도록 <code>range</code> 를 <code>xrange</code> 로 대체
zh_cn: Python 2用户：用 <code>xrange</code> 替换 <code>range</code> 以避免创建硬编码列表

source: Should work on all mutable sequences not just lists.
es: Debería funcionar en todas las secuencias mutables,no sólo en las listas.
ja: リストだけでなく、すべての変異可能な配列で動作するようにしてください。
ko: 목록뿐만 아니라 모든 가변 시퀀스에서 작동합니다.
zh_cn: 应该适用于所有可变异序列,而不仅仅是列表。

source: That should be significantly faster than anything else.
es: Eso debería ser significativamente más rápido que cualquier otra cosa.
ja: それは何よりもはるかに早いはずです。
ko: 다른 것보다 훨씬 빠릅니다.
zh_cn: 这应该比其他任何事情都要快得多。

source: The <code>FluidIterable</code> class just provides a wrapper for the original list object. The original object can be accessed as a property of the fluid object like so:
es: La clase <code>FluidIterable</code> solo proporciona un contenedor para el objeto de lista original. Se puede acceder al objeto original como una propiedad del objeto fluido de la siguiente manera:
ja: <code>FluidIterable</code> クラスは、元のリストオブジェクトのラッパーを提供するだけです。 元のオブジェクトには、次のように流動オブジェクトのプロパティとしてアクセスできます。
ko: <code>FluidIterable</code> 클래스는 원래 목록 객체에 대한 래퍼를 제공합니다. 원본 객체는 다음과 같이 유동 객체의 속성으로 액세스 할 수 있습니다.
zh_cn: <code>FluidIterable</code> 类仅提供原始列表对象的包装。 可以将原始对象作为流体对象的属性进行访问，如下所示：

source: The answers suggesting list comprehensions are ALMOST correct -- except that they build a completely new list and then give it the same name the old list as, they do NOT modify the old list in place. That's different from what you'd be doing by selective removal, as in <a href="https://stackoverflow.com/a/1207427/3064538">@Lennart's suggestion</a> -- it's faster, but if your list is accessed via multiple references the fact that you're just reseating one of the references and NOT altering the list object itself can lead to subtle, disastrous bugs.
es: Las respuestas que sugieren la comprensi&oacute;n de la lista son casi correctas, excepto que crean una lista completamente nueva y luego le dan el mismo nombre que la lista anterior, ya que NO modifican la lista anterior en su lugar. Eso es diferente de lo que estar&iacute;a haciendo mediante la eliminaci&oacute;n selectiva, como en <a href="https://stackoverflow.com/a/1207427/3064538">la sugerencia de @ Lennart</a> : es m&aacute;s r&aacute;pido, pero si se accede a su lista a trav&eacute;s de m&uacute;ltiples referencias, el hecho de que simplemente est&aacute; volviendo a colocar una de las referencias y NO alterando el objeto de la lista en s&iacute; mismo puede conducir a errores sutiles y desastrosos.
ja: リストの内包を示唆する回答はほぼ正しいです。ただし、完全に新しいリストを作成し、古いリストと同じ名前を付けた場合を除き、古いリストは変更されません。 これは、 <a href="https://stackoverflow.com/a/1207427/3064538">@ Lennartの提案の</a>ように、選択的な削除によって行うこととは異なります-高速ですが、リストが複数の参照を介してアクセスされる場合、参照の1つを再配置し、リストオブジェクトを変更しないという事実それ自体が、微妙で悲惨なバグにつながる可能性があります。
ko: 목록 이해를 제안하는 답변은 완전히 정확합니다. 단지 완전히 새로운 목록을 작성한 다음 이전 목록과 동일한 이름을 지정하면 이전 목록을 수정하지 않습니다. <a href="https://stackoverflow.com/a/1207427/3064538">@Lennart의 제안</a> 에서와 같이 선택적 제거로 수행하는 것과는 다릅니다. 더 빠르지 만 여러 참조를 통해 목록에 액세스하면 참조 중 하나만 다시하고 목록 객체를 변경하지 않는다는 사실 그 자체는 미묘하고 비참한 버그로 이어질 수 있습니다.
zh_cn: 暗示列表理解的答案几乎是正确的-除了它们会建立一个全新的列表，然后为其命名与旧列表相同外，它们不会修改旧列表。 这与<a href="https://stackoverflow.com/a/1207427/3064538">@Lennart的建议中</a>的选择性删除操作不同-速度更快，但是如果通过多个引用访问列表，则说明您只是在重新放置其中一个引用而不更改列表对象本身可能会导致微妙的灾难性错误。

source: The code below is one example of an algorithm that suffers from the above problem. The algorithm will reduce a list so that no element is a multiple of any other element.
es: El código que figura a continuación es un ejemplo de un algoritmo que sufre el problema anterior.El algoritmo reducirá una lista de manera que ningún elemento sea múltiplo de ningún otro elemento.
ja: 以下のコードは、上記の問題に悩まされるアルゴリズムの一例です。このアルゴリズムは,どの要素も他の要素の倍数にならないようにリストを削減します.
ko: 아래 코드는 위의 문제가 발생하는 알고리즘의 한 예입니다. 이 알고리즘은 어떤 요소도 다른 요소의 배수가되지 않도록 목록을 줄입니다.
zh_cn: 下面的代码是一个受上述问题困扰的算法的一个例子。该算法将减少一个列表,使任何元素都不是其他元素的倍数。

source: The first problem is that you are passing both 'a' and 'b' to remove(), but remove() only accepts a single argument. So how can we get remove() to work properly with your list? We need to figure out what each element of your list is. In this case, each one is a tuple. To see this, let's access one element of the list (indexing starts at 0):
es: El primer problema es que se pasa tanto "a" como "b" para eliminar(),pero eliminar()sólo acepta un único argumento.Entonces,¿cómo podemos hacer que remove()funcione correctamente con su lista? Tenemos que averiguar qué es cada elemento de su lista.En este caso,cada uno es una tupla.Para verlo,accedamos a un elemento de la lista (la indexación comienza en 0):
ja: 最初の問題は、'a' と 'b' の両方を remove()に渡しているのに、 remove()は単一の引数しか受け付けないということです。では、どのようにして remove()をリストで正しく動作させるのでしょうか?リストの各要素が何であるかを把握する必要があります。この場合、それぞれの要素はタプルです。これを確認するために、リストの 1 つの要素にアクセスしてみましょう (インデックスは 0 から始まります)。
ko: 첫 번째 문제는 remove ()에 'a'와 'b'를 모두 전달하지만 remove ()는 단일 인수 만 허용한다는 것입니다. 그렇다면 목록에서 제대로 작동하도록 remove ()를 어떻게 얻을 수 있습니까? 리스트의 각 요소가 무엇인지 파악해야합니다. 이 경우, 각각은 튜플입니다. 이를 확인하려면 목록의 한 요소에 액세스하십시오 (인덱싱은 0에서 시작).
zh_cn: 第一个问题是,你把'a'和'b'都传给了 remove(),但 remove()只接受一个参数。那么,我们如何让 remove()在你的列表中正常工作呢?我们需要弄清楚你的列表中的每个元素是什么。在这种情况下,每个元素都是一个tuple。为了了解这个问题,让我们访问列表中的一个元素(索引从0开始)。

source: The most effective method is list comprehension, many people show their case, of course, it is also a good way to get an <code>iterator</code> through <code>filter</code>.
es: El m&eacute;todo m&aacute;s efectivo es la comprensi&oacute;n de la lista, muchas personas muestran su caso, por supuesto, tambi&eacute;n es una buena manera de obtener un <code>iterator</code> trav&eacute;s del <code>filter</code> .
ja: 最も効果的な方法はリストを理解することであり、多くの人が自分のケースを示します。もちろん、 <code>filter</code> 介して <code>iterator</code> を取得するのにも良い方法です。
ko: 가장 효과적인 방법은 목록 이해이며 많은 사람들이 자신의 사례를 보여줍니다. 물론 <code>filter</code> 통해 <code>iterator</code> 를 얻는 좋은 방법입니다.
zh_cn: 最有效的方法是列表理解，很多人都展示了他们的案例，当然，这也是通过 <code>filter</code> 获得 <code>iterator</code> 的好方法。

source: The most intuitive solution is to copy the list, then iterate over the original list and only modify the copy. You can try doing so like this:
es: La solución más intuitiva es copiar la lista,luego iterar sobre la lista original y sólo modificar la copia.Puedes intentar hacerlo así:
ja: 最も直感的な解決策は、リストをコピーしてから、元のリストの上で反復処理を行い、コピーを修正することです。このようにしてみてください。
ko: 가장 직관적 인 해결책은 목록을 복사 한 다음 원본 목록을 반복하고 사본 만 수정하는 것입니다. 다음과 같이 해보십시오.
zh_cn: 最直观的解决方案是复制列表,然后迭代原始列表,只修改副本。你可以尝试这样做。

source: The only condition is that you must only modify the list in place, if at any point <code>fluidL</code> or <code>l</code> were reassigned to a different list object the code would not work. The original <code>fluidL</code> object would still be used by the for loop but would become out of scope for us to modify.
es: La &uacute;nica condici&oacute;n es que solo debe modificar la lista en su lugar, si en alg&uacute;n momento <code>fluidL</code> o I fueron reasignados a un objeto de lista diferente, el c&oacute;digo no funcionar&iacute;a. El objeto <code>fluidL</code> a&uacute;n ser&iacute;a utilizado por el bucle for, pero quedar&iacute;a fuera de alcance para que lo modifiquemos.
ja: 唯一の条件は、リストを変更する必要があることだけです。いずれかの時点で、 <code>fluidL</code> または <code>l</code> が別のリストオブジェクトに再割り当てされた場合、コードは機能しません。 元の <code>fluidL</code> オブジェクトは引き続きforループで使用されますが、変更する範囲外になります。
ko: 유일한 조건은, 어떤 시점에서 <code>fluidL</code> 또는 <code>l</code> 이 다른 목록 객체에 재 할당 된 경우 코드가 작동하지 않을 경우에만 목록을 수정해야한다는 것입니다. 원래 <code>fluidL</code> 객체는 여전히 for 루프에 의해 사용 되나 우리가 수정할 수있는 범위를 벗어납니다.
zh_cn: 唯一的条件是，您必须仅在适当位置修改列表，如果在任何时候将 <code>fluidL</code> 或 <code>l</code> 重新分配给其他列表对象，代码将无法正常工作。 最初的 <code>fluidL</code> 对象仍将由for循环使用，但将超出我们的修改范围。

source: The other answers are correct that it is usually a bad idea to delete from a list that you're iterating. Reverse iterating avoids the pitfalls, but it is much more difficult to follow code that does that, so usually you're better off using a list comprehension or <code>filter</code>.
es: Las otras respuestas son correctas, por lo general es una mala idea eliminar de una lista que est&aacute; iterando. La iteraci&oacute;n inversa evita las trampas, pero es mucho m&aacute;s dif&iacute;cil seguir el c&oacute;digo que hace eso, por lo que generalmente es mejor usar una lista de comprensi&oacute;n o <code>filter</code> .
ja: 他の答えは正解です。通常、反復しているリストから削除することは悪い考えです。 逆反復は落とし穴を回避しますが、それを行うコードに従うのははるかに難しいので、通常はリスト内包または <code>filter</code> を使用する方がよいでしょう。
ko: 다른 답변은 일반적으로 반복하는 목록에서 삭제하는 것이 좋지 않다는 것이 맞습니다. 역 반복은 함정을 피하지만 코드를 따르는 것은 훨씬 어렵 기 때문에 일반적으로 목록 이해 또는 <code>filter</code> 사용하는 것이 좋습니다.
zh_cn: 其他答案是正确的，因为从要迭代的列表中删除通常不是一个好主意。 反向迭代避免了陷阱，但是遵循这样做的代码要困难得多，因此通常最好使用列表推导或 <code>filter</code> 。

source: The output and the final reduced list are shown below
es: El resultado y la lista reducida final se muestran a continuación
ja: 出力と最終的に縮小されたリストを以下に示します。
ko: 출력 및 최종 축소 목록은 다음과 같습니다.
zh_cn: 输出和最终减少的列表如下图所示

source: The solution follows on from <a href="https://stackoverflow.com/a/6260097/4451578">this</a> answer (for a related question) from senderle. Which explains how the the array index is updated while iterating through a list that has been modified. The solution below is designed to correctly track the array index even if the list is modified.
es: La soluci&oacute;n se deriva de <a href="https://stackoverflow.com/a/6260097/4451578">esta</a> respuesta (para una pregunta relacionada) de senderle. Lo que explica c&oacute;mo se actualiza el &iacute;ndice de matriz mientras se itera a trav&eacute;s de una lista que se ha modificado. La soluci&oacute;n a continuaci&oacute;n est&aacute; dise&ntilde;ada para rastrear correctamente el &iacute;ndice de matriz incluso si se modifica la lista.
ja: 解決策は、senderleからの（関連する質問に対する） <a href="https://stackoverflow.com/a/6260097/4451578">この</a>回答から続きます。 これは、変更されたリストを反復処理するときに配列インデックスが更新される方法を説明しています。 以下のソリューションは、リストが変更された場合でも配列のインデックスを正しく追跡するように設計されています。
ko: 해결책은 senderle <a href="https://stackoverflow.com/a/6260097/4451578">의이</a> 답변 (관련 질문에 대한)에서 따릅니다. 배열 목록이 수정 된 목록을 반복하면서 업데이트되는 방법을 설명합니다. 아래 솔루션은 목록이 수정 된 경우에도 배열 인덱스를 올바르게 추적하도록 설계되었습니다.
zh_cn: 从senderle的<a href="https://stackoverflow.com/a/6260097/4451578">此</a>答案（针对相关问题）可以得出解决方案。 这说明了在遍历已修改的列表时如何更新数组索引。 即使解决方案列表被修改，下面的解决方案旨在正确跟踪数组索引。

source: The value of <code>i</code> is not changed in the if block because you'll want to get value of the new item FROM THE SAME INDEX, once the old item is deleted.
es: El valor de <code>i</code> no cambia en el bloque if porque querr&aacute; obtener el valor del nuevo elemento DEL MISMO &Iacute;NDICE, una vez que se elimine el elemento anterior.
ja: 古い項目が削除されると、同じ項目から新しい項目の値を取得するため、 <code>i</code> ブロックのiの値は変更されません。
ko: 이전 항목이 삭제되면 동일한 색인에서 새 항목의 값을 얻으려고하기 때문에 <code>i</code> 블록의 값은 if 블록에서 변경되지 않습니다.
zh_cn: <code>i</code> 的值在if块中未更改，因为一旦删除了旧项，您将希望从相同索引中获取新项的值。

source: There are two problems in your code:
es: Hay dos problemas en su código:
ja: あなたのコードには2つの問題があります。
ko: 코드에는 두 가지 문제가 있습니다.
zh_cn: 你的代码里有两个问题。

source: There doesn't seem to be an explicit linked list type in the Python stdlib either: <a href="https://stackoverflow.com/questions/280243/python-linked-list/280286">Python Linked List</a>
es: Tampoco parece haber un tipo de lista enlazada expl&iacute;cita en Python stdlib: <a href="https://stackoverflow.com/questions/280243/python-linked-list/280286">Lista enlazada de Python</a>
ja: Python stdlibにも明示的なリンクリストタイプがないようです： <a href="https://stackoverflow.com/questions/280243/python-linked-list/280286">Python Linked List</a>
ko: 파이썬 stdlib에는 명시 적으로 링크 된 목록 유형이없는 것 같습니다 : <a href="https://stackoverflow.com/questions/280243/python-linked-list/280286">Python Linked List</a>
zh_cn: Python stdlib中似乎也没有明确的链接列表类型： <a href="https://stackoverflow.com/questions/280243/python-linked-list/280286">Python链接列表</a>

source: There is an example (get the odds in the tuple):
es: Hay un ejemplo (obtener las probabilidades en la tupla):
ja: 例があります(タプルの中のオッズを取得する)。
ko: 예가 있습니다 (튜플에서 확률을 얻으십시오).
zh_cn: 有这样一个例子(得到的赔率在元组中)。

source: There is, however, one case where it is safe to remove elements from a sequence that you are iterating: if you're only removing one item while you're iterating. This can be ensured using a <code>return</code> or a <code>break</code>. For example:
es: Sin embargo, hay un caso en el que es seguro eliminar elementos de una secuencia que est&aacute; iterando: si solo est&aacute; eliminando un elemento mientras est&aacute; iterando. Esto se puede garantizar mediante un <code>return</code> o un <code>break</code> . Por ejemplo:
ja: ただし、反復しているシーケンスから要素を削除しても安全なケースが1つあります。それは、反復中に1つのアイテムのみを削除する場合です。 これは、 <code>return</code> または <code>break</code> を使用して確認できます。 例えば：
ko: 그러나 반복하는 시퀀스에서 요소를 제거하는 것이 안전한 경우가 있습니다. 반복하는 동안 하나의 항목 만 제거하는 경우입니다. 이것은 <code>return</code> 또는 <code>break</code> 사용하여 보장 할 수 있습니다. 예를 들면 다음과 같습니다.
zh_cn: 但是，在一种情况下，可以安全地从要迭代的序列中删除元素：如果仅在迭代时删除一个项目。 这可以通过使用 <code>return</code> 或 <code>break</code> 来确保。 例如：

source: This answer was originally written in response to a question which has since been marked as duplicate: <a href="https://stackoverflow.com/questions/40175149/removing-coordinates-from-list-on-python">Removing coordinates from list on python</a>
es: Esta respuesta se escribi&oacute; originalmente en respuesta a una pregunta que desde entonces se ha marcado como duplicada: <a href="https://stackoverflow.com/questions/40175149/removing-coordinates-from-list-on-python">Eliminar coordenadas de la lista en Python</a>
ja: この回答はもともと、重複としてマークされている質問への応答として書かれました： <a href="https://stackoverflow.com/questions/40175149/removing-coordinates-from-list-on-python">pythonのリストから座標を削除しています</a>
ko: 이 답변은 원래 중복으로 표시 된 질문에 대한 답변으로 작성되었습니다 .python의 <a href="https://stackoverflow.com/questions/40175149/removing-coordinates-from-list-on-python">목록에서 좌표 제거</a>
zh_cn: 此答案最初是为回答一个问题而编写的，此问题已被标记为重复： <a href="https://stackoverflow.com/questions/40175149/removing-coordinates-from-list-on-python">从python列表中删除坐标</a>

source: This approach could be useful if there are other references to <code>somelist</code> that need to reflect the changes.
es: Este enfoque podr&iacute;a ser &uacute;til si hay otras referencias a una <code>somelist</code> de reproducci&oacute;n que necesitan reflejar los cambios.
ja: このアプローチは、変更を反映する必要がある <code>somelist</code> への他の参照がある場合に役立ちます。
ko: 이 접근 방식은 변경 사항을 반영해야하는 <code>somelist</code> 에 대한 다른 참조가있는 경우 유용 할 수 있습니다.
zh_cn: 如果还有其他引用要反映更改的 <code>somelist</code> ，则此方法可能很有用。

source: This code runs without any error, but let's look at the list it outputs:
es: Este código funciona sin ningún error,pero veamos la lista que da:
ja: このコードは何のエラーもなく実行されますが、出力されるリストを見てみましょう。
ko: 이 코드는 오류없이 실행되지만 출력되는 목록을 살펴 보겠습니다.
zh_cn: 这段代码运行时没有任何错误,但我们来看看它输出的列表。

source: This is because when we created L2, python did not actually create a new object. Instead, it merely referenced L2 to the same object as L1. We can verify this with 'is' which is different from merely "equals" (==).
es: Esto se debe a que cuando creamos L2,la pitón no creó realmente un nuevo objeto.En su lugar,se refirió a L2 como el mismo objeto que L1.Podemos verificar esto con "es",que es diferente de simplemente "igual" (==).
ja: これは、L2を作成したときに、pythonは実際には新しいオブジェクトを作成しなかったからです。その代わりに、単にL1と同じオブジェクトにL2を参照しています。これは単に "equals" (==)とは異なる'is'で検証することができます。
ko: L2를 만들 때 파이썬이 실제로 새 객체를 만들지 않았기 때문입니다. 대신 L2를 L1과 동일한 객체로 참조했습니다. 단순히 "같음"(==)과 다른 'is'로이를 확인할 수 있습니다.
zh_cn: 这是因为当我们创建L2时,python并没有实际创建一个新对象。相反,它只是将L2引用到与L1相同的对象。我们可以用 "is "来验证这一点,它不同于单纯的 "等价"(===)。

source: This is more space efficient since it dispenses the array copy, but it is less time efficient because CPython lists <a href="https://stackoverflow.com/questions/3917574/how-is-pythons-list-implemented">are implemented with dynamic arrays</a>.
es: Esto es m&aacute;s eficiente en el espacio ya que distribuye la copia de la matriz, pero es menos eficiente en el tiempo porque las listas de CPython <a href="https://stackoverflow.com/questions/3917574/how-is-pythons-list-implemented">se implementan con matrices din&aacute;micas</a> .
ja: これは、配列のコピーが不要になるためスペース効率が向上します<a href="https://stackoverflow.com/questions/3917574/how-is-pythons-list-implemented">が</a> 、CPythonリストは動的配列で実装されるため、時間効率が低下します 。
ko: 이는 배열 사본을 분배하므로 공간 효율적이지만 CPython 목록 <a href="https://stackoverflow.com/questions/3917574/how-is-pythons-list-implemented">이 동적 배열로 구현</a> 되므로 시간이 덜 효율적입니다.
zh_cn: 由于它分配了数组副本，因此空间使用效率更高，但由于CPython列表<a href="https://stackoverflow.com/questions/3917574/how-is-pythons-list-implemented">是使用动态数组实现的，</a>因此时间效率较低。

source: This is often easier to understand than a list comprehension when you're doing some operations with side effects on the first item in a list that meets some condition and then removing that item from the list immediately after.
es: Esto suele ser más fácil de entender que la comprensión de una lista cuando se realizan algunas operaciones con efectos secundarios en el primer elemento de una lista que cumple alguna condición y luego se elimina ese elemento de la lista inmediatamente después.
ja: これは、リストの最初の項目で何らかの条件を満たしている項目に副作用のある操作をして、その直後にその項目をリストから削除するというような場合には、リスト理解よりもわかりやすいことが多いです。
ko: 어떤 조건을 충족하는 목록의 첫 번째 항목에 부작용이있는 작업을 수행 한 다음 목록에서 즉시 해당 항목을 제거 할 때 목록 이해보다 이해하기가 더 쉽습니다.
zh_cn: 当你对列表中的第一个符合某种条件的项目进行一些有副作用的操作,然后紧接着把这个项目从列表中删除,这往往比列表理解更容易理解。

source: This means that item removal requires shifting all following items back by one, which is O(N).
es: Esto significa que la eliminación de los artículos requiere cambiar todos los siguientes artículos de vuelta por uno,que es O(N).
ja: つまり、アイテムの除去には、以下のアイテムを1つずつずらして戻す必要があり、O(N)となります。
ko: 즉, 항목을 제거하려면 모든 다음 항목을 하나씩 뒤로 이동해야합니다 (O (N)).
zh_cn: 也就是说,物品的移除需要将下面的物品全部移回一个,也就是O(N)。

source: This part of the docs makes it clear that:
es: Esta parte de los documentos deja claro que:
ja: ドキュメントのこの部分を見れば一目瞭然です。
ko: 문서 의이 부분은 다음을 분명히합니다.
zh_cn: 这一部分的docs明确指出:

source: This part of the docs says once again that you have to make a copy, and gives an actual removal example:
es: Esta parte de los documentos dice una vez más que hay que hacer una copia,y da un ejemplo de eliminación real:
ja: ドキュメントのこの部分は、コピーを取らなければならないと改めて言い、実際の削除例を示しています。
ko: 문서 의이 부분은 다시 한 번 복사해야한다고 말하고 실제 제거 예를 제공합니다.
zh_cn: 这部分的文件再次说了一遍,你必须要做一个副本,并给出了一个实际的删除例子。

source: This time efficient, but less space efficient because it keeps a copy of the array around during iteration.
es: Esta es eficiente en el tiempo,pero menos eficiente en el espacio porque mantiene una copia de la matriz alrededor durante la iteración.
ja: これは時間的には効率的ですが、繰り返しの間に配列のコピーを保持するため、スペース的にはあまり効率的ではありません。
ko: 이 시간은 효율적이지만 반복하는 동안 어레이의 사본을 유지하기 때문에 공간이 덜 효율적입니다.
zh_cn: 这样的时间效率很高,但空间效率较低,因为在迭代过程中,它把数组的副本保留在周围。

source: This way the index is aligned and doesn't suffer from the list updates (regardless whether you pop cur element or not).
es: De esta manera el índice está alineado y no sufre las actualizaciones de la lista (independientemente de si se hace estallar el elemento o no).
ja: こうすることでインデックスが整列し、リストの更新に悩まされることがなくなります(cur要素をポップするかどうかに関係なく)。
ko: 이렇게하면 인덱스가 정렬되고 목록 요소가 발생하지 않더라도 목록 업데이트가 발생하지 않습니다.
zh_cn: 这样索引是对齐的,不会受到列表更新的影响(不管你是否弹出CUR元素)。

source: This will output the following:
es: Esto producirá lo siguiente:
ja: これで以下のように出力されます。
ko: 이것은 다음을 출력합니다 :
zh_cn: 这将输出以下内容:

source: This will produce the following output:
es: Esto producirá el siguiente resultado:
ja: これにより、以下のような出力が得られます。
ko: 결과는 다음과 같습니다.
zh_cn: 这将产生以下输出:

source: Unfortunately, I cannot adequately describe how reversed() works. It returns a 'listreverseiterator' object when a list is passed to it. For practical purposes, you can think of it as creating a reversed copy of its argument. This is the solution I recommend.
es: Desafortunadamente,no puedo describir adecuadamente cómo funciona lo invertido.Devuelve un objeto 'listreverseiterator' cuando se le pasa una lista.A efectos prácticos,se puede pensar que crea una copia invertida de su argumento.Esta es la solución que recomiendo.
ja: 残念ながら、私は reversed()がどのように動作するかを十分に説明することができません。これはリストが渡されると 'listreverseiterator' オブジェクトを返します。実用的な目的では、引数の逆コピーを作成すると考えることができます。これが私のお勧めする解決策です。
ko: 불행히도 reversed () 작동 방식을 적절하게 설명 할 수 없습니다. 리스트가 전달 될 때 'listreverseiterator'오브젝트를 리턴합니다. 실용적인 목적으로, 당신은 그것의 주장의 역전 된 사본을 만드는 것으로 생각할 수 있습니다. 이것이 내가 권장하는 솔루션입니다.
zh_cn: 不幸的是,我无法充分描述 reversed()的工作原理。当一个列表被传递给它时,它返回一个 "listreverseiterator "对象。在实际应用中,你可以把它看成是创建一个反转参数的副本。这就是我推荐的解决方案。

source: We can make a true copy using copy.copy(). Then everything works as expected:
es: Podemos hacer una copia real usando copy.copy().Entonces todo funciona como se espera:
ja: copy.copy()を使用して真のコピーを作成することができます。そうすれば、すべてが期待通りに動作します。
ko: copy.copy ()를 사용하여 실제 복사본을 만들 수 있습니다. 그런 다음 모든 것이 예상대로 작동합니다.
zh_cn: 我们可以使用copy.copy()进行真正的复制。然后,一切都能正常工作。

source: What I don't know is how efficient a couple of deletes are compared to copying a large list. Please comment if you have any insight.
es: Lo que no sé es lo eficiente que es un par de borrados comparado con copiar una lista grande.Por favor,comente si tiene alguna idea.
ja: 私が知らないのは、大きなリストをコピーするのに比べて、数回の削除がどれだけ効率的なのかということです。何か見識のある方はコメントをお願いします。
ko: 내가 모르는 것은 큰 목록을 복사하는 것보다 몇 번의 삭제가 얼마나 효율적인지입니다. 통찰력이 있으면 의견을 말하십시오.
zh_cn: 我不知道的是,与复制一个大的列表相比,几次删除的效率如何?如果你有什么见解,请评论一下。

source: What should I use in place of <code>code_to_remove_tup</code>? I can't figure out how to remove the item in this fashion.
es: &iquest;Qu&eacute; debo usar en lugar de <code>code_to_remove_tup</code> ? No puedo entender c&oacute;mo quitar el art&iacute;culo de esta manera.
ja: <code>code_to_remove_tup</code> の代わりに何を使用すればよいですか？ この方法でアイテムを削除する方法がわかりません。
ko: <code>code_to_remove_tup</code> 대신 무엇을 사용해야합니까? 이 방식으로 항목을 제거하는 방법을 알 수 없습니다.
zh_cn: 我应该使用什么来代替 <code>code_to_remove_tup</code> ？ 我不知道如何以这种方式删除项目。

source: Why is (1,-2) still in your list? It turns out modifying the list while using a loop to iterate over it is a very bad idea without special care. The reason that (1, -2) remains in the list is that the locations of each item within the list changed between iterations of the for loop. Let's look at what happens if we feed the above code a longer list:
es: ¿Por qué está (1,-2)todavía en tu lista? Resulta que modificar la lista mientras se usa un bucle para iterar sobre ella es una muy mala idea sin un cuidado especial.La razón por la que (1,-2)permanece en la lista es que las ubicaciones de cada elemento dentro de la lista cambiaron entre las iteraciones del bucle for.Veamos lo que sucede si alimentamos el código anterior con una lista más larga:
ja: なぜ(1,-2)がリストに残っているのでしょうか?ループを使ってリストを反復している間にリストを修正するのは、特別な注意を払わなければ非常に悪い考えであることがわかりました。(1,-2)がリストに残っている理由は、リスト内の各項目の位置が for ループの反復の間に変化したからです。上のコードにもっと長いリストを与えた場合にどうなるか見てみましょう。
ko: 왜 (1, -2)가 여전히 목록에 있습니까? 루프를 사용하여 목록을 반복하는 동안 목록을 수정하는 것은 특별한주의없이 매우 나쁜 생각입니다. (1, -2)가 목록에 남아있는 이유는 목록 내의 각 항목의 위치가 for 루프의 반복 사이에서 변경 되었기 때문입니다. 위의 코드에 더 긴 목록을 제공하면 어떻게되는지 봅시다 :
zh_cn: 为什么(1,-2)还在你的列表中?事实证明,在使用循环迭代的同时修改列表是一个非常糟糕的想法,如果没有特别注意的话。之所以(1,-2)还在列表中,是因为在for循环的迭代之间,列表中每个项的位置都发生了变化。让我们来看看如果我们给上面的代码喂入一个较长的列表会发生什么情况。

source: You can try for-looping in reverse so for some_list you'll do something like:
es: Puedes intentar hacer un bucle al revés,así que para alguna lista harás algo como:
ja: for-loopingを逆に試してみて、some_listの場合は次のようにします。
ko: for_looping을 반대로 시도하면 some_list에 대해 다음과 같은 작업을 수행 할 수 있습니다.
zh_cn: 你可以尝试反向的for-loop,所以对于some_list,你可以做这样的事情。

source: You can use a list comprehension to create a new list containing only the elements you don't want to remove:
es: Puede utilizar la comprensión de la lista para crear una nueva lista que contenga sólo los elementos que no desea eliminar:
ja: リスト内包を使って、削除したくない要素だけを含むリストを新たに作成することができます。
ko: 목록 이해를 사용하여 제거하지 않으려는 요소 만 포함하는 새 목록을 만들 수 있습니다.
zh_cn: 你可以使用列表理解来创建一个新的列表,只包含你不想删除的元素。
