Repository: rueisnom/feedback
Catalog: xlf/12/07/40/6/1207406.*.001.xlf
Languages: es, ja, ko, zh_cn

source: You might want to use <code>filter()</code> available as the built-in.
es: Es posible que desee utilizar <code>filter()</code> disponible como integrado.
ja: 組み込みとして利用可能な <code>filter()</code> を使用したい場合があります。
ko: 내장으로 사용 가능한 <code>filter()</code> 사용할 수 있습니다.
zh_cn: 您可能要使用内置的 <code>filter()</code> 。

source: You need to go backwards otherwise it's a bit like sawing off the tree-branch that you are sitting on :-)
es: Tienes que ir hacia atrás,de lo contrario es un poco como serrar la rama del árbol en el que estás sentado :-)
ja: そうしないと、あなたが座っている木の枝を切り落とすのと同じような感じになってしまうので、後ろに行く必要があります。)
ko: 그렇지 않으면 거꾸로 가야합니다. 그렇지 않으면 앉아있는 나뭇 가지를 톱질하는 것과 같습니다.
zh_cn: 你需要倒着走,否则就有点像锯掉你坐着的树枝一样:-)

source: You need to take a copy of the list and iterate over it first, or the iteration will fail with what may be unexpected results.
es: Debes tomar una copia de la lista e iterar sobre ella primero,o la iteración fallará con lo que pueden ser resultados inesperados.
ja: 最初にリストのコピーを取って、それを反復する必要があります。
ko: 목록의 복사본을 가져 와서 먼저 반복해야합니다. 그렇지 않으면 예기치 않은 결과가 발생할 수 있으므로 반복이 실패합니다.
zh_cn: 你需要先拿一个列表的副本,然后对其进行迭代,否则迭代失败,可能会出现意想不到的结果。

source: Your best approach for such an example would be a <a href="http://docs.python.org/tutorial/datastructures.html#list-comprehensions">list comprehension</a>
es: Su mejor enfoque para tal ejemplo ser&iacute;a una <a href="http://docs.python.org/tutorial/datastructures.html#list-comprehensions">comprensi&oacute;n de la lista</a>
ja: そのような例に対するあなたの最善のアプローチは、 <a href="http://docs.python.org/tutorial/datastructures.html#list-comprehensions">リストの理解です</a>
ko: 이러한 예에 대한 가장 좋은 방법은 <a href="http://docs.python.org/tutorial/datastructures.html#list-comprehensions">목록 이해입니다.</a>
zh_cn: 此类示例的最佳方法是<a href="http://docs.python.org/tutorial/datastructures.html#list-comprehensions">列表理解</a>

source: and then <strong>next value (65)</strong> move on to previous index.
es: y luego el <strong>siguiente valor (65)</strong> pasa al &iacute;ndice anterior.
ja: 次に、 <strong>次の値（65）</strong>が前のインデックスに移動します。
ko: <strong>다음 값 (65)</strong> 은 이전 색인으로 이동합니다.
zh_cn: 然后<strong>下一个值（65）</strong>移至上一个索引。

source: and to avoid having to re-code the entire project with the new lists name:
es: y para evitar tener que recodificar todo el proyecto con el nuevo nombre de la lista:
ja: と、プロジェクト全体を新しいリスト名で再コード化する必要がないようにするためのものです。
ko: 새 목록 이름으로 전체 프로젝트를 다시 코딩하지 않아도됩니다.
zh_cn: 并避免用新的列表名称重新编码整个项目。

source: both of which make it crystal clear that you cannot modify a list being iterated except with the iterator itself, and gives you efficient ways to do so without copying the list.
es: ambas cosas dejan muy claro que no se puede modificar una lista que se está iterando excepto con el propio iterador,y le da maneras eficientes de hacerlo sin copiar la lista.
ja: これらは、イテレータ自身以外ではイテレータされているリストを変更することができないことを明確にし、リストをコピーすることなく効率的な方法を提供します。
ko: 두 가지 모두 반복자 자체를 제외하고 반복되는 목록을 수정할 수 없다는 것을 분명히하고 목록을 복사하지 않고 효율적인 방법을 제공합니다.
zh_cn: 两者都清楚地表明,除了使用迭代器本身之外,你不能修改被迭代的列表,并给出了不复制列表的有效方法。

source: consider you have a list,
es: considera que tienes una lista,
ja: リストを持っていると考えてください。
ko: 목록이 있다고 생각해
zh_cn: 认为你有一个名单。

source: copy.copy(x) Return a shallow copy of x.
es: copia.copia(x)Devuelve una copia superficial de x.
ja: copy.copy(x)x の浅いコピーを返します。
ko: copy.copy (x) x의 얕은 복사본을 반환합니다.
zh_cn: copy.copy(x)返回一个x的浅层副本。

source: copy.deepcopy(x) Return a deep copy of x.
es: copy.deepcopy(x)Devuelve una copia profunda de x.
ja: copy.deepcopy(x)x のディープコピーを返します。
ko: copy.deepcopy (x) x의 깊은 사본을 반환합니다.
zh_cn: copy.deepcopy(x)返回一个x的深度副本。

source: during 5th iteration,
es: durante la quinta iteración,
ja: 5回目のイテレーションでは
ko: 5 번 반복하는 동안
zh_cn: 在第五次迭代期间。

source: for loop will be iterate through index..
es: para el bucle será iterado a través del índice..
ja: forループはインデックスを反復処理します。
ko: for 루프는 인덱스를 반복합니다.
zh_cn: for循环将通过索引进行迭代。

source: note, from Python documentation:
es: nota,de la documentación de Python:
ja: note、Pythonドキュメントより。
ko: 파이썬 문서에서 참고하십시오 :
zh_cn: 注,来自Python文档。

source: now you it will give,
es: ahora te dará,
ja: 今、あなたはそれが与えるでしょう。
ko: 지금 당신은 그것을 줄 것이다
zh_cn: 现在,你会给。

source: one way to do it is with the slice notation <code>[:]</code>
es: Una forma de hacerlo es con la notaci&oacute;n de corte <code>[:]</code>
ja: これを行う1つの方法は、スライス表記 <code>[:]</code> を使用することです。
ko: 한 가지 방법은 슬라이스 표기법을 사용하는 것입니다. <code>[:]</code>
zh_cn: 一种方法是使用切片符号 <code>[:]</code>

source: so 4th iteration done pointer moved onto 5th..
es: así que la cuarta iteración hecha puntero se movió a la quinta...
ja: 4回目の反復は、ポインタが5回目に移動しました...
ko: 그래서 네 번째 반복 완료 포인터가 다섯 번째로 이동했습니다.
zh_cn: 所以第4次迭代完成后,指针移至第5次.....

source: so do copy of list using <code>list[::]</code>
es: entonces haga una copia de la lista usando la <code>list[::]</code>
ja: <code>list[::]</code> を使用してリストのコピーを行う
ko: <code>list[::]</code> 사용하여 리스트를 복사하십시오 .
zh_cn: 所以使用 <code>list[::]</code> 复制列表

source: so you can try comprehension instead.
es: así que puedes intentar la comprensión en su lugar.
ja: あなたは理解力を試すことができます。
ko: 대신 이해력을 시험해 볼 수 있습니다.
zh_cn: 所以你可以试着理解一下

source: so you shouldn't reference list into another variable which still reference original instead of copy.
es: así que no deberías referirte a la lista en otra variable que aún haga referencia al original en vez de a la copia.
ja: のように、リストを別の変数に参照してはいけないので、コピーではなくオリジナルを参照するような変数にリストを参照するべきではありません。
ko: 따라서 복사 대신 원본을 여전히 참조하는 다른 변수로 목록을 참조해서는 안됩니다.
zh_cn: 所以,你不应该把列表引用到另一个变量中,而不是复制,而是引用原件。

source: start a new array from scratch, and <code>.append()</code> back at the end: <a href="https://stackoverflow.com/a/1207460/895245">https://stackoverflow.com/a/1207460/895245</a>
es: inicie una nueva matriz desde cero y <code>.append()</code> al final: <a href="https://stackoverflow.com/a/1207460/895245">https://stackoverflow.com/a/1207460/895245</a>
ja: 新しい配列を最初から開始し、最後に <code>.append()</code> を戻し<a href="https://stackoverflow.com/a/1207460/895245">ます</a> ： https : //stackoverflow.com/a/1207460/895245
ko: 처음부터 새 배열을 시작하고 <code>.append()</code> 다시 시작하십시오. <a href="https://stackoverflow.com/a/1207460/895245">https://stackoverflow.com/a/1207460/895245</a>
zh_cn: 从头开始创建新数组，然后在末尾返回 <code>.append()</code> ： <a href="https://stackoverflow.com/a/1207460/895245">https</a> : //stackoverflow.com/a/1207460/895245

source: thats why your loop doesnt cover 65 since its moved into previous index.
es: por eso tu bucle no cubre 65 desde que se movió al índice anterior.
ja: それはあなたのループが65をカバーしていない理由は、その前のインデックスに移動してからです。
ko: 그렇기 때문에 루프가 이전 인덱스로 이동 한 이후 루프가 65를 커버하지 않는 이유는 무엇입니까?
zh_cn: 这就是为什么你的循环不包括65,因为它被移到了之前的指数。

source: uppose a list of number and you want to remove all no which are divisible by 3,
es: ...y quieres eliminar todos los no que son divisibles por 3,
ja: 数のリストをアップロードして、3で割り切れるものをすべて削除したい場合。
ko: 숫자 목록을 세우고 3으로 나눌 수있는 모든 no를 제거하려고합니다.
zh_cn: uppose a list of number and you want to remove all no which are dividedable by 3,

source: use <code>del</code> with an index: <a href="https://stackoverflow.com/a/1207485/895245">https://stackoverflow.com/a/1207485/895245</a>
es: use <code>del</code> con un &iacute;ndice: <a href="https://stackoverflow.com/a/1207485/895245">https://stackoverflow.com/a/1207485/895245</a>
ja: インデックスで <code>del</code> を使用： <a href="https://stackoverflow.com/a/1207485/895245">https</a> : //stackoverflow.com/a/1207485/895245
ko: 색인과 함께 <code>del</code> 을 사용 <a href="https://stackoverflow.com/a/1207485/895245">하십시오</a> : https : //.com/a/1207485/895245
zh_cn: 使用带有索引的 <code>del</code> ： <a href="https://stackoverflow.com/a/1207485/895245">https</a> : //stackoverflow.com/a/1207485/895245

source: using <code>lambda filter</code> function, this will create resultant new list and consume memeory space
es: usando la funci&oacute;n de <code>lambda filter</code> , esto crear&aacute; una nueva lista resultante y consumir&aacute; espacio de memoria
ja: <code>lambda filter</code> 関数を使用すると、結果の新しいリストが作成され、メモリ領域が消費されます
ko: <code>lambda filter</code> 기능을 사용하면 결과적으로 새로운 목록이 생성되고 memeory 공간이 소비됩니다.
zh_cn: 使用 <code>lambda filter</code> 功能，这将创建结果新列表并消耗内存空间

source: using <code>list comprehension</code>,this will careate a new list and create new memory space
es: usando la <code>list comprehension</code> , esto crear&aacute; una nueva lista y crear&aacute; un nuevo espacio de memoria
ja: <code>list comprehension</code> を使用して、これは新しいリストを気遣い、新しいメモリ空間を作成します
ko: <code>list comprehension</code> 사용하면 새 목록을 관리하고 새 메모리 공간을 만듭니다.
zh_cn: 使用 <code>list comprehension</code> ，这将创建一个新列表并创建新的内存空间

source: which supports all the iterable like, list, tuple, dict, string etc
es: que soporta todo lo iterable como,lista,tupla,dict,cuerda,etc.
ja: リスト、タプル、dict、文字列など、すべての反復可能なものをサポートしています。
ko: 목록, 튜플, dict, 문자열 등과 같은 모든 반복 가능을 지원합니다.
zh_cn: 支持所有的迭代,如 list,tuple,dict,string 等。

source: without consuming memory space for new list and modify existing list
es: sin consumir espacio de memoria para la nueva lista y modificar la lista existente
ja: 新しいリストのためにメモリを消費することなく、既存のリストを変更することなく
ko: 새 목록을위한 메모리 공간을 소비하지 않고 기존 목록을 수정
zh_cn: 在不消耗内存空间的情况下新建列表和修改现有的列表

source: you have using list variable called <code>lis</code>. and you using same to remove..
es: tiene una variable de lista llamada <code>lis</code> . y usas lo mismo para eliminar ..
ja: <code>lis</code> というリスト変数を使用しています。 同じものを使って削除します
ko: <code>lis</code> 라는 목록 변수를 사용하고 있습니다. 같은 것을 사용하여 제거합니다 ..
zh_cn: 您使用了名为 <code>lis</code> 的列表变量。 并且您使用它删除。

source: you need to make a copy of the iterated list to modify it
es: necesitas hacer una copia de la lista iterada para modificarla
ja: を変更するには、反復リストのコピーを作成する必要があります。
ko: 반복 목록을 복사하여 수정해야합니다.
zh_cn: 你需要复制一个迭代列表来修改它。

source: your <strong>number 35</strong> was not a prime so you removed it from a list.
es: su <strong>n&uacute;mero 35</strong> no era primo, por lo que lo elimin&oacute; de una lista.
ja: <strong>35</strong>は素数ではなかったので、リストから削除しました。
ko: <strong>35</strong> 번은 소수가 아니므로 목록에서 제거했습니다.
zh_cn: 您的<strong>数字35</strong>不是素数，因此您将其从列表中删除。

source: your variable
es: tu variable
ja: おたくのへんすう
ko: 당신의 변수
zh_cn: 你的变量
