Repository: rueisnom/feedback
Catalog: xlf/12/07/40/6/1207406.*.001.xlf
Languages: es, ja, ko, zh_cn

source: Generally you just want to go for the faster <code>.append()</code> option by default unless memory is a big concern.
es: En general, solo desea <code>.append()</code> opci&oacute;n .append () m&aacute;s r&aacute;pida de forma predeterminada a menos que la memoria sea una gran preocupaci&oacute;n.
ja: 一般的には、メモリが大きな問題でない限り、デフォルトでより高速な <code>.append()</code> オプションを使用したいだけです。
ko: 일반적으로 메모리가 큰 문제가 아닌 한 기본적으로 더 빠른 <code>.append()</code> 옵션을 원합니다 .
zh_cn: 通常，除非内存是一个大问题，否则默认情况下，您只想默认使用更快的 <code>.append()</code> 选项。

source: Here is an example where copying the list beforehand is incorrect, reverse iteration is impossible and a list comprehension is also not an option.
es: He aquí un ejemplo en el que copiar la lista de antemano es incorrecto,la iteración inversa es imposible y la comprensión de la lista tampoco es una opción.
ja: ここでは、あらかじめリストをコピーしておくと正しくなく、逆反復ができず、リスト理解もできない例を紹介します。
ko: 다음은 미리 목록을 복사하는 것이 올바르지 않고 역 반복이 불가능하며 목록 이해도 옵션이 아닌 예입니다.
zh_cn: 这里有一个例子,事先复制列表是不正确的,逆向迭代是不可能的,列表理解也是不可能的。

source: How to remove items from a list while iterating
es: Cómo eliminar elementos de una lista mientras se itera
ja: イテレーション中にリストから項目を削除する方法
ko: 반복하는 동안 목록에서 항목을 제거하는 방법
zh_cn: 如何在迭代时从列表中删除项目?

source: However, I disagree with this implementation, since <code>.remove()</code> has to iterate the <em>entire list</em> to find the value.
es: Sin embargo, no estoy de acuerdo con esta implementaci&oacute;n, ya que <code>.remove()</code> tiene que iterar <em>toda la lista</em> para encontrar el valor.
ja: ただし、 <code>.remove()</code> は<em>リスト全体</em>を反復して値を見つける必要があるため、この実装には同意しません。
ko: 그러나 <code>.remove()</code> 는 값을 찾기 위해 <em>전체 목록</em> 을 반복해야하기 때문에이 구현에 동의하지 않습니다.
zh_cn: 但是，我不同意此实现，因为 <code>.remove()</code> 必须迭代<em>整个列表</em>以查找值。

source: However, the output will be identical to before:
es: Sin embargo,la salida será idéntica a la de antes:
ja: ただし、出力は以前と同じになります。
ko: 그러나 출력은 이전과 동일합니다.
zh_cn: 但是,输出会和以前一样。

source: I can think of three approaches to solve your problem. As an example, I will create a random list of tuples <code>somelist = [(1,2,3), (4,5,6), (3,6,6), (7,8,9), (15,0,0), (10,11,12)]</code>. The condition that I choose is <code>sum of elements of a tuple = 15</code>. In the final list we will only have those tuples whose sum is not equal to 15.
es: Se me ocurren tres enfoques para resolver su problema. Como ejemplo, crear&eacute; una lista aleatoria de tuplas <code>somelist = [(1,2,3), (4,5,6), (3,6,6), (7,8,9), (15,0,0), (10,11,12)]</code> . La condici&oacute;n que elijo es la <code>sum of elements of a tuple = 15</code> . En la lista final solo tendremos esas tuplas cuya suma no es igual a 15.
ja: あなたの問題を解決するための3つのアプローチを考えることができます。 例として、タプルのランダムリスト <code>somelist = [(1,2,3), (4,5,6), (3,6,6), (7,8,9), (15,0,0), (10,11,12)]</code> 。 私が選択する条件 <code>sum of elements of a tuple = 15</code> です。 最後のリストには、合計が15に等しくないタプルのみが含まれます。
ko: 문제를 해결하기위한 세 가지 접근 방식을 생각할 수 있습니다. 예를 들어, 임의리스트 튜플 <code>somelist = [(1,2,3), (4,5,6), (3,6,6), (7,8,9), (15,0,0), (10,11,12)]</code> . 내가 선택한 조건 <code>sum of elements of a tuple = 15</code> 입니다. 최종 목록에는 합계가 15가 아닌 튜플 만 있습니다.
zh_cn: 我可以想到三种解决问题的方法。 例如，我将创建一个元组的随机列表 <code>somelist = [(1,2,3), (4,5,6), (3,6,6), (7,8,9), (15,0,0), (10,11,12)]</code> 。 我选择的条件是 <code>sum of elements of a tuple = 15</code> 。 在最终列表中，我们将只有那些总和不等于15的元组。

source: I needed to do something similar and in my case the problem was memory - I needed to merge multiple dataset objects within a list, after doing some stuff with them, as a new object, and needed to get rid of each entry I was merging to avoid duplicating all of them and blowing up memory. In my case having the objects in a dictionary instead of a list worked fine:
es: Necesitaba hacer algo similar y en mi caso el problema era la memoria-necesitaba fusionar múltiples objetos de conjuntos de datos dentro de una lista,después de hacer algunas cosas con ellos,como un nuevo objeto,y necesitaba deshacerme de cada entrada que estaba fusionando para evitar duplicarlas todas y hacer explotar la memoria.En mi caso,tener los objetos en un diccionario en lugar de una lista funcionaba bien:
ja: 同じようなことをする必要があり、私の場合はメモリの問題でした。複数のデータセットオブジェクトをリスト内にマージする必要がありました。私の場合は、オブジェクトをリストではなく辞書に入れておけば問題ありませんでした。
ko: 비슷한 일을해야했고 내 경우에는 문제가 메모리였습니다. 목록에 여러 데이터 세트 객체를 병합 한 다음 새 객체로 사용하고 병합하려는 각 항목을 제거해야했습니다. 그들 모두를 복제하고 메모리를 폭파시키지 마십시오. 필자의 경우 목록 대신 사전에 객체를 갖는 것이 잘 작동했습니다.
zh_cn: 我需要做一些类似的事情,在我的情况下,问题是内存问题--我需要在一个列表中合并多个数据集对象,在对它们做了一些事情后,作为一个新的对象,并需要删除我正在合并的每个条目,以避免重复使用所有的条目,并占用内存。在我的情况下,将对象放在字典中而不是列表中,效果很好。

source: I needed to do this with a huge list, and duplicating the list seemed expensive, especially since in my case the number of deletions would be few compared to the items that remain. I took this low-level approach.
es: Necesitaba hacerlo con una lista enorme,y duplicar la lista parecía caro,sobre todo porque en mi caso el número de eliminaciones sería escaso en comparación con los elementos que quedan.Tomé este enfoque de bajo nivel.
ja: これを巨大なリストで行う必要があり、リストを複製するのはコストがかかりそうでした。私はこのような低レベルのアプローチをとりました。
ko: 거대한 목록 으로이 작업을 수행해야했으며 목록을 복제하면 비용이 많이 들었습니다. 특히 필자의 경우 삭제 항목 수가 남아있는 항목에 비해 적기 때문입니다. 나는이 저수준 접근법을 취했다.
zh_cn: 我需要用一个庞大的列表来做这件事,而复制这个列表似乎很昂贵,尤其是在我的情况下,删除的数量会比留下的项目少。我采用了这种低级的方法。

source: I wrote a library that allows you to do this:
es: Escribí una biblioteca que te permite hacer esto:
ja: こんなことができるライブラリを書いてみました。
ko: 나는 당신이 이것을 할 수있는 도서관을 썼습니다 :
zh_cn: 我写了一个图书馆,可以让你做这个。

source: I'm iterating over a list of tuples in Python, and am attempting to remove them if they meet certain criteria.
es: Estoy iterando sobre una lista de tuplas en Python,y estoy intentando eliminarlas si cumplen ciertos criterios.
ja: 私はPythonでタプルのリストを反復処理していて、それらが特定の条件を満たしている場合にそれらを削除しようとしています。
ko: 파이썬에서 튜플 목록을 반복하고 특정 기준을 충족하면 제거하려고합니다.
zh_cn: 我正在用Python迭代一个图元组列表,如果它们满足一定的条件,我试图将其删除。

source: If we want to access the current index value of the list we cannot use enumerate, as this only counts how many times the for loop has run. Instead we will use the iterator object directly.
es: Si queremos acceder al valor actual del índice de la lista no podemos utilizar enumerar,ya que esto sólo cuenta cuántas veces se ha ejecutado el bucle for.En su lugar utilizaremos directamente el objeto iterador.
ja: リストの現在のインデックス値にアクセスしたい場合は、forループが何回実行されたかをカウントするだけなので、enumerateを使用することはできません。代わりに、イテレータオブジェクトを直接使用します。
ko: 목록의 현재 인덱스 값에 액세스하려면 열거를 사용할 수 없습니다. 이는 for 루프가 몇 번이나 실행되었는지를 계산하기 때문입니다. 대신 반복자 객체를 직접 사용합니다.
zh_cn: 如果我们想访问列表的当前索引值,我们不能使用枚举,因为这只能计算for循环运行了多少次。相反,我们将直接使用迭代器对象。

source: If you need to modify the sequence you are iterating over while inside the loop (for example to duplicate selected items), it is recommended that you first make a copy. Iterating over a sequence does not implicitly make a copy. The slice notation makes this especially convenient:
es: Si necesita modificar la secuencia sobre la que está iterando mientras está dentro del bucle (por ejemplo,para duplicar elementos seleccionados),se recomienda hacer primero una copia.Iterar sobre una secuencia no implica hacer una copia.La notación de rebanada hace que esto sea especialmente conveniente:
ja: ループ内で反復処理しているシーケンスを変更する必要がある場合(例えば、選択された項目を複製するなど)、最初にコピーを作成することをお勧めします。シーケンスを繰り返し処理しても、暗黙のうちにコピーが作成されるわけではありません。スライス記法はこれを特に便利にしています。
ko: 루프 내에서 반복하는 시퀀스를 수정해야하는 경우 (예 : 선택한 항목 복제) 먼저 복사하는 것이 좋습니다. 시퀀스를 반복해도 암시 적으로 복사되지 않습니다. 슬라이스 표기법은 이것을 특히 편리하게 만듭니다.
zh_cn: 如果你在循环中需要修改你正在迭代的序列(例如,复制所选项目),建议你先进行复制。迭代一个序列并不隐含复制。片段符号使这一点特别方便。

source: If you want to delete elements from a list while iterating, use a while-loop so you can alter the current index and end index after each deletion.
es: Si desea eliminar elementos de una lista mientras itera,utilice un bucle while para poder alterar el índice actual y el índice final después de cada eliminación.
ja: 反復処理中にリストから要素を削除したい場合は、削除のたびに現在のインデックスと終了インデックスを変更できるようにwhileループを使用します。
ko: 반복하는 동안 목록에서 요소를 삭제하려면 while 루프를 사용하여 각 삭제 후 현재 색인 및 종료 색인을 변경할 수 있습니다.
zh_cn: 如果你想在迭代时从列表中删除元素,可以使用while-loop,这样每次删除后可以改变当前索引和结束索引。

source: If you want to do anything else during the iteration, it may be nice to get both the index (which guarantees you being able to reference it, for example if you have a list of dicts) and the actual list item contents.
es: Si desea hacer algo más durante la iteración,puede ser bueno obtener tanto el índice (que le garantiza poder referirse a él,por ejemplo si tiene una lista de dictados)como el contenido real de los elementos de la lista.
ja: 反復の間に何か他のことをしたい場合は、インデックス(例えばディクトのリストを持っている場合などに参照できることを保証してくれます)と実際のリスト項目の内容の両方を取得しておくといいかもしれません。
ko: 반복 중에 다른 작업을 수행하려는 경우 인덱스 (예 : dict 목록이있는 경우 색인을 참조 할 수 있음)와 실제 목록 항목 컨텐츠를 모두 얻는 것이 좋습니다.
zh_cn: 如果你想在迭代过程中做其他事情,可能既能得到索引(保证你能够引用它,比如说如果你有一个dicts列表),又能得到实际的列表项内容,这可能会很好。

source: If you will use the new list later, you can simply set the elem to None, and then judge it in the later loop, like this
es: Si vas a usar la nueva lista más tarde,puedes simplemente poner el elemento en Ninguno,y luego juzgarlo en el bucle posterior,así
ja: 後で新しいリストを使用する場合は、単に elem を None に設定して、後のループで次のように判定することができます。
ko: 나중에 새 목록을 사용할 경우 elem을 없음으로 설정 한 후 다음과 같이 나중에 루프에서 판단 할 수 있습니다.
zh_cn: 如果你以后要使用新的列表,你可以简单地将elem设置为None,然后在后面的循环中判断它,就像这样

source: In cases where you're doing something more complex than calling a <code>determine</code> function, I prefer constructing a new list and simply appending to it as I go. For example
es: En los casos en que est&aacute; haciendo algo m&aacute;s complejo que llamar a una funci&oacute;n de <code>determine</code> , prefiero construir una nueva lista y simplemente agregarla a medida que avanzo. Por ejemplo
ja: <code>determine</code> 関数を呼び出すよりも複雑なことをしている場合は、新しいリストを作成して、それに合わせて追加するだけです。 例えば
ko: <code>determine</code> 함수를 호출하는 것보다 복잡한 작업을 수행하는 경우 새 목록을 작성하고 단순히 추가 할 때 추가하는 것이 좋습니다. 예를 들어
zh_cn: 如果您要做的事情比调用 <code>determine</code> 函数还要复杂，我更喜欢构造一个新列表，然后随便添加它。 例如

source: In some situations, where you're doing more than simply filtering a list one item at time, you want your iteration to change while iterating.
es: En algunas situaciones,en las que se hace algo más que filtrar un elemento de la lista de una en una,se quiere que la iteración cambie mientras se itera.
ja: 単にリストを一項目ずつフィルタリングするだけではなく、それ以上のことをしている状況では、反復処理中に反復処理を変更したい場合もあるでしょう。
ko: 한 번에 한 항목 씩 목록을 필터링하는 것 이상의 작업을 수행하는 경우에는 반복하는 동안 반복이 변경되기를 원합니다.
zh_cn: 在某些情况下,如果你要做的不仅仅是简单地逐一筛选一个列表,你希望你的迭代在迭代的同时改变。

source: In this way, you dont't need copy the list and it's easier to understand.
es: De esta manera,no necesitas copiar la lista y es más fácil de entender.
ja: このように、リストをコピーする必要がなく、わかりやすくなります。
ko: 이런 식으로 목록을 복사 할 필요가 없으며 이해하기 쉽습니다.
zh_cn: 这样一来,你不需要复制列表,也更容易理解。

source: Instead of a comprehension, you could also use <code>itertools</code>. In Python 2:
es: En lugar de una comprensi&oacute;n, tambi&eacute;n puede usar <code>itertools</code> . En Python 2:
ja: 理解の代わりに、 <code>itertools</code> を使用することもできます 。 Python 2の場合：
ko: 이해하는 대신 <code>itertools</code> 를 사용할 수도 있습니다. 파이썬 2에서 :
zh_cn: 除了理解之外，您还可以使用 <code>itertools</code> 。 在Python 2中：

source: It might be smart to also just create a new list if the current list item meets the desired criteria.
es: Sería inteligente también crear una nueva lista si el elemento de la lista actual cumple con los criterios deseados.
ja: 現在のリスト項目が希望の条件を満たしている場合は、新しいリストを作成するだけでもスマートかもしれません。
ko: 현재 목록 항목이 원하는 기준을 충족하는 경우 새 목록을 작성하는 것이 좋습니다.
zh_cn: 如果当前列表项目符合所需的标准,也可以直接创建一个新的列表。

source: It seems like this particular Python API could be improved. Compare it, for instance, with:
es: Parece que este API de Python en particular podría ser mejorado.Compáralo,por ejemplo,con:
ja: この特定のPython APIは改良されているように思えます。例えば、比較してみてください。
ko: 이 특정 Python API가 개선 될 수있는 것 같습니다. 예를 들어 다음과 비교하십시오.
zh_cn: 看起来这个特殊的Python API似乎还可以改进。例如,将其与。

source: It's best to use another method if possible that doesn't require modifying your iterable while iterating over it, but for some algorithms it might not be that straight forward. And so if you are sure that you really do want the code pattern described in the original question, it is possible.
es: Es mejor usar otro método si es posible que no requiera modificar su iterable mientras itera sobre él,pero para algunos algoritmos puede no ser tan sencillo.Así que si estás seguro de que realmente quieres el patrón de código descrito en la pregunta original,es posible.
ja: 可能であれば、反復処理中にイテレータブルを修正する必要のない別の方法を使うのがベストですが、アルゴリズムによってはそう簡単ではないかもしれません。そして、もしあなたが本当に元の質問で説明したコードパターンが欲しいと確信しているのであれば、それは可能です。
ko: 가능하면 반복 가능한 동안 iterable을 수정하지 않아도되는 다른 방법을 사용하는 것이 가장 좋지만 일부 알고리즘의 경우에는 그다지 간단하지 않을 수 있습니다. 따라서 원래 질문에 설명 된 코드 패턴을 정말로 원한다면 가능할 수 있습니다.
zh_cn: 如果可能的话,最好使用其他的方法,在迭代的同时不需要修改你的迭代,但对于某些算法来说,可能不是那么直接。所以,如果你确定你真的要的是原问题中描述的代码模式,那是可以的。

source: Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ListIterator.html">ListIterator::remove</a> which documents "This call can only be made once per call to next or previous"
es: Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ListIterator.html">ListIterator :: eliminar</a> qu&eacute; documentos "Esta llamada solo se puede hacer una vez por llamada a la siguiente o anterior"
ja: Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ListIterator.html">ListIterator :: remove</a> 「この呼び出しは、次または前の呼び出しごとに1回だけ実行できます」
ko: Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ListIterator.html">ListIterator :: 다음</a> 중 어느 문서를 제거하십시오.
zh_cn: Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ListIterator.html">ListIterator :: remove</a>哪些文档&ldquo;此调用只能对下一个或上一个调用进行一次&rdquo;

source: Let's run through what happens when we execute your code:
es: Repasemos lo que sucede cuando ejecutamos tu código:
ja: コードを実行すると何が起こるのかを説明しましょう。
ko: 코드를 실행할 때 발생하는 작업을 살펴 ​​보겠습니다.
zh_cn: 让我们运行一下当我们执行你的代码时会发生什么。

source: List comprehensions provide a way to generate a new list but these approaches tend to look at each element in isolation rather than the current state of the list as a whole.
es: La comprensión de la lista proporciona una forma de generar una nueva lista,pero estos enfoques tienden a considerar cada elemento de forma aislada en lugar del estado actual de la lista en su conjunto.
ja: リスト内包は新しいリストを生成する方法を提供しますが、これらのアプローチは、リスト全体の現在の状態よりも各要素を分離して見る傾向があります。
ko: 리스트 이해는 새로운리스트를 생성하는 방법을 제공하지만, 이러한 접근법은리스트의 현재 상태가 아닌 개별적으로 각 요소를 보는 경향이 있습니다.
zh_cn: 列表理解提供了一种生成新的列表的方法,但这些方法往往是孤立地看待每一个元素,而不是将列表的当前状态作为一个整体来看待。

source: More examples / tests can be found in the <code>if __name__ is "__main__":</code> section at the bottom of <code>fluidIter.py</code>. These are worth looking at because they explain what happens in various situations. Such as: Replacing a large sections of the list using a slice. Or using (and modifying) the same iterable in nested for loops.
es: Se pueden encontrar m&aacute;s ejemplos / pruebas en la secci&oacute;n <code>if __name__ is "__main__":</code> en la parte inferior de <code>fluidIter.py</code> . Vale la pena mirarlos porque explican lo que sucede en diversas situaciones. Tales como: Reemplazar grandes secciones de la lista usando un segmento. O usando (y modificando) el mismo iterable en bucles anidados.
ja: その他の例/テストは、 <code>fluidIter.py</code> の下部にある <code>if __name__ is "__main__":</code> セクションにあります 。 これらは、さまざまな状況で何が起こるかを説明しているため、一見の価値があります。 例：スライスを使用してリストの大きなセクションを置き換える。 または、ネストされたforループで同じイテラブルを使用（および変更）します。
ko: 더 많은 예제 / 테스트는 <code>if __name__ is "__main__":</code> <code>fluidIter.py</code> 의 맨 아래에있는 섹션에서 찾을 수 있습니다. 이것들은 다양한 상황에서 일어나는 일을 설명하기 때문에 가치가 있습니다. 예 : 슬라이스를 사용하여 목록의 큰 섹션 교체 또는 중첩 된 for 루프에서 동일한 iterable을 사용하고 수정합니다.
zh_cn: <code>if __name__ is "__main__":</code> <code>fluidIter.py</code> 在FluidIter.py底部的更多示例/测试中可以找到。 这些值得一看，因为它们解释了在各种情况下会发生什么。 例如：使用切片替换列表的大部分。 或在嵌套for循环中使用（并修改）相同的可迭代对象。

source: Most of the answers here want you to create a copy of the list. I had a use case where the list was quite long (110K items) and it was smarter to keep reducing the list instead.
es: La mayoría de las respuestas aquí quieren que crees una copia de la lista.Tuve un caso de uso en el que la lista era bastante larga (110K artículos)y fue más inteligente seguir reduciendo la lista en su lugar.
ja: ここでの回答のほとんどは、リストのコピーを作成することを求めています。私はリストが非常に長く(110K項目)、リストを減らし続けた方がスマートだったというユースケースがありました。
ko: 여기에있는 대부분의 답변은 목록의 사본을 작성하기를 원합니다. 나는 목록이 꽤 길었던 유스 케이스 (110K 항목)를 가지고 있었고 대신 목록을 계속 줄이는 것이 더 똑똑했습니다.
zh_cn: 这里的大多数答案都是希望你创建一个列表的副本。我曾有过一个使用案例,在这个案例中,列表相当长(110K项目),而继续减少列表是比较明智的做法。

source: Note the subtle difference with other answers: this one is NOT assigning to a barename - it's assigning to a list slice that just happens to be the entire list, thereby replacing the list <em>contents</em><strong>within the same Python list object</strong>, rather than just reseating one reference (from previous list object to new list object) like the other answers.
es: Tenga en cuenta la sutil diferencia con otras respuestas: esta NO se asigna a un nombre desnudo: se asigna a un segmento de lista que resulta ser la lista completa, reemplazando as&iacute; el <em>contenido de</em> la lista <strong>dentro del mismo objeto de lista de Python</strong> , en lugar de simplemente restablecer una referencia (desde el objeto de lista anterior al nuevo objeto de lista) como las otras respuestas.
ja: 他の答えとの微妙な違いに注意してください：これはベアネームに割り当てられていません-たまたまリスト全体であるリストスライスに割り当てられているため、1つの参照を再配置するのではなく<strong>、同じPythonリストオブジェクト内の</strong>リスト<em>コンテンツ</em>を置き換えます（前のリストオブジェクトから新しいリストオブジェクトへ）他の回答と同様です。
ko: 다른 답변과의 미묘한 차이점에 주목하십시오.이 이름은 베어 이름에 할당되지 않습니다. 목록 전체에 발생하는 목록 조각에 할당되므로 하나의 참조를 다시 가져 <strong>오는</strong> 대신 <strong>동일한 Python 목록 객체 내에서</strong> 목록 <em>내용</em> 을 대체합니다. 다른 답변과 같이 (이전 목록 객체에서 새 목록 객체로).
zh_cn: 请注意与其他答案的细微差别：这不是分配给裸名-而是分配给恰好是整个列表的列表切片，从而替换<strong>同一Python列表对象中</strong>的列表<em>内容</em> ，而不仅仅是重新<strong>放置</strong>一个引用（从先前的列表对象到新的列表对象），就像其他答案一样。

source: Note: There is a subtlety when the sequence is being modified by the loop (this can only occur for mutable sequences, i.e. lists). An internal counter is used to keep track of which item is used next, and this is incremented on each iteration. When this counter has reached the length of the sequence the loop terminates. This means that if the suite deletes the current (or a previous) item from the sequence, the next item will be skipped (since it gets the index of the current item which has already been treated). Likewise, if the suite inserts an item in the sequence before the current item, the current item will be treated again the next time through the loop. This can lead to nasty bugs that can be avoided by making a temporary copy using a slice of the whole sequence, e.g.,
es: Nota:Hay una sutileza cuando la secuencia está siendo modificada por el bucle (esto sólo puede ocurrir en el caso de secuencias mutables,es decir,listas).Se utiliza un contador interno para llevar la cuenta de qué elemento se utiliza a continuación,y éste se incrementa en cada iteración.Cuando este contador ha alcanzado la longitud de la secuencia el bucle termina.Esto significa que si la suite borra el elemento actual (o uno anterior)de la secuencia,el siguiente elemento se salta (ya que obtiene el índice del elemento actual que ya ha sido tratado).De la misma manera,si la suite inserta un ítem en la secuencia antes del ítem actual,el ítem actual será tratado nuevamente la próxima vez a través del bucle.Esto puede dar lugar a errores desagradables que pueden evitarse haciendo una copia temporal utilizando un trozo de toda la secuencia,por ejemplo,
ja: 注意:シーケンスがループによって変更されているときには微妙な違いがあります(これはリストなどの変異可能なシーケンスに対してのみ発生します).次にどの項目を使用するかを追跡するために内部カウンタが使用されており,これは繰り返しのたびに増加します.このカウンタがシーケンスの長さに達すると、ループは終了します。これは、もしスイートが現在の (あるいは前の)アイテムをシーケンスから削除した場合、次のアイテムはスキップされることを意味します (すでに処理されている現在のアイテムのインデックスを取得するため)。同様に、現在のアイテムの前にアイテムを挿入した場合は、次回のループでは現在のアイテムが再び扱われることになります。これは厄介なバグを引き起こす可能性がありますが、シーケンス全体のスライスを使って一時的なコピーを作成することで回避することができます。
ko: 참고 : 루프에 의해 시퀀스가 ​​수정 될 때 미묘한 부분이 있습니다 (이는 변경 가능한 시퀀스, 즉 목록에 대해서만 발생할 수 있음). 내부 카운터는 다음에 어떤 항목이 사용되는지 추적하는 데 사용되며 각 반복마다 증가합니다. 이 카운터가 시퀀스 길이에 도달하면 루프가 종료됩니다. 즉, 스위트가 시퀀스에서 현재 (또는 이전) 항목을 삭제하면 다음 항목은 건너 뜁니다 (이미 처리 된 현재 항목의 색인을 가져 오기 때문에). 마찬가지로 스위트가 현재 항목 앞에 순서대로 항목을 삽입하면 다음에 루프를 통해 현재 항목이 다시 처리됩니다. 이로 인해 전체 시퀀스 조각을 사용하여 임시 복사본을 만들어 피할 수있는 불쾌한 버그가 발생할 수 있습니다.
zh_cn: 注意:当序列被循环修改时,有一个微妙的变化(这只能发生在可变序列,即列表中)。一个内部的计数器用来跟踪下一步使用哪个项,这个计数器在每次迭代时都会递增。当这个计数器达到序列的长度时,循环就会终止。这意味着,如果套件从序列中删除了当前(或前一个)项,下一个项将被跳过(因为它得到了当前项的索引,而这个索引已经被处理过)。同样的,如果套件在序列中插入一个项在当前项之前,在下一次循环时,当前项将被再次处理。这可能会导致讨厌的BUG,可以通过使用整个序列的一个片断进行临时拷贝来避免,例如。

source: One possible solution, useful if you want not only remove some things, but also do something with all elements in a single loop:
es: Una posible solución,útil si quieres no sólo eliminar algunas cosas,sino también hacer algo con todos los elementos en un solo bucle:
ja: いくつかのものを削除するだけでなく、1つのループの中ですべての要素を使って何かをしたい場合に便利な解決策の1つです。
ko: 하나의 가능한 해결책은 일부를 제거 할뿐만 아니라 단일 루프에서 모든 요소로 무언가를 수행하려는 경우에 유용합니다.
zh_cn: 一个可能的解决方案,如果你不仅想删除一些东西,而且还想在一个循环中对所有元素做一些事情,那么这个解决方案很有用。

source: Or in Python 3:
es: O en Python 3:
ja: もしくはPython 3で。
ko: 또는 파이썬 3에서 :
zh_cn: 或者是在Python 3中。

source: Or, by assigning to the slice <code>somelist[:]</code>, you can mutate the existing list to contain only the items you want:
es: O, al asignar a la lista <code>somelist[:]</code> , puede mutar la lista existente para que contenga solo los elementos que desee:
ja: または、スライス <code>somelist[:]</code> に割り当てることにより、既存のリストを変更して、必要な項目のみを含めることができます。
ko: 또는 슬라이스 <code>somelist[:]</code> 에 할당하여 기존 항목을 변경하여 원하는 항목 만 포함 할 수 있습니다.
zh_cn: 或者，通过将切片分配给 <code>somelist[:]</code> ，您可以将现有列表突变为仅包含所需的项目：

source: Perhaps the underlying rationale is that Python lists are assumed to be dynamic array backed, and therefore any type of removal will be time inefficient anyways, while Java has a nicer interface hierarchy with both <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html"><code>ArrayList</code></a> and <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html"><code>LinkedList</code></a> implementations of <code>ListIterator</code>.
es: Quiz&aacute;s la raz&oacute;n subyacente es que se supone que las listas de Python est&aacute;n respaldadas por una matriz din&aacute;mica y, por lo tanto, cualquier tipo de eliminaci&oacute;n ser&aacute; ineficaz en el tiempo de todos modos, mientras que Java tiene una jerarqu&iacute;a de interfaz m&aacute;s agradable con las implementaciones <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html"> <code>ArrayList</code> </a> y <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html"> <code>LinkedList</code> </a> de <code>ListIterator</code> .
ja: おそらく、根本的な根拠は、Pythonリストは動的配列に対応していると想定されているため、いずれのタイプの削除も時間効率が悪いということ<a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html"> <code>ArrayList</code> </a>が、Javaには、 <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html"> <code>LinkedList</code> </a> ArrayList実装とLinkedList実装の両方を備えた優れたインターフェース階層があり <code>ListIterator</code> 。
ko: 아마도 기본 이론적 근거는 파이썬 목록이 동적 배열을 지원한다고 가정하기 때문에 어쨌든 모든 유형의 제거는 시간이 비효율적이며 Java는 <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html"> <code>LinkedList</code> </a> <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html"> <code>ArrayList</code> </a> 및 LinkedList 구현을 통해 더 나은 인터페이스 계층 구조를 갖습니다.
zh_cn: 可能的基本原理是，假定Python列表是由动态数组支持的，因此任何类型的删除都将在时间上效率低下，而Java具有更好的接口层次结构，同时具有ListIterator的<a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html"> <code>ArrayList</code> </a>和<a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html"> <code>LinkedList</code> </a>实现。

source: Problem is you removed a value from a list during iteration then your list index will collapse.
es: El problema es que si eliminas un valor de una lista durante la iteración,el índice de la lista se colapsará.
ja: 問題は、反復処理中にリストから値を削除した場合、リストのインデックスが崩れてしまうことです。
ko: 문제는 반복하는 동안 목록에서 값을 제거하면 목록 색인이 축소되는 것입니다.
zh_cn: 问题是你在迭代过程中从列表中删除了一个值,那么你的列表索引就会崩溃。
