Repository: rueisnom/feedback
Catalog: xlf/12/07/40/6/1207406.*.001.xlf
Languages: es, ja, ko, zh_cn

source: 1) When using remove(), you attempt to remove integers whereas you need to remove a tuple.
es: 1)Cuando se utiliza remove(),se intenta eliminar los números enteros mientras que se necesita eliminar una tupla.
ja: 1)remove()を使用する場合、タプルを削除する必要があるのに対し、整数を削除しようとします。
ko: 1) remove ()를 사용할 때 정수를 제거하려고 시도하지만 튜플을 제거해야합니다.
zh_cn: 1)当使用 remove()时,你试图删除整数,而你需要删除元组。

source: 2) The for loop will skip items in your list.
es: 2)El bucle "for" salteará los elementos de su lista.
ja: 2)forループはリストの項目をスキップします。
ko: 2) for 루프는 목록의 항목을 건너 뜁니다.
zh_cn: 2)for循环会跳过你的列表中的项目。

source: <code>Filter</code> receives a function and a sequence. <code>Filter</code> applies the passed function to each element in turn, and then decides whether to retain or discard the element depending on whether the function return value is <code>True</code> or <code>False</code>.
es: <code>Filter</code> recibe una funci&oacute;n y una secuencia. <code>Filter</code> aplica la funci&oacute;n pasada a cada elemento por turno y luego decide si desea retener o descartar el elemento dependiendo de si el valor de retorno de la funci&oacute;n es <code>True</code> o <code>False</code> .
ja: <code>Filter</code> は関数とシーケンスを受け取ります。 <code>Filter</code> は渡された関数を各要素に順番に適用し、関数の戻り値が <code>True</code> か <code>False</code> かによって、要素を保持するか破棄するかを決定します。
ko: <code>Filter</code> 는 함수와 시퀀스를받습니다. <code>Filter</code> 는 전달 된 함수를 각 요소에 차례로 적용한 다음 함수 반환 값이 <code>True</code> 인지 <code>False</code> 인지에 따라 요소를 유지할지 또는 삭제할지 결정합니다.
zh_cn: <code>Filter</code> 接收一个函数和一个序列。 <code>Filter</code> 依次将传递的函数应用于每个元素，然后根据函数返回值是 <code>True</code> 还是 <code>False</code> 决定保留还是丢弃该元素。

source: <code>enumerate</code> gives you access to the item and the index at once. <code>reversed</code> is so that the indices that you're going to later delete don't change on you.
es: <code>enumerate</code> le da acceso al elemento y al &iacute;ndice a la vez. <code>reversed</code> es para que los &iacute;ndices que va a eliminar m&aacute;s tarde no cambien en usted.
ja: <code>enumerate</code> は、アイテムとインデックスに一度にアクセスできるようにします。 <code>reversed</code> にすると、後で削除するインデックスが変更されません。
ko: <code>enumerate</code> 하면 항목과 색인에 한 번에 액세스 할 수 있습니다. 나중에 삭제하려는 인덱스가 변경되지 않도록 <code>reversed</code> 입니다.
zh_cn: <code>enumerate</code> 使您可以立即访问项目和索引。 <code>reversed</code> 是为了使您以后要删除的索引不会改变。

source: <em>What I have chosen is a randomly chosen example. <strong>Feel free to change</strong> the <strong>list of tuples</strong> and the <strong>condition</strong> that I have chosen.</em>
es: <em>Lo que he elegido es un ejemplo elegido al azar.</em> <em><strong>Si&eacute;ntase libre de cambiar</strong> la <strong>lista de tuplas</strong> y la <strong>condici&oacute;n</strong> que he elegido.</em>
ja: <em>私が選んだのは、ランダムに選ばれた例です。</em> <em><strong>タプル</strong>の<strong>リストと</strong>選択した<strong>条件</strong>を<strong>自由に変更し</strong>て<strong>ください</strong> 。</em>
ko: <em>내가 선택한 것은 무작위로 선택된 예입니다.</em> <em><strong>튜플 목록</strong> 과 내가 선택한 <strong>조건</strong> 을 <strong>자유롭게 변경</strong> 하십시오.</em>
zh_cn: <em>我选择的是一个随机选择的示例。</em> <em><strong>随意更改</strong> <strong>元组列表</strong>和我选择的<strong>条件</strong> 。</em>

source: <strong>Best workarounds</strong>
es: <strong>Las mejores soluciones</strong>
ja: <strong>最善の回避策</strong>
ko: <strong>최상의 해결 방법</strong>
zh_cn: <strong>最佳解决方法</strong>

source: <strong>Caution: You can also not handle iterators. Iterators are sometimes better than sequences.</strong>
es: <strong>Precauci&oacute;n: tampoco puede manejar iteradores.</strong> <strong>Los iteradores son a veces mejores que las secuencias.</strong>
ja: <strong>注意：イテレータを処理することもできません。</strong> <strong>イテレータはシーケンスよりも優れている場合があります。</strong>
ko: <strong>주의 : 반복자를 처리 할 수도 없습니다.</strong> <strong>반복자는 때때로 시퀀스보다 낫습니다.</strong>
zh_cn: <strong>警告：您也不能处理迭代器。</strong> <strong>迭代器有时比序列更好。</strong>

source: <strong>Could Python do this better?</strong>
es: <strong>&iquest;Podr&iacute;a Python hacer esto mejor?</strong>
ja: <strong>Pythonはこれをもっとうまくできるでしょうか？</strong>
ko: <strong>파이썬이 더 잘 할 수 있습니까?</strong>
zh_cn: <strong>Python可以做得更好吗？</strong>

source: <strong>Method 1 and method 2 are faster than method 3</strong>. Method2 and method3 are more efficient than method1. I <strong>prefer method2</strong>. For the aforementioned example, <code>time(method1) : time(method2) : time(method3) = 1 : 1 : 1.7</code>
es: <strong>El m&eacute;todo 1 y el m&eacute;todo 2 son m&aacute;s r&aacute;pidos que el m&eacute;todo 3</strong> . M&eacute;todo2 y m&eacute;todo3 son m&aacute;s eficientes que m&eacute;todo1. <strong>Prefiero el m&eacute;todo 2</strong> . Para el ejemplo mencionado anteriormente, <code>time(method1) : time(method2) : time(method3) = 1 : 1 : 1.7</code>
ja: <strong>方法1と方法2は方法3よりも高速です</strong> 。 Method2とmethod3はmethod1よりも効率的です。 私は<strong>method2</strong>を<strong>好みます</strong> 。 前述の例の場合、 <code>time(method1) : time(method2) : time(method3) = 1 : 1 : 1.7</code>
ko: <strong>방법 1과 방법 2는 방법 3보다 빠릅니다</strong> . Method2와 method3이 method1보다 효율적입니다. 나는 <strong>method2 선호한다</strong> . 전술 한 예에서, <code>time(method1) : time(method2) : time(method3) = 1 : 1 : 1.7</code>
zh_cn: <strong>方法1和方法2比方法3快</strong> 。 方法2和方法3比方法1更有效。 我<strong>更喜欢method2</strong> 。 对于上述示例， <code>time(method1) : time(method2) : time(method3) = 1 : 1 : 1.7</code>

source: <strong>Method 1.&gt;</strong> Use the framework that you had suggested (where one fills in a code inside a for loop). I use a small code with <code>del</code> to delete a tuple that meets the said condition. However, this method will miss a tuple (which satisfies the said condition) if two consecutively placed tuples meet the given condition.
es: <strong>M&eacute;todo 1.&gt;</strong> Use el marco que hab&iacute;a sugerido (donde se completa un c&oacute;digo dentro de un bucle for). Utilizo un peque&ntilde;o c&oacute;digo con <code>del</code> para eliminar una tupla que cumple con dicha condici&oacute;n. Sin embargo, este m&eacute;todo perder&aacute; una tupla (que satisface dicha condici&oacute;n) si dos tuplas colocadas consecutivamente cumplen la condici&oacute;n dada.
ja: <strong>方法1.&gt;</strong>提案したフレームワークを使用します（forループ内のコードを埋めます）。 <code>del</code> で小さなコードを使用して、上記の条件を満たすタプルを削除します。 ただし、このメソッドは、2つの連続して配置されたタプルが指定された条件を満たす場合、（上記の条件を満たす）タプルを見落とします。
ko: <strong>방법 1.&gt;</strong> 제안한 프레임 워크를 사용하십시오 (for 루프 안에 코드를 채우는 곳). 나는 <code>del</code> 과 함께 작은 코드를 사용하여 상기 조건을 충족시키는 튜플을 삭제합니다. 그러나, 연속적으로 배치 된 2 개의 튜플이 주어진 조건을 만족시키는 경우,이 방법은 (상기 조건을 만족하는) 튜플을 놓칠 것이다.
zh_cn: <strong>方法1.&gt;</strong>使用您建议的框架（其中一个在for循环内填写代码）。 我使用带有 <code>del</code> 的小代码删除满足上述条件的元组。 但是，如果两个连续放置的元组满足给定条件，则此方法将丢失一个元组（满足所述条件）。

source: <strong>Method 2.&gt;</strong> Construct a new list which contains elements (tuples) where the given condition is not met (this is the same thing as removing elements of list where the given condition is met). Following is the code for that:
es: <strong>M&eacute;todo 2.&gt;</strong> Construya una nueva lista que contenga elementos (tuplas) donde no se cumpla la condici&oacute;n dada (esto es lo mismo que eliminar elementos de la lista donde se cumple la condici&oacute;n dada). El siguiente es el c&oacute;digo para eso:
ja: <strong>方法2.&gt;</strong>指定された条件が満たされていない要素（タプル）を含む新しいリストを作成します（これは、指定された条件が満たされたリストの要素を削除するのと同じことです）。 以下はそのためのコードです：
ko: <strong>방법 2.&gt;</strong> 주어진 조건이 충족되지 않는 요소 (튜플)를 포함하는 새로운 목록을 구성하십시오 (이는 주어진 조건이 충족되는 목록의 요소를 제거하는 것과 같습니다). 다음은 그 코드입니다.
zh_cn: <strong>方法2.&gt;</strong>构造一个新列表，其中包含不满足给定条件的元素（元组）（这与删除满足给定条件的list的元素相同）。 以下是该代码：

source: <strong>Method 3.&gt;</strong> Find indices where the given condition is met, and then use remove elements (tuples) corresponding to those indices. Following is the code for that.
es: <strong>M&eacute;todo 3.&gt;</strong> Encuentre &iacute;ndices donde se cumpla la condici&oacute;n dada y luego use elementos de eliminaci&oacute;n (tuplas) correspondientes a esos &iacute;ndices. El siguiente es el c&oacute;digo para eso.
ja: <strong>方法3.&gt;</strong>与えられた条件が満たされているインデックスを見つけ、それらのインデックスに対応する要素の削除（タプル）を使用します。 以下はそのためのコードです。
ko: <strong>방법 3.&gt;</strong> 주어진 조건이 충족되는 색인을 찾은 다음 해당 색인에 해당하는 요소 제거 (튜플)를 사용하십시오. 다음은 그 코드입니다.
zh_cn: <strong>方法3.&gt;</strong>查找满足给定条件的索引，然后使用与这些索引相对应的remove元素（元组）。 以下是该代码。

source: <strong>Official Python 2 tutorial 4.2. "for Statements"</strong>
es: <strong>Tutorial oficial de Python 2 4.2.</strong> <strong>"para declaraciones"</strong>
ja: <strong>公式のPython 2チュートリアル4.2。</strong> <strong>「ステートメント用」</strong>
ko: <strong>공식 파이썬 2 튜토리얼 4.2.</strong> <strong>"명세서"</strong>
zh_cn: <strong>官方Python 2教程4.2。</strong> <strong>&ldquo;用于声明&rdquo;</strong>

source: <strong>Python 2 documentation 7.3. "The for statement"</strong>
es: <strong>Documentaci&oacute;n de Python 2 7.3.</strong> <strong>"El para declaraci&oacute;n"</strong>
ja: <strong>Python 2ドキュメント7.3。</strong> <strong>「forステートメント」</strong>
ko: <strong>파이썬 2 문서 7.3.</strong> <strong>"for 문"</strong>
zh_cn: <strong>Python 2文档7.3。</strong> <strong>&ldquo; for声明&rdquo;</strong>

source: Above we have used the <code>pop</code> method on the fluid list object. Other common iterable methods are also implemented such as <code>del fluidL[i]</code>, <code>.remove</code>, <code>.insert</code>, <code>.append</code>, <code>.extend</code>. The list can also be modified using slices (<code>sort</code> and <code>reverse</code> methods are not implemented).
es: Arriba hemos usado el m&eacute;todo <code>pop</code> en el objeto de la lista de fluidos. Tambi&eacute;n se implementan otros m&eacute;todos iterables comunes, como <code>del fluidL[i]</code> , <code>.remove</code> , <code>.insert</code> , <code>.append</code> , <code>.extend</code> . La lista tambi&eacute;n se puede modificar mediante sectores (no se implementan los m&eacute;todos de <code>sort</code> e <code>reverse</code> ).
ja: 上記では、流体リストオブジェクトで <code>pop</code> メソッドを使用しました。 <code>del fluidL[i]</code> <code>.remove</code> 、 <code>.insert</code> 、 <code>.append</code> 、 <code>.extend</code> などの他の一般的な反復可能なメソッドも実装されています。 リストはスライスを使用して変更することもできます（ <code>sort</code> および <code>reverse</code> メソッドは実装されていません）。
ko: 위에서 우리는 유체리스트 객체에 <code>pop</code> 메소드를 사용했습니다. <code>del fluidL[i]</code> , <code>.remove</code> , <code>.insert</code> , <code>.append</code> , <code>.extend</code> 와 같은 다른 일반적인 반복 가능한 메소드도 구현됩니다. 슬라이스를 사용하여 목록을 수정할 수도 있습니다 ( <code>sort</code> 및 <code>reverse</code> 방법은 구현되지 않음).
zh_cn: 上面我们在流体列表对象上使用了 <code>pop</code> 方法。 还可以实现其他常见的可迭代方法，例如 <code>del fluidL[i]</code> ， <code>.insert</code> ， <code>.append</code> 和 <code>.extend</code> 。 也可以使用切片修改列表（未实现 <code>sort</code> 和 <code>reverse</code> 方法）。

source: Aha! Each element of L1 is actually a tuple. So that's what we need to be passing to remove(). Tuples in python are very easy, they're simply made by enclosing values in parentheses. "a, b" is not a tuple, but "(a, b)" is a tuple. So we modify your code and run it again:
es: ¡Ajá! Cada elemento de L1 es en realidad una tupla.Así que eso es lo que tenemos que pasar para eliminarlo.Las tuplas en pitón son muy fáciles,se hacen simplemente encerrando los valores entre paréntesis."a,b" no es una tupla,pero "a,b" es una tupla.Así que modificamos su código y lo ejecutamos de nuevo:
ja: 嗚呼!L1の各要素は実際にはタプルです。つまり、これが remove()に渡す必要があるものです。pythonのタプルはとても簡単で、値を括弧で囲んで作るだけです。"a,b "はタプルではありませんが、"(a,b)"はタプルです。なので、コードを修正してもう一度実行します。
ko: 아하! L1의 각 요소는 실제로 튜플입니다. 이것이 바로 remove ()에 전달해야하는 것입니다. 파이썬의 튜플은 매우 쉽습니다. 간단히 괄호 안에 값을 넣는 것입니다. "a, b"는 튜플이 아니지만 "(a, b)"는 튜플입니다. 따라서 코드를 수정하고 다시 실행하십시오.
zh_cn: 啊哈,L1的每个元素实际上是一个元组。所以这就是我们需要传递给 remove()的内容。python中的tuple非常简单,它们只是通过在括号中加上值来实现。"a,b "不是一个元组,但"(a,b)"是一个元组。所以我们修改一下你的代码,再运行一次。

source: An example:
es: Un ejemplo:
ja: 一例です。
ko: 예를 들면 :
zh_cn: 举个例子:

source: As I stated to start with: this is a complicated solution that will hurt the readability of your code and make it more difficult to debug. Therefore other solutions such as the list comprehensions mentioned in David Raznick's <a href="https://stackoverflow.com/a/1207461/4451578">answer</a> should be considered first. That being said, I have found times where this class has been useful to me and has been easier to use than keeping track of the indices of elements that need deleting.
es: Como dije para comenzar: esta es una soluci&oacute;n complicada que da&ntilde;ar&aacute; la legibilidad de su c&oacute;digo y dificultar&aacute; la depuraci&oacute;n. Por lo tanto, otras soluciones, como las comprensiones de listas mencionadas en la <a href="https://stackoverflow.com/a/1207461/4451578">respuesta de</a> David Raznick, deben considerarse primero. Dicho esto, he encontrado momentos en los que esta clase me ha sido &uacute;til y ha sido m&aacute;s f&aacute;cil de usar que hacer un seguimiento de los &iacute;ndices de elementos que deben eliminarse.
ja: 最初に述べたように、これはコードの読みやすさを損ない、デバッグをより困難にする複雑なソリューションです。 したがって、David Raznickの<a href="https://stackoverflow.com/a/1207461/4451578">回答で</a>言及されているリスト内包表記など、他のソリューションを最初に検討する必要があります。 そうは言っても、このクラスが私にとって便利で、削除が必要な要素のインデックスを追跡するよりも使いやすいクラスを見つけました。
ko: 처음부터 언급했듯이 : 이것은 코드의 가독성을 손상시키고 디버그하기가 더 어려운 복잡한 솔루션입니다. 따라서 David Raznick의 <a href="https://stackoverflow.com/a/1207461/4451578">답변에</a> 언급 된 목록 이해와 같은 다른 솔루션을 먼저 고려해야합니다. 즉,이 클래스가 나에게 유용하고 삭제해야 할 요소의 색인을 추적하는 것보다 사용하기 쉬운 시간을 발견했습니다.
zh_cn: 就像我刚开始所说的那样：这是一个复杂的解决方案，将损害代码的可读性，并使调试更加困难。 因此，应首先考虑其他解决方案，例如David Raznick的<a href="https://stackoverflow.com/a/1207461/4451578">答案中</a>提到的列表理解。 话虽如此，但我发现此类对我很有用，并且比跟踪需要删除的元素的索引更容易使用。

source: As you can infer from that result, every time that the conditional statement evaluates to true and a list item is removed, the next iteration of the loop will skip evaluation of the next item in the list because its values are now located at different indices.
es: Como se puede deducir de ese resultado,cada vez que la declaración condicional se evalúa como verdadera y se elimina un elemento de la lista,la siguiente iteración del bucle salteará la evaluación del siguiente elemento de la lista porque sus valores se encuentran ahora en índices diferentes.
ja: この結果から推測できるように、条件文が true に評価されてリストの項目が削除されるたびに、次のループの反復はリストの次の項目の評価をスキップします。
ko: 해당 결과에서 유추 할 수 있듯이 조건문이 true로 평가되고 목록 항목이 제거 될 때마다 루프의 다음 반복은 값이 다른 색인에 있으므로 목록의 다음 항목 평가를 건너 뜁니다.
zh_cn: 从这个结果可以推断出,每当条件语句评价为真时,每当条件语句评价为真并删除一个列表项时,循环的下一次迭代就会跳过对列表中的下一个项的评价,因为它的值现在位于不同的索引处。

source: But what if the result of the <code>testFunc</code> depends on the elements that have been added to <code>newList</code> already? Or the elements still in <code>oldList</code> that might be added next? There might still be a way to use a list comprehension but it will begin to lose it's elegance, and for me it feels easier to modify a list in place.
es: Pero, &iquest;qu&eacute; <code>testFunc</code> si el resultado de testFunc depende de los elementos que ya se han agregado a <code>newList</code> ? &iquest;O los elementos que todav&iacute;a est&aacute;n en <code>oldList</code> que podr&iacute;an agregarse a continuaci&oacute;n? Puede que todav&iacute;a haya una manera de utilizar la comprensi&oacute;n de una lista, pero comenzar&aacute; a perder su elegancia, y para m&iacute; es m&aacute;s f&aacute;cil modificar una lista en su lugar.
ja: しかし、 <code>testFunc</code> の結果が <code>newList</code> にすでに追加されている要素に依存している場合はどうでしょうか。 または、次に追加される可能性のある <code>oldList</code> の要素はまだですか？ リスト内包表記を使用する方法はまだあるかもしれませんが、それは優雅さを失い始めるでしょう、そして私にとっては適所でリストを修正する方が簡単に感じます。
ko: 그러나 <code>testFunc</code> 의 결과가 <code>newList</code> 에 이미 추가 된 요소에 의존한다면 어떨까요 ? 아니면 여전히 <code>oldList</code> 에 있는 요소들이 다음에 추가 될 수 있습니까? 여전히 목록 이해력을 사용하는 방법이있을 수 있지만 우아함을 잃기 시작할 것입니다.
zh_cn: 但是，如果 <code>testFunc</code> 的结果取决于已经添加到 <code>newList</code> 的元素怎么办？ 还是可能 <code>oldList</code> 添加到oldList中的元素？ 仍然可能有一种使用列表理解的方法，但是它将开始失去它的优雅性，对我来说，修改就地列表更容易。

source: C++ <a href="https://en.cppreference.com/w/cpp/container/vector/erase"><code>std::vector::erase</code></a> which returns a valid interator to the element after the one removed
es: C ++ <a href="https://en.cppreference.com/w/cpp/container/vector/erase"> <code>std::vector::erase</code> </a> que devuelve un interador v&aacute;lido al elemento despu&eacute;s del eliminado
ja: C ++ <a href="https://en.cppreference.com/w/cpp/container/vector/erase"> <code>std::vector::erase</code> </a>は、要素を削除した後、要素に有効なインタレータを返します
ko: C ++ <a href="https://en.cppreference.com/w/cpp/container/vector/erase"> <code>std::vector::erase</code> </a> 는 요소를 제거한 후 요소에 유효한 인터 레이터를 반환합니다.
zh_cn: C ++ <a href="https://en.cppreference.com/w/cpp/container/vector/erase"> <code>std::vector::erase</code> </a>在删除元素后将有效插入器返回到元素

source: Copying the list using <code>remove</code> might make your code look a little cleaner, as described in one of the answers below. You should definitely not do this for extremely large lists, since this involves first copying the entire list, and also performing an <code>O(n)</code><code>remove</code> operation for each element being removed, making this an <code>O(n^2)</code> algorithm.
es: Copiar la lista usando <code>remove</code> puede hacer que su c&oacute;digo se vea un poco m&aacute;s limpio, como se describe en una de las respuestas a continuaci&oacute;n. Definitivamente, no debe hacer esto para listas extremadamente grandes, ya que esto implica copiar primero la lista completa y tambi&eacute;n realizar una operaci&oacute;n de <code>remove</code> <code>O(n)</code> para cada elemento que se elimina, lo que lo convierte en un algoritmo <code>O(n^2)</code> .
ja: 以下の回答の1つで説明されているように、 <code>remove</code> を使用してリストをコピーすると、コードが少しきれいに見える場合があります。 これは、最初にリスト全体をコピーし、 <code>remove</code> される各要素に対して <code>O(n)</code> 削除操作を実行してこれを <code>O(n^2)</code> アルゴリズムにするため、極端に大きなリストに対しては絶対に行わないでください。
ko: <code>remove</code> 를 사용하여 목록을 복사하면 아래 답변 중 하나에 설명 된대로 코드가 좀 더 깔끔해 보일 수 있습니다. 전체 목록을 먼저 복사하고 <code>remove</code> 되는 각 요소에 대해 <code>O(n)</code> 제거 작업을 수행하여 <code>O(n^2)</code> 알고리즘으로 만들기 때문에 매우 큰 목록에 대해서는이 작업을 수행하지 않아야합니다.
zh_cn: 使用 <code>remove</code> 复制列表可能会使您的代码看起来更简洁，如以下答案之一所述。 您绝对不应该对非常大的列表执行此操作，因为这涉及到首先复制整个列表，然后对要删除的每个元素执行 <code>O(n)</code> <code>remove</code> 操作，从而使其成为 <code>O(n^2)</code> 算法。

source: Download <code>fluidIter.py</code> from <a href="https://github.com/alanbacon/FluidIterator">here</a><code>https://github.com/alanbacon/FluidIterator</code>, it is just a single file so no need to install git. There is no installer so you will need to make sure that the file is in the python path your self. The code has been written for python 3 and is untested on python 2.
es: Descargue <code>fluidIter.py</code> desde <a href="https://github.com/alanbacon/FluidIterator">aqu&iacute;</a> <code>https://github.com/alanbacon/FluidIterator</code> , es solo un archivo, por lo que no es necesario instalar git. No hay instalador, por lo que deber&aacute; asegurarse de que el archivo est&eacute; en la ruta de Python. El c&oacute;digo ha sido escrito para python 3 y no ha sido probado en python 2.
ja: <a href="https://github.com/alanbacon/FluidIterator">ここ</a>から <code>https://github.com/alanbacon/FluidIterator</code> から <code>fluidIter.py</code> をダウンロードします 。これは単一ファイルなので、gitをインストールする必要はありません。 インストーラーはないので、ファイルが自分のpythonパスにあることを確認する必要があります。 コードはpython 3用に作成されており、python 2ではテストされていません。
ko: <code>https://github.com/alanbacon/FluidIterator</code> 에서 <code>fluidIter.py</code> 를 다운로드하면 단일 파일이므로 git을 설치할 필요가 없습니다. 설치 프로그램이 없으므로 파일이 파이썬 경로에 있는지 확인해야합니다. 이 코드는 Python 3 용으로 작성되었으며 Python 2에서 테스트되지 않았습니다.
zh_cn: 从<a href="https://github.com/alanbacon/FluidIterator">这里</a> <code>https://github.com/alanbacon/FluidIterator</code> 下载 <code>fluidIter.py</code> ，它只是一个文件，因此无需安装git。 没有安装程序，因此您需要确保该文件位于您自己的python路径中。 该代码是为python 3编写的，未经python 2的测试。

source: Edit: As mentioned in the comments, this answer does not really present a problem for which this approach provides a solution. I will try to address that here:
es: Editar:Como se mencionó en los comentarios,esta respuesta no presenta realmente un problema para el que este enfoque proporcione una solución.Trataré de abordar eso aquí:
ja: 編集:コメントにもありましたが、この回答では、このアプローチが解決策となる問題を提示していません。私はここでそれに対処しようとします。
ko: 편집 : 의견에서 언급 했듯이이 답변은 실제로이 접근법이 해결책을 제공하는 문제를 제시하지는 않습니다. 나는 그것을 해결하려고 노력할 것이다.
zh_cn: 编辑:正如评论中提到的那样,这个答案并没有提出一个真正的问题,而这个方法提供了一个解决方案。我将在此尝试解决这个问题。

source: Edit: The last code example in this answer gives a use case for <strong><em>why</em></strong> you might sometimes want to modify a list in place rather than use a list comprehension. The first part of the answers serves as tutorial of <strong><em>how</em></strong> an array can be modified in place.
es: Editar: el &uacute;ltimo ejemplo de c&oacute;digo en esta respuesta ofrece un caso de uso de por <strong><em>qu&eacute;</em></strong> a veces es posible que desee modificar una lista en lugar de utilizar una comprensi&oacute;n de la lista. La primera parte de las respuestas sirve como tutorial de <strong><em>c&oacute;mo</em></strong> se puede modificar una matriz en su lugar.
ja: 編集：この回答の最後のコード例は、リスト内包表記を使用するのではなく、その場でリストを変更したい場合がある<strong><em>理由の</em></strong>ユースケースを<strong><em>示してい</em></strong>ます。 回答の最初の部分は、配列を適切に変更する<strong><em>方法の</em></strong>チュートリアルとして機能します。
ko: 편집 :이 답변의 마지막 코드 예제는 목록 이해를 사용하지 않고 대신 목록을 수정하려는 <strong><em>이유에</em></strong> 대한 사용 사례를 제공합니다. 답변의 첫 부분은 배열을 <strong><em>어떻게</em></strong> 수정 <strong><em>하는 지에</em></strong> 대한 자습서 역할을 <strong><em>합니다</em></strong> .
zh_cn: 编辑：此答案中的最后一个代码示例给出了一个用例， <strong><em>说明了为什么</em></strong>有时您可能想在适当位置修改列表而不是使用列表理解。 答案的第一部分用作<strong><em>如何</em></strong>在适当位置修改数组的教程。

source: Finally, there is one cleaner solution than having to make an entirely new copy of L1. The reversed() function:
es: Finalmente,hay una solución más limpia que tener que hacer una copia completamente nueva de L1.La función reverse():
ja: 最後に、L1 の完全な新しいコピーを作成するよりもすっきりとした解決策があります。それが reversed()関数です。
ko: 마지막으로 완전히 새로운 L1 복사본을 만드는 것보다 하나의 더 깨끗한 솔루션이 있습니다. reversed () 함수 :
zh_cn: 最后,还有一个更干净的解决方案,那就是对L1进行全新的复制。reversed()函数。

source: First of all you'll need to <strong>replace foreach loop with while loop</strong>,
es: En primer lugar, deber&aacute; <strong>reemplazar el bucle foreach con el bucle while</strong> ,
ja: まず、 <strong>foreachループをwhileループ</strong>に<strong>置き換える</strong>必要があり<strong>ます</strong> 。
ko: 우선 <strong>foreach 루프를 while 루프</strong> 로 <strong>교체</strong> 해야합니다.
zh_cn: 首先，您需要将<strong>while循环替换为foreach循环</strong> ，

source: For anything that has the potential to be really big, I use the following.
es: Para cualquier cosa que tenga el potencial de ser realmente grande,utilizo lo siguiente.
ja: 本当に大きな可能性を秘めているものには
ko: 정말로 큰 잠재력을 가진 것은 다음을 사용합니다.
zh_cn: 对于任何有潜力的事情,我都会用下面的方法来做。

source: For example (depends on what type of list):
es: Por ejemplo (depende de qué tipo de lista):
ja: 例えば(リストの種類にもよるが)。
ko: 예를 들어 (목록 유형에 따라 다름) :
zh_cn: 例如(看是什么类型的清单)。

source: For more details <a href="http://docs.python.org/library/functions.html#filter">check here</a>
es: Para m&aacute;s detalles <a href="http://docs.python.org/library/functions.html#filter">ver aqu&iacute;</a>
ja: 詳しくは<a href="http://docs.python.org/library/functions.html#filter">こちらをチェック</a>
ko: 자세한 내용은 <a href="http://docs.python.org/library/functions.html#filter">여기를 확인하십시오</a>
zh_cn: 欲了解更多详情， <a href="http://docs.python.org/library/functions.html#filter">请点击这里</a>

source: For those that like functional programming:
es: Para los que les gusta la programación funcional:
ja: 関数型プログラミングが好きな方
ko: 기능적 프로그래밍을 좋아하는 사람들을 위해 :
zh_cn: 对于那些喜欢函数式编程的人来说。

source: Fortunately, it's extremely easy to get both the speed of list comprehensions AND the required semantics of in-place alteration -- just code:
es: Afortunadamente,es extremadamente fácil obtener tanto la velocidad de comprensión de la lista como la semántica necesaria de la alteración en el lugar...sólo el código:
ja: 幸いなことに、リスト内包の速度と必要とされるインプレース変更のセマンティクスの両方を得ることは非常に簡単です。
ko: 다행스럽게도 목록 이해 속도와 내부 변경에 필요한 의미를 모두 쉽게 얻을 수 있습니다.

source: Full answer:
es: Respuesta completa:
ja: フルアンサー。
ko: 전체 답변 :
zh_cn: 全部答案:
