Repository: rueisnom/feedback
Catalog: xlf/13/77/37/70/13773770.*.001.xlf
Languages: es, ja, ko, zh_cn

source: The sample data given by the OP consists only of 20 rows. To create larger data frames, these 20 rows are simply repeated 1, 10, 100, 1000, 10000, and 100000 times which give problem sizes of up to 2 million rows.
es: Los datos de la muestra dados por la OP consisten sólo en 20 filas.Para crear marcos de datos más grandes,estas 20 filas se repiten simplemente 1,10,100,1000,10000 y 100000 veces,lo que da tamaños de problemas de hasta 2 millones de filas.
ja: OPで与えられたサンプル・データは20行のみで構成されています。より大きなデータフレームを作成するために、これらの20行は単純に1、10、100、1000、10000、100000回繰り返され、最大200万行の問題サイズを与えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP가 제공 한 샘플 데이터는 20 행으로 만 구성됩니다. </font><font style="vertical-align: inherit;">더 큰 데이터 프레임을 만들기 위해이 20 개의 행을 1, 10, 100, 1000, 10000 및 100000 회 반복하여 최대 200 만 행의 문제 크기를 제공합니다.</font></font>
zh_cn: OP给出的样本数据仅由20行组成。为了创建更大的数据框,这20行简单地重复了1、10、100、100、1000、10000和100000次,这20行的问题大小可以达到200万行。

source: This old question frequently is being used as dupe target (tagged with <code>r-faq</code>). As of today, it has been answered three times offering 6 different approaches but <strong>is lacking a benchmark</strong> as guidance which of the approaches is the fastest<sup>1</sup>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta vieja pregunta con frecuencia se usa como objetivo duplicado (etiquetada con </font></font> <code>r-faq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">A partir de hoy, se ha respondido tres veces ofreciendo 6 enfoques diferentes, pero </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">carece de un punto de referencia</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como gu&iacute;a cu&aacute;l de los enfoques es el m&aacute;s r&aacute;pido </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この古い質問は頻繁に重複ターゲットとして使用されています（</font></font> <code>r-faq</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タグ付け</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">今日、3つの回答があり、6つの異なるアプローチが提供されてい</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ますが</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、どちらのアプローチが最も速いかについてのガイダンスとして</font><strong><font style="vertical-align: inherit;">、ベンチマークが欠けています</font></strong></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 오래된 질문은 종종 속임수 대상으로 사용됩니다 ( </font></font> <code>r-faq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그 지정 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">오늘 현재 6 가지 접근 방식을 제공하는 3 번의 답변을 받았지만 </font><font style="vertical-align: inherit;">어느 접근 방식이 가장 빠른지에 대한 지침 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">으로 벤치 마크가 부족합니다 </font></font></strong><font style="vertical-align: inherit;"></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个老问题经常被用作重复目标（标记为</font></font> <code>r-faq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">截止到今天，已经提供了6种不同的方法进行了三次回答，但是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缺少基准</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为指导，哪种方法是最快的</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: You can use the <code>convert = TRUE</code> parameter to automatically convert numbers into numeric columns.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar el </font><font style="vertical-align: inherit;">par&aacute;metro </font></font> <code>convert = TRUE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para convertir autom&aacute;ticamente n&uacute;meros en columnas num&eacute;ricas.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>convert = TRUE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パラメータを</font><font style="vertical-align: inherit;">使用して、</font><font style="vertical-align: inherit;">数値を数値列に自動的に変換できます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>convert = TRUE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 매개 변수를 </font><font style="vertical-align: inherit;">사용하여 </font><font style="vertical-align: inherit;">숫자를 숫자 열로 자동 변환 할 수 있습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用</font></font> <code>convert = TRUE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数将数字自动转换为数字列。</font></font>

source: and two additional variants of Jaap's <code>data.table</code> methods.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y dos variantes adicionales de los </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Jaap </font><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaapの</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">の2つの追加バリアント</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaap의 </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">의 두 가지 추가 변형 </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以及Jaap的</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法的</font><font style="vertical-align: inherit;">两个其他变体</font><font style="vertical-align: inherit;">。</font></font>
