Repository: rueisnom/feedback
Catalog: xlf/13/77/37/70/13773770.*.001.xlf
Languages: es, ja, ko, zh_cn

source: <a href="https://stackoverflow.com/a/13773900/3817004">Matthew Lundberg's base R approach</a> but modified according to <a href="https://stackoverflow.com/questions/13773770/split-comma-separated-column-into-separate-rows#comment71864689_13773900">Rich Scriven's comment</a>,
es: <a href="https://stackoverflow.com/a/13773900/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El enfoque base R de Matthew Lundberg,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero modificado de acuerdo con </font></font><a href="https://stackoverflow.com/questions/13773770/split-comma-separated-column-into-separate-rows#comment71864689_13773900"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el comentario de Rich Scriven</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,</font></font>
ja: <a href="https://stackoverflow.com/a/13773900/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Matthew LundbergのベースRアプローチです</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が、</font></font><a href="https://stackoverflow.com/questions/13773770/split-comma-separated-column-into-separate-rows#comment71864689_13773900"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rich Scrivenのコメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に従って変更されました</font><font style="vertical-align: inherit;">。</font></font>
ko: <a href="https://stackoverflow.com/a/13773900/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Matthew Lundberg의 기본 R 접근 방식</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이지만 </font></font><a href="https://stackoverflow.com/questions/13773770/split-comma-separated-column-into-separate-rows#comment71864689_13773900"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rich Scriven의 의견</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 따라 수정되었습니다 </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <a href="https://stackoverflow.com/a/13773900/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Matthew Lundberg的基本R方法，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但根据</font></font><a href="https://stackoverflow.com/questions/13773770/split-comma-separated-column-into-separate-rows#comment71864689_13773900"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rich Scriven的评论进行了</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">修改</font><font style="vertical-align: inherit;">，</font></font>

source: <a href="https://stackoverflow.com/a/28291428/3817004">Ananda's <code>splitstackshape</code>solution</a>,
es: <a href="https://stackoverflow.com/a/28291428/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">soluci&oacute;n </font></font> <code>splitstackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Ananda</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,</font></font>
ja: <a href="https://stackoverflow.com/a/28291428/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アナンダの</font></font> <code>splitstackshape</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font>
ko: <a href="https://stackoverflow.com/a/28291428/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아난다의 </font></font> <code>splitstackshape</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,</font></font>
zh_cn: <a href="https://stackoverflow.com/a/28291428/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">阿南达的</font></font> <code>splitstackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font>

source: <a href="https://stackoverflow.com/a/31514711/3817004">Jaap's</a> two <code>data.table</code> methods and two <code>dplyr</code> / <code>tidyr</code> approaches,
es: <a href="https://stackoverflow.com/a/31514711/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dos </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>data.table</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaap</font><font style="vertical-align: inherit;"> y dos </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ,</font></font>
ja: <a href="https://stackoverflow.com/a/31514711/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaapの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2つの</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドと2つの</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプローチ、</font></font>
ko: <a href="https://stackoverflow.com/a/31514711/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaap의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 가지 </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드와 두 개의 </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 접근법,</font></font>
zh_cn: <a href="https://stackoverflow.com/a/31514711/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jaap的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两种</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法和两种</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法，</font></font>

source: <strong>1) two ways with <code>data.table</code>:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) dos formas con </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）</font></font> <code>data.table</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2つの方法</font><font style="vertical-align: inherit;">：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) </font></font> <code>data.table</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 가지 방법 </font><font style="vertical-align: inherit;">:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）使用</font></font> <code>data.table</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两种方法</font><font style="vertical-align: inherit;">：</font></font></strong>

source: <strong>2) a <code>dplyr</code>/<code>tidyr</code> combination:</strong> Alternatively, you can also use the <code>dplyr</code> / <code>tidyr</code> combination:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) una </font><font style="vertical-align: inherit;">combinaci&oacute;n </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Alternativamente, tambi&eacute;n puede usar la </font><font style="vertical-align: inherit;">combinaci&oacute;n </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組み合わせ：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または、</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組み合わせを</font><font style="vertical-align: inherit;">使用することもできます</font><font style="vertical-align: inherit;">：</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조합 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 방법으로, 당신은 또한 사용할 수 있습니다 </font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 조합 :</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或者，您也可以使用</font></font> <code>dplyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合：</font></font>

source: <strong>3) with <code>tidyr</code> only:</strong> With <a href="https://blog.rstudio.org/2016/06/13/tidyr-0-5-0/"><code>tidyr 0.5.0</code></a> (and later), you can also just use <code>separate_rows</code>:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3) </font><font style="vertical-align: inherit;">solo </font><font style="vertical-align: inherit;">con </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font><a href="https://blog.rstudio.org/2016/06/13/tidyr-0-5-0/"> <code>tidyr 0.5.0</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (y posterior), tambi&eacute;n puede usar </font></font> <code>separate_rows</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3）で</font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみ：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font><a href="https://blog.rstudio.org/2016/06/13/tidyr-0-5-0/"> <code>tidyr 0.5.0</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（以降）、あなたはまた、単に使用することができ</font></font> <code>separate_rows</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3)와 </font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><a href="https://blog.rstudio.org/2016/06/13/tidyr-0-5-0/"> <code>tidyr 0.5.0</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (이상은), 당신은 또한 바로 사용할 수 있습니다 </font></font> <code>separate_rows</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3）</font></font> <code>tidyr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">随着</font></font><a href="https://blog.rstudio.org/2016/06/13/tidyr-0-5-0/"> <code>tidyr 0.5.0</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（或更高版本），你也可以只使用</font></font> <code>separate_rows</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: <strong>4) with base R:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4) con base R:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4）ベースR：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4)베이스 R :</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">4）使用基数R：</font></font></strong>

source: <sup>1</sup><sub>My curiosity was piqued by <a href="https://stackoverflow.com/questions/43409756/r-efficiently-separate-groups-in-data-frame#comment73879642_43409986">this exuberant comment</a> <em>Brilliant! Orders of magnitude faster!</em> to a <code>tidyverse</code> answer of <a href="https://stackoverflow.com/q/43409756/3817004">a question</a> which was closed as a duplicate of this question.</sub>
es: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 </font></font></sup><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi curiosidad se despert&oacute; con </font></font><a href="https://stackoverflow.com/questions/43409756/r-efficiently-separate-groups-in-data-frame#comment73879642_43409986"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este comentario exuberante </font></font></a> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Brillante! </font><font style="vertical-align: inherit;">&Oacute;rdenes de magnitud m&aacute;s r&aacute;pido! </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a una </font><font style="vertical-align: inherit;">respuesta </font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font><a href="https://stackoverflow.com/q/43409756/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una pregunta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se cerr&oacute; como un duplicado de esta pregunta.</font></font></sub>
ja: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 </font></font></sup><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の好奇心は</font></font><a href="https://stackoverflow.com/questions/43409756/r-efficiently-separate-groups-in-data-frame#comment73879642_43409986"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このあふれん</font></font></a> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ばかりの</font><font style="vertical-align: inherit;">コメント</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Brilliant！</font><font style="vertical-align: inherit;">桁違いに速い！</font></font></em><font style="vertical-align: inherit;"></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の答え</font></font><a href="https://stackoverflow.com/q/43409756/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">質問</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この質問の重複として閉鎖されました。</font></font></sub>
ko: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1이 </font></font></sup><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호기심 많은 </font></font><a href="https://stackoverflow.com/questions/43409756/r-efficiently-separate-groups-in-data-frame#comment73879642_43409986"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의견 </font></font></a> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Brilliant에</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의해 호기심이 생겼습니다 </font><em><font style="vertical-align: inherit;">! </font></em><em><font style="vertical-align: inherit;">훨씬 빠른 속도! </font></em><font style="vertical-align: inherit;">A와 </font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 대답은 </font></font><a href="https://stackoverflow.com/q/43409756/3817004"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 질문의 중복으로 폐쇄되었다.</font></font></sub>
zh_cn: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 </font></font></sup><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的好奇心被</font></font><a href="https://stackoverflow.com/questions/43409756/r-efficiently-separate-groups-in-data-frame#comment73879642_43409986"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个热烈的评论</font></font></a> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">激怒了！</font><font style="vertical-align: inherit;">快几个数量级！</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对一个</font><a href="https://stackoverflow.com/q/43409756/3817004"><font style="vertical-align: inherit;">问题</font></a><font style="vertical-align: inherit;">的</font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答案，</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该问题</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已作为该问题的重复部分而关闭。</font></font></sub>
