Repository: rueisnom/feedback
Catalog: xlf/13/77/37/70/13773770.*.001.xlf
Languages: es, ja, ko, zh_cn

source: As you can see, some entries in the <code>director</code> column are multiple names separated by commas. I would like to split these entries up into separate rows while maintaining the values of the other column. As an example, the first row in the data frame above should be split into two rows, with a single name each in the <code>director</code> column and 'A' in the <code>AB</code> column.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como puede ver, algunas entradas en la </font><font style="vertical-align: inherit;">columna </font><font style="vertical-align: inherit;">del </font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son nombres m&uacute;ltiples separados por comas. </font><font style="vertical-align: inherit;">Me gustar&iacute;a dividir estas entradas en filas separadas mientras mantengo los valores de la otra columna. </font><font style="vertical-align: inherit;">Como ejemplo, la primera fila en el marco de datos anterior debe dividirse en dos filas, con un solo nombre cada una en la </font><font style="vertical-align: inherit;">columna </font><font style="vertical-align: inherit;">del </font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y 'A' en la </font><font style="vertical-align: inherit;">columna </font></font> <code>AB</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご覧のとおり、</font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列の</font><font style="vertical-align: inherit;">一部のエントリは、</font><font style="vertical-align: inherit;">コンマで区切られた複数の名前です。</font><font style="vertical-align: inherit;">他の列の値を維持しながら、これらのエントリを別々の行に分割したいと思います。</font><font style="vertical-align: inherit;">例として、上のデータフレームの最初の行は2つの行に分割する必要があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">それぞれ1つの名前が</font></font> <code>director</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列にあり、「A」が</font></font> <code>AB</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列にあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보다시피, </font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 열의 </font><font style="vertical-align: inherit;">일부 항목은 </font><font style="vertical-align: inherit;">쉼표로 구분 된 여러 이름입니다. </font><font style="vertical-align: inherit;">다른 열의 값을 유지하면서 이러한 항목을 별도의 행으로 나누고 싶습니다. </font><font style="vertical-align: inherit;">예를 들어, 위의 데이터 프레임의 첫 번째 행은 두 개의 행으로 분할되어야하며, 각 이름은 </font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 열에 </font><font style="vertical-align: inherit;">하나의 이름 </font><font style="vertical-align: inherit;">이 있고 </font></font> <code>AB</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 열에 </font><font style="vertical-align: inherit;">'A'가 </font><font style="vertical-align: inherit;">있습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如您所见，</font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列中的</font><font style="vertical-align: inherit;">某些条目</font><font style="vertical-align: inherit;">是多个名称，以逗号分隔。</font><font style="vertical-align: inherit;">我想将这些条目拆分为单独的行，同时保持另一列的值。</font><font style="vertical-align: inherit;">例如，上面数据框中的第一行应分为两行，在</font></font> <code>director</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列中</font><font style="vertical-align: inherit;">各有一个名称</font><font style="vertical-align: inherit;">，在</font></font> <code>AB</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列中有</font><font style="vertical-align: inherit;">一个&ldquo; A&rdquo; </font><font style="vertical-align: inherit;">。</font></font>

source: Benchmark results
es: Resultados de referencia
ja: ベンチマーク結果
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">벤치 마크 결과</font></font>
zh_cn: 基准结果

source: Create chart
es: Crear un gráfico
ja: チャートの作成
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차트 만들기</font></font>
zh_cn: 创建图表

source: Define function for benchmark runs of problem size <code>n</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Definir la funci&oacute;n para ejecuciones de referencia del tama&ntilde;o del problema </font></font> <code>n</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題サイズ</font> <code>n</code> の<font style="vertical-align: inherit;">ベンチマーク実行の関数を定義します</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제 크기 </font> <code>n</code> <font style="vertical-align: inherit;"> 의 벤치 마크 실행을위한 기능 정의</font></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为问题大小为</font> <code>n</code> 的<font style="vertical-align: inherit;">基准运行定义函数</font></font><font style="vertical-align: inherit;"></font>

source: For smaller data frames, Matt's base R solution and <code>data.table</code> method 4 seem to have less overhead than the other methods.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para marcos de datos m&aacute;s peque&ntilde;os, la soluci&oacute;n base R de Matt y el </font><font style="vertical-align: inherit;">m&eacute;todo 4 de </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> parecen tener menos sobrecarga que los otros m&eacute;todos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">小さいデータフレームの場合、MattのベースRソリューションと</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド4は、他のメソッドよりもオーバーヘッドが少ないようです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 작은 데이터 프레임의 경우 Matt의 기본 R 솔루션 및 </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법 4는 다른 방법보다 오버 헤드가 적습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于较小的数据帧，Matt的基本R解决方案和</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法4似乎比其他方法具有更少的开销。</font></font>

source: I have a data frame, like so:
es: Tengo un marco de datos,así:
ja: こんな感じでデータフレームを持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터 프레임이 있습니다.</font></font>
zh_cn: 我有一个数据框架,像这样。

source: Late to the party, but another generalized alternative is to use <code>cSplit</code> from my "splitstackshape" package that has a <code>direction</code> argument. Set this to <code>"long"</code> to get the result you specify:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tarde a la fiesta, pero otra alternativa generalizada es usar </font></font> <code>cSplit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de mi paquete "splitstackshape" que tiene un </font><font style="vertical-align: inherit;">argumento de </font></font> <code>direction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Establezca esto en </font></font> <code>"long"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener el resultado que especifique:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">後期パーティーに、しかし他の一般の代替が使用することです</font></font> <code>cSplit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">持っている私の「splitstackshape」パッケージから</font></font> <code>direction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引数を。</font><font style="vertical-align: inherit;">これを</font></font> <code>"long"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">設定</font><font style="vertical-align: inherit;">して、指定した結果を取得します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파티에 </font></font> <code>cSplit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 일반적인 대안은 </font></font> <code>direction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인수가 </font><font style="vertical-align: inherit;">있는 "splitstackshape"패키지의 cSplit </font><font style="vertical-align: inherit;">을 사용 </font><font style="vertical-align: inherit;">하는 것 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">지정한 결과를 얻으려면 </font><font style="vertical-align: inherit;">이것을 </font></font> <code>"long"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 </font><font style="vertical-align: inherit;">설정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">迟到了，但另一个普遍的选择是使用</font></font> <code>cSplit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从具有我的&ldquo;splitstackshape&rdquo;包</font></font> <code>direction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的说法。</font><font style="vertical-align: inherit;">将此设置为</font></font> <code>"long"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可获得您指定的结果：</font></font>

source: Naming your original data.frame <code>v</code>, we have this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al nombrar su data.frame </font></font> <code>v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> original </font><font style="vertical-align: inherit;">, tenemos esto:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元のdata.frame </font></font> <code>v</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前を付ける</font><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">、次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 data.frame </font></font> <code>v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이름을 지정 </font><font style="vertical-align: inherit;">하면 다음과 같습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为您的原始data.frame </font></font> <code>v</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命名</font><font style="vertical-align: inherit;">，我们有：</font></font>

source: Note the use of <code>rep</code> to build the new AB column. Here, <code>sapply</code> returns the number of names in each of the original rows.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta el uso de </font></font> <code>rep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para construir la nueva columna AB. </font><font style="vertical-align: inherit;">Aqu&iacute;, </font></font> <code>sapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve el n&uacute;mero de nombres en cada una de las filas originales.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>rep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して新しいABカラムを作成して</font><font style="vertical-align: inherit;">いることに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ここで、</font></font> <code>sapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は元の各行の名前の数を返します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 주 </font></font> <code>rep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 새로운 AB 열을 구축 할 수 있습니다. </font><font style="vertical-align: inherit;">여기서 </font></font> <code>sapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 각 원래 행의 이름 수를 반환합니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意使用</font></font> <code>rep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来构建新的AB列。</font><font style="vertical-align: inherit;">在这里，</font></font> <code>sapply</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回每个原始行中名称的数量。</font></font>

source: Overall 8 different methods were benchmarked on 6 different sizes of data frames using the <code>microbenchmark</code> package (see code below).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En general, se compararon 8 m&eacute;todos diferentes en 6 tama&ntilde;os diferentes de marcos de datos utilizando el </font><font style="vertical-align: inherit;">paquete de </font></font> <code>microbenchmark</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (ver el c&oacute;digo a continuaci&oacute;n).</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>microbenchmark</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ベンチマーク</font><font style="vertical-align: inherit;">パッケージ</font><font style="vertical-align: inherit;">を使用して、全体で8つの異なるメソッドを6つの異なるサイズのデータ​​フレームでベンチマークしました</font><font style="vertical-align: inherit;">（以下のコードを参照）。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>microbenchmark</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지를 </font><font style="vertical-align: inherit;">사용하여 6 개의 서로 다른 크기의 데이터 프레임에 대해 총 8 개의 서로 다른 방법이 벤치마킹되었습니다 </font><font style="vertical-align: inherit;">(아래 코드 참조).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>microbenchmark</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序包</font><font style="vertical-align: inherit;">对6种不同大小的数据帧进行了总共8种不同方法的基准测试</font><font style="vertical-align: inherit;">（请参见以下代码）。</font></font>

source: Prepare data for plotting
es: Preparar los datos para el trazado
ja: プロット用のデータを準備する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">플로팅을위한 데이터 준비</font></font>
zh_cn: 准备数据,以备绘图

source: Remarkably, the timings of the two <code>tidyverse</code> methods and the <code>splistackshape</code> solution are so similar that it's difficult to distiguish the curves in the chart. They are the slowest of the benchmarked methods across all data frame sizes.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sorprendentemente, los tiempos de los dos </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y la </font><font style="vertical-align: inherit;">soluci&oacute;n </font></font> <code>splistackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son tan similares que es dif&iacute;cil distinguir las curvas en el gr&aacute;fico. </font><font style="vertical-align: inherit;">Son los m&eacute;todos m&aacute;s lentos de referencia en todos los tama&ntilde;os de trama de datos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">驚くべきことに、2つの</font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドと</font></font> <code>splistackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション</font><font style="vertical-align: inherit;">のタイミング</font><font style="vertical-align: inherit;">は非常に似ているため、グラフの曲線を</font><font style="vertical-align: inherit;">区別</font><font style="vertical-align: inherit;">するのは困難です。</font><font style="vertical-align: inherit;">これらは、すべてのデータフレームサイズで最も低速なベンチマーク手法です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">놀랍게도, 두 가지 </font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법과 </font></font> <code>splistackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션 </font><font style="vertical-align: inherit;">의 타이밍 </font><font style="vertical-align: inherit;">이 너무 유사하여 차트에서 곡선을 구별하기가 어렵습니다. </font><font style="vertical-align: inherit;">모든 데이터 프레임 크기에서 벤치마킹 된 방법 중 가장 느립니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值得注意的是，这两个定时</font></font> <code>tidyverse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法和</font></font> <code>splistackshape</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">溶液是如此的相似，它是难以distiguish图表中的曲线。</font><font style="vertical-align: inherit;">在所有数据帧大小中，它们是基准测试方法中最慢的。</font></font>

source: Run benchmark for different problem sizes
es: Ejecutar el punto de referencia para diferentes tamaños de problemas
ja: 異なる問題サイズのベンチマークを実行
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다양한 문제 크기에 대한 벤치 마크 실행</font></font>
zh_cn: 针对不同的问题大小运行基准

source: Session info &amp; package versions (excerpt)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Informaci&oacute;n de la sesi&oacute;n y versiones del paquete (extracto)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッション情報とパッケージのバージョン（抜粋）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세션 정보 및 패키지 버전 (발췌)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会话信息和软件包版本（节选）</font></font>

source: Several alternatives:
es: Varias alternativas:
ja: いくつかの選択肢があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 가지 대안 :</font></font>
zh_cn: 几个备选方案:

source: Split comma-separated strings in a column into separate rows
es: Dividir las cadenas separadas por comas en una columna en filas separadas
ja: 列内のカンマ区切りの文字列を別々の行に分割する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">열에서 쉼표로 구분 된 문자열을 별도의 행으로 분할</font></font>
zh_cn: 将一个列中的逗号分隔的字符串分割成不同的行。

source: The benchmark results show that for sufficiently large data frames all <code>data.table</code> methods are faster than any other method. For data frames with more than about 5000 rows, Jaap's <code>data.table</code> method 2 and the variant <code>DT3</code> are the fastest, magnitudes faster than the slowest methods.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los resultados del punto de referencia muestran que para marcos de datos suficientemente grandes, todos los </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son m&aacute;s r&aacute;pidos que cualquier otro m&eacute;todo. </font><font style="vertical-align: inherit;">Para marcos de datos con m&aacute;s de aproximadamente 5000 filas, el </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2 de </font><font style="vertical-align: inherit;">Jaap </font><font style="vertical-align: inherit;">y la variante </font></font> <code>DT3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son los m&aacute;s r&aacute;pidos, las magnitudes m&aacute;s r&aacute;pidas que los m&eacute;todos m&aacute;s lentos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ベンチマークの結果は、十分に大きいデータフレームの場合、すべての</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドが他のどのメソッドよりも高速である</font><font style="vertical-align: inherit;">ことを示してい</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">約5000行を超えるデータフレームの場合、Jaapの</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド2とバリアント</font></font> <code>DT3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が最も速く、最も遅いメソッドよりも高速です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">벤치 마크 결과는 충분히 큰 데이터 프레임의 경우 모든 데이터 </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법이 다른 방법보다 빠르다 </font><font style="vertical-align: inherit;">는 것을 보여줍니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">행이 5000 개가 넘는 데이터 프레임의 경우 Jaap의 </font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법 2와 변형 </font></font> <code>DT3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 가장 느린 방법보다 빠르며 크기가 빠릅니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基准测试结果表明，对于足够大的数据帧，所有</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法都比其他任何方法都快。</font><font style="vertical-align: inherit;">对于具有约5000行以上的数据帧，Jaap的</font></font> <code>data.table</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法2和</font></font> <code>DT3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变体</font><font style="vertical-align: inherit;">是最快的，幅度比最慢的方法快。</font></font>

source: The benchmarked solutions include
es: Las soluciones de referencia incluyen
ja: ベンチマーク化されたソリューションには以下のようなものがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">벤치마킹 솔루션에는 다음이 포함됩니다.</font></font>
zh_cn: 基准化的解决方案包括
