Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that my initial question was at <strong>n = 100.000</strong>. This point (by accident) exhibits special behavior:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que mi pregunta inicial fue en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n = 100.000</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Este punto (por accidente) exhibe un comportamiento especial:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初の質問は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n = 100.000で</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あったことに注意してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このポイント（偶然）は特別な動作を示します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 초기 질문은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n = 100.000</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">우연히이 시점은 특별한 행동을 나타냅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что мой начальный вопрос был при </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n = 100.000</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Эта точка (случайно) демонстрирует особое поведение:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请注意，我最初的问题是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">n = 100.000</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这一点（偶然）表现出特殊的行为：</font></font>

source: Now if the "Data" set is fairly small it may not seem all that bad of a difference at first but since <code>Case 1</code> is about <code>60 - 70%</code> slower than <code>Case 2</code> we can look at the growth of this function as being in terms of the differences in time executions:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora, si el conjunto de "Datos" es bastante peque&ntilde;o, puede no parecer una gran diferencia al principio, pero dado que el </font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es aproximadamente un </font></font> <code>60 - 70%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> m&aacute;s lento que el </font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos ver el crecimiento de esta funci&oacute;n en t&eacute;rminos de Las diferencias en las ejecuciones de tiempo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、「データ」セットがかなり小さい場合、最初はそれほど大きな違いはないように思えるかもしれませんが、</font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font> <code>Case 2</code> <font style="vertical-align: inherit;">よりも</font></font> <code>60 - 70%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遅いため</font><font style="vertical-align: inherit;">、この関数の成長は時間実行の違い：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"데이터"세트가 상당히 작 으면 처음에는 차이가 나쁘지 않을 수 있지만 </font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 </font> <code>Case 2</code> <font style="vertical-align: inherit;"> 보다 </font><font style="vertical-align: inherit;">약 </font></font> <code>60 - 70%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 느리기 </font><font style="vertical-align: inherit;">때문에이 기능의 성장을 다음과 같이 볼 수 있습니다. 시간 실행의 차이점 :</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь, если набор &laquo;данных&raquo; довольно мал, на первый взгляд может показаться, что разница не такая уж и плохая, но, поскольку </font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> примерно на </font></font> <code>60 - 70%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> медленнее, чем </font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мы можем рассматривать рост этой функции с точки зрения Различия во времени исполнения:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，如果&ldquo;数据&rdquo;组是相当小的，可能似乎不是所有的在第一，但由于差的不良</font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为约</font></font> <code>60 - 70%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">速度低于</font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我们可以看看这个函数的增长来讲是时间执行的差异：</font></font>

source: OK, the right answer definitely has to do something with the CPU cache. But to use the cache argument can be quite difficult, especially without data.
es: Bien,la respuesta correcta definitivamente tiene que ver con el caché de la CPU.Pero usar el argumento de la caché puede ser bastante difícil,especialmente sin datos.
ja: OK、正解は間違いなくCPUキャッシュに関係しています。しかし、キャッシュの引数を使用することは、特にデータがない場合、非常に困難である可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정답은 분명히 CPU 캐시와 관련이 있습니다. </font><font style="vertical-align: inherit;">그러나 캐시 인수를 사용하는 것은 특히 데이터가 없으면 매우 어려울 수 있습니다.</font></font>
ru: Хорошо,правильный ответ определенно должен быть связан с кэш-памятью процессора.Но использовать аргумент кэша может быть довольно сложно,особенно без данных.
zh_cn: OK,正确的答案肯定和CPU缓存有关。但是要使用缓存参数,尤其是在没有数据的情况下,使用缓存参数是相当困难的。

source: One loop: 1.577 ms
es: Un bucle:1.577 ms
ja: 1ループ。1.577ms
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 루프 : 1.577ms</font></font>
ru: Одна петля:1,577 мс
zh_cn: 一圈。1.577毫秒

source: PPS: Here is the full code. It uses <a href="https://www.threadingbuildingblocks.org/">TBB</a><code>Tick_Count</code> for higher resolution timing, which can be disabled by not defining the <code>TBB_TIMING</code> Macro:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PPS: Aqu&iacute; est&aacute; el c&oacute;digo completo. </font><font style="vertical-align: inherit;">Utiliza </font></font><a href="https://www.threadingbuildingblocks.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TBB </font></font></a> <code>Tick_Count</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para tiempos de resoluci&oacute;n m&aacute;s altos, que se pueden deshabilitar al no definir la </font><font style="vertical-align: inherit;">macro </font></font> <code>TBB_TIMING</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PPS：これが完全なコードです。</font> <code>TBB_TIMING</code> <font style="vertical-align: inherit;">マクロを</font><font style="vertical-align: inherit;">定義しないことで無効にできる、より高い解像度のタイミングのために</font></font><a href="https://www.threadingbuildingblocks.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TBB </font></font></a> <code>Tick_Count</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用します</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PPS : 전체 코드는 다음과 같습니다. </font> <code>TBB_TIMING</code> <font style="vertical-align: inherit;"> 매크로를 </font><font style="vertical-align: inherit;">정의하지 않으면 비활성화 할 수있는 고해상도 타이밍에 </font></font><a href="https://www.threadingbuildingblocks.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TBB </font></font></a> <code>Tick_Count</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PPS: вот полный код. </font><font style="vertical-align: inherit;">Он использует </font></font><a href="https://www.threadingbuildingblocks.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TBB </font></font></a> <code>Tick_Count</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для синхронизации с более высоким разрешением, который можно отключить, не определяя </font></font> <code>TBB_TIMING</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PPS：这是完整的代码。</font><font style="vertical-align: inherit;">它使用</font></font><a href="https://www.threadingbuildingblocks.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TBB </font></font></a> <code>Tick_Count</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获得更高分辨率的时序，可以通过不定义</font></font> <code>TBB_TIMING</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">宏</font><font style="vertical-align: inherit;">来禁用它</font><font style="vertical-align: inherit;">：</font></font>

source: PS: I am not sure, if this helps:
es: PD:No estoy seguro,si esto ayuda:
ja: PS:これが役に立つかどうかはわかりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추신 : 이것이 도움이되는지 확실하지 않습니다.</font></font>
ru: PS:Я не уверен,поможет ли это:
zh_cn: PS:我不知道,如果这样做有帮助的话。

source: PS: I changed the loops to count down to zero, and the combined method was marginally faster. Scratching my head. Note the new array sizing and loop counts.
es: PD:Cambié los bucles para la cuenta atrás hasta cero,y el método combinado fue ligeramente más rápido.Rascándome la cabeza.Observen el nuevo tamaño de la matriz y el número de bucles.
ja: 追記:ループをゼロまでカウントダウンするように変更してみたところ、組み合わせた方法の方がわずかに速くなりました。頭を掻いています。新しい配列のサイズとループのカウントに注目してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추신 : 루프를 0으로 카운트 다운하도록 변경했으며 결합 된 방법이 약간 더 빠릅니다. </font><font style="vertical-align: inherit;">내 머리를 긁적. </font><font style="vertical-align: inherit;">새로운 배열 크기 및 루프 수를 확인하십시오.</font></font>
ru: PS:Я изменил циклы на обратный отсчет до нуля,и комбинированный метод был немного быстрее.Царапал голову.Обратите внимание на новый размер массива и количество циклов.
zh_cn: PS:我把环路改成了倒数为零,综合法稍微快了一点。挠了挠头。注意新的数组大小和循环次数。

source: Repeat for <code>c</code> and <code>d</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Repita para </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について繰り返し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>d</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대해 반복하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Повторите для </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重复</font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Say <code>n = 2</code> and we are working with bytes. In my scenario we thus have <strong>just 4 bytes of RAM</strong> and the rest of our memory is significantly slower (say 100 times longer access).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Digamos </font></font> <code>n = 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y estamos trabajando con bytes. </font><font style="vertical-align: inherit;">En mi caso, tenemos </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solo 4 bytes de RAM</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el resto de nuestra memoria es significativamente m&aacute;s lenta (digamos un acceso 100 veces m&aacute;s largo).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セイ</font></font> <code>n = 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、私たちはバイトで作業しています。</font><font style="vertical-align: inherit;">したがって、私のシナリオでは</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、RAMが4バイト</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しか</font><strong><font style="vertical-align: inherit;">ない</font></strong><font style="vertical-align: inherit;">ため</font><font style="vertical-align: inherit;">、残りのメモリは大幅に遅くなります（アクセスが100倍になるなど）。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>n = 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라고 말하면 </font><font style="vertical-align: inherit;">바이트로 작업하고 있습니다. </font><font style="vertical-align: inherit;">내 시나리오에서 우리는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단지 4 바이트의 RAM</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 가지고 있으며 나머지 메모리는 상당히 느립니다 (예 : 100 배 더 긴 액세스).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Скажите </font></font> <code>n = 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и мы работаем с байтами. </font><font style="vertical-align: inherit;">Таким образом, в моем сценарии у нас </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всего 4 байта оперативной памяти,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а остальная часть памяти значительно медленнее (скажем, в 100 раз больше доступа).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设</font></font> <code>n = 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我们正在处理字节。</font><font style="vertical-align: inherit;">因此，在我的情况下，我们</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只有4个字节的RAM</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而其余​​的内存则显着变慢（例如，访问时间增加了100倍）。</font></font>
