Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: That's why I combined his test (using a continuous vs. separate allocation) and @James' Answer's advice.
es: Por eso combiné su test (usando una asignación continua vs.separada)y el consejo de @James' Answer.
ja: だからこそ、彼のテスト(連続対個別の割り当てを使う)と、@Jamesさんのアンサーのアドバイスを組み合わせてみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 나는 그의 테스트 (연속 대 별도 할당 사용)와 @James 'Answer의 조언을 결합했습니다.</font></font>
ru: Поэтому я объединил его тест (используя непрерывное vs.раздельное распределение)и совет @James' Answer's.
zh_cn: 这也是为什么我把他的测试(用连续分配与单独分配的方式)和@James的回答结合起来的原因。

source: The OP's code:
es: El código de la OP:
ja: OPのコード。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP의 코드 :</font></font>
ru: Код ОП:
zh_cn: OP的代码。

source: The first code modifies distant memory addresses alternating them at each loop, thus requiring continuously to invalidate the cache.
es: El primer código modifica las direcciones de memoria distante alternándolas en cada bucle,por lo que se requiere continuamente para invalidar la caché.
ja: 最初のコードは、遠いメモリアドレスをループごとに交互に変更するため、キャッシュを無効にするために継続的に必要となります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 코드는 각 루프에서 먼 메모리 주소를 번갈아 변경하여 캐시를 계속 무효화해야합니다.</font></font>
ru: Первый код модифицирует адреса удаленной памяти,чередуя их в каждом цикле,требуя непрерывной недействительности кэша.
zh_cn: 第一个代码在每个循环中交替修改远处的内存地址,因此需要不断地使缓存失效。

source: The first loop alternates writing in each variable. The second and third ones only make small jumps of element size.
es: El primer bucle alterna la escritura en cada variable.El segundo y el tercero sólo hacen pequeños saltos del tamaño del elemento.
ja: 1つ目のループは、各変数に交互に書き込んでいます。2つ目と3つ目は要素サイズの小さなジャンプをするだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 루프는 각 변수의 쓰기를 번갈아합니다. </font><font style="vertical-align: inherit;">두 번째와 세 번째는 요소 크기의 작은 점프 만합니다.</font></font>
ru: Первый цикл чередует запись в каждую переменную.Второй и третий производят только небольшие скачки размера элемента.
zh_cn: 第一个循环在每个变量中交替写入。第二个和第三个只做元素大小的小跳跃。

source: The graphs below shows, that most of the answers and especially the majority of comments to the question and answers can be considered completely wrong or true depending on the exact scenario and parameters used.
es: En los gráficos que figuran a continuación se muestra que la mayoría de las respuestas y especialmente la mayoría de los comentarios a la pregunta y las respuestas pueden considerarse completamente erróneas o verdaderas dependiendo del escenario exacto y los parámetros utilizados.
ja: 下のグラフは、ほとんどの回答と、特に質問と回答に対するコメントの大部分が、使用されている正確なシナリオとパラメータに応じて、完全に間違っているか、真であると考えられることを示しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래의 그래프는 사용 된 정확한 시나리오와 매개 변수에 따라 대부분의 답변, 특히 질문과 답변에 대한 대부분의 의견이 완전히 잘못되거나 참으로 간주 될 수 있음을 보여줍니다.</font></font>
ru: Приведенные ниже графики показывают,что большинство ответов и особенно большинство комментариев к вопросу и ответам могут считаться полностью неверными или истинными в зависимости от точного сценария и используемых параметров.
zh_cn: 从下图中可以看出,大多数的答案,特别是大多数对问题和答案的评论,可以认为是完全错误的,也可以认为是正确的,这取决于所使用的具体情景和参数。

source: The iterations through the first case <code>Sum</code> calls <code>f(a)</code> that will add to its self <code>f(b)</code> then it calls <code>f(c)</code> that will do the same but add <code>f(d)</code> to itself for each <code>100000 iterations</code>. In the second case we have <code>Sum1</code> and <code>Sum2</code> And both act the same as if they were the same function being called twice in a row. In this case we can treat <code>Sum1</code> and <code>Sum2</code> as just plain old <code>Sum</code> where <code>Sum</code> in this case looks like this: <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> and now this looks like an optimization where we can just consider it to be the same function.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las iteraciones a trav&eacute;s del primer caso </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llama </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se agregar&aacute; a s&iacute; mismo </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> luego llama </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que har&aacute; lo mismo pero se agregar&aacute; </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a s&iacute; mismo por cada </font></font> <code>100000 iterations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En el segundo caso tenemos </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Y ambos act&uacute;an igual que si fueran la misma funci&oacute;n que se llama dos veces seguidas. </font><font style="vertical-align: inherit;">En este caso, podemos tratar a </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como la simple y antigua </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> donde </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en este caso se ve as&iacute;: </font></font> <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y ahora esto parece una optimizaci&oacute;n en la que podemos considerar que es la misma funci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初のケースでの反復は、</font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出し</font><font style="vertical-align: inherit;">てそれ自体を</font></font> <code>f(b)</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">追加し、</font><font style="vertical-align: inherit;">次に</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出し</font><font style="vertical-align: inherit;">て同じことを行いますが、</font> <code>100000 iterations</code> <font style="vertical-align: inherit;">ごとに</font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をそれ自体に追加し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">2番目のケースでは、</font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>Sum2</code> があり<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、どちらも同じ関数が2回続けて呼び出されたかのように動作します。</font><font style="vertical-align: inherit;">この場合、</font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を単純な古い</font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として</font><font style="vertical-align: inherit;">扱うことができます。この場合</font><font style="vertical-align: inherit;">、</font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は次のようになります</font></font> <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> これは、同じ関数と見なすことができる最適化のように見えます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 경우를 통해 반복 </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그 자체를 추가하는 것 </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 호출 </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동일한 기능을 수행하지만, 추가한다 </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 각각 그 자체 </font></font> <code>100000 iterations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">두 번째 경우에는 </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 있으며 </font><font style="vertical-align: inherit;">둘 다 동일한 함수가 연속으로 두 번 호출되는 것처럼 동일하게 작동합니다. </font><font style="vertical-align: inherit;">이 경우에 우리는 치료할 수 </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 평범한 이전으로 </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 여기서 </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이런이 경우 외관에서 : </font></font> <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이제는 동일한 기능이라고 생각할 수있는 최적화처럼 보입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Итерации в первом случае </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывает </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который прибавит к самому себе </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем </font><font style="vertical-align: inherit;">вызовет </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который сделает то же самое, но добавит </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к себе для каждых </font></font> <code>100000 iterations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Во втором случае мы имеем </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Sum2</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и оба действуют одинаково, как если бы они были одной и той же функцией, вызываемой дважды подряд. </font><font style="vertical-align: inherit;">В этом случае мы можем рассматривать </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как просто старую </font><font style="vertical-align: inherit;">сумму </font></font> <code>Sum</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в этом случае выглядит следующим образом: </font></font> <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и теперь это выглядит как оптимизация, где мы можем просто считать, что это та же самая функция.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">通过第一种情况的迭代</font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">调用</font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">将添加到其自身</font></font> <code>f(b)</code> ,<font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">然后调用</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">进行相同的操作，但</font><font class="goog-text-highlight" style="vertical-align: inherit;">每进行</font> <code>100000 iterations</code> <font class="goog-text-highlight" style="vertical-align: inherit;">将</font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font class="goog-text-highlight" style="vertical-align: inherit;">添加</font><font class="goog-text-highlight" style="vertical-align: inherit;">到自身</font><font class="goog-text-highlight" style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在第二种情况下，我们具有</font> <code>Sum1</code> <font style="vertical-align: inherit;">和</font> <code>Sum2</code> <font style="vertical-align: inherit;">，它们的行为相同，就好像它们是同一函数连续被调用两次一样。</font><font style="vertical-align: inherit;">在这种情况下，我们可以将</font> <code>Sum1</code> <font style="vertical-align: inherit;">和</font> <code>Sum2</code> <font style="vertical-align: inherit;">视为普通旧的</font> <code>Sum</code> <font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">在这种情况下</font><font style="vertical-align: inherit;">，</font> <code>Sum</code> <font style="vertical-align: inherit;">看起来像这样：</font> <code>Sum n=1 : [1,100000] { f(a) = f(a) + f(b); }</code> <font style="vertical-align: inherit;">}</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 现在看来这是一种优化，我们可以认为它是相同的功能。</font></font>

source: The performance drop in the single-loop is what we are observing. And as mentioned, this is due to the alignment which (most likely) causes <strong><em>false aliasing</em></strong> stalls in the processor load/store units.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La ca&iacute;da del rendimiento en el bucle &uacute;nico es lo que estamos observando. </font><font style="vertical-align: inherit;">Y como se mencion&oacute;, esto se debe a la alineaci&oacute;n que (lo m&aacute;s probable) causa </font><font style="vertical-align: inherit;">paradas de </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">alias falso</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en las unidades de carga / almacenamiento del procesador.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">シングルループでのパフォーマンスの低下は、私たちが観察しているものです。</font><font style="vertical-align: inherit;">そして、前述のように、これは（おそらく）</font><font style="vertical-align: inherit;">プロセッサのロード/ストアユニットで</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">偽のエイリアシング</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ストールを</font><font style="vertical-align: inherit;">引き起こすアライメントによるもの</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 루프의 성능 저하가 관찰하고 있습니다. </font><font style="vertical-align: inherit;">언급 한 바와 같이, 이것은 </font><font style="vertical-align: inherit;">프로세서로드 / 스토어 유닛에서 </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가명 앨리어싱을</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 멈추게 </font><font style="vertical-align: inherit;">하는 정렬에 의한 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы наблюдаем падение производительности в одном цикле. </font><font style="vertical-align: inherit;">И, как уже упоминалось, это связано с выравниванием, которое (наиболее вероятно) вызывает </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ложные смещения псевдонимов</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в блоках загрузки / хранения процессора.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们正在观察单循环中的性能下降。</font><font style="vertical-align: inherit;">并且如前所述，这是由于对齐（最有可能）导致</font><font style="vertical-align: inherit;">处理器加载/存储单元中的</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假混叠</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">停顿。</font></font>

source: The question turned out to be of no relevance, as the behavior severely depends on the sizes of the arrays (n) and the CPU cache. So if there is further interest, I rephrase the question:
es: La pregunta resultó no tener relevancia,ya que el comportamiento depende en gran medida del tamaño de las matrices (n)y de la caché de la CPU.Así que si hay más interés,reformulo la pregunta:
ja: この質問は、動作が配列(n)とCPUキャッシュのサイズに大きく依存するため、関連性がないことが判明しました。そこで、もしさらなる興味があれば、質問を言い換えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문제는 어레이의 크기 (n)와 CPU 캐시에 따라 크게 달라 지므로 관련성이없는 것으로 판명되었습니다. </font><font style="vertical-align: inherit;">따라서 더 관심이 있다면, 나는 그 질문을 바꾸어 놓는다.</font></font>
ru: Вопрос оказался несущественным,так как поведение сильно зависит от размеров массивов (n)и процессорного кэша.Поэтому,если есть дальнейший интерес,я перефразирую вопрос:
zh_cn: 这个问题原来没有任何意义,因为这个行为严重依赖于数组的大小(n)和CPU的缓存。所以,如果有进一步的兴趣,我重新提出这个问题。

source: The result using initialized data:
es: El resultado utilizando datos inicializados:
ja: 初期化されたデータを使用した結果です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">초기화 된 데이터를 사용한 결과 :</font></font>
ru: Результат с использованием инициализированных данных:
zh_cn: 使用初始化数据的结果。

source: The result using uninitialized data (this is what Mysticial tested):
es: El resultado usando datos no inicializados (esto es lo que Mysticial probó):
ja: 初期化されていないデータを使った結果(Mysticialがテストしたのはこれです)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">초기화되지 않은 데이터를 사용한 결과 (Mysticial에서 테스트 한 결과) :</font></font>
ru: Результат с использованием неинициализированных данных (это то,что тестировал Mysticial):
zh_cn: 使用未初始化数据的结果(Mysticial就是这样测试的)。

source: The second code don't alternate: it just flow on adjacent addresses twice. This makes all the job to be completed in the cache, invalidating it only after the second loop starts.
es: El segundo código no se alterna:sólo fluye dos veces en direcciones adyacentes.Esto hace que todo el trabajo se complete en el cache,invalidándolo sólo después de que comience el segundo bucle.
ja: 2 番目のコードは交互ではなく、隣接するアドレスに 2 回だけ流れます。これにより、すべてのジョブがキャッシュで完了し、2回目のループが始まった後にのみ無効化されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 코드는 대체되지 않습니다. 인접한 주소에서 두 번만 흐릅니다. </font><font style="vertical-align: inherit;">이렇게하면 모든 작업이 캐시에서 완료되고 두 번째 루프가 시작된 후에 만 ​​무효화됩니다.</font></font>
ru: Второй код не меняется:он просто течет по соседним адресам дважды.Это приводит к тому,что вся работа выполняется в кэше,делая ее недействительной только после начала второго цикла.
zh_cn: 第二个代码不交替:它只是在相邻地址上流过两次。这使得所有的工作都要在缓存中完成,只有在第二次循环开始后才会失效。

source: The second loop involves a lot less cache activity, so it's easier for the processor to keep up with the memory demands.
es: El segundo bucle implica mucha menos actividad de caché,por lo que es más fácil para el procesador mantenerse al día con las demandas de memoria.
ja: 2 番目のループではキャッシュの活動が少なくなるため、プロセッサがメモリ要求に追いつくのが容易になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 루프는 캐시 작업이 훨씬 적으므로 프로세서가 메모리 요구를보다 쉽게 ​​처리 할 수 ​​있습니다.</font></font>
ru: Во втором цикле активность кэша гораздо меньше,поэтому процессору легче справляться с требованиями к памяти.
zh_cn: 第二个循环涉及的缓存活动要少很多,所以处理器更容易跟上内存需求。

source: There are many answers, that led to a lot of discussion, but let's face it: Cache issues can be very complex and are not one dimensional. They depend heavily on the size of the data, so my question was unfair: It turned out to be at a very interesting point in the cache graph.
es: Hay muchas respuestas,que llevaron a mucha discusión,pero afrontémoslo:Los temas de la memoria caché pueden ser muy complejos y no son unidimensionales.Dependen mucho del tamaño de los datos,así que mi pregunta fue injusta:Resultó ser en un punto muy interesante en el gráfico de la caché.
ja: 多くの答えがあり、それが多くの議論を引き起こしましたが、直面してみましょう。キャッシュの問題は非常に複雑で、一次元ではありません。キャッシュ問題はデータのサイズに大きく依存するので、私の質問は不公平でした:キャッシュグラフの非常に興味深いポイントにあることがわかりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캐시에 대한 문제는 매우 복잡하고 일차원 적이 지 않을 수 있습니다. </font><font style="vertical-align: inherit;">그들은 데이터의 크기에 크게 의존하므로 내 질문은 불공평했습니다. 캐시 그래프에서 매우 흥미로운 점으로 밝혀졌습니다.</font></font>
ru: Есть много ответов,которые вызвали много дискуссий,но давайте посмотрим правде в глаза:Вопросы кэша могут быть очень сложными и не являются одномерными.Они сильно зависят от размера данных,поэтому мой вопрос был несправедливым:он оказался в очень интересной точке графика кэша.
zh_cn: 有很多答案,引发了很多讨论,但我们要面对现实。缓存问题可能是非常复杂的,而且不是一个维度的。它们在很大程度上取决于数据的大小,所以我的问题很不公平:原来是在缓存图的一个非常有趣的点上。

source: There seems to be a little confusion/misunderstanding here so I will try to elaborate a little using an example.
es: Parece que hay un poco de confusión y malentendido aquí,así que trataré de elaborar un poco usando un ejemplo.
ja: ここでは少し誤解が生じているようなので、例を挙げて少し詳しく説明してみます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 약간의 혼란 / 오해가있는 것처럼 보이므로 예제를 사용하여 조금 더 자세히 설명하려고 노력할 것입니다.</font></font>
ru: Похоже,что здесь есть небольшое недопонимание,поэтому я постараюсь немного пояснить на примере.
zh_cn: 这里似乎有一点混乱的误解,所以我试着用一个例子来说明一下。
