Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (It shows FLOP/s for different values of <code>n</code>.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Muestra FLOP / s para diferentes valores de </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>n</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">異なる値に対するFLOP / sを示します</font><font style="vertical-align: inherit;">。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font> <code>n</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 값에 대한 FLOP / s를 보여줍니다 </font><font style="vertical-align: inherit;">.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Показывает FLOP / s для разных значений </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（它显示</font></font> <code>n</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不同值的FLOP / s </font><font style="vertical-align: inherit;">。）</font></font>

source: 5 Regions - Explanations
es: 5 Regiones-Explicaciones
ja: 5つの地域-解説
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">5 개 지역-설명</font></font>
ru: 5 Регионы-Пояснения
zh_cn: 5个区域----解释

source: <strike>Here, as the data sizes increases, the amount of relative overhead goes down and the performance "saturates". Here two loops is slower because it has twice as much loop and branching overhead.</strike>
es: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute;, a medida que aumenta el tama&ntilde;o de los datos, la cantidad de sobrecarga relativa disminuye y el rendimiento "se satura". </font><font style="vertical-align: inherit;">Aqu&iacute; dos bucles son m&aacute;s lentos porque tienen el doble de bucles y ramificaciones en la parte superior.</font></font></strike>
ja: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは、データサイズが増加すると、相対的なオーバーヘッドの量が減少し、パフォーマンスが「飽和」します。</font><font style="vertical-align: inherit;">ここで2つのループは、2倍のループと分岐オーバーヘッドがあるため、遅くなります。</font></font></strike>
ko: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 데이터 크기가 증가하면 상대적 오버 헤드의 양이 줄어들고 성능이 "포화"됩니다. </font><font style="vertical-align: inherit;">여기에서 두 개의 루프는 두 배의 루프와 분기 오버 헤드를 갖기 때문에 느립니다.</font></font></strike>
ru: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь при увеличении размеров данных количество относительных накладных расходов уменьшается, а производительность &laquo;насыщается&raquo;. </font><font style="vertical-align: inherit;">Здесь два цикла медленнее, потому что он имеет в два раза больше циклов и ветвлений.</font></font></strike>
zh_cn: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里，随着数据大小的增加，相对开销的数量减少，性能&ldquo;饱和&rdquo;。</font><font style="vertical-align: inherit;">在这里，两个循环比较慢，因为它的循环和分支开销是其两倍。</font></font></strike>

source: <strong>1st Case:</strong> - Only one summation but two independent function calls.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Primer caso:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Solo una suma pero dos llamadas a funciones independientes.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1番目のケース：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -合計は1つだけですが、2つの独立した関数呼び出し。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 경우 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -하나의 요약 만 있고 두 개의 독립적 인 함수 호출.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1-й случай:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - только одно суммирование, но два независимых вызова функций.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第一种情况：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -只有一个求和，但有两个独立的函数调用。</font></font>

source: <strong>2 x Intel Xeon X5482 Harpertown @ 3.2 GHz:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 x Intel Xeon X5482 Harpertown @ 3.2 GHz:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intel Xeon X5482 Harpertown @ 3.2 GHz x 2：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intel Xeon X5482 Harpertown @ 3.2GHz 2 개 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 x Intel Xeon X5482 Harpertown @ 3,2 ГГц:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2个Intel Xeon X5482 Harpertown @ 3.2 GHz：</font></font></strong>

source: <strong>2nd Case:</strong> - Two summations but each has its own function call.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Segundo caso:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dos sumas, pero cada una tiene su propia llamada a la funci&oacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目のケース：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -2つの合計ですが、それぞれに独自の関数呼び出しがあります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 경우 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -두 개의 요약이 있지만 각각 고유 한 함수 호출이 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2-й случай:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - Два суммирования, но у каждого свой вызов функции.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第二种情况：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -两个求和，但每个求和都有自己的函数调用。</font></font>

source: <strong>6.206 seconds</strong> with one loop and <strong>2.116 seconds</strong> with two loops. This reproduces the OP's results exactly.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6.206 segundos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con un bucle y </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2.116 segundos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con dos bucles. </font><font style="vertical-align: inherit;">Esto reproduce los resultados del OP exactamente.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6.206秒</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1つのループとし、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2.116秒</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2つのループを有します。</font><font style="vertical-align: inherit;">これにより、OPの結果が正確に再現されます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6.206 초</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 루프와 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2.116 초</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 개의 루프와. </font><font style="vertical-align: inherit;">이것은 OP의 결과를 정확하게 재현합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6,206 секунды</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с одной петлей и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2,116 секунды</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с двумя петлями. </font><font style="vertical-align: inherit;">Это точно воспроизводит результаты ОП.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一圈为6.206秒</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><strong><font style="vertical-align: inherit;">两圈</font></strong><font style="vertical-align: inherit;">为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2.116秒</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这将准确地再现OP的结果。</font></font>

source: <strong><em>First Case:</em></strong> On first iteration the <code>Boss</code> has to initially go 100 feet to give the order slip to <code>A</code> and <code>A</code> goes off and does his thing, but then the <code>Boss</code> has to travel 500 feet to <code>C</code> to give him his order slip. Then on the next iteration and every other iteration after the <code>Boss</code> has to go back and forth 500 feet between the two.
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Primer caso:</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la primera iteraci&oacute;n, el</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene que ir inicialmente 100 pies para dar el resbal&oacute;n de la orden a</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se apaga y hace lo suyo, pero luego el</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene que viajar 500 pies a</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para darle su resbal&oacute;n de la orden. Luego, en la pr&oacute;xima iteraci&oacute;n y cada dos iteraciones despu&eacute;s de que el</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tenga que ir y venir 500 pies entre los dos.</font></font>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初のケース：</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初のイテレーションでは、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初に100フィート移動してオーダースリップを</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に与える必要が</font><font style="vertical-align: inherit;">あり、</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はオフになって彼の処理を行いますが、その後、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は500フィート移動して</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">移動</font><font style="vertical-align: inherit;">し、オーダースリップを与える必要があります。その後、次のイテレーションと、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が2つの間を500フィート往復しなければならない</font><font style="vertical-align: inherit;">後、イテレーションごとに</font><font style="vertical-align: inherit;">。</font></font>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 사례 :</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 첫 번째 반복의</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 처음에 주문 슬립 제공 100 피트 가야</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고</font></font> <code>A</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 꺼지고 자신의 일을하지만, 다음</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 500 발을 여행하는</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그에게 자신의 주문 전표를 제공 할 수 있습니다. 그런 다음 다음 반복 및</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이후</font><font style="vertical-align: inherit;">두 번의 500 피트 앞뒤로</font><font style="vertical-align: inherit;">모든 반복이 반복</font><font style="vertical-align: inherit;">됩니다.</font></font>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Первый случай:</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на первой итерации</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен сначала пройти 100 футов, чтобы отдать ордер</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> уходит и делает свое дело, но затем</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен пройти 500 футов к</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы дать ему ордер. Затем на следующей итерации и на каждой другой итерации после того, как</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен идти вперед и назад на 500 футов между ними.</font></font>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第一种情况：</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第一次迭代中，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须先走100英尺才能将订单单交给</font></font> <code>A</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">离开并做他的事，但随后</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须走500英尺到</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">才能给他单订单。然后在下一次迭代中，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之后的所有其他迭代必须在</font><font style="vertical-align: inherit;">两者之间来回500英尺。</font></font>
