Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>It might also be interesting to point out the differences between CPU/cache architectures, by providing a similar graph for these CPUs.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n podr&iacute;a ser interesante se&ntilde;alar las diferencias entre las arquitecturas de CPU / cach&eacute;, proporcionando un gr&aacute;fico similar para estas CPU.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらのCPUについて同様のグラフを提供することにより、CPU /キャッシュアーキテクチャの違いを指摘することも興味深いかもしれません。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 CPU에 대해 유사한 그래프를 제공하여 CPU / 캐시 아키텍처의 차이점을 지적하는 것도 흥미로울 수 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также было бы интересно указать на различия между архитектурами ЦП и кэш-памяти, предоставляя подобный график для этих ЦП.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过为这些CPU提供类似的图形来指出CPU /缓存体系结构之间的差异也可能很有趣。</font></font></strong>

source: <strong>Let's Investigate</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Investiguemos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">調べよう</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조사합시다</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Давайте расследовать</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">让我们调查一下</font></font></strong>

source: <strong>Our Assertions:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nuestras afirmaciones:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私たちの主張：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리의 주장 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наши утверждения:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们的断言：</font></font></strong>

source: <strong>Regarding These Questions</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sobre estas preguntas</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらの質問について</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 질문들에 대하여</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Относительно этих вопросов</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关于这些问题</font></font></strong>

source: <strong>Region 1:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regi&oacute;n 1:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地域1：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 1 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Регион 1:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区域1：</font></font></strong>

source: <strong>Region 2:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regi&oacute;n 2:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地域2：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 2 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Регион 2:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区域2：</font></font></strong>

source: <strong>Region 3:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regi&oacute;n 3:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地域3：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 3 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Регион 3:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区域3：</font></font></strong>

source: <strong>Region 4:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regi&oacute;n 4:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地域4：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 4 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Регион 4:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区域4：</font></font></strong>

source: <strong>Region 5:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Regi&oacute;n 5:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地域5：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 5 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Регион 5:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区域5：</font></font></strong>

source: <strong>Summary with Analogy</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Resumen con analog&iacute;a</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">類推のまとめ</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유추로 요약</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Резюме с аналогией</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类比总结</font></font></strong>

source: <strong>The Algorithms:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los algoritmos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アルゴリズム：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알고리즘 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Алгоритмы:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">算法：</font></font></strong>

source: <strong>The Approach</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El enfoque</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">アプローチ</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">접근</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подход</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该方法</font></font></strong>

source: <strong>The Comparison of Arbitrary Values</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La comparaci&oacute;n de valores arbitrarios</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意の値の比較</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임의의 가치 비교</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сравнение произвольных значений</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意值的比较</font></font></strong>

source: <strong>The Consideration</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La consideraci&oacute;n</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考察</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고려 사항</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рассмотрение</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考虑</font></font></strong>

source: <strong>The Difference In Distances Traveled</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La diferencia en distancias recorridas</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">走行距離の違い</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이동 거리의 차이</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Разница в пройденных расстояниях</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">行驶距离的差异</font></font></strong>

source: <strong>The Ending Results</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los resultados finales</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エンディング結果</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결말 결과</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Конечные результаты</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最终结果</font></font></strong>

source: <strong>The OPs Amended Question(s)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los PO preguntas enmendadas</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OPは質問を修正しました</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP 수정 된 질문</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Измененные вопросы ОП</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP修订的问题</font></font></strong>

source: <strong>The Observation:</strong> - <em>The differences between the two algorithms</em>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La observaci&oacute;n:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las diferencias entre los dos algoritmos</font></font></em>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">観察：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2つのアルゴリズムの間の違い</font></font></em>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관찰 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 알고리즘의 차이점</font></font></em>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наблюдение:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Различия между двумя алгоритмами</font></font></em>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">观察结果：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两种算法之间的差异</font></font></em>

source: <strong>The Original Question</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La pregunta original</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元の質問</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 질문</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оригинальный вопрос</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原始问题</font></font></strong>

source: <strong>The Perspective</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La perspectiva</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パースペクティブ</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관점</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Перспектива</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">观点</font></font></strong>

source: <strong>The Test Cases:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los casos de prueba:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テストケース：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트 사례 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тестовые случаи:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">测试案例：</font></font></strong>

source: <strong>What We Do Know</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo que sabemos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私たちが知っていること</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리가 아는 것</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Что мы знаем</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们所知道的</font></font></strong>

source: <strong>What We Don't Know</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo que no sabemos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私たちが知らないこと</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리가 모르는 것</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Что мы не знаем</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们不知道的</font></font></strong>

source: @Mysticial's answer convinced a lot of people (including me), probably because it was the only one that seemed to rely on facts, but it was only one "data point" of the truth.
es: La respuesta de Myticial convenció a mucha gente (incluyéndome a mí),probablemente porque era la única que parecía basarse en hechos,pero era sólo un "punto de datos" de la verdad.
ja: @Mysticialさんの回答は、事実を頼りにしているように見えたからか、多くの人(私も含めて)を納得させましたが、それは真実の「データポイント」の1つに過ぎませんでした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Mysticial의 대답은 많은 사람들 (나를 포함하여)을 설득했습니다. 아마도 그것이 사실에 의존하는 것처럼 보이는 유일한 사람이었을 것입니다. 그러나 그것은 진실의 한 "데이터 포인트"일뿐입니다.</font></font>
ru: Ответ @Mysticial убедил многих людей (в том числе и меня),наверное,потому,что он был единственным,кто,казалось бы,полагался на факты,но это была только одна "точка данных" правды.
zh_cn: @Mysticial的回答说服了很多人(包括我在内),可能是因为它是唯一一个看似依赖事实的答案,但它只是真相的一个 "数据点"。

source: A straight assignment with no computation would be a cleaner test of memory access time and would create a test that is uniform irrespective of the loop count. Maybe I missed something in the conversation, but it is worth thinking twice about. If the plus is left out of the assignment, the cumulative time is almost identical at 31 seconds each.
es: Una asignación recta sin cálculo sería una prueba más limpia del tiempo de acceso a la memoria y crearía una prueba uniforme independientemente del número de bucles.Tal vez me perdí algo en la conversación,pero vale la pena pensarlo dos veces.Si se deja el plus fuera de la asignación,el tiempo acumulado es casi idéntico a 31 segundos cada uno.
ja: 計算をしないストレートな代入の方が、メモリアクセス時間のテストとしてはよりクリーンで、ループ数に関係なく一様なテストを作ることができるでしょう。会話の中で見落としていたのかもしれませんが、よく考えてみる価値はあります。プラスを代入から外した場合、累積時間はそれぞれ31秒でほぼ同じになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계산이없는 직접 할당은 메모리 액세스 시간을보다 명확하게 테스트하는 것으로 루프 수에 관계없이 균일 한 테스트를 생성합니다. </font><font style="vertical-align: inherit;">대화에서 뭔가를 놓쳤을 수도 있지만 두 번 생각할 가치가 있습니다. </font><font style="vertical-align: inherit;">더하기가 할당에서 제외되면 누적 시간은 각각 31 초에서 거의 동일합니다.</font></font>
ru: Прямое задание без вычислений было бы более чистым тестом времени доступа к памяти и создало бы тест,который был бы равномерным независимо от количества циклов.Может быть,я что-то пропустил в разговоре,но стоит подумать об этом дважды.Если плюс не включить в задание,то кумулятивное время будет почти одинаковым на 31 секунду каждое.
zh_cn: 没有计算的直接赋值会是一个更干净的内存访问时间测试,而且会产生一个不考虑循环数的统一测试。也许是我在谈话中漏掉了什么,但这是值得深思的。如果把加法遗漏在赋值中,累计时间几乎是一致的,每次31秒。

source: After looking at the code for a while it became quite apparent what the problem is and what is generating it. Lets break this down into an algorithmic problem and look at it from the perspective of using mathematical notations then apply an analogy to the math problems as well as to the algorithms.
es: Después de mirar el código por un tiempo se hizo bastante evidente cuál es el problema y qué lo está generando.Desglosemos esto en un problema algorítmico y mirémoslo desde la perspectiva del uso de las notaciones matemáticas y luego apliquemos una analogía a los problemas matemáticos así como a los algoritmos.
ja: しばらくコードを見ていると、何が問題で、何がそれを生成しているのかが明らかになりました。これをアルゴリズムの問題に分解して、数学的な表記法を使用する観点から見て、数学の問題とアルゴリズムにアナロジーを適用してみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드를 잠시 살펴본 후 문제가 무엇인지, 코드가 생성되는 것이 분명해졌습니다. </font><font style="vertical-align: inherit;">이것을 알고리즘 문제로 세분화하고 수학 표기법을 사용하는 관점에서 본 다음 수학 문제와 알고리즘에 비유를 적용합니다.</font></font>
ru: После ознакомления с кодом на некоторое время стало совершенно очевидно,в чем проблема и что его генерирует.Давайте разберемся на алгоритмическую проблему и посмотрим на нее с точки зрения использования математических нотаций,а затем проведем аналогию с математическими проблемами,а также с алгоритмами.
zh_cn: 看了一段时间的代码后,问题是什么,是什么产生的,就很明显了。让我们把这个问题分解成一个算法问题,从使用数学符号的角度来看,然后应用类比的方式来看待这个问题,同时也是算法问题。
