Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As I have demonstrated without a doubt, there is an underlying issue even before the Hardware and Software becomes involved. Now as for the management of memory and caching along with page files, etc. which all works together in an integrated set of systems between: <code>The Architecture</code> { Hardware, Firmware, some Embedded Drivers, Kernels and ASM Instruction Sets }, <code>The OS</code>{ File and Memory Management systems, Drivers and the Registry }, <code>The Compiler</code> { Translation Units and Optimizations of the Source Code }, and even the <code>Source Code</code> itself with its set(s) of distinctive algorithms; we can already see that there is a bottleneck that is happening within the first algorithm before we even apply it to any machine with any arbitrary <code>Architecture</code>, <code>OS</code>, and <code>Programmable Language</code> compared to the second algorithm. So there already existed a problem before involving the intrinsics of a modern computer.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como he demostrado sin lugar a dudas, hay un problema subyacente incluso antes de que el Hardware y el Software se involucren. Ahora, en cuanto a la gesti&oacute;n de la memoria y el almacenamiento en cach&eacute; junto con los archivos de p&aacute;gina, etc., que funcionan juntos en un conjunto integrado de sistemas entre: </font></font> <code>The Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {Hardware, Firmware, algunos controladores integrados, Kernels y conjuntos de instrucciones ASM}, </font></font> <code>The OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {File y sistemas de gesti&oacute;n de memoria, controladores y registro}, </font></font> <code>The Compiler</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {Unidades de traducci&oacute;n y optimizaciones del c&oacute;digo fuente}, e incluso el </font><font style="vertical-align: inherit;">propio </font></font> <code>Source Code</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con su (s) conjunto (s) de algoritmos distintivos; ya podemos ver que hay un cuello de botella que est&aacute; ocurriendo dentro del primer algoritmo incluso antes de aplicarlo a cualquier m&aacute;quina con cualquier arbitrario</font></font> <code>Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Programmable Language</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comparaci&oacute;n con el segundo algoritmo. </font><font style="vertical-align: inherit;">Entonces ya exist&iacute;a un problema antes de involucrar a los intr&iacute;nsecos de una computadora moderna.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が疑いなく実証したように、ハードウェアとソフトウェアが関与する前でさえ、根本的な問題があります。次に、メモリの管理やページファイルなどのキャッシュの管理については、統合されたシステムのセットですべて一緒に機能します</font></font> <code>The Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {ハードウェア、ファームウェア、一部の組み込みドライバ、カーネル、ASM命令セット}、</font></font> <code>The OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {ファイルメモリー管理システム、ドライバーとレジストリ}、</font></font> <code>The Compiler</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {ソースコードの翻訳単位と最適化}、さらに</font><font style="vertical-align: inherit;">は特徴的なアルゴリズムのセットを持つ</font></font> <code>Source Code</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自体。任意のマシンに適用する前に、最初のアルゴリズム内でボトルネックが発生していることをすでに確認できます。</font></font> <code>Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目のアルゴリズムと比較した</font><font style="vertical-align: inherit;">アーキテクチャ</font><font style="vertical-align: inherit;">、</font></font> <code>OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>Programmable Language</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ですから、現代​​のコンピューターの本質を巻き込む前に、すでに問題が存在していました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의심의 여지없이 시연 한 바와 같이 하드웨어 및 소프트웨어가 관여되기 전에도 근본적인 문제가 있습니다. 메모리와 캐싱은 페이지 파일과 함께 캐싱 할 수 있습니다. 페이지 파일 등은 모두 </font></font> <code>The Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {하드웨어, 펌웨어, 일부 임베디드 드라이버, 커널 및 ASM 명령어 세트}, </font></font> <code>The OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {파일 </font><font style="vertical-align: inherit;">사이의 통합 된 시스템 세트에서 함께 작동합니다. </font><font style="vertical-align: inherit;">및 메모리 관리 시스템, 드라이버 및 레지스트리}, </font></font> <code>The Compiler</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {소스 코드의 번역 단위 및 최적화}, 심지어 </font><font style="vertical-align: inherit;">고유 알고리즘 세트가 </font><font style="vertical-align: inherit;">있는 </font></font> <code>Source Code</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자체; 우리는 임의 알고리즘을 가진 머신에 적용하기 전에 첫 번째 알고리즘 내에서 병목 현상이 발생하고 있음을 이미 알 수 있습니다.</font></font> <code>Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 알고리즘과 비교 한 </font><font style="vertical-align: inherit;">아키텍처</font><font style="vertical-align: inherit;"> , </font></font> <code>OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Programmable Language</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 현대 컴퓨터의 본질을 다루기 전에 이미 문제가있었습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Без сомнения, я продемонстрировал, что существует проблема, лежащая в основе еще до того, как будут задействованы аппаратное и программное обеспечение. Теперь что касается управления памятью и кэшированием вместе с файлами подкачки и т. Д., Которые все работают вместе в интегрированном наборе систем: </font></font> <code>The Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {аппаратное обеспечение, микропрограмма, некоторые встроенные драйверы, ядра и наборы инструкций ASM}, </font></font> <code>The OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {файл и системы управления памятью, драйверы и реестр}, </font></font> <code>The Compiler</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {единицы перевода и оптимизации исходного кода} и даже сам </font></font> <code>Source Code</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с его набором (-ами) отличительных алгоритмов; мы уже можем видеть, что в первом алгоритме есть узкое место, прежде чем мы даже применим его к любой машине с любым произвольным</font></font> <code>Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Programmable Language</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> по сравнению со вторым алгоритмом. </font><font style="vertical-align: inherit;">Таким образом, уже существовала проблема до того, как были задействованы особенности современного компьютера.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如我毫无疑问地证明的那样，甚至在涉及硬件和软件之前就存在一个潜在的问题。现在，有关内存和缓存以及页面文件等的管理，它们都在以下系统之间的集成系统中协同工作：</font></font> <code>The Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {硬件，固件，某些嵌入式驱动程序，内核和ASM指令集}，</font></font> <code>The OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {文件以及内存管理系统，驱动程序和注册表}，</font></font> <code>The Compiler</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> {源代码的翻译单元和优化}，甚至</font></font> <code>Source Code</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本身及其独特算法集；我们已经看到在第一个算法中存在瓶颈，甚至在将它应用于任何具有任意</font></font> <code>Architecture</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与第二种算法相比</font><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">体系结构</font><font style="vertical-align: inherit;">，</font></font> <code>OS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Programmable Language</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，在涉及现代计算机的内在要素之前已经存在一个问题。</font></font>

source: As you might expect, initializing <code>b</code> and <code>d</code> inside the loop using <code>InitToZero[j]</code> gave the combined approach an advantage, as they were done back-to-back before the assignments to <code>a</code> and <code>c</code>, but still within 10%. Go figure.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como es de esperar, la inicializaci&oacute;n de </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el interior del bucle utilizando </font></font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dio el enfoque combinado una ventaja, ya que se realizaron espalda con espalda antes de las asignaciones a </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero a&uacute;n dentro de 10%. </font><font style="vertical-align: inherit;">Imag&iacute;nate.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご</font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用してループ内で</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>d</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">初期化</font> <code>a</code> <font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">a</font><font style="vertical-align: inherit;">と</font> <code>c</code> <font style="vertical-align: inherit;">への割り当ての前にバックツーバックで実行されていましたが</font><font style="vertical-align: inherit;">、10％以内であっ</font><font style="vertical-align: inherit;">たため、このアプローチには利点がありました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">図を行きます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예상 한 바와 같이, </font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"> 사용하여 루프 내에서 </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>d</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 초기화 </font><font style="vertical-align: inherit;">하면 </font> <code>a</code> <font style="vertical-align: inherit;"> 와 </font> <code>c</code> 에<font style="vertical-align: inherit;"> 할당되기 전에 연속적으로 수행 </font><font style="vertical-align: inherit;">되었지만 여전히 10 % 내 </font><font style="vertical-align: inherit;">에서 결합 된 접근 방식에 이점이있었습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그림을 이동.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как и следовало ожидать, инициализация </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри цикла с использованием </font></font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> дала комбинированному подходу преимущество, так как они выполнялись вплотную перед присвоением </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но все еще в пределах 10%. </font><font style="vertical-align: inherit;">Пойди разберись.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如您所料，</font><font style="vertical-align: inherit;">使用</font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;">在循环内</font><font style="vertical-align: inherit;">初始化</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d</code> 可以<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使组合方法具有优势，因为它们是在分配给</font> <code>a</code> <font style="vertical-align: inherit;">和</font> <code>c</code> <font style="vertical-align: inherit;">之前背对背完成的</font><font style="vertical-align: inherit;">，但仍在10％以内。</font><font style="vertical-align: inherit;">去搞清楚。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Assuming a fairly dumb caching policy of <em>if the byte is not in the cache, put it there and get the following byte too while we are at it</em> you will get a scenario something like this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Suponiendo una pol&iacute;tica de almacenamiento en cach&eacute; bastante tonta de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">si el byte no est&aacute; en el cach&eacute;, p&oacute;ngalo all&iacute; y obtenga el siguiente byte tambi&eacute;n mientras estamos en &eacute;l</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , obtendr&aacute; un escenario como este:</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バイトがキャッシュにない場合の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">かなりおかしいキャッシングポリシーを想定すると、</font><em><font style="vertical-align: inherit;">そこにそれを置いて、次のバイトも</font></em><font style="vertical-align: inherit;">取得します。このようなシナリオ</font><em><font style="vertical-align: inherit;">が表示され</font></em><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바이트가 캐시에없는 경우</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 상당히 멍청한 캐싱 정책을 가정하면 </font><em><font style="vertical-align: inherit;">거기에 넣고 다음 바이트를 가져 와서 다음과 같은</font></em><font style="vertical-align: inherit;"> 시나리오를 얻습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предполагая довольно глупую политику кэширования, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">если байт не находится в кеше, поместите его туда и получите следующий байт, пока мы на нем,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы получите сценарий примерно такой:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设一个相当愚蠢的缓存策略是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果该字节不在缓存中，则将其放在那里并在我们处于缓存状态时也获取下一个字节，</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您将看到类似以下的情况：</font></font>

source: Assuming a simple LIFO caching policy, this code:
es: Asumiendo una simple política de caché LIFO,este código:
ja: 単純なLIFOキャッシングポリシーを仮定すると、このコードは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 LIFO 캐싱 정책을 가정하면 다음 코드는 다음과 같습니다.</font></font>
ru: Предполагая простую политику кэширования LIFO,этот код:
zh_cn: 假设一个简单的LIFO缓存策略,这个代码。

source: At this point, nothing fits in cache. So you're bound by memory bandwidth.
es: En este punto,nada cabe en el caché.Así que estás limitado por el ancho de banda de la memoria.
ja: この時点では、キャッシュには何も収まらない。つまり、メモリ帯域に縛られているということですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 시점에서 캐시에 맞는 것은 없습니다. </font><font style="vertical-align: inherit;">따라서 메모리 대역폭에 구속됩니다.</font></font>
ru: На данный момент ничто не помещается в кэш.Значит,вы ограничены пропускной способностью памяти.
zh_cn: 这时,缓存里没有什么东西能装得下。所以,你被内存带宽所束缚。

source: At this point, the data no longer fits in L1 cache. So performance is capped by the L1 &lt;-&gt; L2 cache bandwidth.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En este punto, los datos ya no caben en el cach&eacute; L1. </font><font style="vertical-align: inherit;">Por lo tanto, el rendimiento est&aacute; limitado por el ancho de banda de cach&eacute; L1 &lt;-&gt; L2.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この時点で、データはL1キャッシュに収まりません。</font><font style="vertical-align: inherit;">したがって、パフォーマンスはL1 &lt;-&gt; L2キャッシュ帯域幅によって制限されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 시점에서 데이터는 더 이상 L1 캐시에 맞지 않습니다. </font><font style="vertical-align: inherit;">따라서 성능은 L1 &lt;-&gt; L2 캐시 대역폭에 의해 제한됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На этом этапе данные больше не помещаются в кэш L1. </font><font style="vertical-align: inherit;">Таким образом, производительность ограничена пропускной способностью кэша L1 &lt;-&gt; L2.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此时，数据不再适合L1缓存。</font><font style="vertical-align: inherit;">因此，性能受L1 &lt;-&gt; L2缓存带宽的限制。</font></font>
