Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If I've guessed correctly on how you are allocating your arrays, they <strong><em>are likely to be aligned to the page line</em></strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si he adivinado correctamente c&oacute;mo est&aacute; asignando sus matrices, </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es probable que est&eacute;n alineadas con la l&iacute;nea de la p&aacute;gina</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列をどのように割り当てるかについて私が正しく推測した場合、それら</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はページ行に揃えられる可能性があります</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열을 할당하는 방법에 대해 올바르게 짐작했다면 </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">페이지 행에 정렬 될 수 있습니다</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если я правильно угадал, как вы размещаете свои массивы, они </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, скорее всего, будут выровнены по строке страницы</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果我猜对了如何分配数组，则它们</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很可能与page line对齐</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If you noticed <code>F2()</code> only exists in <code>Sum</code> where both <code>Sum1</code> and <code>Sum2</code> only contains <code>F1()</code>. This will also be evident later on as well when we begin to conclude that there is sort of an optimization happening from the second algorithm.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si not&oacute; que </font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo existe en </font></font> <code>Sum</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> donde </font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo contienen </font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Esto tambi&eacute;n ser&aacute; evidente m&aacute;s adelante, cuando comencemos a concluir que se est&aacute; produciendo una especie de optimizaci&oacute;n desde el segundo algoritmo.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">のみ存在し</font><font style="vertical-align: inherit;">、</font></font> <code>Sum1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>Sum2</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方</font><font style="vertical-align: inherit;">に</font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のみが含まれている</font><font style="vertical-align: inherit;">ことに気付いた場合</font><font style="vertical-align: inherit;">。これは、2番目のアルゴリズムから発生する最適化のようなものがあると結論付け始めたときにも明らかになります。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font> <code>Sum1</code> <font style="vertical-align: inherit;"> 과 </font> <code>Sum2</code> <font style="vertical-align: inherit;"> 모두 </font> <code>F1()</code> <font style="vertical-align: inherit;"> 만 포함하는 </font></font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에만 </font><font style="vertical-align: inherit;">있음을 알았습니다 </font><font style="vertical-align: inherit;">. 이것은 두 번째 알고리즘에서 발생하는 최적화가 있다고 결론을 내릴 때 나중에 분명해질 것입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы заметили, что </font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> существует только в </font></font> <code>Sum</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где и </font></font> <code>Sum1</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Sum2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержат только </font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Это также станет очевидным позже, когда мы начнем делать вывод, что со вторым алгоритмом происходит своего рода оптимизация.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您发现</font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅存在于</font> <code>Sum1</code> <font style="vertical-align: inherit;">和</font> <code>Sum2</code> <font style="vertical-align: inherit;">都只包含</font> <code>F1()</code> 的</font> <code>Sum</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font><font style="vertical-align: inherit;">。当我们开始得出结论，第二种算法正在发生某种优化时，这也将在以后显而易见。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Imagine you are working on a machine where <code>n</code> was just the right value for it only to be possible to hold two of your arrays in memory at one time, but the total memory available, via disk caching, was still sufficient to hold all four.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Imagine que est&aacute; trabajando en una m&aacute;quina donde </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> era el valor correcto para que solo fuera posible mantener dos de sus matrices en la memoria al mismo tiempo, pero la memoria total disponible, a trav&eacute;s del almacenamiento en cach&eacute; de disco, todav&iacute;a era suficiente para contener las cuatro.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マシンで作業しているときに、</font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が2つのアレイを一度にメモリに保持できるだけの適切な値であったとしても、ディスクキャッシュを介して利用可能なメモリの合計が4つすべてを保持するにはまだ十分であると</font><font style="vertical-align: inherit;">想像してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 한 번에 두 개의 어레이를 메모리에 보유 할 수있는 유일한 값인 </font><font style="vertical-align: inherit;">머신에서 작업하고 있다고 가정 </font><font style="vertical-align: inherit;">하지만 디스크 캐싱을 통해 사용 가능한 총 메모리는 여전히 4 개를 모두 보유하기에 충분하다고 </font><font style="vertical-align: inherit;">상상해보십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Представьте, что вы работаете на машине, где </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было правильным значением, чтобы можно было одновременно хранить два ваших массива в памяти, но общего объема доступной памяти посредством кэширования на диске все еще было достаточно для хранения всех четырех.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设您在一台机器上工作，而</font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只是一个正确的值，因为它只能一次将两个阵列保存在内存中，但是通过磁盘缓存可用的总内存仍然足以容纳全部四个。</font></font>

source: In both cases we have 4 functions to work with and 2 function calls with 2 operations being done on each function call. So we will set these up as functions and function calls to be <code>F1()</code>, <code>F2()</code>, <code>f(a)</code>, <code>f(b)</code>, <code>f(c)</code> and <code>f(d)</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En ambos casos tenemos 4 funciones para trabajar y 2 llamadas de funci&oacute;n con 2 operaciones que se realizan en cada llamada de funci&oacute;n. </font><font style="vertical-align: inherit;">As&iacute; que los configuraremos como funciones y llamadas de funci&oacute;n para que sean </font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どちらの場合も、処理する4つの関数と2つの関数呼び出しがあり、各関数呼び出しで2つの操作が実行されます。</font><font style="vertical-align: inherit;">したがって、これらを関数および関数呼び出しとして</font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>f(d)</code> になるように設定し<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 경우 모두 작업 할 4 개의 함수와 각 함수 호출마다 2 개의 작업이 수행되는 2 개의 함수 호출이 있습니다. </font><font style="vertical-align: inherit;">따라서 함수 및 함수 호출로 </font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В обоих случаях у нас есть 4 функции для работы и 2 вызова функций с 2 ​​операциями, выполняемыми для каждого вызова функции. </font><font style="vertical-align: inherit;">Таким образом, мы установим их как функции и вызовы функций: </font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这两种情况下，我们都有4个函数可以使用，有2个函数调用，每个函数调用都需要进行2个操作。</font><font style="vertical-align: inherit;">因此，我们将这些函数设置为</font></font> <code>F1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>F2()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
