Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Since we are working with an 8 byte pointer and dealing with Heap allocation let's consider this problem here. Let us say that the <code>Boss</code> is 100 feet from <code>A</code> and that <code>A</code> is 500 feet from <code>C</code>. We don't need to worry about how far the <code>Boss</code> is initially from <code>C</code> because of the order of executions. In both cases the <code>Boss</code> initially travels from <code>A</code> first then to <code>B</code>. This analogy isn't to say that this distance is exact; it is just a use test case scenario to show the workings of the algorithms. In many cases when doing heap allocations and working with the cache and page files, these distances between address locations may not vary that much in differences or they can very significantly depending on the nature of the data types and the array sizes.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dado que estamos trabajando con un puntero de 8 bytes y tratando con la asignaci&oacute;n de Heap, consideremos este problema aqu&iacute;. Digamos que el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; a 100 pies de distancia de </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y que </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es de 500 pies de </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . No tenemos que preocuparnos de cu&aacute;n lejos </font><font style="vertical-align: inherit;">est&aacute; inicialmente </font><font style="vertical-align: inherit;">el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debido al orden de las ejecuciones. En ambos casos, el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> inicialmente viaja de </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> primero a </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Esta analog&iacute;a no quiere decir que esta distancia sea exacta; </font><font style="vertical-align: inherit;">Es solo un caso de prueba de uso para mostrar el funcionamiento de los algoritmos. </font><font style="vertical-align: inherit;">En muchos casos, cuando se realizan asignaciones de almacenamiento din&aacute;mico y se trabaja con el cach&eacute; y los archivos de p&aacute;gina, estas distancias entre las ubicaciones de las direcciones pueden no variar mucho en las diferencias o pueden variar significativamente dependiendo de la naturaleza de los tipos de datos y los tama&ntilde;os de los arreglos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでは8バイトのポインターを使用してヒープ割り当てを処理しているので、ここでこの問題を考えてみましょう。私たちがいることを言ってみましょう</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から100フィートである</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とすることを</font></font> <code>A</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から500フィートである</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">実行の順序のために、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が最初に</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">どれだけ離れているかについて心配する必要はありません</font><font style="vertical-align: inherit;">。どちらの場合も、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初に</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">最初に</font></font> <code>B</code> に移動します<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このアナロジーは、この距離が正確であると言っているのではありません。</font><font style="vertical-align: inherit;">これは、アルゴリズムの動作を示すための使用テストケースシナリオにすぎません。</font><font style="vertical-align: inherit;">ヒープの割り当てを行い、キャッシュファイルとページファイルを操作する場合、多くの場合、アドレスの場所間のこれらの距離は、それほど大きな違いはないか、データ型と配列サイズの性質に応じて非常に大きく変化します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 8 바이트 포인터로 작업하고 힙 할당을 다루기 때문에 여기 에서이 문제를 고려해 봅시다. </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 100 피트 </font><font style="vertical-align: inherit;">이고 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 500 피트 </font><font style="vertical-align: inherit;">라고 가정하겠습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">실행 순서로 인해 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 처음에 </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로부터 </font><font style="vertical-align: inherit;">얼마나 멀리 떨어져 있는지 걱정할 필요가 없습니다 </font><font style="vertical-align: inherit;">. 두 경우 모두 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 처음에 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font></font> <code>B</code> 로 이동합니다.<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 비유는이 거리가 정확하다고 말하는 것은 아닙니다. </font><font style="vertical-align: inherit;">알고리즘의 작동을 보여주는 것은 단지 테스트 케이스 시나리오 일뿐입니다. </font><font style="vertical-align: inherit;">많은 경우 힙 할당을 수행하고 캐시 및 페이지 파일을 사용할 때 주소 위치 간의 거리는 크게 다르지 않거나 데이터 유형의 특성 및 배열 크기에 따라 크게 달라질 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Так как мы работаем с 8-байтовым указателем и имеем дело с распределением кучи, давайте рассмотрим эту проблему здесь. Будем говорить , </font><font style="vertical-align: inherit;">что </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 100 футов от </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font><font style="vertical-align: inherit;">составляет 500 футов от </font> <code>C</code> <font style="vertical-align: inherit;"> . Нам не нужно беспокоиться о том, как далеко </font> <code>Boss</code> <font style="vertical-align: inherit;"> изначально от </font> <code>C</code> <font style="vertical-align: inherit;"> из-за порядка выполнения. В обоих случаях </font> <code>Boss</code> <font style="vertical-align: inherit;"> сначала путешествует из </font> <code>A</code> <font style="vertical-align: inherit;"> затем в </font> <code>B</code> </font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Эта аналогия не говорит о том, что это расстояние является точным; </font><font style="vertical-align: inherit;">это всего лишь сценарий тестового использования, чтобы показать работу алгоритмов. </font><font style="vertical-align: inherit;">Во многих случаях при распределении кучи и работе с кешем и файлами подкачки эти расстояния между адресами могут не сильно различаться или могут очень сильно зависеть от характера типов данных и размеров массива.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于我们正在使用8字节指针并处理堆分配，因此我们在这里考虑此问题。让我们说，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是从100英尺</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从500英尺</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">由于执行的顺序，</font><font style="vertical-align: inherit;">我们不必担心</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初与</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的距离。在这两种情况下，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初</font><font style="vertical-align: inherit;">都是</font><font style="vertical-align: inherit;">从</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">先行然后到</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这个比喻并不是说这个距离是准确的。</font><font style="vertical-align: inherit;">这只是一个用例，可以说明算法的工作原理。</font><font style="vertical-align: inherit;">在许多情况下，当进行堆分配以及使用缓存和页面文件时，地址位置之间的距离差异可能不会有太大变化，或者取决于数据类型和数组大小的性质，它们之间的差异可能非常明显。</font></font>

source: So by these numbers it would almost look as if Algorithm One should be 99% slower than Algorithm Two; however, this is only the <code>The Boss's</code> part or responsibility of the algorithms and it doesn't account for the actual workers <code>A</code>, <code>B</code>, <code>C</code>, &amp; <code>D</code> and what they have to do on each and every iteration of the Loop. So the bosses job only accounts for about 15 - 40% of the total work being done. So the bulk of the work which is done through the workers has a slight bigger impact towards keeping the ratio of the speed rate differences to about 50-70%
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, seg&uacute;n estos n&uacute;meros, casi parecer&iacute;a que el Algoritmo Uno deber&iacute;a ser 99% m&aacute;s lento que el Algoritmo Dos; </font><font style="vertical-align: inherit;">sin embargo, esto es solo la </font><font style="vertical-align: inherit;">parte o la responsabilidad de </font></font> <code>The Boss's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de los algoritmos y no tiene en cuenta los trabajadores reales </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y lo que tienen que hacer en cada iteraci&oacute;n del Loop. </font><font style="vertical-align: inherit;">Por lo tanto, el trabajo de los jefes solo representa entre el 15 y el 40% del trabajo total realizado. </font><font style="vertical-align: inherit;">Por lo tanto, la mayor parte del trabajo que se realiza a trav&eacute;s de los trabajadores tiene un impacto ligeramente mayor para mantener la proporci&oacute;n de las diferencias de velocidad en aproximadamente 50-70%</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、これらの数値では、アルゴリズム1はアルゴリズム2よりも99％遅いかのように見えます。</font><font style="vertical-align: inherit;">ただし、これは</font></font> <code>The Boss's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">役割またはアルゴリズムの責任に過ぎず、実際のワーカー</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と、ループのすべての反復で何をしなければならないか</font><font style="vertical-align: inherit;">は考慮されていません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">したがって、ボスの仕事は、行われている仕事全体の約15〜40％しか占めていません。</font><font style="vertical-align: inherit;">そのため、ワーカーを介して行われる作業の大部分は、速度率の差の比率を約50〜70％に維持することに少し大きな影響を与えます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서이 숫자로 보면 알고리즘 1은 알고리즘 2보다 99 % 느려 야합니다. </font><font style="vertical-align: inherit;">그러나 이것은 </font><font style="vertical-align: inherit;">알고리즘에 대한 </font></font> <code>The Boss's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 책임 또는 책임 일 뿐이며 실제 작업자 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 루프의 모든 반복에서 수행해야 할 작업을 설명하지는 않습니다. </font><font style="vertical-align: inherit;">따라서 보스 작업은 총 작업 중 약 15-40 % 만 차지합니다. </font><font style="vertical-align: inherit;">따라서 근로자를 통해 수행되는 대부분의 작업은 속도 차이의 비율을 약 50-70 %로 유지하는 데 약간 더 큰 영향을 미칩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, по этим числам это будет выглядеть так, как будто Алгоритм Один должен быть на 99% медленнее, чем Алгоритм Два; </font><font style="vertical-align: inherit;">однако, это только </font><font style="vertical-align: inherit;">часть или ответственность </font></font> <code>The Boss's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> за алгоритмы, и она не учитывает фактических работников </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и то, что они должны делать на каждой итерации цикла. </font><font style="vertical-align: inherit;">Таким образом, на работу боссов приходится всего около 15-40% всей выполняемой работы. </font><font style="vertical-align: inherit;">Таким образом, основная часть работы, выполняемой рабочими, оказывает чуть большее влияние на поддержание соотношения разности скоростей примерно до 50-70%.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，根据这些数字，似乎算法一的速度应该比算法二的速度慢99％；</font><font style="vertical-align: inherit;">但是，这仅是</font></font> <code>The Boss's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一部分或算法的责任，它没有考虑实际的工作人员</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以及他们在Loop的每次迭代中要做的事情。</font><font style="vertical-align: inherit;">因此，老板的工作仅占完成工作总数的15-40％。</font><font style="vertical-align: inherit;">因此，通过工人完成的大部分工作对于将速度差异率保持在50％到70％之间有较大的影响。</font></font>

source: So trying to have the <code>Boss</code> focusing on doing two similar things at once and juggling them back and forth instead of focusing on similar consecutive tasks is going to make him quite angry by the end of the day because he had to travel and work twice as much. Therefor do not lose the scope of the situation by letting your boss getting into an interpolated bottleneck because the boss's spouse and children wouldn't appreciate it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, tratar de hacer que el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> concentre en hacer dos cosas similares a la vez y hacer malabares entre ellas en lugar de centrarse en tareas consecutivas similares lo har&aacute; enojar bastante al final del d&iacute;a porque tuvo que viajar y trabajar el doble. . </font><font style="vertical-align: inherit;">Por lo tanto, no pierda el alcance de la situaci&oacute;n permitiendo que su jefe se meta en un cuello de botella interpolado porque el c&oacute;nyuge y los hijos del jefe no lo apreciar&iacute;an.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ですから、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じような2つのことを同時に行うことに集中してもらい、同じような連続したタスクに集中するのではなく、前後にジャグリングしようとすると、1日の終わりまでに2倍の旅行と仕事をしなければならなかったので、彼はかなり怒ります。 。</font><font style="vertical-align: inherit;">そのため、上司の配偶者や子供がそれを高く評価することはないため、上司を補間されたボトルネックに陥らせて状況の範囲を失わないでください。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 비슷한 두 가지 일에 집중하고 비슷한 연속 작업에 집중하는 대신 앞뒤로 저글링하도록 노력하는 것은 여행과 일을 두 배로 늘려야했기 때문에 하루가 끝날 때 그를 화나게 할 것입니다. . </font><font style="vertical-align: inherit;">따라서 상사의 배우자와 자녀가 그것을 인정하지 않기 때문에 상사가 보간 된 병목에 빠지게함으로써 상황의 범위를 잃지 마십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поэтому попытка заставить </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сосредоточиться на двух одинаковых вещах одновременно и жонглировать ими взад и вперед вместо того, чтобы концентрироваться на похожих последовательных задачах, к концу дня заставит его сильно рассердиться, потому что ему пришлось путешествовать и работать вдвое больше. , </font><font style="vertical-align: inherit;">Поэтому не теряйте масштаб ситуации, позволяя вашему боссу попасть в сложное узкое место, потому что супруга и дети босса этого не оценят.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，试图让</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">专注于做两件事，而不是专注于连续完成类似的事情，而不是专注于相继的任务，这会使他在一天结束前很生气，因为他不得不旅行和工作两倍。</font><font style="vertical-align: inherit;">因此，不要让您的老板陷入插补的瓶颈，因为老板的配偶和子女不会对此感到高兴。</font></font>

source: Suppose <code>a1</code>, <code>b1</code>, <code>c1</code>, and <code>d1</code> point to heap memory and my numerical code has the following core loop.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Supongamos que </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> apuntan a la memoria de almacenamiento din&aacute;mico y mi c&oacute;digo num&eacute;rico tiene el siguiente bucle central.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仮定する</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、及び</font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヒープメモリをポイントし、私の数値コードは、以下のコアループを有しています。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 힙 메모리를 가리키고 숫자 코드에 다음 코어 루프가 </font><font style="vertical-align: inherit;">있다고 가정하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предположим, что </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> указывают на память кучи, и мой числовой код имеет следующий основной цикл.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指向堆内存，而我的数字代码具有以下核心循环。</font></font>
