Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In this situation it is the structure of the process of the work being done and it does go to show that <strong>Case 2</strong> is more efficient from both that partial optimization of having a similar function declaration and definition where it is only the variables that differ by name. And we also see that the total distance traveled in <strong>Case 1</strong> is much farther than it is in <strong>Case 2</strong> and we can consider this distance traveled our <em>Time Factor</em> between the two algorithms. <strong>Case 1</strong> has considerable more work to do than <strong>Case 2</strong> does. This was also seen in the evidence of the <code>ASM</code> that was shown between both cases. Even with what was already said about these cases, it also doesn't account for the fact that in <strong>Case 1</strong> the boss will have to wait for both <code>A</code> &amp; <code>C</code> to get back before he can go back to <code>A</code> again on the next iteration and it also doesn't account for the fact that if <code>A</code> or <code>B</code> is taking an extremely long time then both the <code>Boss</code> and the other worker(s) are also waiting at an idle. In <strong>Case 2</strong> the only one being idle is the <code>Boss</code> until the worker gets back. So even this has an impact on the algorithm.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En esta situaci&oacute;n, es la estructura del proceso del trabajo que se est&aacute; realizando y demuestra que el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Caso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es m&aacute;s eficiente tanto por la optimizaci&oacute;n parcial de tener una declaraci&oacute;n de funci&oacute;n similar como por una definici&oacute;n en la que solo las variables difieren por nombre . Y tambi&eacute;n vemos que la distancia total recorrida en el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es mucho m&aacute;s lejos que en el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y podemos considerar esta distancia recorrida como nuestro </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">factor de tiempo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> entre los dos algoritmos. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene mucho m&aacute;s trabajo que hacer que el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Esto tambi&eacute;n se vio en la evidencia de la </font></font> <code>ASM</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">eso se demostr&oacute; entre ambos casos. </font><font style="vertical-align: inherit;">Incluso con lo que ya se dijo sobre estos casos, tampoco tiene en cuenta el hecho de que en el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el jefe tendr&aacute; que esperar a que </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> vuelvan antes de poder volver a </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la pr&oacute;xima iteraci&oacute;n y Tampoco tiene en cuenta el hecho de que si </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute;n tardando mucho tiempo, tanto el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como los otros trabajadores tambi&eacute;n est&aacute;n esperando en reposo. </font><font style="vertical-align: inherit;">En el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caso 2,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el &uacute;nico que est&aacute; inactivo es el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hasta que el trabajador regrese. </font><font style="vertical-align: inherit;">Entonces, incluso esto tiene un impacto en el algoritmo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この状況では、それは行われている作業のプロセスの構造であり、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、名前が異なる変数のみである同様の関数宣言と定義の部分的な最適化の両方からより効率的で</font><font style="vertical-align: inherit;">あることを示して</font><font style="vertical-align: inherit;">います。また、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1で</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">移動した合計距離は</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">移動した距離</font><font style="vertical-align: inherit;">よりもはるかに遠く</font><font style="vertical-align: inherit;">、2つのアルゴリズム間で</font><font style="vertical-align: inherit;">この</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">時間</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">距離を移動した距離と考えることができ</font><font style="vertical-align: inherit;">ます。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">には、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりもかなり多くの作業が必要です</font><font style="vertical-align: inherit;">。これは</font> <code>ASM</code> の<font style="vertical-align: inherit;">証拠にも見られました</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それは両方のケースの間に示されました。</font><font style="vertical-align: inherit;">これらのケースについてすでに述べたことがあったとしても、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、ボスが</font><font style="vertical-align: inherit;">次のイテレーションで再び</font> <code>A</code> <font style="vertical-align: inherit;">に戻る前に</font><font style="vertical-align: inherit;">、</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>C</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">両方</font><font style="vertical-align: inherit;">が戻るの</font><font style="vertical-align: inherit;">を待たなければならない</font><font style="vertical-align: inherit;">という事実も考慮していません。</font><font style="vertical-align: inherit;">また、</font> <code>A</code> <font style="vertical-align: inherit;">または</font> <code>B</code> に<font style="vertical-align: inherit;">非常に長い時間がかかって</font><font style="vertical-align: inherit;">いる場合</font><font style="vertical-align: inherit;">、</font> <code>Boss</code> <font style="vertical-align: inherit;">と他のワーカーもアイドル状態で待機し</font><font style="vertical-align: inherit;">ているという事実は考慮されていません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">で</font><strong><font style="vertical-align: inherit;">ケース2</font></strong><font style="vertical-align: inherit;">つのみであることのアイドルです</font> <code>Boss</code> <font style="vertical-align: inherit;">労働者が戻って取得するまで。</font><font style="vertical-align: inherit;">したがって、これもアルゴリズムに影響を与えます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 상황에서 그것은 수행되는 작업의 프로세스 구조이며, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 유사한 함수 선언과 정의를 갖는 부분 최적화, 이름에 따라 다른 변수 인 경우보다 더 효율적 </font><font style="vertical-align: inherit;">이라는 것을 보여줍니다. </font><font style="vertical-align: inherit;">. 그리고 우리는 또한에 이동 한 총 거리 볼 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">케이스 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가에있는 것보다 더 많이 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 우리는이 거리가 우리의 여행 고려할 수있는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시간 요소를</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 알고리즘 사이. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 훨씬 더 많은 작업을 수행 </font><font style="vertical-align: inherit;">합니다. 이것은 또한 </font> <code>ASM</code> <font style="vertical-align: inherit;"> 의 증거에서 볼 수 있습니다</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 두 경우 사이에 보여졌습니다. </font><font style="vertical-align: inherit;">이 사례에 대해 이미 언급 한 내용이 있더라도 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 보스가 </font><font style="vertical-align: inherit;">다음 반복 </font><font style="vertical-align: inherit;">에서 </font> <code>A</code> 로<font style="vertical-align: inherit;"> 다시 </font><font style="vertical-align: inherit;">돌아 가기 전에 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">모두 돌아올 때까지 기다려야 </font><font style="vertical-align: inherit;">한다는 사실을 설명하지 않습니다. </font><font style="vertical-align: inherit;">또한 </font> <code>A</code> <font style="vertical-align: inherit;"> 또는 </font> <code>B</code> <font style="vertical-align: inherit;"> 가 매우 오랜 시간이 걸리면 </font> <code>Boss</code> <font style="vertical-align: inherit;"> 와 다른 작업자도 유휴 상태를 기다리고 </font><font style="vertical-align: inherit;">있다는 사실을 고려하지 않습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">에서 </font><strong><font style="vertical-align: inherit;">사례 2</font></strong><font style="vertical-align: inherit;"> 단 하나되는 유휴은입니다 </font> <code>Boss</code> <font style="vertical-align: inherit;"> 노동자가 돌아 오기까지. </font><font style="vertical-align: inherit;">따라서 이것도 알고리즘에 영향을 미칩니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В этой ситуации это структура процесса выполняемой работы, и он показывает, что </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вариант 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> более эффективен как при частичной оптимизации, так и при наличии аналогичного объявления функции и определения, где только переменные различаются по имени. , И мы также видим, что общее расстояние, пройденное в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случае 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , намного больше, чем в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случае 2,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и мы можем считать это расстояние пройденным нашим </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Фактором времени</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> между двумя алгоритмами. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Дело 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> требует </font><font style="vertical-align: inherit;">гораздо больше работы, чем </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">дело 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Это также было видно в доказательстве </font></font> <code>ASM</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это было показано между обоими случаями. </font><font style="vertical-align: inherit;">Даже с учетом того, что уже было сказано об этих случаях, это также не учитывает тот факт, что в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случае 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> боссу придется ждать, пока оба </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернутся, прежде чем он сможет снова вернуться к </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на следующей итерации и это также не учитывает тот факт, что если </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отнимает слишком много времени, то и </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и другие работники также ожидают простоя. </font><font style="vertical-align: inherit;">В </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случае 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> только один бездействует - </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пока рабочий не вернется. </font><font style="vertical-align: inherit;">Так что даже это влияет на алгоритм.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这种情况下，这是工作过程的结构，它确实表明，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比具有部分相似的函数声明和定义的局部优化更为有效，其中仅变量名不同。而且我们还看到，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例1中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">经过的总距离</font><font style="vertical-align: inherit;">比</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例2中的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要远得多</font><font style="vertical-align: inherit;">，我们可以考虑此距离经过</font><font style="vertical-align: inherit;">两种算法之间的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时间因子</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有更多的工作要做</font><font style="vertical-align: inherit;">。在</font> <code>ASM</code> <font style="vertical-align: inherit;">的证据中也可以看到这一点</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两种情况之间都显示出这一点。</font><font style="vertical-align: inherit;">即使已经对这些案例进行了说明，这也不能说明在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中老板必须等待</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都返回，然后才能</font><font style="vertical-align: inherit;">在下一次迭代中再次</font><font style="vertical-align: inherit;">返回</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，如果</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">花费的时间很长，那么</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和其他工作人员也都闲着闲着，</font><font style="vertical-align: inherit;">这也没有考虑到这一事实</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例2中</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，只有一个空闲的人是</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直到工人回来。</font><font style="vertical-align: inherit;">因此，即使这也会影响算法。</font></font>

source: It is already apparent that many have already done this by looking at the heap allocations, bench mark tests, looking at RAM, Cache and Page Files. Looking at specific data points and specific iteration indexes was also included and the various conversations about this specific problem has many people starting to question other related things about it. So how do we begin to look at this problem by using mathematical algorithms and applying an analogy to it? We start off by making a couple of assertions! Then we build out our algorithm from there.
es: Ya es evidente que muchos ya lo han hecho al observar las asignaciones de la pila,las pruebas de referencia,mirando la RAM,la caché y los archivos de página.También se incluyeron puntos de datos específicos e índices de iteración específicos,y las diversas conversaciones sobre este problema específico han hecho que mucha gente empiece a cuestionarse otras cosas relacionadas con él.Entonces,¿cómo empezamos a mirar este problema usando algoritmos matemáticos y aplicándole una analogía? Comenzamos haciendo un par de afirmaciones! Luego construimos nuestro algoritmo a partir de ahí.
ja: ヒープの割り当てを見たり、ベンチマークテストをしたり、RAMやキャッシュ、ページファイルを見たりすることで、すでに多くの人がこれを行っていることが明らかになっています。特定のデータポイントや特定の反復インデックスを見ることも含まれており、この特定の問題に関する様々な会話の中で、多くの人がこの問題に関連する他のことに疑問を持ち始めています。では、どのようにして数学的アルゴリズムを使用し、アナロジーを適用してこの問題を見始めるのでしょうか?まず、いくつかの主張をすることから始めます。そして、そこからアルゴリズムを構築していきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">힙 할당, 벤치 마크 테스트, RAM, 캐시 및 페이지 파일을 보면 많은 사람들이 이미이 작업을 수행했음을 분명히 알 수 있습니다. </font><font style="vertical-align: inherit;">특정 데이터 포인트와 특정 반복 인덱스를 살펴 보았으며이 특정 문제에 대한 다양한 대화를 통해 많은 사람들이 다른 관련 문제에 대해 질문하기 시작했습니다. </font><font style="vertical-align: inherit;">수학 알고리즘을 사용하고 유추를 적용하여이 문제를 어떻게 살펴볼 수 있을까요? </font><font style="vertical-align: inherit;">우리는 몇 가지 주장을 시작하여 시작합니다! </font><font style="vertical-align: inherit;">그런 다음 알고리즘을 구축합니다.</font></font>
ru: Очевидно,что многие уже сделали это,глядя на распределение кучи,стендовые тесты,глядя на оперативную память,кэш-память и файлы страниц.Глядя на конкретные точки данных и конкретные индексы итераций также был включен и различные разговоры об этой конкретной проблеме имеет много людей,начинающих сомневаться в других связанных с этим вещах.Так как же нам начать смотреть на эту проблему,используя математические алгоритмы и применяя аналогию с ней? Начнем с того,что сделаем пару утверждений! Затем мы строим наш алгоритм оттуда.
zh_cn: 通过看堆分配、基准标记测试、看RAM、Cache和Page Files,显然已经有很多人做了这样的事情。看具体的数据点和具体的迭代索引也在其中,关于这个具体问题的各种讨论让很多人开始质疑其他相关的东西。那么,我们该如何开始用数学算法来看待这个问题,并对其进行类比应用呢?我们先从几个断言开始! 然后,我们从这里开始构建出我们的算法。
