Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Compiled on MS <a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions">Visual C++ 10.0</a> with full optimization and <a href="http://en.wikipedia.org/wiki/SSE2">SSE2</a> enabled for 32-bit on a <a href="http://en.wikipedia.org/wiki/Intel_Core_2">Intel Core 2</a> Duo (x64), the first example takes 5.5&nbsp;seconds and the double-loop example takes only 1.9&nbsp;seconds. My question is: (Please refer to the my rephrased question at the bottom)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Compilado en MS </font></font><a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual C ++ 10.0</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con optimizaci&oacute;n completa y </font></font><a href="http://en.wikipedia.org/wiki/SSE2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SSE2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> habilitado para 32 bits en un </font></font><a href="http://en.wikipedia.org/wiki/Intel_Core_2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intel Core 2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Duo (x64), el primer ejemplo toma 5.5 segundos y el ejemplo de doble bucle toma solo 1.9 segundos. </font><font style="vertical-align: inherit;">Mi pregunta es: (Consulte la pregunta formulada en la parte inferior)</font></font>
ja: <font style="vertical-align: inherit;"><a href="http://en.wikipedia.org/wiki/Intel_Core_2"><font style="vertical-align: inherit;">Intel Core 2</font></a><font style="vertical-align: inherit;"> Duo（x64）で</font><font style="vertical-align: inherit;">32ビットに対して</font><font style="vertical-align: inherit;">完全最適化および</font><a href="http://en.wikipedia.org/wiki/SSE2"><font style="vertical-align: inherit;">SSE2を</font></a><font style="vertical-align: inherit;">有効に</font><font style="vertical-align: inherit;">してMS </font></font><a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual C ++ 10.0</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">コンパイルする</font><font style="vertical-align: inherit;">と、最初の例は5.5秒かかり、ダブルループの例はわずか1.9秒かかります。</font><font style="vertical-align: inherit;">私の質問は：（下部にある私の言い換えられた質問を参照してください）</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://en.wikipedia.org/wiki/Intel_Core_2"><font style="vertical-align: inherit;">Intel Core 2</font></a><font style="vertical-align: inherit;"> Duo (x64)에서 </font><font style="vertical-align: inherit;">32 비트에 대해 </font><a href="http://en.wikipedia.org/wiki/SSE2"><font style="vertical-align: inherit;">SSE2가</font></a><font style="vertical-align: inherit;"> 활성화 </font><font style="vertical-align: inherit;">되고 완전 최적화 </font><font style="vertical-align: inherit;">된 MS </font></font><a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual C ++ 10.0</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 컴파일 된 </font><font style="vertical-align: inherit;">첫 번째 예제는 5.5 초, 이중 루프 예제는 1.9 초에 불과합니다. </font><font style="vertical-align: inherit;">내 질문은 : (하단에 내 대답을 참조하십시오)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Скомпилированный на MS </font></font><a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual C ++ 10.0</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с полной оптимизацией и </font><font style="vertical-align: inherit;">включенным </font></font><a href="http://en.wikipedia.org/wiki/SSE2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SSE2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для 32-разрядных на </font></font><a href="http://en.wikipedia.org/wiki/Intel_Core_2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intel Core 2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Duo (x64), первый пример занимает 5,5 секунды, а пример с двойной петлей - всего 1,9 секунды. </font><font style="vertical-align: inherit;">Мой вопрос: (Пожалуйста, обратитесь к моему перефразированному вопросу внизу)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font><font style="vertical-align: inherit;">具有完全优化</font><font style="vertical-align: inherit;">功能的</font><font style="vertical-align: inherit;">MS </font></font><a href="http://en.wikipedia.org/wiki/Visual_C++#32-bit_versions"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual C ++ 10.0</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上编译，</font><font style="vertical-align: inherit;">并</font><font style="vertical-align: inherit;">在</font><a href="http://en.wikipedia.org/wiki/Intel_Core_2"><font style="vertical-align: inherit;">Intel Core 2</font></a><font style="vertical-align: inherit;"> Duo（x64）</font><font style="vertical-align: inherit;">上为32位启用了</font></font><a href="http://en.wikipedia.org/wiki/SSE2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SSE2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，第一个示例花费5.5秒，而双循环示例仅花费1.9秒。</font><font style="vertical-align: inherit;">我的问题是：（请参阅底部的我改写的问题）</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Considering the OP's original question about the 2 variants of the for loops and his amended question towards the behavior of caches along with many of the other excellent answers and useful comments; I'd like to try and do something different here by taking a different approach about this situation and problem.
es: Considerando la pregunta original de la OP sobre las 2 variantes de los bucles for y su pregunta enmendada sobre el comportamiento de los caches junto con muchas de las otras excelentes respuestas y comentarios útiles;me gustaría intentar hacer algo diferente aquí adoptando un enfoque diferente sobre esta situación y problema.
ja: forループの2つのバリエーションについてのOPの元の質問と、キャッシュの挙動についての彼の修正された質問、そして他の多くの素晴らしい回答や有益なコメントを考慮して、私はこの状況と問題について異なるアプローチを取ることによって、ここで何か異なることを試してみたいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">for 루프의 두 가지 변형에 대한 OP의 원래 질문과 캐시의 동작에 대한 수정 된 질문과 다른 많은 훌륭한 답변과 유용한 주석을 고려합니다. </font><font style="vertical-align: inherit;">이 상황과 문제에 대해 다른 접근법을 취하여 여기에서 다른 것을 시도하고 싶습니다.</font></font>
ru: Рассматривая оригинальный вопрос ОП о 2-х вариантах циклов и его измененный вопрос о поведении кэшей,наряду со многими другими отличными ответами и полезными комментариями,я хотел бы попробовать сделать здесь что-то другое,применяя другой подход к этой ситуации и проблеме.
zh_cn: 考虑到OP最初提出的关于for循环的2个变体的问题和他对缓存行为的修正问题,以及许多其他优秀的回答和有用的评论;我想在这里尝试做一些不同的事情,对这种情况和问题采取不同的方法。

source: Considering the two loops and all of the discussion about cache and page filing I'd like to take another approach as to looking at this from a different perspective. One that doesn't involve the cache and page files nor the executions to allocate memory, in fact this approach doesn't even concern the actual hardware or the software at all.
es: Considerando los dos bucles y toda la discusión sobre la memoria caché y el archivado de páginas,me gustaría adoptar otro enfoque para ver esto desde una perspectiva diferente.Uno que no involucre los archivos de caché y de páginas ni las ejecuciones para asignar memoria,de hecho este enfoque ni siquiera concierne al hardware o al software en sí.
ja: 2 つのループとキャッシュとページファイリングについての議論を考えると、別の視点からこれを見るために別のアプローチを取りたいと思います。それは、キャッシュやページファイルやメモリ割り当ての実行を伴わないもので、実際には、このアプローチは実際のハードウェアやソフトウェアには全く関係ありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 개의 루프와 캐시 및 페이지 정리에 대한 모든 논의를 고려할 때 다른 관점에서이를 보는 다른 접근법을 원합니다. </font><font style="vertical-align: inherit;">캐시와 페이지 파일을 포함하지 않는 메모리 나 메모리 할당을위한 실행은 사실이 접근 방식은 실제 하드웨어 나 소프트웨어와 전혀 관련이 없습니다.</font></font>
ru: Учитывая два цикла и всю дискуссию о кэшировании и подаче страниц,я хотел бы применить другой подход,чтобы посмотреть на это с другой точки зрения.Тот,который не включает в себя ни кэш и файлы страниц,ни исполнение для выделения памяти,на самом деле этот подход не касается даже реального оборудования или программного обеспечения вообще.
zh_cn: 考虑到这两个循环和所有关于缓存和页面文件的讨论,我想从另一个角度来看待这个问题。一个不涉及到缓存和页面文件,也不涉及到分配内存的执行,事实上,这种方法甚至根本不涉及到实际的硬件和软件。

source: Could you provide some solid insight into the details that lead to the different cache behaviors as illustrated by the five regions on the following graph?
es: ¿Podría darnos una idea sólida de los detalles que conducen a los diferentes comportamientos de la memoria caché como se ilustra en las cinco regiones del siguiente gráfico?
ja: 次のグラフの5つの領域で示されているように、異なるキャッシュの動作につながる詳細について、しっかりとした洞察を提供していただけますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 그래프의 5 개 영역에서 설명하는 것처럼 다른 캐시 동작을 유발하는 세부 사항에 대한 통찰력을 제공 할 수 있습니까?</font></font>
ru: Не могли бы вы предоставить некоторое обоснованное представление о деталях,которые приводят к различным моделям поведения в кэше,как это проиллюстрировано пятью регионами на следующем графике?
zh_cn: 你能不能提供一些确切的见解,说明导致不同的缓存行为的细节,如下图中的五个区域所示?

source: Disassembly for the first loop basically looks like this (this block is repeated about five times in the full program):
es: El desmontaje del primer bucle se ve básicamente así (este bloque se repite unas cinco veces en el programa completo):
ja: 最初のループのための分解は基本的に次のようになります(このブロックはフルプログラムの中で5回ほど繰り返されます)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 루프의 디스 어셈블리는 기본적으로 다음과 같습니다 (이 블록은 전체 프로그램에서 약 5 번 반복됨).</font></font>
ru: Разборка для первого цикла в основном выглядит так (этот блок повторяется примерно пять раз в полной программе):
zh_cn: 第一个循环的解构基本上是这样的(这个块在整个程序中重复了5次左右)。

source: EDIT: Results on an <em>actual</em> Core 2 architecture machine:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">EDITAR: Resultados en una </font><font style="vertical-align: inherit;">m&aacute;quina de arquitectura Core 2 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">real</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Core 2アーキテクチャマシンでの</font><font style="vertical-align: inherit;">結果</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Core 2 아키텍처 시스템의 </font><font style="vertical-align: inherit;">결과 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">РЕДАКТИРОВАТЬ: Результаты на </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">реальной</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> машине с архитектурой Core 2:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑：在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Core 2体系结构机器</font><font style="vertical-align: inherit;">上的结果</font><font style="vertical-align: inherit;">：</font></font>

source: EDIT: The question turned out to be of no relevance, as the behavior severely depends on the sizes of the arrays (n) and the CPU cache. So if there is further interest, I rephrase the question:
es: EDITORIAL:La pregunta resultó no tener relevancia,ya que el comportamiento depende severamente del tamaño de los arreglos (n)y del caché de la CPU.Así que si hay más interés,reformulo la pregunta:
ja: EDIT:この質問は関連性がないことが判明しました。それで、さらに興味があれば、私は質問を言い換えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : 문제는 배열의 크기 (n)와 CPU 캐시에 따라 크게 다르기 때문에 질문은 관련이없는 것으로 판명되었습니다. </font><font style="vertical-align: inherit;">따라서 더 관심이 있다면, 나는 그 질문을 바꾸어 놓는다.</font></font>
ru: EDIT:Вопрос оказался несущественным,так как поведение сильно зависит от размеров массивов (n)и кэш-памяти процессора.Поэтому,если есть дальнейший интерес,я перефразирую вопрос:
zh_cn: EDIT:这个问题被证明是没有意义的,因为这个行为严重依赖于数组的大小(n)和CPU缓存。所以,如果有进一步的兴趣,我重新提出这个问题。

source: Each loop of the double loop example produces this code (the following block is repeated about three times):
es: Cada bucle del ejemplo de doble bucle produce este código (el siguiente bloque se repite unas tres veces):
ja: 二重ループの例の各ループは、このようなコードを生成します(以下のブロックは約3回繰り返されます)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이중 루프 예제의 각 루프는이 코드를 생성합니다 (다음 블록은 약 3 번 반복됨).</font></font>
ru: Каждый цикл в примере двойного цикла дает такой код (следующий блок повторяется примерно три раза):
zh_cn: 双循环示例的每个循环都会产生这样的代码(下面的代码块大约重复三次)。

source: Every low-level performance related question on Stack&nbsp;Overflow should be required to provide MFLOPS information for the whole range of cache relevant data sizes! It's a waste of everybody's time to think of answers and especially discuss them with others without this information.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Todas las preguntas relacionadas con el rendimiento de bajo nivel sobre el desbordamiento de pila deben ser requeridas para proporcionar informaci&oacute;n MFLOPS para toda la gama de tama&ntilde;os de datos relevantes de cach&eacute;! </font><font style="vertical-align: inherit;">Es una p&eacute;rdida de tiempo para todos pensar en respuestas y especialmente discutirlas con otros sin esta informaci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キャッシュ関連のデータサイズ全体のMFLOPS情報を提供するには、スタックオーバーフローに関するパフォーマンスに関する低レベルの質問がすべて必要です。</font><font style="vertical-align: inherit;">答えを考え、特にこの情報なしで他の人とそれらについて話し合うことは、みんなの時間の無駄です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 캐시 관련 데이터 크기에 대한 MFLOPS 정보를 제공하려면 스택 오버플로에 대한 모든 저수준 성능 관련 질문이 필요합니다! </font><font style="vertical-align: inherit;">답변을 생각하고 특히이 정보없이 다른 사람들과 답변을 나누는 것은 모두의 시간 낭비입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Каждый вопрос низкого уровня производительности, связанный с переполнением стека, должен требовать предоставления информации MFLOPS для всего диапазона размеров данных, связанных с кешем! </font><font style="vertical-align: inherit;">Это пустая трата времени на то, чтобы думать об ответах и ​​особенно обсуждать их с другими без этой информации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该要求有关堆栈溢出的每个与低级别性能相关的问题，以提供有关整个高速缓存相关数据大小范围的MFLOPS信息！</font><font style="vertical-align: inherit;">浪费每个人思考答案的时间，尤其是在没有这些信息的情况下与其他人讨论答案。</font></font>

source: Hardware is <a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500">Dell XPS 8500</a> with generation 3 <a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7">Core i7</a> @ 3.4&nbsp;GHz and 8&nbsp;GB memory. For 2^16 to 2^24, using eight loops, the cumulative time was 44.987 and 40.965 respectively. Visual C++ 2010, fully optimized.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El hardware es </font></font><a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dell XPS 8500</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con generaci&oacute;n 3 </font></font><a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core i7</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> @ 3.4 GHz y 8 GB de memoria. </font><font style="vertical-align: inherit;">Para 2 ^ 16 a 2 ^ 24, usando ocho bucles, el tiempo acumulado fue 44.987 y 40.965 respectivamente. </font><font style="vertical-align: inherit;">Visual C ++ 2010, totalmente optimizado.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハードウェアは</font><font style="vertical-align: inherit;">、第3世代</font><a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7"><font style="vertical-align: inherit;">Core i7</font></a><font style="vertical-align: inherit;"> @ 3.4 GHzおよび8 GBメモリを搭載した</font></font><a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dell XPS 8500</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">2 ^ 16から2 ^ 24の場合、8つのループを使用すると、累積時間はそれぞれ44.987および40.965でした。</font><font style="vertical-align: inherit;">Visual C ++ 2010、完全に最適化。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하드웨어는 </font><font style="vertical-align: inherit;">3 세대 </font><a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7"><font style="vertical-align: inherit;">i7</font></a><font style="vertical-align: inherit;"> @ 3.4GHz 및 8GB 메모리 </font><font style="vertical-align: inherit;">가 장착 된 </font></font><a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dell XPS 8500</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">8 ^ 루프를 사용하는 2 ^ 16-2 ^ 24의 경우 누적 시간은 각각 44.987 및 40.965입니다. </font><font style="vertical-align: inherit;">완전히 최적화 된 Visual C ++ 2010</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Аппаратное обеспечение - </font></font><a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dell XPS 8500</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font><font style="vertical-align: inherit;">процессором </font><font style="vertical-align: inherit;">3 </font></font><a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core i7</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> @ 3,4 ГГц и 8 ГБ памяти. </font><font style="vertical-align: inherit;">Для 2 ^ 16 до 2 ^ 24, используя восемь циклов, совокупное время было 44,987 и 40,965 соответственно. </font><font style="vertical-align: inherit;">Visual C ++ 2010, полностью оптимизирован.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">硬件是</font></font><a href="http://en.wikipedia.org/wiki/Dell_XPS#XPS_8500"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dell XPS 8500，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有第三代</font></font><a href="http://en.wikipedia.org/wiki/Intel_Core#Core_i7"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Core i7</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> @ 3.4 GHz和8 GB内存。</font><font style="vertical-align: inherit;">对于2 ^ 16到2 ^ 24，使用八个循环，累积时间分别为44.987和40.965。</font><font style="vertical-align: inherit;">完全优化的Visual C ++ 2010。</font></font>

source: However, in order for false aliasing to occur, there must be a large enough stride between the datasets. This is why you don't see this in region 3.
es: Sin embargo,para que se produzcan falsos alias,debe haber un paso lo suficientemente grande entre los conjuntos de datos.Por eso no se ve esto en la región 3.
ja: しかし、偽のエイリアシングが発生するためには、データセット間に十分に大きなストライドがなければなりません。これがリージョン3で見られない理由です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 잘못된 앨리어싱이 발생하려면 데이터 집합간에 보폭이 충분히 커야합니다. </font><font style="vertical-align: inherit;">이것이 지역 3에서 이것을 볼 수없는 이유입니다.</font></font>
ru: Однако для того,чтобы произошло ложное наложение псевдонимов,между наборами данных должен быть достаточно большой шаг.Вот почему вы не видите этого в области 3.
zh_cn: 然而,为了使假别名发生,数据集之间必须有足够大的跨度。这就是为什么你在区域3中没有看到这种情况。
