Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong><em>Second Case:</em></strong><code>The Boss</code> has to travel 100 feet on the first iteration to <code>A</code>, but after that he is already there and just waits for <code>A</code> to get back until all slips are filled. Then the <code>Boss</code> has to travel 500 feet on the first iteration to <code>C</code> because <code>C</code> is 500 feet from <code>A</code> since this <code>Boss( Summation, For Loop )</code> is being called right after working with <code>A</code> and then just waits like he did with <code>A</code> until all of <code>C's</code> order slips are done.
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Segundo caso:</font></font></em></strong> <code>The Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene que viajar 100 pies en la primera iteraci&oacute;n a</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero despu&eacute;s de eso ya est&aacute; all&iacute; y solo espera a que</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> regrese hasta que se llenen todos los resbalones. </font><font style="vertical-align: inherit;">Luego, el</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene que viajar 500 pies en la primera iteraci&oacute;n a</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> porque</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; a 500 pies de</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ya que</font><font style="vertical-align: inherit;">se llama a</font><font style="vertical-align: inherit;">este</font></font> <code>Boss( Summation, For Loop )</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> justo despu&eacute;s de trabajar con</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y luego espera como lo hizo con</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hasta que todo</font></font> <code>C's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comprobantes de pedido</font><font style="vertical-align: inherit;"> de C</font><font style="vertical-align: inherit;"> est&aacute;n listos.</font></font>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目のケース：</font></font></em></strong> <code>The Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初の反復で100フィートを</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まで移動する必要があります</font><font style="vertical-align: inherit;">が、その後、彼はすでにそこにいて、</font><font style="vertical-align: inherit;">すべてのスリップが満たされるまで</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が戻る</font><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">待つだけ</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">そして、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に最初の反復で500フィートを移動しなければならない</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、</font></font> <code>C</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 500フィートからである</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このため、</font></font> <code>Boss( Summation, For Loop )</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">右の作業の後に呼び出されている</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と彼がやったように、その後ただ待つ</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の全てまで</font></font> <code>C's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注文伝票が完成しました。</font></font>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 경우 :</font></font></em></strong> <code>The Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는</font></font> <code>A</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 첫 번째 반복에서 100 피트를 이동해야</font><font style="vertical-align: inherit;">하지만 그 후 이미 거기에 있고</font><font style="vertical-align: inherit;">모든 슬립이 채워질 때까지</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 돌아 오기를</font><font style="vertical-align: inherit;">기다립니다</font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그런 다음</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 첫 번째 반복에 5백피트를 여행하는</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때문에</font></font> <code>C</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 500 피트</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 이후</font></font> <code>Boss( Summation, For Loop )</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 작업 직후에 호출되는</font><font style="vertical-align: inherit;">하고 단지 그가했던 것처럼 대기</font><font style="vertical-align: inherit;">의 모든 때까지</font> <code>C's</code> <font style="vertical-align: inherit;"> 주문 전표가 완료됩니다.</font></font> <code>A</code> <font style="vertical-align: inherit;"></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Второй случай:</font></font></em></strong> <code>The Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен пройти 100 футов на первой итерации к</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но после этого он уже там и просто ждет, пока</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернется, пока все промахи не будут заполнены. </font><font style="vertical-align: inherit;">Затем</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен пройти 500 футов на первой итерации до</font></font> <code>C</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> потому что</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> находится в 500 футах от</font></font> <code>A</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> так как этот</font></font> <code>Boss( Summation, For Loop )</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывается сразу после работы с</font></font> <code>A</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем просто ждет, как он сделал с</font></font> <code>A</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пока все</font></font> <code>C's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сделаны.</font></font>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第二种情况：</font></font></em></strong> <code>The Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第一次迭代中必须走100英尺才能到达</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但是之后他已经在那里并且只等</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">回来直到所有单子都装满。</font><font style="vertical-align: inherit;">然后，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要旅行500英尺的第一次迭代</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是500英尺</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因为这个</font></font> <code>Boss( Summation, For Loop )</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正与工作后立即叫</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后就等待他能像</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，直到所有的</font></font> <code>C's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">订单单已完成。</font></font>

source: <strong>Assessing The Problem</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Evaluar el problema</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題の評価</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제 평가</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Оценивая проблему</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">评估问题</font></font></strong>

source: <strong>Benchmark Results:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Resultados de referencia:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ベンチマーク結果：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">벤치 마크 결과 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Результаты теста:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基准结果：</font></font></strong>

source: <strong>Case 1</strong> is a classic interpolation problem that happens to be an inefficient one. I also think that this was one of the leading reasons of why many machine architectures and developers ended up building and designing multi-core systems with the ability to do multi-threaded applications as well as parallel programming.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es un problema cl&aacute;sico de interpolaci&oacute;n que resulta ineficiente. </font><font style="vertical-align: inherit;">Tambi&eacute;n creo que esta fue una de las principales razones por las cuales muchas arquitecturas y desarrolladores de m&aacute;quinas terminaron construyendo y dise&ntilde;ando sistemas de m&uacute;ltiples n&uacute;cleos con la capacidad de hacer aplicaciones de m&uacute;ltiples subprocesos, as&iacute; como programaci&oacute;n paralela.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、たまたま非効率的な問題である古典的な補間問題です。</font><font style="vertical-align: inherit;">また、これが、多くのマシンアーキテクチャや開発者が、マルチスレッドアプリケーションや並列プログラミングを実行できるマルチコアシステムの構築と設計を行った主な理由の1つでもあると思います。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사례 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 비효율적 인 전형적인 보간 문제입니다. </font><font style="vertical-align: inherit;">또한 이것이 많은 기계 아키텍처와 개발자가 멀티 스레드 응용 프로그램과 병렬 프로그래밍을 수행 할 수있는 멀티 코어 시스템을 구축하고 설계 한 주요 이유 중 하나라고 생각합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Случай 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это классическая проблема интерполяции, которая оказывается неэффективной. </font><font style="vertical-align: inherit;">Я также думаю, что это было одной из главных причин того, почему многие машинные архитектуры и разработчики закончили создавать и проектировать многоядерные системы с возможностью выполнения многопоточных приложений, а также параллельного программирования.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个经典的插值问题，碰巧是一个效率低下的问题。</font><font style="vertical-align: inherit;">我还认为，这就是许多机器体系结构和开发人员最终构建和设计具有执行多线程应用程序以及并行编程能力的多核系统的主要原因之一。</font></font>

source: <strong>Could you provide some solid insight into the details that lead to the different cache behaviors as illustrated by the five regions on the following graph?</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Podr&iacute;a proporcionar una idea s&oacute;lida de los detalles que conducen a los diferentes comportamientos de cach&eacute; como se ilustra en las cinco regiones en el siguiente gr&aacute;fico?</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のグラフの5つの領域に示されているように、さまざまなキャッシュ動作につながる詳細への確かな洞察を提供できますか？</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 그래프의 5 개 영역에서 설명하는 것처럼 다른 캐시 동작을 유발하는 세부 사항에 대한 통찰력을 제공 할 수 있습니까?</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Не могли бы вы дать некоторое представление о деталях, которые приводят к разным поведением кэша, как показано пятью областями на следующем графике?</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您能否对导致不同缓存行为的细节提供深入的了解，如下图的五个区域所示？</font></font></strong>

source: <strong>EDIT : It does in fact look like you are allocating all the arrays separately.</strong> Usually when such large allocations are requested, the allocator will request fresh pages from the OS. Therefore, there is a high chance that large allocations will appear at the same offset from a page-boundary.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">EDITAR: De hecho, parece que est&aacute; asignando todas las matrices por separado. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Por lo general, cuando se solicitan asignaciones tan grandes, el asignador solicitar&aacute; p&aacute;ginas nuevas del sistema operativo. </font><font style="vertical-align: inherit;">Por lo tanto, existe una alta probabilidad de que aparezcan grandes asignaciones en el mismo desplazamiento desde un l&iacute;mite de p&aacute;gina.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集：実際には、すべての配列を個別に割り当てているように見えます。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 通常、このような大きな割り当てが要求されると、アロケータはOSに新しいページを要求します。</font><font style="vertical-align: inherit;">したがって、ページ境界からの同じオフセットに大きな割り当てが表示される可能性が高くなります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : 실제로 모든 배열을 별도로 할당하는 것처럼 보입니다. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일반적으로 이러한 큰 할당이 요청되면 할당자는 OS에서 새로운 페이지를 요청합니다. </font><font style="vertical-align: inherit;">따라서 큰 할당이 페이지 경계와 동일한 오프셋에 나타날 가능성이 높습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">РЕДАКТИРОВАТЬ: Это на самом деле выглядит, как будто вы распределяете все массивы отдельно. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Обычно, когда запрашиваются такие большие выделения, распределитель запрашивает свежие страницы из ОС. </font><font style="vertical-align: inherit;">Следовательно, существует высокая вероятность того, что большие выделения появятся с тем же смещением от границы страницы.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑：实际上，它的确看起来像您是分别分配所有数组。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 通常，当请求如此大的分配时，分配器会从OS请求新页面。</font><font style="vertical-align: inherit;">因此，很有可能大分配将出现在与页面边界相同的偏移量处。</font></font>

source: <strong>Here's the test code:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; est&aacute; el c&oacute;digo de prueba:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここにテストコードがあります：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트 코드는 다음과 같습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот тестовый код:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是测试代码：</font></font></strong>

source: <strong>I cannot replicate the results discussed here.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No puedo replicar los resultados discutidos aqu&iacute;.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで説明した結果は再現できません。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 논의한 결과를 복제 할 수 없습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я не могу повторить результаты, обсуждаемые здесь.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我无法复制此处讨论的结果。</font></font></strong>

source: <strong>In the first two tests, the arrays are allocated separately.</strong> You'll notice that they all have the same alignment relative to the page.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En las dos primeras pruebas, las matrices se asignan por separado. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Notar&aacute;s que todos tienen la misma alineaci&oacute;n en relaci&oacute;n con la p&aacute;gina.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初の2つのテストでは、配列は個別に割り当てられます。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これらはすべて、ページに対して同じ配置になっていることがわかります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">처음 두 테스트에서 배열은 별도로 할당됩니다. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것들은 페이지에 대해 모두 동일한 정렬을 가지고 있음을 알 수 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В первых двух тестах массивы выделяются отдельно. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы заметите, что все они имеют одинаковое выравнивание по отношению к странице.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在前两个测试中，分别分配数组。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您会注意到它们相对于页面都具有相同的对齐方式。</font></font>

source: <strong>In the second two tests, the arrays are packed together to break that alignment.</strong> Here you'll notice both loops are faster. Furthermore, the second (double) loop is now the slower one as you would normally expect.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En las segundas dos pruebas, las matrices se empaquetan juntas para romper esa alineaci&oacute;n. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; notar&aacute;s que ambos bucles son m&aacute;s r&aacute;pidos. </font><font style="vertical-align: inherit;">Adem&aacute;s, el segundo bucle (doble) ahora es el m&aacute;s lento, como es de esperar.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目の2つのテストでは、その配列を壊すために配列が一緒にパックされます。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、両方のループが高速であることがわかります。</font><font style="vertical-align: inherit;">さらに、2番目の（ダブル）ループは、通常予想されるよりも遅いループになりました。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 테스트에서는 배열이 정렬되어 해당 정렬을 해제합니다. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 두 루프가 더 빠릅니다. </font><font style="vertical-align: inherit;">또한 두 번째 (더블) 루프는 일반적으로 예상 한 것보다 느립니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во вторых двух тестах массивы упакованы вместе, чтобы нарушить это выравнивание. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь вы заметите, что обе петли быстрее. </font><font style="vertical-align: inherit;">Кроме того, второй (двойной) цикл теперь стал медленнее, чем вы обычно ожидаете.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在后两个测试中，将数组打包在一起以破坏对齐方式。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里，您会注意到两个循环都更快。</font><font style="vertical-align: inherit;">此外，第二（双）循环现在比通常预期的要慢。</font></font>
