Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Think of the <code>For Loops</code> as being the <code>Summations</code> that does the iterations as being a <code>Boss</code> that is giving orders to two people <code>A</code> &amp; <code>B</code> and that their jobs are to meat <code>C</code> &amp; <code>D</code> respectively and to pick up some package from them and return it. In the analogy here the for loop or summation iterations and condition checks themselves doesn't actually represent the <code>Boss</code>. What actually represents the <code>Boss</code> here is not from the actual mathematical algorithms directly, but from the actual concept of <code>Scope</code> and <code>Code Block</code> within a routine or sub-routine, method, function, translation unit, etc. The first algorithm has 1 scope where the 2nd algorithm has 2 consecutive scopes.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Piense en </font></font> <code>For Loops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como las </font></font> <code>Summations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que hacen las iteraciones como un </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que est&aacute; dando &oacute;rdenes a dos personas </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y que sus trabajos son para carne </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> respectivamente y para recoger un paquete de ellos y devolverlo. En la analog&iacute;a aqu&iacute;, el bucle for o las iteraciones de suma y las comprobaciones de condici&oacute;n en s&iacute; mismas no representan al </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Lo que realmente representa al </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aqu&iacute; no proviene directamente de los algoritmos matem&aacute;ticos reales, sino del concepto real de </font></font> <code>Scope</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Code Block</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de una rutina o subrutina, m&eacute;todo, funci&oacute;n, unidad de traducci&oacute;n, etc. El primer algoritmo tiene 1 alcance donde el segundo algoritmo tiene 2 &aacute;mbitos consecutivos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考える</font></font> <code>For Loops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として</font></font> <code>Summations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">であるとして反復を行い</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 2人に命令を与えている</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>B</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">し、彼らの仕事は、肉にあることを</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はそれぞれ、それらのいくつかのパッケージをピックアップし、それを返すように。ここでの類推では、forループまたは合計の反復と条件チェック自体は実際には</font></font> <code>Boss</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表していません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ここで</font><font style="vertical-align: inherit;">実際に</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表すのは</font><font style="vertical-align: inherit;">、実際の数学アルゴリズムから直接ではなく、</font></font> <code>Scope</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font> <code>Code Block</code> <font style="vertical-align: inherit;">実際の概念からです</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ルーチンまたはサブルーチン、メソッド、関数、変換単位など内。最初のアルゴリズムには1つのスコープがあり、2番目のアルゴリズムには2つの連続するスコープがあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 생각 </font></font> <code>For Loops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것으로 </font></font> <code>Summations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있는 Being으로 반복을 수행 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이명에 주문을주고있다 </font><font style="vertical-align: inherit;">&amp; </font> <code>B</code> 를<font style="vertical-align: inherit;"> 자신의 작업 고기 것을 </font> <code>C</code> <font style="vertical-align: inherit;"> &amp; </font> <code>D</code> <font style="vertical-align: inherit;"> 는 각각 그들에서 일부 패키지를 선택하고 그것을 반환 할 수 있습니다. 여기 비유에서 for 루프 또는 합산 반복 및 조건 확인 자체는 실제로 </font> <code>Boss</code> 를<font style="vertical-align: inherit;"> 나타내지 않습니다 </font><font style="vertical-align: inherit;">. 실제로 </font><font style="vertical-align: inherit;">여기서 </font> <code>Boss</code> 를<font style="vertical-align: inherit;"> 나타내는 것은 </font><font style="vertical-align: inherit;">실제 수학적 알고리즘이 아니라 실제 </font> <code>Scope</code> <font style="vertical-align: inherit;"> 및 </font> <code>Code Block</code> <font style="vertical-align: inherit;"> 개념입니다.</font></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루틴 또는 서브 루틴, 방법, 함수, 변환 단위 등에서 첫 번째 알고리즘은 1 범위를 가지며 두 번째 알고리즘은 2 개의 연속 범위를 갖습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Представьте, что </font></font> <code>For Loops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это </font></font> <code>Summations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , выполняющие итерации как </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который отдает приказы двум людям </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>B</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и что их работа </font><font style="vertical-align: inherit;">заключается в </font><font style="vertical-align: inherit;">том, чтобы добывать </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соответственно, а также собирать с них какую-то посылку и возвращать ее. В аналогии здесь сами итерации цикла или суммирования и проверки условий на самом деле не представляют </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . То, что на самом деле представляет </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> здесь, не непосредственно из фактических математических алгоритмов, а из фактической концепции </font></font> <code>Scope</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Code Block</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри подпрограммы или подпрограммы, метода, функции, единицы перевода и т. д. Первый алгоритм имеет 1 область действия, где 2-й алгоритм имеет 2 последовательных области действия.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font> <code>For Loops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">看作是进行</font><font style="vertical-align: inherit;">迭代</font><font style="vertical-align: inherit;">的</font></font> <code>Summations</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">是将两个人</font> <code>A</code> <font style="vertical-align: inherit;">和</font> <code>B</code> 分别<font style="vertical-align: inherit;">下达命令</font><font style="vertical-align: inherit;">的</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，他们的工作分别是给</font> <code>C</code> <font style="vertical-align: inherit;">和</font> <code>D</code> <font style="vertical-align: inherit;">求肉</font><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">并从他们那里拿走一些包装并返回。以此类推，for循环或求和迭代和条件检查本身实际上并不代表</font> <code>Boss</code> <font style="vertical-align: inherit;">。这里真正代表</font> <code>Boss</code> <font style="vertical-align: inherit;">的不是直接来自实际的数学算法，而是来自</font> <code>Scope</code> <font style="vertical-align: inherit;">和</font> <code>Code Block</code> <font style="vertical-align: inherit;">的实际概念</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 在例程或子例程，方法，函数，翻译单元等中。第一种算法具有1个作用域，第二种算法具有2个连续的作用域。</font></font>

source: This is a classic cache thrash scenario.
es: Este es un clásico escenario de cacheo.
ja: 古典的なキャッシュスラッシュのシナリオです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 전형적인 캐시 스 래시 시나리오입니다.</font></font>
ru: Это классический сценарий трэша в кэше.
zh_cn: 这是一个典型的cache thrash场景。

source: This loop is executed 10,000 times via another outer <code>for</code> loop. To speed it up, I changed the code to:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Este bucle se ejecuta 10,000 veces a trav&eacute;s de otro </font><font style="vertical-align: inherit;">bucle </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> externo </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Para acelerarlo, cambi&eacute; el c&oacute;digo a:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このループは、別の外部</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループを</font><font style="vertical-align: inherit;">介して10,000回実行さ</font><font style="vertical-align: inherit;">れ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">スピードアップするために、コードを次のように変更しました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 루프는 다른 외부 </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루프 </font><font style="vertical-align: inherit;">를 통해 10,000 번 실행 </font><font style="vertical-align: inherit;">됩니다. </font><font style="vertical-align: inherit;">속도를 높이기 위해 코드를 다음과 같이 변경했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот цикл выполняется 10000 раз через другой внешний </font><font style="vertical-align: inherit;">цикл </font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Чтобы ускорить его, я изменил код на:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该循环通过另一个外部</font></font> <code>for</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">循环</font><font style="vertical-align: inherit;">执行了10,000次</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">为了加快速度，我将代码更改为：</font></font>

source: This means that all your accesses in each loop will fall on the same cache way. However, Intel processors have had 8-way L1 cache associativity for a while. But in reality, the performance isn't completely uniform. Accessing 4-ways is still slower than say 2-ways.
es: Esto significa que todos tus accesos en cada bucle caerán en la misma forma de caché.Sin embargo,los procesadores de Intel han tenido una asociatividad de caché L1 de 8 vías durante un tiempo.Pero en realidad,el rendimiento no es completamente uniforme.Acceder a 4 vías sigue siendo más lento que,por ejemplo,a 2 vías.
ja: これは、各ループ内のすべてのアクセスが同じキャッシュウェイに落ちることを意味します。しかし、Intelプロセッサはしばらくの間、8ウェイのL1キャッシュ連想性を持っていた。しかし、実際には性能は完全に一様ではありません。4ウェイへのアクセスは、2ウェイよりもまだ遅いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, 각 루프의 모든 액세스는 동일한 캐시 방식에 속합니다. </font><font style="vertical-align: inherit;">그러나 인텔 프로세서는 8-way L1 캐시 연관성을 가지고있었습니다. </font><font style="vertical-align: inherit;">그러나 실제로는 성능이 완전히 균일하지 않습니다. </font><font style="vertical-align: inherit;">4-way에 액세스하는 것은 여전히 ​​2-way보다 느립니다.</font></font>
ru: Это означает,что все ваши доступы в каждом цикле будут падать на один и тот же путь к кэшированию.Однако процессоры Intel некоторое время имели 8-полосную ассоциативность кэша L1.Но на самом деле производительность не совсем однородна.Доступ к 4-полосному по-прежнему медленнее,чем,скажем,к 2-полосному.
zh_cn: 这意味着,你在每个循环中的所有访问都将落在同一个缓存方式上。不过,英特尔处理器已经有一段时间的8路L1缓存关联性了。但实际上,性能并不完全统一。访问4路还是比说2路要慢。

source: This one is easy. The dataset is so small that the performance is dominated by overhead like looping and branching.
es: Esta es fácil.El conjunto de datos es tan pequeño que el rendimiento está dominado por la sobrecarga como el bucle y las ramificaciones.
ja: これは簡単です。データセットが非常に小さいので、性能はループや分岐のようなオーバーヘッドに支配されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 쉽다. </font><font style="vertical-align: inherit;">데이터 세트가 너무 작아서 루핑 및 분기와 같은 오버 헤드가 성능을 좌우합니다.</font></font>
ru: Это легко.Набор данных настолько мал,что в производительности доминируют накладные расходы,такие как петлевание и ветвление.
zh_cn: 这个很简单。数据集太小了,以至于性能上受开销如循环和分支等的支配。

source: Total cost = <code>(100 + 100 + 1 + 1) * 2 = 404</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Costo total = </font></font> <code>(100 + 100 + 1 + 1) * 2 = 404</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">総コスト= </font></font> <code>(100 + 100 + 1 + 1) * 2 = 404</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">총 비용 = </font></font> <code>(100 + 100 + 1 + 1) * 2 = 404</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Общая стоимость = </font></font> <code>(100 + 100 + 1 + 1) * 2 = 404</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">总费用= </font></font> <code>(100 + 100 + 1 + 1) * 2 = 404</code>

source: Total cost = <code>(100 + 100 + 100 + 100) * 2 = 800</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Costo total = </font></font> <code>(100 + 100 + 100 + 100) * 2 = 800</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">総コスト= </font></font> <code>(100 + 100 + 100 + 100) * 2 = 800</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">총 비용 = </font></font> <code>(100 + 100 + 100 + 100) * 2 = 800</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Общая стоимость = </font></font> <code>(100 + 100 + 100 + 100) * 2 = 800</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">总费用= </font></font> <code>(100 + 100 + 100 + 100) * 2 = 800</code>

source: Try writing two parallel lines of 20 crosses with a pen and paper separated by 20&nbsp;cm. Try once finishing one and then the other line and try another time by writting a cross in each line alternately.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intente escribir dos l&iacute;neas paralelas de 20 cruces con un bol&iacute;grafo y papel separados por 20 cm. </font><font style="vertical-align: inherit;">Intente terminar una y luego la otra l&iacute;nea e intente otra vez escribiendo una cruz en cada l&iacute;nea alternativamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">20 cm離れたペンと紙で、20の十字の2本の平行線を書いてみてください。</font><font style="vertical-align: inherit;">片方のラインを完成させてから、もう一方のラインを完成させ、各ラインに交互に十字を書いて別の時間を試します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">펜과 종이로 20cm 분리 된 20 개의 십자선 두 줄을 써보십시오. </font><font style="vertical-align: inherit;">한 줄을 끝내고 다른 줄을 끝내고 각 줄에 십자가를 번갈아 가며 다시 시도하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попробуйте написать две параллельные линии по 20 крестиков с помощью ручки и бумаги, разделенных на 20 см. </font><font style="vertical-align: inherit;">Попробуйте один раз закончить одну, а затем другую строку и попробуйте другой раз, поочередно записывая крестик в каждой строке.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试用相隔20厘米的钢笔和纸书写两条20条交叉的平行线。</font><font style="vertical-align: inherit;">尝试先完成一条，然后再完成另一行，然后通过在每行中交替写一个十字来尝试另一次。</font></font>

source: Two loops: 1.507 ms
es: Dos bucles:1.507 ms
ja: 2つのループ 1.507 ms
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 개의 루프 : 1.507ms</font></font>
ru: Две петли:1.507 мс
zh_cn: 两圈。1.507毫秒

source: Upon further analysis of this, I believe this is (at least partially) caused by data alignment of the four pointers. This will cause some level of cache bank/way conflicts.
es: Tras un análisis más detallado de esto,creo que esto es (al menos parcialmente)causado por la alineación de los datos de los cuatro punteros.Esto causará algún nivel de conflictos en la memoria caché.
ja: これをさらに分析すると、これは(少なくとも部分的には)4つのポインターのデータアラインメントに起因すると考えられます。これにより、ある程度のレベルのキャッシュバンクウェイの競合が発生します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것에 대한 추가 분석에 따르면, 이것은 네 포인터의 데이터 정렬에 의해 (적어도 부분적으로) 발생한다고 생각합니다. </font><font style="vertical-align: inherit;">이로 인해 일정 수준의 캐시 뱅크 / 웨이 충돌이 발생합니다.</font></font>
ru: При дальнейшем анализе я полагаю,что это (по крайней мере,частично)вызвано выравниванием данных по четырем указателям.Это приведет к некоторому уровню конфликтов кэш-банкинга.
zh_cn: 经过进一步分析,我认为这(至少部分)是由四个指针的数据对齐造成的。这就会造成一定程度上的缓存银行通道冲突。

source: We can easily see that 600 is far less than 10 million. Now this isn't exact, because we don't know the actual difference in distance between which address of RAM or from which Cache or Page File each call on each iteration is going to be due to many other unseen variables, but this is just an assessment of the situation to be aware of and trying to look at it from the worst case scenario.
es: Podemos ver fácilmente que 600 es mucho menos que 10 millones.Ahora bien,esto no es exacto,porque no sabemos la diferencia real de distancia entre qué dirección de la RAM o desde qué caché o archivo de página cada llamada en cada iteración va a ser debido a muchas otras variables no vistas,pero esto es sólo una evaluación de la situación para ser consciente y tratar de verla desde el peor de los casos.
ja: 600 が 1,000 万よりもはるかに少ないことが容易にわかります。これは正確ではありません。RAMのどのアドレス間の距離の実際の違いや、どのキャッシュやページファイルからの呼び出しが、他の多くの目に見えない変数のために各反復で行われるかはわかりませんが、これは単に状況を認識し、最悪の場合のシナリオからそれを見ようとしている評価です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">600이 천만보다 훨씬 적다는 것을 쉽게 알 수 있습니다. RAM의 주소 또는 각 반복마다 호출 할 때마다 캐시 또는 페이지 파일 사이의 거리의 실제 차이를 알지 못하기 때문에 이것은 정확하지 않습니다. 그러나 이것은 보이지 않는 많은 변수 때문입니다. 최악의 시나리오에서 상황을 인식하고 보려는 상황에 대한 평가.</font></font>
ru: Легко заметить,что 600-это гораздо меньше 10 миллионов.Теперь это не совсем точно,потому что мы не знаем реальную разницу в расстоянии между тем,какой адрес оперативной памяти или из какого Cache или Page File каждый вызов на каждой итерации будет связан со многими другими невидимыми переменными,но это всего лишь оценка ситуации,чтобы быть в курсе и пытаться взглянуть на нее с худшего сценария.
zh_cn: 我们不难看出,600远小于1000万。现在,这并不确切,因为我们不知道RAM的哪个地址或从哪个Cache或Page File每次迭代上的调用会因为很多其他看不见的变量而产生实际的距离差异,但这只是对情况的评估,需要注意,并试图从最坏的情况下看。
