Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: And this approximation is the average difference between these two loops both algorithmically and machine operations involving software optimizations and machine instructions. So when the data set grows linearly, so does the difference in time between the two. Algorithm 1 has more fetches than algorithm 2 which is evident when the <code>Boss</code> had to travel back and forth the maximum distance between <code>A</code> &amp; <code>C</code> for every iteration after the first iteration while Algorithm 2 the <code>Boss</code> had to travel to <code>A</code> once and then after being done with <code>A</code> he had to travel a maximum distance only one time when going from <code>A</code> to <code>C</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y esta aproximaci&oacute;n es la diferencia promedio entre estos dos bucles tanto algor&iacute;tmicamente como las operaciones de la m&aacute;quina que implican optimizaciones de software e instrucciones de la m&aacute;quina. Entonces, cuando el conjunto de datos crece linealmente, tambi&eacute;n lo hace la diferencia de tiempo entre los dos. El algoritmo 1 tiene m&aacute;s alcances que el algoritmo 2, lo cual es evidente cuando el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tuvo que viajar de ida y vuelta la distancia m&aacute;xima entre </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cada iteraci&oacute;n despu&eacute;s de la primera iteraci&oacute;n, mientras que el Algoritmo 2 el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tuvo que viajar a </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una vez y luego de haber terminado con </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que ten&iacute;a que recorrer una distancia m&aacute;xima de una sola vez cuando se pasa de </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして、この近似は、ソフトウェアによる最適化と機械命令を含むアルゴリズムと機械操作の両方でのこれら2つのループ間の平均差です。したがって、データセットが線形に増加すると、2つの間の時間差も増加します。アルゴリズム1は、アルゴリズム2よりも多くのフェッチがあります。これは、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">最初の反復後のすべての反復で</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>C</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">間の最大距離を行き来し</font><font style="vertical-align: inherit;">なければならず</font><font style="vertical-align: inherit;">、アルゴリズム2の</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">一度</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に移動しなければならない</font><font style="vertical-align: inherit;">場合に明らかです。</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">氏は、最大距離に行くから一度だけ移動しなければならなかった</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font></font> <code>C</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고이 근사치는 알고리즘과 소프트웨어 최적화 및 기계 명령어를 포함하는 기계 작동 모두에서이 두 루프의 평균 차이입니다. 따라서 데이터 세트가 선형으로 커지면 두 데이터 간의 시간 차이도 커집니다. 알고리즘 1이 때 분명 알고리즘 2 이상 페치 갖는 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사이에 이동 전후의 최대 거리를 가지고 </font><font style="vertical-align: inherit;">&amp; </font> <code>C</code> <font style="vertical-align: inherit;"> 알고리즘 2 동안 첫번째 반복 후마다 반복 용 </font> <code>Boss</code> <font style="vertical-align: inherit;"> 여행을 가지고 </font><font style="vertical-align: inherit;">다음 후에 수행되는 일단을 와 </font><font style="vertical-align: inherit;">그는에서 갈 때 최대 거리를 하나의 시간을 여행했다 </font><font style="vertical-align: inherit;">에 </font> <code>C</code> <font style="vertical-align: inherit;"> .</font></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font> <code>A</code> <font style="vertical-align: inherit;"></font> <code>A</code> <font style="vertical-align: inherit;"></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И это приближение является средней разницей между этими двумя циклами как алгоритмически, так и машинными операциями, включающими оптимизацию программного обеспечения и машинные инструкции. Поэтому, когда набор данных растет линейно, увеличивается и разница во времени между ними. Алгоритм 1 имеет больше выборок, чем алгоритм 2, что очевидно, когда </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен был пройти назад и вперед максимальное расстояние между </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для каждой итерации после первой итерации, в то время как Алгоритм 2 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должен был пройти к </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> один раз, а затем после того, как это было сделано с </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> он должен был путешествовать максимальное расстояние только один раз при переходе от </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这个近似值是算法和机器操作（包括软件优化和机器指令）在这两个循环之间的平均差。因此，当数据集线性增长时，两者之间的时间差也将增加。算法1的取数比算法2的取数多，这在</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第一次迭代后每次迭代都必须</font><font style="vertical-align: inherit;">在</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之间最大距离来回移动</font><font style="vertical-align: inherit;">而算法2 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须</font><font style="vertical-align: inherit;">一次又一次</font><font style="vertical-align: inherit;">到达</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时明显可见。</font><font style="vertical-align: inherit;">从</font> <code>A</code> <font style="vertical-align: inherit;">到</font> <code>C</code> <font style="vertical-align: inherit;">时，</font><font style="vertical-align: inherit;">与</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一起他只能走一次最大距离</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: And this is a hard-to-explain one: Initialized data, that is allocated once and reused for every following test case of different vector size:
es: Y esta es una difícil de explicar:Datos inicializados,que se asignan una vez y se reutilizan para cada caso de prueba siguiente de diferente tamaño de vector:
ja: そして、これは説明が難しいものです。初期化されたデータは、一度割り当てられ、異なるベクトルサイズの次のテストケースごとに再利用されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 이것은 설명하기 어려운 것입니다. 초기화 된 데이터. 한 번 할당되고 벡터 크기가 다른 다음 테스트 사례마다 재사용됩니다.</font></font>
ru: А это трудно объяснить:Инициализированные данные,которые выделяются один раз и повторно используются для каждого последующего тестового случая различного размера вектора:
zh_cn: 而这是一个很难解释的问题。初始化的数据,就是分配一次,并对下面每一个不同大小的向量的测试用例重复使用。

source: Array sizes ranged from 2^16 to 2^24, using eight loops. I was careful to initialize the source arrays so the <code>+=</code> assignment wasn't asking the <a href="http://en.wikipedia.org/wiki/Floating-point_unit">FPU</a> to add memory garbage interpreted as a double.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los tama&ntilde;os de matriz variaron de 2 ^ 16 a 2 ^ 24, utilizando ocho bucles. </font><font style="vertical-align: inherit;">Tuve cuidado de inicializar las matrices de origen para que la </font><font style="vertical-align: inherit;">asignaci&oacute;n </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no le pidiera a la </font></font><a href="http://en.wikipedia.org/wiki/Floating-point_unit"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FPU</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que agregara basura de memoria interpretada como un doble.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">配列サイズは、8つのループを使用して、2 ^ 16から2 ^ 24の範囲でした。</font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">割り当てが</font></font><a href="http://en.wikipedia.org/wiki/Floating-point_unit"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FPU</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にdoubleとして解釈されるメモリガベージを追加する</font><font style="vertical-align: inherit;">ように要求しないように</font><font style="vertical-align: inherit;">、ソース配列を初期化するように注意し</font><font style="vertical-align: inherit;">ました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">배열 크기는 8 개의 루프를 사용하여 2 ^ 16에서 2 ^ 24 사이였습니다. </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할당이 </font></font><a href="http://en.wikipedia.org/wiki/Floating-point_unit"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FPU</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 이중으로 해석되는 메모리 가비지를 추가하도록 </font><font style="vertical-align: inherit;">요청하지 </font><font style="vertical-align: inherit;">않도록 소스 배열을 초기화하는 데주의를 기울 </font><font style="vertical-align: inherit;">였습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Размеры массивов варьировались от 2 ^ 16 до 2 ^ 24 с использованием восьми циклов. </font><font style="vertical-align: inherit;">Я был осторожен, чтобы инициализировать исходные массивы, чтобы присвоение </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не просило </font></font><a href="http://en.wikipedia.org/wiki/Floating-point_unit"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FPU</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> добавить мусор памяти, интерпретируемый как double.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用八个循环，数组大小从2 ^ 16到2 ^ 24。</font><font style="vertical-align: inherit;">我小心地初始化了源数组，因此</font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分配没有要求</font></font><a href="http://en.wikipedia.org/wiki/Floating-point_unit"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FPU</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加解释为double的内存垃圾。</font></font>

source: As @Stephen Cannon points out in the comments, there is very likely possibility that this alignment causes <strong><em>false aliasing</em></strong> in the load/store units or the cache. I Googled around for this and found that Intel actually has a hardware counter for <strong><em>partial address aliasing</em></strong> stalls:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como @Stephen Cannon se&ntilde;ala en los comentarios, es muy probable que esta alineaci&oacute;n provoque </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">falsos alias</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en las unidades de carga / almacenamiento o en el cach&eacute;. </font><font style="vertical-align: inherit;">Busqu&eacute; en Google esto y descubr&iacute; que Intel en realidad tiene un contador de hardware para </font><font style="vertical-align: inherit;">puestos de </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">alias de direcciones parciales</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Stephen Cannonがコメントで指摘しているように、この配置が</font><font style="vertical-align: inherit;">ロード/ストアユニットまたはキャッシュで</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">誤ったエイリアシング</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">引き起こす可能性は非常に高い</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">私はこれをグーグル検索して、Intelが実際に</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">部分的なアドレスエイリアス</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ストールの</font><font style="vertical-align: inherit;">ためのハードウェアカウンターを持っていることを発見しました</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주석에서 @Stephen Cannon이 지적한 것처럼,이 정렬로 인해 </font><font style="vertical-align: inherit;">로드 / 저장 장치 또는 캐시에서 </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잘못된 앨리어싱</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 발생할 가능성이 큽니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">나는 이것을 둘러 보았고 인텔은 실제로 </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">부분 주소 앨리어싱</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 스톨에 </font><font style="vertical-align: inherit;">대한 하드웨어 카운터를 가지고 있음을 발견했다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как отмечает @Stephen Cannon в комментариях, очень вероятно, что это выравнивание приведет к </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ложному наложению псевдонимов</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в блоках загрузки / хранения или в кеше. </font><font style="vertical-align: inherit;">Я погуглил по этому поводу и обнаружил, что у Intel на самом деле есть аппаратный счетчик для </font><font style="vertical-align: inherit;">киосков </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">частичного адреса</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如@Stephen Cannon在评论中指出的那样，这种对齐很可能导致</font><font style="vertical-align: inherit;">加载/存储单元或缓存中</font><font style="vertical-align: inherit;">出现</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">错误的别名</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我在Google上搜索了一下，发现英特尔实际上有一个硬件计数器，用于</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">部分地址别名</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">停顿：</font></font>
