Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Within the second case the <code>Boss</code> works directly with <code>A</code> to go and fetch <code>B's</code> package until all packages are received. Then the <code>Boss</code> works with <code>C</code> to do the same for getting all of <code>D's</code> packages.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro del segundo caso, el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> trabaja directamente con </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ir a buscar </font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> paquete </font><font style="vertical-align: inherit;">de B</font><font style="vertical-align: inherit;"> hasta que se reciban todos los paquetes. Luego, el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> trabaja con </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para hacer lo mismo para obtener todos </font></font> <code>D's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> paquetes </font><font style="vertical-align: inherit;">de </font><font style="vertical-align: inherit;">D.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目のケースでは、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">直接連携して</font><font style="vertical-align: inherit;">、すべてのパッケージが受信されるまで</font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージ</font><font style="vertical-align: inherit;">を取り出し</font><font style="vertical-align: inherit;">ます。その後、</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">連携し</font><font style="vertical-align: inherit;">て、</font></font> <code>D's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべて</font><font style="vertical-align: inherit;">の</font><font style="vertical-align: inherit;">パッケージ</font><font style="vertical-align: inherit;">を取得するために同じことを行い</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 경우에 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 직접 작업하여 </font><font style="vertical-align: inherit;">모든 패키지를받을 때까지 </font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지를 </font><font style="vertical-align: inherit;">가져옵니다 </font><font style="vertical-align: inherit;">. 그런 다음 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 함께 </font><font style="vertical-align: inherit;">모든 </font></font> <code>D's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지 </font><font style="vertical-align: inherit;">를 가져 오기 위해 동일한 작업을 수행 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во втором случае </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работает напрямую с </font></font> <code>A</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы пойти и получить </font><font style="vertical-align: inherit;">пакет </font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пока все пакеты не будут получены. Тогда </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работает с </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , чтобы сделать то же самое для получения всех </font></font> <code>D's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пакетов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第二种情况下，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接与</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一起去取回</font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包裹，直到收到所有包裹为止。然后，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一起完成获取</font></font> <code>D's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有</font><font style="vertical-align: inherit;">程序包的操作。</font></font>

source: You are probably not seeing disk caching in your tests but you are probably seeing the side effects of some other form of caching.
es: Es probable que no esté viendo el almacenamiento en disco en sus pruebas,pero es probable que esté viendo los efectos secundarios de alguna otra forma de almacenamiento en disco.
ja: おそらくテストではディスクキャッシングを見ていないでしょうが、他の形式のキャッシングの副作用を見ているのではないでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">테스트에서 디스크 캐싱이 표시되지 않지만 다른 형태의 캐싱의 부작용이 표시 될 수 있습니다.</font></font>
ru: Скорее всего,вы не видите кэширования дисков в ваших тестах,но,скорее всего,вы видите побочные эффекты какой-то другой формы кэширования.
zh_cn: 你可能在测试中没有看到磁盘缓存,但你可能看到的是其他形式的缓存的副作用。

source: cache <code>a[0]</code> and <code>a[1]</code> then <code>b[0]</code> and <code>b[1]</code> and set <code>a[0] = a[0] + b[0]</code> in cache - there are now four bytes in cache, <code>a[0], a[1]</code> and <code>b[0], b[1]</code>. Cost = 100 + 100.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cach&eacute; </font></font> <code>a[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a continuaci&oacute;n, </font></font> <code>b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y ajuste </font></font> <code>a[0] = a[0] + b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cache - ahora hay cuatro bytes en la memoria cach&eacute;, </font></font> <code>a[0], a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Costo = 100 + 100.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キャッシュ</font></font> <code>a[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、</font></font> <code>b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とセット</font></font> <code>a[0] = a[0] + b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でキャッシュ-キャッシュ内の4バイト、今ある</font></font> <code>a[0], a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">コスト= 100 + 100。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캐시 </font></font> <code>a[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 </font></font> <code>b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 설정 </font></font> <code>a[0] = a[0] + b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서의 캐시 - 캐시 4 바이트 현재 존재 </font></font> <code>a[0], a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">비용 = 100 + 100</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">кэшируем </font></font> <code>a[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем </font></font> <code>b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и устанавливаем </font></font> <code>a[0] = a[0] + b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в кэш - теперь в кэше четыре байта, </font></font> <code>a[0], a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Стоимость = 100 + 100.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缓存</font></font> <code>a[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后</font><font style="vertical-align: inherit;">缓存</font></font> <code>b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并</font><font style="vertical-align: inherit;">在缓存中</font><font style="vertical-align: inherit;">设置</font></font> <code>a[0] = a[0] + b[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -现在缓存中有四个字节，</font></font> <code>a[0], a[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">费用= 100 + 100。</font></font>

source: eject <code>a[0], a[1], b[0], b[1]</code> from cache and cache <code>c[0]</code> and <code>c[1]</code> then <code>d[0]</code> and <code>d[1]</code> and set <code>c[0] = c[0] + d[0]</code> in cache. Cost = 100 + 100.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">expulsar </font></font> <code>a[0], a[1], b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la memoria cach&eacute; y la memoria cach&eacute; </font></font> <code>c[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>c[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a continuaci&oacute;n, </font></font> <code>d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el conjunto de </font></font> <code>c[0] = c[0] + d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cach&eacute;. </font><font style="vertical-align: inherit;">Costo = 100 + 100.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>a[0], a[1], b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をキャッシュから</font><font style="vertical-align: inherit;">取り出し</font><font style="vertical-align: inherit;">、</font></font> <code>c[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>c[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をキャッシュしてから</font><font style="vertical-align: inherit;">、</font></font> <code>d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>d[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">取り出し</font><font style="vertical-align: inherit;">、</font></font> <code>c[0] = c[0] + d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を設定し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">キャッシュ内の</font><font style="vertical-align: inherit;">c [0] + d [0]</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">コスト= 100 + 100。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">토출 </font></font> <code>a[0], a[1], b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 캐시에서 캐시 </font></font> <code>c[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>c[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 </font></font> <code>d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font></font> <code>d[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 집합 </font></font> <code>c[0] = c[0] + d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 캐시의 </font><font style="vertical-align: inherit;">c [0] + d [0] </font><font style="vertical-align: inherit;">비용 = 100 + 100</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">извлеките </font></font> <code>a[0], a[1], b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из кэша и кэша </font></font> <code>c[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>c[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем </font></font> <code>d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и установите </font></font> <code>c[0] = c[0] + d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в кеше. </font><font style="vertical-align: inherit;">Стоимость = 100 + 100.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从缓存中</font><font style="vertical-align: inherit;">弹出</font></font> <code>a[0], a[1], b[0], b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后缓存</font></font> <code>c[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>c[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后</font></font> <code>d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并设置</font></font> <code>c[0] = c[0] + d[0]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缓存中的</font><font style="vertical-align: inherit;">c [0] + d [0]</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">费用= 100 + 100。</font></font>

source: set <code>a[1] = a[1] + b[1]</code> in cache. Cost = 1 + 1.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">establecer </font></font> <code>a[1] = a[1] + b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cach&eacute;. </font><font style="vertical-align: inherit;">Costo = 1 + 1.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セット</font></font> <code>a[1] = a[1] + b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でキャッシュ。</font><font style="vertical-align: inherit;">コスト= 1 + 1。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세트 </font></font> <code>a[1] = a[1] + b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 캐시. </font><font style="vertical-align: inherit;">비용 = 1 + 1</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">установить </font></font> <code>a[1] = a[1] + b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в кеше. </font><font style="vertical-align: inherit;">Стоимость = 1 + 1.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在缓存中</font><font style="vertical-align: inherit;">设置</font></font> <code>a[1] = a[1] + b[1]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">费用= 1 + 1。</font></font>

source: the other loop
es: el otro bucle
ja: たほうループ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 루프</font></font>
ru: другой контур
zh_cn: 另一环

source: will page out two arrays and page in the other two <strong>every time around the loop</strong>. This would obviously be <strong>much</strong> slower.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buscar&aacute; dos matrices y buscar&aacute; en las otras dos </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cada vez alrededor del bucle</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Obviamente, esto ser&iacute;a </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mucho</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> m&aacute;s lento.</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ループを回るたび</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に、2つの配列をページアウトし、他の2つをページイン</font><strong><font style="vertical-align: inherit;">します</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは明らかに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はるかに</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遅くなります。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프 주위에서 매번</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 두 배열을 페이징하고 다른 배열을 페이징 </font><strong><font style="vertical-align: inherit;">합니다</font></strong><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이것은 분명히 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">훨씬</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 느려질 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">будет выводить два массива и страницу в двух других </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">каждый раз вокруг цикла</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это, очевидно, будет </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">намного</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> медленнее.</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每次循环</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都会分页出两个数组，并分页到另外两个</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这显然是</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很多</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">慢。</font></font>
