Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: However; it is not to say that these new questions are not of importance because they themselves are and they do play a role after all. They do impact the procedures and the overall performance and that is evident with the various graphs and assessments from many who have given their answer(s) and or comment(s). If you pay attention to the analogy of the <code>Boss</code> and the two workers <code>A</code> &amp; <code>B</code> who had to go and retrieve packages from <code>C</code> &amp; <code>D</code> respectively and considering the mathematical notations of the two algorithms in question you can see that without even the involvement of the computer <code>Case 2</code> is approximately 60% faster than <code>Case 1</code> and when you look at the graphs and charts after these algorithms have been applied to source code, compiled and optimized and executed through the OS to perform operations on the given hardware you even see a little more degradation between the differences in these algorithms.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo; no quiere decir que estas nuevas preguntas no sean importantes porque ellas mismas lo son y juegan un papel despu&eacute;s de todo. Impactan los procedimientos y el rendimiento general y eso es evidente con los diversos gr&aacute;ficos y evaluaciones de muchos que han dado sus respuestas y / o comentarios. Si prestas atenci&oacute;n a la analog&iacute;a del </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los dos trabajadores </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que tuvieron que ir y recuperar paquetes de </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> respectivamente y considerando las anotaciones matem&aacute;ticas de los dos algoritmos en cuesti&oacute;n, puedes ver eso sin siquiera la participaci&oacute;n del la computadora </font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es aproximadamente un 60% m&aacute;s r&aacute;pida que la </font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y cuando mira los gr&aacute;ficos y cuadros despu&eacute;s de que estos algoritmos se hayan aplicado al c&oacute;digo fuente, compilado y optimizado y ejecutado a trav&eacute;s del sistema operativo para realizar operaciones en el hardware dado, incluso ver&aacute; un poco m&aacute;s de degradaci&oacute;n entre las diferencias en estos algoritmos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかしながら;これらの新しい質問は、それ自体が重要であり、結局のところ役割を果たすので、重要ではないと言っているのではありません。これらは手順と全体的なパフォーマンスに影響を与えます。これは、回答やコメントを提供した多くの人からのさまざまなグラフや評価から明らかです。</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と、</font><font style="vertical-align: inherit;">それぞれ</font> <code>C</code> <font style="vertical-align: inherit;">＆</font> <code>D</code> <font style="vertical-align: inherit;">からパッケージを取得および取得する必要があっ</font><font style="vertical-align: inherit;">た2人の労働者</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の類比に注意を払い</font><font style="vertical-align: inherit;">、問題の2つのアルゴリズムの数学的表記法を検討すると、コンピュータ</font> <code>Case 2</code> <font style="vertical-align: inherit;">は、</font> <code>Case 1</code> <font style="vertical-align: inherit;">より約60％高速です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> これらのアルゴリズムがソースコードに適用され、コンパイルおよび最適化され、OSを介して所定のハードウェアで操作を実行した後、グラフとチャートを見ると、これらのアルゴリズムの違いが少し悪化していることがわかります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나; 이 새로운 질문들이 그들 자신이기 때문에 중요하지 않다고 말할 수는 없습니다. 그것들은 절차와 전반적인 성과에 영향을 미치며, 답변이나 의견을 제시 한 많은 사람들의 다양한 그래프와 평가를 통해 분명해집니다. </font> <code>C</code> <font style="vertical-align: inherit;"> 와 </font> <code>D</code> 에서<font style="vertical-align: inherit;"> 각각 </font><font style="vertical-align: inherit;">패키지를 가져 와서 가져와야 </font><font style="vertical-align: inherit;">하는 두 명의 작업자 </font> <code>A</code> <font style="vertical-align: inherit;"> 와 </font> <code>B</code> <font style="vertical-align: inherit;"> 와 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 유추에주의를 기울이고 </font><font style="vertical-align: inherit;">문제가있는 두 알고리즘의 수학적 표기법을 고려하면 컴퓨터 </font> <code>Case 2</code> <font style="vertical-align: inherit;"> 는 </font> <code>Case 1</code> <font style="vertical-align: inherit;"> 보다 약 60 % 빠릅니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이러한 알고리즘이 소스 코드에 적용된 후 OS를 통해 컴파일 및 최적화 및 실행되어 주어진 하드웨어에서 작업을 수행 한 후 그래프 및 차트를 보면 알고리즘의 차이점 사이에서 약간의 성능 저하를 볼 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако; Нельзя сказать, что эти новые вопросы не важны, потому что они сами по себе и играют роль в конце концов. Они действительно влияют на процедуры и общую эффективность, и это видно из различных графиков и оценок от многих, которые дали свои ответы и / или комментарии. Если вы обратите внимание на аналогию с </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и двумя работниками </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>B</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> которые должны были пойти и получить пакеты из </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соответственно, и с учетом математических обозначений этих двух алгоритмов, вы можете увидеть, что даже без участия Компьютерный </font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> примерно на 60% быстрее, чем компьютерный </font></font> <code>Case 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и когда вы смотрите на графики и диаграммы после того, как эти алгоритмы были применены к исходному коду, скомпилированы и оптимизированы и выполнены с помощью ОС для выполнения операций на данном оборудовании, вы даже увидите немного большее ухудшение различий в этих алгоритмах.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然而;并不是说这些新问题并不重要，因为它们本身是重要的，而且它们毕竟会发挥作用。它们确实会影响程序和整体性能，这在许多给出答案和/或评论的图表和评估中很明显。如果您注意</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和两个工人</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的类比，</font><font style="vertical-align: inherit;">他们不得不</font><font style="vertical-align: inherit;">分别</font><font style="vertical-align: inherit;">从</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">那里取回包裹，</font><font style="vertical-align: inherit;">并考虑这两个算法的数学符号，您会发现，甚至没有计算机</font></font> <code>Case 2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比</font> <code>Case 1</code> <font style="vertical-align: inherit;">快60％</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 当您将这些算法应用于源代码，通过OS进行编译，优化和执行以在给定的硬件上执行操作之后查看图形和图表时，这些算法之间的差异甚至会有所降低。</font></font>

source: I don't know if poor benchmark code is to blame, or what, but the two methods are within 10% of each other on my machine using the following code, and one loop is usually just slightly faster than two - as you'd expect.
es: No sé si la culpa es del mal código de referencia,o qué,pero los dos métodos están dentro del 10% de cada uno en mi máquina usando el siguiente código,y un bucle suele ser un poco más rápido que dos-como es de esperar.
ja: ベンチマークコードの貧弱さが原因なのか何なのかはわかりませんが、私のマシンでは以下のコードを使って2つのメソッドは互いに10%以内に収まっています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나쁜 벤치 마크 코드가 무엇인지 비난할지 모르겠지만 다음 코드를 사용하여 두 방법이 내 컴퓨터에서 서로 10 % 이내에 있으며 한 루프는 일반적으로 두 개보다 약간 빠릅니다. 배고 있다.</font></font>
ru: Я не знаю,виноват ли в этом плохой код бенчмарка или нет,но эти два метода находятся в пределах 10% друг от друга на моей машине,используя следующий код,и один цикл обычно немного быстрее,чем два-как и следовало ожидать.
zh_cn: 我不知道是基准代码差,还是什么原因,但在我的机器上使用下面的代码,这两个方法的速度都在10%以内,而且一个循环通常只比两个快一点--正如你所期望的那样。

source: I played around with various schemes, such as putting the assignment of <code>b[j]</code>, <code>d[j]</code> to <code>InitToZero[j]</code> inside the loops, and also with using <code>+= b[j] = 1</code> and <code>+= d[j] = 1</code>, and I got fairly consistent results.
es: <font style="vertical-align: inherit;"> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"> con varios esquemas, como poner la asignaci&oacute;n de </font></font> <code>b[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>d[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">InitToZero [j]</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de los bucles, y tambi&eacute;n usando </font></font> <code>+= b[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>+= d[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y obtuve resultados bastante consistentes.</font></font>
ja: <font style="vertical-align: inherit;"> <code>InitToZero[j]</code> <font style="vertical-align: inherit;">へ</font><font style="vertical-align: inherit;">の</font></font> <code>b[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>d[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の割り当てを</font><font style="vertical-align: inherit;">ループ内に</font><font style="vertical-align: inherit;">配置するなどのさまざまなスキーム</font><font style="vertical-align: inherit;">を</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">試し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たり、</font></font> <code>+= b[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>+= d[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、かなり一貫した結果が得られました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프 내부 </font><font style="vertical-align: inherit;">에 </font></font> <code>b[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>d[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font></font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">할당</font><font style="vertical-align: inherit;"> 하고 </font></font> <code>+= b[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>+= d[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용 </font><font style="vertical-align: inherit;">하는 등 다양한 구성표를 가지고 놀았습니다 </font><font style="vertical-align: inherit;">. = 1</font><font style="vertical-align: inherit;"> 이고 상당히 일관된 결과를 얻었습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я поиграл с различными схемами, такими как помещение присвоения </font></font> <code>b[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>d[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри циклов, а также с использованием </font></font> <code>+= b[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>+= d[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и я получил довольно последовательные результаты.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我</font> <code>InitToZero[j]</code> <font style="vertical-align: inherit;">了各种方案，例如将</font></font> <code>b[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>d[j]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的赋值分配</font><font style="vertical-align: inherit;">给</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">InitToZero [j]</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到循环内，还使用</font></font> <code>+= b[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>+= d[j] = 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我得到了相当一致的结果。</font></font>

source: I run Visual&nbsp;Studio&nbsp;2015 on an E5-1620 3.5&nbsp;GHz processor with 16&nbsp;GB RAM.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejecuto Visual Studio 2015 en un procesador E5-1620 3.5 GHz con 16 GB de RAM.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">16 GBのRAMを搭載したE5-1620 3.5 GHzプロセッサでVisual Studio 2015を実行しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">16GB RAM이있는 E5-1620 3.5GHz 프로세서에서 Visual Studio 2015를 실행합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использую Visual Studio 2015 на процессоре E5-1620 с частотой 3,5 ГГц и 16 ГБ ОЗУ.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我在具有16 GB RAM的E5-1620 3.5 GHz处理器上运行Visual Studio 2015。</font></font>

source: I suspect you are beginning to see where I am going.
es: Sospecho que estás empezando a ver a dónde voy.
ja: 私が何をしようとしているのか見え始めているのではないかと疑っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가가는 곳을보기 시작한 것 같습니다.</font></font>
ru: Подозреваю,вы начинаете понимать,куда я иду.
zh_cn: 我怀疑你已经开始明白我的去处了。

source: I will now begin to explain how all of this works below.
es: Ahora empezaré a explicar cómo funciona todo esto a continuación.
ja: では、以下にこれらの全ての仕組みを説明していきたいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제이 모든 것이 아래에서 어떻게 작동하는지 설명하겠습니다.</font></font>
ru: Теперь я начну объяснять,как все это работает ниже.
zh_cn: 下面我就开始解释一下这一切是如何运作的。

source: I'm not sure exactly what's going on here... Alignment could still play an effect as Agner Fog mentions <a href="http://www.agner.org/optimize/blog/read.php?i=142">cache bank conflicts</a>. (That link is about Sandy Bridge, but the idea should still be applicable to Core 2.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No estoy seguro exactamente de lo que est&aacute; sucediendo aqu&iacute; ... La alineaci&oacute;n a&uacute;n podr&iacute;a tener un efecto ya que Agner Fog menciona </font></font><a href="http://www.agner.org/optimize/blog/read.php?i=142"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">conflictos de bancos de cach&eacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(Ese enlace es sobre Sandy Bridge, pero la idea a&uacute;n deber&iacute;a ser aplicable a Core 2).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで何が起こっているのか正確にはわかりません... Agner Fogが</font></font><a href="http://www.agner.org/optimize/blog/read.php?i=142"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キャッシュバンクの競合</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について言及しているため、アライメントは依然として効果を発揮する可能性があります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">（このリンクはSandy Bridgeに関するものですが、このアイデアはCore 2にも適用できるはずです。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정확히 무슨 일이 일어나고 있는지 잘 모르겠습니다 ... Agner Fog가 </font></font><a href="http://www.agner.org/optimize/blog/read.php?i=142"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캐시 뱅크 충돌을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 언급하면서 정렬은 여전히 ​​효과를 발휘할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">(이 링크는 Sandy Bridge에 관한 것이지만 아이디어는 여전히 Core 2에 적용 가능해야합니다.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я точно не знаю, что здесь происходит ... Выравнивание может сыграть свою роль, поскольку Агнер Фог упоминает о </font></font><a href="http://www.agner.org/optimize/blog/read.php?i=142"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">конфликтах банков кеша</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">(Эта ссылка о Sandy Bridge, но идея должна быть применима и к Core 2.)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我不确定这到底是怎么回事...对齐仍然可以发挥作用，因为Agner Fog提到了</font></font><a href="http://www.agner.org/optimize/blog/read.php?i=142"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缓存库冲突</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">（该链接是关于Sandy Bridge的，但该想法仍应适用于Core2。）</font></font>

source: I'm not sure why it was decided that MFLOPS was a relevant metric. I though the idea was to focus on memory accesses, so I tried to minimize the amount of floating point computation time. I left in the <code>+=</code>, but I am not sure why.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No estoy seguro de por qu&eacute; se decidi&oacute; que MFLOPS era una m&eacute;trica relevante. </font><font style="vertical-align: inherit;">Pens&eacute; que la idea era centrarme en los accesos a la memoria, as&iacute; que intent&eacute; minimizar la cantidad de tiempo de c&aacute;lculo de coma flotante. </font><font style="vertical-align: inherit;">Me fui en el </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero no estoy seguro de por qu&eacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MFLOPSが適切な測定基準であると決定された理由がわかりません。</font><font style="vertical-align: inherit;">考えはメモリアクセスに集中することだったので、浮動小数点の計算時間を最小限にしようとしました。</font></font> <code>+=</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ままにしましたが、</font><font style="vertical-align: inherit;">理由はわかりません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MFLOPS가 관련 측정 항목으로 결정된 이유를 잘 모르겠습니다. </font><font style="vertical-align: inherit;">아이디어는 메모리 액세스에 중점을 두었지만 부동 소수점 계산 시간을 최소화하려고했습니다. </font><font style="vertical-align: inherit;">나는 </font></font> <code>+=</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 떠났지만 </font><font style="vertical-align: inherit;">그 이유를 모르겠습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я не уверен, почему было решено, что MFLOPS был уместным показателем. </font><font style="vertical-align: inherit;">Хотя идея заключалась в том, чтобы сосредоточиться на доступе к памяти, поэтому я попытался минимизировать время вычислений с плавающей запятой. </font><font style="vertical-align: inherit;">Я ушел в </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но я не уверен, почему.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我不确定为什么决定MFLOPS是一个相关指标。</font><font style="vertical-align: inherit;">尽管我的想法是专注于内存访问，所以我尝试将浮点计算时间减至最少。</font><font style="vertical-align: inherit;">我离开了</font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但是我不确定为什么。</font></font>
