Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It is the only point, where one-loop (namely with continuous allocation) beats the two-loop version. (This made Mysticial's answer possible, at all.)
es: Es el único punto en el que un bucle (es decir,con asignación continua)supera a la versión de dos bucles.(Esto hizo posible la respuesta de Mysticial,en absoluto.)
ja: 1ループ(すなわち連続割付)が2ループ版に勝るのはここだけです。(これでMysticialの回答は全く可能になりました)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이는 단일 루프 (즉, 연속 할당)가 2 루프 버전을 능가하는 유일한 지점입니다. </font><font style="vertical-align: inherit;">(이로 인해 Mysticial의 대답이 가능해졌습니다.)</font></font>
ru: Это единственный пункт,где одноконтурная (а именно,с непрерывным распределением)превосходит двухконтурную версию.(Это сделало ответ Мистичала вообще возможным.)
zh_cn: 这是唯一的一点,单环(即用连续分配)击败了双环版。(这使得Mysticial的答案成为了可能,根本就是这样)。

source: It may be old C++ and optimizations. On my computer I obtained almost the same speed:
es: Puede ser el viejo C++y las optimizaciones.En mi computadora obtuve casi la misma velocidad:
ja: それは古いC++と最適化かもしれません。私のコンピュータでは、私はほぼ同じ速度を得た。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오래된 C ++ 및 최적화 일 수 있습니다. </font><font style="vertical-align: inherit;">내 컴퓨터에서 나는 거의 같은 속도를 얻었습니다.</font></font>
ru: Это может быть старый С++и оптимизации.На моем компьютере я получил почти такую же скорость:
zh_cn: 可能是老的C++和优化。在我的电脑上,我获得了几乎相同的速度。

source: It might also be interesting to point out the differences between CPU/cache architectures, by providing a similar graph for these CPUs.
es: También podría ser interesante señalar las diferencias entre las arquitecturas de CPUcache,proporcionando un gráfico similar para estas CPU.
ja: また、CPUcache アーキテクチャ間の違いを指摘するために、これらの CPU について同様のグラフを提供するのも面白いかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 CPU에 대해 유사한 그래프를 제공하여 CPU / 캐시 아키텍처의 차이점을 지적하는 것도 흥미로울 수 있습니다.</font></font>
ru: Также может быть интересно указать на различия между архитектурами CPUcache,предоставив аналогичный график для этих процессоров.
zh_cn: 通过为这些CPU提供类似的图形,指出CPUcache架构之间的差异,可能也是很有意思的。

source: It possesses the greatest discrepancy between the one and two loop'ed version (almost a factor of three)
es: Posee la mayor discrepancia entre la versión de uno y dos bucles (casi un factor de tres)
ja: 1ループ版と2ループ版の最大の不一致(ほぼ3分の1)を持っている
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 하나와 두 개의 루프 버전 사이에 가장 큰 불일치를 가지고 있습니다 (거의 세 배)</font></font>
ru: Обладает наибольшим расхождением между версией с одним и двумя циклами (почти в три раза).
zh_cn: 它拥有一环和二环版之间最大的差距(几乎是三倍的差距)。

source: It's because the CPU doesn't have so many cache misses (where it has to wait for the array data to come from the RAM chips). It would be interesting for you to adjust the size of the arrays continually so that you exceed the sizes of the <a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches">level 1 cache</a> (L1), and then the <a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches">level 2 cache</a> (L2), of your CPU and plot the time taken for your code to execute against the sizes of the arrays. The graph shouldn't be a straight line like you'd expect.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es porque la CPU no tiene tantos errores de cach&eacute; (donde tiene que esperar a que los datos de la matriz provengan de los chips RAM). </font><font style="vertical-align: inherit;">Ser&iacute;a interesante para usted ajustar el tama&ntilde;o de las matrices continuamente para que exceda los tama&ntilde;os de la </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cach&eacute; de nivel 1</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L1), y luego la </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cach&eacute; de nivel 2</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L2), de su CPU y graficar el tiempo necesario para su c&oacute;digo ejecutar contra los tama&ntilde;os de las matrices. </font><font style="vertical-align: inherit;">El gr&aacute;fico no deber&iacute;a ser una l&iacute;nea recta como cabr&iacute;a esperar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、CPUにそれほど多くのキャッシュミスがないためです（RAMチップからアレイデータが送信されるのを待つ必要があります）。</font><font style="vertical-align: inherit;">配列のサイズを継続的に調整して</font><font style="vertical-align: inherit;">、CPU </font><font style="vertical-align: inherit;">の</font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">レベル1キャッシュ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（L1）、次に</font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">レベル2キャッシュ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（L2）</font><font style="vertical-align: inherit;">のサイズを超えるように</font><font style="vertical-align: inherit;">し、コードにかかる時間をプロット</font><font style="vertical-align: inherit;">することは興味深いでしょう</font><font style="vertical-align: inherit;">配列のサイズに対して実行します。</font><font style="vertical-align: inherit;">グラフは予想したような直線であってはなりません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CPU에 캐시 누락이 많지 않기 때문입니다 (어레이 데이터가 RAM 칩에서 나올 때까지 기다려야 함). </font><font style="vertical-align: inherit;">CPU </font><font style="vertical-align: inherit;">의 </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">레벨 1 캐시</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L1), </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">레벨 2 캐시</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L2) </font><font style="vertical-align: inherit;">의 크기를 초과하고 </font><font style="vertical-align: inherit;">코드에 걸리는 시간을 플롯 </font><font style="vertical-align: inherit;">하도록 배열의 크기를 계속 조정하는 것이 흥미로울 것입니다. </font><font style="vertical-align: inherit;">배열의 크기에 대해 실행합니다. </font><font style="vertical-align: inherit;">그래프는 예상대로 직선이 아니어야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это связано с тем, что в процессоре не так много промахов кэша (когда ему приходится ждать получения данных массива из микросхем ОЗУ). </font><font style="vertical-align: inherit;">Было бы интересно непрерывно корректировать размер массивов, чтобы вы превышали размеры </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">кэша 1-го уровня</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L1), а затем </font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">кэша 2-го уровня</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (L2) вашего ЦП и отображали время, необходимое для вашего кода. выполнить по размерам массивов. </font><font style="vertical-align: inherit;">График не должен быть прямой линией, как вы ожидаете.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是因为CPU没有太多的高速缓存未命中（它必须等待阵列数据来自RAM芯片）。</font><font style="vertical-align: inherit;">您将不断调整数组的大小，使其超过</font><font style="vertical-align: inherit;">CPU的</font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1级缓存</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（L1）和</font></font><a href="http://en.wikipedia.org/wiki/CPU_cache#Multi-level_caches"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2级缓存</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（L2）的大小，并绘制代码花费的时间，</font><font style="vertical-align: inherit;">这将很有趣。</font><font style="vertical-align: inherit;">对数组的大小执行。</font><font style="vertical-align: inherit;">该图不应是您期望的直线。</font></font>

source: It's not because of a different code, but because of caching: RAM is slower than the CPU registers and a cache memory is inside the CPU to avoid to write the RAM every time a variable is changing. But the cache is not big as the RAM is, hence, it maps only a fraction of it.
es: No es por un código diferente,sino por el caching:la RAM es más lenta de lo que registra la CPU y hay una memoria cache dentro de la CPU para evitar escribir la RAM cada vez que una variable cambia.Pero el caché no es tan grande como la RAM,por lo tanto,sólo mapea una fracción de ella.
ja: これはコードが違うからではなく、キャッシュのせいです:RAMはCPUのレジスタよりも遅く、変数が変わるたびにRAMに書き込むのを避けるためにCPUの内部にキャッシュメモリがあります。しかし、キャッシュはRAMほど大きくないので、それゆえに、それはそれのほんの一部をマッピングします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 코드 때문이 아니라 캐싱 때문입니다. RAM이 CPU 레지스터보다 느리고 변수가 변경 될 때마다 RAM을 쓰지 않도록 캐시 메모리가 CPU 내부에 있습니다. </font><font style="vertical-align: inherit;">그러나 캐시는 RAM만큼 크지 않으므로 캐시의 일부만 매핑합니다.</font></font>
ru: Это не из-за другого кода,а из-за кэширования:оперативная память медленнее,чем регистры CPU,а кэш-память находится внутри CPU,чтобы избежать записи оперативной памяти каждый раз,когда меняется переменная.Но кэш не такой большой,как оперативная память,поэтому он отображает лишь малую ее часть.
zh_cn: 这不是因为代码不同,而是因为缓存的原因:RAM比CPU的寄存器慢,CPU内部有一个缓存存储器,避免每次变量变化时都要写RAM。但缓存并没有RAM那么大,因此,缓存只映射了其中的一小部分。

source: Looking at it from this kind of an approach without involving how the Hardware, OS and Compiler(s) works together to do heap allocations that involves working with RAM, Cache, Page Files, etc.; the mathematics that are at the foundation of these algorithms shows us which of these two is the better solution. We can use an analogy where a <code>Boss</code> or <code>Summation</code> that will represent a <code>For Loop</code> that has to travel between workers <code>A</code> &amp; <code>B</code> we can easily see that <strong>Case 2</strong> is at least <strong><sup>1</sup>/<sub>2</sub></strong> as fast if not a little more than <strong>Case 1</strong> due to the difference in the distance that is needed to travel and the time taken between the workers. This math lines up almost virtually and perfectly with both the Bench Mark Times as well as the amount of differences in Assembly Instructions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mir&aacute;ndolo desde este tipo de enfoque sin involucrar c&oacute;mo el hardware, el sistema operativo y el compilador (es) trabajan juntos para hacer asignaciones de almacenamiento din&aacute;mico que implica trabajar con RAM, cach&eacute;, archivos de p&aacute;gina, etc. Las matem&aacute;ticas que est&aacute;n en la base de estos algoritmos nos muestran cu&aacute;l de estos dos es la mejor soluci&oacute;n. Podemos utilizar una analog&iacute;a donde un </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>Summation</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que representar&aacute;n un </font></font> <code>For Loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que tiene que viajar entre los trabajadores </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos ver f&aacute;cilmente que </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el caso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es al menos </font></font><strong><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tan r&aacute;pido si no un poco m&aacute;s de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">caso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">debido a la diferencia en la distancia que se necesita para viajar y el tiempo necesario entre los trabajadores. </font><font style="vertical-align: inherit;">Esta matem&aacute;tica se alinea casi virtualmente y perfectamente tanto con el Bench Mark Times como con la cantidad de diferencias en las Instrucciones de ensamblaje.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAM、キャッシュ、ページファイルなどの操作を含むヒープ割り当てを行うためにハードウェア、OS、およびコンパイラがどのように連携するかを伴わずに、この種のアプローチからそれを見てください。これらのアルゴリズムの基礎となる数学は、これらの2つのうちどちらが優れたソリューションであるかを示しています。私たちは、類推使用することができます</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font> <code>Summation</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表現する</font></font> <code>For Loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の労働者の間で移動しなければならない</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、我々は簡単にすることを見ることができる</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース2は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、少なくともある</font></font><strong><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">より少し多くない場合は、高速として</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ケース1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">移動に必要な距離と労働者間の時間が異なるためです。</font><font style="vertical-align: inherit;">この数学は、ベンチマークタイムと組み立て説明書の違いの両方の両方とほぼ事実上完全に一致しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">RAM, 캐시, 페이지 파일 등을 사용하는 힙 할당을 수행하기 위해 하드웨어, OS 및 컴파일러가 함께 작동하는 방식을 포함하지 않고 이러한 종류의 접근 방식에서이를 살펴보십시오. 이 알고리즘의 기초가되는 수학은이 두 가지 중 어느 것이 더 나은 솔루션인지 보여줍니다. 우리는 비유 사용할 수 있습니다 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 나 </font></font> <code>Summation</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 나타냅니다 </font></font> <code>For Loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 근로자 사이의 여행에 가지고 </font><font style="vertical-align: inherit;">&amp; </font> <code>B</code> 를<font style="vertical-align: inherit;"> 우리가 쉽게 볼 수있는 </font><strong><font style="vertical-align: inherit;">사례 2는</font></strong><font style="vertical-align: inherit;"> 적어도입니다 </font><strong><sup><font style="vertical-align: inherit;">1</font></sup></strong><strong><font style="vertical-align: inherit;"> / </font></strong><strong><sub><font style="vertical-align: inherit;">2</font></sub></strong><font style="vertical-align: inherit;"> 빠른처럼하지 조금 더 이상의 </font><strong><font style="vertical-align: inherit;">사례 1</font></strong></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font><strong><sup><font style="vertical-align: inherit;"></font></sup><font style="vertical-align: inherit;"></font><sub><font style="vertical-align: inherit;"></font></sub></strong><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여행하는 데 필요한 거리와 작업자 간 소요 시간의 차이로 인해 </font><font style="vertical-align: inherit;">이 수학은 벤치 마크 시간과 조립 지침의 차이의 양과 거의 사실상 완벽하게 일치합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рассматривая его с точки зрения такого подхода, без учета того, как аппаратное обеспечение, ОС и компилятор (-ы) работают вместе для выделения кучи, которая включает в себя работу с ОЗУ, кэш-памятью, файлами подкачки и т. Д .; математика, лежащая в основе этих алгоритмов, показывает нам, какой из этих двух вариантов является лучшим решением. Мы можем использовать аналогию , </font><font style="vertical-align: inherit;">где </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>Summation</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который будет представлять собой </font></font> <code>For Loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который должен пройти между рабочими </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , мы можем легко увидеть , </font><font style="vertical-align: inherit;">что </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случай 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , по </font><font style="vertical-align: inherit;">крайней мере </font></font><strong><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , как быстро , </font><font style="vertical-align: inherit;">если не немного больше , </font><font style="vertical-align: inherit;">чем </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">случай 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">из-за разницы в расстоянии, необходимом для поездки, и времени, затрачиваемом между рабочими. </font><font style="vertical-align: inherit;">Эта математика почти виртуально и идеально сочетается как с Bench Mark Times, так и с количеством различий в инструкциях по сборке.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从这种方法看待它，而无需涉及硬件，操作系统和编译器如何协同工作以进行堆分配，这涉及使用RAM，缓存，页面文件等。这些算法基础上的数学方法向我们展示了这两种方法中哪种更好。我们可以用一个比喻，其中一个</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>Summation</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，将代表一个</font></font> <code>For Loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有工人之间的旅行</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>B</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，我们不难看出，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第2种情况</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是至少</font></font><strong><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sub></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一样快，如果不是有点超过</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">案例1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由于行进距离和工人之间花费的时间不同。</font><font style="vertical-align: inherit;">该数学运算几乎与基准时间以及汇编说明中的差异几乎完全一致。</font></font>
