Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: would first cause <code>a</code> and <code>b</code> to be loaded into RAM and then be worked on entirely in RAM. When the second loop starts, <code>c</code> and <code>d</code> would then be loaded from disk into RAM and operated on.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">primero har&iacute;a que </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se carguen en la RAM y luego se trabaje completamente en la RAM. </font><font style="vertical-align: inherit;">Cuando el segundo bucle se inicia, </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&iacute;an entonces cargados desde el disco en la memoria RAM y operado.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初に</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をRAMにロードしてから、完全にRAMで作業します。</font><font style="vertical-align: inherit;">2番目のループが始まると、</font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がディスクからRAMに読み込まれ、操作されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 RAM에로드 된 다음 RAM에서 완전히 작동합니다. </font><font style="vertical-align: inherit;">두 번째 루프가 시작되면 </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 디스크에서 RAM으로로드되어 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сначала будет вызывать </font><font style="vertical-align: inherit;">загрузку </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в RAM, а затем полностью работать в RAM. </font><font style="vertical-align: inherit;">Когда начинается второй цикл, </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем загружаются с диска в RAM и работают.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">首先会导致</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加载到RAM中，然后完全在RAM中处理。</font><font style="vertical-align: inherit;">当第二个循环开始时，</font><font style="vertical-align: inherit;">然后将</font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从磁盘加载到RAM中并进行操作。</font></font>
