Repository: rueisnom/feedback
Catalog: xlf/85/47/77/8/8547778.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: We do not know how long it will take for each case unless if we set a counter and run a bench mark test. However the bench marks were already included from the original question and from some of the answers and comments as well and we can see a significant difference between the two and this is the whole reasoning of this question to this problem and for the answering of it to begin with.
es: No sabemos cuánto tiempo tomará cada caso a menos que pongamos un contador y hagamos una prueba de referencia.Sin embargo,los puntos de referencia ya se incluyeron en la pregunta original y en algunas de las respuestas y comentarios también y podemos ver una diferencia significativa entre los dos y este es todo el razonamiento de esta pregunta a este problema y para la respuesta de la misma para empezar.
ja: それぞれのケースでどのくらいの時間がかかるかは、カウンターを設置してベンチマークテストをしてみないとわかりません。しかし、ベンチマークは、元の質問と同様にいくつかの回答とコメントからすでに含まれており、我々は2つの間に大きな違いを見ることができ、これは、この問題に対するこの質問の全体の理由と、それを回答するための最初の問題です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">카운터를 설정하고 벤치 마크 테스트를 실행하지 않으면 각 경우에 걸리는 시간을 모릅니다. </font><font style="vertical-align: inherit;">그러나 벤치 마크는 이미 원래 질문과 일부 답변 및 의견에서 이미 포함되어 있으며이 둘 사이의 중요한 차이점을 알 수 있습니다.이 질문에 대한이 질문과 그에 대한 대답에 대한 전체 추론입니다. 로 시작하십시오.</font></font>
ru: Мы не знаем,сколько времени займет каждый случай,если только не установим счетчик и не проведем стендовый тест.Однако эталонные оценки уже включены в исходный вопрос,а также в некоторые ответы и комментарии,и мы видим существенную разницу между ними,и в этом и заключается вся суть вопроса,с которого начинается ответ на эту проблему и ответ на него.
zh_cn: 我们不知道每道题要花多少时间,除非我们设置一个计数器,做一个基准分数测试。然而,从原题和一些答案和评论中已经包含了基准分数,我们可以看到两者之间有很大的差异,这就是这个问题的整个推理,也是这个问题的答案的开始。

source: We know is that his loop will run 100,000 times. We also know that <code>a1</code>, <code>b1</code>, <code>c1</code> &amp; <code>d1</code> are pointers on a 64-bit architecture. Within C++ on a 32-bit machine all pointers are 4 bytes and on a 64-bit machine they are 8 bytes in size since pointers are of a fixed length. We know that we have 32 bytes in which to allocate for in both cases. The only difference is we are allocating 32 bytes or 2 sets of 2-8bytes on each iteration where in the 2nd case we are allocating 16 bytes for each iteration for both of the independent loops. So both loops still equals 32 bytes in total allocations. With this information let's go ahead and show the general math, algorithm and analogy of it. We do know the amount of times that the same set or group of operations will have to be performed in both cases. We do know the amount of memory that needs to be allocated in both cases. We can asses that the overall work load of the allocations between both cases will be approximately the same.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sabemos que su ciclo se ejecutar&aacute; 100,000 veces. </font><font style="vertical-align: inherit;">Tambi&eacute;n sabemos que </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">son punteros en una arquitectura de 64 bits. Dentro de C ++ en una m&aacute;quina de 32 bits, todos los punteros tienen 4 bytes y en una m&aacute;quina de 64 bits tienen un tama&ntilde;o de 8 bytes, ya que los punteros tienen una longitud fija. Sabemos que tenemos 32 bytes para asignar en ambos casos. La &uacute;nica diferencia es que estamos asignando 32 bytes o 2 conjuntos de 2-8 bytes en cada iteraci&oacute;n, en el segundo caso estamos asignando 16 bytes para cada iteraci&oacute;n para los dos bucles independientes. Entonces, ambos bucles a&uacute;n equivalen a 32 bytes en asignaciones totales. Con esta informaci&oacute;n sigamos adelante y muestremos las matem&aacute;ticas generales, el algoritmo y la analog&iacute;a de los mismos. Sabemos la cantidad de veces que el mismo conjunto o grupo de operaciones tendr&aacute; que realizarse en ambos casos. Sabemos la cantidad de memoria que debe asignarse en ambos casos.Podemos evaluar que la carga de trabajo general de las asignaciones entre ambos casos ser&aacute; aproximadamente la misma.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私たちは彼のループが100,000回実行されることを知っています。</font><font style="vertical-align: inherit;">また、</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64ビットアーキテクチャ上のポインタです。 32ビットマシンのC ++では、ポインターは固定長であるため、すべてのポインターは4バイトであり、64ビットマシンでは8バイトです。どちらの場合も割り当てるバイト数は32バイトです。唯一の違いは、反復ごとに32バイトまたは2〜2バイトの2セットを割り当てることです。2番目のケースでは、両方の独立したループの反復ごとに16バイトを割り当てます。したがって、両方のループは合計割り当てで32バイトに等しくなります。この情報を使って、先に進み、一般的な数学、アルゴリズム、およびその類似性を示しましょう。どちらの場合も、同じ操作または操作のグループを実行する必要がある回数はわかっています。どちらの場合でも割り当てる必要があるメモリの量はわかっています。両方のケース間の割り当ての全体的な作業負荷はほぼ同じになると評価できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 그의 루프가 100,000 번 실행된다는 것을 알고 있습니다. </font><font style="vertical-align: inherit;">우리는 또한 </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">64 비트 아키텍처의 포인터입니다. 32 비트 시스템의 C ++에서 모든 포인터는 4 바이트이고 64 비트 시스템에서는 포인터의 길이가 고정되어 있으므로 8 바이트 크기입니다. 우리는 두 경우 모두에 할당 할 32 바이트가 있다는 것을 알고 있습니다. 유일한 차이점은 각 반복마다 32 바이트 또는 2 세트의 8-8 바이트를 할당한다는 것입니다. 두 번째 경우에는 두 개의 독립 루프 모두에 대해 각 반복마다 16 바이트를 할당합니다. 따라서 두 루프는 여전히 총 ​​할당에서 32 바이트와 같습니다. 이 정보를 가지고 일반적인 수학, 알고리즘 및 그 비유를 보여 드리겠습니다. 두 경우 모두 동일한 세트 또는 작업 그룹이 수행되어야하는 횟수를 알고 있습니다. 두 경우 모두 할당해야 할 메모리 양을 알고 있습니다.우리는 두 경우 사이에 할당의 전체 작업 부하가 거의 동일하다고 주장 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мы знаем, что его цикл будет работать 100 000 раз. </font><font style="vertical-align: inherit;">Мы также знаем, что </font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">являются указателями на 64-битную архитектуру. В C ++ на 32-разрядной машине все указатели имеют размер 4 байта, а на 64-разрядной машине они имеют размер 8 байтов, поскольку указатели имеют фиксированную длину. Мы знаем, что у нас есть 32 байта для выделения в обоих случаях. Единственное отличие состоит в том, что мы выделяем 32 байта или 2 набора по 2-8 байт на каждую итерацию, тогда как во 2-м случае мы выделяем 16 байтов для каждой итерации для обоих независимых циклов. Таким образом, оба цикла по-прежнему равны 32 байта в общем распределении. С этой информацией давайте продолжим и покажем общую математику, алгоритм и аналогию. Мы знаем, сколько раз один и тот же набор или группа операций должны быть выполнены в обоих случаях. Мы знаем количество памяти, которое нужно выделить в обоих случаях.Мы можем оценить, что общая рабочая нагрузка распределений между обоими случаями будет примерно одинаковой.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们知道他的循环将运行100,000次。</font><font style="vertical-align: inherit;">我们还知道</font></font> <code>a1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>b1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>c1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>d1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是64位架构上的指针。在C ++中，在32位计算机上，所有指针均为4个字节，而在64位计算机上，指针均为8个字节，因为指针的长度是固定的。我们知道在两种情况下我们都需要分配32个字节。唯一的区别是我们在每次迭代中分配32字节或2组2-8字节，在第二种情况下，我们为两个独立循环的每次迭代分配16个字节。因此，两个循环的总分配仍然等于32个字节。有了这些信息，让我们继续展示它的一般数学，算法和类比。我们确实知道在两种情况下必须执行相同的一组或一组操作的次数。我们确实知道在两种情况下都需要分配的内存量。我们可以估计，两种情况下分配的总工作量将大致相同。</font></font>

source: We will let our loop and its iterations be a Summation that starts at 1 and ends at 100000 instead of starting with 0 as in the loops for we don't need to worry about the 0 indexing scheme of memory addressing since we are just interested in the algorithm itself.
es: Dejaremos que nuestro bucle y sus iteraciones sean una suma que comience en 1 y termine en 100000 en lugar de comenzar con 0 como en los bucles,ya que no tenemos que preocuparnos por el esquema de indexación 0 del direccionamiento de la memoria,ya que sólo nos interesa el algoritmo en sí.
ja: ループとその反復は、ループのように0で始まるのではなく、1で始まり100000で終わるSUMMATIONにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프에서와 같이 루프와 반복이 0에서 시작하는 대신 1에서 시작하여 100000에서 끝나는 Summation이되도록하겠습니다. 알고리즘 자체.</font></font>
ru: Пусть наш цикл и его итерации будут суммированием,которое начинается на 1 и заканчивается на 100000,а не на 0,как в циклах,так как нам не нужно беспокоиться о схеме адресации памяти по 0,так как нас интересует только сам алгоритм.
zh_cn: 我们将让我们的循环和它的迭代是一个从1开始,以100000结束的求和,而不是像循环中的0开始,因为我们不需要担心内存寻址的0索引方案,因为我们只对算法本身感兴趣。

source: Why are elementwise additions much faster in separate loops than in a combined loop
es: ¿Por qué las adiciones de elementos son mucho más rápidas en bucles separados que en un bucle combinado
ja: 要素ごとの足し算が複合ループよりも別々のループの方がはるかに速いのはなぜですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결합 루프보다 개별 루프에서 요소 별 추가가 더 빠른 이유</font></font>
ru: Почему в отдельных петлях элементное добавление происходит гораздо быстрее,чем в комбинированном петле.
zh_cn: 为什么单独循环中的元素加法要比合并循环快得多?

source: Why is one loop so much slower than two loops?
es: ¿Por qué un bucle es mucho más lento que dos bucles?
ja: なぜ1つのループが2つのループよりも遅いのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 하나의 루프가 두 개의 루프보다 훨씬 느립니까?</font></font>
ru: Почему один цикл намного медленнее двух?
zh_cn: 为什么一个回路比两个回路慢得多?

source: With what we seen in the second case it almost appears as if there is optimization since both for loops have the same exact signature, but this isn't the real issue. The issue isn't the work that is being done by <code>f(a)</code>,<code>f(b)</code>,<code>f(c)</code>&amp;<code>f(d)</code> in both cases and the comparison between the two it is the difference in the distance that the Summation has to travel in both cases that gives you the difference in time execution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con lo que vimos en el segundo caso, casi parece que hay una optimizaci&oacute;n, ya que ambos bucles tienen la misma firma exacta, pero este no es el problema real. </font><font style="vertical-align: inherit;">La cuesti&oacute;n no es el trabajo que se est&aacute; haciendo por </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en ambos casos y la comparaci&oacute;n entre los dos es la diferencia en la distancia que la suma tiene que viajar en ambos casos que le da la diferencia en la ejecuci&oacute;n del tiempo.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目のケースで見たものでは、両方のforループが同じ正確なシグネチャを持っているため、最適化があるかのように見えますが、これは本当の問題ではありません。</font><font style="vertical-align: inherit;">問題は</font><font style="vertical-align: inherit;">、どちらの場合も</font> <code>f(b)</code> </font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">f（b）</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">＆</font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">によって行われている作業ではなく、</font><font style="vertical-align: inherit;">2つの間の比較は、合計の距離の違いですどちらの場合も移動する必要があるため、実行時間に差が出ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 경우에서 보았 듯이 두 for 루프 모두 동일한 정확한 서명을 가지기 때문에 최적화가있는 것처럼 거의 보이지만 실제 문제는 아닙니다. </font><font style="vertical-align: inherit;">문제는 </font><font style="vertical-align: inherit;">두 경우 모두 </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &amp; </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">의해 수행되는 작업이 아니며 </font><font style="vertical-align: inherit;">둘 사이의 비교는 Summation 거리의 차이입니다 두 가지 경우 모두 시간 실행의 차이를 제공하는 이동해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С тем, что мы видели во втором случае, это выглядит почти так, как будто есть оптимизация, так как оба цикла имеют одинаковую точную сигнатуру, но это не является реальной проблемой. </font><font style="vertical-align: inherit;">Проблема не в работе, которую выполняют </font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в обоих случаях, а в сравнении между ними, а в разнице в расстоянии суммирования должен путешествовать в обоих случаях, что дает вам разницу во времени исполнения.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第二种情况下，由于两个for循环具有相同的确切签名，因此几乎看起来好像是在进行优化，但这不是真正的问题。</font><font style="vertical-align: inherit;">问题不是</font><font style="vertical-align: inherit;">两种情况下</font></font> <code>f(a)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>f(b)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>f(c)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>f(d)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所做的工作，</font><font style="vertical-align: inherit;">两者之间的比较是求和的距离差异在两种情况下都必须旅行，这使您在执行时间上有所不同。</font></font>

source: Within the first case on each call slip the <code>Boss</code> goes to <code>A</code> and gives the order and <code>A</code> goes off to fetch <code>B's</code> package then the <code>Boss</code> goes to <code>C</code> and gives the orders to do the same and receive the package from <code>D</code> on each iteration.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dentro del primer caso en cada recibo de llamada, el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> va a </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y da la orden y </font></font> <code>A</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> va a buscar </font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> paquete </font><font style="vertical-align: inherit;">de B,</font><font style="vertical-align: inherit;"> luego el </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> va a </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y le da las &oacute;rdenes de hacer lo mismo y recibir el paquete de </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cada iteraci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">各呼び出しの最初のケース内にスリップ</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に行く</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と秩序を与え、</font></font> <code>A</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フェッチするために消灯</font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">後、パッケージを</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に行く</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とからパッケージを同じことを行うと、受信する命令を与え</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">各繰り返しで。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 통화의 첫 번째 케이스 내에서 미끄러 </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 이동 </font><font style="vertical-align: inherit;">과 순서를 제공하고 </font> <code>A</code> 가<font style="vertical-align: inherit;"> 가져 꺼집니다 </font> <code>B's</code> <font style="vertical-align: inherit;"> 다음 패키지를 </font> <code>Boss</code> <font style="vertical-align: inherit;"> 로 이동 </font> <code>C</code> <font style="vertical-align: inherit;"> 와에서 패키지를 동일한 작업을 수행하고받을 수있는 명령을 제공 </font> <code>D</code> <font style="vertical-align: inherit;"> 각 반복에.</font></font> <code>A</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В первом случае при каждом вызове </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> идет к </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и отдает приказ, а </font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> уходит, чтобы получить </font><font style="vertical-align: inherit;">пакет </font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем </font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> идет к </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и отдает приказы сделать то же самое и получать пакет от </font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на каждой итерации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在每个呼叫单的第一种情况下，</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转到</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并下达订单，而</font></font> <code>A</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转到获取</font></font> <code>B's</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包，然后</font></font> <code>Boss</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">转到</font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并下达订单以</font><font style="vertical-align: inherit;">在每次迭代中</font><font style="vertical-align: inherit;">从</font></font> <code>D</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接收包</font><font style="vertical-align: inherit;">。</font></font>
