Repository: rueisnom/feedback
Catalog: xlf/17/83/25/178325.*.001.xlf
Languages: es, ja, ko, zh_cn

source: "ablockercheck" is a ID which adblocker blocks. So checking it if it is visible you are able to detect if adblocker is turned On.
es: "ablockercheck" es una identificación que el adblocker bloquea.Así que comprobando si es visible puedes detectar si adblocker está encendido.
ja: "ablockercheck "はadblockerがブロックするIDです。このIDが表示されているかどうかをチェックすることで、adblockerがオンになっているかどうかを検知することができます。
ko: "ablockercheck"는 adblocker가 차단하는 ID입니다. 따라서 눈에 보이는지 확인하면 애드 블로커가 켜져 있는지 감지 할 수 있습니다.
zh_cn: "ablockercheck "是adblocker阻止的ID。所以检查它是否可见,你就能检测到adblocker是否开启了。

source: <code>display:none</code> hides the element, and it does not take up any space;
es: <code>display:none</code> oculta el elemento y no ocupa espacio;
ja: <code>display:none</code> は要素を非表示にし、スペースを取りません。
ko: <code>display:none</code> 은 요소를 숨기고 공간을 차지하지 않습니다.
zh_cn: <code>display:none</code> 隐藏元素，并且不占用任何空间；

source: <code>ebdiv</code> should be set to <code>style="display:none;"</code>. It works for both show and hide:
es: <code>ebdiv</code> debe establecerse en <code>style="display:none;"</code> . Funciona tanto para mostrar como para ocultar:
ja: <code>ebdiv</code> は <code>style="display:none;"</code> に設定する必要があります 。 表示と非表示の両方で機能します。
ko: <code>ebdiv</code> 는 <code>style="display:none;"</code> 으로 설정해야합니다 . . 표시 및 숨기기 모두에 대해 작동합니다.
zh_cn: <code>ebdiv</code> 应该设置为 <code>style="display:none;"</code> 。 它适用于显示和隐藏：

source: <code>opacity:0</code> hides the element as "visibility:hidden", and it still takes up space in the layout; the only difference is that opacity lets one to make an element partly transparent;
es: <code>opacity:0</code> oculta el elemento como "visibilidad: oculto", y todav&iacute;a ocupa espacio en el dise&ntilde;o; la &uacute;nica diferencia es que la opacidad le permite a uno hacer un elemento parcialmente transparente;
ja: <code>opacity:0</code> は要素を「visibility：hidden」として非表示にしますが、レイアウト内のスペースを占有します。 唯一の違いは、不透明度によって要素を部分的に透明にできることです。
ko: <code>opacity:0</code> 은 요소를 "visibility : hidden"으로 숨기고 여전히 레이아웃에서 공간을 차지합니다. 유일한 차이점은 불투명도로 인해 요소를 부분적으로 투명하게 만들 수 있다는 것입니다.
zh_cn: <code>opacity:0</code> 将元素隐藏为&ldquo; visibility：hidden&rdquo;，并且仍然占据布局中的空间； 唯一的区别是不透明度使一个元素可以部分透明；

source: <code>visibility:hidden</code> hides the element, but it still takes up space in the layout;
es: <code>visibility:hidden</code> oculta el elemento, pero a&uacute;n ocupa espacio en el dise&ntilde;o;
ja: <code>visibility:hidden</code> は要素を非表示にしますが、それでもレイアウトのスペースを占有します。
ko: <code>visibility:hidden</code> 은 요소를 숨기지 만 여전히 레이아웃에서 공간을 차지합니다.
zh_cn: <code>visibility:hidden</code> 隐藏元素，但是它仍然占用布局中的空间；

source: <strong><a href="http://www.youtube.com/watch?v=mHtdZgou0qU">Speed Up Your Javascript</a></strong> (YouTube)
es: <strong><a href="http://www.youtube.com/watch?v=mHtdZgou0qU">Acelera tu Javascript</a></strong> (YouTube)
ja: <strong><a href="http://www.youtube.com/watch?v=mHtdZgou0qU">JavaScriptをスピードアップする</a></strong> （YouTube）
ko: <strong><a href="http://www.youtube.com/watch?v=mHtdZgou0qU">자바 스크립트 속도 향상</a></strong> (YouTube)
zh_cn: <strong><a href="http://www.youtube.com/watch?v=mHtdZgou0qU">加快您的Javascript</a></strong> （YouTube）

source: <strong><a href="https://freakyjolly.com/demo/check-if-visible-or-hidden-jquery.html">Demo Link</a></strong>
es: <strong><a href="https://freakyjolly.com/demo/check-if-visible-or-hidden-jquery.html">Enlace de demostraci&oacute;n</a></strong>
ja: <strong><a href="https://freakyjolly.com/demo/check-if-visible-or-hidden-jquery.html">デモリンク</a></strong>
ko: <strong><a href="https://freakyjolly.com/demo/check-if-visible-or-hidden-jquery.html">데모 링크</a></strong>
zh_cn: <strong><a href="https://freakyjolly.com/demo/check-if-visible-or-hidden-jquery.html">演示链接</a></strong>

source: <strong>Tested on</strong>
es: <strong>Probado en</strong>
ja: <strong>テスト済み</strong>
ko: <strong>에 테스트</strong>
zh_cn: <strong>经过测试</strong>

source: <strong>Tests</strong> (no support of Internet&nbsp;Explorer <code>filter:alpha</code>):
es: <strong>Pruebas</strong> (no se admite el <code>filter:alpha</code> de Internet Explorer : alfa ):
ja: <strong>テスト</strong> （Internet Explorer <code>filter:alpha</code> のサポートなし）：
ko: <strong>테스트</strong> (Internet Explorer <code>filter:alpha</code> 지원 안함) :
zh_cn: <strong>测试</strong> （不支持Internet Explorer <code>filter:alpha</code> ）：

source: <strong>UPDATE FOR JQUERY 3.x:</strong>
es: <strong>ACTUALIZACI&Oacute;N PARA JQUERY 3.x:</strong>
ja: <strong>JQUERY 3.xの更新：</strong>
ko: <strong>JQUERY 3.x 업데이트 :</strong>
zh_cn: <strong>JQUERY 3.x的更新：</strong>

source: <strong>Useful jQuery toggle methods:</strong>
es: <strong>M&eacute;todos &uacute;tiles de alternar jQuery:</strong>
ja: <strong>便利なjQueryトグルメソッド：</strong>
ko: <strong>유용한 jQuery 토글 메소드 :</strong>
zh_cn: <strong>有用的jQuery切换方法：</strong>

source: A function can be created in order to check for visibility/display attributes in order to gauge whether the element is shown in the UI or not.
es: Se puede crear una función para comprobar los atributos de visibilidad para medir si el elemento se muestra en la interfaz de usuario o no.
ja: 要素がUIに表示されているかどうかを判断するために、visibilitydisplay属性をチェックするための関数を作成することができます。
ko: 요소가 UI에 표시되는지 여부를 측정하기 위해 가시성 / 디스플레이 속성을 확인하기 위해 함수를 작성할 수 있습니다.
zh_cn: 可以创建一个函数来检查visibilitydisplay属性,以判断元素是否在UI中显示。

source: Above method does not consider the visibility of the parent. To consider the parent as well, you should use <code>.is(":hidden")</code> or <code>.is(":visible")</code>.
es: El m&eacute;todo anterior no considera la visibilidad del padre. Para considerar tambi&eacute;n al padre, debe usar <code>.is(":hidden")</code> o <code>.is(":visible")</code> .
ja: 上記のメソッドは、親の可視性を考慮していません。 親も考慮するには、 <code>.is(":hidden")</code> または <code>.is(":visible")</code> を使用する必要があります。
ko: 위의 방법은 부모의 가시성을 고려하지 않습니다. 부모도 고려하려면 <code>.is(":hidden")</code> 또는 <code>.is(":visible")</code> 을 사용해야합니다.
zh_cn: 上面的方法没有考虑父级的可见性。 要同时考虑父级，您应该使用 <code>.is(":hidden")</code> 或 <code>.is(":visible")</code> 。

source: After all, none of examples suits me, so I wrote my own.
es: Después de todo,ninguno de los ejemplos me conviene,así que escribí el mío propio.
ja: 結局、どの例も自分には合わなかったので、自分で書いてみました。
ko: 결국, 어떤 예도 나에게 적합하지 않으므로 나는 내 자신을 썼습니다.
zh_cn: 毕竟没有一个适合我的例子,所以我自己写的是自己的。

source: Also here's a ternary conditional expression to check the state of the element and then to toggle it:
es: También aquí hay una expresión condicional ternaria para comprobar el estado del elemento y luego para conmutarlo:
ja: また、要素の状態をチェックしてトグルするための三項式もあります。
ko: 또한 요소의 상태를 확인한 다음 전환하는 3 항 조건식이 있습니다.
zh_cn: 另外这里还有一个三元条件表达式,用来检查元素的状态,然后进行切换。

source: Also take into consideration <a href="https://api.jquery.com/visible-selector/">the additional jQuery notes</a>:
es: Tambi&eacute;n tenga en cuenta <a href="https://api.jquery.com/visible-selector/">las notas adicionales de jQuery</a> :
ja: また<a href="https://api.jquery.com/visible-selector/">、jQueryに関する追加の注意事項も</a>考慮してください。
ko: <a href="https://api.jquery.com/visible-selector/">추가 jQuery 참고 사항도</a> 고려 하십시오 .
zh_cn: 还请考虑<a href="https://api.jquery.com/visible-selector/">其他jQuery注释</a> ：

source: Also, if you are concerned about performance, you should check <em><a href="http://www.learningjquery.com/2010/05/now-you-see-me-showhide-performance">Now you see me&hellip; show/hide performance</a></em> (2010-05-04). And use other methods to show and hide elements.
es: Adem&aacute;s, si le preocupa el rendimiento, debe verificar <em><a href="http://www.learningjquery.com/2010/05/now-you-see-me-showhide-performance">Ahora me ve ... mostrar / ocultar el rendimiento</a></em> (2010-05-04). Y use otros m&eacute;todos para mostrar y ocultar elementos.
ja: また、パフォーマンスが気になる場合は、[ <em><a href="http://www.learningjquery.com/2010/05/now-you-see-me-showhide-performance">今すぐ見る]を確認してください...パフォーマンスの表示/非表示</a></em> （2010-05-04）。 そして、他の方法を使用して要素を表示および非表示にします。
ko: 또한 성능이 염려되면 <em><a href="http://www.learningjquery.com/2010/05/now-you-see-me-showhide-performance">지금</a></em> 확인 <em>하십시오</em> . <em>성능 표시 / 숨기기</em> (2010-05-04)를 확인하십시오. 그리고 다른 방법을 사용하여 요소를 표시하거나 숨 깁니다.
zh_cn: 另外，如果您担心性能，则应选中&ldquo; <em><a href="http://www.learningjquery.com/2010/05/now-you-see-me-showhide-performance">现在您可以看到我&hellip;显示/隐藏性能&rdquo;</a></em> （2010-05-04）。 并使用其他方法来显示和隐藏元素。

source: An ancestor element is hidden, so the element is not shown on the page.
es: Un elemento ancestral está oculto,por lo que el elemento no se muestra en la página.
ja: 先祖要素は非表示になっているので、ページには表示されません。
ko: 조상 요소가 숨겨져 있으므로 요소가 페이지에 표시되지 않습니다.
zh_cn: 祖先元素是隐藏的,所以该元素不会在页面上显示。

source: An element could be hidden with <code>display:none</code>, <code>visibility:hidden</code> or <code>opacity:0</code>. The difference between those methods:
es: Un elemento podr&iacute;a estar oculto con <code>display:none</code> , <code>visibility:hidden</code> u <code>opacity:0</code> . La diferencia entre esos m&eacute;todos:
ja: 要素は <code>display:none</code> 、 <code>visibility:hidden</code> または <code>opacity:0</code> で 非 表示にできます。 これらの方法の違い：
ko: <code>display:none</code> , <code>visibility:hidden</code> 또는 <code>opacity:0</code> 으로 요소를 숨길 수 있습니다. 그 방법의 차이점 :
zh_cn: 可以使用 <code>display:none</code> ， <code>visibility:hidden</code> 或 <code>opacity:0</code> 来隐藏元素。 这些方法之间的区别：

source: And the <a href="http://docs.jquery.com/Selectors/visible"><code>visible</code></a> selector:
es: Y el selector <a href="http://docs.jquery.com/Selectors/visible"> <code>visible</code> </a> :
ja: そして<a href="http://docs.jquery.com/Selectors/visible"> <code>visible</code> </a>セレクタ：
ko: 그리고 <a href="http://docs.jquery.com/Selectors/visible"> <code>visible</code> </a> 셀렉터 :
zh_cn: 和<a href="http://docs.jquery.com/Selectors/visible"> <code>visible</code> </a>选择器：

source: Android 4.4 (Native browser/Chrome/Firefox), Firefox (Windows/Mac), Chrome (Windows/Mac), Opera (Windows <a href="http://en.wikipedia.org/wiki/Presto_%28layout_engine%29">Presto</a>/Mac Webkit), Internet&nbsp;Explorer (Internet&nbsp;Explorer 5-11 document modes + Internet&nbsp;Explorer 8 on a virtual machine), Safari (Windows/Mac/iOS)
es: Android 4.4 (navegador nativo / Chrome / Firefox), Firefox (Windows / Mac), Chrome (Windows / Mac), Opera (Windows <a href="http://en.wikipedia.org/wiki/Presto_%28layout_engine%29">Presto</a> / Mac Webkit), Internet Explorer (modos de documento de Internet Explorer 5-11 + Internet Explorer 8 en un m&aacute;quina virtual), Safari (Windows / Mac / iOS)
ja: Android 4.4（ネイティブブラウザ/ Chrome / Firefox）、Firefox（Windows / Mac）、Chrome（Windows / Mac）、Opera（Windows <a href="http://en.wikipedia.org/wiki/Presto_%28layout_engine%29">Presto</a> / Mac Webkit）、Internet Explorer（Internet Explorer 5-11ドキュメントモード+ Internet Explorer 8 on a仮想マシン）、Safari（Windows / Mac / iOS）
ko: Android 4.4 (기본 브라우저 / Chrome / Firefox), Firefox (Windows / Mac), Chrome (Windows / Mac), Opera (Windows <a href="http://en.wikipedia.org/wiki/Presto_%28layout_engine%29">Presto</a> / Mac Webkit), Internet Explorer (Internet Explorer 5-11 문서 모드 + Internet Explorer 8에서 가상 머신), Safari (Windows / Mac / iOS)
zh_cn: Android 4.4（本机浏览器/ Chrome / Firefox），Firefox（Windows / Mac），Chrome（Windows / Mac），Opera（Windows <a href="http://en.wikipedia.org/wiki/Presto_%28layout_engine%29">Presto</a> / Mac Webkit），Internet Explorer（Internet Explorer 5-11文档模式+ Internet Explorer 8 on a虚拟机），Safari（Windows / Mac / iOS）

source: Another answer you should put into consideration is if you are hiding an element, you should use <a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a>, but instead of actually hiding it, you remove the whole element, but you copy its <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> content and the tag itself into a jQuery variable, and then all you need to do is test if there is such a tag on the screen, using the normal <code>if (!$('#thetagname').length)</code>.
es: Otra respuesta que debe tener en cuenta es que si est&aacute; ocultando un elemento, debe usar <a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a> , pero en lugar de ocultarlo, elimina todo el elemento, pero copia su contenido <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> y la etiqueta en una variable jQuery, y luego todo lo que necesita hacer es probar si existe dicha etiqueta en la pantalla, utilizando el <code>if (!$('#thetagname').length)</code> normal (! $ ('# thetagname'). length) .
ja: 考慮すべきもう1つの答えは、要素を非表示にする場合は<a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a>を使用する必要がありますが、実際には非表示にするのではなく、要素全体を削除しますが、その<a href="http://en.wikipedia.org/wiki/HTML">HTML</a>コンテンツとタグ自体をjQuery変数にコピーしてから、画面にそのようなタグがあるかどうかをテストする必要があるのは、通常の <code>if (!$('#thetagname').length)</code> です。
ko: 고려해야 할 또 다른 대답은 요소를 숨기고 있다면 <a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a> 를 사용해야하지만 실제로 숨기는 대신 전체 요소를 제거하지만 <a href="http://en.wikipedia.org/wiki/HTML">HTML</a> 내용과 태그 자체를 jQuery 변수에 복사 한 다음 정상적인 <code>if (!$('#thetagname').length)</code> 사용하여 화면에 이러한 태그가 있는지 테스트하기 만하면 됩니다.
zh_cn: 您应该考虑的另一个答案是，如果您要隐藏一个元素，则应使用<a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a> ，但是应删除整个元素，而不是实际将其隐藏，而是将其<a href="http://en.wikipedia.org/wiki/HTML">HTML</a>内容和标记本身复制到jQuery变量中，然后您需要做的就是使用正常的 <code>if (!$('#thetagname').length)</code> 测试屏幕上是否存在这样的标签。

source: Because <code>:visible</code> is a jQuery extension and not part of the CSS specification, queries using <code>:visible</code> cannot take advantage of the performance boost provided by the native DOM <code>querySelectorAll()</code> method. To achieve the best performance when using <code>:visible</code> to select elements, first select the elements using a pure CSS selector, then use <code>.filter(":visible")</code>.
es: Debido a que <code>:visible</code> es una extensi&oacute;n jQuery y no forma parte de la especificaci&oacute;n CSS, las consultas que usan <code>:visible</code> no pueden aprovechar el aumento de rendimiento proporcionado por el m&eacute;todo DOM <code>querySelectorAll()</code> nativo. Para lograr el mejor rendimiento al usar <code>:visible</code> para seleccionar elementos, primero seleccione los elementos usando un selector CSS puro, luego use <code>.filter(":visible")</code> .
ja: <code>:visible</code> はjQuery拡張機能であり、CSS仕様の一部ではないため、 ：visibleを使用するクエリは、ネイティブDOM <code>querySelectorAll()</code> メソッドによって提供されるパフォーマンスの向上を利用できません。 <code>:visible</code> を使用して要素を選択するときに最高のパフォーマンスを実現するには、最初に純粋なCSSセレクターを使用して要素を選択し、次に <code>.filter(":visible")</code> を使用します。
ko: <code>:visible</code> 은 jQuery 확장이며 CSS 스펙의 일부가 아니기 때문에 : visible 을 사용하는 쿼리는 기본 DOM <code>querySelectorAll()</code> 메소드가 제공하는 성능 향상을 활용할 수 없습니다. <code>:visible</code> 을 사용하여 요소를 선택할 때 최상의 성능을 얻으려면 먼저 순수한 CSS 선택기를 사용하여 요소를 선택한 다음 <code>.filter(":visible")</code> 를 사용하십시오 .
zh_cn: 因为 <code>:visible</code> 是jQuery扩展，而不是CSS规范的一部分，所以使用 <code>:visible</code> 的查询无法利用本机DOM <code>querySelectorAll()</code> 方法提供的性能提升。 为了在使用 <code>:visible</code> 选择元素时达到最佳性能，请首先使用纯CSS选择器选择元素，然后使用 <code>.filter(":visible")</code> 。

source: Because <code>Elements with visibility: hidden or opacity: 0 are considered visible, since they still consume space in the layout</code> (as described for <a href="https://api.jquery.com/visible-selector/">jQuery :visible Selector</a>) - we can check if element is <em>really</em> visible in this way:
es: Debido a que los <code>Elements with visibility: hidden or opacity: 0 are considered visible, since they still consume space in the layout</code> (como se describe para <a href="https://api.jquery.com/visible-selector/">jQuery: Visor Selector</a> ), podemos verificar si el elemento es <em>realmente</em> visible de esta manera:
ja: <code>Elements with visibility: hidden or opacity: 0 are considered visible, since they still consume space in the layout</code> （ <a href="https://api.jquery.com/visible-selector/">jQuery：visible Selectorで</a>説明されているように）-この方法で要素が<em>本当に</em>可視かどうかを確認できます。
ko: <code>Elements with visibility: hidden or opacity: 0 are considered visible, since they still consume space in the layout</code> ( <a href="https://api.jquery.com/visible-selector/">jQuery : visible Selector에</a> 설명 된대로) 레이아웃에서 공간을 여전히 소비하므로 요소가 <em>실제로 다음과 같이</em> 표시되는지 확인할 수 있습니다.
zh_cn: 因为 <code>Elements with visibility: hidden or opacity: 0 are considered visible, since they still consume space in the layout</code> （如<a href="https://api.jquery.com/visible-selector/">jQuery：visible Selector所述</a> ）-我们可以通过以下方式检查元素是否<em>真正</em>可见：

source: Blogger Plug n Play - jQuery Tools and Widgets: How to See if Element is hidden or Visible Using jQuery
es: Blogger Plug n Play-jQuery Tools and Widgets:Cómo ver si un elemento está oculto o visible usando jQuery
ja: Blogger Plug n Play-jQueryツールとウィジェット。jQueryを使って要素が隠されているか表示されているかを確認する方法
ko: Blogger Plug n Play-jQuery 도구 및 위젯 : jQuery를 사용하여 요소가 숨겨져 있는지 또는 표시되는지 확인하는 방법
zh_cn: Blogger Plug n Play-jQuery Tools and Widgets:如何使用jQuery查看元素是否被隐藏或可见?

source: But what if the element's CSS is like the following?
es: ¿Pero qué pasa si el CSS del elemento es como el siguiente?
ja: しかし、要素のCSSが以下のようになっていたらどうでしょうか?
ko: 그러나 요소의 CSS가 다음과 같은 경우 어떻게해야합니까?
zh_cn: 但如果元素的CSS是这样的呢?

source: Doesn't require a framework
es: No requiere un marco
ja: フレームワークを必要としない
ko: 프레임 워크가 필요하지 않습니다
zh_cn: 不需要一个框架

source: Elements can be considered hidden for several reasons: [...] Their width and height are explicitly set to 0. [...]
es: Los elementos pueden considerarse ocultos por varias razones:[...]Su anchura y altura están explícitamente puestas a 0.[...]
ja: 要素はいくつかの理由で隠されているとみなされます。幅と高さは明示的に0に設定されます。
ko: 여러 가지 이유로 요소를 숨길 수 있습니다. [...] 너비와 높이는 명시 적으로 0으로 설정됩니다. [...]
zh_cn: 元素可以被认为是隐藏的,原因有以下几个。[....]它们的宽度和高度被显式设置为0。

source: Elements with <code>visibility: hidden</code> or <code>opacity: 0</code> are considered to be visible, since they still consume space in the layout.
es: Los elementos con <code>visibility: hidden</code> u <code>opacity: 0</code> se consideran visibles, ya que a&uacute;n consumen espacio en el dise&ntilde;o.
ja: <code>visibility: hidden</code> または <code>opacity: 0</code> 要素は、レイアウト内のスペースをまだ消費しているため、可視と見なされます。
ko: <code>visibility: hidden</code> 또는 <code>opacity: 0</code> 요소는 여전히 레이아웃에서 공간을 소비하므로 가시적 인 것으로 간주됩니다.
zh_cn: 具有 <code>visibility: hidden</code> 或 <code>opacity: 0</code> 元素被视为可见，因为它们仍然占用布局中的空间。

source: Example of using the <strong>visible</strong> check for adblocker is activated:
es: Ejemplo de uso de la verificaci&oacute;n <strong>visible</strong> para adblocker est&aacute; activado:
ja: adblockerの<strong>可視</strong>チェックの使用例がアクティブ化されました：
ko: 애드 블로커에 대한 <strong>가시적</strong> 검사 사용 예가 활성화되었습니다.
zh_cn: 激活了对adblocker使用<strong>可见</strong>检查的示例：

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
zh_cn: 扩展片段

source: For example,
es: Por ejemplo,
ja: 例えば
ko: 예를 들어
zh_cn: 例如:

source: For hiding/showing, I call <code>.addClass("hide")/.removeClass("hide")</code>. For checking visibility, I use <code>.hasClass("hide")</code>.
es: Para ocultar / mostrar, llamo <code>.addClass("hide")/.removeClass("hide")</code> . Para verificar la visibilidad, uso <code>.hasClass("hide")</code> .
ja: <code>.addClass("hide")/.removeClass("hide")</code> /表示するには、 .addClass（ "hide"）/。removeClass（ "hide"）を呼び出します。 可視性の確認には、 <code>.hasClass("hide")</code> を使用します。
ko: 숨기거나 표시하려면 <code>.addClass("hide")/.removeClass("hide")</code> 를 호출하십시오. 가시성을 확인하기 위해 <code>.hasClass("hide")</code> 사용 합니다.
zh_cn: 对于隐藏/显示，我调用 <code>.addClass("hide")/.removeClass("hide")</code> 。 为了检查可见性，我使用 <code>.hasClass("hide")</code> 。

source: From <em><a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-determine-the-state-of-a-toggled-element/">How do I determine the state of a toggled element?</a></em>
es: De <em><a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-determine-the-state-of-a-toggled-element/">&iquest;C&oacute;mo determino el estado de un elemento conmutado?</a></em>
ja: <em><a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-determine-the-state-of-a-toggled-element/">トグルされた要素の状態をどのように判断しますか？</a></em>
ko: <em><a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-determine-the-state-of-a-toggled-element/">전환 된 요소의 상태를 어떻게 확인합니까?</a></em>
zh_cn: <em><a href="http://learn.jquery.com/using-jquery-core/faq/how-do-i-determine-the-state-of-a-toggled-element/">如何确定切换元素的状态？</a></em>

source: Have a look at the following example:
es: Echa un vistazo al siguiente ejemplo:
ja: 以下の例を見てみてください。
ko: 다음 예를 살펴보십시오.
zh_cn: 看一看下面的例子。

source: Here is a truly enlightening video of a Google Tech Talk by Google front-end engineer Nicholas Zakas:
es: Aquí hay un video verdaderamente esclarecedor de una charla tecnológica de Google por el ingeniero Nicholas Zakas:
ja: GoogleのフロントエンドエンジニアであるNicholas Zakas氏によるGoogle Tech Talkの動画です。
ko: 다음은 Google 프론트 엔드 엔지니어 Nicholas Zakas의 Google Tech Talk 비디오입니다.
zh_cn: 下面是Google前端工程师Nicholas Zakas的一段Google技术讲座视频,确实很有启发性。

source: How <strong><a href="http://web-profile.net/jquery/dev/jquery-element-visible-hidden/">element visibility and jQuery works</a></strong>;
es: C&oacute;mo funciona la <strong><a href="http://web-profile.net/jquery/dev/jquery-element-visible-hidden/">visibilidad del elemento y jQuery</a></strong> ;
ja: <strong><a href="http://web-profile.net/jquery/dev/jquery-element-visible-hidden/">要素の可視性とjQueryの仕組み</a></strong> 。
ko: <strong><a href="http://web-profile.net/jquery/dev/jquery-element-visible-hidden/">요소 가시성 및 jQuery 작동 방식</a></strong>
zh_cn: <strong><a href="http://web-profile.net/jquery/dev/jquery-element-visible-hidden/">元素可见性和jQuery是</a></strong>如何<strong>工作的</strong> ;

source: How do I check if an element is hidden in jQuery
es: ¿Cómo puedo comprobar si un elemento está oculto en jQuery
ja: jQueryで要素が隠されているかどうかを確認する方法
ko: jQuery에서 요소가 숨겨져 있는지 확인하는 방법
zh_cn: 如何检查一个元素是否被隐藏在jQuery中?

source: How to use:
es: Cómo se usa:
ja: どのように使用するか。
ko: 사용하는 방법:
zh_cn: 如何使用。

source: How would you test if an element is <code>visible</code> or <code>hidden</code>?
es: &iquest;C&oacute;mo probar&iacute;as si un elemento es <code>visible</code> u <code>hidden</code> ?
ja: 要素が <code>visible</code> か <code>hidden</code> かをどのようにテストしますか？
ko: 요소가 <code>visible</code> 거나 <code>hidden</code> 있는지 어떻게 테스트 하시겠습니까?
zh_cn: 您将如何测试元素是 <code>visible</code> 还是 <code>hidden</code> ？

source: I used this code for each function. Otherwise you can use <code>is(':visible')</code> for checking the visibility of an element.
es: Us&eacute; este c&oacute;digo para cada funci&oacute;n. De lo contrario, puede usar <code>is(':visible')</code> para verificar la visibilidad de un elemento.
ja: このコードを関数ごとに使用しました。 そうでない場合は、要素の可視性をチェックするために <code>is(':visible')</code> を使用できます。
ko: 각 코드마다이 코드를 사용했습니다. 그렇지 않으면 <code>is(':visible')</code> 을 사용하여 요소의 가시성을 확인할 수 있습니다 .
zh_cn: 我为每个功能使用了此代码。 否则，可以使用 <code>is(':visible')</code> 来检查元素的可见性。

source: I would use CSS class <code>.hide { display: none!important; }</code>.
es: <code>.hide { display: none!important; }</code> clase CSS .hide {display: none! Important; } .
ja: CSSクラス <code>.hide { display: none!important; }</code> }
ko: CSS class <code>.hide { display: none!important; }</code> } .
zh_cn: 我会使用CSS类 <code>.hide { display: none!important; }</code> } 。

source: If we check for <code>$(this).is(":visible")</code>, jQuery checks for both the things automatically.
es: Si verificamos <code>$(this).is(":visible")</code> , jQuery verifica ambas cosas autom&aacute;ticamente.
ja: <code>$(this).is(":visible")</code> をチェックすると、jQueryは両方を自動的にチェックします。
ko: <code>$(this).is(":visible")</code> 를 확인하면 jQuery는 자동으로 두 가지를 모두 확인합니다.
zh_cn: 如果我们检查 <code>$(this).is(":visible")</code> ，则jQuery会自动检查这两个东西。

source: If you want to check visibility instead of display, you should use: <code>.css("visibility") == "hidden"</code>.
es: Si desea verificar la visibilidad en lugar de mostrar, debe usar: <code>.css("visibility") == "hidden"</code> .
ja: 表示ではなく可視性を確認する場合は、 <code>.css("visibility") == "hidden"</code> を使用する必要があります。
ko: 표시 대신 가시성을 확인하려면 <code>.css("visibility") == "hidden"</code> 을 사용해야합니다.
zh_cn: 如果要检查可见性而不是显示，则应使用： <code>.css("visibility") == "hidden"</code> 。
