Repository: rueisnom/feedback
Catalog: xlf/17/83/25/178325.*.001.xlf
Languages: es, ja, ko, zh_cn

source: c) Check if the center (also because it is faster than testing every pixel / corner) of element is not hidden by other element (and all ancestors, example: <code>overflow:hidden</code> / scroll / one element over enother) or screen edges
es: c) Verifique si el centro (tambi&eacute;n porque es m&aacute;s r&aacute;pido que probar cada p&iacute;xel / esquina) del elemento no est&aacute; oculto por otro elemento (y todos sus antepasados, por ejemplo: <code>overflow:hidden</code> / desplazamiento / un elemento sobre otro) o bordes de la pantalla
ja: c）要素の中心（すべてのピクセル/コーナーをテストするよりも高速であるため）が他の要素（およびすべての祖先、例： <code>overflow:hidden</code> /スクロール/他の1つの要素）によって隠されていないか、または画面の端にないかどうかを確認します。
ko: c) 요소의 중심 (또한 모든 픽셀 / 코너를 테스트하는 것보다 빠르기 때문에)이 다른 요소 (및 모든 조상, 예 : <code>overflow:hidden</code> / scroll / 한 요소를 다른 요소) 또는 화면 가장자리에 숨기지 않았는지 확인하십시오
zh_cn: c）检查元素的中心（也因为它比测试每个像素/角要快），是否未被其他元素（和所有祖先，例如： <code>overflow:hidden</code> / scroll / enother上的一个元素）或屏幕边缘隐藏

source: d) Check if an element has zero width / height / opacity or <code>display:none</code> / visibility:hidden in computed styles (among all ancestors)
es: d) Verifique si un elemento tiene cero ancho / alto / opacidad o <code>display:none</code> / visibilidad: oculto en estilos calculados (entre todos los antepasados)
ja: d）要素の幅/高さ/不透明度がゼロかどうか、または計算されたスタイル（すべての祖先の中で）で <code>display:none</code> / visibility：hiddenがあるかどうかを確認します。
ko: d) 요소의 너비 / 높이 / 불투명도 또는 <code>display:none</code> 가 없는지 확인 : 없음 / 표시 : 계산 된 스타일로 숨겨 짐 (모든 조상 중에서)
zh_cn: d）检查元素是否具有零宽度/高度/不透明度或以计算样式隐藏（在所有祖先中） <code>display:none</code> /隐藏/可见性：
