Repository: rueisnom/feedback
Catalog: xlf/17/83/25/178325.*.001.xlf
Languages: es, ja, ko, zh_cn

source: If you're simply acting on an element based on its visibility, you can just include <code>:visible</code> or <code>:hidden</code> in the selector expression. For example:
es: Si simplemente est&aacute; actuando sobre un elemento en funci&oacute;n de su visibilidad, puede incluir <code>:visible</code> o <code>:hidden</code> en la expresi&oacute;n del selector. Por ejemplo:
ja: 単にその可視性に基づいて要素を操作している場合は、セレクター式に <code>:visible</code> または <code>:hidden</code> を含めることができます。 例えば：
ko: 가시성에 따라 단순히 요소에 대해 작업하는 경우 선택기 표현식에 <code>:visible</code> 또는 <code>:hidden</code> 을 포함시킬 수 있습니다 . 예를 들면 다음과 같습니다.
zh_cn: 如果仅基于元素的可见性对其进行操作，则可以在选择器表达式中包括 <code>:visible</code> 或 <code>:hidden</code> 。 例如：

source: Is it possible to toggle the visibility of an element, using the functions <code>.hide()</code>, <code>.show()</code> or <code>.toggle()</code>?
es: &iquest;Es posible alternar la visibilidad de un elemento, usando las funciones <code>.hide()</code> , <code>.show()</code> o <code>.toggle()</code> ?
ja: 関数 <code>.hide()</code> <code>.show()</code> または.toggle（）を使用して、要素の可視性を切り替えることは可能ですか？
ko: <code>.hide()</code> , <code>.show()</code> 또는 <code>.toggle()</code> 함수를 사용하여 요소의 가시성을 토글 할 수 있습니까?
zh_cn: 是否可以使用 <code>.show()</code> <code>.toggle()</code> show（）或.toggle（）函数来切换元素的可见性？

source: It's a simple and clear way to check/hide/show elements, if you don't plan to use <code>.toggle()</code> or <code>.animate()</code> methods.
es: Es una forma simple y clara de verificar / ocultar / mostrar elementos, si no planea usar los <code>.toggle()</code> o <code>.animate()</code> .
ja: <code>.animate()</code> または.animate（）メソッドを使用する予定がない場合は、要素をチェック/非表示/表示するためのシンプルで明確な方法です。
ko: <code>.toggle()</code> 또는 <code>.animate()</code> 메서드를 사용하지 않으려는 경우 요소를 확인 / 숨기기 / 표시하는 간단하고 명확한 방법입니다.
zh_cn: 如果您不打算使用 <code>.toggle()</code> 或 <code>.animate()</code> 方法，则这是一种检查/隐藏/显示元素的简单明了的方法。

source: JSFiddle with jQuery 3.0.0-alpha1:
es: JSFiddle con jQuery 3.0.0-alpha1:
ja: jQuery 3.0.0-alpha1を使ったJSFiddle。
ko: jQuery 3.0.0-alpha1을 사용한 JSFiddle :
zh_cn: JSFiddle with jQuery 3.0.0.0-alpha1。

source: JavaScript Best Practices and Optimization
es: Mejores prácticas y optimización de JavaScript
ja: JavaScriptのベストプラクティスと最適化
ko: 자바 스크립트 모범 사례 및 최적화
zh_cn: JavaScript的最佳实践和优化

source: Maybe you can do something like this
es: Tal vez puedas hacer algo como esto
ja: こんな感じのことができるかもしれません。
ko: 아마도 당신은 이런 식으로 할 수 있습니다
zh_cn: 也许你可以这样做

source: None of these answers address what I understand to be the question, which is what I was searching for, <em>"How do I handle items that have <code>visibility: hidden</code>?"</em>. Neither <code>:visible</code> nor <code>:hidden</code> will handle this, as they are both looking for display per the documentation. As far as I could determine, there is no selector to handle CSS visibility. Here is how I resolved it (standard jQuery selectors, there may be a more condensed syntax):
es: Ninguna de estas respuestas responde a lo que entiendo que es la pregunta, que es lo que estaba buscando, <em>"&iquest;C&oacute;mo manejo los elementos que tienen <code>visibility: hidden</code> ?"</em> . Ni <code>:visible</code> ni <code>:hidden</code> lo manejar&aacute;n, ya que ambos buscan la visualizaci&oacute;n seg&uacute;n la documentaci&oacute;n. Por lo que pude determinar, no hay un selector para manejar la visibilidad CSS. As&iacute; es como lo resolv&iacute; (selectores jQuery est&aacute;ndar, puede haber una sintaxis m&aacute;s condensada):
ja: これらの答えはどれも、私が質問であると理解していること、 <em>つまり「 <code>visibility: hidden</code> アイテムを処理するにはどうすればよいですか？</em> 。 <code>:visible</code> も <code>:hidden</code> も、ドキュメントごとに表示を探しているため、これを処理しません。 私が判断できる限り、CSSの可視性を処理するセレクターはありません。 ここに私がそれを解決した方法があります（標準のjQueryセレクター、より凝縮された構文があるかもしれません）：
ko: 이 답변들 중 어느 것도 내가 질문으로 이해 한 것에 대해 언급하지 않았으며, <em>" <code>visibility: hidden</code> 이있는 항목을 어떻게 처리합니까 : 숨겨져 있습니까?"</em> . <code>:visible</code> 또는 <code>:hidden</code> 은 문서마다 표시를 찾고 있기 때문에 이것을 처리하지 않습니다. 내가 알 수있는 한 CSS 가시성을 처리 할 선택기가 없습니다. 다음은 해결 방법입니다 (표준 jQuery 선택기, 더 요약 된 구문이있을 수 있음).
zh_cn: 这些答案都没有解决我所理解的问题，即我正在寻找的问题： <em>&ldquo;如何处理具有 <code>visibility: hidden</code> 项目：隐藏 ？&rdquo;</em> 。 <code>:visible</code> 和 <code>:hidden</code> 都不会处理这个问题，因为它们都希望根据文档进行显示。 据我所确定，没有选择器可以处理CSS可见性。 这是我的解决方法（标准jQuery选择器，可能会有更简洁的语法）：

source: Often when checking if something is visible or not, you are going to go right ahead immediately and do something else with it. jQuery chaining makes this easy.
es: A menudo,cuando se comprueba si algo es visible o no,vas a seguir adelante inmediatamente y hacer algo más con ello.jEl encadenamiento de preguntas lo hace fácil.
ja: 何かが表示されているかどうかを確認するときに、すぐにその場で何か別のことをしようとすることがよくありますが、jQueryのチェーニングはこれを簡単にしてくれます。
ko: 어떤 것이 눈에 보이는지 아닌지를 확인하는 경우, 즉시 바로 가서 다른 것을 수행해야합니다. jQuery 체인은 이것을 쉽게 만듭니다.
zh_cn: 通常情况下,当你在检查某个东西是否可见时,你会马上去做其他的事情。

source: One can simply use the <code>hidden</code> or <code>visible</code> attribute, like:
es: Simplemente se puede usar el atributo <code>hidden</code> o <code>visible</code> , como:
ja: 次のように、単に <code>hidden</code> または <code>visible</code> 属性を使用できます。
ko: <code>hidden</code> 속성이나 <code>visible</code> 속성을 다음과 같이 간단하게 사용할 수 있습니다.
zh_cn: 可以简单地使用 <code>hidden</code> 或 <code>visible</code> 属性，例如：

source: Or more efficient, but even uglier:
es: O más eficiente,pero aún más feo:
ja: あるいはもっと効率的なのに、もっと醜い。
ko: 또는 더 효율적이지만 더 추악합니다.
zh_cn: 或者更有效率,但更丑陋。

source: Or the following is also the sam, saving the jQuery selector in a variable to have better performance when you need it multiple times:
es: O lo siguiente también es lo mismo,guardar el selector jQuery en una variable para tener un mejor rendimiento cuando lo necesites varias veces:
ja: あるいは、以下のようにjQueryのセレクタを変数に保存して、複数回必要になったときにより良いパフォーマンスを発揮できるようにするのもサムです。
ko: 또는 다음은 sam이므로 jQuery 선택기를 변수에 저장하여 여러 번 필요할 때 성능을 향상시킬 수 있습니다.
zh_cn: 或者下面也是一样,将jQuery选择器保存在一个变量中,以便在需要多次使用时有更好的性能。

source: Or you can simplify the same with <em>is</em> as follows.
es: O puede simplificar lo mismo con <em>es el</em> siguiente.
ja: または、次のようにして同じことを簡略化できます。
ko: 또는 다음과 같이 동일하게 단순화 할 수 있습니다.
zh_cn: 或者您可以如下简化。

source: Same as <a href="https://stackoverflow.com/questions/178325/how-do-you-test-if-something-is-hidden-in-jquery/178386#178386">twernt's suggestion</a>, but applied to a single element; and it <a href="https://stackoverflow.com/a/4685330/49942">matches the algorithm recommended in the jQuery FAQ</a>
es: Igual que <a href="https://stackoverflow.com/questions/178325/how-do-you-test-if-something-is-hidden-in-jquery/178386#178386">la sugerencia de twernt</a> , pero aplicada a un solo elemento; y <a href="https://stackoverflow.com/a/4685330/49942">coincide con el algoritmo recomendado en las preguntas frecuentes de jQuery</a>
ja: <a href="https://stackoverflow.com/questions/178325/how-do-you-test-if-something-is-hidden-in-jquery/178386#178386">twerntの提案</a>と同じですが、単一の要素に適用されます。 そしてそれ<a href="https://stackoverflow.com/a/4685330/49942">はjQuery FAQで推奨されているアルゴリズム</a>と一致します
ko: <a href="https://stackoverflow.com/questions/178325/how-do-you-test-if-something-is-hidden-in-jquery/178386#178386">twernt의 suggestion</a> 과 동일하지만 단일 요소에 적용됩니다. <a href="https://stackoverflow.com/a/4685330/49942">jQuery FAQ에서 권장하는 알고리즘과 일치합니다.</a>
zh_cn: 与<a href="https://stackoverflow.com/questions/178325/how-do-you-test-if-something-is-hidden-in-jquery/178386#178386">twernt的建议</a>相同，但适用于单个元素。 它<a href="https://stackoverflow.com/a/4685330/49942">与jQuery FAQ中推荐的算法匹配</a>

source: Simply check visibility by checking for a boolean value, like:
es: Simplemente comprueba la visibilidad comprobando un valor booleano,como:
ja: のように、ブール値をチェックすることで可視性をチェックするだけです。
ko: 다음과 같이 부울 값을 확인하여 가시성을 확인하십시오.
zh_cn: 只需通过检查一个布尔值来检查可见性,如:。

source: Since the question refers to a single element, this code might be more suitable:
es: Como la pregunta se refiere a un solo elemento,este código podría ser más adecuado:
ja: 質問は単一の要素を参照しているので、このコードの方が適しているかもしれません。
ko: 질문은 단일 요소를 참조하므로이 코드가 더 적합 할 수 있습니다.
zh_cn: 因为这个问题是指单一的元素,所以这个代码可能更适合。

source: So <a href="https://stackoverflow.com/questions/8897289">this answer to Stack Overflow question <em>How to check if an element is off-screen</em></a> should also be considered.
es: Por <a href="https://stackoverflow.com/questions/8897289">lo</a> tanto, esta respuesta a la pregunta de desbordamiento de pila tambi&eacute;n debe considerarse <em>si se debe verificar si un elemento est&aacute; fuera de la pantalla</em> .
ja: したがって<a href="https://stackoverflow.com/questions/8897289">、スタックオーバーフローの質問に対するこの回答<em>は、要素が画面外にあるかどうかを確認する方法</em></a>も考慮する必要があります。
ko: 따라서 <a href="https://stackoverflow.com/questions/8897289">스택 오버플로 질문에 대한 대답 <em>은 요소가 화면 밖인지 확인하는 방법</em></a> 도 고려해야합니다.
zh_cn: 因此，也应考虑<a href="https://stackoverflow.com/questions/8897289">对堆栈溢出问题的此答案，即<em>如何检查元素是否在屏幕外</em></a> 。

source: So if you have a selector and you want to perform some action on it only if is visible or hidden, you can use <code>filter(":visible")</code> or <code>filter(":hidden")</code> followed by chaining it with the action you want to take.
es: Entonces, si tiene un selector y desea realizar alguna acci&oacute;n sobre &eacute;l solo si est&aacute; visible u oculto, puede usar <code>filter(":visible")</code> o <code>filter(":hidden")</code> seguido de encadenarlo con la acci&oacute;n que desea tomar.
ja: したがって、セレクターがあり、それが表示または非表示の場合にのみセレクターでアクションを実行する場合は、 <code>filter(":visible")</code> または <code>filter(":hidden")</code> を使用してから、目的のアクションにチェーンすることができます。取る。
ko: 따라서 선택기가 있고 표시되거나 숨겨져있는 경우에만 조치를 수행하려는 경우 <code>filter(":visible")</code> 또는 <code>filter(":hidden")</code> 를 사용하여 원하는 조치와 체인을 연결할 수 있습니다. 갖다.
zh_cn: 因此，如果您有一个选择器，并且只想在选择器可见或隐藏的情况下对其执行某些操作，则可以使用 <code>filter(":visible")</code> 或 <code>filter(":hidden")</code> 然后将其与您想要的操作链接起来采取。

source: So instead of an <code>if</code> statement, like this:
es: Entonces, en lugar de una declaraci&oacute;n <code>if</code> , as&iacute;:
ja: したがって、次のように <code>if</code> ステートメントの代わりに：
ko: 따라서 <code>if</code> 문 대신 다음과 같이하십시오.
zh_cn: 因此，代替 <code>if</code> 语句，像这样：

source: So this actually makes sense in regards to the box-model and the computed style for the element. Even if width and height are not set <em>explicitly</em> to 0 they may be set <em>implicitly</em>.
es: Entonces, esto realmente tiene sentido con respecto al modelo de caja y el estilo calculado para el elemento. Incluso si ancho y alto no se establecen <em>expl&iacute;citamente</em> en 0, pueden establecerse <em>impl&iacute;citamente</em> .
ja: したがって、これは実際には、ボックスモデルと要素の計算されたスタイルに関して意味があります。 幅と高さが<em>明示的</em>に0に設定されていなくても、 <em>暗黙的</em>に設定される場合があります。
ko: 따라서 실제로 상자 모델과 요소의 계산 스타일과 관련하여 의미가 있습니다. 너비와 높이가 <em>명시 적</em> 으로 0 <em>으로</em> 설정되지 않더라도 <em>암시 적</em> 으로 설정 될 수 있습니다.
zh_cn: 因此，这对于盒模型和元素的计算样式实际上是有意义的。 即使没有将width和height <em>显式</em>设置为0，也可以<em>隐式</em>设置它们。

source: The <code>:visible</code> selector according to <a href="https://api.jquery.com/hidden-selector/">the jQuery documentation</a>:
es: El <code>:visible</code> selector visible de acuerdo con <a href="https://api.jquery.com/hidden-selector/">la documentaci&oacute;n de jQuery</a> :
ja: <a href="https://api.jquery.com/hidden-selector/">jQueryドキュメントに</a>よると <code>:visible</code> セレクター：
ko: <a href="https://api.jquery.com/hidden-selector/">jQuery 문서</a> 에 따른 <code>:visible</code> selector :
zh_cn: <code>:visible</code> 选择器根据<a href="https://api.jquery.com/hidden-selector/">jQuery文档</a> ：

source: The above method will consider <code>div2</code> visible while <code>:visible</code> not. But the above might be useful in many cases, especially when you need to find if there is any error divs visible in the hidden parent because in such conditions <code>:visible</code> will not work.
es: El m&eacute;todo anterior considerar&aacute; <code>div2</code> visible while <code>:visible</code> not. Pero lo anterior podr&iacute;a ser &uacute;til en muchos casos, especialmente cuando necesita encontrar si hay divisiones de error visibles en el elemento primario oculto porque en tales condiciones <code>:visible</code> no funcionar&aacute;.
ja: 上記のメソッドは、 <code>div2</code> が見えるのを考慮しますが、 <code>:visible</code> は見えません。 しかし、上記は多くの場合に役立ちます。特に、非表示の親に表示されているエラーdivがあるかどうかを確認する必要がある場合、そのような条件では <code>:visible</code> は機能しません。
ko: 위의 방법은 <code>div2</code> 가 보이는 동안 고려합니다 <code>:visible</code> not. 그러나 위의 상황은 많은 경우에 유용 할 수 있습니다. 특히 숨겨진 부모에 표시되는 오류 div가 있는지 확인해야 할 때 특히 유용합니다.
zh_cn: 上面的方法将 <code>div2</code> 可见，而 <code>:visible</code> 不可见 。 但是以上内容在许多情况下可能很有用，尤其是当您需要查找隐藏的父级中是否存在任何可见的错误div时，因为在这种情况下 <code>:visible</code> 无效。

source: The same JS will then have this output:
es: El mismo JS tendrá entonces esta salida:
ja: すると、同じJSでもこのような出力になります。
ko: 동일한 JS는 다음과 같은 출력을 갖습니다.
zh_cn: 那么同样的JS就会有这样的输出。

source: Their width and height are explicitly set to 0.
es: Su anchura y altura están explícitamente fijadas en 0.
ja: その幅と高さは明示的に0に設定されています。
ko: 너비와 높이는 명시 적으로 0으로 설정됩니다.
zh_cn: 它们的宽度和高度被明确设置为0。

source: They are form elements with <code>type="hidden"</code>.
es: Son elementos de formulario con <code>type="hidden"</code> .
ja: これらは <code>type="hidden"</code> のフォーム要素です。
ko: <code>type="hidden"</code> 양식 요소입니다.
zh_cn: 它们是 <code>type="hidden"</code> 表单元素。

source: They have a CSS <code>display</code> value of <code>none</code>.
es: Tienen un valor de <code>display</code> CSS de <code>none</code> .
ja: CSSの <code>display</code> 値は <code>none</code> です。
ko: CSS <code>display</code> 값은 <code>none</code> 입니다.
zh_cn: 它们的CSS <code>display</code> 值为 <code>none</code> 。

source: This is useful in some cases and useless in others, because if you want to check if the element is visible (<code>display != none</code>), ignoring the parents visibility, you will find that doing <code>.css("display") == 'none'</code> is not only faster, but will also return the visibility check correctly.
es: Esto es &uacute;til en algunos casos e in&uacute;til en otros, porque si desea verificar si el elemento es visible ( <code>display != none</code> ), ignorando la visibilidad de los padres, encontrar&aacute; que haciendo <code>.css("display") == 'none'</code> no solo es m&aacute;s r&aacute;pido, sino que tambi&eacute;n devolver&aacute; la verificaci&oacute;n de visibilidad correctamente.
ja: 要素が表示されているかどうかを確認したい場合（ <code>display != none</code> ）、親の可視性を無視すると、これは一部の場合に役立ち、他の場合には役に立たないため、 <code>.css("display") == 'none'</code> はより高速であるだけでなく、可視性チェックも正しく返します。
ko: 부모 가시성을 무시하고 요소가 표시되는지 ( <code>display != none</code> ) 확인하려는 경우 <code>.css("display") == 'none'</code> 수행 하지 않는 경우가 있으므로 일부 경우에 유용하고 다른 경우에는 쓸모가 없습니다. ' 은 빠를뿐만 아니라 가시성 검사를 올바르게 반환합니다.
zh_cn: 这在某些情况下很有用，而在其他情况下则没有用，因为如果您要检查元素是否可见（ <code>display != none</code> ），而忽略父级的可见性，则会发现执行 <code>.css("display") == 'none'</code> 不仅速度更快，而且还会正确返回可见性检查。

source: This may work:
es: Esto puede funcionar:
ja: これは効くかもしれません。
ko: 이것은 작동 할 수 있습니다 :
zh_cn: 这可能是可行的。

source: This seems somewhat counter-intuitive in the first place &ndash; though having a closer look at the jQuery documentation gives the relevant information:
es: Esto parece algo contrario a la intuici&oacute;n en primer lugar, aunque echar un vistazo m&aacute;s de cerca a la documentaci&oacute;n de jQuery proporciona la informaci&oacute;n relevante:
ja: これはそもそも直観に反しているように見えますが、jQueryのドキュメントをよく見ると関連情報が得られます。
ko: jQuery 문서를 자세히 살펴보면 관련 정보가 제공되지만 처음에는 다소 직관적 인 것처럼 보입니다.
zh_cn: 首先，这似乎有点违反直觉-尽管仔细查看jQuery文档会提供相关信息：

source: This works for me, and I am using <code>show()</code> and <code>hide()</code> to make my div hidden/visible:
es: Esto funciona para m&iacute;, y estoy usando <code>show()</code> y <code>hide()</code> para hacer que mi div est&eacute; oculto / visible:
ja: これは私にとってはうまくいき、私は <code>show()</code> と <code>hide()</code> を使用してdivを非表示/表示にしています：
ko: 이것은 저에게 효과적이며 <code>show()</code> 및 <code>hide()</code> 를 사용하여 div를 숨기거나 표시 할 수 있습니다.
zh_cn: 这对我有用，并且我正在使用 <code>show()</code> 和 <code>hide()</code> 使div隐藏/可见：

source: To check if it is not visible I use <code>!</code>:
es: &iexcl;Para comprobar si no est&aacute; visible lo uso <code>!</code> :
ja: 表示されていないかどうかを確認するには、次を使用します <code>!</code> ：
ko: 그것이 보이지 않는지 확인하려면 사용하십시오 <code>!</code> :
zh_cn: 要检查它是否不可见，我使用 <code>!</code> ：

source: Use class toggling, not style editing . . .
es: Usar el cambio de clase,no la edición de estilo...
ja: スタイルの編集ではなく、クラスのトグルを使用してください .
ko: 스타일 편집이 아닌 클래스 토글을 사용하십시오. . .
zh_cn: 使用类切换,而不是样式编辑...。

source: Using classes designated for "hiding" elements is easy and also one of the most efficient methods. Toggling a class 'hidden' with a <code>Display</code> style of 'none' will perform faster than editing that style directly. I explained some of this pretty thoroughly in Stack Overflow question <em><a href="https://stackoverflow.com/questions/17725361/turning-two-elements-visible-hidden-in-same-div/17726550#answer-17726550">Turning two elements visible/hidden in the same div</a></em>.
es: Usar clases designadas para elementos "escondidos" es f&aacute;cil y tambi&eacute;n uno de los m&eacute;todos m&aacute;s eficientes. Alternar una clase 'oculta' con un estilo de <code>Display</code> de 'ninguno' funcionar&aacute; m&aacute;s r&aacute;pido que editar ese estilo directamente. Expliqu&eacute; algo de esto bastante a fondo en la pregunta de desbordamiento de pila. C&oacute;mo convertir <em><a href="https://stackoverflow.com/questions/17725361/turning-two-elements-visible-hidden-in-same-div/17726550#answer-17726550">dos elementos visibles / ocultos en el mismo div</a></em> .
ja: 要素を「隠す」ために指定されたクラスを使用することは簡単で、最も効率的な方法の1つでもあります。 「非表示」の <code>Display</code> スタイルで「非表示」のクラスを切り替えると、そのスタイルを直接編集するよりも速く実行されます。 スタックオーバーフローの質問<em><a href="https://stackoverflow.com/questions/17725361/turning-two-elements-visible-hidden-in-same-div/17726550#answer-17726550">2つの要素を同じdivで表示/非表示</a></em>にすることで、このいくつかをかなり徹底的に説明し<em>ました</em> 。
ko: "숨김"요소로 지정된 클래스를 사용하는 것은 쉽고 가장 효율적인 방법 중 하나입니다. <code>Display</code> 스타일이 '없음'인 클래스 '숨김'을 전환하면 해당 스타일을 직접 편집하는 것보다 빠르게 수행됩니다. Stack Overflow 질문에서 <em><a href="https://stackoverflow.com/questions/17725361/turning-two-elements-visible-hidden-in-same-div/17726550#answer-17726550">두 가지 요소를 같은 div에 표시 / 숨기려면</a></em> 이 중 일부를 철저히 설명했습니다.
zh_cn: 使用为&ldquo;隐藏&rdquo;元素指定的类很容易，也是最有效的方法之一。 将 <code>Display</code> 样式为&ldquo;无&rdquo;的类&ldquo;隐藏&rdquo;切换为比直接编辑该样式要快。 我在&ldquo;堆栈溢出&rdquo;问题中相当详尽地解释了其中的一些问题<em><a href="https://stackoverflow.com/questions/17725361/turning-two-elements-visible-hidden-in-same-div/17726550#answer-17726550">，即在同一个div中将两个元素可见/隐藏</a></em> 。

source: We use jQuery is() to check the selected element with another element, selector or any jQuery object. This method traverses along the DOM elements to find a match, which satisfies the passed parameter. It will return true if there is a match otherwise returns false.
es: Utilizamos jQuery is()para comprobar el elemento seleccionado con otro elemento,selector o cualquier objeto jQuery.Este método recorre los elementos DOM para encontrar una coincidencia,que satisfaga el parámetro pasado.Devolverá true si hay una coincidencia,de lo contrario devolverá false.
ja: jQuery is()を使用して、選択された要素を別の要素、セレクタ、または任意の jQuery オブジェクトで確認します。このメソッドは、DOM 要素に沿ってトラバースし、渡されたパラメータを満たす一致する要素を見つけます。一致した場合は true を返し、そうでない場合は false を返します。
ko: jQuery is ()를 사용하여 선택한 요소를 다른 요소, 선택기 또는 jQuery 객체로 확인합니다. 이 메소드는 전달 된 매개 변수를 만족시키는 일치 사항을 찾기 위해 DOM 요소를 순회합니다. 일치하는 항목이 있으면 true를 반환하고 그렇지 않으면 false를 반환합니다.
zh_cn: 我们使用jQuery is()来检查所选元素与其他元素、选择器或任何jQuery对象的匹配。这个方法会沿着DOM元素遍历,找到一个匹配的元素,满足传递的参数。如果有匹配,它将返回true,否则返回false。

source: When testing an element against <code>:hidden</code> selector in jQuery it should be considered that <strong>an absolute positioned element may be recognized as hidden although their child elements are visible</strong>.
es: Al probar un elemento contra <code>:hidden</code> selector oculto en jQuery, se debe considerar que <strong>un elemento en posici&oacute;n absoluta puede reconocerse como oculto aunque sus elementos secundarios sean visibles</strong> .
ja: jQueryで <code>:hidden</code> セレクターに対して要素をテストする場合<strong>、子要素は表示されますが、絶対配置要素は非表示として認識される場合がある</strong>ことを考慮してください。
ko: jQuery에서 <code>:hidden</code> selector에 대해 요소를 테스트 할 때 <strong>절대 위치 요소는 하위 요소가 보이지만 숨겨진 것으로 인식 될 수 있습니다</strong> .
zh_cn: 当针对jQuery中的 <code>:hidden</code> 选择器测试元素时，应考虑<strong>将绝对定位的元素识别为隐藏，尽管其子元素可见</strong> 。

source: With jQuery 3 the described behavior will change! Elements will be considered visible if they have any layout boxes, including those of zero width and/or height.
es: ¡Con jQuery 3 el comportamiento descrito cambiará! Los elementos se considerarán visibles si tienen alguna caja de diseño,incluyendo las de ancho o alto cero.
ja: jQuery 3では、記述されている動作が変更されます。要素は、幅や高さがゼロのものを含むレイアウトボックスを持っている場合、表示されているとみなされます。
ko: jQuery 3에서는 설명 된 동작이 변경됩니다! 너비 및 / 또는 높이가 0 인 레이아웃 상자를 포함하여 레이아웃 상자가있는 요소는 표시되는 것으로 간주됩니다.
zh_cn: 在jQuery 3中,所描述的行为将发生改变! 元素将被认为是可见的,如果他们有任何布局框,包括那些零宽度和高度的元素。

source: Working Fiddle
es: Trabajando Fiddle
ja: ワーキングフィドル
ko: 일 바이올린
zh_cn: 工作中的小提琴

source: Works everywhere
es: Funciona en todas partes
ja: どこでも使える
ko: 어디서나 작동
zh_cn: 在任何地方都可以使用

source: Works for CSS and inline styles
es: Funciona para CSS y estilos en línea
ja: CSS とインラインスタイルに対応
ko: CSS 및 인라인 스타일에서 작동
zh_cn: 可用于CSS和内联样式

source: Works for nested elements
es: Funciona para los elementos anidados
ja: 入れ子になっている要素に対応
ko: 중첩 요소에 적용
zh_cn: 可用于嵌套元素

source: You can also do this using plain JavaScript:
es: También puedes hacer esto usando un simple JavaScript:
ja: プレーンJavaScriptを使ってもできます。
ko: 일반 JavaScript를 사용하여이 작업을 수행 할 수도 있습니다.
zh_cn: 你也可以用普通的JavaScript来做。

source: You can determine whether an element is collapsed or not by using the <code>:visible</code> and <code>:hidden</code> selectors.
es: Puede determinar si un elemento est&aacute; contra&iacute;do o no utilizando los selectores <code>:visible</code> y <code>:hidden</code> .
ja: <code>:visible</code> および <code>:hidden</code> セレクターを使用して、要素が折りたたまれているかどうかを判別できます。
ko: <code>:visible</code> 및 <code>:hidden</code> 선택기를 사용하여 요소 축소 여부를 결정할 수 있습니다.
zh_cn: 您可以使用 <code>:visible</code> 和 <code>:hidden</code> 选择器来确定元素是否折叠。

source: You can do it all in one line:
es: Puedes hacerlo todo en una sola línea:
ja: 一行でできるようになります。
ko: 한 줄에 모두 할 수 있습니다.
zh_cn: 一句话就能搞定。

source: You can use the <a href="http://docs.jquery.com/Selectors/hidden"><code>hidden</code></a> selector:
es: Puedes usar el selector <a href="http://docs.jquery.com/Selectors/hidden"> <code>hidden</code> </a> :
ja: <a href="http://docs.jquery.com/Selectors/hidden"> <code>hidden</code> </a>セレクターを使用できます。
ko: <a href="http://docs.jquery.com/Selectors/hidden"> <code>hidden</code> </a> 선택기를 사용할 수 있습니다.
zh_cn: 您可以使用<a href="http://docs.jquery.com/Selectors/hidden"> <code>hidden</code> </a>选择器：

source: You need to check both... Display as well as visibility:
es: Tienes que comprobar ambos...la pantalla y la visibilidad:
ja: 両方をチェックする必要があります...視認性だけでなく表示も。
ko: 둘 다 확인해야합니다 ... 표시 및 가시성 :
zh_cn: 你需要检查这两点.....显示以及可视性。

source: a) Check if the document is not hidden
es: a)Compruebe si el documento no está oculto
ja: a)文書が非表示になっていないか確認する
ko: a) 문서가 숨겨져 있지 않은지 확인
zh_cn: a)检查文档是否没有隐藏

source: b) Check if an element has zero width / height / opacity or <code>display:none</code> / <code>visibility:hidden</code> in inline styles
es: b) Compruebe si un elemento tiene cero ancho / alto / opacidad o <code>display:none</code> / <code>visibility:hidden</code> en estilos en l&iacute;nea
ja: b）要素の幅/高さ/不透明度がゼロであるか、インラインスタイルで <code>display:none</code> / <code>visibility:hidden</code> 表示であるかを確認します
ko: b) 요소의 너비 / 높이 / 불투명도가 0인지 또는 <code>display:none</code> / <code>visibility:hidden</code> 인라인 스타일에 숨겨져 있는지 확인
zh_cn: b）检查元素的宽度/高度/不透明度是否为零或以内联样式 <code>visibility:hidden</code> <code>display:none</code> / 可见性：
