Repository: rueisnom/feedback
Catalog: xlf/20/20/08/8/2020088.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: (But, you will need to know the credentials of the mail account)
ja: (ただし、メールアカウントの認証情報を知る必要があります)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(단, 메일 계정의 자격 증명을 알아야합니다)</font></font>
ru: (Но вам нужно будет знать мандаты почтового аккаунта)
zh_cn: (但是,你需要知道邮件账户的凭证)

source: 1.Using this
ja: 1.これを使って
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. 이것을 사용하여</font></font>
ru: 1.используя это
zh_cn: 1.使用这个

source: 2.Applying AsyncTask.
ja: 2.AsyncTaskを適用する。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. AsyncTask 적용</font></font>
ru: 2.Применение AsyncTask.
zh_cn: 2.应用AsyncTask。

source: 3.Changing security issue of sender gmail account.(Change to "TURN ON") in <a href="https://www.google.com/settings/security/lesssecureapps">this</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中に（「ON TURN」に変更）、送信者のGmailアカウントのセキュリティ上の問題を。3.Changing </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보낸 사람의 Gmail 계정의 보안 문제를 템플릿 3..의 (변경 "전원 켜짐"으로) </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3.Изменяется проблема безопасности учетной записи отправителя Gmail. (Измените на &laquo;ВКЛЮЧЕНО&raquo;) в </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этом</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3.更改发件人的Gmail帐户的安全问题。（更改为&ldquo;开启&rdquo;）在</font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此</font></font></a>

source: <em>(I've tested it myself)</em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（私は自分でテストしました）</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(나는 그것을 직접 테스트했다)</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Я сам проверил)</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（我已经自己测试过）</font></font></em>

source: <strike> <pre><code>compile 'eu.ocathain.com.sun.mail:javax.mail:1.5.4'</code></pre> <p>You can then follow the official <a href="http://www.oracle.com/webfolder/technetwork/tutorials/obe/java/javamail/javamail.html">tutorial</a>.</p> <p>Source code is available here: <a href="https://bitbucket.org/artbristol/javamail-forked-android">https://bitbucket.org/artbristol/javamail-forked-android</a></p> </strike>
ja: <strike> <pre> <code>compile 'eu.ocathain.com.sun.mail:javax.mail:1.5.4'</code> </pre> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その後、公式</font></font><a href="http://www.oracle.com/webfolder/technetwork/tutorials/obe/java/javamail/javamail.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チュートリアルに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">従って</font><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。</font></font></p> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソースコードはこちらから入手できます：</font><a href="https://bitbucket.org/artbristol/javamail-forked-android"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//bitbucket.org/artbristol/javamail-forked-android</font></font></p> </strike>
ko: <strike> <pre> <code>compile 'eu.ocathain.com.sun.mail:javax.mail:1.5.4'</code> </pre> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 공식 </font></font><a href="http://www.oracle.com/webfolder/technetwork/tutorials/obe/java/javamail/javamail.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">튜토리얼</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 따를 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font></p> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소스 코드는 여기에 있습니다 : </font></font><a href="https://bitbucket.org/artbristol/javamail-forked-android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://bitbucket.org/artbristol/javamail-forked-android</font></font></a></p> </strike>
ru: <strike> <pre> <code>compile 'eu.ocathain.com.sun.mail:javax.mail:1.5.4'</code> </pre> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете следовать официальному </font></font><a href="http://www.oracle.com/webfolder/technetwork/tutorials/obe/java/javamail/javamail.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">руководству</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></p> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Исходный код доступен здесь: </font></font><a href="https://bitbucket.org/artbristol/javamail-forked-android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://bitbucket.org/artbristol/javamail-forked-android</font></font></a></p> </strike>
zh_cn: <strike> <pre> <code>compile 'eu.ocathain.com.sun.mail:javax.mail:1.5.4'</code> </pre> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后，您可以按照官方</font></font><a href="http://www.oracle.com/webfolder/technetwork/tutorials/obe/java/javamail/javamail.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">教程进行操作</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></p> <p><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">源代码可在此处获取：</font><a href="https://bitbucket.org/artbristol/javamail-forked-android"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//bitbucket.org/artbristol/javamail-forked-android</font></font></p> </strike>

source: <strike> I've ported the latest JavaMail (1.5.4) to Android. It's available in Maven Central, just add the following to <code>build.gradle</code>~~</strike>
ja: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 最新のJavaMail（1.5.4）をAndroidに移植しました。</font><font style="vertical-align: inherit;">Maven Centralで利用できます</font></font> <code>build.gradle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以下を追加してください</font><font style="vertical-align: inherit;">~~</font></font></strike>
ko: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 최신 JavaMail (1.5.4)을 Android로 이식했습니다. </font><font style="vertical-align: inherit;">Maven Central에서 사용할 수 있습니다. </font></font> <code>build.gradle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ~~에 </font><font style="vertical-align: inherit;">다음을 추가하십시오.</font></font></strike>
ru: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Я перенес последнюю версию JavaMail (1.5.4) на Android. </font><font style="vertical-align: inherit;">Он доступен в Maven Central, просто добавьте следующее в </font></font> <code>build.gradle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ~~</font></font></strike>
zh_cn: <strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 我已经将最新的JavaMail（1.5.4）移植到了Android。</font><font style="vertical-align: inherit;">它在Maven Central中可用，只需将以下内容添加到</font></font> <code>build.gradle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ~~</font></font></strike>

source: <strong>100% working code with demo You can also send multiple email using this answer.</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デモ付きの100％機能するコードこの回答を使用して複数のメールを送信することもできます。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데모를 사용한 100 % 작업 코드이 답변을 사용하여 여러 개의 이메일을 보낼 수도 있습니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">100% рабочий код с демонстрацией. Вы также можете отправить несколько электронных писем, используя этот ответ.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">100％带有演示的工作代码您也可以使用此答案发送多封电子邮件。</font></font></strong>

source: <strong>Just click below link to change account access for less secure apps</strong><a href="https://www.google.com/settings/security/lesssecureapps">https://www.google.com/settings/security/lesssecureapps</a>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">安全性の低いアプリのアカウントアクセスを変更するには、下のリンクをクリックして</font></font></strong><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">くださいhttps://www.google.com/settings/security/lesssecureapps</font></font></a>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보안이 취약한 앱의 계정 액세스를 변경하려면 아래 링크를 클릭하십시오. </font></font></strong><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.google.com/settings/security/lesssecureapps</font></font></a>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто нажмите ссылку ниже, чтобы изменить доступ к учетной записи для менее безопасных приложений </font></font></strong><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.google.com/settings/security/lesssecureapps</font></font></a>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只需单击下面的链接即可更改安全性较低的应用程序的帐户访问权限</font></font></strong><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.google.com/settings/security/lesssecureapps</font></font></a>

source: <strong>Note</strong> Dont forget to add <strong>internet</strong> permission in your AndroidManifest.xml file
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> AndroidManifest.xmlファイルに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インターネット</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">権限</font><font style="vertical-align: inherit;">を追加することを忘れない</font><font style="vertical-align: inherit;">でください</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> AndroidManifest.xml 파일에 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인터넷</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 권한 </font><font style="vertical-align: inherit;">을 추가하는 것을 잊지 </font><font style="vertical-align: inherit;">마십시오</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Не забудьте добавить </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">интернет-</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разрешение в файл AndroidManifest.xml.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不要忘记</font><font style="vertical-align: inherit;">在AndroidManifest.xml文件中</font><font style="vertical-align: inherit;">添加</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">互联网</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">权限</font></font>

source: <strong>Step 1 :</strong> Download mail,activation,additionnal jar files and add in your <strong>project libs folder</strong> in android studio. I added a screen shot see below <strong><a href="https://code.google.com/archive/p/javamail-android/downloads">Download link</a></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ1：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> メール、アクティベーション、追加のjarファイルをダウンロードし</font><font style="vertical-align: inherit;">、android studioの</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロジェクトlibsフォルダー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">追加します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">スクリーンショットを追加しました以下の</font><strong><a href="https://code.google.com/archive/p/javamail-android/downloads"><font style="vertical-align: inherit;">ダウンロードリンクを</font></a></strong><font style="vertical-align: inherit;">参照してください</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 단계 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메일, 활성화, 추가 jar 파일을 다운로드 </font><font style="vertical-align: inherit;">하고 android studio </font><font style="vertical-align: inherit;">의 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로젝트 라이브러리 폴더</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">추가하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">스크린 샷을 추가했습니다. 아래 </font><strong><a href="https://code.google.com/archive/p/javamail-android/downloads"><font style="vertical-align: inherit;">링크를</font></a></strong><font style="vertical-align: inherit;"> 참조하십시오.</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 1:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Загрузите файлы почты, активации, дополнительные файлы jar и добавьте в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">папку libs</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вашего </font><strong><font style="vertical-align: inherit;">проекта</font></strong><font style="vertical-align: inherit;"> в Android Studio. </font><font style="vertical-align: inherit;">Я добавил скриншот смотри ниже </font></font><strong><a href="https://code.google.com/archive/p/javamail-android/downloads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ссылка для скачивания</font></font></a></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">步骤1：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 下载mail，activation，additional jar文件，并</font><font style="vertical-align: inherit;">在android studio中</font><font style="vertical-align: inherit;">添加您的</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">项目libs文件夹</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我添加了一个屏幕截图，请参见下面的</font></font><strong><a href="https://code.google.com/archive/p/javamail-android/downloads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下载链接</font></font></a></strong>

source: <strong>Step 2 :</strong> After completing this process. Copy and past this classes into your project.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ2：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> このプロセスを完了した後。</font><font style="vertical-align: inherit;">このクラスをコピーしてプロジェクトに貼り付けます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 단계 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 프로세스를 완료 한 후 </font><font style="vertical-align: inherit;">이 수업을 복사하여 프로젝트에 붙여 넣습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 2:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> После завершения этого процесса. </font><font style="vertical-align: inherit;">Скопируйте и пропустите эти классы в свой проект.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第2步：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 完成此过程之后。</font><font style="vertical-align: inherit;">将此类复制并粘贴到您的项目中。</font></font>

source: <strong>Step 3 :</strong> Now you can change this class according to your needs also you can send multiple mail using this class. i provide xml and java file both.
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ3：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 必要に応じてこのクラスを変更し、このクラスを使用して複数のメールを送信することもできます。</font><font style="vertical-align: inherit;">私はxmlとjavaファイルの両方を提供します。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3 단계 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이제 필요에 따라이 클래스를 변경할 수 있으며이 클래스를 사용하여 여러 메일을 보낼 수도 있습니다. </font><font style="vertical-align: inherit;">xml과 java 파일을 모두 제공합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 3:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Теперь вы можете изменить этот класс в соответствии со своими потребностями, также вы можете отправлять несколько писем с использованием этого класса. </font><font style="vertical-align: inherit;">Я предоставляю XML и Java-файл оба.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">步骤3：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 现在，您可以根据需要更改此类，也可以使用该类发送多个邮件。</font><font style="vertical-align: inherit;">我同时提供xml和java文件。</font></font>

source: ADD 3 jars found in the following link to your Android Project
ja: 以下のリンク先で見つけた3つのjarをAndroidプロジェクトに追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Android 프로젝트에 대한 다음 링크에서 3 개의 항아리 추가</font></font>
ru: ADD 3 банки можно найти по следующей ссылке на ваш проект Android
zh_cn: 在下面的链接中找到的3个jar添加到你的安卓项目中。

source: Add the jars to your application and use the SMTP method
ja: アプリケーションに jar を追加し、SMTP メソッドを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항아리를 응용 프로그램에 추가하고 SMTP 방법을 사용하십시오.</font></font>
ru: Добавьте банки к вашему приложению и используйте SMTP-метод.
zh_cn: 将jars添加到你的应用程序中,并使用SMTP方法。

source: Add this line in your manifest:
ja: あなたのマニフェストにこの行を追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매니페스트에이 줄을 추가하십시오.</font></font>
ru: Добавь эту строку в свой манифест:
zh_cn: 在你的清单中加入这一行。

source: All the code provided in the other answers is correct and is working fine, but a bit messy, so I decided to publish a library (still in development though) to use it in a easier way: <strong><a href="https://github.com/enrichman/androidmail">AndroidMail</a></strong>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の回答で提供されているすべてのコードは正しく、正常に動作していますが、少し面倒なので、より簡単な方法で使用するためにライブラリ（まだ開発中です）を公開することにしました：</font></font><strong><a href="https://github.com/enrichman/androidmail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AndroidMail</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 답변에 제공된 모든 코드는 정확하고 제대로 작동하지만 약간 지저분하므로 라이브러리를 더 쉽게 사용하기 위해 라이브러리를 게시하기로 결정했습니다 ( </font></font><strong><a href="https://github.com/enrichman/androidmail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AndroidMail)</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Весь код, приведенный в других ответах, является правильным и работает нормально, но немного грязно, поэтому я решил опубликовать библиотеку (все еще в разработке), чтобы использовать ее более простым способом: </font></font><strong><a href="https://github.com/enrichman/androidmail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AndroidMail</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其他答案中提供的所有代码都是正确的，并且工作正常，但有点混乱，因此我决定发布一个库（尽管仍在开发中）以更轻松地使用它：</font></font><strong><a href="https://github.com/enrichman/androidmail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AndroidMail</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Also for attachments, you need to set READ_EXTERNAL_STORAGE permission:
ja: また、添付ファイルについてもREAD_EXTERNAL_STORAGEのパーミッションを設定する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 첨부 파일의 경우 READ_EXTERNAL_STORAGE 권한을 설정해야합니다.</font></font>
ru: Также для вложений необходимо установить разрешение READ_EXTERNAL_STORAGE:
zh_cn: 同时对于附件,你需要设置READ_EXTERNAL_STORAGE权限。
