Repository: rueisnom/feedback
Catalog: xlf/20/20/08/8/2020088.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Alternatively, You can use a web-service at the server side code, which will use the same mail.jar and activation.jar to send email. You can call the web-service via asynctask and send email. Refer same link.
ja: あるいは、サーバサイドのコードでウェブサービスを使用して、同じmail.jarとactivation.jarを使用してメールを送信することもできます。asynctask経由でWebサービスを呼び出してメールを送信することができます。同じリンクを参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 서버 측 코드에서 웹 서비스를 사용하여 동일한 mail.jar 및 activation.jar을 사용하여 전자 메일을 보낼 수 있습니다. </font><font style="vertical-align: inherit;">asynctask를 통해 웹 서비스를 호출하고 이메일을 보낼 수 있습니다. </font><font style="vertical-align: inherit;">동일한 링크를 참조하십시오.</font></font>
ru: В качестве альтернативы Вы можете использовать веб-сервис на стороне сервера с кодом,который будет использовать для отправки электронной почты один и тот же mail.jar и activation.jar.Вы можете позвонить в веб-сервис через асинктзак и отправить электронную почту.Обратитесь по той же ссылке.
zh_cn: 另外,你也可以在服务器端代码中使用一个web服务,它将使用相同的mail.jar和activation.jar来发送邮件。你可以通过asynctask调用web服务来发送邮件。参考相同的链接。

source: And don't forget to add this line in your manifest:
ja: そして、あなたのマニフェストにこの行を追加することを忘れないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고이 줄을 매니페스트에 추가하는 것을 잊지 마십시오.</font></font>
ru: И не забудь добавить эту строку в свой манифест:
zh_cn: 而且不要忘记在你的清单中加入这一行。

source: Another way would involve a simple server side script, like php, that takes some URL parameters and uses them to send a mail. This way, you only need to make an HTTP request from the device (easily possible with the built in libraries) and don't need to store the SMTP login data on the device. This is one more indirection compared to direct SMTP usage, but because it's so very easy to make HTTP request and send mails from PHP, it might even be simpler than the direct way.
ja: もう一つの方法は、いくつかのURLパラメータを取り、それらを使用してメールを送信するphpのような単純なサーバーサイドスクリプトを使用することです。この方法では、デバイスからHTTPリクエストを行うだけで(内蔵ライブラリで簡単に可能)、SMTPログインデータをデバイスに保存する必要がありません。これは直接SMTPを使用する方法に比べれば、もう一つの間接的な方法ですが、PHPからHTTPリクエストを作成してメールを送信することは非常に簡単なので、直接の方法よりもシンプルになるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른 방법은 php와 같은 간단한 서버 측 스크립트를 사용하는 것입니다.이 스크립트는 URL 매개 변수를 사용하여 메일을 보내는 데 사용합니다. </font><font style="vertical-align: inherit;">이렇게하면 장치에서 HTTP 요청 만하면되고 (내장 라이브러리를 사용하면 쉽게 가능) 장치에 SMTP 로그인 데이터를 저장할 필요가 없습니다. </font><font style="vertical-align: inherit;">이것은 직접 SMTP 사용과 비교하여 한 가지 더 간접적이지만 HTTP 요청을 매우 쉽게하고 PHP에서 메일을 보내기 때문에 직접 방법보다 간단 할 수도 있습니다.</font></font>
ru: Другой способ заключается в использовании простого скрипта на стороне сервера,например php,который берёт некоторые параметры URL и использует их для отправки почты.Таким образом,вам нужно лишь сделать HTTP-запрос с устройства (это легко сделать с помощью встроенных библиотек)и не нужно хранить SMTP-логин на устройстве.Это еще одно преимущество по сравнению с прямым использованием SMTP,но так как сделать HTTP-запрос и отправить почту с PHP очень просто,это может быть даже проще,чем прямой способ.
zh_cn: 另一种方法是用一个简单的服务器端脚本,比如说php,利用一些URL参数来发送邮件。这种方式,你只需要从设备上发出一个HTTP请求(用内置的库很容易实现),不需要在设备上存储SMTP登录数据。这比直接使用SMTP多了一个隐蔽性,但由于从PHP中发出HTTP请求和发送邮件非常容易,所以可能比直接的方式更简单。

source: Click here - How to add External Jars
ja: ここをクリックしてください-外部ジャーの追加方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기를 클릭하십시오-외부 병을 추가하는 방법</font></font>
ru: Нажмите здесь-Как добавить внешние банки
zh_cn: 点击这里-如何添加外部罐子

source: Could not connect to SMTP host: smtp.gmail.com, port: 465
ja: SMTPホストに接続できませんでした:smtp.gmail.com,port.465
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SMTP 호스트 : smtp.gmail.com, 포트 : 465에 연결할 수 없습니다</font></font>
ru: Не смог соединиться с SMTP-хостом:smtp.gmail.com,порт:465
zh_cn: 无法连接到SMTP主机:smtp.gmail.com,端口。465

source: Did you consider using Apache Commons Net ? Since 3.3, just one jar (and you can depend on it using gradle or maven) and you're done : <a href="http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/">http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Commons Netの使用を検討しましたか？</font><font style="vertical-align: inherit;">3.3以降、jarは1つだけ（そして、gradleまたはmavenを使用してそれに依存することができます）、これで完了です：</font><a href="http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//blog.dahanne.net/2013/06/17/sending-a-mail-in-java- and-android-with-apache-commons-net /</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Commons Net 사용을 고려 했습니까? </font><font style="vertical-align: inherit;">3.3 이후, 단지 하나의 항아리 (그리고 gradle 또는 maven을 사용하여 그것에 의존 할 수 있음)와 당신은 끝났습니다 : </font></font><a href="http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java- and-android-with-apache-commons-net /</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы рассматривали возможность использования Apache Commons Net? </font><font style="vertical-align: inherit;">Начиная с версии 3.3, только одна банка (и вы можете зависеть от нее, используя gradle или maven), и все готово: </font></font><a href="http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java- и-андроид-с-апача-достоянию-нетто /</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您是否考虑过使用Apache Commons Net？</font><font style="vertical-align: inherit;">从3.3开始，只有一个jar（您可以使用gradle或maven依赖它）就可以了：</font><a href="http://blog.dahanne.net/2013/06/17/sending-a-mail-in-java-and-android-with-apache-commons-net/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> ://blog.dahanne.net/2013/06/17/sending-a-mail-in-java- </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和android-with-apache-commons-net /</font></font>

source: Download Project <strong><a href="https://github.com/arpit999/SendMail">HERE</a></strong>
ja: <font style="vertical-align: inherit;"><strong><a href="https://github.com/arpit999/SendMail"><font style="vertical-align: inherit;">ここから</font></a></strong><font style="vertical-align: inherit;">プロジェクトをダウンロード</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ko: <font style="vertical-align: inherit;"><strong><a href="https://github.com/arpit999/SendMail"><font style="vertical-align: inherit;">여기에서</font></a></strong><font style="vertical-align: inherit;"> 프로젝트 다운로드</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Скачать проект </font></font><strong><a href="https://github.com/arpit999/SendMail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ЗДЕСЬ</font></font></a></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font><strong><a href="https://github.com/arpit999/SendMail"><font style="vertical-align: inherit;">这里</font></a></strong><font style="vertical-align: inherit;">下载项目</font></font><strong><font style="vertical-align: inherit;"></font></strong>

source: Edit: JavaMail 1.5.5 <a href="https://java.net/projects/javamail/pages/Android">claims to support Android</a>, so you shouldn't need anything else.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集：JavaMail 1.5.5 </font></font><a href="https://java.net/projects/javamail/pages/Android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はAndroidをサポートすると主張している</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ので、他には何も必要ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : JavaMail 1.5.5 </font></font><a href="https://java.net/projects/javamail/pages/Android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는 Android를 지원한다고 주장</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하므로 다른 것은 필요하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Изменить: JavaMail 1.5.5 </font></font><a href="https://java.net/projects/javamail/pages/Android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">утверждает, что поддерживает Android</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , так что вам больше ничего не нужно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑：JavaMail 1.5.5 </font></font><a href="https://java.net/projects/javamail/pages/Android"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">声称支持Android</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因此您不需要其他任何东西。</font></font>

source: For sending a mail with attachment..
ja: 添付ファイル付きのメールを送信するために...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첨부 파일이 포함 된 메일을 발송합니다.</font></font>
ru: За отправку письма с вложением...
zh_cn: 用于发送带附件的邮件.....

source: GmailBackground is small library to send an email in background without user interaction :
ja: GmailBackgroundは、ユーザーのインタラクションなしでバックグラウンドで電子メールを送信するための小さなライブラリです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GmailBackground는 사용자 상호 작용없이 백그라운드에서 이메일을 보낼 수있는 작은 라이브러리입니다.</font></font>
ru: GmailBackground-это небольшая библиотека для отправки сообщений электронной почты в фоновом режиме без вмешательства пользователя:
zh_cn: GmailBackground是一个在后台发送邮件的小库,无需用户交互。

source: Google will force you to change your linked email account password frequently due to their over zealous "suspicious activity" polices. In essence it treats repeated smtp requests from different countries within a short time frame as "suspicious activity". As they assume you (the email account holder) can only be in one country at a time.
ja: Googleは、彼らの熱狂的すぎる「不審な活動」政策のために、リンク先のメールアカウントのパスワードを頻繁に変更するように強制します。本質的には、短期間のうちに異なる国からの繰り返しのSMTPリクエストを「不審な活動」として扱います。彼らはあなた(メールアカウント所有者)が一度に1つの国にしかいられないと仮定しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Google은 열성적인 "의심스러운 활동"정책으로 인해 연결된 이메일 계정 비밀번호를 자주 변경하도록합니다. </font><font style="vertical-align: inherit;">본질적으로 짧은 시간 내에 여러 국가의 반복 된 SMTP 요청을 "의심스러운 활동"으로 취급합니다. </font><font style="vertical-align: inherit;">그들이 당신 (전자 메일 계정 보유자)은 한 번에 한 국가에만있을 수 있다고 가정합니다.</font></font>
ru: Google заставит вас часто менять пароль вашего аккаунта электронной почты,связанный со ссылкой,в связи с их чрезмерным усердием в политике "подозрительной деятельности".По сути,она рассматривает повторные запросы smtp из разных стран в течение короткого периода времени как "подозрительную деятельность".Как они полагают,Вы (владелец почтового ящика)можете находиться одновременно только в одной стране.
zh_cn: Google会强迫你频繁地修改你的链接电子邮件账户密码,因为他们过于热衷于 "可疑活动 "政策。从本质上说,它把在短时间内重复来自不同国家的smtp请求视为 "可疑活动"。因为他们假定你(电子邮件账户持有人)一次只能在一个国家。

source: Here are a lot solutions. However I think we must change the configuration of the GMail to allow accessing from less secure devices. Go to the link below and enable it. It works for me
ja: ここにはたくさんの解決策があります。しかし、私たちはあまり安全ではないデバイスからのアクセスを許可するようにGMailの設定を変更する必要があると思います。下のリンクに移動し、それを有効にします。それは私のために動作します
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에 많은 해결책이 있습니다. </font><font style="vertical-align: inherit;">그러나 덜 안전한 장치에서 액세스 할 수 있도록 Gmail 구성을 변경해야한다고 생각합니다. </font><font style="vertical-align: inherit;">아래 링크로 이동하여 활성화하십시오. </font><font style="vertical-align: inherit;">그것은 나를 위해 작동</font></font>
ru: Вот много решений.Однако я думаю,что мы должны изменить конфигурацию GMail,чтобы разрешить доступ с менее безопасных устройств.Перейдите по ссылке ниже и включите ее.Это работает для меня.
zh_cn: 这里有很多解决方案。不过我觉得必须要改变GMail的配置,允许从不太安全的设备访问。到下面的链接中去启用它。这对我来说是有效的

source: Hope it work if it not then just comment down below.
ja: それが動作することを願って、それがそうでない場合は、ちょうど下にコメントしてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 아래에 주석을 달지 않으면 효과가 있기를 바랍니다.</font></font>
ru: Надеюсь,это сработает,если не сработает,тогда просто прокомментируйте это ниже.
zh_cn: 希望它能成功,如果不行,那就在下面评论一下。

source: Hope this Helps! Good Luck!
ja: これが助けになることを願っています! 幸運を祈る!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도움이 되었기를 바랍니다! </font><font style="vertical-align: inherit;">행운을 빕니다!</font></font>
ru: Надеюсь,это поможет! Удачи!
zh_cn: 希望这对你有帮助! 祝您好运!

source: How to use:
ja: どのように使用するか。
ko: 사용하는 방법:
ru: Как пользоваться:
zh_cn: 如何使用。

source: I also found this list of email POP services really helpful:
ja: また、このメールPOPサービスのリストもとても参考になりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한이 이메일 POP 서비스 목록이 정말 유용하다는 것을 알았습니다.</font></font>
ru: Я также нашел этот список услуг электронной почты POP действительно полезным:
zh_cn: 我也觉得这个邮件服务列表对我很有帮助。

source: I am trying to create a mail sending application in Android.
ja: Androidでメール送信アプリを作ろうとしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Android에서 메일 보내기 응용 프로그램을 만들려고합니다.</font></font>
ru: Я пытаюсь создать приложение для отправки почты в Android.
zh_cn: 我正在尝试在Android中创建一个邮件发送应用程序。

source: I am unable to run Vinayak B's code. Finally i solved this issue by following :
ja: Vinayak Bのコードを実行することができません。最終的に私は次のようにしてこの問題を解決しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vinayak B의 코드를 실행할 수 없습니다. </font><font style="vertical-align: inherit;">마지막으로 다음과 같이 하여이 문제를 해결했습니다.</font></font>
ru: Я не могу запустить код Винаяка Б.В конце концов,я решил эту проблему,следуя :
zh_cn: 我无法运行Vinayak B的代码。最后,我通过以下方法解决了这个问题。

source: I created a new question for this with more information <a href="https://stackoverflow.com/questions/28693325/sending-email-in-google-glass"><strong>HERE</strong></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳細については</font><a href="https://stackoverflow.com/questions/28693325/sending-email-in-google-glass"><strong><font style="vertical-align: inherit;">こちら</font></strong></a><font style="vertical-align: inherit;">で新しい質問を作成しました</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ko: <font style="vertical-align: inherit;"><a href="https://stackoverflow.com/questions/28693325/sending-email-in-google-glass"><strong><font style="vertical-align: inherit;">여기에</font></strong></a><font style="vertical-align: inherit;"> 더 많은 정보가 </font><strong><font style="vertical-align: inherit;">담긴</font></strong><font style="vertical-align: inherit;"> 새로운 질문을 만들었습니다.</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я создал новый вопрос для этого с дополнительной информацией </font></font><a href="https://stackoverflow.com/questions/28693325/sending-email-in-google-glass"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ЗДЕСЬ</font></font></strong></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我创建了这个新问题，以了解更多信息</font></font><a href="https://stackoverflow.com/questions/28693325/sending-email-in-google-glass"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HERE</font></font></strong></a>

source: I found a shorter alternative for others who need help. The code is:
ja: 助けを必要としている他の人のための短い代替案を見つけました。コードは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도움이 필요한 다른 사람들을위한 더 짧은 대안을 찾았습니다. </font><font style="vertical-align: inherit;">코드는 다음과 같습니다</font></font>
ru: Я нашел более короткую альтернативу для тех,кто нуждается в помощи.Код таков:
zh_cn: 我找到了一个比较短的替代方案,供需要帮助的人使用。代码是:

source: I hope this helps anyone who has the same problem. With this done, this piece of code works on the google glass too.
ja: 私はこれが同じ問題を抱えている人の助けになることを願っています。これで、このコードはgoogle glassでも動作するようになりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 같은 문제를 가진 사람에게 도움이되기를 바랍니다. </font><font style="vertical-align: inherit;">이 작업을 수행하면이 코드 조각이 Google 유리에서도 작동합니다.</font></font>
ru: Надеюсь,это поможет любому,у кого есть такая же проблема.Сделав это,этот кусок кода тоже работает на Google-стекле.
zh_cn: 希望这对有同样问题的人有帮助。做到这一点,这段代码也可以在google glass上使用。

source: I tried using the code that @Vinayak B submitted. However I'm getting an error saying: No provider for smtp
ja: @Vinayak Bさんが投稿してくれたコードを使ってみました。しかし、次のようなエラーが出ます。smtp用のプロバイダがありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Vinayak B가 제출 한 코드를 사용해 보았습니다. </font><font style="vertical-align: inherit;">그러나 smtp에 대한 공급자가 없습니다.라는 오류가 발생합니다.</font></font>
ru: Я пытался использовать код,который прислал @Vinayak B.Однако я получаю ошибку:Нет провайдера для smtp
zh_cn: 我试着使用@Vinayak B提交的代码。但是,我收到一个错误提示:"No provider for smtp 没有smtp的提供者

source: I was able to fix it myself after all. I had to use an other <a href="http://www.oracle.com/technetwork/java/javasebusiness/downloads/java-archive-downloads-eeplat-419426.html#javamail-1.4.7-oth-JPR">mail.jar</a> and I had to make sure my "<a href="https://www.google.com/settings/security/lesssecureapps">access for less secure apps</a>" was turned on.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">結局自分で直せた。</font><font style="vertical-align: inherit;">他の</font></font><a href="http://www.oracle.com/technetwork/java/javasebusiness/downloads/java-archive-downloads-eeplat-419426.html#javamail-1.4.7-oth-JPR"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mail.jar</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;"> する必要があり、「</font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">安全性の低いアプリへのアクセス</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」がオン</font><font style="vertical-align: inherit;">になっていることを確認する必要</font><font style="vertical-align: inherit;">がありました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결국 스스로 고칠 수있었습니다. </font><font style="vertical-align: inherit;">다른 </font></font><a href="http://www.oracle.com/technetwork/java/javasebusiness/downloads/java-archive-downloads-eeplat-419426.html#javamail-1.4.7-oth-JPR"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mail.jar</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용해야 </font><font style="vertical-align: inherit;"> 했고 " </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보안 수준이 낮은 앱에 대한 액세스</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "가 켜져 </font><font style="vertical-align: inherit;">있는지 확인해야 </font><font style="vertical-align: inherit;">했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я смог все исправить сам. </font><font style="vertical-align: inherit;">Мне пришлось использовать другой </font></font><a href="http://www.oracle.com/technetwork/java/javasebusiness/downloads/java-archive-downloads-eeplat-419426.html#javamail-1.4.7-oth-JPR"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mail.jar,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и я должен был убедиться, что мой &laquo; </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">доступ к менее защищенным приложениям</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo; включен.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">毕竟我自己可以解决它。</font><font style="vertical-align: inherit;">我必须使用其他</font></font><a href="http://www.oracle.com/technetwork/java/javasebusiness/downloads/java-archive-downloads-eeplat-419426.html#javamail-1.4.7-oth-JPR"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mail.jar，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 并且必须确保</font><font style="vertical-align: inherit;">启用</font><font style="vertical-align: inherit;">了&ldquo; </font></font><a href="https://www.google.com/settings/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对不太安全的应用程序的访问</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;。</font></font>

source: If I use:
ja: 私が使えば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 사용하는 경우 :</font></font>
ru: Если я воспользуюсь:
zh_cn: 如果我用。

source: If the mail shall be send from the users default mail account that he already registered with the phone, you'd have to take some other approach. If you have enough time and experience, you might want to check the source code of the Android Email application to see if it offers some entry point to send a mail without user interaction (I don't know, but maybe there is one).
ja: もしメールが携帯電話に登録されているユーザーのデフォルトのメールアカウントから送信されるのであれば,他の方法を取らなければならないだろう.もしあなたに十分な時間と経験があれば、Androidメールアプリケーションのソースコードをチェックして、ユーザーとのやりとりなしでメールを送信するためのエントリーポイントを提供しているかどうかを確認してみてはいかがでしょうか(私は知りませんが、もしかしたらあるかもしれません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 전화로 등록한 사용자 기본 메일 계정에서 메일을 보내려면 다른 방법을 사용해야합니다. </font><font style="vertical-align: inherit;">시간과 경험이 충분하면 Android 전자 메일 응용 프로그램의 소스 코드를 확인하여 사용자 상호 작용없이 메일을 보낼 수있는 진입 점이 있는지 확인할 수 있습니다 (모르지만 모르겠습니다).</font></font>
ru: Если почта будет отправляться с почтового аккаунта пользователя по умолчанию,который уже зарегистрировался на телефоне,вам придется применить другой подход.Если у вас есть достаточно времени и опыта,вы,возможно,захотите проверить исходный код приложения Android Email,чтобы увидеть,если он предлагает некоторые точки входа для отправки почты без взаимодействия с пользователями (я не знаю,но может быть,есть один).
zh_cn: 如果邮件要从用户已经注册的默认邮件账户中发送,那么你就必须采取其他的方法。如果你有足够的时间和经验的话,可以去看看安卓邮件应用的源代码,看看它是否提供了一些无需用户交互的邮件发送入口(我不知道,但也许有)。
