Repository: rueisnom/feedback
Catalog: xlf/20/20/08/8/2020088.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: In case that you are demanded to keep the jar library as small as possible, you can include the SMTP/POP3/IMAP function separately to avoid the "too many methods in the dex" problem.
ja: jarライブラリをできるだけ小さくしたい場合は、SMTPPOP3IMAP関数を別途インクルードすることで、「dexにメソッドが多すぎる」という問題を回避することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jar 라이브러리를 가능한 한 작게 유지해야하는 경우 SMTP / POP3 / IMAP 기능을 별도로 포함시켜 "덱스에 너무 많은 방법"문제를 피할 수 있습니다.</font></font>
ru: В случае,если от вас требуется сохранить библиотеку банка как можно меньше,вы можете включить функцию SMTPPOP3IMAP отдельно,чтобы избежать проблемы "слишком большого количества методов в дексе".
zh_cn: 如果你需要尽量减少jar库,你可以单独包含SMTPPOP3IMAP函数,以避免 "dex中的方法太多 "的问题。

source: In order to help those getting a Network On Main Thread Exception with an SDK Target &gt;9. This is using droopie's code above but will work similarly for any.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SDK Target&gt; 9でNetwork On Main Thread Exceptionを取得する人を支援するため。</font><font style="vertical-align: inherit;">これは上記のdroopieのコードを使用していますが、どのコードでも同様に機能します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SDK 대상이&gt; 9 인 네트워크에서 메인 스레드 예외가 발생하는 것을 돕기 위해. </font><font style="vertical-align: inherit;">이것은 위의 droopie 코드를 사용하고 있지만 어떤 방식 으로든 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы помочь тем, кто получает исключение Network On Main Thread с целью SDK&gt; 9. </font><font style="vertical-align: inherit;">Это использует код droopie выше, но будет работать аналогично для любого.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了帮助那些使用SDK Target&gt; 9的人获得主线程网络异常。</font><font style="vertical-align: inherit;">这在上面使用了droopie的代码，但对任何代码都将类似地工作。</font></font>

source: Jar files: <a href="https://code.google.com/archive/p/javamail-android/">https://code.google.com/archive/p/javamail-android/</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JARファイル：</font><a href="https://code.google.com/archive/p/javamail-android/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//code.google.com/archive/p/javamail-android/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jar 파일 : </font></font><a href="https://code.google.com/archive/p/javamail-android/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://code.google.com/archive/p/javamail-android/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Файлы Jar: </font></font><a href="https://code.google.com/archive/p/javamail-android/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://code.google.com/archive/p/javamail-android/</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jar文件：</font><a href="https://code.google.com/archive/p/javamail-android/"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//code.google.com/archive/p/javamail-android/</font></font>

source: Login with gmail (<strong>using your from mail</strong>) and <strong>TURN ON</strong> toggle button <a href="https://www.google.com/settings/u/1/security/lesssecureapps">LINK</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gmail </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ログインし（</font><strong><font style="vertical-align: inherit;">fromメールを使用</font></strong><font style="vertical-align: inherit;">）、</font><font style="vertical-align: inherit;"> トグルボタン</font><a href="https://www.google.com/settings/u/1/security/lesssecureapps"><font style="vertical-align: inherit;">リンクを</font></a></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オンにする</font></font></strong><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gmail로 로그인 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메일에서 사용</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) 및 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">켜기</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 토글 버튼 </font></font><a href="https://www.google.com/settings/u/1/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">LINK</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Войдите через gmail ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">используя почту</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">включите</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> переключатель </font></font><a href="https://www.google.com/settings/u/1/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">LINK</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用gmail登录（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用您的邮件中的邮件</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）和&ldquo; </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">打开&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 切换按钮</font></font><a href="https://www.google.com/settings/u/1/security/lesssecureapps"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">LINK</font></font></a>

source: Mail Application
ja: メールでのお申し込み
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메일 신청</font></font>
ru: Почтовое приложение
zh_cn: 邮件申请

source: Maybe you even find a way to query the users account details (so you can use them for SMTP), though I highly doubt that this is possible, because it would be a huge security risk and Android is built rather securely.
ja: もしかしたら、ユーザーのアカウント情報を照会する方法を見つけることもできるかもしれません(そうすればSMTPに使用することができます)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어쩌면 사용자 계정 세부 정보를 쿼리하는 방법을 찾을 수도 있습니다 (SMTP에 사용할 수 있음). 큰 보안 위험이 있으며 Android가 다소 안전하게 구축되어 있기 때문에 이것이 가능할 것입니다.</font></font>
ru: Может быть,вы даже найдете способ запросить данные учетной записи пользователей (чтобы можно было использовать их для SMTP),хотя я сильно сомневаюсь,что это возможно,потому что это было бы огромным риском для безопасности,а Android построен достаточно надежно.
zh_cn: 也许你甚至可以找到一种方法来查询用户的账户信息(这样你就可以将其用于SMTP),不过我非常怀疑这是否可能,因为这将是一个巨大的安全隐患,而且Android系统是相当安全的。

source: Most of the people forget about this step i hope you will not.
ja: ほとんどの人がこのステップを忘れていることを願っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 사람들은이 단계를 잊어 버립니다.</font></font>
ru: Большинство людей забывают об этом шаге,я надеюсь,что вы этого не сделаете.
zh_cn: 大多数人都忘了这一步,我希望你不会。

source: Only 1 gradle email dependency needed also.
ja: グラドルメールの依存関係も1つだけ必要です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 gradle 전자 메일 종속성도 필요했습니다.</font></font>
ru: Требуется также зависимость от электронной почты только на 1 градус.
zh_cn: 只需要1个gradle电子邮件的依赖性。

source: P.S. And don't forget that you cannot do network operation from any Activity in android. Hence it is recommended to use <code>AsyncTask</code> or <code>IntentService</code> to avoid network on main thread exception.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PSそして、あなたはアンドロイドのどのアクティビティからもネットワーク操作を行うことができないことを忘れないでください。</font><font style="vertical-align: inherit;">したがって</font><font style="vertical-align: inherit;">、メインスレッド例外でのネットワークを回避するために、</font></font> <code>AsyncTask</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>IntentService</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用することをお勧めします</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추신 당신은 안드로이드의 어떤 활동에서 네트워크 작업을 수행 할 수 없다는 것을 잊지 마십시오. </font><font style="vertical-align: inherit;">따라서 </font><font style="vertical-align: inherit;">메인 스레드 예외에서 네트워크를 피 </font><font style="vertical-align: inherit;">하려면 </font></font> <code>AsyncTask</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>IntentService</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 것이 좋습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PS И не забывайте, что вы не можете выполнять сетевые операции из любой активности в Android. </font><font style="vertical-align: inherit;">Следовательно, рекомендуется использовать </font></font> <code>AsyncTask</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>IntentService</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы избежать исключений сети в главном потоке.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PS并且不要忘记，您无法通过android中的任何Activity进行网络操作。</font><font style="vertical-align: inherit;">因此，建议使用</font></font> <code>AsyncTask</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>IntentService</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以避免主线程网络异常。</font></font>

source: Please let me know if you have any issue with it! :)
ja: 何か問題があったら教えてくださいね! :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제가 있으면 알려주세요! </font><font style="vertical-align: inherit;">:)</font></font>
ru: Пожалуйста,дайте мне знать,если у вас есть какие-то проблемы! :)
zh_cn: 如果你有什么问题请告诉我! :)

source: Run the project and check your recipient mail account for the mail. Cheers!
ja: プロジェクトを実行して、受信者のメールアカウントにメールが届いているか確認してください。乾杯!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로젝트를 실행하고 메일의 수신자 메일 계정을 확인하십시오. </font><font style="vertical-align: inherit;">건배!</font></font>
ru: Запустите проект и проверьте почтовый аккаунт получателя.За Ваше здоровье!
zh_cn: 运行项目并检查收件人邮件账户中的邮件。干杯!

source: Send e-mail in Android using the JavaMail API using Gmail authentication.
ja: Gmail認証を利用してJavaMail APIを利用してAndroidでメールを送信します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gmail 인증을 사용하여 JavaMail API를 사용하여 Android에서 이메일을 보냅니다.</font></font>
ru: Отправка электронной почты в Android с помощью JavaMail API с помощью Gmail-аутентификации.
zh_cn: 在Android中使用JavaMail API使用Gmail验证发送电子邮件。

source: Send email from client apk. Here mail.jar, activation.jar is required to send java email. If these jars are added, it might increase the APK Size.
ja: クライアントのapkからメールを送信します。ここではmail.jar、activation.jarが必要になります。これらのjarを追加すると、APKサイズが大きくなる可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트 APK에서 이메일을 보내십시오. </font><font style="vertical-align: inherit;">여기에서 mail.jar, activation.jar은 Java 전자 우편을 보내야합니다. </font><font style="vertical-align: inherit;">이러한 항아리가 추가되면 APK 크기가 증가 할 수 있습니다.</font></font>
ru: Отправьте письмо от клиента apk.Здесь mail.jar,активация.jar необходима для отправки java-сообщений.Если эти банки будут добавлены,это может увеличить размер APK.
zh_cn: 从客户端apk发送邮件。这里需要mail.jar、activation.jar来发送java邮件。如果加上这些jar,可能会增加APK大小。

source: Sending Email in Android using JavaMail API without using the default/built-in app
ja: JavaMail APIを使用してAndroidでメールを送信するには、デフォルトのビルトインアプリを使用しない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 / 내장 앱을 사용하지 않고 JavaMail API를 사용하여 Android에서 이메일 보내기</font></font>
ru: Отправка электронной почты в Android с помощью JavaMail API без использования встроенного по умолчанию приложения.
zh_cn: 在Android中使用JavaMail API发送电子邮件而不使用默认内置的应用程序

source: Sending email programmatically with Kotlin.
ja: Kotlinを使ってプログラムでメールを送信する。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Kotlin으로 프로그래밍 방식으로 이메일 보내기</font></font>
ru: Отправка электронной почты программно с Котлином.
zh_cn: 用Kotlin程序化发送邮件。

source: So I recommend using one of the many free smtp providers instead of "smtp.gmail.com" to avoid this security problem. Use the same code but change "smtp.gmail.com" to your new smtp forwarding host.
ja: そこで、このセキュリティ上の問題を避けるために、"smtp.gmail.com "の代わりに無料のsmtpプロバイダを使うことをお勧めします。同じコードを使用しますが、"smtp.gmail.com "を新しいsmtp転送ホストに変更してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서이 보안 문제를 피하려면 "smtp.gmail.com"대신 많은 무료 smtp 공급자 중 하나를 사용하는 것이 좋습니다. </font><font style="vertical-align: inherit;">동일한 코드를 사용하지만 "smtp.gmail.com"을 새 smtp 전달 호스트로 변경하십시오.</font></font>
ru: Поэтому я рекомендую использовать один из многих бесплатных провайдеров smtp вместо "smtp.gmail.com",чтобы избежать этой проблемы безопасности.Используйте тот же код,но поменяйте "smtp.gmail.com" на ваш новый smtp-провайдер.
zh_cn: 因此,我建议使用众多免费的smtp提供商之一,而不是 "smtp.gmail.com "来避免这个安全问题。使用同样的代码,但将 "smtp.gmail.com "改为新的smtp转发主机。

source: Source: <a href="https://www.mkyong.com/java/javamail-api-sending-email-via-gmail-smtp-example/">Sending Email via JavaMail API</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソース：</font></font><a href="https://www.mkyong.com/java/javamail-api-sending-email-via-gmail-smtp-example/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaMail APIを介したメールの送信</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 : </font></font><a href="https://www.mkyong.com/java/javamail-api-sending-email-via-gmail-smtp-example/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaMail API를 통해 이메일 보내기</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="https://www.mkyong.com/java/javamail-api-sending-email-via-gmail-smtp-example/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Отправка электронной почты через JavaMail API</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来源：</font></font><a href="https://www.mkyong.com/java/javamail-api-sending-email-via-gmail-smtp-example/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过JavaMail API发送电子邮件</font></font></a>

source: Steps to create a sample Project:
ja: サンプルプロジェクトの作成手順
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">샘플 프로젝트를 만드는 단계 :</font></font>
ru: Шаги по созданию образца проекта:
zh_cn: 创建项目样本的步骤。

source: TLS is always on
ja: TLSは常に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TLS는 항상 켜져 있습니다</font></font>
ru: TLS всегда включена
zh_cn: TLS始终处于开启状态

source: Thank you for your valuable information. Code is working fine. I am able to add attachment also by adding following code.
ja: 貴重な情報をありがとうございます。コードは正常に動作しています。以下のコードを追加することで、添付ファイルを追加することもできました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소중한 정보 감사합니다. </font><font style="vertical-align: inherit;">코드가 제대로 작동합니다. </font><font style="vertical-align: inherit;">다음 코드를 추가하여 첨부 파일을 추가 할 수도 있습니다.</font></font>
ru: Спасибо за ценную информацию.Код работает отлично.Я могу добавить вложение,также добавив следующий код.
zh_cn: 谢谢您提供的宝贵信息。代码工作正常。我也可以通过添加以下代码添加附件。

source: The code:
ja: コードだ
ko: 코드:
ru: Код:
zh_cn: 的代码。

source: This will launch the built-in Android application; I'm trying to send the mail on button click directly <strong>without</strong> using this application.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより、組み込みのAndroidアプリケーションが起動します。</font><font style="vertical-align: inherit;">このアプリケーション</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><strong><font style="vertical-align: inherit;">せずに</font></strong><font style="vertical-align: inherit;">、ボタンをクリックして直接メールを送信しようとし</font><font style="vertical-align: inherit;">ています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내장 된 Android 애플리케이션이 시작됩니다. </font><font style="vertical-align: inherit;">이 응용 프로그램 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용 </font><strong><font style="vertical-align: inherit;">하지 않고</font></strong><font style="vertical-align: inherit;"> 버튼 클릭으로 직접 메일을 보내려고 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это запустит встроенное приложение для Android; </font><font style="vertical-align: inherit;">Я пытаюсь отправить письмо по нажатию кнопки </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">без</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использования этого приложения.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这将启动内置的Android应用程序；</font><font style="vertical-align: inherit;">我试图</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用此应用程序</font><font style="vertical-align: inherit;">直接发送单击按钮上的邮件</font><font style="vertical-align: inherit;">。</font></font>

source: Those who are getting <code>ClassDefNotFoundError</code> try to move that Three jar files to lib folder of your Project,it worked for me!!
ja: <font style="vertical-align: inherit;"></font> <code>ClassDefNotFoundError</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を取得している人は、</font><font style="vertical-align: inherit;">その3つのjarファイルをプロジェクトのlibフォルダーに移動しようとしましたが、私にとってはうまくいきました!!</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>ClassDefNotFoundError</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 얻는 사람들은 </font><font style="vertical-align: inherit;">그 세 jar 파일을 프로젝트의 lib 폴더로 이동하려고 시도했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Те, кто получает </font></font> <code>ClassDefNotFoundError</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пытаются переместить эти три jar-файла в папку lib вашего проекта, у меня это сработало !!</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">那些正在获取</font></font> <code>ClassDefNotFoundError</code> 的人<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试</font><font style="vertical-align: inherit;">将这</font><font style="vertical-align: inherit;">三个jar文件移动到您的Project的lib文件夹中，它对我有用！</font></font>

source: To add attachment, don't forget to add.
ja: 添付ファイルを追加するには、忘れずに追加してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첨부 파일을 추가하려면 반드시 추가해야합니다.</font></font>
ru: Чтобы добавить вложение,не забудь добавить.
zh_cn: 要添加附件,别忘了添加。

source: Using SMTP is one way to go, and the others have already pointed out ways how to do it. Just note that while doing this, you completely circumvent the built in mail app, and you will have to provide the address of the SMTP server, the user name and password for that server, either statically in your code, or query it from the user.
ja: SMTPを使用するのは一つの方法であり、他の人が既に方法を指摘しています。ただ、この方法では、内蔵のメールアプリを完全に回避することになるので、SMTPサーバーのアドレス、そのサーバーのユーザー名とパスワードを、コード内で静的に提供するか、ユーザーから問い合わせて提供する必要があることに注意してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SMTP를 사용하는 것이 한 가지 방법이며 다른 방법은 이미 SMTP를 사용하는 방법을 지적했습니다. </font><font style="vertical-align: inherit;">이 작업을 수행하는 동안 기본 제공 메일 앱을 완전히 우회하고 SMTP 서버의 주소, 해당 서버의 사용자 이름 및 비밀번호를 코드에 정적으로 입력하거나 사용자에게 쿼리해야합니다. .</font></font>
ru: Использование SMTP-это один из способов,а другие уже указывали,как это сделать.Просто обратите внимание,что при этом вы полностью обходите встроенное почтовое приложение,и вам нужно будет указать адрес SMTP-сервера,имя пользователя и пароль для этого сервера,либо статически в вашем коде,либо запросить их у пользователя.
zh_cn: 使用SMTP是一种方法,其他人已经指出了如何做的方法。只是需要注意的是,在这样做的时候,你完全绕过了内置的邮件应用,你必须提供SMTP服务器的地址、用户名和密码,可以在你的代码中静态提供,也可以从用户那里查询。

source: When google systems detect "suspicious activity" it will prevent further emails until you change the password. As you will have hard coded the password into the app you have to re-release the app each time this happens, not ideal. This happened 3 times in a week to me, I even stored the password on another server and dynamically fetched the password each time google forced me to change it.
ja: googleのシステムが "不審な行動 "を検知した場合、パスワードを変更するまでメールが来ないようにしてくれます。あなたはアプリにパスワードをハードコードしているので、これが起こるたびにアプリを再リリースする必要がありますが、理想的ではありません。これは私には1週間で3回起こりましたが、私もパスワードを別のサーバーに保存しておき、Googleがパスワードを変更するたびに動的にフェッチしていました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Google 시스템이 '의심스러운 활동'을 감지하면 비밀번호를 변경할 때까지 추가 이메일이 발송되지 않습니다. </font><font style="vertical-align: inherit;">암호를 앱에 하드 코딩 했으므로 이러한 상황이 발생할 때마다 앱을 다시 릴리스해야합니다. 이상적이지는 않습니다. </font><font style="vertical-align: inherit;">이것은 일주일에 3 번 나에게 일어 났으며, 다른 서버에 비밀번호를 저장하고 Google이 강제로 비밀번호를 변경할 때마다 동적으로 비밀번호를 가져 왔습니다.</font></font>
ru: Когда системы Google обнаруживают "подозрительную активность",это препятствует дальнейшей переписке до тех пор,пока вы не смените пароль.Так как у вас будет жестко закодированный пароль в приложение,вам придется переиздавать приложение каждый раз,когда это произойдет,не идеально.Со мной такое случалось 3 раза в неделю,я даже хранил пароль на другом сервере и динамически получал его каждый раз,когда Google заставлял меня его менять.
zh_cn: 当谷歌系统检测到 "可疑活动 "时,它将阻止进一步的电子邮件,直到你改变密码。因为你会把密码硬编码到应用程序中,每次发生这种情况时,你必须重新释放应用程序,不是很理想。这在一个星期内发生了3次,我甚至将密码存储在另一台服务器上,每次google强迫我更改密码时,我都会动态提取密码。
