Repository: rueisnom/feedback
Catalog: xlf/20/20/08/8/2020088.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Without user intervention, you can send as follows:
ja: ユーザーの介入がなければ、以下のように送信することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 개입없이 다음과 같이 보낼 수 있습니다.</font></font>
ru: Без вмешательства пользователя вы можете отправить следующее:
zh_cn: 在没有用户干预的情况下,可以按以下方式发送。

source: Word of warning if using "smtp.gmail.com" as the default smtp server.
ja: デフォルトのsmtpサーバとして "smtp.gmail.com "を使用している場合は注意が必要です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"smtp.gmail.com"을 기본 smtp 서버로 사용하는 경우 경고 메시지.</font></font>
ru: Слово предупреждения при использовании "smtp.gmail.com" в качестве сервера по умолчанию.
zh_cn: 如果使用 "smtp.gmail.com "作为默认smtp服务器,请注意。

source: You can choose the wanted jar libraries from <a href="https://java.net/projects/javamail/pages/Home">the javanet web page</a>, for example, mailapi.jar + imap.jar can enable you to access icloud, hotmail mail server in IMAP protocol. (with the help of additional.jar and activation.jar)
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font></font><a href="https://java.net/projects/javamail/pages/Home"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">javanet Webページ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から必要なjarライブラリを選択できます。</font><font style="vertical-align: inherit;">たとえば、mailapi.jar + imap.jarを使用すると、IMAPプロトコルでicloud、hotmailメールサーバーにアクセスできます。</font><font style="vertical-align: inherit;">（additional.jarおよびactivation.jarを使用して）</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://java.net/projects/javamail/pages/Home"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">javanet 웹 페이지</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 원하는 jar 라이브러리를 선택할 수 있습니다. </font><font style="vertical-align: inherit;">예를 들어 mailapi.jar + imap.jar을 사용하면 IMAP 프로토콜로 imail, 핫메일 메일 서버에 액세스 할 수 있습니다. </font><font style="vertical-align: inherit;">(additional.jar 및 activation.jar의 도움으로)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете выбрать </font></font><a href="https://java.net/projects/javamail/pages/Home"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нужные</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> библиотеки jar </font><font style="vertical-align: inherit;">на веб-странице javanet</font><font style="vertical-align: inherit;"> , например, mailapi.jar + imap.jar может позволить вам получить доступ к icloud, почтовому серверу hotmail по протоколу IMAP. </font><font style="vertical-align: inherit;">(с помощью Additional.jar и Activation.jar)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以从</font></font><a href="https://java.net/projects/javamail/pages/Home"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">javanet网页上</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择所需的jar库</font><font style="vertical-align: inherit;">，例如，mailapi.jar + imap.jar可以使您以imap协议访问icloud，hotmail邮件服务器。</font><font style="vertical-align: inherit;">（借助于Additional.jar和Activation.jar）</font></font>

source: You can find the Android port for JavaMail at the following location: <a href="http://code.google.com/p/javamail-android/">http://code.google.com/p/javamail-android/</a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaMailのAndroidポートは、次の場所にあります</font><a href="http://code.google.com/p/javamail-android/"><font style="vertical-align: inherit;">。http</font></a><font style="vertical-align: inherit;">： </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//code.google.com/p/javamail-android/</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 위치에서 JavaMail 용 Android 포트를 찾을 수 있습니다. </font></font><a href="http://code.google.com/p/javamail-android/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://code.google.com/p/javamail-android/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете найти порт Android для JavaMail по следующему </font><a href="http://code.google.com/p/javamail-android/"><font style="vertical-align: inherit;">адресу</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://code.google.com/p/javamail-android/</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以在以下位置找到JavaMail的Android端口：</font><a href="http://code.google.com/p/javamail-android/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//code.google.com/p/javamail-android/</font></font>

source: You can get it via Gradle or Maven:
ja: GradleやMaven経由で取得できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Gradle 또는 Maven을 통해 얻을 수 있습니다.</font></font>
ru: Ты можешь получить его через Грэдл или Мэйвен:
zh_cn: 你可以通过Gradle或Maven获得。

source: You can receive a notification for the email sent and it has also the support for different Recipients types (TO, CC and BCC), attachments and html:
ja: あなたは、送信された電子メールの通知を受け取ることができ、それはまた、異なる受信者のタイプ(TO、CCとBCC)、添付ファイルとhtmlのサポートを持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전송 된 전자 메일에 대한 알림을받을 수 있으며 다양한받는 사람 유형 (TO, CC 및 BCC), 첨부 파일 및 html도 지원합니다.</font></font>
ru: Вы можете получить уведомление об отправленном электронном сообщении,оно также поддерживает различные типы получателей (TO,CC и BCC),вложения и html:
zh_cn: 您可以收到发送的邮件通知,并支持不同的收件人类型(TO、CC和BCC)、附件和HTML。

source: You can use AsyncTask as below
ja: AsyncTaskは以下のように使用できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래와 같이 AsyncTask를 사용할 수 있습니다</font></font>
ru: Вы можете использовать AsyncTask,как показано ниже.
zh_cn: 你可以使用AsyncTask,如下所示

source: You can use JavaMail API to handle your email tasks. JavaMail API is available in JavaEE package and its jar is available for download. Sadly it cannot be used directly in an Android application since it uses AWT components which are completely incompatible in Android.
ja: JavaMail APIを利用してメールの処理を行うことができます。JavaMail APIはJavaEEパッケージで提供されており、そのjarをダウンロードすることができます。残念ながら、Androidでは完全に互換性のないAWTコンポーネントを使用しているため、Androidアプリケーションで直接使用することはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaMail API를 사용하여 이메일 작업을 처리 할 수 ​​있습니다. </font><font style="vertical-align: inherit;">JavaMail API는 JavaEE 패키지로 제공되며 해당 jar은 다운로드 할 수 있습니다. </font><font style="vertical-align: inherit;">안타깝게도 Android와 완전히 호환되지 않는 AWT 구성 요소를 사용하기 때문에 Android 응용 프로그램에서 직접 사용할 수 없습니다.</font></font>
ru: Вы можете использовать JavaMail API для работы с электронной почтой.JavaMail API доступен в пакете JavaEE,а его банка доступна для скачивания.К сожалению,его нельзя использовать непосредственно в приложении для Android,так как в нем используются AWT-компоненты,которые полностью несовместимы в Android.
zh_cn: 你可以使用JavaMail API来处理你的电子邮件任务。JavaMail API是在JavaEE包中提供的,它的jar可供下载。遗憾的是,它不能直接在Android应用程序中使用,因为它使用的AWT组件在Android中完全不兼容。

source: You have just to create a MailSender, build a mail and send it (already handled in background with an AsyncTask).
ja: MailSenderを作成し、メールをビルドして送信するだけです(バックグラウンドでは既にAsyncTaskで処理されています)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MailSender를 만들고 메일을 작성하여 보내면됩니다 (이미 백그라운드에서 AsyncTask로 처리됨).</font></font>
ru: Вам нужно просто создать MailSender,построить письмо и отправить его (уже обработанное в фоновом режиме с помощью AsyncTask).
zh_cn: 你只需要创建一个MailSender,建立一个邮件并发送(已经在后台用AsyncTask处理)。

source: and to call it in an activity...
ja: と活動で呼ぶには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 활동에서 그것을 부르기 위해 ...</font></font>
ru: и называть это деятельностью...
zh_cn: 并在活动中称其为.....

source: here is an alt version that also works for me and has attachments (posted already above but complete version unlike the source link, which people posted they cant get it to work since its missing data)
ja: ここではまた、私のために動作し、添付ファイルを持っているaltバージョンです(すでに上記のように投稿されたが、完全なバージョンは、ソースリンクとは異なり、人々は、そのデータが不足しているので、それが動作するように取得することはできません投稿されたソースリンクとは異なります
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 나에게도 도움이되고 첨부 파일이있는 대체 버전입니다 (이미 게시되었지만 소스 링크와 달리 완전한 버전은 누락 된 데이터로 인해 작동하지 않습니다)</font></font>
ru: вот альт-версия,которая также работает для меня и имеет вложения (размещены уже выше,но полная версия в отличие от ссылки на исходный текст,который люди разместили,они не могут заставить его работать,так как его недостающие данные)
zh_cn: 这里是一个备选版本,也为我工作,并有附件 (上面已经发布了,但完整的版本,不像源链接,人们发布的版本,他们无法得到它的工作,因为它缺少数据)

source: simple email sending, not all the other features (like attachments).
ja: シンプルなメール送信で、他のすべての機能(添付ファイルのような)ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 모든 기능 (첨부 파일 등)이 아닌 간단한 이메일 전송</font></font>
ru: Простая отправка электронной почты,а не все остальные функции (например,вложения).
zh_cn: 简单的邮件发送,而不是其他所有的功能(如附件)。
