Repository: rueisnom/feedback
Catalog: xlf/14/51/00/9/1451009.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This should be simple to understand if you remember that a functions variable values are set when the function is called (but this uses the exact same thought process as before)
es: Esto debería ser fácil de entender si se recuerda que los valores de las variables de una función se establecen cuando se llama la función (pero esto utiliza exactamente el mismo proceso de pensamiento que antes)
ja: これは、関数が呼び出されたときに関数の変数の値が設定されることを覚えていれば、理解するのは簡単なはずです(しかし、これは以前と全く同じ思考プロセスを使用しています)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수가 호출 될 때 함수 변수 값이 설정된다는 것을 기억하면 이해하기 간단해야합니다 (그러나 이것은 이전과 똑같은 생각 프로세스를 사용합니다)</font></font>
ru: Это должно быть простым для понимания,если помнить,что при вызове функции устанавливаются значения переменной функции (но при этом используется тот же самый мыслительный процесс,что и раньше).
zh_cn: 如果你还记得函数的变量值是在函数被调用时设置的,这应该很容易理解(但这和之前的思维过程完全相同

source: We have 5 divs on the page, each with an ID ... div1, div2, div3, div4, div5
es: Tenemos 5 divs en la página,cada uno con un ID...div1,div2,div3,div4,div5
ja: ページには 5 つの div があり、それぞれに ID ...div1,div2,div3,div4,div5 が付いています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 페이지에 5 개의 div가 있으며 각각은 ID가 있습니다 ... div1, div2, div3, div4, div5</font></font>
ru: На странице у нас есть 5 divs,каждый из которых имеет ID ...div1,div2,div3,div4,div5.
zh_cn: 我们在页面上有5个div,每个div都有一个ID......div1,div2,div3,div4,div5

source: You call this function with the value i at every iteration, thus you create separate onclick functions for each links.
es: Llamas a esta función con el valor i en cada iteración,así creas funciones onclick separadas para cada enlace.
ja: この関数を繰り返しのたびに値 i で呼び出すので、リンクごとに別々の onclick 関数を作成することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반복 할 때마다 i 값으로이 함수를 호출하므로 각 링크마다 별도의 onclick 함수를 작성합니다.</font></font>
ru: Вы вызываете эту функцию со значением i на каждой итерации,таким образом,вы создаете отдельные функции клика для каждой ссылки.
zh_cn: 你在每次迭代时用值i调用这个函数,因此你为每个链接创建单独的onclick函数。

source: jQuery can do this ...
es: jQuery puede hacer esto...
ja: jQueryにはこんなことができるんですね...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery는 이것을 할 수 있습니다 ...</font></font>
ru: jQuery может сделать это...
zh_cn: jQuery可以这样做.....
