Repository: rueisnom/feedback
Catalog: xlf/14/51/00/9/1451009.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In the second example, instead of binding it to the <code>num</code> in the <code>onclick</code> handler, you're passing it into a function, which then binds it to the <code>num</code> in the <code>onclick</code> handler. When you pass it into the function, the value of <code>i</code> is <em>copied, not bound</em> to <code>num</code>. So when <code>i</code> changes, <code>num</code> stays the same. The copy occurs because functions in JavaScript are "closures", meaning that once something is passed into the function, it's "closed" for outside modification.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el segundo ejemplo, en lugar de vincularlo al </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo est&aacute; pasando a una funci&oacute;n, que luego lo vincula al </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Cuando lo pasa a la funci&oacute;n, el valor de </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">copia, no est&aacute; vinculado</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . As&iacute; que cuando </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cambios, </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sigue siendo el mismo. La copia se produce porque las funciones en JavaScript son "cierres", lo que significa que una vez que se pasa algo a la funci&oacute;n, se "cierra" para su modificaci&oacute;n externa.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目の例では、それを</font> <code>onclick</code> <font style="vertical-align: inherit;">ハンドラーの</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">バインドする代わり</font><font style="vertical-align: inherit;">に、関数に渡して</font><font style="vertical-align: inherit;">、</font> <code>onclick</code> <font style="vertical-align: inherit;">ハンドラーの</font> <code>num</code> <font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">バインドしてい</font><font style="vertical-align: inherit;">ます。関数に渡すと、</font> <code>num</code> に<em><font style="vertical-align: inherit;">バインドさ</font></em><font style="vertical-align: inherit;">れ</font><em><font style="vertical-align: inherit;">ず</font></em><font style="vertical-align: inherit;">に</font> <code>i</code> <font style="vertical-align: inherit;">の値</font><font style="vertical-align: inherit;">が</font><em><font style="vertical-align: inherit;">コピーされ</font></em><font style="vertical-align: inherit;">ます。したがって、</font> <code>i</code> <font style="vertical-align: inherit;">が変更しても、</font> <code>num</code> <font style="vertical-align: inherit;">は同じままです。コピーが発生するのは、JavaScriptの関数が「クロージャ」であるためです。つまり、いったん関数に渡されると、外部での変更のために「クローズ」されます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 예제에서는 </font> <code>onclick</code> <font style="vertical-align: inherit;"> 핸들러 </font><font style="vertical-align: inherit;">에서 </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">바인딩하는 대신 </font><font style="vertical-align: inherit;">함수에 전달한 다음 </font> <code>onclick</code> <font style="vertical-align: inherit;"> 핸들러 </font><font style="vertical-align: inherit;">에서 </font> <code>num</code> <font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">바인딩 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">당신이 함수에 전달할 때의 값이 </font> <code>i</code> <font style="vertical-align: inherit;"> 되고 </font><em><font style="vertical-align: inherit;">바인딩되지, 복사</font></em><font style="vertical-align: inherit;"> 에 </font> <code>num</code> <font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그래서 </font> <code>i</code> <font style="vertical-align: inherit;"> 변경, </font> <code>num</code> <font style="vertical-align: inherit;"> 동일하게 유지됩니다. </font><font style="vertical-align: inherit;">JavaScript의 함수가 "클로저"이기 때문에 복사가 발생합니다. 즉, 함수에 무언가가 전달되면 외부 수정을 위해 "닫힙니다".</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во втором примере вместо привязки его к </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><font style="vertical-align: inherit;">обработчике </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы передаете его в функцию, которая затем привязывает его к </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><font style="vertical-align: inherit;">обработчике </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Когда вы передаете его в функцию, значение </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">скопировано, не связанное</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Поэтому, когда </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> меняюсь, </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> остается прежним. Копирование происходит потому, что функции в JavaScript являются &laquo;замыканиями&raquo;, что означает, что, как только что-то передается в функцию, оно &laquo;закрывается&raquo; для внешней модификации.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第二个例子中，而不是将其绑定到</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理程序中，你传递给函数，然后绑定到</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理程序。当你将它传递到的功能，价值</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">复制的，未绑定</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">至</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。因此，当</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改时，</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">保持不变。发生复制是因为JavaScript中的函数是&ldquo;闭包&rdquo;，这意味着一旦将某些内容传递到函数中，就将其&ldquo;关闭&rdquo;以进行外部修改。</font></font>

source: JavaScript's scopes are function-level, not block-level, and creating a closure just means that the enclosing scope gets added to the lexical environment of the enclosed function.
es: Los alcances de JavaScript son a nivel de función,no a nivel de bloque,y la creación de un cierre sólo significa que el alcance del encierro se añade al entorno léxico de la función encerrada.
ja: JavaScript のスコープはブロックレベルではなく関数レベルであり、クロージャを作成することは、単に囲んだスコープが囲んだ関数の字句環境に追加されることを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript의 범위는 블록 수준이 아니라 함수 수준이며 클로저를 만드는 것은 둘러싸는 범위가 포함 된 함수의 어휘 환경에 추가됨을 의미합니다.</font></font>
ru: Сферы применения JavaScript являются функциональными,а не блоковыми,и создание закрывающей области видимости означает,что в лексическое окружение закрытой функции добавляется закрывающая область видимости.
zh_cn: JavaScript的作用域是函数级的,而不是块级的,创建一个闭包只是意味着包围的作用域被添加到包围函数的词法环境中。

source: Javascript infamous Loop issue
es: El infame número de Javascript Loop
ja: Javascript悪名高いループ問題
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트 악명 높은 루프 문제</font></font>
ru: печально известный выпуск Javascript Loop
zh_cn: Javascript臭名昭著的循环问题

source: Keep in mind that this approach is rather inefficient as two new function objects have to be created for each link. This is unnecessary, as they can easily be shared if you use the DOM node for information storage:
es: Tenga en cuenta que este enfoque es bastante ineficiente ya que hay que crear dos nuevos objetos funcionales para cada enlace.Esto es innecesario,ya que pueden ser fácilmente compartidos si se utiliza el nodo DOM para el almacenamiento de información:
ja: このアプローチは、各リンクに対して 2 つの新しい関数オブジェクトを作成しなければならないため、かなり非効率的であることに注意してください。情報の保存に DOM ノードを使えば簡単に共有できるので、これは不要です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법은 각 링크마다 두 개의 새로운 함수 객체를 생성해야하기 때문에 다소 비효율적입니다. </font><font style="vertical-align: inherit;">정보 저장을 위해 DOM 노드를 사용하면 쉽게 공유 할 수 있으므로 불필요합니다.</font></font>
ru: Имейте в виду,что такой подход довольно неэффективен,так как для каждого звена должны быть созданы два новых функциональных объекта.В этом нет необходимости,так как они могут быть легко использованы совместно,если вы используете DOM-узел для хранения информации:
zh_cn: 请记住,这种方法是相当低效的,因为每个链接都要创建两个新的函数对象。这是不必要的,因为如果你使用DOM节点进行信息存储,它们可以很容易被共享。

source: Others have explained what's going on, here's an alternative solution.
es: Otros han explicado lo que está pasando,aquí hay una solución alternativa.
ja: 他の人が説明してくれていますが、別の解決策があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 사람들은 무슨 일이 일어나고 있는지 설명했습니다. 여기에 다른 해결책이 있습니다.</font></font>
ru: Другие объяснили,что происходит,вот альтернативное решение.
zh_cn: 其他人都解释了是怎么回事,这里有一个备选方案。

source: SIMPLE TO UNDERSTAND ALTERNATIVE
es: ALTERNATIVA SIMPLE DE ENTENDER
ja: わかりやすい代替案
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대체를 이해하는 간단한</font></font>
ru: ПРОСТАЯ ДЛЯ ПОНИМАНИЯ АЛЬТЕРНАТИВА
zh_cn: 通俗易懂

source: STEP 1
es: PASO 1
ja: ステップ1
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 단계</font></font>
ru: 1-Й ШАГ
zh_cn: 步骤1

source: STEP 2
es: PASO 2
ja: ステップ2
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 단계</font></font>
ru: ШАГ 2
zh_cn: 第二步

source: The above 2 snippets are quoted from <a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/">here</a>. As the author's explanation, seems the <strong>closure</strong> makes the magic.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los 2 fragmentos anteriores se citan desde </font></font><a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Como explica el autor, parece que el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cierre</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace la magia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の2つの抜粋は</font></font><a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から引用されてい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">著者の説明のように、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">閉鎖</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が魔法をかけるようです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 2 개 스 니펫은 </font></font><a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 인용 </font><font style="vertical-align: inherit;">됩니다</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">저자의 설명처럼, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">폐쇄</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 마술을 만드는 </font><font style="vertical-align: inherit;">것처럼 보인다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вышеуказанные 2 фрагмента приведены </font></font><a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Как объясняет автор, похоже, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">замыкание</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает волшебство.</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><a href="http://robertnyman.com/2008/10/09/explaining-javascript-scope-and-closures/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用了以上两个片段</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">正如作者的解释，似乎</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">封闭</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使魔术。</font></font>

source: The above code is for generating 5 links and bind each link with an alert event to show the current link id. But It doesn't work. When you click the generated links they all say "link 5".
es: El código anterior es para generar 5 enlaces y vincular cada enlace con un evento de alerta para mostrar el id del enlace actual.Pero no funciona.Cuando haces clic en los enlaces generados todos dicen "enlace 5".
ja: 上記のコードは、5つのリンクを生成し、それぞれのリンクに現在のリンクIDを表示するアラートイベントをバインドするものです。しかし、それは動作しません。生成されたリンクをクリックすると、すべて "link 5 "と表示されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 코드는 5 개의 링크를 생성하고 각 링크를 경고 이벤트와 바인딩하여 현재 링크 ID를 표시합니다. </font><font style="vertical-align: inherit;">그러나 작동하지 않습니다. </font><font style="vertical-align: inherit;">생성 된 링크를 클릭하면 모두 "링크 5"라고 표시됩니다.</font></font>
ru: Вышеуказанный код предназначен для генерации 5 ссылок и связывания каждой ссылки с предупреждающим событием для отображения идентификатора текущей ссылки.Но это не работает.При нажатии на генерируемые ссылки все они говорят "ссылка 5".
zh_cn: 上面的代码是用于生成5个链接,并给每个链接绑定一个警告事件来显示当前链接的id。但是,它并没有工作。当你点击生成的链接,它们都说 "链接5"。

source: The point is that in the first example your function contained a variable reference, while in the second one with the help of the outer function you substituted the reference with an actual value. This is called a closure roughly because you "enclose" the current value of a variable within your function instead of keeping a reference to it.
es: La cuestión es que en el primer ejemplo su función contenía una referencia variable,mientras que en el segundo,con la ayuda de la función externa,sustituyó la referencia por un valor real.Esto se llama un cierre aproximadamente porque "encierras" el valor actual de una variable dentro de tu función en lugar de mantener una referencia a ella.
ja: ポイントは、最初の例では関数に変数の参照が含まれていましたが、2 番目の例では外部関数の助けを借りて参照を実際の値で置き換えたということです。これは大まかにはクロージャと呼ばれています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요점은 첫 번째 예제에서 함수에 변수 참조가 포함되어 있고 두 번째 예제에서는 외부 함수의 도움으로 참조를 실제 값으로 대체했다는 것입니다. </font><font style="vertical-align: inherit;">변수에 대한 참조를 유지하는 대신 함수 내에서 변수의 현재 값을 "포함"하기 때문에이를 클로저라고합니다.</font></font>
ru: Дело в том,что в первом примере ваша функция содержала ссылку на переменную,а во втором с помощью внешней функции вы подставили ссылку на фактическое значение.Это называется замыканием примерно потому,что вы "заключили" текущее значение переменной в свою функцию вместо того,чтобы хранить ссылку на нее.
zh_cn: 问题是,在第一个例子中,你的函数包含了一个变量引用,而在第二个例子中,你借助于外部函数的帮助,用一个实际值代替了引用。这大概就是所谓的闭包,因为你在函数中 "封装 "了一个变量的当前值,而不是保留一个引用。

source: This means that on the click event js should alert the value of the addlink functions i variable. Its value will be 5 because of the for loop().
es: Esto significa que en el evento de clic js debe alertar el valor de la variable i de las funciones addlink.Su valor será 5 debido al for loop().
ja: これは、クリック イベントで js が addlink 関数 i 変数の値を警告することを意味します。for loop()のため、その値は5になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 클릭 이벤트에서 js가 addlink 함수 i 변수의 값을 경고해야 함을 의미합니다. </font><font style="vertical-align: inherit;">for loop () 때문에 값은 5입니다.</font></font>
ru: Это означает,что при наступлении события клика js должен предупредить о значении переменной addlink functions i.Ее значение будет 5 из-за функции for loop().
zh_cn: 这意味着,在点击事件上js应该提示addlink函数i变量的值。其值将为5,因为for循环()。

source: This means: if called with a value, return me a function that will alert the input value. E.g. calling <code>function(3)</code> will return <code>function() { alert(3) };</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto significa: si se llama con un valor, devu&eacute;lvame una funci&oacute;n que alertar&aacute; al valor de entrada. </font><font style="vertical-align: inherit;">Por ejemplo, la </font></font> <code>function(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> llamada </font><font style="vertical-align: inherit;">(3)</font><font style="vertical-align: inherit;"> devolver&aacute; la </font></font> <code>function() { alert(3) };</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、値を指定して呼び出された場合、入力値を通知する関数を返します。</font><font style="vertical-align: inherit;">たとえば、</font></font> <code>function(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">呼び出すと、</font><font style="vertical-align: inherit;">function（</font></font> <code>function() { alert(3) };</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が返され</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의미 : 값으로 호출하면 입력 값을 알려주는 함수를 반환하십시오. </font><font style="vertical-align: inherit;">예를 들어 </font></font> <code>function(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 </font><font style="vertical-align: inherit;">하면 </font></font> <code>function() { alert(3) };</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это означает: если вызывается со значением, верните мне функцию, которая оповестит входное значение. </font><font style="vertical-align: inherit;">Например, вызов </font></font> <code>function(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет </font></font> <code>function() { alert(3) };</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">,</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这意味着：如果使用一个值调用，请给我返回一个将警告输入值的函数。</font><font style="vertical-align: inherit;">例如，调用</font></font> <code>function(3)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将返回</font></font> <code>function() { alert(3) };</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
