Repository: rueisnom/feedback
Catalog: xlf/14/51/00/9/1451009.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664">Quoting myself</a> for an explanation of the first example:
es: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Citando a m&iacute; mismo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para una explicaci&oacute;n del primer ejemplo:</font></font>
ja: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初の例の説明のために</font><font style="vertical-align: inherit;">自分</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">引用する</font><font style="vertical-align: inherit;">：</font></font>
ko: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 예에 대한 설명을 위해 </font><font style="vertical-align: inherit;">나 자신</font><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">인용</font><font style="vertical-align: inherit;"> :</font></font>
ru: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Цитирую себя</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для объяснения первого примера:</font></font>
zh_cn: <a href="https://stackoverflow.com/questions/643542/doesnt-javascript-support-closures-with-local-variables/643664#643664"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用我自己</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来解释第一个示例：</font></font>

source: After the loop terminates, the function-level variable i has the value 5, and that's what the inner function 'sees'.
es: Después de que el bucle termina,la variable de nivel de función i tiene el valor 5,y eso es lo que la función interna "ve".
ja: ループが終了した後、関数レベルの変数 i は値 5 を持ち、これが内部の関数が「見ている」ものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프가 종료 된 후 함수 레벨 변수 i의 값은 5이며 내부 함수가 '보는'것입니다.</font></font>
ru: После завершения цикла переменная уровня функции i имеет значение 5,и именно это видит внутренняя функция.
zh_cn: 循环终止后,函数级变量i的值为5,这就是内部函数 "看到 "的东西。

source: Basically the poor mans let-binding.
es: Básicamente,los pobres dejaron de atar.
ja: 基本的には貧乏人のレット縛り。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 가난한 사람은 구속력이 있습니다.</font></font>
ru: В основном,бедняки разрешают связывать.
zh_cn: 基本上是穷人的放任束缚。

source: Basically, in the first example you're binding the <code>i</code> inside the <code>onclick</code> handler directly to the <code>i</code> outside the <code>onclick</code> handler. So when the <code>i</code> outside the <code>onclick</code> handler changes, the <code>i</code> inside the <code>onclick</code> handler changes too.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B&aacute;sicamente, en el primer ejemplo, est&aacute; vinculando la </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro del </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directamente a la </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> fuera del </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Entonces, cuando la </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> fuera del </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cambia, la </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro del </font><font style="vertical-align: inherit;">controlador </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n cambia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的には、最初の例では、結合している</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の内側</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に直接ハンドラを</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の外</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ハンドラ。したがって</font><font style="vertical-align: inherit;">、</font> <code>onclick</code> <font style="vertical-align: inherit;">ハンドラーの</font><font style="vertical-align: inherit;">外側</font><font style="vertical-align: inherit;">の</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が変更されると</font><font style="vertical-align: inherit;">、</font> <code>onclick</code> <font style="vertical-align: inherit;">ハンドラーの</font><font style="vertical-align: inherit;">内側の</font> <code>i</code> <font style="vertical-align: inherit;">も変更されます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로, 첫 번째 예제에서 당신은 바인딩하고 </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내부 </font></font> <code>onclick</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 받는 직접 핸들러를 </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 외부 </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 핸들러입니다. 따라서 </font> <code>onclick</code> <font style="vertical-align: inherit;"> 핸들러 </font><font style="vertical-align: inherit;">외부 </font><font style="vertical-align: inherit;">의 </font></font> <code>i</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 변경되면 </font> <code>onclick</code> <font style="vertical-align: inherit;"> 핸들러 </font><font style="vertical-align: inherit;">내부의 </font> <code>i</code> <font style="vertical-align: inherit;"> 도 변경됩니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">По сути, в первом примере вы связываете </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри </font><font style="vertical-align: inherit;">обработчика </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> непосредственно с </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вне </font><font style="vertical-align: inherit;">обработчика </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Поэтому, когда </font><font style="vertical-align: inherit;">изменяется </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вне </font><font style="vertical-align: inherit;">обработчика </font></font> <code>onclick</code> ,также<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> изменяется </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри </font><font style="vertical-align: inherit;">обработчика </font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本上，在第一个例子，你要绑定的</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">里面</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接处理给</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外面</font></font> <code>onclick</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">处理程序。因此，当</font> <code>onclick</code> <font style="vertical-align: inherit;">处理程序</font><font style="vertical-align: inherit;">外部</font><font style="vertical-align: inherit;">的</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更改时，</font> <code>onclick</code> <font style="vertical-align: inherit;">处理程序</font><font style="vertical-align: inherit;">内部的</font> <code>i</code> <font style="vertical-align: inherit;">也更改。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: But how it works and How <strong>closure</strong> makes it work are all beyond my understanding. Why the first one doesn't work while the second one works? Can anyone give a detailed explanation about the magic?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero c&oacute;mo funciona y c&oacute;mo el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cierre</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace que funcione est&aacute;n m&aacute;s all&aacute; de mi comprensi&oacute;n. </font><font style="vertical-align: inherit;">&iquest;Por qu&eacute; el primero no funciona mientras que el segundo funciona? </font><font style="vertical-align: inherit;">&iquest;Alguien puede dar una explicaci&oacute;n detallada sobre la magia?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、それがどのように機能するか、およびどのように</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クロージャー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がそれ</font><font style="vertical-align: inherit;">を機能</font><strong><font style="vertical-align: inherit;">さ</font></strong><font style="vertical-align: inherit;">せるかは、私の理解を超えています。</font><font style="vertical-align: inherit;">最初のものが機能しないのになぜ最初のものが機能しないのですか？</font><font style="vertical-align: inherit;">誰もが魔法について詳細な説明をすることができますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 그것이 어떻게 작동하고 어떻게 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">닫히는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가는 내가 이해하는 것 이상입니다. </font><font style="vertical-align: inherit;">왜 첫 번째는 작동하지 않고 두 번째는 작동하지 않습니까? </font><font style="vertical-align: inherit;">마법에 대한 자세한 설명을 할 수있는 사람이 있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но как это работает и как </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">закрытие</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заставляет его работать - все это за пределами моего понимания. </font><font style="vertical-align: inherit;">Почему первый не работает, а второй работает? </font><font style="vertical-align: inherit;">Кто-нибудь может дать подробное объяснение о магии?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是它是如何工作的以及</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关闭</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font><font style="vertical-align: inherit;">如何</font><font style="vertical-align: inherit;">工作的，这些都是我无法理解的。</font><font style="vertical-align: inherit;">为什么第一个不起作用而第二个却起作用？</font><font style="vertical-align: inherit;">任何人都可以对魔术进行详细说明吗？</font></font>

source: But really addressing the problem (and building this up slowly) ...
es: Pero realmente abordando el problema (y construyendo esto lentamente)...
ja: しかし、本当に問題に取り組む(そして、これをゆっくりと積み上げていく)・・・。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 실제로 문제를 해결하고 천천히 구축합니다 ...</font></font>
ru: Но на самом деле решение проблемы (и медленное наращивание этого)...
zh_cn: 但真正解决这个问题(并慢慢建立起来).....。

source: But the following codes snippet works as our expectation.
es: Pero el siguiente fragmento de código funciona como nuestra expectativa.
ja: しかし、以下のコードスニペットは期待通りに動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 다음 코드는 예상대로 작동합니다.</font></font>
ru: Но следующий фрагмент кода работает,как мы и ожидали.
zh_cn: 但是,下面的代码片段却如我们所期望的那样,可以正常工作。

source: I like to write simple explanations for thick people, because I'm thick so here goes ...
es: Me gusta escribir explicaciones simples para la gente gruesa,porque soy grueso,así que aquí va...
ja: 私は太いので太い人向けの簡単な説明を書くのが好きなので、ここで ...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 두꺼운 사람들을 위해 간단한 설명을 작성하고 싶습니다.</font></font>
ru: Я люблю писать простые объяснения для толстых людей,потому что я толстый,так что вот...
zh_cn: 我喜欢写一些简单的解说词,因为我很厚的人,因为我很厚,所以在这里......

source: I've got the following code snippet.
es: Tengo el siguiente fragmento de código.
ja: 以下のようなコードスニペットを持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 코드 스 니펫이 있습니다.</font></font>
ru: У меня есть следующий фрагмент кода.
zh_cn: 我有以下代码片段。

source: If you can't get your head around that then this should be easier to understand and has the same effect ...
es: Si no puedes entender eso,entonces esto debería ser más fácil de entender y tiene el mismo efecto...
ja: あなたはその周りにあなたの頭を得ることができない場合は、これは理解しやすく、同じ効果を持っている必要があります...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 그 주위에 머리를 얻을 수 없다면, 이것은 이해하기 쉽고 동일한 효과를 가져야합니다 ...</font></font>
ru: Если ты не можешь об этом думать,то это должно быть легче понять и иметь тот же эффект...
zh_cn: 如果你无法理解,那么这个应该比较容易理解,而且效果也是一样的。

source: In the first example, you simply bind this function to the onclick event:
es: En el primer ejemplo,simplemente se vincula esta función al evento onclick:
ja: 最初の例では、この関数を onclick イベントにバインドします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 예에서는이 함수를 onclick 이벤트에 바인딩하면됩니다.</font></font>
ru: В первом примере,вы просто привязываете эту функцию к событию клика:
zh_cn: 在第一个例子中,你只需将此函数绑定到onclick事件中。

source: In the second example you generate a function to be bound with another function:
es: En el segundo ejemplo se genera una función para ser unida a otra función:
ja: 2 番目の例では、別の関数にバインドする関数を生成します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 예에서는 다른 함수와 바인딩 할 함수를 생성합니다.</font></font>
ru: Во втором примере вы генерируете функцию,которая будет связана с другой функцией:
zh_cn: 在第二个例子中,你生成一个函数与另一个函数绑定。

source: In the second example, for each iteration step the outer function literal will evaluate to a new function object with its own scope and local variable <code>num</code>, whose value is set to the current value of <code>i</code>. As <code>num</code> is never modified, it will stay constant over the lifetime of the closure: The next iteration step doesn't overwrite the old value as the function objects are independant.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el segundo ejemplo, para cada paso de iteraci&oacute;n, el literal de funci&oacute;n externa evaluar&aacute; a un nuevo objeto de funci&oacute;n con su propio alcance y variable local </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , cuyo valor se establece en el valor actual de </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Como </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> nunca se modifica, se mantendr&aacute; constante durante la vida &uacute;til del cierre: el siguiente paso de iteraci&oacute;n no sobrescribe el valor anterior ya que los objetos de funci&oacute;n son independientes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2番目の例では、各反復ステップで、外部関数リテラルは独自のスコープとローカル変数</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を持つ新しい関数オブジェクトに評価され</font><font style="vertical-align: inherit;">、その値は</font></font> <code>i</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在の値に設定され</font><font style="vertical-align: inherit;">ます。</font></font> <code>num</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">変更されることはありません、それは閉鎖の寿命にわたって一定のままです：関数オブジェクトが独立しているとして、次の反復ステップは、古い値を上書きしません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째 예에서, 각 반복 단계에 대해 외부 함수 리터럴은 자체 범위와 로컬 변수 </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 가진 새 함수 오브젝트로 평가되며 </font><font style="vertical-align: inherit;">, 값은 현재 값 </font></font> <code>i</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">으로 </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수정되지 않습니다, 그것은 폐쇄의 수명 기간 동안 일정하게 유지됩니다 : 함수 객체가 독립적이기 때문에 다음 반복 단계는 이전 값을 덮어 쓰지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Во втором примере для каждого шага итерации литерал внешней функции будет оцениваться как новый объект функции со своей собственной областью действия и локальной переменной </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , значение которой установлено на текущее значение </font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Поскольку </font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> никогда не изменяется, он будет оставаться постоянным в течение всего времени закрытия: следующий шаг итерации не перезаписывает старое значение, так как объекты функции независимы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在第二个示例中，对于每个迭代步骤，外部函数文字将评估为具有自己的作用域和局部变量</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的新函数对象，该变量</font><font style="vertical-align: inherit;">的值设置为</font></font> <code>i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的当前值</font><font style="vertical-align: inherit;">。由于</font></font> <code>num</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从未被修改，因此它将在闭包的整个生命周期内保持不变：由于函数对象是独立的，因此下一迭代步骤不会覆盖旧值。</font></font>
