Repository: rueisnom/feedback
Catalog: xlf/61/21/2/61212.*.001.xlf
Languages: ko, ru, zh_cn

source: I like to use <code>git stash</code> command, later you can get stashed files and changes. <code>git clean</code> is also a good option but totally depends on your requirement. here is the explanation of git stash and git clean,<a href="https://git-scm.com/book/en/v2/Git-Tools-Stashing-and-Cleaning">7.3 Git Tools - Stashing and Cleaning</a>
ko: <code>git stash</code> 명령을 사용하고 나중에 숨김 파일과 변경 사항을 얻을 수 있습니다. <code>git clean</code> 도 좋은 옵션이지만 전적으로 요구 사항에 따라 다릅니다. 다음은 git stash 및 git clean에 대한 설명입니다. <a href="https://git-scm.com/book/en/v2/Git-Tools-Stashing-and-Cleaning">7.3 Git Tools-Stashing and Cleaning</a>
ru: Мне нравится использовать команду <code>git stash</code> , позже вы можете получить спрятанные файлы и изменения. <code>git clean</code> также хороший вариант, но полностью зависит от ваших требований. Вот объяснение git stash и git clean, <a href="https://git-scm.com/book/en/v2/Git-Tools-Stashing-and-Cleaning">7.3 Git Tools - Копирование и очистка</a>
zh_cn: 我喜欢使用 <code>git stash</code> 命令，以后可以获取隐藏文件和更改。 <code>git clean</code> 也是一个不错的选择，但完全取决于您的要求。 这是git stash和git clean的说明， <a href="https://git-scm.com/book/en/v2/Git-Tools-Stashing-and-Cleaning">7.3 Git工具-隐藏和清洁</a>

source: I prefer this to 'git clean' because 'git clean' will delete files ignored by git, so your next build will have to rebuild everything and you may lose your IDE settings too.
ko: 'git clean'은 git에서 무시되는 파일을 삭제하므로 다음 빌드에서는 모든 것을 다시 빌드해야하므로 IDE 설정도 손실 될 수 있기 때문에 이것을 'git clean'보다 선호합니다.
ru: Я предпочитаю это,а не 'git clean',потому что 'git clean' удалит файлы,проигнорированные git'ом,так что вашей следующей сборке придётся пересобирать всё,и вы тоже можете потерять настройки IDE.
zh_cn: 与其说是 "git clean",不如说是 "git clean",因为 "git clean "会删除被git忽略的文件,所以你的下一次构建将不得不重新构建一切,而且你可能会失去你的IDE设置。

source: If <code>clean.requireForce</code> is set to "true" (the default) in your configuration, one needs to specify <code>-f</code> otherwise nothing will actually happen.
ko: 구성에서 <code>clean.requireForce</code> 가 "true"(기본값)로 설정되어 있으면 <code>-f</code> 를 지정해야합니다. 그렇지 않으면 실제로 아무 것도 발생하지 않습니다.
ru: Если в вашей конфигурации <code>clean.requireForce</code> имеет значение &laquo;true&raquo; (по умолчанию), необходимо указать <code>-f</code> , иначе ничего не произойдет.
zh_cn: 如果您在配置 <code>clean.requireForce</code> 设置为&ldquo; true&rdquo;（默认设置），则需要指定 <code>-f</code> ,否则实际上不会发生任何事情。

source: If any optional <code>&lt;path&gt;...</code> arguments are given, only those paths are affected.
ko: 선택적 <code>&lt;path&gt;...</code> 인수가 제공되면 해당 경로 만 영향을받습니다.
ru: Если заданы необязательные аргументы <code>&lt;path&gt;...</code> , затрагиваются только эти пути.
zh_cn: 如果给出任何可选的 <code>&lt;path&gt;...</code> 参数，则仅影响那些路径。

source: If file wasn't ignored and not yet checked-in then it stays. Note the capital X.
ko: 파일이 무시되지 않고 아직 체크인되지 않은 경우 그대로 유지됩니다. 대문자 X를 주목하십시오.
ru: Если файл не был проигнорирован и еще не зарегистрирован,то он остается.Обратите внимание на заглавную букву X.
zh_cn: 如果文件没有被忽略,还没有签到,那么它就会保留。请注意大写的X。

source: If needed to remove untracked files from particular subdirectory,
ko: 특정 하위 디렉토리에서 추적되지 않은 파일을 제거해야하는 경우
ru: При необходимости удалить неотслеживаемые файлы из определенного подкаталога,
zh_cn: 如果需要从特定的子目录中删除未被跟踪的文件。

source: If the Git configuration variable clean.requireForce is not set to false, git clean will refuse to run unless given <code>-f</code>, <code>-n</code> or <code>-i</code>.
ko: Git 구성 변수 clean.requireForce가 false로 설정되지 않은 경우, <code>-f</code> , <code>-n</code> 또는 <code>-i</code> 를 지정하지 않으면 git clean은 실행을 거부합니다.
ru: Если для переменной конфигурации Git clean.requireForce не задано значение false, git clean откажется запускаться, если не указано <code>-f</code> , <code>-n</code> или <code>-i</code> .
zh_cn: 如果Git配置变量clean.requireForce未设置为false，除非给定 <code>-f</code> ， <code>-n</code> 或 <code>-i</code> ，否则git clean将拒绝运行。

source: If the Git configuration variable clean.requireForce is not set to false, git clean will refuse to run unless given -f, -n or -i.
ko: Git 구성 변수 clean.requireForce가 false로 설정되지 않은 경우, -f, -n 또는 -i를 지정하지 않으면 git clean은 실행을 거부합니다.
ru: Если переменная конфигурации Git'а clean.requireForce не установлена в false,то git clean откажется запускаться,если не заданы -f,-n или -i.
zh_cn: 如果 Git 配置变量 clean.requireForce 未设置为 false,则 git clean 将拒绝运行,除非给出 -f、-n 或 -i。

source: If untracked directory is a git repository of its own (e.g. submodule), you need to use <code>-f</code> twice:
ko: 추적되지 않은 디렉토리가 자체 (예 : 서브 모듈)의 git 저장소 인 경우 <code>-f</code> 를 두 번 사용해야합니다.
ru: Если неотслеживаемый каталог является собственным репозиторием git (например, подмодулем), вам нужно дважды использовать <code>-f</code> :
zh_cn: 如果未跟踪的目录是它自己的git存储库（例如，子模块），则需要两次使用 <code>-f</code> ：

source: If you are not 100% sure that deleting your uncommitted work is safe, you could use stashing instead
ko: 커밋되지 않은 작업을 안전하게 삭제하는 것이 100 % 확실하지 않은 경우 대신 숨김을 사용할 수 있습니다
ru: Если вы не уверены на 100% в том,что удаление вашей незанятой работы безопасно,вы можете использовать тайник вместо этого
zh_cn: 如果你不能百分之百确定删除未提交的工作是安全的,你可以用存储来代替。

source: If you just want to delete the files listed as untracked by 'git status'
ko: 'git status'에 의해 추적되지 않은 것으로 나열된 파일을 삭제하려는 경우
ru: Если вы просто хотите удалить файлы,перечисленные как неотслеживаемые в 'git-статусе'.
zh_cn: 如果你只是想删除通过 "git状态 "列出的未跟踪的文件

source: If you not sure and want to check things first, add <code>-n</code> flag.
ko: 확실하지 않은 사항을 먼저 확인하려면 <code>-n</code> 플래그를 추가하십시오.
ru: Если вы не уверены и хотите сначала проверить, добавьте флаг <code>-n</code> .
zh_cn: 如果不确定并想先检查一下，请添加 <code>-n</code> 标志。

source: If you want to <strong>delete</strong>(directories) and files, you can delete only untracked directories and files like this:
ko: (디렉토리) 및 파일을 <strong>삭제</strong> 하려는 경우 다음과 같이 추적되지 않은 디렉토리 및 파일 만 삭제할 수 있습니다.
ru: Если вы хотите <strong>удалить</strong> (каталоги) и файлы, вы можете удалить только неотслеживаемые каталоги и файлы, например:
zh_cn: 如果要<strong>删除</strong> （目录）和文件，则只能删除未跟踪的目录和文件，如下所示：

source: In addition to those found in .gitignore (per directory) and $GIT_DIR/info/exclude, also consider these patterns to be in the set of the ignore rules in effect.
ko: .gitignore (디렉토리 당) 및 $ GIT_DIR / info / exclude에있는 것 외에도 이러한 패턴이 무시 규칙 세트에있는 것으로 간주하십시오.
ru: В дополнение к тем,что найдены в .gitignore (для каждого каталога)и $GIT_DIRinfoexclude,также считаем эти паттерны в наборе действующих правил игнорирования.
zh_cn: 除了在.gitignore(每个目录)和$GIT_DIRinfoexclude中发现的那些模式外,还可以认为这些模式是在有效的忽略规则集中。

source: In all other cases, I was getting message <em>"Skipping Directory"</em> for some subdirectories.
ko: 다른 모든 경우에는 일부 하위 디렉토리에 대해 <em>"Skipping Directory"</em> 메시지가 표시되었습니다.
ru: Во всех остальных случаях я получал сообщение <em>&laquo;Пропуск каталога&raquo;</em> для некоторых подкаталогов.
zh_cn: 在其他所有情况下，我都收到一些子目录的<em>&ldquo;跳过目录&rdquo;</em>消息。

source: It will also clear your directory but give you flexibility to retrieve the files at any point in time using <strong>stash</strong> with <strong>apply</strong> or <strong>pop</strong>. Then at later point you could clear your stash using:
ko: 또한 디렉토리를 지우지 만 <strong>stash</strong> with <strong>apply</strong> 또는 <strong>pop을</strong> 사용하여 언제든지 파일을 검색 할 수있는 유연성을 제공합니다. 그런 다음 나중에 다음을 사용하여 숨김을 지울 수 있습니다.
ru: Это также очистит ваш каталог, но даст вам возможность извлекать файлы в любой момент времени, используя <strong>stash</strong> с <strong>apply</strong> или <strong>pop</strong> . Затем на более позднем этапе вы можете очистить свой тайник, используя:
zh_cn: 它还会清除您的目录，但可以让您灵活地在任何时候使用带有<strong>apply</strong>或<strong>pop的</strong> <strong>stash</strong>来检索文件。 然后，您可以在以后使用以下方法清除存储：

source: It will output something like:
ko: 다음과 같이 출력됩니다.
ru: Это выведет что-то вроде:
zh_cn: 它将输出类似于:

source: Normal <code>git clean</code> command doesn't remove untracked files with my <code>git version 2.9.0.windows.1</code>.
ko: 일반 <code>git clean</code> 명령은 내 <code>git version 2.9.0.windows.1</code> 추적되지 않은 파일을 제거하지 않습니다.
ru: Обычная команда <code>git clean</code> не удаляет неотслеживаемые файлы с моей <code>git version 2.9.0.windows.1</code> .
zh_cn: 普通的 <code>git clean</code> 命令不会删除我的 <code>git version 2.9.0.windows.1</code> 未跟踪文件。

source: Normally, only files unknown to Git are removed, but if the <code>-x</code> option is specified, ignored files are also removed. This can, for example, be useful to remove all build products.
ko: 일반적으로 Git에 알려지지 않은 파일 만 제거되지만 <code>-x</code> 옵션을 지정하면 무시 된 파일도 제거됩니다. 예를 들어 모든 빌드 제품을 제거하는 데 유용 할 수 있습니다.
ru: Обычно удаляются только файлы, неизвестные Git, но если указана опция <code>-x</code> , игнорируемые файлы также удаляются. Это может быть полезно, например, для удаления всех продуктов сборки.
zh_cn: 通常，仅删除Git未知的文件，但如果指定 <code>-x</code> 选项，也会删除忽略的文件。 例如，这对于删除所有构建产品很有用。

source: Remove only files ignored by Git. This may be useful to rebuild everything from scratch, but keep manually created files.
ko: Git이 무시한 파일 만 제거하십시오. 이것은 처음부터 모든 것을 다시 작성하지만 수동으로 생성 된 파일을 유지하는 데 유용 할 수 있습니다.
ru: Удаляйте только файлы,проигнорированные Git'ом.Это может быть полезно для восстановления всего с нуля,но сохраняйте файлы,созданные вручную.
zh_cn: 只删除被Git忽略的文件。这对于从头开始重建一切可能有用,但保留手动创建的文件。

source: Remove untracked directories in addition to untracked files. If an untracked directory is managed by a different Git repository, it is not removed by default. Use <code>-f</code> option twice if you really want to remove such a directory.
ko: 추적되지 않은 파일 외에 추적되지 않은 디렉토리를 제거하십시오. 추적되지 않은 디렉토리가 다른 Git 리포지토리에 의해 관리되는 경우 기본적으로 제거되지 않습니다. 그러한 디렉토리를 실제로 제거하려면 <code>-f</code> 옵션을 두 번 사용하십시오.
ru: Удалите неотслеживаемые каталоги в дополнение к неотслеживаемым файлам. Если неотслеживаемый каталог управляется другим Git-репозиторием, по умолчанию он не удаляется. Используйте параметр <code>-f</code> дважды, если вы действительно хотите удалить такой каталог.
zh_cn: 除未跟踪的文件外，还删除未跟踪的目录。 如果未跟踪的目录由其他Git存储库管理，则默认情况下不会将其删除。 如果您确实要删除这样的目录，请使用 <code>-f</code> 选项两次。

source: Remove untracked directories in addition to untracked files. If an untracked directory is managed by a different Git repository, it is not removed by default. Use -f option twice if you really want to remove such a directory.
ko: 추적되지 않은 파일 외에 추적되지 않은 디렉토리를 제거하십시오. 추적되지 않은 디렉토리가 다른 Git 리포지토리에 의해 관리되는 경우 기본적으로 제거되지 않습니다. 그러한 디렉토리를 실제로 제거하려면 -f 옵션을 두 번 사용하십시오.
ru: Удалите неисправленные каталоги в дополнение к неисправленным файлам.Если неотслеживаемый каталог управляется другим репозиторием Git'а,то по умолчанию он не удаляется.Используйте опцию -f дважды,если вы действительно хотите удалить такой каталог.
zh_cn: 除了未跟踪的文件外,还可以删除未跟踪的目录。如果一个未被跟踪的目录是由不同的 Git 仓库管理的,那么默认情况下不会被删除。如果真的要删除这样的目录,请使用 -f 选项两次。

source: Reset local repository branch to be just like remote repository HEAD
ko: 로컬 저장소 분기를 원격 저장소 HEAD와 동일하게 재설정
ru: Сбросить локальную ветку репозитория,чтобы она была похожа на удаленный репозиторий HEAD
zh_cn: 重置本地存储库分支,使其与远程存储库的HEAD一样。

source: Show what would be done and clean files interactively. See &ldquo;Interactive mode&rdquo; for details.
ko: 수행 할 작업을 표시하고 파일을 대화식으로 정리하십시오. 자세한 내용은&ldquo;대화식 모드&rdquo;를 참조하십시오.
ru: Покажите, что будет сделано, и очистите файлы в интерактивном режиме. Подробнее см. &laquo;Интерактивный режим&raquo;.
zh_cn: 显示将要执行的操作并以交互方式清理文件。 有关详细信息，请参见&ldquo;交互模式&rdquo;。

source: Simple Way to remove untracked files
ko: 추적되지 않은 파일을 제거하는 간단한 방법
ru: Простой способ удаления неотслеживаемых файлов
zh_cn: 移除未被追踪的文件的简单方法

source: So, if you want to delete files only, you can use <code>-f</code> only:
ko: 따라서 파일 만 삭제하려면 <code>-f</code> 만 사용할 수 있습니다.
ru: Итак, если вы хотите удалить только файлы, вы можете использовать только <code>-f</code> :
zh_cn: 因此，如果只想删除文件，则只能使用 <code>-f</code> ：

source: Step 1 is to show what will be deleted by using the <code>-n</code> option:
ko: 1 단계는 <code>-n</code> 옵션을 사용하여 삭제할 내용을 표시하는 것입니다.
ru: Шаг 1 - показать, что будет удалено с помощью опции <code>-n</code> :
zh_cn: 步骤1是显示使用 <code>-n</code> 选项删除的内容：

source: That being said, the extra hand holding of interactive commands can be tiring for experienced users. These days I just use the already mentioned <code>git clean -fd</code>
ko: 즉, 대화식 명령을 추가로 손에 들고 있으면 숙련 된 사용자가 지칠 수 있습니다. 요즘 나는 이미 언급 한 <code>git clean -fd</code> 를 사용합니다.
ru: Это сказанное, дополнительное удерживание руки интерактивных команд может быть утомительным для опытных пользователей. В эти дни я просто использую уже упомянутый <code>git clean -fd</code>
zh_cn: 话虽如此，交互式命令的额外手握可能会使有经验的用户感到厌烦。 这些天我只用已经提到过的 <code>git clean -fd</code>

source: That stands for <em>interactive</em> and you will get a quick overview of what is going to be deleted offering you the possibility to include/exclude the affected files. Overall, still faster than running the mandatory <code>--dry-run</code> before the real cleaning.
ko: 이는 <em>대화식을</em> 나타내며 영향을받는 파일을 포함 / 제외 할 수있는 가능성을 제공하여 삭제 될 대상에 대한 빠른 개요를 제공합니다. 전체적으로 실제 청소 전에 강제 <code>--dry-run</code> 를 실행하는 것보다 여전히 빠릅니다.
ru: Это означает <em>интерактивный,</em> и вы получите быстрый обзор того, что будет удалено, предлагая вам возможность включить / исключить затронутые файлы. В целом, все еще быстрее, чем запуск обязательного <code>--dry-run</code> перед реальной уборкой.
zh_cn: 这表示<em>交互式</em> ，您将快速了解要删除的内容，从而可以包含/排除受影响的文件。 总体而言，仍比真正清洁之前运行强制性 <code>--dry-run</code> 更快。

source: The following command will clean out the current git repository and all its submodules recursively:
ko: 다음 명령은 현재 자식 저장소와 모든 하위 모듈을 재귀 적으로 정리합니다.
ru: Следующая команда очистит текущий git-репозиторий и все его субмодули рекурсивно:
zh_cn: 下面的命令将递归地清理出当前git仓库及其所有子模块。

source: There are other flags as well available, just check <code>git clean --help</code>.
ko: 사용 가능한 다른 플래그도 있습니다 <code>git clean --help</code> 확인하십시오.
ru: Также доступны другие флаги, просто проверьте <code>git clean --help</code> .
zh_cn: 还有其他可用的标志，只需检查 <code>git clean --help</code> 即可 。

source: There is also interactive mode available <code>-i</code> with the clean command
ko: clean 명령으로 대화식 모드를 사용할 수 있습니다 <code>-i</code>
ru: Также доступен интерактивный режим <code>-i</code> с командой clean
zh_cn: 还有带clean命令的交互式模式 <code>-i</code>

source: This gets you in same state as fresh clone.
ko: 그러면 새로운 클론과 동일한 상태가됩니다.
ru: Это приведет тебя в то же состояние,что и свежий клон.
zh_cn: 这让你的状态和新鲜的克隆人一样。

source: This is what I always use:
ko: 이것이 내가 항상 사용하는 것입니다.
ru: Это то,что я всегда использую:
zh_cn: 这是我经常使用的方法。

source: This removes untracked files, including directories <code>(-d)</code> and files ignored by <code>git (-x)</code>.
ko: 이렇게하면 디렉토리 <code>(-d)</code> 와 <code>git (-x)</code> 에 의해 무시 된 파일을 포함하여 추적되지 않은 파일이 제거됩니다.
ru: Это удаляет неотслеживаемые файлы, включая каталоги <code>(-d)</code> и файлы, игнорируемые <code>git (-x)</code> .
zh_cn: 这将删除未跟踪的文件，包括目录 <code>(-d)</code> 和 <code>git (-x)</code> 忽略的文件。

source: This will show you the list of files that will be deleted. Now to actually delete those files use this command:
ko: 삭제 될 파일 목록이 표시됩니다. 이제 해당 파일을 실제로 삭제하려면 다음 명령을 사용하십시오.
ru: Здесь будет показан список файлов,которые будут удалены.Теперь для фактического удаления этих файлов используйте эту команду:
zh_cn: 这将显示要删除的文件列表。现在要实际删除这些文件,请使用这个命令。

source: To delete everything listed in the output of the previous command:
ko: 이전 명령의 출력에 나열된 모든 항목을 삭제하려면 다음을 수행하십시오.
ru: Удалить все перечисленное в выводе предыдущей команды:
zh_cn: 要删除上一条命令输出中列出的所有内容。

source: To know what will be deleted before actually deleting:
ko: 실제로 삭제하기 전에 삭제 될 내용을 알려면 :
ru: Узнать,что будет удалено перед фактическим удалением:
zh_cn: 在实际删除之前,要知道要删除的内容。

source: To remove all untracked files, The simple way is to <strong>add all of them first</strong> and <strong>reset the repo</strong> as below
ko: 추적되지 않은 모든 파일을 제거하려면 간단한 방법은 <strong>먼저 모든</strong> 파일을 <strong>추가</strong> 하고 아래와 같이 <strong>저장소</strong> 를 <strong>재설정하는</strong> 것입니다.
ru: Чтобы удалить все неотслеживаемые файлы, простой способ - <strong>сначала добавить их все</strong> и <strong>сбросить</strong> репозиторий, как показано ниже.
zh_cn: 要删除所有未跟踪的文件，最简单的方法是先<strong>添加</strong>所有未跟踪文件，然后按如下所示<strong>重置存储库</strong>

source: To remove directories, run <code>git clean -f -d</code> or <code>git clean -fd</code>
ko: 디렉토리를 제거하려면 <code>git clean -f -d</code> 또는 <code>git clean -fd</code> 를 실행하십시오.
ru: Чтобы удалить каталоги, запустите <code>git clean -f -d</code> или <code>git clean -fd</code>
zh_cn: 要删除目录，请运行 <code>git clean -f -d</code> 或 <code>git clean -fd</code>

source: To remove ignored and non-ignored files, run <code>git clean -f -x</code> or <code>git clean -fx</code>
ko: 무시되고 무시되지 않은 파일을 제거하려면 <code>git clean -f -x</code> 또는 <code>git clean -fx</code> 를 실행하십시오.
ru: Чтобы удалить проигнорированные и не проигнорированные файлы, запустите <code>git clean -f -x</code> или <code>git clean -fx</code>
zh_cn: 要删除被忽略和未被忽略的文件，请运行 <code>git clean -f -x</code> 或 <code>git clean -fx</code>

source: To remove ignored files, run <code>git clean -f -X</code> or <code>git clean -fX</code>
ko: 무시 된 파일을 제거하려면 <code>git clean -f -X</code> 또는 <code>git clean -fX</code> 를 실행하십시오.
ru: Чтобы удалить проигнорированные файлы, запустите <code>git clean -f -X</code> или <code>git clean -fX</code>
zh_cn: 要删除忽略的文件，请运行 <code>git clean -f -X</code> 或 <code>git clean -fX</code>

source: To remove the untracked files you should first use command to view the files that will be affected by cleaning
ko: 추적되지 않은 파일을 제거하려면 먼저 명령을 사용하여 치료에 의해 영향을받을 파일을 확인해야합니다
ru: Чтобы удалить неотслеживаемые файлы,вы должны сначала использовать команду просмотра файлов,которые будут затронуты очисткой
zh_cn: 要删除未被跟踪的文件,你应该首先使用命令查看将受清理影响的文件。

source: Use <code>-q</code> if you don't want to see any report after successful deletion.
ko: 삭제 후 보고서를 보지 않으려면 <code>-q</code> 를 사용하십시오.
ru: Используйте <code>-q</code> , если вы не хотите видеть какой-либо отчет после успешного удаления.
zh_cn: 如果您不想在成功删除后看到任何报告，请使用 <code>-q</code> 。

source: Use <code>git clean -f -d</code> to make sure that <strong>directories</strong> are also removed.
ko: <code>git clean -f -d</code> 를 사용하여 <strong>디렉토리</strong> 도 제거하십시오.
ru: Используйте <code>git clean -f -d</code> , чтобы убедиться, что <strong>каталоги</strong> также удалены.
zh_cn: 使用 <code>git clean -f -d</code> 确保<strong>目录</strong>也被删除。

source: We can easily removed local untracked files from the current git working tree by using below git comments.
ko: 아래의 자식 주석을 사용하여 현재 자식 작업 트리에서 추적되지 않은 로컬 파일을 쉽게 제거 할 수 있습니다.
ru: Мы можем легко удалить локальные неотслеживаемые файлы из текущего дерева работы git'а,используя нижеприведённые git-комментарии.
zh_cn: 我们可以通过使用下面的git注释,轻松地从当前git工作树中删除本地未被跟踪的文件。

source: You can then check if your files are really gone with <code>git status</code>.
ko: 그런 다음 파일이 실제로 <code>git status</code> 로 사라 졌는지 확인할 수 있습니다.
ru: Затем вы можете проверить, действительно ли ваши файлы ушли со <code>git status</code> .
zh_cn: 然后，您可以检查您的文件是否真的以 <code>git status</code> 消失了。

source: You will have to toss in a <code>-d</code> if you also want to take care of empty folders. At the end, it makes for a nice alias:
ko: 빈 폴더를 관리하려면 <code>-d</code> 를 던져야합니다. 결국, 그것은 좋은 별칭을 만듭니다 :
ru: Вам нужно будет добавить <code>-d</code> , если вы также хотите позаботиться о пустых папках. В конце концов, это дает хороший псевдоним:
zh_cn: 如果您还想处理空文件夹，则必须折腾 <code>-d</code> 。 最后，它提供了一个很好的别名：

source: after this you will have modified files only in <code>git status</code>.
ko: 그 후에는 <code>git status</code> 에서만 파일을 수정하게됩니다.
ru: после этого вы будете изменять файлы только в <code>git status</code> .
zh_cn: 之后，您将只能以 <code>git status</code> 修改文件。

source: can be used all above options in combination as
ko: 위의 모든 옵션을 다음과 같이 조합하여 사용할 수 있습니다.
ru: могут быть использованы все вышеперечисленные опции в комбинации,как
zh_cn: 可将上述所有选项组合使用为

source: check git manual for more help
ko: 도움이 더 필요하면 자식 매뉴얼을 확인하십시오.
ru: подробная справка в руководстве по ведению химии
zh_cn: 查看git手册以获得更多帮助

source: uggested Command for <strong>Removing Untracked Files from git docs</strong> is <strong>git clean</strong>
ko: <strong>git docs에서 추적되지 않은 파일</strong> 을 <strong>제거</strong> 하기위한 uggested 명령은 <strong>git clean입니다.</strong>
ru: Команда для <strong>удаления неотслеживаемых файлов из git docs</strong> - это <strong>git clean</strong>
zh_cn: <strong>从git docs删除未跟踪文件的</strong>建议命令是<strong>git clean</strong>

source: when you want to remove directories and files, this will delete only untracked directories and files
ko: 디렉토리와 파일을 제거하려면 추적되지 않은 디렉토리와 파일 만 삭제합니다
ru: когда вы хотите удалить каталоги и файлы,это удалит только необнаруженные каталоги и файлы
zh_cn: 当你想删除目录和文件时,这将只删除未被跟踪的目录和文件。

source: will remove the untracked files from the current git
ko: 현재 자식에서 추적되지 않은 파일을 제거합니다
ru: удалит неотслеживаемые файлы из текущего git'а.
zh_cn: 将删除当前git中未被跟踪的文件。

source: <strong>7. -x</strong>
ru: <strong>7.-х</strong>

source: <strong><code>-f</code>, <code>--force</code></strong>
zh_cn: <strong> <code>-f</code> ，-- force</strong>
