Repository: rueisnom/feedback
Catalog: xlf/61/21/2/61212.*.001.xlf
Languages: ko, ru, zh_cn

source: -d for directory
ko: 디렉토리의 경우 -d
ru: -d для каталога
zh_cn: 目录中的 -d

source: -f for force
ko: 강제로 -f
ru: -для силы
zh_cn: -f代表武力

source: -i for interactive
ko: 대화식의 경우 -i
ru: -i для интерактивного взаимодействия
zh_cn: 互动式的 -i

source: -x for ignored files(add if required)
ko: 무시 된 파일의 경우 -x (필요한 경우 추가)
ru: -x для игнорируемых файлов (добавлять при необходимости)
zh_cn: -x为被忽略的文件(如果需要,请添加)

source: <a href="http://www.kernel.org/pub/software/scm/git/docs/git-clean.html">git-clean</a> is what you are looking for. It is used to remove untracked files from the working tree.
ko: <a href="http://www.kernel.org/pub/software/scm/git/docs/git-clean.html">git-clean</a> 은 당신이 찾고있는 것입니다. 작업 트리에서 추적되지 않은 파일을 제거하는 데 사용됩니다.
ru: <a href="http://www.kernel.org/pub/software/scm/git/docs/git-clean.html">git-clean</a> - это то, что вы ищете. Используется для удаления неотслеживаемых файлов из рабочего дерева.
zh_cn: <a href="http://www.kernel.org/pub/software/scm/git/docs/git-clean.html">git-clean</a>是您想要的。 它用于从工作树中删除未跟踪的文件。

source: <a href="https://git-scm.com/docs/git-clean">git-clean</a> - Remove untracked files from the working tree
ko: <a href="https://git-scm.com/docs/git-clean">git-</a> clean-작업 트리에서 추적되지 않은 파일 제거
ru: <a href="https://git-scm.com/docs/git-clean">git-clean</a> - удаляет неотслеживаемые файлы из рабочего дерева
zh_cn: <a href="https://git-scm.com/docs/git-clean">git-</a> clean-从工作树中删除未跟踪的文件

source: <code>gclean</code><em>removes untracked directories in addition to untracked files</em>.
ko: <code>gclean</code> <em>은 추적되지 않은 파일 외에도 추적되지 않은 디렉토리를 제거합니다</em> .
ru: <code>gclean</code> <em>удаляет неотслеживаемые каталоги в дополнение к неотслеживаемым файлам</em> .
zh_cn: <code>gclean</code> <em>除了删除未跟踪的文件之外，</em> 还会 <em>删除未跟踪的目录</em> 。

source: <code>git clean -f -d -x $(git rev-parse --show-cdup)</code> applies clean to the root directory, no matter where you call it within a repository directory tree. I use it all the time as it does not force you to leave the folder where you working now and allows to clean &amp; commit right from the place where you are.
ko: <code>git clean -f -d -x $(git rev-parse --show-cdup)</code> 는 저장소 디렉토리 트리 내에서 호출 한 위치에 상관없이 루트 디렉토리에 정리를 적용합니다. 나는 그것이 당신이 지금 일하고있는 폴더를 떠나도록 강요하지 않기 때문에 항상 사용하고 당신이있는 곳에서 바로 정리하고 커밋 할 수 있습니다.
ru: <code>git clean -f -d -x $(git rev-parse --show-cdup)</code> применяет clean к корневому каталогу, независимо от того, где вы вызываете его в дереве каталогов репозитория. Я использую его все время, так как он не заставляет вас покидать папку, в которой вы сейчас работаете, и позволяет чистить и фиксировать прямо из того места, где вы находитесь.
zh_cn: <code>git clean -f -d -x $(git rev-parse --show-cdup)</code> 将clean应用于根目录，无论您在存储库目录树中的何处调用它。 我一直使用它，因为它不会强迫您离开您现在使用的文件夹，并且可以从您所在的位置直接进行清理和提交。

source: <code>git clean -fX</code> removes ignored files
ko: <code>git clean -fX</code> 는 무시 된 파일을 제거합니다
ru: <code>git clean -fX</code> удаляет игнорируемые файлы
zh_cn: <code>git clean -fX</code> 删除忽略的文件

source: <code>git clean -fd</code> removes directory
ko: <code>git clean -fd</code> 는 디렉토리를 제거합니다
ru: <code>git clean -fd</code> удаляет каталог
zh_cn: <code>git clean -fd</code> 删除目录

source: <code>git clean -fx</code> removes ignored and un-ignored files
ko: <code>git clean -fx</code> 는 무시되고 무시되지 않은 파일을 제거합니다.
ru: <code>git clean -fx</code> удаляет проигнорированные и не проигнорированные файлы
zh_cn: <code>git clean -fx</code> 删除被忽略和未被忽略的文件

source: <code>git-clean</code> - Remove untracked files from the working tree
ko: <code>git-clean</code> clean-작업 트리에서 추적되지 않은 파일 제거
ru: <code>git-clean</code> - удаляет неотслеживаемые файлы из рабочего дерева
zh_cn: <code>git-clean</code> clean-从工作树中删除未跟踪的文件

source: <code>gpristine</code> hard reset the local changes, remove untracked directories, untracked files and <em>don't use the standard ignore rules read from .gitignore (per directory) and $GIT_DIR/info/exclude, but do still use the ignore rules given with -e options. This allows removing all untracked files, including build products. This can be used (possibly in conjunction with git reset) to create a pristine working directory to test a clean build</em>.
ko: <code>gpristine</code> 은 로컬 변경 사항을 강제로 재설정하고, 추적 <em>되지 않은</em> 디렉토리, 추적 <em>되지 않은</em> 파일을 제거하고, <em>.gitignore (디렉토리 당) 및 $ GIT_DIR / info / exclude에서 읽은 표준 무시 규칙을 사용하지 않지만 -e 옵션으로 제공된 무시 규칙을 계속 사용합니다. .</em> <em>이를 통해 빌드 제품을 포함하여 추적되지 않은 모든 파일을 제거 할 수 있습니다.</em> <em>이것은 git reset과 함께 사용되어 깨끗한 빌드를 테스트하기 위해 깨끗한 작업 디렉토리를 만들 수</em> 있습니다.
ru: <code>gpristine</code> жестко сбрасывает локальные изменения, удаляет неотслеживаемые каталоги, неотслеживаемые файлы и <em>не использует стандартные правила игнорирования, считываемые из .gitignore (для каждого каталога) и $ GIT_DIR / info / exclude, но все же использует правила игнорирования, заданные с опциями -e ,</em> <em>Это позволяет удалить все неотслеживаемые файлы, включая продукты сборки.</em> <em>Это может быть использовано (возможно, в сочетании с git reset) для создания первичного рабочего каталога для тестирования чистой сборки</em> .
zh_cn: <code>gpristine</code> 硬重置本地更改，删除未跟踪的目录，未跟踪的文件，并且<em>不使用从.gitignore（每个目录）和$ GIT_DIR / info / exclude读取的标准忽略规则，但仍使用-e选项提供的忽略规则。</em> <em>这允许删除所有未跟踪的文件，包括构建产品。</em> <em>可以使用它（可能与git reset结合使用）创建一个原始的工作目录来测试一个干净的build</em> 。

source: <strong>3. -i, --interactive</strong>
ko: <strong>3. -i,-대화식</strong>
ru: <strong>3. -i, - интерактивный</strong>

source: <strong>4. -n, --dry-run</strong>
ko: <strong>4. -n,-건조</strong>

source: <strong><em>User interactive approach:</em></strong>
ko: <strong><em>사용자 대화식 접근 방식 :</em></strong>
ru: <strong><em>Пользовательский интерактивный подход:</em></strong>
zh_cn: <strong><em>用户互动方式：</em></strong>

source: <strong>Always use</strong><code>-n</code> before running the actual command as it will show you what files would get removed.
ko: 실제 명령을 실행하기 전에 <strong>항상</strong> <code>-n</code> 을 <strong>사용</strong> 하여 제거 할 파일을 표시하십시오.
ru: <strong>Всегда используйте</strong> <code>-n</code> перед запуском фактической команды, так как она покажет вам, какие файлы будут удалены.
zh_cn: 在运行实际命令之前，请<strong>始终使用</strong> <code>-n</code> ，因为它将显示将删除哪些文件。

source: <strong>Available Options:</strong>
ko: <strong>사용 가능한 옵션 :</strong>
ru: <strong>Доступные Варианты:</strong>
zh_cn: <strong>可用选项：</strong>

source: <strong>Beware!</strong> Be sure to <strong>commit any needed changes</strong> (even in non-untracked files) <strong>before performing this</strong>.
ko: <strong>조심해!</strong> <strong>이 작업을 수행하기 전에</strong> <strong>필요한 변경 사항</strong> (트래킹되지 않은 파일에서도)을 <strong>커밋</strong> 하십시오.
ru: <strong>Осторожно!</strong> Обязательно передайте <strong>все необходимые изменения</strong> (даже в неотслеживаемых файлах) <strong>перед выполнением этого</strong> .
zh_cn: <strong>谨防！</strong> <strong>在执行此操作之前，</strong>请确保<strong>提交所有必要的更改</strong> （即使在未跟踪的文件中）。

source: <strong>Clean out git repository and all submodules recursively</strong>
ko: <strong>자식 저장소와 모든 하위 모듈을 재귀 적으로 정리하십시오.</strong>
ru: <strong>Очистить git-репозиторий и все подмодули рекурсивно</strong>
zh_cn: <strong>递归清理git仓库和所有子模块</strong>

source: <strong>Double check</strong> before doing it as it will delete the files and folders without making any history...
ko: 기록을 만들지 않고 파일과 폴더를 삭제하므로 다시 <strong>확인하십시오</strong> ...
ru: <strong>Дважды проверьте,</strong> прежде чем делать это, поскольку он будет удалять файлы и папки, не делая истории ...
zh_cn: 在执行此操作之前， <strong>请仔细检查</strong> ，因为它会删除文件和文件夹而不会产生任何历史记录...

source: <strong>Links :</strong>
ko: <strong>연결 :</strong>
ru: <strong>Ссылки:</strong>
zh_cn: <strong>友情链接：</strong>

source: <strong>New interactive mode</strong>
ko: <strong>새로운 대화식 모드</strong>
ru: <strong>Новый интерактивный режим</strong>
zh_cn: <strong>新的互动模式</strong>

source: <strong>Note:</strong><em>Add <strong>-n</strong> or <strong>--dry-run</strong> to just check what it will do.</em>
ko: <strong>참고 :</strong> <em>수행 할 작업을 확인하려면 <strong>-n</strong> 또는 <strong>--dry-run</strong> 을 추가하십시오.</em>
ru: <strong>Примечание:</strong> <em>добавьте <strong>-n</strong> или <strong>--dry-run,</strong> чтобы просто проверить, что он будет делать.</em>
zh_cn: <strong>注意：</strong> <em>添加<strong>-n</strong>或<strong>--dry-run</strong>仅检查其作用。</em>

source: <strong>Note</strong> the case difference on the <code>X</code> for the two latter commands.
ko: 후자의 두 명령에 대한 <code>X</code> 의 대소 문자 차이에 <strong>유의</strong> 하십시오.
ru: <strong>Обратите внимание</strong> на различие в регистре <code>X</code> для двух последних команд.
zh_cn: <strong>请注意</strong>后面两个命令在 <code>X</code> 上的大小写差异。

source: <strong>OK,</strong> deleting <strong>unwanted untracked files and folders</strong> are easy using <code>git</code> in command line, just do it like this:
ko: <strong>좋아,</strong> <strong>원하지 않는 추적되지 않는 파일과 폴더를</strong> 삭제하는 것은 명령 줄에서 <code>git</code> 을 사용하여 쉽게 수행 할 수 있습니다.
ru: <strong>ОК,</strong> удалить <strong>ненужные неотслеживаемые файлы и папки</strong> легко с помощью <code>git</code> в командной строке, просто сделайте это так:
zh_cn: <strong>好的，</strong>在命令行中使用 <code>git</code> 可以轻松删除<strong>不需要的未跟踪文件和文件夹</strong> ，只需执行以下操作：

source: <strong>Remove all extra folders and files in this repo + submodules</strong>
ko: <strong>이 repo + 하위 모듈에서 추가 폴더와 파일을 모두 제거하십시오.</strong>
ru: <strong>Удалите все лишние папки и файлы в этом репо + подмодули</strong>
zh_cn: <strong>删除此repo +子模块中的所有其他文件夹和文件</strong>

source: <strong>Remove all extra folders and files in this repo but not its submodules</strong>
ko: <strong>이 저장소의 하위 폴더가 아닌 추가 폴더와 파일을 모두 제거하십시오.</strong>
ru: <strong>Удалите все дополнительные папки и файлы в этом репо, но не его подмодули</strong>
zh_cn: <strong>删除此存储库中的所有其他文件夹和文件，但不删除其子模块</strong>

source: <strong>Remove extra folders + ignored files (but not newly added files)</strong>
ko: <strong>추가 폴더 + 무시 된 파일 제거 (새로 추가 된 파일 제외)</strong>
ru: <strong>Удалить лишние папки + пропущенные файлы (но не новые добавленные файлы)</strong>
zh_cn: <strong>删除多余的文件夹+被忽略的文件（但不删除新添加的文件）</strong>

source: <strong>Remove extra folders but not files (ex. build or logs folder)</strong>
ko: <strong>추가 폴더는 제거하지만 파일은 제거하지 마십시오 (예 : 빌드 또는 로그 폴더)</strong>
ru: <strong>Удалите лишние папки, но не файлы (например, папку build или logs)</strong>
zh_cn: <strong>删除多余的文件夹，但不删除文件（例如build或logs文件夹）</strong>

source: <strong>Removing sample.txt</strong>
ko: <strong>sample.txt 제거</strong>
ru: <strong>Удаление файла sample.txt</strong>
zh_cn: <strong>删除sample.txt</strong>

source: <strong>Suggested Method:</strong> Interative Mode by using <code>git clean -i</code> so we can have control over it. let see remaining available options.
ko: <strong>권장 방법 :</strong> <code>git clean -i</code> 를 사용하여 대화식 모드로 제어 할 수 있습니다. 사용 가능한 나머지 옵션을 보자.
ru: <strong>Предлагаемый метод:</strong> Интерактивный режим с использованием <code>git clean -i</code> , чтобы мы могли контролировать его. давайте посмотрим оставшиеся доступные варианты.
zh_cn: <strong>建议的方法：</strong>使用 <code>git clean -i</code> 进行交互模式，以便我们对其进行控制。 让我们看看剩余的可用选项。

source: <strong>Would remove sample.txt</strong>
ko: <strong>sample.txt를 제거합니다</strong>
ru: <strong>Удалил sample.txt</strong>
zh_cn: <strong>将删除sample.txt</strong>

source: <strong>git clean</strong> - Remove untracked files from the working tree
ko: <strong>git</strong> clean-작업 트리에서 추적되지 않은 파일 제거
ru: <strong>git clean</strong> - удаляет неотслеживаемые файлы из рабочего дерева
zh_cn: <strong>git</strong> clean-从工作树中删除未跟踪的文件

source: <strong>oh-my-zsh</strong> with <strong>zsh</strong> provides those great aliases via the git plugin. They can be used in bash as well.
ko: <strong>zsh</strong> 가 포함 된 <strong>oh-my-zsh</strong> 는 git 플러그인을 통해 훌륭한 별칭을 제공합니다. 그들은 bash에서도 사용할 수 있습니다.
ru: <strong>oh-my-zsh</strong> с <strong>zsh</strong> предоставляет эти отличные псевдонимы через плагин git. Их также можно использовать в bash.
zh_cn: 带有<strong>zsh的</strong> <strong>oh-my-zsh</strong>通过git插件提供了这些出色的别名。 它们也可以用于bash中。

source: A better way is to use: git clean
ko: 더 좋은 방법은 git clean을 사용하는 것입니다.
ru: Лучше использовать:git чистый
zh_cn: 更好的方法是使用:git clean

source: A lifehack for such situation I just invented and tried (that works perfectly):
ko: 내가 방금 발명하고 시도한 그러한 상황에 대한 구명 (완벽하게 작동) :
ru: Спасательный круг для такой ситуации я только что изобрел и попробовал (это отлично работает):
zh_cn: 针对这种情况,我刚刚发明并尝试了一种生活的方法(效果很好)。

source: Again see the <a href="http://git-scm.com/docs/git-clean"><code>git-clean</code></a> docs for more information.
ko: 자세한 내용은 <a href="http://git-scm.com/docs/git-clean"> <code>git-clean</code> </a> 문서를 다시 참조하십시오.
ru: Снова посмотрите <a href="http://git-scm.com/docs/git-clean"> <code>git-clean</code> </a> docs для получения дополнительной информации.
zh_cn: 再次查看<a href="http://git-scm.com/docs/git-clean"> <code>git-clean</code> </a>文档以获取更多信息。

source: Also in this case, <code>-f</code> stands for force and <code>-d</code> stands for directory...
ko: 또한이 경우 <code>-f</code> 는 force를 나타내고 <code>-d</code> 는 디렉토리를 나타냅니다.
ru: Также в этом случае <code>-f</code> обозначает силу, а <code>-d</code> обозначает каталог ...
zh_cn: 同样在这种情况下， <code>-f</code> 代表强制， <code>-d</code> 代表目录...

source: Also, replace the <code>-f</code> argument with <code>-n</code> to perform a <code>dry-run</code> or <code>-i</code> for interactive mode and it will tell you what will be removed.
ko: 또한 대화식 모드의 경우 <code>-n</code> 을 수행하려면 <code>-f</code> 인수를 -n 으로 바꾸고 제거 할 항목을 알려줍니다.
ru: Также замените аргумент <code>-f</code> на <code>-n</code> , чтобы выполнить <code>dry-run</code> или <code>-i</code> для интерактивного режима, и он сообщит вам, что будет удалено.
zh_cn: 另外，将 <code>-f</code> 参数替换为 <code>-n</code> 以执行 <code>dry-run</code> 或者将 <code>-i</code> 替换为交互式模式，它将告诉您要删除的内容。

source: Also, you can use <code>-x</code> flag for including the files which are ignored by git. This would be helpful if you want to delete everything.
ko: 또한 git에서 무시되는 파일을 포함시키기 위해 <code>-x</code> 플래그를 사용할 수 있습니다. 모든 것을 삭제하려는 경우 유용합니다.
ru: Также вы можете использовать флаг <code>-x</code> для включения файлов, которые игнорируются git. Это было бы полезно, если вы хотите удалить все.
zh_cn: 另外，您可以使用 <code>-x</code> 标志来包含git忽略的文件。 如果要删除所有内容，这将很有帮助。

source: And adding <code>-i</code> flag, makes git asking you for permission for deleting files one by one on the go.
ko: <code>-i</code> 플래그를 추가하면 git이 파일을 하나씩 삭제할 수있는 권한을 묻습니다.
ru: А добавление флага <code>-i</code> заставляет git запрашивать разрешение на удаление файлов один за другим на ходу.
zh_cn: 并添加 <code>-i</code> 标志，使git询问您是否允许随时删除文件。

source: And combined way to delete untracked dir/files and ignored files.
ko: 추적되지 않은 디렉토리 / 파일과 무시 된 파일을 삭제하는 결합 된 방법.
ru: И комбинированный способ удаления неотслеживаемых файлов и игнорируемых файлов.
zh_cn: 并结合方式删除未被跟踪的dirfiles和被忽略的文件。

source: Be careful while running `git clean` command.
ko: `git clean` 명령을 실행할 때주의하십시오.
ru: Будьте осторожны,выполняя команду ''Git clean''.
zh_cn: 运行 "git clean "命令时要小心。

source: Be quiet, only report errors, but not the files that are successfully removed.
ko: 조용히하고 오류 만보고하지만 성공적으로 제거 된 파일은보고하지 마십시오.
ru: Будьте спокойны,сообщайте только об ошибках,но не о файлах,которые успешно удалены.
zh_cn: 要安静,只能报错,不能报错,不能报成功的文件。

source: Be sure that flags <code>-f</code>, <code>-d</code>, <code>-x</code> match your needs:
ko: 플래그 <code>-f</code> , <code>-d</code> , <code>-x</code> 가 요구 사항과 일치하는지 확인하십시오.
ru: Убедитесь, что флаги <code>-f</code> , <code>-d</code> , <code>-x</code> соответствуют вашим потребностям:
zh_cn: 确保标志 <code>-f</code> ， <code>-d</code> ， <code>-x</code> 满足您的需求：

source: By default, <code>git clean</code> will only remove untracked files that are not ignored. Any file that matches a pattern in your .gitignore or other ignore files will not be removed. If you want to remove those files too, you can add a <code>-x</code> to the clean command.
ko: 기본적으로 <code>git clean</code> 은 무시되지 않은 추적되지 않은 파일 만 제거합니다. gitgitore 또는 다른 무시 파일의 패턴과 일치하는 파일은 제거되지 않습니다. 해당 파일도 제거하려면 clean 명령에 <code>-x</code> 를 추가하면됩니다.
ru: По умолчанию <code>git clean</code> удаляет только неотслеживаемые файлы, которые не игнорируются. Любой файл, который соответствует шаблону в вашем .gitignore или других игнорируемых файлах, не будет удален. Если вы тоже хотите удалить эти файлы, вы можете добавить <code>-x</code> к команде clean.
zh_cn: 默认情况下， <code>git clean</code> 将仅删除未被忽略的未跟踪文件。 与您的.gitignore或其他忽略文件中的模式匹配的任何文件都不会被删除。 如果也要删除这些文件，则可以在clean命令中添加 <code>-x</code> 。

source: Clean Step - <strong>beware: this will delete files</strong>:
ko: 클린 단계- <strong>주의 : 파일을 삭제합니다</strong> :
ru: Clean Step - <strong>будьте осторожны: это удалит файлы</strong> :
zh_cn: 清洁步骤- <strong>当心：这将删除文件</strong> ：

source: Cleans the working tree by recursively removing files that are not under version control, <strong>starting from the current directory</strong>.
ko: <strong>현재 디렉토리에서 시작</strong> 하여 버전 제어를받지 않는 파일을 재귀 적으로 제거하여 작업 트리를 정리합니다.
ru: Очищает рабочее дерево путем рекурсивного удаления файлов, которые не находятся под контролем версий, <strong>начиная с текущего каталога</strong> .
zh_cn: <strong>从当前目录开始，</strong>以递归方式删除不受版本控制的文件，从而清理工作树。

source: Don&rsquo;t actually remove anything, just show what would be done.
ko: 실제로 아무것도 제거하지 말고 수행 할 작업을 보여주십시오.
ru: На самом деле ничего не удаляйте, просто покажите, что будет сделано.
zh_cn: 实际上不删除任何内容，只是显示将要执行的操作。

source: Don&rsquo;t use the standard ignore rules read from .gitignore (per directory) and <code>$GIT_DIR/info/exclude</code>, but do still use the ignore rules given with <code>-e</code> options. This allows removing all untracked files, including build products. This can be used (possibly in conjunction with git reset) to create a pristine working directory to test a clean build.
ko: .gitignore (디렉토리 당) 및 <code>$GIT_DIR/info/exclude</code> 에서 읽은 표준 무시 규칙을 사용하지 말고 여전히 <code>-e</code> 옵션과 함께 제공된 무시 규칙을 사용하십시오. 이를 통해 빌드 제품을 포함하여 추적되지 않은 모든 파일을 제거 할 수 있습니다. 이것은 git reset과 함께 사용되어 깨끗한 빌드를 테스트하기 위해 깨끗한 작업 디렉토리를 만들 수 있습니다.
ru: Не используйте стандартные правила игнорирования, считанные из .gitignore (для каждого каталога) и <code>$GIT_DIR/info/exclude</code> , но все же используйте правила игнорирования, заданные с опциями <code>-e</code> . Это позволяет удалить все неотслеживаемые файлы, включая продукты сборки. Это может быть использовано (возможно, в сочетании с git reset) для создания первичного рабочего каталога для тестирования чистой сборки.
zh_cn: 不要使用从.gitignore（每个目录）和 <code>$GIT_DIR/info/exclude</code> 读取的标准忽略规则，但仍要使用 <code>-e</code> 选项提供的忽略规则。 这允许删除所有未跟踪的文件，包括构建产品。 可以使用它（可能与git reset结合使用）创建原始工作目录以测试干净的构建。

source: Don&rsquo;t use the standard ignore rules read from .gitignore (per directory) and $GIT_DIR/info/exclude, but do still use the ignore rules given with -e options. This allows removing all untracked files, including build products. This can be used (possibly in conjunction with git reset) to create a pristine working directory to test a clean build.
ko: .gitignore (디렉토리 당) 및 $ GIT_DIR / info / exclude에서 읽은 표준 무시 규칙을 사용하지 말고 여전히 -e 옵션과 함께 제공된 무시 규칙을 사용하십시오. 이를 통해 빌드 제품을 포함하여 추적되지 않은 모든 파일을 제거 할 수 있습니다. 이것은 git reset과 함께 사용되어 깨끗한 빌드를 테스트하기 위해 깨끗한 작업 디렉토리를 만들 수 있습니다.
ru: Не используйте стандартные правила игнорирования, считанные из .gitignore (для каждого каталога) и $ GIT_DIR / info / exclude, но все же используйте правила игнорирования, заданные с опциями -e. Это позволяет удалить все неотслеживаемые файлы, включая продукты сборки. Это может быть использовано (возможно, в сочетании с git reset) для создания первичного рабочего каталога для тестирования чистой сборки.
zh_cn: 不要使用从.gitignore（每个目录）和$ GIT_DIR / info / exclude读取的标准忽略规则，但仍要使用-e选项提供的忽略规则。 这允许删除所有未跟踪的文件，包括构建产品。 可以使用它（可能与git reset结合使用）创建原始工作目录以测试干净的构建。

source: EDIT2: <code>git stash save</code> is deprecated in favor of <code>push</code>. Thanks @script-wolf.
ko: EDIT2 : <code>git stash save</code> 는 <code>push</code> 를 위해 더 이상 사용되지 않습니다. @ script-wolf에게 감사드립니다.
ru: EDIT2: <code>git stash save</code> устарело в пользу <code>push</code> . Спасибо @ script-волк.
zh_cn: EDIT2：不推荐使用 <code>git stash save</code> ,而推荐使用 <code>push</code> 。 谢谢@ script-wolf。

source: EDIT: Also I found a way to show untracked file in a stash (e.g. <code>git show stash@{0}^3</code>) <a href="https://stackoverflow.com/a/12681856/338986">https://stackoverflow.com/a/12681856/338986</a>
ko: 편집 : 또한 추적되지 않은 파일을 숨김으로 표시하는 방법을 찾았습니다 (예 : <code>git show stash@{0}^3</code> ) <a href="https://stackoverflow.com/a/12681856/338986">https://stackoverflow.com/a/12681856/338986</a>
ru: РЕДАКТИРОВАТЬ: Также я нашел способ показать неотслеживаемый файл в тайнике (например, <code>git show stash@{0}^3</code> ) <a href="https://stackoverflow.com/a/12681856/338986">https://stackoverflow.com/a/12681856/338986</a>
zh_cn: 编辑：我也找到了一种方法来显示隐藏的未跟踪文件（例如 <code>git show stash@{0}^3</code> ） <a href="https://stackoverflow.com/a/12681856/338986">https://stackoverflow.com/a/12681856/338986</a>

source: For a very large project you might want to run it a couple of times.
ko: 매우 큰 프로젝트의 경우 두 번 실행하려고 할 수 있습니다.
ru: Для очень большого проекта вы,возможно,захотите запустить его пару раз.
zh_cn: 对于一个非常大的项目,你可能会想运行几次。

source: For me only following worked:
ko: 나를 위해 다음과 같이 일했습니다.
ru: Для меня только после работы:
zh_cn: 对我来说,只有以下几点起作用。

source: How do I use 'git reset --hard HEAD' to revert to a previous commit?
ko: 'git reset --hard HEAD'를 사용하여 이전 커밋으로 되돌리려면 어떻게해야합니까?
ru: Как использовать 'git reset --hard HEAD' для возврата к предыдущему коммиту?
zh_cn: 如何使用'git reset --hard HEAD'恢复到之前的提交?

source: How do you delete untracked local files from your current working tree?
ko: 현재 작업 트리에서 추적되지 않은 로컬 파일을 어떻게 삭제합니까?
ru: Как удалить неотслеживаемые локальные файлы из текущего рабочего дерева?
zh_cn: 如何从当前工作树中删除未被跟踪的本地文件?

source: How to remove local (untracked) files from the current Git working tree
ko: 현재 Git 작업 트리에서 로컬 (추적되지 않은) 파일을 제거하는 방법
ru: Как удалить локальные (неотслеживаемые)файлы из текущего дерева работы Git'а?
zh_cn: 如何从当前Git工作树中删除本地文件(未跟踪的)?

source: I also create the image below to make it more memorable, especially I have seen many people confuse <code>-f</code> for cleaning folder sometimes or mix it up somehow!
ko: 또한 아래 이미지를 더 기억에 남게 만들도록 만들었습니다. 특히 폴더 정리를 위해 <code>-f</code> 를 혼동하거나 어떻게 든 혼동하는 것을 보았습니다.
ru: Я также создаю изображение ниже, чтобы сделать его более запоминающимся, особенно я видел, как многие люди путают <code>-f</code> иногда чистят папку или как-то путают!
zh_cn: 我还创建了下面的图像，使其更令人难忘，尤其是我看到许多人混淆 <code>-f</code> 有时清理文件夹或以某种方式混淆它！

source: I am surprised nobody mentioned this before:
ko: 아무도 전에 이것을 언급하지 않은 것에 놀랐습니다.
ru: Удивительно,что никто не упомянул об этом раньше:
zh_cn: 我很惊讶之前没有人提到这个。

source: I have covered some basics here in my blog, <a href="https://vaisakh.github.io/2017/02/14/git-intro-basic-commands.html">git-intro-basic-commands</a>
ko: 내 블로그에서 <a href="https://vaisakh.github.io/2017/02/14/git-intro-basic-commands.html">git-intro-basic-commands에</a> 대한 기본 사항을 다뤘습니다.
ru: Здесь я рассмотрел некоторые основы в своем блоге, <a href="https://vaisakh.github.io/2017/02/14/git-intro-basic-commands.html">git-intro-basic-команды</a>
zh_cn: 我已经在我的博客<a href="https://vaisakh.github.io/2017/02/14/git-intro-basic-commands.html">git-intro-basic-commands中介绍</a>了一些基础知识

source: I like <code>git stash push -u</code> because you can undo them all with <code>git stash pop</code>.
ko: <code>git stash push -u</code> 를 좋아합니다 <code>git stash pop</code> 모두 취소 할 수 있기 때문입니다.
ru: Мне нравится <code>git stash push -u</code> , потому что вы можете отменить их все с помощью <code>git stash pop</code> .
zh_cn: 我喜欢 <code>git stash push -u</code> ,因为您可以使用 <code>git stash pop</code> 撤消它们。
