Repository: rueisnom/feedback
Catalog: xlf/18/32/94/0/1832940.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: Using <code>eval</code> is weak, not a clearly <em>bad</em> practice.
ja: <font style="vertical-align: inherit;"></font> <code>eval</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">は弱く、明らかに</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">悪い</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">習慣</font><font style="vertical-align: inherit;">ではありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>eval</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하는 </font><font style="vertical-align: inherit;">것은 약하지만 분명히 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나쁜</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 습관은 </font><font style="vertical-align: inherit;">아닙니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это слабая </font><font style="vertical-align: inherit;">практика, </font><font style="vertical-align: inherit;">явно не </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">плохая</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">较弱，这显然不是一个</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">坏</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">习惯。</font></font>

source: Very dangerous and insecure
ja: 非常に危険で不安
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우 위험하고 안전하지 않은</font></font>
ru: Очень опасный и небезопасный
zh_cn: 非常危险和不安全

source: When <code>eval()</code> is used to process user-provided input, you enable the user to <a href="https://docs.python.org/3/library/code.html">Drop-to-REPL</a> providing something like this:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とき</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、プロセスのユーザー提供の入力に使用されている、あなたがすることを可能に</font></font><a href="https://docs.python.org/3/library/code.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドロップツーREPL</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このようなものを提供します：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때 </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로세스 사용자 제공 입력하는 데 사용됩니다, 당신은에 사용자를 가능하게 </font></font><a href="https://docs.python.org/3/library/code.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">드롭 - 투 - REPL</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 같은 것을 제공 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда </font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используется для обработки предоставленного пользователем ввода, вы разрешаете пользователю </font></font><a href="https://docs.python.org/3/library/code.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Drop-to-REPL,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предоставляя что-то вроде этого:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当</font></font> <code>eval()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用于处理用户提供的输入时，您使用户能够</font></font><a href="https://docs.python.org/3/library/code.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">拖放到</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">提供以下内容：</font></font>

source: Why is using 'eval' a bad practice
ja: なぜ 'eval' を使うのは悪い習慣なのか
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 'eval'을 사용하는 것이 나쁜 습관입니까?</font></font>
ru: Почему использование "eval"-плохая практика
zh_cn: 为什么使用 "评价 "是一种不好的做法

source: Yes, it is:
ja: そうですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예, 다음과 같습니다.</font></font>
ru: Да,это так:
zh_cn: 是的,就是这样。

source: Yes, using eval is a bad practice. Just to name a few reasons:
ja: そうですね、eval を使うのは悪い習慣です。理由をいくつか挙げると
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예, 평가를 사용하는 것은 나쁜 습관입니다. </font><font style="vertical-align: inherit;">몇 가지 이유를 말하면 다음과 같습니다.</font></font>
ru: Да,использование оценки-плохая практика.Просто чтобы назвать несколько причин:
zh_cn: 是的,使用评价是一种不好的做法。仅举几个原因。

source: You may get away with it, but normally you don't want vectors for <a href="https://en.wikipedia.org/wiki/Arbitrary_code_execution">arbitrary code execution</a> in your applications.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたはそれでうまくいくかもしれませんが、通常あなたは</font><font style="vertical-align: inherit;">あなたのアプリケーション</font><font style="vertical-align: inherit;">で</font></font><a href="https://en.wikipedia.org/wiki/Arbitrary_code_execution"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意のコードを実行</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">するためのベクトルを望んでいません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것을 피할 수는 있지만 일반적으로 </font><font style="vertical-align: inherit;">응용 프로그램에서 </font></font><a href="https://en.wikipedia.org/wiki/Arbitrary_code_execution"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임의의 코드 실행</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">위한 벡터를 원하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам это может сойти с рук, но обычно вам не нужны векторы для выполнения </font></font><a href="https://en.wikipedia.org/wiki/Arbitrary_code_execution"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">произвольного кода</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в ваших приложениях.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以摆脱它，但是通常您不希望向量</font><font style="vertical-align: inherit;">在您的应用程序中</font></font><a href="https://en.wikipedia.org/wiki/Arbitrary_code_execution"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">执行任意代码</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: you should use the <a href="http://docs.python.org/library/functions.html">builtin</a> function <code>setattr</code>:
ja: <font style="vertical-align: inherit;"></font><a href="http://docs.python.org/library/functions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組み込み</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font></font> <code>setattr</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://docs.python.org/library/functions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내장</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수 </font></font> <code>setattr</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы должны использовать </font></font><a href="http://docs.python.org/library/functions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">встроенную</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> функцию </font></font> <code>setattr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您应该使用</font></font><a href="http://docs.python.org/library/functions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内置</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数</font></font> <code>setattr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
