Repository: rueisnom/feedback
Catalog: xlf/18/32/94/0/1832940.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: ...and, if you really want to assign <code>None</code> to the attributes whose names are found in <code>locals()</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">...そして、</font> <code>locals()</code> <font style="vertical-align: inherit;">で名前が見つかった属性に</font><font style="vertical-align: inherit;">本当に</font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">割り当てたい場合</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">... 그리고 </font> <code>locals()</code> <font style="vertical-align: inherit;"> 에 이름이있는 속성에 </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">할당하려면 </font><font style="vertical-align: inherit;">:</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">... и, если вы действительно хотите присвоить </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> атрибутам, имена которых находятся в </font></font> <code>locals()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">...，并且，如果您确实要为</font><font style="vertical-align: inherit;">在</font> <code>locals()</code> <font style="vertical-align: inherit;">中找到其名称的属性</font><font style="vertical-align: inherit;">分配</font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <a href="https://github.com/python/cpython/search?l=Python&amp;p=1&amp;q=eval&amp;utf8=%E2%9C%93">Take a look at this search</a> for <code>eval</code>, performed on the CPython git repository; testing with eval is heavily used.
ja: <a href="https://github.com/python/cpython/search?l=Python&amp;p=1&amp;q=eval&amp;utf8=%E2%9C%93"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CPython gitリポジトリーで実行された</font></font> <code>eval</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この検索</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">見てください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">evalを使用したテストは頻繁に使用されます。</font></font>
ko: <a href="https://github.com/python/cpython/search?l=Python&amp;p=1&amp;q=eval&amp;utf8=%E2%9C%93"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CPython git 저장소에서 수행 된 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">대한 </font><font style="vertical-align: inherit;">이 검색</font><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">살펴보십시오</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">eval 테스트는 많이 사용됩니다.</font></font>
ru: <a href="https://github.com/python/cpython/search?l=Python&amp;p=1&amp;q=eval&amp;utf8=%E2%9C%93"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Посмотрите на этот поиск</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , исполненной на репозиторий CPython; </font><font style="vertical-align: inherit;">тестирование с помощью eval активно используется.</font></font>
zh_cn: <a href="https://github.com/python/cpython/search?l=Python&amp;p=1&amp;q=eval&amp;utf8=%E2%9C%93"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">看看这个搜索在</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，在CPython的Git仓库中进行; </font><font style="vertical-align: inherit;">大量使用eval进行测试。</font></font>

source: <strong>EDIT 2:</strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集2：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 2 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">РЕДАКТИРОВАТЬ 2:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑2：</font></font></strong>

source: <strong>EDIT 3:</strong> Reordered point 1 and 4
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集3：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 並べ替えられたポイント1と4</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 3 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 순서 1과 4를 재정렬</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">РЕДАКТИРОВАТЬ 3:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Изменение порядка пунктов 1 и 4</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑3：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 重新排序的点1和4</font></font>

source: A less obvious approach is updating the object's <code>__dict__</code> object directly. If all you want to do is initialize the attributes to <code>None</code>, then this is less straightforward than the above. But consider this:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それほど明白ではないアプローチは、オブジェクトの</font></font> <code>__dict__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトを直接</font><font style="vertical-align: inherit;">更新すること</font><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">属性を</font></font> <code>None</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">初期化するだけの場合</font><font style="vertical-align: inherit;">、これは上記より簡単ではありません。</font><font style="vertical-align: inherit;">しかし、これを考慮してください：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">덜 명확한 접근 방식은 객체의 </font></font> <code>__dict__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체를 직접 </font><font style="vertical-align: inherit;">업데이트하는 것 </font><font style="vertical-align: inherit;">입니다. </font><font style="vertical-align: inherit;">속성을 </font></font> <code>None</code> 으로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 초기화하기 </font><font style="vertical-align: inherit;">만하면</font><font style="vertical-align: inherit;"> 위의 것보다 덜 간단합니다. </font><font style="vertical-align: inherit;">그러나 이것을 고려하십시오 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Менее очевидный подход - </font><font style="vertical-align: inherit;">непосредственное </font><font style="vertical-align: inherit;">обновление объекта </font></font> <code>__dict__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если все, что вы хотите сделать, это инициализировать атрибуты </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то это не так просто, как указано выше. </font><font style="vertical-align: inherit;">Но учтите это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一种不太明显的方法是</font><font style="vertical-align: inherit;">直接</font><font style="vertical-align: inherit;">更新对象的</font></font> <code>__dict__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象。</font><font style="vertical-align: inherit;">如果您要做的只是将属性初始化为</font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，那么这比上面的方法要简单。</font><font style="vertical-align: inherit;">但是考虑一下：</font></font>

source: Another approach to providing an object with default values for a list of attributes is to define the class's <code>__getattr__</code> method:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトに属性のリストのデフォルト値を提供する別の方法は、クラスの</font></font> <code>__getattr__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">を定義する</font><font style="vertical-align: inherit;">ことです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 목록에 대한 기본값을 객체에 제공하는 또 다른 방법은 클래스의 </font></font> <code>__getattr__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">를 정의하는 </font><font style="vertical-align: inherit;">것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другой подход к предоставлению объекту значений по умолчанию для списка атрибутов заключается в определении </font><font style="vertical-align: inherit;">метода </font><font style="vertical-align: inherit;">класса </font></font> <code>__getattr__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为对象提供属性列表默认值的另一种方法是定义类的</font></font> <code>__getattr__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法：</font></font>

source: As a footnote, in the hands of deranged sociopaths, it may not work out well. However, when confronted with deranged sociopathic users or administrators, it's best to not give them interpreted Python in the first place. In the hands of the truly evil, Python can a liability; <code>eval</code> doesn't increase the risk at all.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">脚注として、混乱した社会主義者の手の中では、うまく機能しない可能性があります。</font><font style="vertical-align: inherit;">ただし、混乱した社会性のあるユーザーや管理者に直面した場合、そもそもPythonを解釈させないことが最善です。</font><font style="vertical-align: inherit;">本当に悪の手に渡って、Pythonは責任を負うことができます。</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はリスクをまったく増加させません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각주로서, 소외된 소시 오 패스의 손에는 잘 작동하지 않을 수 있습니다. </font><font style="vertical-align: inherit;">그러나 소외된 소시 오 패스 사용자 또는 관리자와 대면 할 때는 먼저 해석 된 파이썬을 제공하지 않는 것이 가장 좋습니다. </font><font style="vertical-align: inherit;">진정한 악의 손에 파이썬은 책임을 질 수 있습니다. </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 위험을 전혀 증가시키지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В качестве сноски, в руках невменяемых социопатов, это может не сработать. </font><font style="vertical-align: inherit;">Однако, когда сталкиваешься с ненормальными социопатическими пользователями или администраторами, лучше не давать им интерпретируемый Python. </font><font style="vertical-align: inherit;">В руках действительно зла, Python может быть ответственностью; </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не увеличивает риск на всех.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为注脚，在精神错乱的社会主义者的手中，这可能效果不佳。</font><font style="vertical-align: inherit;">但是，当面对精神错乱的用户或管理员时，最好不要首先让他们理解Python。</font><font style="vertical-align: inherit;">在真正的邪恶之手，Python可以承担责任。</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根本不会增加风险。</font></font>

source: Hack using Python:
ja: Pythonを使ったハック。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파이썬을 사용하여 해킹 :</font></font>
ru: Взломать Питон:
zh_cn: 使用Python进行破解。

source: Here's one example I found in <a href="https://github.com/python/cpython/blob/c30098c8c6014f3340a369a31df9c74bdbacc269/Lib/test/test_unary.py#L43"><code>test_unary.py</code></a> where a test on whether <code>(+|-|~)b'a'</code> raises a <code>TypeError</code>:
ja: <font style="vertical-align: inherit;"> <code>(+|-|~)b'a'</code> <font style="vertical-align: inherit;">が</font> <code>TypeError</code> を送出<font style="vertical-align: inherit;">するかどうかをテスト</font><font style="vertical-align: inherit;">する</font></font><a href="https://github.com/python/cpython/blob/c30098c8c6014f3340a369a31df9c74bdbacc269/Lib/test/test_unary.py#L43"> <code>test_unary.py</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">見つけた1つの例を次に示し</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/python/cpython/blob/c30098c8c6014f3340a369a31df9c74bdbacc269/Lib/test/test_unary.py#L43"> <code>test_unary.py</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">찾은 한 가지 예는 </font></font> <code>(+|-|~)b'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>TypeError</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일으키는 </font><font style="vertical-align: inherit;">지 여부에 대한 테스트입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот один пример, который я нашел в </font></font><a href="https://github.com/python/cpython/blob/c30098c8c6014f3340a369a31df9c74bdbacc269/Lib/test/test_unary.py#L43"> <code>test_unary.py</code> ,</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где </font></font> <code>(+|-|~)b'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывает </font><font style="vertical-align: inherit;">ли </font><font style="vertical-align: inherit;">(+ | - | ~) b'a ' </font></font> <code>TypeError</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeError</font><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是我在</font></font><a href="https://github.com/python/cpython/blob/c30098c8c6014f3340a369a31df9c74bdbacc269/Lib/test/test_unary.py#L43"> <code>test_unary.py</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font><font style="vertical-align: inherit;">找到的一个示例，</font><font style="vertical-align: inherit;">其中测试</font></font> <code>(+|-|~)b'a'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引发</font></font> <code>TypeError</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: I am using the following class to easily store data of my songs.
ja: 私は以下のクラスを使って、自分の曲のデータを簡単に保存しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">노래의 데이터를 쉽게 저장하기 위해 다음 클래스를 사용하고 있습니다.</font></font>
ru: Я использую следующий класс,чтобы легко хранить данные о моих песнях.
zh_cn: 我正在使用下面的类来轻松存储我的歌曲数据。

source: I feel that this is just much more extensible than writing out an <code>if/else</code> block. However, <code>eval</code> seems to be considered a bad practice and unsafe to use. If so, can anyone explain to me why and show me a better way of defining the above class?
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、</font></font> <code>if/else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブロックを</font><font style="vertical-align: inherit;">書き込むよりもはるかに拡張可能だと思い</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">ただし、</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は悪い習慣と見なされ、使用するのは安全ではないようです。</font><font style="vertical-align: inherit;">もしそうなら、誰かがなぜ私に説明し、上記のクラスを定義するより良い方法を私に示すことができますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 </font></font> <code>if/else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 블록을 </font><font style="vertical-align: inherit;">쓰는 것보다 훨씬 확장 가능하다고 생각합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러나 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 나쁜 습관으로 간주되어 사용하기에 안전하지 않은 것으로 보입니다. </font><font style="vertical-align: inherit;">그렇다면 누구든지 왜 나에게 설명하고 위의 클래스를 정의하는 더 좋은 방법을 보여줄 수 있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я чувствую, что это гораздо более расширяемо, чем запись блока </font></font> <code>if/else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Однако </font></font> <code>eval</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> похоже, считается плохой практикой и небезопасен в использовании. </font><font style="vertical-align: inherit;">Если так, может кто-нибудь объяснить мне, почему и показать мне лучший способ определения вышеупомянутого класса?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我觉得这比写一个</font></font> <code>if/else</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">块</font><font style="vertical-align: inherit;">更具扩展性</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">似乎被认为是不好的做法，使用不安全。</font><font style="vertical-align: inherit;">如果是这样，有人可以向我解释原因并向我展示定义上述类的更好方法吗？</font></font>

source: In Linux:
ja: Linuxでは。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">리눅스에서 :</font></font>
ru: В Linux:
zh_cn: 在Linux中。

source: In addition to @Nadia Alramli answer, since I am new to Python and was eager to check how using <code>eval</code> will affect the <em>timings</em>, I tried a small program and below were the observations:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Nadia Alramliの回答に加えて、私はPythonに不慣れで、</font></font> <code>eval</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイミング</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">どのよう</font><font style="vertical-align: inherit;">に影響</font><font style="vertical-align: inherit;">するかを確認したいと思っていたので</font><font style="vertical-align: inherit;">、小さなプログラムを試してみました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Nadia Alramli 답변 외에도 Python을 처음 사용하고 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">타이밍에</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 어떤 영향을 미치는지 </font><font style="vertical-align: inherit;">확인하고 싶었으므로 </font><font style="vertical-align: inherit;">작은 프로그램을 시도했으며 아래는 관찰 결과입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В дополнение к @Nadia Alramli ответ, так как </font><font style="vertical-align: inherit;">я новичок в Python , </font><font style="vertical-align: inherit;">и хотел , </font><font style="vertical-align: inherit;">чтобы проверить , </font><font style="vertical-align: inherit;">как использование </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет влиять на </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тайминги</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я попробовал небольшую программу и ниже были наблюдения:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">除了@Nadia Alramli答案之外，由于我是Python的新手，并且渴望检查使用</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会</font><font style="vertical-align: inherit;">如何</font><font style="vertical-align: inherit;">影响</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">计时</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因此我尝试了一个小程序，以下是观察结果：</font></font>

source: In this case, yes. Instead of
ja: この場合は、そうですね。の代わりに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 경우에 그렇습니다. </font><font style="vertical-align: inherit;">대신에</font></font>
ru: В данном случае,да.Вместо
zh_cn: 在这种情况下,是的。而不是
