Repository: rueisnom/feedback
Catalog: xlf/18/32/94/0/1832940.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: In your case you can use <a href="http://docs.python.org/library/functions.html#setattr">setattr</a> instead:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたの場合、</font><font style="vertical-align: inherit;">代わりに</font></font><a href="http://docs.python.org/library/functions.html#setattr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setattr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使うことができます</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 경우 </font><font style="vertical-align: inherit;">대신 </font></font><a href="http://docs.python.org/library/functions.html#setattr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setattr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В вашем случае вы можете использовать </font></font><a href="http://docs.python.org/library/functions.html#setattr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setattr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用</font></font><a href="http://docs.python.org/library/functions.html#setattr"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setattr</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替：</font></font>

source: It also allows you to make your use of <code>locals()</code> more explicit, e.g.:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font> <code>locals()</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用を</font><font style="vertical-align: inherit;">より明示的</font><font style="vertical-align: inherit;">にすることもできます</font><font style="vertical-align: inherit;">。例：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 다음과 같이 </font></font> <code>locals()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 명확하게 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это также позволяет вам сделать использование </font></font> <code>locals()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> более явным, например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它还允许您</font><font style="vertical-align: inherit;">更明确地</font><font style="vertical-align: inherit;">使用</font></font> <code>locals()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，例如：</font></font>

source: It leads to relatively slow on-the-fly compilation of small pieces of code. An overhead which can be avoided by using better design patterns.
ja: これは、小さなコードの断片のオンザフライコンパイルに比較的時間がかかることにつながります。このオーバーヘッドは、より良い設計パターンを使用することで回避することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작은 코드 조각의 컴파일 과정이 상대적으로 느려집니다. </font><font style="vertical-align: inherit;">더 나은 디자인 패턴을 사용하면 피할 수있는 오버 헤드가 발생합니다.</font></font>
ru: Это приводит к относительно медленной компиляции на лету небольших фрагментов кода.Накладные расходы,которых можно избежать,используя лучшие шаблоны проектирования.
zh_cn: 这导致了小块代码的即时编译速度相对较慢。这种开销可以通过使用更好的设计模式来避免。

source: It looks like some disagree that eval is 'very dangerous and insecure' in the OP case. That might be true for this specific case but not in general. The question was general and the reasons I listed are true for the general case as well.
ja: OPのケースではevalが「非常に危険で安全ではない」ということに反対する人もいるようです。この特定のケースではそうかもしれませんが、一般的なケースではそうではありません。質問は一般的なものであり、私が挙げた理由は一般的なケースにも当てはまります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OP 사례에서 평가가 '매우 위험하고 안전하지 않다'는 의견에 동의하지 않는 것 같습니다. </font><font style="vertical-align: inherit;">이 특정 경우에 해당하지만 일반적으로 그렇지는 않습니다. </font><font style="vertical-align: inherit;">그 질문은 일반적인 것이었고 내가 열거 한 이유는 일반적인 경우에도 마찬가지입니다.</font></font>
ru: Похоже,некоторые не согласны с тем,что eval является "очень опасным и небезопасным" в случае OP.Это может быть верно в данном конкретном случае,но не в целом.Вопрос был общим,и причины,которые я перечислил,верны и для общего случая.
zh_cn: 看起来有些人不同意在OP的情况下,评估是 "非常危险和不安全的"。在这个具体的案例中可能是这样的,但不是一般的案例。这个问题是一般性的,我所列举的原因在一般情况下也是如此。

source: It violates the "Fundamental Principle of Software". Your source is not the sum total of what's executable. In addition to your source, there are the arguments to <code>eval</code>, which must be clearly understood. For this reason, it's the tool of last resort.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「ソフトウェアの基本原理」に違反しています。</font><font style="vertical-align: inherit;">ソースは、実行可能ファイルの合計ではありません。</font><font style="vertical-align: inherit;">ソースに加えて、</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">への引数</font><font style="vertical-align: inherit;">があります。これは明確に理解する必要があります。</font><font style="vertical-align: inherit;">このため、これは最後の手段です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"기본 소프트웨어 원칙"을 위반합니다. </font><font style="vertical-align: inherit;">소스는 실행 가능한 총계가 아닙니다. </font><font style="vertical-align: inherit;">출처 외에도 </font></font> <code>eval</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 주장이 있으며, </font><font style="vertical-align: inherit;">분명히 이해해야합니다. </font><font style="vertical-align: inherit;">따라서 최후의 수단입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это нарушает &laquo;Фундаментальный принцип программного обеспечения&raquo;. </font><font style="vertical-align: inherit;">Ваш источник не является общей суммой исполняемого файла. </font><font style="vertical-align: inherit;">В дополнение к вашему источнику есть аргументы </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которые должны быть четко поняты. </font><font style="vertical-align: inherit;">По этой причине это инструмент последней инстанции.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它违反了&ldquo;软件基本原理&rdquo;。</font><font style="vertical-align: inherit;">您的来源不是可执行文件的总和。</font><font style="vertical-align: inherit;">除了您的资料之外，还有</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的参数</font><font style="vertical-align: inherit;">，必须清楚地理解。</font><font style="vertical-align: inherit;">因此，它是万不得已的工具。</font></font>

source: It's usually a sign of thoughtless design. There's rarely a good reason for dynamic source code, built on-the-fly. Almost anything can be done with delegation and other OO design techniques.
ja: それは通常、軽率な設計のサインです。オンザフライで構築された動的なソースコードには、正当な理由があることはほとんどありません。委任やその他の OO 設計手法を使えば、ほとんど何でもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 사려 깊은 디자인의 표시입니다. </font><font style="vertical-align: inherit;">동적 소스 코드를 즉석에서 구축 할만한 이유는 거의 없습니다. </font><font style="vertical-align: inherit;">위임 및 기타 OO 설계 기술로 거의 모든 작업을 수행 할 수 있습니다.</font></font>
ru: Обычно это признак бездумного дизайна.Редко бывает хорошая причина для динамического исходного кода,построенного "на лету".Почти все можно сделать с помощью делегирования и других техник проектирования OO.
zh_cn: 这通常是设计不周到的表现。动态源码很少有一个好的理由,即兴构建的动态源码。几乎所有的事情都可以通过授权和其他OO设计技术来完成。

source: It's worth noting that for the specific problem in question, there are several alternatives to using <code>eval</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題の特定の問題については、</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する代わりにいくつかの選択肢があることに注意してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문제의 특정 문제에 대해 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용에 대한 몇 가지 대안이 있음을 주목할 가치가 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стоит отметить, что для конкретной проблемы есть несколько альтернатив использованию </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值得注意的是，对于所讨论的特定问题，可以使用</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">几种替代方法</font><font style="vertical-align: inherit;">：</font></font>

source: Makes debugging difficult
ja: デバッグを困難にする
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">디버깅을 어렵게 만듭니다</font></font>
ru: затрудняет отладку
zh_cn: 增加了调试的难度

source: Other users pointed out how your code can be changed as to not depend on <code>eval</code>; I'll offer a legitimate use-case for using <code>eval</code>, one that is found even in CPython: <em>testing</em>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他のユーザーは、</font></font> <code>eval</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">依存しないようにコードを変更する方法を指摘しました</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">CPythonでも見つかる</font></font> <code>eval</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用するための正当なユースケースを提供します</font><font style="vertical-align: inherit;">：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テスト</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 사용자는 </font></font> <code>eval</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의존하지 않도록 코드를 어떻게 변경할 수 있는지 지적했습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">CPython에서도 찾아 볼 수있는 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용하기위한 합법적 인 사용 사례를 제공 할 </font><font style="vertical-align: inherit;">것입니다 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">testing</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другие пользователи указали, как ваш код может быть изменен, чтобы не зависеть от </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Я предложу законный вариант использования </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который встречается даже в CPython: </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тестирование</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其他用户指出了如何更改代码而不依赖于</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">我将提供一个使用</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的合法用例，</font><font style="vertical-align: inherit;">即使在CPython中也可以找到它：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">testing</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The below code will list all tasks running on a Windows machine.
ja: 以下のコードは、Windows マシン上で実行されているすべてのタスクを一覧表示します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래 코드는 Windows 컴퓨터에서 실행되는 모든 작업을 나열합니다.</font></font>
ru: Нижеприведенный код перечисляет все задачи,выполняемые на машине с Windows.
zh_cn: 下面的代码将列出Windows机器上运行的所有任务。

source: The point of all this: There are lots of reasons, in general, to avoid <code>eval</code> - the security problem of executing code that you don't control, the practical problem of code you can't debug, etc. But an even more important reason is that generally, you don't need to use it. Python exposes so much of its internal mechanisms to the programmer that you rarely really need to write code that writes code.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このすべての要点：一般に、</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を回避する理由はたくさんあります。</font><font style="vertical-align: inherit;">制御できないコードを実行することのセキュリティ問題、デバッグできないコードの実際的な問題などですが、さらに重要なのは理由は、一般的にそれを使用する必要がないからです。</font><font style="vertical-align: inherit;">Pythonは内部メカニズムの多くをプログラマーに公開しているため、コードを記述するコードを記述する必要はほとんどありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 모든 것의 요점 : 일반적으로 </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 피해야하는 많은 이유 </font><font style="vertical-align: inherit;">가 있습니다. 제어 할 수없는 코드 실행의 보안 문제, 디버깅 할 수없는 코드의 실제 문제 등. 그러나 훨씬 더 중요합니다. 그 이유는 일반적으로 그것을 사용할 필요가 없기 때문입니다. </font><font style="vertical-align: inherit;">파이썬은 내부 메커니즘의 많은 부분을 프로그래머에게 노출 시키므로 코드를 작성하는 코드를 거의 작성할 필요가 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смысл всего этого: в общем, существует множество причин, по которым следует избегать </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - проблема безопасности выполнения кода, который вы не контролируете, практическая проблема кода, который вы не можете отлаживать, и т. Д. Но еще более важная причина в том, что, как правило, вам не нужно его использовать. </font><font style="vertical-align: inherit;">Python предоставляет так много своих внутренних механизмов программисту, что вам редко нужно писать код, который пишет код.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有这些的要点：通常，有很多原因可以避免</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：执行不受控制的代码的安全性问题，无法调试的实际代码等问题，但是更重要的是原因是通常不需要使用它。</font><font style="vertical-align: inherit;">Python向程序员公开了很多内部机制，因此您几乎不需要编写编写代码的代码。</font></font>

source: The simplest, as noted, is using <code>setattr</code>:
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前述のように、最も簡単なのは</font></font> <code>setattr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用すること</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언급 된 것처럼 가장 간단한 방법은 </font></font> <code>setattr</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하는 것입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Самым простым, как уже было отмечено, является использование </font></font> <code>setattr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如上所述，最简单的方法是使用</font></font> <code>setattr</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: The usage is clearly not bad practice here; <em>you define the input</em> and merely observe behavior. <code>eval</code> is handy for testing.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでの使用法は明らかに悪い習慣ではありません。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">入力を定義し、動作</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を観察するだけです。</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はテストに便利です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용법은 분명히 나쁜 습관이 아닙니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">입력을 정의하고</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 동작을 관찰하기 만합니다. </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 테스트에 편리합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование здесь явно не плохая практика; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы определяете вход</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и просто наблюдаете за поведением. </font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> удобен для тестирования.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">显然，这里的用法不是坏习惯。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您定义输入</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，仅观察行为。</font></font> <code>eval</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">适用于测试。</font></font>

source: There are some cases where you have to use eval or exec. But they are rare. Using eval in your case is a bad practice for sure. I'm emphasizing on bad practice because eval and exec are frequently used in the wrong place.
ja: eval や exec を使わなければならない場合もあります。しかし、それは稀なことです。あなたのケースで eval を使うのは間違いなく悪い習慣です。私が「悪い習慣」と強調しているのは、 eval と exec は間違った場所で使われることが多いからです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">eval 또는 exec를 사용해야하는 경우가 있습니다. </font><font style="vertical-align: inherit;">그러나 그들은 드 rare니다. </font><font style="vertical-align: inherit;">귀하의 경우 eval을 사용하는 것은 확실히 나쁜 습관입니다. </font><font style="vertical-align: inherit;">나는 eval과 exec가 종종 잘못된 장소에서 사용되기 때문에 나쁜 연습을 강조하고 있습니다.</font></font>
ru: Есть некоторые случаи,когда необходимо использовать eval или exec.Но они редки.Использование eval в вашем случае наверняка является плохой практикой.Я делаю акцент на плохой практике,потому что eval и exec часто используются не в том месте.
zh_cn: 有一些情况下,你必须使用 eval 或 exec。但这种情况很少见。在你的情况下使用eval,肯定是一种不好的做法。我之所以强调坏的做法,是因为eval和exec经常被用在错误的地方。

source: There is almost always a better way to do it
ja: すべからくそれに越したことはない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">거의 항상 더 좋은 방법이 있습니다.</font></font>
ru: Почти всегда есть лучший способ сделать это.
zh_cn: 几乎总是有更好的方法去做

source: This allows you to pass keyword arguments to the constructor, e.g.:
ja: これにより、コンストラクタにキーワード引数を渡すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 통해 키워드 인수를 생성자에 전달할 수 있습니다. 예 :</font></font>
ru: Это позволяет передавать в конструктор аргументы ключевых слов,например,
zh_cn: 这样可以将关键字参数传递给构造函数,例如。

source: This method gets called when the named attribute isn't found in the normal way. This approach somewhat less straightforward than simply setting the attributes in the constructor or updating the <code>__dict__</code>, but it has the merit of not actually creating the attribute unless it exists, which can pretty substantially reduce the class's memory usage.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このメソッドは、名前付き属性が通常の方法で見つからない場合に呼び出されます。</font><font style="vertical-align: inherit;">このアプローチは、単にコンストラクターで属性を設定するか、</font></font> <code>__dict__</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新するよりも簡単</font><font style="vertical-align: inherit;">ではありませんが、存在しない限り実際には属性を作成しないというメリットがあり、クラスのメモリ使用量を大幅に削減できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">명명 된 속성을 일반적인 방식으로 찾지 못하면이 메소드가 호출됩니다. </font><font style="vertical-align: inherit;">이 접근 방식은 단순히 생성자에서 속성을 설정하거나 </font></font> <code>__dict__</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 업데이트하는 것보다 다소 덜 간단 </font><font style="vertical-align: inherit;">하지만 실제로 존재하지 않는 한 실제로 속성을 만들지 않는 장점이 있습니다. 이는 클래스의 메모리 사용량을 상당히 줄일 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот метод вызывается, когда именованный атрибут не найден обычным способом. </font><font style="vertical-align: inherit;">Этот подход несколько менее прост, чем простая установка атрибутов в конструкторе или обновление </font></font> <code>__dict__</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но он имеет </font><font style="vertical-align: inherit;">преимущество в том</font><font style="vertical-align: inherit;"> , что фактически не создает атрибут, если он не существует, что может существенно уменьшить использование памяти классом.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当找不到以常规方式命名的属性时，将调用此方法。</font><font style="vertical-align: inherit;">这种方法比简单地在构造函数中设置属性或更新</font></font> <code>__dict__</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法要简单一些</font><font style="vertical-align: inherit;">，但是它的优点是除非存在该属性，否则不实际创建该属性，这样可以大大减少类的内存使用量。</font></font>
