Repository: rueisnom/feedback
Catalog: xlf/88/69/55/886955.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> should be replaced with <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code>.
es: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe reemplazarse por </font></font> <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は </font></font> <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다.</font></font>
ru: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> следует заменить на </font></font> <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <code>for (int j = 0; j &lt; 5; j++) //inner loop</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应将</font><font style="vertical-align: inherit;">内循环</font><font style="vertical-align: inherit;">替换 </font></font> <code>for (int j = 0; j &lt; 5 &amp;&amp; !exitloops; j++)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong>Labeled break</strong> concept is used to break out nested loops in java, by using labeled break you can break nesting of loops at any position. Example 1:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> concepto de </font><strong><font style="vertical-align: inherit;">ruptura etiquetada</font></strong><font style="vertical-align: inherit;"> se utiliza para dividir bucles anidados en Java, al usar la rotura rotulada puede romper la anidaci&oacute;n de bucles en cualquier posici&oacute;n. </font><font style="vertical-align: inherit;">Ejemplo 1:</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ラベル付きブレークの</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">概念は、Javaでネストされたループを分割するために使用されます。ラベル付きブレークを使用すると、任意の位置でループのネストを分割できます。</font><font style="vertical-align: inherit;">例1：</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Labeled Break</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 개념은 Java에서 중첩 루프를 분리하는 데 사용됩니다. </font><strong><font style="vertical-align: inherit;">Labeled Break</font></strong><font style="vertical-align: inherit;"> 를 사용하면 어느 위치에서나 루프 중첩을 중단 할 수 있습니다. </font><font style="vertical-align: inherit;">예 1 :</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Меченый перерыв</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> концепция используются , </font><font style="vertical-align: inherit;">чтобы вырваться из вложенных циклов в Java, с помощью меченого перерыва вы можете разбить вложенности циклов в любом положении. </font><font style="vertical-align: inherit;">Пример 1:</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标记中断</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">概念用于在Java中中断嵌套循环，通过使用标记中断，您可以在任何位置中断循环嵌套。</font><font style="vertical-align: inherit;">范例1：</font></font>

source: Another one solution, mentioned without example (it actually works in prod code).
es: Otra solución,mencionada sin ejemplo (en realidad funciona en código de producto).
ja: もう一つの解決策は、例なしで言及されています(それは実際にprodコードで動作します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예제없이 언급 된 또 하나의 솔루션 (실제로 prod 코드에서 작동 함).</font></font>
ru: Другое решение,упомянутое без примера (на самом деле работает в prod-коде).
zh_cn: 另外一个解决方案,没有举例提到(其实在prod代码中也能用)。

source: Basically a question to the author of this question: what do you consider of this approach?
es: Básicamente una pregunta al autor de esta pregunta:¿qué considera de este enfoque?
ja: 基本的にこの質問の筆者への質問:このアプローチをどう考えるか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적 으로이 질문의 저자에게 질문 :이 접근법에 대해 어떻게 생각하십니까?</font></font>
ru: В принципе,вопрос к автору:что вы думаете об этом подходе?
zh_cn: 基本上是对这个问题的作者提出的一个问题:你认为这种做法如何?

source: Best and Easy Method..
es: El mejor y más fácil método...
ja: 最高に簡単な方法...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 쉽고 쉬운 방법</font></font>
ru: Лучший и простой метод...
zh_cn: 最好和最简单的方法...

source: Demo for <code>break</code>, <code>continue</code>, and <code>label</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Demostraci&oacute;n para </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>label</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>label</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デモ</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>label</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 데모 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Демо для </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>label</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">演示</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>label</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Depending on your function, you can also exit/return from the inner loop:
es: Dependiendo de su función,también puede salir de vuelta del bucle interior:
ja: 機能によっては、内側のループからexitreturnすることもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기능에 따라 내부 루프를 종료 / 복귀 할 수도 있습니다.</font></font>
ru: В зависимости от Вашей функции,Вы также можете выйти из внутреннего контура:
zh_cn: 根据你的功能,你也可以从内循环中退出return。

source: Even creating a flag for the outer loop and checking that after each execution of the inner loop can be the answer.
es: Incluso crear una bandera para el bucle exterior y comprobar que después de cada ejecución del bucle interior puede ser la respuesta.
ja: 外側のループのフラグを作成して、内側のループを実行するたびにそれを確認することさえも答えになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부 루프에 대한 플래그를 작성하고 내부 루프를 실행할 때마다 답이 될 수 있는지 확인하십시오.</font></font>
ru: Даже создание флага для внешнего цикла и проверка того,что после каждого выполнения внутреннего цикла может быть ответом.
zh_cn: 甚至为外循环创建一个标志,并在每次执行完内循环后检查这个标志也可以成为答案。

source: Example : if <code>i = 3</code> and <code>j=2</code> then condition is <code>false</code>. But in next iteration of inner loop <code>j=3</code> then condition <code>(i*j)</code> become <code>9</code> which is <code>true</code> but inner loop will be continue till <code>j</code> become <code>5</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo: si </font></font> <code>i = 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>j=2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la condici&oacute;n es </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Pero en la pr&oacute;xima iteraci&oacute;n del bucle interno </font></font> <code>j=3</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> entonces la condici&oacute;n </font></font> <code>(i*j)</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> convierte en </font></font> <code>9</code> ,lo<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cual es </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero el bucle interno continuar&aacute; hasta que </font></font> <code>j</code> se<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> convierta en </font></font> <code>5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例：</font></font> <code>i = 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>j=2</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、条件は</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">しかし、次の内部ループ</font></font> <code>j=3</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">反復では</font><font style="vertical-align: inherit;"> 、条件</font></font> <code>(i*j)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>9</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">なり、</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">が、内部ループは</font></font> <code>j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font> <code>5</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なる</font><font style="vertical-align: inherit;">まで続き</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 : </font></font> <code>i = 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이고 </font></font> <code>j=2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이면 condition이 </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">그러나 내부 루프의 다음 반복에서 </font></font> <code>j=3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음의 조건 </font></font> <code>(i*j)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>9</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이지만 내부 루프가 될 때까지 계속 될 것이다 </font></font> <code>j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример: если </font></font> <code>i = 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>j=2</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> условие </font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но на следующей итерации внутреннего цикла </font></font> <code>j=3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> условие </font></font> <code>(i*j)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> становится </font><font style="vertical-align: inherit;">равным </font></font> <code>9</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> но внутренний цикл будет продолжаться до тех пор, пока </font></font> <code>j</code> не<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> станет </font></font> <code>5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例：如果</font></font> <code>i = 3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">且</font></font> <code>j=2</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">则条件为</font></font> <code>false</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，在内循环</font></font> <code>j=3</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下一次迭代中，</font><font style="vertical-align: inherit;"> 条件</font></font> <code>(i*j)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变为</font></font> <code>9</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这是</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但内循环将持续到</font></font> <code>j</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变为</font></font> <code>5</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为止</font><font style="vertical-align: inherit;">。</font></font>

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For some cases, We can use <code>while</code> loop effectively here.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para algunos casos, podemos usar </font></font> <code>while</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> loop efectivamente aqu&iacute;.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font><font style="vertical-align: inherit;">は</font></font> <code>while</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> whileループを効果的に</font><font style="vertical-align: inherit;">使用できる場合が</font><font style="vertical-align: inherit;">あり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우에 따라 </font><font style="vertical-align: inherit;">여기에서 </font></font> <code>while</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 루프를 효과적으로 </font><font style="vertical-align: inherit;">사용할 수 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В некоторых случаях, мы можем использовать в </font></font> <code>while</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> петли эффективно здесь.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在某些情况下，我们可以</font></font> <code>while</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处有效地</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">while</font><font style="vertical-align: inherit;">循环。</font></font>

source: HERE! So, while a simple break will not work, it can be made to work using <code>continue</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;AQU&Iacute;! </font><font style="vertical-align: inherit;">Por lo tanto, si bien un simple descanso no funcionar&aacute;, se puede hacer que funcione usando </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここに！</font><font style="vertical-align: inherit;">したがって、単純なブレークは機能しませんが、</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用して機能させることができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기! </font><font style="vertical-align: inherit;">따라서 간단한 휴식은 작동하지 않지만 </font></font> <code>continue</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 작동하도록 만들 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ВОТ! </font><font style="vertical-align: inherit;">Таким образом, хотя простой перерыв не будет работать, его можно заставить работать с помощью </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里！</font><font style="vertical-align: inherit;">因此，虽然简单的中断不起作用，但可以使用</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使其起作用</font><font style="vertical-align: inherit;">。</font></font>

source: Here condition1 is the condition which is used to break from loop K and J. And condition2 is the condition which is used to break from loop K , J and I.
es: Aquí la condición 1 es la condición que se usa para romper el bucle K y J.Y la condición 2 es la condición que se usa para romper el bucle K,J e I.
ja: ここで、条件1はループKとJから抜け出すための条件であり、条件2はループK,J,Iから抜け出すための条件である。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 condition1은 루프 K와 J를 끊는 데 사용되는 조건이며 condition2는 루프 K, J와 I를 끊는 데 사용되는 조건입니다.</font></font>
ru: Здесь условие1-это условие,которое используется для выхода из циклов K и J.А условие2-это условие,которое используется для выхода из циклов K,J и I.
zh_cn: 这里的条件1是用于从环路K和J断开的条件,条件2是用于从环路K、J和I断开的条件。

source: Here, in this case complete nested loops should be exit if condition is <code>True</code> . But if we use <code>exitloops</code> only to the upper <code>loop</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute;, en este caso, los bucles anidados completos deben salir si la condici&oacute;n es </font></font> <code>True</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Pero si usamos </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo en el </font> <code>loop</code> <font style="vertical-align: inherit;"> superior</font></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、この場合、条件が</font></font> <code>True</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合、ネストされた完全なループは終了し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">しかし</font><font style="vertical-align: inherit;">、上部</font> <code>loop</code> <font style="vertical-align: inherit;">のみ</font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用すると </font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서이 경우 condition이 </font></font> <code>True</code> 인<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우 완전한 중첩 루프를 종료해야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">하지만 </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 상단 </font> <code>loop</code> <font style="vertical-align: inherit;"> 에만 </font><font style="vertical-align: inherit;">사용하면 </font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь, в этом случае завершенные вложенные циклы должны быть завершены, если условие </font></font> <code>True</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Но если мы используем </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> только для верхнего </font></font> <code>loop</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这种情况下，如果condition为</font></font> <code>True</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">则应退出完整的嵌套循环</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">但是，如果我们</font><font style="vertical-align: inherit;">仅对上一个</font> <code>loop</code> <font style="vertical-align: inherit;">使用 </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: How do I break out of nested loops in Java
es: ¿Cómo puedo salir de los bucles anidados en Java
ja: Javaで入れ子になったループから抜け出すには
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java에서 중첩 루프를 제거하는 방법</font></font>
ru: Как мне вырвать вложенные петли на Java.
zh_cn: 如何在Java中突破嵌套循环?
