Repository: rueisnom/feedback
Catalog: xlf/88/69/55/886955.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: the methods are not long, thus they are more compact and easier to comprehend
es: los métodos no son largos,por lo que son más compactos y más fáciles de comprender
ja: メソッドは長くないので、よりコンパクトで理解しやすいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법이 길지 않기 때문에 더 작고 이해하기 쉽습니다.</font></font>
ru: методы недолговечны,поэтому они более компактны и легче воспринимаются.
zh_cn: 方法不长,比较紧凑,容易理解。

source: then you can check in the outer loop, that whether the condition is set then break from the outer loop as well.
es: entonces puedes comprobar en el bucle exterior,que si la condición se establece entonces se rompe desde el bucle exterior también.
ja: とすると、条件が設定されているかどうかを外側のループで確認して、外側のループから抜け出すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 외부 루프에서 조건이 설정되었는지 여부를 확인한 다음 외부 루프에서도 분리 할 수 ​​있습니다.</font></font>
ru: Затем можно проверить во внешнем контуре,установлено ли условие,а затем оборвать и внешний контур.
zh_cn: 那么你可以在外循环中检查是否设置了条件,然后从外循环中断开。
