Repository: rueisnom/feedback
Catalog: xlf/88/69/55/886955.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Of course <code>BreakLoopException</code> should be internal, private and accelerated with no-stack-trace:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por supuesto, </font></font> <code>BreakLoopException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe ser interno, privado y acelerado con no-stack-trace:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もちろん、</font></font> <code>BreakLoopException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は内部、プライベート、およびスタックトレースなしで高速化する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 </font></font> <code>BreakLoopException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 내부, 개인 및 스택 없음 추적으로 가속화되어야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Конечно, </font></font> <code>BreakLoopException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должно быть внутренним, частным и ускоренным без отслеживания стека:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当然，</font></font> <code>BreakLoopException</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该是内部的，私有的并且使用无堆栈跟踪来加速：</font></font>

source: Otherwise you can try setting a flag when that special condition has occured and check for that flag in each of your loop-conditions.
es: Si no,puedes intentar poner una bandera cuando se haya producido esa condición especial y comprobar esa bandera en cada una de tus condiciones de bucle.
ja: それ以外の場合は、その特別な条件が発生したときにフラグを設定して、ループ条件のそれぞれでそのフラグがあるかどうかをチェックしてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇지 않으면 특수 조건이 발생했을 때 플래그를 설정하고 각 루프 조건에서 해당 플래그를 확인할 수 있습니다.</font></font>
ru: В противном случае Вы можете попробовать установить флаг,когда это особое условие произошло,и проверить наличие этого флага в каждом из Ваших условий цикла.
zh_cn: 否则你可以尝试在特殊条件发生时设置一个标志,并在每个循环条件中检查该标志。

source: Rather unusual approach but in terms of code length (<strong>not performance</strong>) this is the easiest thing you could do:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Enfoque bastante inusual, pero en t&eacute;rminos de longitud del c&oacute;digo ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no de rendimiento</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), esto es lo m&aacute;s f&aacute;cil que puede hacer:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">かなり珍しいアプローチですが、コード長（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パフォーマンスで</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はあり</font><strong><font style="vertical-align: inherit;">ません</font></strong><font style="vertical-align: inherit;">）に関しては、これが最も簡単な方法です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오히려 비정상적인 접근법이지만 코드 길이 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">성능</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 아님) </font><font style="vertical-align: inherit;">측면에서 </font><font style="vertical-align: inherit;">이것은 가장 쉬운 방법입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Довольно необычный подход, но с точки зрения длины кода ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не производительности</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) это самое простое, что вы можете сделать:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相当不寻常的方法，但是就代码长度（</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是性能</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）而言，这是您最容易做的事情：</font></font>

source: Refer to <a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]">this article</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Consulte </font></font><a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este articulo</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]"><font style="vertical-align: inherit;">この記事を</font></a><font style="vertical-align: inherit;">参照し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">てください</font></font>
ko: <font style="vertical-align: inherit;"><a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]"><font style="vertical-align: inherit;">이 기사를</font></a><font style="vertical-align: inherit;"> 참조 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하십시오</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратитесь к </font></font><a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этой статье</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参考</font></font><a href="http://[http://javarevisited.blogspot.com/2012/05/break-continue-and-lablel-in-loop-java.html][1]"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这篇文章</font></font></a>

source: So it is just handling the case via a different approach.
es: Así que sólo está manejando el caso a través de un enfoque diferente.
ja: つまり、別のアプローチで対応しているだけなのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 다른 접근 방식을 통해 사례를 처리하고 있습니다.</font></font>
ru: Так что это просто рассмотрение дела с помощью другого подхода.
zh_cn: 所以,它只是通过不同的方式处理案件。

source: So, it must use <code>exitloops</code> to the inner loops too.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, tambi&eacute;n debe usar los </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">salida</font><font style="vertical-align: inherit;"> a los bucles internos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、</font><font style="vertical-align: inherit;">内部ループにも</font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font><font style="vertical-align: inherit;">내부 루프에도 </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, он также должен использовать </font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для внутренних циклов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，它也必须</font><font style="vertical-align: inherit;">对内部循环</font><font style="vertical-align: inherit;">使用</font></font> <code>exitloops</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Technically the correct answer is to label the outer loop. In practice if you want to exit at any point inside an inner loop then you would be better off externalizing the code into a method (a static method if needs be) and then call it.
es: Técnicamente la respuesta correcta es etiquetar el bucle exterior.En la práctica,si quieres salir en cualquier punto dentro de un bucle interior,entonces sería mejor externalizar el código en un método (un método estático si es necesario)y luego llamarlo.
ja: 技術的には外側のループにラベルを付けるのが正解です。実際には、内側のループ内の任意のポイントで終了したい場合は、コードをメソッド(必要に応じて静的メソッド)に外部化してからそれを呼び出す方が良いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기술적으로 정답은 외부 루프에 레이블을 지정하는 것입니다. </font><font style="vertical-align: inherit;">실제로 내부 루프 내부의 어느 지점에서나 종료하려면 코드를 메소드 (필요한 경우 정적 메소드)로 외부화 한 다음 호출하는 것이 좋습니다.</font></font>
ru: Технически правильным ответом является маркировка внешней петли.На практике,если вы хотите выйти в любой точке внутреннего цикла,то лучше всего экстернализовать код в метод (статический метод,если нужно),а затем вызвать его.
zh_cn: 技术上来说,正确的答案是给外循环打上标签。在实际操作中,如果你想在内循环中的任何一点退出,那么你最好将代码外部化为一个方法(如果需要的话,是一个静态方法),然后调用它。

source: That would pay off for readability.
es: Eso pagaría por la legibilidad.
ja: それは読みやすさのためにも報われるだろう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가독성에 대한 보상입니다.</font></font>
ru: Это бы окупилось за читабельность.
zh_cn: 这样一来,可读性就有了回报。

source: The code would become something like that:
es: El código se convertiría en algo así:
ja: コードはこんな感じになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드는 다음과 같습니다.</font></font>
ru: Код стал бы чем-то вроде этого:
zh_cn: 代码会变成这样的东西。

source: The pros:
es: Los profesionales:
ja: 賛成派。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">장점 :</font></font>
ru: Плюсы:
zh_cn: 的优点。

source: Then inner loop will continues, because there is no extra flag that notify this inner loop to exit.
es: Entonces el bucle interior continuará,porque no hay ninguna bandera extra que notifique a este bucle interior que salga.
ja: この場合、内部ループの終了を通知する余分なフラグがないため、内部ループは継続されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러면 내부 루프가 종료되도록 알리는 추가 플래그가 없기 때문에 내부 루프가 계속됩니다.</font></font>
ru: Тогда внутренний цикл будет продолжаться,потому что нет дополнительного флага,который бы уведомлял об этом внутреннем цикле,чтобы выйти.
zh_cn: 然后内循环将继续进行,因为没有额外的标志来通知这个内循环退出。

source: This prints:
es: Estas huellas:
ja: このプリント。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인쇄합니다 :</font></font>
ru: Это отпечатки:
zh_cn: 这个印。

source: Use <code>condition</code> as a flag for when you are done processing. Then the inner loop only continues on while the condition has not been met. Either way, the outer loop will keep on chuggin'.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use la </font></font> <code>condition</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como un indicador para cuando haya terminado de procesar. </font><font style="vertical-align: inherit;">Luego, el bucle interno solo contin&uacute;a mientras la condici&oacute;n no se ha cumplido. </font><font style="vertical-align: inherit;">De cualquier manera, el bucle externo seguir&aacute; chuggin '.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">処理が完了したときのフラグとして</font></font> <code>condition</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">次に、条件が満たされていない間だけ内側のループが継続します。</font><font style="vertical-align: inherit;">どちらの方法でも、外側のループは継続します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">처리가 완료되면 </font></font> <code>condition</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 플래그로 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그러면 내부 루프는 조건이 충족되지 않은 동안에 만 계속됩니다. </font><font style="vertical-align: inherit;">어느 쪽이든, 외부 루프는 계속 멈출 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font> <code>condition</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в качестве флага, когда вы закончите обработку. </font><font style="vertical-align: inherit;">Тогда внутренний цикл только продолжается, пока условие не выполнено. </font><font style="vertical-align: inherit;">В любом случае, внешний цикл будет продолжать chuggin '.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font> <code>condition</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作为完成处理时的标志。</font><font style="vertical-align: inherit;">然后，内部循环仅在不满足条件的情况下继续进行。</font><font style="vertical-align: inherit;">无论哪种方式，外部循环都将持续不断。</font></font>

source: Use Labels.
es: Usar etiquetas.
ja: ラベルを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">라벨을 사용하십시오.</font></font>
ru: Используй этикетки.
zh_cn: 使用标签。

source: Use a function:
es: Usa una función:
ja: 関数を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기능을 사용하십시오 :</font></font>
ru: Используйте функцию:
zh_cn: 用一个功能。

source: Usually in such cases, it is coming in scope of more meaningful logic, let's say some searching or manipulating over some of the iterated 'for'-objects in question, so I usually use the functional approach:
es: Por lo general,en tales casos,está entrando en el ámbito de una lógica más significativa,digamos una búsqueda o manipulación sobre algunos de los objetos "para" iterados en cuestión,por lo que suelo utilizar el enfoque funcional:
ja: このような場合、通常は、より意味のあるロジックの範囲内に入ってくるので、例えば、問題の反復された'for'オブジェクトのいくつかを検索したり、操作したりすることがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 그러한 경우에는 더 의미있는 논리의 범위에 들어갑니다. 문제가있는 반복되는 'for'객체 중 일부를 검색하거나 조작한다고 가정 해 보겠습니다.</font></font>
ru: Обычно в таких случаях он входит в сферу более осмысленной логики,скажем,некоторого поиска или манипулирования над некоторыми итерационными 'for' -объектами,о которых идет речь,поэтому я обычно использую функциональный подход:
zh_cn: 通常情况下,在这种情况下,它是在更有意义的逻辑范围内,比方说一些搜索或操作一些迭代的'for'-对象的问题,所以我通常会使用功能方法。

source: You can break from all loops without using any label: and flags.
es: Puedes romper todos los lazos sin usar ninguna etiqueta:y banderas.
ja: ラベル:やフラグを使わずに、すべてのループから抜け出すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">label : 및 flags를 사용하지 않고 모든 루프에서 벗어날 수 있습니다.</font></font>
ru: Вы можете разорвать все циклы без использования ярлыков:и флагов.
zh_cn: 你可以不使用任何标签:和标志,就可以从所有的循环中突破。

source: You can do the following:
es: Puedes hacer lo siguiente:
ja: 以下のようなことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음을 수행 할 수 있습니다.</font></font>
ru: Вы можете сделать следующее:
zh_cn: 你可以做到以下几点:

source: You can use <code>break</code> with a label for the outer loop. For example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con una etiqueta para el bucle externo. </font><font style="vertical-align: inherit;">Por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外側のループには、ラベル付きの</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用でき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">例えば：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부 루프의 레이블과 함께 </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с меткой для внешнего цикла. </font><font style="vertical-align: inherit;">Например:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以</font><font style="vertical-align: inherit;">为外部循环</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">带有标签的</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例如：</font></font>

source: You can use a named block around the loops:
es: Puedes usar un bloque con nombre alrededor de los bucles:
ja: ループの周りに名前付きブロックを使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프 주위에 명명 된 블록을 사용할 수 있습니다.</font></font>
ru: Вы можете использовать именованный блок вокруг петель:
zh_cn: 你可以在循环周围使用命名的块。

source: You can use a temporary variable:
es: Puedes usar una variable temporal:
ja: テンポラリ変数を使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">임시 변수를 사용할 수 있습니다 :</font></font>
ru: Вы можете использовать временную переменную:
zh_cn: 你可以使用一个临时变量。

source: You can use labels:
es: Puedes usar etiquetas:
ja: ラベルを使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">라벨을 사용할 수 있습니다 :</font></font>
ru: Ты можешь использовать этикетки:
zh_cn: 你可以使用标签。

source: higher ratio of readability
es: mayor índice de legibilidad
ja: 高可読率
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">높은 가독성</font></font>
ru: повышенная читабельность
zh_cn: 可读性较高

source: more consumption of computing cycles, meaning it is slower from algorithmic point-of-view
es: más consumo de ciclos de computación,lo que significa que es más lento desde el punto de vista algorítmico
ja: より多くの計算サイクルを消費し、アルゴリズムの観点から見て遅いことを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은 컴퓨팅 사이클 소비, 즉 알고리즘 관점에서 느리다는 의미</font></font>
ru: большее потребление вычислительных циклов,то есть медленнее по сравнению с алгоритмической точкой зрения.
zh_cn: 消耗了更多的计算周期,这意味着从算法的角度来看,它的速度较慢

source: more typing work
es: más trabajo de mecanografía
ja: 打ち込み作業
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은 타이핑 작업</font></font>
ru: больше работы с типографией
zh_cn: 更多的打字工作

source: roughly twice more lines
es: aproximadamente dos veces más líneas
ja: 倍行
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대략 두 배 더 많은 라인</font></font>
ru: примерно в два раза больше линий
zh_cn: 两倍左右

source: set a local variable to <code>false</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">establecer una variable local en </font></font> <code>false</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ローカル変数を</font> <code>false</code> に<font style="vertical-align: inherit;">設定し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지역 변수를 </font></font> <code>false</code> 로 설정
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">установить для локальной переменной значение </font></font> <code>false</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将局部变量设置为</font></font> <code>false</code>

source: set that variable <code>true</code> in the first loop, when you want to break
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">establecer esa variable </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el primer bucle, cuando se quiere ruptura</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ブレークしたいときに、最初のループで</font><font style="vertical-align: inherit;">その変数を</font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">設定します</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 루프에서 </font><font style="vertical-align: inherit;">해당 변수를 </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 </font><font style="vertical-align: inherit;">설정하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">установите эту переменную </font></font> <code>true</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в первом цикле, когда вы хотите разорвать</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要中断时，请在第一个循环中</font><font style="vertical-align: inherit;">将该变量设置为</font></font> <code>true</code> <font style="vertical-align: inherit;"></font>

source: suppose there are 3 loops and you want to terminate the loop3: Example 2:
es: Supongamos que hay 3 bucles y quieres terminar el bucle3:Ejemplo 2:
ja: 3つのループがあり、ループ3を終了させたいとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프가 3 개 있고 루프 3을 종료한다고 가정합니다. 예 2 :</font></font>
ru: предположим,что существует 3 цикла,и Вы хотите завершить цикл3:Пример 2:
zh_cn: 假设有3个循环,你想终止循环3:例2:

source: the higher ratio of re-usability and control of searching/manipulating logic without
es: la mayor proporción de reutilización y control de la lógica de manipulación de la búsqueda sin
ja: 再利用可能性と検索操作ロジックの制御の比率が高い方が無難です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 높은 재 사용률과 검색 / 조작 로직의 제어 비율</font></font>
ru: более высокое соотношение возможности повторного использования и управления логикой поиска без
zh_cn: 搜索逻辑的可重用性和控制性较高的比率,而不需要

source: the higher ratio to separation of concerns because of functional granularity
es: la mayor proporción de separación de preocupaciones debido a la granularidad funcional
ja: 機能的な粒度のため、懸念事項の分離に高い比率
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기능 세분성으로 인해 우려 분리 비율이 높음</font></font>
ru: более высокое отношение к разделению проблем из-за функциональной гранулярности
zh_cn: 由于功能颗粒度较高,关注的分离度较高;
