Repository: rueisnom/feedback
Catalog: xlf/88/69/55/886955.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I don't want to put the inner loop in a different method.
es: No quiero poner el lazo interno en un método diferente.
ja: 内側のループを別のメソッドに入れたくない。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부 루프를 다른 방법으로 넣고 싶지 않습니다.</font></font>
ru: Я не хочу вкладывать внутреннюю петлю в другой метод.
zh_cn: 我不想把内循环放进不同的方法。

source: I don't want to rerun the loops. When breaking I'm finished with the execution of the loop block.
es: No quiero volver a hacer los bucles.Cuando se rompan,terminaré con la ejecución del bloque de bucles.
ja: ループを再実行したくない ブレークするときはループブロックの実行を終えている。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프를 다시 실행하고 싶지 않습니다. </font><font style="vertical-align: inherit;">깨면 루프 블록 실행이 끝났습니다.</font></font>
ru: Я не хочу перезапускать петли.Когда я ломаю,я заканчиваю с выполнением блока циклов.
zh_cn: 我不想重新运行循环块。当打破时,我就完成了循环块的执行。

source: I needed to do a similar thing, but I chose not to use the enhanced for loop to do it.
es: Necesitaba hacer algo similar,pero elegí no usar el bucle mejorado para hacerlo.
ja: 私も同じようなことをする必要がありましたが、それをするためにenhanced for loopを使わないことにしました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">비슷한 작업을 수행해야했지만 Enhanced for 루프를 사용하지 않기로 선택했습니다.</font></font>
ru: Мне нужно было сделать то же самое,но я решил не использовать для этого петлю enhanced for loop.
zh_cn: 我也需要做类似的事情,但我选择了不使用增强的for循环来做。

source: I never use labels. It seems like a bad practice to get into. Here's what I would do:
es: Nunca uso etiquetas.Parece una mala práctica para entrar.Esto es lo que yo haría:
ja: ラベルは絶対に使わない。入り込むには悪い習慣のように思えます。私ならこうします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 라벨을 사용하지 않습니다. </font><font style="vertical-align: inherit;">들어가는 것은 나쁜 습관처럼 보입니다. </font><font style="vertical-align: inherit;">내가 할 일은 다음과 같습니다.</font></font>
ru: Я никогда не использую этикетки.Похоже,это плохая практика.Вот что я бы сделал:
zh_cn: 我从来没有用过标签。这似乎是个不好的做法,要想入手。以下是我的做法。

source: I prefer to add an explicit "exit" to the loop tests. It makes it clear to any casual reader that the loop may terminate early.
es: Prefiero añadir una "salida" explícita a las pruebas de bucle.Le deja claro a cualquier lector casual que el bucle puede terminar antes de tiempo.
ja: 私はループテストに明示的な "exit" を追加することを好みます。これは、ループが早期に終了する可能性があることを、どんなカジュアルな読者にも明らかにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">루프 테스트에 명시적인 "종료"를 추가하는 것을 선호합니다. </font><font style="vertical-align: inherit;">루프를 조기에 종료 할 수 있다는 것은 모든 일반 독자에게 분명합니다.</font></font>
ru: Я предпочитаю добавлять в циклические тесты явный "выход".Это дает понять любому случайному читателю,что цикл может завершиться досрочно.
zh_cn: 我更喜欢在循环测试中加入一个明确的 "退出"。这让任何一个散漫的读者都能清楚地知道,这个循环可能会提前终止。

source: I've got a nested loop construct like this:
es: Tengo una construcción de bucle anidado como este:
ja: こんな感じで入れ子になったループ構造になっています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 중첩 루프 구조가 있습니다.</font></font>
ru: У меня есть такая конструкция гнездовой петли:
zh_cn: 我有一个像这样的嵌套循环结构。

source: If it is inside some function why don't you just return it:
es: Si está dentro de alguna función,¿por qué no lo devuelve?
ja: 何かの関数の中にあるのであれば、なぜそれを返すだけではいけないのでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 어떤 함수 안에 있다면 왜 그것을 반환하지 않습니까?</font></font>
ru: Если он внутри какой-то функции,почему бы тебе просто не вернуть его:
zh_cn: 如果是在某个函数里面,为什么不直接返回呢?

source: If it's a new implementation, you can try rewriting the logic as if-else_if-else statements.
es: Si es una nueva implementación,puedes intentar reescribir la lógica como si fueran afirmaciones if-else_if-else.
ja: 新しい実装であれば、if-else_if-else文としてロジックを書き換えてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새로운 구현 인 경우 논리를 if-else_if-else 문으로 다시 작성해 볼 수 있습니다.</font></font>
ru: Если это новая реализация,то можно попробовать переписать логику как if-else_if-else.
zh_cn: 如果是新的实现,可以尝试将逻辑改写成if-else_if-else语句。

source: If you are simply porting the logic from one programming language to Java and just want to get the thing working you can try using <a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly">labels</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si simplemente est&aacute; transfiriendo la l&oacute;gica de un lenguaje de programaci&oacute;n a Java y solo quiere que funcione, puede intentar usar </font></font><a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">etiquetas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ロジックを1つのプログラミング言語からJavaに移植するだけで、機能を動作させたい場合は、</font></font><a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ラベル</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用してみてください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단순히 하나의 프로그래밍 언어에서 Java로 로직을 포팅하고 작동하는 것을 원한다면 </font></font><a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">레이블을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용해보십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы просто переносите логику с одного языка программирования на Java и просто хотите, чтобы все работало, вы можете попробовать использовать </font></font><a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">метки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您只是将逻辑从一种编程语言移植到Java，而只是想使事情正常工作，则可以尝试使用</font></font><a href="https://stackoverflow.com/questions/26430630/how-to-use-goto-statement-correctly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标签</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If you don't like <code>break</code>s and <code>goto</code>s, you can use a "traditional" for loop instead the for-in, with an extra abort condition:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si no le gusta </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s y </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s, puede usar un bucle for "tradicional" en lugar del for-in, con una condici&oacute;n de aborto adicional:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が気に入らない場合は</font><font style="vertical-align: inherit;">、for-inの代わりに「従来の」forループを使用して、追加の中止条件を指定できます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 좋아하지 않는 경우 </font><font style="vertical-align: inherit;">추가 중단 조건과 함께 for-in 대신 "전통적인"for 루프를 사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам не нравятся </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s и </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s, вы можете использовать &laquo;традиционный&raquo; цикл for вместо for-in с дополнительным условием прерывания:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您不喜欢</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则可以使用&ldquo;传统&rdquo; for循环而不是for-in，并带有额外的中止条件：</font></font>

source: It's just tricky solution.
es: Es una solución difícil.
ja: ただのトリッキーな解決策です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">까다로운 해결책입니다.</font></font>
ru: Это просто хитрое решение.
zh_cn: 这只是棘手的解决方案。

source: It's seem used rare, but useful.
es: Parece que se usa poco,pero es útil.
ja: レアな中古のようですが、重宝しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">드물게 사용되지만 유용합니다.</font></font>
ru: Похоже,используется редко,но полезно.
zh_cn: 它似乎用的很少,但很有用。

source: Java 8 <a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"><code>Stream</code></a> solution:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n </font><font style="vertical-align: inherit;">Java 8 </font></font><a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"> <code>Stream</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 8 </font></font><a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"> <code>Stream</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソリューション：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 8 </font></font><a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"> <code>Stream</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение </font><font style="vertical-align: inherit;">Java 8 </font></font><a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"> <code>Stream</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 8 </font></font><a href="https://docs.oracle.com/javase/8/docs/api/?java/util/stream/Stream.html"> <code>Stream</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决方案：</font></font>

source: Java does not have a goto feature like there is in C++. But still, <code>goto</code> is a reserved keyword in Java. They might implement it in the future. For your question, the answer is that there is something called label in Java to which you can apply a <code>continue</code> and <code>break</code> statement. Find the code below:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java no tiene una funci&oacute;n de ir a Goto como la hay en C ++. </font><font style="vertical-align: inherit;">Pero a&uacute;n as&iacute;, </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una palabra clave reservada en Java. </font><font style="vertical-align: inherit;">Podr&iacute;an implementarlo en el futuro. </font><font style="vertical-align: inherit;">Para su pregunta, la respuesta es que hay algo llamado etiqueta en Java al que puede aplicar una </font><font style="vertical-align: inherit;">declaraci&oacute;n de </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Encuentra el c&oacute;digo a continuaci&oacute;n:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaには、C ++にあるようなgoto機能がありません。</font><font style="vertical-align: inherit;">しかし、それでも</font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はJavaの予約キーワードです。</font><font style="vertical-align: inherit;">彼らは将来それを実装するかもしれません。</font><font style="vertical-align: inherit;">あなたの質問の答えは、Javaにはlabelと呼ばれるもの</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あり、それに</font><font style="vertical-align: inherit;">continue</font><font style="vertical-align: inherit;">ステートメント</font><font style="vertical-align: inherit;">と</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメントを</font><font style="vertical-align: inherit;">適用できる</font><font style="vertical-align: inherit;">ということです。</font><font style="vertical-align: inherit;">以下のコードを見つけてください：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java에는 C ++에있는 것처럼 goto 기능이 없습니다. </font><font style="vertical-align: inherit;">그러나 여전히 </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 Java에서 예약 된 키워드입니다. </font><font style="vertical-align: inherit;">그들은 미래에 그것을 구현할 수 있습니다. </font><font style="vertical-align: inherit;">귀하의 질문에 대한 답은 </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문을 </font><font style="vertical-align: inherit;">적용 할 수있는 Java라는 레이블이 있다는 것입니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">아래 코드를 찾으십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В Java нет функции перехода, как в C ++. </font><font style="vertical-align: inherit;">Но все же </font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это зарезервированное ключевое слово в Java. </font><font style="vertical-align: inherit;">Они могут реализовать это в будущем. </font><font style="vertical-align: inherit;">На ваш вопрос ответ заключается в том, что в Java есть нечто, называемое меткой, к которой вы можете применить оператор </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Найдите код ниже:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java没有像C ++一样具有goto功能。</font><font style="vertical-align: inherit;">但</font></font> <code>goto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仍然</font><font style="vertical-align: inherit;">是Java中的保留关键字。</font><font style="vertical-align: inherit;">他们可能会在将来实施它。</font><font style="vertical-align: inherit;">对于您的问题，答案是Java中有一个称为label的东西，您可以在其中应用</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句。</font><font style="vertical-align: inherit;">查找下面的代码：</font></font>

source: Java keywords <code>break</code> and <code>continue</code> have a default value. It's the "nearest loop", and today, after a few years of using Java, I just got it!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las palabras clave Java se </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tienen un valor predeterminado. </font><font style="vertical-align: inherit;">Es el "ciclo m&aacute;s cercano", y hoy, despu&eacute;s de unos a&ntilde;os de usar Java, &iexcl;lo acabo de obtener!</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaキーワードの</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">にはデフォルト値があります。</font><font style="vertical-align: inherit;">それは「最も近いループ」であり、今日、Javaを使用して数年後、私はちょうどそれを手に入れました！</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 키워드는 </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 되고 </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기본값을 갖습니다. </font><font style="vertical-align: inherit;">그것은 "가장 가까운 루프"이며, 오늘날 몇 년 동안 Java를 사용한 후 방금 찾았습니다!</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ключевые слова Java </font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> иметь значение по умолчанию. </font><font style="vertical-align: inherit;">Это &laquo;ближайший цикл&raquo;, и сегодня, после нескольких лет использования Java, я только что понял!</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java关键字</font></font> <code>break</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>continue</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有默认值。</font><font style="vertical-align: inherit;">这是&ldquo;最近循环&rdquo;，今天，在使用Java几年之后，我就知道了！</font></font>

source: Like @1800 INFORMATION suggestion, use the condition that breaks the inner loop as a condition on the outer loop:
es: Como la sugerencia de @1800 INFORMACIÓN,usa la condición que rompe el bucle interior como una condición en el bucle exterior:
ja: 1800 INFORMATIONの提案のように、内側のループを破る条件を外側のループの条件として使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ 1800 INFORMATION 제안과 같이 내부 루프를 끊는 조건을 외부 루프의 조건으로 사용하십시오.</font></font>
ru: Как и в предложении @1800 ИНФОРМАЦИИ,используйте условие,которое разрывает внутренний контур,как условие на внешнем контуре:
zh_cn: 就像@1800 INFORMATION的建议一样,把打破内循环的条件作为外循环的条件。

source: Like other answerers, I'd definitely <em>prefer</em> to put the loops in a different method, at which point you can just return to stop iterating completely. This answer just shows how the requirements in the question can be met.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al igual que otros respondedores, definitivamente </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">preferir&iacute;a</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> poner los bucles en un m&eacute;todo diferente, momento en el que puede regresar para dejar de iterar por completo. </font><font style="vertical-align: inherit;">Esta respuesta solo muestra c&oacute;mo se pueden cumplir los requisitos de la pregunta.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の回答者と同じように、私は間違いだろう</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">好む</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなただけの完全反復を停止するには戻ることができた時点で、別の方法でループを配置します。</font><font style="vertical-align: inherit;">この回答は、質問の要件を満たす方法を示しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 응답자와 마찬가지로 </font><font style="vertical-align: inherit;">루프를 다른 방법으로 넣는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">것을 선호</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다.이 시점에서 완전히 반복을 중지하기 위해 돌아갈 수 있습니다. </font><font style="vertical-align: inherit;">이 답변은 질문의 요구 사항을 어떻게 충족시킬 수 있는지 보여줍니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как и другие ответчики, я бы определенно </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предпочел</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поместить циклы в другой метод, после чего вы можете просто вернуться, чтобы полностью прекратить итерации. </font><font style="vertical-align: inherit;">Этот ответ просто показывает, как требования в вопросе могут быть выполнены.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">像其他答复者一样，我绝对</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">希望</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将循环放入另一种方法中，此时您可以返回以完全停止迭代。</font><font style="vertical-align: inherit;">该答案仅显示了如何满足问题中的要求。</font></font>

source: Like this:
es: Así:
ja: こんな感じで。
ko: 이처럼 :
ru: Вот так:
zh_cn: 就像这样。

source: Major cons:
es: Grandes estafas:
ja: 主な欠点。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">주요 단점 :</font></font>
ru: Главные зеки:
zh_cn: 主要的缺点。

source: Matching the example for the accepted answer:
es: Coincidiendo con el ejemplo de la respuesta aceptada:
ja: 受理した答えの例に合わせる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">허용되는 답변의 예와 일치 :</font></font>
ru: Подходит пример для принятого ответа:
zh_cn: 匹配接受答案的例子。

source: Now how can I break out of both loops? I've looked at similar questions, but none concerns Java specifically. I couldn't apply these solutions because most used gotos.
es: Ahora,¿cómo puedo salir de ambos circuitos? He mirado preguntas similares,pero ninguna se refiere específicamente a Java.No pude aplicar estas soluciones porque la mayoría de los gotos se usan.
ja: さて、どのようにして両方のループから抜け出すことができますか?似たような質問を見てきましたが、特にJavaに関係するものはありませんでした。これらの解決策を適用することはできませんでした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 두 루프에서 어떻게 벗어날 수 있습니까? </font><font style="vertical-align: inherit;">비슷한 질문을 보았지만 Java와 관련된 것은 없습니다. </font><font style="vertical-align: inherit;">대부분의 gotos를 사용했기 때문에 이러한 솔루션을 적용 할 수 없었습니다.</font></font>
ru: Как я могу вырваться из обеих петель? Я просмотрел похожие вопросы,но ни один из них конкретно не касается Java.Я не смог применить эти решения,потому что большинство использованных гото.
zh_cn: 现在如何才能突破这两个循环?我看了类似的问题,但都不是专门针对Java的。我无法应用这些解决方案,因为大多数使用了GETOS。
