Repository: rueisnom/feedback
Catalog: xlf/14/02/89/59/14028959.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="http://api.jquery.com/on/#direct-and-delegated-events">Delegated events</a> have the advantage that they can process events from descendant elements that are added to the document at a later time.
es: <a href="http://api.jquery.com/on/#direct-and-delegated-events">Los eventos delegados</a> tienen la ventaja de que pueden procesar eventos de elementos descendientes que se agregan al documento m&aacute;s adelante.
ja: <a href="http://api.jquery.com/on/#direct-and-delegated-events">委任イベントに</a>は、後でドキュメントに追加される子孫要素からのイベントを処理できるという利点があります。
ko: <a href="http://api.jquery.com/on/#direct-and-delegated-events">위임 된 이벤트</a> 는 나중에 문서에 추가 된 하위 요소의 이벤트를 처리 할 수 ​​있다는 이점이 있습니다.
ru: Преимущество <a href="http://api.jquery.com/on/#direct-and-delegated-events">делегированных событий</a> заключается в том, что они могут обрабатывать события от элементов-потомков, которые добавляются в документ позднее.
zh_cn: <a href="http://api.jquery.com/on/#direct-and-delegated-events">委派事件</a>的优势在于，它们可以处理以后在以后添加到文档中的后代元素中的事件。

source: <code>getElementById</code> requires the passed string to be the ID <em>verbatim</em>, and nothing else. If you prefix the passed string with a <code>#</code>, and the ID does not start with a <code>#</code>, nothing will be selected:
es: <code>getElementById</code> requiere que la cadena pasada sea la ID <em>textualmente</em> , y nada m&aacute;s. Si prefijas la cadena pasada con un <code>#</code> , y la ID no comienza con un <code>#</code> , no se seleccionar&aacute; nada:
ja: <code>getElementById</code> には、渡された文字列が<em>そのまま</em>のIDである必要があります。 渡された文字列の前に <code>#</code> を付け、IDが＃で始まらない場合、何も選択されません。
ko: <code>getElementById</code> 는 전달 된 문자열이 ID <em>verbatim</em> 이어야하며 다른 것은 없습니다. 전달 된 문자열 앞에 <code>#</code> 을 붙이고 ID가 <code>#</code> 으로 시작하지 않으면 아무것도 선택되지 않습니다.
ru: <code>getElementById</code> требует, чтобы переданная строка была идентификатором ID, и больше ничего. Если вы передаете переданную строку с <code>#</code> , а идентификатор не начинается с <code>#</code> , ничего не будет выбрано:
zh_cn: <code>getElementById</code> 要求传递的字符串是<em>逐字显示</em>的ID，仅此而已。 如果为传递的字符串添加 <code>#</code> 前缀，并且ID并非以 <code>#</code> 开头，则不会选择任何内容：

source: <em>For the remainder of this answer I will use <code>getElementById</code> as example, but the same applies to <a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"><code>getElementsByTagName</code></a>, <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"><code>querySelector</code></a> and any other DOM method that selects elements.</em>
es: <em>Para el resto de esta respuesta, <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"> <code>querySelector</code> </a> <code>getElementById</code> como ejemplo, pero lo mismo se aplica a <a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"> <code>getElementsByTagName</code> </a> , querySelector y cualquier otro m&eacute;todo DOM que seleccione elementos.</em>
ja: <em>この回答の残りの部分では、例として <code>getElementById</code> を使用しますが、同じことが<a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"> <code>getElementsByTagName</code> </a> 、 <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"> <code>querySelector</code> </a> 、および要素を選択するその他のDOMメソッドにも当てはまります。</em>
ko: <em>이 답변의 나머지 부분에서는 <code>getElementById</code> 를 예로 사용하지만 <a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"> <code>getElementsByTagName</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"> <code>querySelector</code> </a> 및 요소를 선택하는 다른 DOM 메소드에도 동일하게 적용됩니다.</em>
ru: <em>В оставшейся части этого ответа я буду использовать <code>getElementById</code> в качестве примера, но то же самое относится к <a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"> <code>getElementsByTagName</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"> <code>querySelector</code> </a> и любому другому методу DOM, который выбирает элементы.</em>
zh_cn: <em>对于此答案的其余部分，我将使用 <code>getElementById</code> 作为示例，但同样适用于<a href="https://developer.mozilla.org/en-US/docs/DOM/element.getElementsByTagName"> <code>getElementsByTagName</code> </a> ， <a href="https://developer.mozilla.org/en-US/docs/DOM/Document.querySelector"> <code>querySelector</code> </a>和选择元素的任何其他DOM方法。</em>

source: <strong>Possible Reasons</strong>
es: <strong>Posibles razones</strong>
ja: <strong>考えられる理由</strong>
ko: <strong>가능한 이유</strong>
ru: <strong>Возможные причины</strong>
zh_cn: <strong>可能的原因</strong>

source: <strong>Reasons why id based selectors don't work</strong>
es: <strong>Razones por las que los selectores basados ​​en id no funcionan</strong>
ja: <strong>IDベースのセレクターが機能しない理由</strong>
ko: <strong>ID 기반 선택기가 작동하지 않는 이유</strong>
ru: <strong>Причины, по которым селекторы на основе идентификаторов не работают</strong>
zh_cn: <strong>基于ID的选择器不起作用的原因</strong>

source: <strong>Short and simple:</strong> Because the elements you are looking for do not exist in the document (yet).
es: <strong>Breve y simple:</strong> porque los elementos que est&aacute; buscando no existen en el documento (todav&iacute;a).
ja: <strong>短くてシンプル：</strong>探している要素がドキュメントに（まだ）存在しないため。
ko: <strong>짧고 단순함 :</strong> 찾고있는 요소가 문서에 존재하지 않기 때문에 (아직)
ru: <strong>Коротко и просто:</strong> потому что искомые элементы не существуют в документе (пока).
zh_cn: <strong>简短：</strong>由于您要查找的元素在文档中不存在（尚未）。

source: <sub>Note: Placing scripts at the bottom is generally considered a <a href="http://developer.yahoo.com/performance/rules.html#js_bottom">best practice</a>.</sub>
es: <sub>Nota: colocar guiones en la parte inferior generalmente se considera una <a href="http://developer.yahoo.com/performance/rules.html#js_bottom">pr&aacute;ctica recomendada</a> .</sub>
ja: <sub>注：スクリプトを下部に配置することは、通常、 <a href="http://developer.yahoo.com/performance/rules.html#js_bottom">ベストプラクティス</a>と見なされます。</sub>
ko: <sub>참고 : 맨 아래에 스크립트를 배치하는 것이 일반적으로 <a href="http://developer.yahoo.com/performance/rules.html#js_bottom">모범 사례로</a> 간주됩니다.</sub>
ru: <sub>Примечание. Размещение сценариев внизу обычно считается <a href="http://developer.yahoo.com/performance/rules.html#js_bottom">лучшей практикой</a> .</sub>
zh_cn: <sub>注意：将脚本放在底部通常被认为是<a href="http://developer.yahoo.com/performance/rules.html#js_bottom">最佳实践</a> 。</sub>

source: <sub>Note: The <code>defer</code> attribute certainly <em>seems</em> like a magic bullet <em>but</em> it's important to be aware of the caveats...<br/> 1. <code>defer</code> can only be used for external scripts, i.e.: those having a <code>src</code> attribute.<br/> 2. be aware of <a href="http://caniuse.com/script-defer">browser support</a>, i.e.: buggy implementation in IE &lt; 10</sub>
es: <sub>Nota: El atributo de <code>defer</code> ciertamente <em>parece</em> una bala m&aacute;gica, <em>pero</em> es importante tener en cuenta las advertencias ...</sub> <sub><br/></sub> <sub>1. <code>defer</code> solo se puede usar para scripts externos, es decir, aquellos que tienen un atributo <code>src</code> .</sub> <sub><br/></sub> <sub>2. Tenga en cuenta la compatibilidad del <a href="http://caniuse.com/script-defer">navegador</a> , es decir: implementaci&oacute;n defectuosa en IE &lt;10</sub>
ja: <sub>注： <code>defer</code> 属性は確かに魔法の<em>ように見え</em>ますが、警告に注意することが重要です...</sub> <sub><br/></sub> <sub>1. <code>defer</code> は外部スクリプト、つまり <code>src</code> 属性を持つものにのみ使用できます。</sub> <sub><br/></sub> <sub>2. <a href="http://caniuse.com/script-defer">ブラウザのサポート</a>に注意してください。つまり、IE &lt;10でのバグのある実装</sub>
ko: <sub>참고 : <code>defer</code> 속성은 확실히 마법의 총알처럼 <em>보이지만</em> 주의 사항을 알고 있어야합니다 ...</sub> <sub><br/></sub> <sub>1. <code>defer</code> 은 외부 스크립트, 즉 <code>src</code> 속성이있는 스크립트에만 사용할 수 있습니다.</sub> <sub><br/></sub> <sub>2. <a href="http://caniuse.com/script-defer">브라우저 지원</a> 에주의하십시오. 예 : IE &lt;10의 버그 구현</sub>
ru: <sub>Примечание: атрибут <code>defer</code> , безусловно, <em>выглядит</em> как волшебная пуля, <em>но</em> важно знать о предостережениях ...</sub> <sub><br/></sub> <sub>1. <code>defer</code> может использоваться только для внешних скриптов, то есть для тех, которые имеют атрибут <code>src</code> .</sub> <sub><br/></sub> <sub>2. знать о <a href="http://caniuse.com/script-defer">поддержке браузера</a> , то есть: ошибочная реализация в IE &lt;10</sub>
zh_cn: <sub>注意： <code>defer</code> 属性当然<em>看起来</em>像是魔术子弹， <em>但请</em>注意警告很重要...</sub> <sub><br/></sub> <sub>1. <code>defer</code> 仅可用于外部脚本，即：具有 <code>src</code> 属性的脚本。</sub> <sub><br/></sub> <sub>2.注意<a href="http://caniuse.com/script-defer">浏览器支持</a> ，即：IE &lt;10中的错误实现</sub>

source: <sub>Note: Typically, this pattern is reserved for elements which didn't exist at load-time <em>or</em> to avoid attaching a large amount of handlers. It's also worth pointing out that while I've attached a handler to <code>document</code> (for demonstrative purposes), you should select the nearest reliable ancestor.</sub>
es: <sub>Nota: Normalmente, este patr&oacute;n est&aacute; reservado para elementos que no exist&iacute;an en el momento de la carga <em>o</em> para evitar asociar una gran cantidad de controladores.</sub> <sub>Tambi&eacute;n vale la pena se&ntilde;alar que si bien he adjuntado un controlador al <code>document</code> o (con fines demostrativos), debe seleccionar el antepasado confiable m&aacute;s cercano.</sub>
ja: <sub>注：通常、このパターンは、ロード時に存在しなかった要素、 <em>または</em>大量のハンドラーのアタッチを回避するために予約されています。</sub> <sub> <code>document</code> するためにハンドラーを（説明目的で）添付している間、最も近い信頼できる祖先を選択する必要があることも指摘する価値があります。</sub>
ko: <sub>참고 : 일반적으로이 패턴은로드시 존재하지 않았 <em>거나</em> 많은 양의 핸들러를 첨부하지 않도록하는 요소를 위해 예약되어 있습니다.</sub> <sub> <code>document</code> 처리기를 첨부했지만 (증명 목적으로) 가장 가까운 신뢰할 수있는 조상을 선택해야합니다.</sub>
ru: <sub>Примечание. Как правило, этот шаблон зарезервирован для элементов, которые не существовали во время загрузки <em>или</em> чтобы избежать подключения большого количества обработчиков.</sub> <sub>Также стоит отметить, что, хотя я прикрепил обработчик к <code>document</code> (в демонстрационных целях), вы должны выбрать ближайшего надежного предка.</sub>
zh_cn: <sub>注意：通常，此模式是为加载时不存在的元素保留的， <em>或者是</em>为了避免附加大量的处理程序。</sub> <sub>值得指出的是，虽然我已经为 <code>document</code> 附加了处理程序（出于说明目的），但您应该选择最近的可靠祖先。</sub>

source: <sub>Note: You could simply bind to <a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"><code>DOMContentLoaded</code></a> or <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> but each has its caveats. jQuery's <a href="http://api.jquery.com/ready/"><code>ready()</code></a> delivers a hybrid solution.</sub>
es: <sub>Nota: Simplemente puede vincularse a <a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a> o <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> </sub> <sub><a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a> pero cada uno tiene sus advertencias.</sub> <sub><a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> jQuery ofrece una soluci&oacute;n h&iacute;brida.</sub>
ja: <sub>注： <a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a>または <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> 単純にバインドできます。</sub> <sub><a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onloadです</a>が、それぞれに警告があります。</sub> <sub>jQueryの<a href="http://api.jquery.com/ready/"> <code>ready()</code> </a>は、ハイブリッドソリューションを提供します。</sub>
ko: <sub>참고 : <a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a> 또는 <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> 간단히 바인딩 할 수 있습니다.</sub> <sub><a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">온로드</a> 하지만 각각 경고가 있습니다.</sub> <sub>jQuery의 <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> 는 하이브리드 솔루션을 제공합니다.</sub>
ru: <sub>Примечание. Вы можете просто привязать <a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a> или <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> </sub> <sub>но у каждого есть свои предостережения.</sub> <sub>Функция jQuery's <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> предоставляет гибридное решение.</sub>
zh_cn: <sub>注意：您可以简单地绑定到<a href="https://developer.mozilla.org/en-US/docs/Web/Reference/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a>或 <code>window.<a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload</a></code> </sub> <sub><a href="https://developer.mozilla.org/en-US/docs/Web/API/window.onload?redirect=no">onload，</a>但每个都有其警告。</sub> <sub>jQuery的<a href="http://api.jquery.com/ready/"> <code>ready()</code> </a>提供了一种混合解决方案。</sub>

source: A standard DOM method returning <code>null</code> resulting in any of several errors:
es: Un m&eacute;todo DOM est&aacute;ndar que devuelve un <code>null</code> da como resultado cualquiera de varios errores:
ja: <code>null</code> を返す標準のDOMメソッドにより、いくつかのエラーが発生します。
ko: 몇 가지 오류가 발생하여 <code>null</code> 을 반환하는 표준 DOM 메서드 :
ru: Стандартный метод DOM, возвращающий <code>null</code> приводящий к любой из нескольких ошибок:
zh_cn: 标准DOM方法返回 <code>null</code> 会导致以下几种错误：

source: Again, though, it is most likely that the element you are looking for simply is not (yet) in the document, and you should do as Felix suggests. However, you should also be aware that that is increasingly not the only reason that an element might be unfindable (either temporarily or permanently).
es: De nuevo,sin embargo,lo más probable es que el elemento que buscas simplemente no esté (todavía)en el documento,y deberías hacer lo que Félix sugiere.Sin embargo,también debe ser consciente de que esa es cada vez más la razón por la que un elemento podría ser imposible de encontrar (ya sea de forma temporal o permanente).
ja: しかし、繰り返しになりますが、探している要素がドキュメント内に(まだ)存在しない可能性が高いので、フェリックスが提案しているようにする必要があります。しかし、要素が(一時的または恒久的に)検索不能になる理由は、それだけではないことにも注意しなければなりません。
ko: 다시 말하지만, 당신이 찾고있는 요소가 문서에 아직 (아직) 포함되어 있지 않을 가능성이 높으며 Felix가 제안한대로해야합니다. 그러나 이것이 요소를 찾을 수없는 (일시적으로 또는 영구적으로) 유일한 이유는 아니라는 점에 유의해야합니다.
ru: Опять же,скорее всего,элемента,который вы ищете,просто нет (пока)в документе,и вы должны сделать то,что предлагает Феликс.Однако,вы также должны знать,что это не единственная причина,по которой элемент может быть необнаруживаемым (временно или навсегда).
zh_cn: 不过,同样的,你要找的元素很可能根本就不在文档中,你应该按照Felix的建议去做。然而,你也应该知道,这并不是一个元素可能无法找到的唯一原因(暂时或永久)。

source: Alternatively you can also use the shorthand syntax:
es: También puedes usar la sintaxis abreviada:
ja: また、短縮構文を使用することもできます。
ko: 또는 속기 구문을 사용할 수도 있습니다.
ru: В качестве альтернативы вы также можете использовать синтаксис сокращений:
zh_cn: 另外,你也可以使用速记语法。

source: An added twist is when jQuery is not found because you have loaded the script without protocol and are running from file system:
es: Un giro añadido es cuando no se encuentra jQuery porque has cargado el script sin protocolo y estás corriendo desde el sistema de archivos:
ja: さらにひねりが加えられているのは、プロトコルなしでスクリプトをロードしてファイルシステムから実行しているためにjQueryが見つからない場合です。
ko: 프로토콜없이 스크립트를로드하고 파일 시스템에서 실행 중이므로 jQuery를 찾을 수없는 경우가 있습니다.
ru: Добавленный поворот-это когда jQuery не найден,потому что вы загрузили скрипт без протокола и запущены из файловой системы:
zh_cn: 一个额外的转折是当jQuery没有被发现时,因为你在没有协议的情况下加载了脚本,而且是从文件系统中运行的。

source: An element with the passed ID really does not exist in the document. You should double check that the ID you pass to <code>getElementById</code> really matches an ID of an existing element in the (generated) HTML and that you have not <em>misspelled</em> the ID (IDs are <em>case-sensitive</em>!).
es: Un elemento con la ID pasada realmente no existe en el documento. Debe verificar que la ID que pasa a <code>getElementById</code> realmente coincida con una ID de un elemento existente en el HTML (generado) y que no ha <em>escrito mal</em> la ID (&iexcl;las ID distinguen entre <em>may&uacute;sculas y min&uacute;sculas</em> !).
ja: 渡されたIDの要素は実際にはドキュメントに存在しません。 <code>getElementById</code> に渡すIDが（生成された）HTMLの既存の要素のIDと実際に一致し、IDの<em>スペルを間違え</em>ていないこと（IDでは<em>大文字と小文字が区別され</em>ます！）を再確認する必要があります。
ko: 전달 된 ID를 가진 요소가 문서에 실제로 존재하지 않습니다. <code>getElementById</code> 에 전달한 ID가 (생성 된) HTML에있는 기존 요소의 ID와 실제로 일치하는지, <em>철자를 잘못 입력</em> 하지 않았는지 다시 한 번 확인해야합니다 (ID는 <em>대소 문자를 구분합니다</em> !).
ru: Элемент с переданным идентификатором действительно не существует в документе. Вы должны дважды проверить, что идентификатор, который вы передаете <code>getElementById</code> , действительно совпадает с идентификатором существующего элемента в (сгенерированном) HTML, и что вы не <em>ошиблись</em> в идентификаторе (идентификаторы <em>чувствительны к регистру</em> !).
zh_cn: 具有传递的ID的元素确实在文档中不存在。 您应该仔细检查传递给 <code>getElementById</code> 的ID确实与（生成的）HTML中现有元素的ID匹配，并且您没有<em>拼错</em>该ID（ID <em>区分大小写</em> ！）。

source: Any other spelling or capitalization will not work. For example, <code>document.getElementByClassName</code> will throw an error.
es: Cualquier otra ortograf&iacute;a o capitalizaci&oacute;n no funcionar&aacute;. Por ejemplo, <code>document.getElementByClassName</code> arrojar&aacute; un error.
ja: その他のスペルや大文字は機能しません。 たとえば、 <code>document.getElementByClassName</code> はエラーをスローします。
ko: 다른 철자 나 대문자는 작동하지 않습니다. 예를 들어, <code>document.getElementByClassName</code> 은 오류를 발생시킵니다.
ru: Любое другое написание или заглавные буквы не будут работать. Например, <code>document.getElementByClassName</code> выдаст ошибку.
zh_cn: 任何其他拼写或大写字母均无效。 例如， <code>document.getElementByClassName</code> 将引发错误。

source: As @FelixKling pointed out, the most likely scenario is that the nodes you are looking for do not exist (yet).
es: Como @FelixKling señaló,el escenario más probable es que los nodos que estás buscando no existan (todavía).
ja: @FelixKlingさんが指摘しているように、最も可能性の高いシナリオは、探しているノードが(まだ)存在していないということです。
ko: @FelixKling이 지적했듯이 가장 가능성이 높은 시나리오는 찾고있는 노드가 존재하지 않는 것입니다 (아직).
ru: Как отметил @FelixKling,наиболее вероятным сценарием является то,что узлов,которые вы ищете,еще не существует (пока).
zh_cn: 正如@FelixKling所指出的,最可能的情况是你要找的节点不存在(还没有)。

source: As almost everything we do when using jQuery reads or manipulates the document object model (DOM), we need to make sure that we start adding events etc. as soon as the DOM is ready.
es: Como casi todo lo que hacemos cuando usamos jQuery lee o manipula el modelo de objeto de documento (DOM),tenemos que asegurarnos de que empezamos a añadir eventos etc.tan pronto como el DOM esté listo.
ja: jQueryを使用する際に行うほぼすべての作業は、ドキュメントオブジェクトモデル(DOM)を読み込んだり操作したりするため、DOMの準備が整い次第、イベントなどの追加を開始することを確認しておく必要があります。
ko: jQuery를 사용할 때 수행하는 거의 모든 것이 DOM (Document Object Model)을 읽거나 조작하므로 DOM이 준비 되 자마자 이벤트 등을 추가하기 시작해야합니다.
ru: Поскольку почти все,что мы делаем при использовании jQuery,читает или манипулирует объектной моделью документа (DOM),нам нужно убедиться,что мы начинаем добавлять события и т.д.,как только DOM готов.
zh_cn: 由于我们在使用jQuery时几乎所有的事情都会读取或操作文档对象模型(DOM),所以我们需要确保在DOM准备好后就开始添加事件等。

source: Before you make a call to <code>getElementById</code> (or any DOM method for that matter), make sure the elements you want to access exist, i.e. the DOM is loaded.
es: Antes de hacer una llamada a <code>getElementById</code> (o cualquier m&eacute;todo DOM para el caso), aseg&uacute;rese de que los elementos a los que desea acceder existan, es decir, que el DOM est&eacute; cargado.
ja: <code>getElementById</code> （またはそのためのDOMメソッド）を呼び出す前に、アクセスする要素が存在すること、つまりDOMがロードされていることを確認してください。
ko: <code>getElementById</code> (또는 해당 사안에 대한 DOM 메소드)를 호출하기 전에 액세스하려는 요소가 존재하는지 확인하십시오 (예 : DOM이로드 됨).
ru: Перед тем как сделать вызов <code>getElementById</code> (или любого другого метода DOM), убедитесь, что элементы, к которым вы хотите получить доступ, существуют, то есть загружен DOM.
zh_cn: 在调用 <code>getElementById</code> （或与此相关的任何DOM方法）之前，请确保要访问的元素存在，即，已加载DOM。

source: Both are equivalent.
es: Ambos son equivalentes.
ja: どちらも等価です。
ko: 둘 다 동일합니다.
ru: Оба эквивалентны.
zh_cn: 两者是等价的。

source: Capitalization and spelling <strong>does matter</strong> for all of the above. If the capitalization is different, or the spelling is different, the element will not be selected:
es: Las may&uacute;sculas y la ortograf&iacute;a son <strong>importantes</strong> para todo lo anterior. Si la capitalizaci&oacute;n es diferente, o la ortograf&iacute;a es diferente, el elemento no se seleccionar&aacute;:
ja: 大文字とスペル<strong>は</strong>上記のすべてに<strong>関係</strong>します。 大文字と小文字が異なる場合、またはスペルが異なる場合、要素は選択されません。
ko: 대문자와 철자 <strong>는</strong> 위의 모든 <strong>사항</strong> 에 <strong>중요</strong> 합니다. 대문자가 다르거 나 철자가 다른 경우 요소가 선택되지 않습니다.
ru: Капитализация и орфография <strong>имеет значение</strong> для всего вышеперечисленного. Если заглавная буква отличается или орфография отличается, элемент не будет выбран:
zh_cn: 大写和拼写对于上述所有内容均至关重要。 如果大小写不同或拼写不同，则不会选择该元素：

source: Consider the following example:
es: Considere el siguiente ejemplo:
ja: 次のような例を考えてみてください。
ko: 다음 예제를 고려하십시오.
ru: Рассмотрим следующий пример:
zh_cn: 请看下面的例子:

source: Consider the following markup; script #1 fails to find the <code>&lt;div&gt;</code> while script #2 succeeds:
es: Considere el siguiente marcado; el script # 1 no puede encontrar el <code>&lt;div&gt;</code> mientras que el script # 2 tiene &eacute;xito:
ja: 次のマークアップを検討してください。 スクリプト＃1は <code>&lt;div&gt;</code> を見つけることができませんが、スクリプト＃2は成功します。
ko: 다음 마크 업을 고려하십시오. 스크립트 # 1이 <code>&lt;div&gt;</code> 를 찾지 못하면 스크립트 # 2가 성공합니다.
ru: Рассмотрим следующую разметку; сценарий № 1 не может найти <code>&lt;div&gt;</code> ,в то время как сценарий № 2 завершается успешно:
zh_cn: 考虑以下标记； 脚本＃2成功执行后，脚本＃1找不到 <code>&lt;div&gt;</code> ：

source: Defer your script until the DOM has been completely parsed, using <a href="http://api.jquery.com/ready/"><code>ready()</code></a>:
es: Aplaza tu secuencia de comandos hasta que el DOM se haya analizado por completo, usando <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> :
ja: <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a>を使用して、DOMが完全に解析されるまでスクリプトを延期します。
ko: <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> 사용하여 DOM이 완전히 파싱 될 때까지 스크립트를 연기하십시오.
ru: Отложите ваш скрипт, пока DOM не будет полностью проанализирован, используя <a href="http://api.jquery.com/ready/"> <code>ready()</code> </a> :
zh_cn: 使用<a href="http://api.jquery.com/ready/"> <code>ready()</code> </a>将脚本推迟到DOM被完全解析为止：

source: Example problems include:
es: Algunos ejemplos de problemas incluyen:
ja: 問題例としては、以下のようなものがあります。
ko: 문제의 예는 다음과 같습니다.
ru: Примеры проблем включают в себя:
zh_cn: 例子问题包括:

source: Example using bootstrap:
es: Ejemplo usando bootstrap:
ja: ブートストラップを使った例。
ko: 부트 스트랩 사용 예 :
ru: Пример использования бутстрапа:
zh_cn: 使用bootstrap的例子。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段
