Repository: rueisnom/feedback
Catalog: xlf/14/02/89/59/14028959.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: [<code>defer</code>, a Boolean attribute,] is set to indicate to a browser that the script is meant to be executed after the document has been parsed, but before firing <a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"><code>DOMContentLoaded</code></a>.
es: [ <code>defer</code> , un atributo booleano,] est&aacute; configurado para indicar a un navegador que el script debe ejecutarse despu&eacute;s de analizar el documento, pero antes de disparar <a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a> .
ja: [ <code>defer</code> 、ブール属性]は、ドキュメントが解析された後、 <a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> を起動する</a>前にスクリプトが実行されることをブラウザに示すために設定されます。
ko: [ <code>defer</code> , Boolean attribute]는 문서가 파싱 된 후 <a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> 를</a> 실행하기 전에 스크립트가 실행되도록 브라우저에 표시하도록 설정됩니다.
ru: [ <code>defer</code> , логический атрибут] устанавливается, чтобы указать браузеру, что сценарий должен выполняться после анализа документа, но до <a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a> .
zh_cn: 设置[ <code>defer</code> ，布尔属性]，向浏览器指示脚本应在文档解析后但在触发<a href="https://developer.mozilla.org/en-US/docs/Web/Events/DOMContentLoaded"> <code>DOMContentLoaded</code> </a>之前执行。

source: in which case you can also put the code just before the closing body tag (<code>&lt;/body&gt;</code>) (all DOM elements will be available at the time the script is executed).
es: en cuyo caso tambi&eacute;n puede colocar el c&oacute;digo justo antes de la etiqueta del cuerpo de cierre ( <code>&lt;/body&gt;</code> ) (todos los elementos DOM estar&aacute;n disponibles en el momento en que se ejecute el script).
ja: この場合、コードをbodyの終了タグ（ <code>&lt;/body&gt;</code> ）の直前に配置することもできます（すべてのDOM要素は、スクリプトの実行時に使用できます）。
ko: 이 경우 닫는 body 태그 ( <code>&lt;/body&gt;</code> ) 바로 앞에 코드를 넣을 수도 있습니다 (스크립트가 실행될 때 모든 DOM 요소를 사용할 수 있음).
ru: в этом случае вы также можете поместить код непосредственно перед закрывающим тегом body ( <code>&lt;/body&gt;</code> ) (все элементы DOM будут доступны во время выполнения скрипта).
zh_cn: 在这种情况下，您也可以将代码放在结束body标签（ <code>&lt;/body&gt;</code> ）之前（在执行脚本时所有DOM元素都可用）。

source: jQuery "getter" methods (<code>.val()</code>, <code>.html()</code>, <code>.text()</code>) returning <code>undefined</code>
es: Los m&eacute;todos "getter" de jQuery ( <code>.val()</code> , <code>.html()</code> , <code>.text()</code> ) devuelven <code>undefined</code>
ja: jQuery "getter"メソッド（ <code>.val()</code> 、. <code>.html()</code> 、.text（））が <code>undefined</code> 返す
ko: jQuery "getter"메소드 ( <code>.val()</code> , <code>.html()</code> <code>.text()</code> )가 <code>undefined</code> 리턴 함
ru: jQuery методы "getter" ( <code>.val()</code> , <code>.html()</code> , <code>.text()</code> ) возвращают <code>undefined</code>
zh_cn: jQuery&ldquo; getter&rdquo;方法（ <code>.val()</code> ,. <code>.html()</code> ，.text <code>.text()</code> ）返回 <code>undefined</code>

source: jQuery silently failing to bind an event handler
es: jQuery silenciosamente fallando en atar a un manejador de eventos
ja: jQuery がイベントハンドラのバインドに静かに失敗する
ko: jQuery가 자동으로 이벤트 핸들러를 바인드하지 못함
ru: jQuery silently fails to bind a event handler
zh_cn: jQuery默默无声地绑定事件处理程序失败

source: jQuery's <a href="http://api.jquery.com/on/"><code>on()</code></a> performs that logic for us. We simply provide an event name, a selector for the desired descendant, and an event handler:
es: jQuery's <a href="http://api.jquery.com/on/"> <code>on()</code> </a> realiza esa l&oacute;gica para nosotros. Simplemente proporcionamos un nombre de evento, un selector para el descendiente deseado y un controlador de eventos:
ja: jQueryの<a href="http://api.jquery.com/on/"> <code>on()</code> </a>はそのロジックを実行します。 イベント名、目的の子孫のセレクター、およびイベントハンドラーを指定するだけです。
ko: jQuery의 <a href="http://api.jquery.com/on/"> <code>on()</code> </a> 은 우리를 위해 그 논리를 수행합니다. 이벤트 이름, 원하는 자손의 선택기 및 이벤트 핸들러를 제공합니다.
ru: Функция onQ <a href="http://api.jquery.com/on/"> <code>on()</code> </a> jQuery ) выполняет эту логику за нас. Мы просто предоставляем имя события, селектор для желаемого потомка и обработчик события:
zh_cn: jQuery的<a href="http://api.jquery.com/on/"> <code>on()</code> </a>为我们执行了该逻辑。 我们只需提供一个事件名称，所需后代的选择器和事件处理程序即可：

source: the problem is that the dom element 'speclist' is not created at the time the javascript code is getting executed. So I put the javascript code inside a function and called that function on body onload event.
es: el problema es que el elemento dom 'speclist' no se crea en el momento en que se ejecuta el código javascript.Así que puse el código javascript dentro de una función y llamé a esa función en el evento "body onload".
ja: 問題は、javascriptのコードが実行されているときにdom要素の'speclist'が作成されていないことです。そこで、javascriptのコードを関数の中に入れて、bodyのonloadイベントでその関数を呼び出しました。
ko: 문제는 자바 스크립트 코드가 실행될 때 dom 요소 'speclist'가 생성되지 않는다는 것입니다. 그래서 자바 스크립트 코드를 함수 안에 넣고 body onload 이벤트에서 해당 함수를 호출했습니다.
ru: Проблема в том,что в момент выполнения javascript-кода не создается dom-элемент 'speclist'.Поэтому я поместил javascript-код внутри функции и вызвал эту функцию по событию загрузки тела.
zh_cn: 问题是在执行javascript代码的时候没有创建dom元素'speclist'。所以我将javascript代码放在一个函数中,并在body onload事件中调用该函数。

source: this syntax is used to allow the script to load via HTTPS on a page with protocol https:// and to load the HTTP version on a page with protocol http://
es: esta sintaxis se utiliza para permitir que el script se cargue a través de HTTPS en una página con el protocolo https:/y para cargar la versión HTTP en una página con el protocolo http:/
ja: この構文は、プロトコル https:/のページでは HTTPS でスクリプトをロードし、プロトコル http:/のページでは HTTP バージョンをロードすることを可能にするために使用されます。
ko: 이 구문은 https : // 프로토콜이있는 페이지에서 스크립트가 HTTPS를 통해로드되고 http : // 프로토콜이있는 페이지에서 HTTP 버전을로드하는 데 사용됩니다.
ru: этот синтаксис используется для того,чтобы позволить скрипту загружать через HTTPS на странице с протоколом https:/и загружать версию HTTP на странице с протоколом http:/.
zh_cn: 该语法用于允许脚本通过HTTPS加载到协议为https:/的页面上,并在协议为http://的页面上加载HTTP版本。

source: use <code>div.parent &gt; span[data-username="bob"]</code>.
ja: <code>div.parent &gt; span[data-username="bob"]</code> ます。
ko: <code>div.parent &gt; span[data-username="bob"]</code> .
ru: используйте <code>div.parent &gt; span[data-username="bob"]</code> .
zh_cn: 使用 <code>div.parent &gt; span[data-username="bob"]</code> 。

source: use the query string <code>.foo.bar</code>. To select
es: use la cadena de consulta <code>.foo.bar</code> . Para seleccionar
ja: クエリ文字列 <code>.foo.bar</code> を使用します。 選ぶ
ko: 쿼리 문자열 <code>.foo.bar</code> 를 사용하십시오. 선택하려면
ru: используйте строку запроса <code>.foo.bar</code> . Выбирать
zh_cn: 使用查询字符串 <code>.foo.bar</code> 。 选择

source: use the query string <code>.foo[data-bar="someData"]</code>. To select the <code>&lt;span&gt;</code> below:
es: use la cadena de consulta <code>.foo[data-bar="someData"]</code> . Para seleccionar el <code>&lt;span&gt;</code> a continuaci&oacute;n:
ja: クエリ文字列 <code>.foo[data-bar="someData"]</code> 使用します。 以下の <code>&lt;span&gt;</code> を選択するには：
ko: 쿼리 문자열 <code>.foo[data-bar="someData"]</code> . 아래의 <code>&lt;span&gt;</code> 을 선택하려면 :
ru: используйте строку запроса <code>.foo[data-bar="someData"]</code> . Чтобы выбрать <code>&lt;span&gt;</code> ниже:
zh_cn: 使用查询字符串 <code>.foo[data-bar="someData"]</code> 。 要选择下面的 <code>&lt;span&gt;</code> ：
