Repository: rueisnom/feedback
Catalog: xlf/14/02/89/59/14028959.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: First make sure that jQuery is loaded properly. <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">Use the browser's developer tools</a> to find out whether the jQuery file was found and correct the URL if it wasn't (e.g. add the <code>http:</code> or <code>https:</code> scheme at the beginning, adjust the path, etc.)
es: Primero aseg&uacute;rese de que jQuery est&eacute; cargado correctamente. <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">Use las herramientas de desarrollo del navegador</a> para averiguar si se encontr&oacute; el archivo jQuery y corrija la URL si no fue as&iacute; (por ejemplo, agregue el esquema <code>http:</code> o <code>https:</code> al principio, ajuste la ruta, etc.)
ja: まず、jQueryが正しくロードされていることを確認します。 <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">ブラウザーの開発者ツール</a>を使用して 、jQueryファイルが見つかったかどうかを確認し、見つからなかった場合はURLを修正します（たとえば、最初に <code>http:</code> または <code>https:</code> スキームを追加する、パスを調整するなど）。
ko: 먼저 jQuery가 올바르게로드되었는지 확인하십시오. <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">브라우저의 개발자 도구</a> 를 사용하여 jQuery 파일을 찾았는지 확인하고없는 경우 URL을 수정하십시오 (예 <code>https:</code> 처음에 <code>http:</code> 또는 https : 체계 추가, 경로 조정 등).
ru: Сначала убедитесь, что jQuery загружен правильно. <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">Используйте инструменты разработчика браузера,</a> чтобы выяснить, был ли найден файл jQuery, и исправьте URL-адрес, если его нет (например, добавьте схему <code>http:</code> или <code>https:</code> в начале, измените путь и т. Д.)
zh_cn: 首先确保jQuery已正确加载。 <a href="http://www.netmagazine.com/tutorials/javascript-debugging-beginners">使用浏览器的开发人员工具</a>查找是否找到了jQuery文件，如果找不到，则更正URL（例如，在开头添加 <code>http:</code> 或 <code>https:</code> 方案，调整路径等）。

source: For elements coming from Ajax responses, use the <code>.bind()</code> method of jQuery. Older versions of jQuery had <code>.live()</code> for the same.
es: Para los elementos que provienen de las respuestas de Ajax, use el m&eacute;todo <code>.bind()</code> de jQuery. Las versiones anteriores de jQuery ten&iacute;an <code>.live()</code> para lo mismo.
ja: Ajax応答からの要素の場合、jQueryの <code>.bind()</code> メソッドを使用します。 以前のバージョンのjQueryには、同じ <code>.live()</code> がありました。
ko: Ajax 응답에서 오는 요소의 경우 jQuery의 <code>.bind()</code> 메소드를 사용하십시오. 이전 버전의 jQuery에는 <code>.live()</code> 가 있습니다.
ru: Для элементов, поступающих из ответов Ajax, используйте метод jQuery <code>.bind()</code> . Более старые версии jQuery имели <code>.live()</code> для того же самого.
zh_cn: 对于来自Ajax响应的元素，请使用jQuery的 <code>.bind()</code> 方法。 较旧版本的jQuery具有 <code>.live()</code> 相同。

source: For reference, here's the code from that <a href="https://gh-canon.github.io/misc-demos/log-test-click.js">external script</a>:
es: Como referencia, aqu&iacute; est&aacute; el c&oacute;digo de ese <a href="https://gh-canon.github.io/misc-demos/log-test-click.js">script externo</a> :
ja: 参考までに、ここにその<a href="https://gh-canon.github.io/misc-demos/log-test-click.js">外部スクリプトの</a>コードを示します 。
ko: 참고로 다음은 해당 <a href="https://gh-canon.github.io/misc-demos/log-test-click.js">외부 스크립트</a> 의 코드입니다.
ru: Для справки вот код из этого <a href="https://gh-canon.github.io/misc-demos/log-test-click.js">внешнего скрипта</a> :
zh_cn: 作为参考，这是该<a href="https://gh-canon.github.io/misc-demos/log-test-click.js">外部脚本</a>的代码：

source: However, modern development practices can often manipulate document elements outside of the document tree either with DocumentFragments or simply detaching/reattaching current elements directly. Such techniques may be used as part of JavaScript templating or to avoid excessive repaint/reflow operations while the elements in question are being heavily altered.
es: Sin embargo,las prácticas modernas de desarrollo a menudo pueden manipular los elementos de los documentos fuera del árbol de documentos,ya sea con DocumentFragments o simplemente separando directamente los elementos actuales.Esas técnicas pueden utilizarse como parte de la plantilla de JavaScript o para evitar operaciones excesivas de reflujo mientras los elementos en cuestión están siendo fuertemente alterados.
ja: しかし、最近の開発手法では、ドキュメントツリーの外側でドキュメント要素を操作するには、DocumentFragments を使用するか、または現在の要素を直接削除するだけでよいことがよくあります。このような技術は、JavaScript のテンプレートの一部として使用されたり、問題の要素が大きく変更されている間に過剰な repaintreflow 操作を避けるために使用されることがあります。
ko: 그러나 현대의 개발 관행은 종종 DocumentFragments를 사용하거나 현재 요소를 직접 분리 / 다시 연결하여 문서 트리 외부의 문서 요소를 조작 할 수 있습니다. 이러한 기술은 JavaScript 템플릿의 일부로 사용되거나 문제의 요소가 크게 변경되는 동안 과도한 다시 페인트 / 리플 로우 작업을 피하기 위해 사용될 수 있습니다.
ru: Однако современные методы разработки часто могут манипулировать элементами документа вне дерева документа либо с помощью DocumentFragmentents,либо просто отсоединяя текущие элементы напрямую.Такие методы могут использоваться как часть JavaScript-шаблонирования или для того,чтобы избежать излишних операций перерисовки в то время,когда элементы,о которых идет речь,сильно видоизменяются.
zh_cn: 然而,现代的开发实践往往可以用DocumentFragments或者干脆直接detachingreattaching当前元素,在文档树外操纵文档元素。这样的技术可以作为JavaScript模板化的一部分,或者在元素被大量修改时避免过度的repaintreflow操作。

source: If script execution order is not the issue, another possible cause of the problem is that the element is not being selected properly:
es: Si el problema no es el orden de ejecución del guión,otra posible causa del problema es que el elemento no está siendo seleccionado correctamente:
ja: スクリプトの実行順序が問題ではない場合、別の原因として考えられるのは、要素が適切に選択されていないことです。
ko: 스크립트 실행 순서가 문제가 아닌 경우 문제의 또 다른 원인은 요소가 올바르게 선택되지 않았기 때문입니다.
ru: Если порядок выполнения скрипта не является проблемой,то другой возможной причиной проблемы является неправильный выбор элемента:
zh_cn: 如果脚本执行顺序不是问题,另一个可能的原因是元素没有被正确选择。

source: If the element you are trying to access is inside an <code>iframe</code> and you try to access it outside the context of the <code>iframe</code> this will also cause it to fail.
es: Si el elemento al que intenta acceder est&aacute; dentro de un <code>iframe</code> e intenta acceder a &eacute;l fuera del contexto del <code>iframe</code> , esto tambi&eacute;n har&aacute; que falle.
ja: アクセスしようとしている要素が <code>iframe</code> 内にあり、 iframeのコンテキストの外でアクセスしようとすると、これも失敗します。
ko: 액세스하려는 요소가 <code>iframe</code> 내부에 있고 iframe 컨텍스트 외부에서 액세스하려고하면 실패 할 수도 있습니다.
ru: Если элемент, к которому вы пытаетесь получить доступ, находится внутри <code>iframe</code> , и вы пытаетесь получить к нему доступ вне контекста <code>iframe</code> , это также приведет к его отказу.
zh_cn: 如果您尝试访问的元素位于 <code>iframe</code> 内，而您尝试在 <code>iframe</code> 的上下文之外访问它，这也会导致其失败。

source: If you want to get an element in an iframe you can find out how <a href="https://stackoverflow.com/a/1088569/1435985">here</a>.
es: Si desea obtener un elemento en un iframe, puede averiguar c&oacute;mo hacerlo <a href="https://stackoverflow.com/a/1088569/1435985">aqu&iacute;</a> .
ja: iframeで要素を取得する場合は、 <a href="https://stackoverflow.com/a/1088569/1435985">ここで</a>方法を確認できます。
ko: iframe에서 요소를 얻으려면 <a href="https://stackoverflow.com/a/1088569/1435985">여기</a> 에서 방법을 찾을 수 있습니다 .
ru: Если вы хотите получить элемент в iframe, вы можете узнать, как <a href="https://stackoverflow.com/a/1088569/1435985">здесь</a> .
zh_cn: 如果要在iframe中获取元素，可以<a href="https://stackoverflow.com/a/1088569/1435985">在这里</a>找到方法。

source: In fact, the <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">jQuery tutorial</a> explicitly states:
es: De hecho, el <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">tutorial jQuery</a> declara expl&iacute;citamente:
ja: 実際、 <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">jQueryチュートリアルでは</a>明示的に次のように述べています。
ko: 실제로 <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">jQuery 튜토리얼</a> 은 다음과 같이 명시 적으로 설명합니다.
ru: На самом деле, <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">учебник</a> по jQuery прямо заявляет:
zh_cn: 实际上， <a href="http://docs.jquery.com/Tutorials:Getting_Started_with_jQuery">jQuery教程</a>明确指出：

source: Incidentally, in the <a href="http://caniuse.com/queryselector">majority of contemporary browsers</a>, which implement <code>querySelector()</code> and <code>querySelectorAll()</code> methods, CSS-style notation is used to retrieve an element by its <code>id</code>, for example: <code>document.querySelector('#elementID')</code>, as opposed to the method by which an element is retrieved by its <code>id</code> under <code>document.getElementById('elementID')</code>; in the first the <code>#</code> character is essential, in the second it would lead to the element not being retrieved.
es: Por cierto, en la <a href="http://caniuse.com/queryselector">mayor&iacute;a de los navegadores contempor&aacute;neos</a> , que implementan los <code>querySelector()</code> y <code>querySelectorAll()</code> , la notaci&oacute;n de estilo CSS se utiliza para recuperar un elemento por su <code>id</code> , por ejemplo: <code>document.querySelector('#elementID')</code> , en lugar de el m&eacute;todo por el cual un elemento es recuperado por su <code>id</code> bajo <code>document.getElementById('elementID')</code> ; en el primero, el car&aacute;cter <code>#</code> es esencial, en el segundo llevar&iacute;a a que el elemento no se recupere.
ja: ちなみに、 <code>querySelectorAll()</code> メソッドとquerySelectorAll（）メソッドを実装する<a href="http://caniuse.com/queryselector">現代のブラウザ</a>の大部分では 、CSSスタイルの表記を使用して、 <code>id</code> で要素を取得しています。例： <code>document.querySelector('#elementID')</code> <code>document.getElementById('elementID')</code> の下の <code>id</code> によって要素が取得されるメソッド。 最初の文字は <code>#</code> 文字が必須で、2番目の文字は要素が取得されない原因になります。
ko: 또한 <code>querySelector()</code> 및 <code>querySelectorAll()</code> 메소드를 구현하는 <a href="http://caniuse.com/queryselector">대부분의 최신 브라우저</a> 에서 CSS 스타일 표기법은 <code>id</code> 로 요소를 검색하는 데 사용됩니다 <code>document.querySelector('#elementID')</code> 예 : document.querySelector ( '# elementID')) . <code>document.getElementById('elementID')</code> 아래의 <code>id</code> 로 요소를 검색하는 방법; 첫 번째에서 <code>#</code> 문자는 필수적이며 두 번째에서 요소는 검색되지 않습니다.
ru: Между прочим, в <a href="http://caniuse.com/queryselector">большинстве современных браузеров</a> , которые реализуют методы <code>querySelector()</code> и <code>querySelectorAll()</code> , нотация в стиле CSS используется для извлечения элемента по его <code>id</code> , например: <code>document.querySelector('#elementID')</code> , в отличие от метод, с помощью которого элемент извлекается по его <code>id</code> в <code>document.getElementById('elementID')</code> ; в первом символ <code>#</code> важен, во втором это приведет к тому, что элемент не будет извлечен.
zh_cn: 顺便说一下，在<a href="http://caniuse.com/queryselector">大多数</a>实现了 <code>querySelector()</code> 和 <code>querySelectorAll()</code> 方法的现代浏览器中 ，CSS样式表示法用于通过其 <code>id</code> 检索元素，例如： <code>document.querySelector('#elementID')</code> ，而不是在 <code>document.getElementById('elementID')</code> 下通过其 <code>id</code> 检索元素的方法； 在第一个中， <code>#</code> 字符是必不可少的，在第二个中，这将导致无法检索该元素。

source: It has the unfortunate side effect of attempting and failing to load <code>file://somecdn.somewhere.com...</code>
es: Tiene el desafortunado efecto secundario de intentar y no cargar el <code>file://somecdn.somewhere.com...</code>
ja: <code>file://somecdn.somewhere.com...</code> をロードしようとして失敗するという残念な副作用があります。
ko: <code>file://somecdn.somewhere.com...</code> 로드 시도 실패의 불행한 부작용이 있습니다 ...
ru: Это неудачный побочный эффект при попытке загрузить <code>file://somecdn.somewhere.com...</code>
zh_cn: 它具有尝试失败并无法加载 <code>file://somecdn.somewhere.com...</code> 的不幸副作用...

source: Listening to the <code>load</code>/<code>DOMContentLoaded</code> events is exactly what jQuery is doing with <a href="http://api.jquery.com/ready/"><code>.ready()</code> <em><sup>[docs]</sup></em></a>. All your jQuery code that affects DOM element should be inside that event handler.
es: Escuchar los eventos <code>load</code> / <code>DOMContentLoaded</code> es exactamente lo que jQuery est&aacute; haciendo con <a href="http://api.jquery.com/ready/"> <code>.ready()</code> <em><sup>[docs]</sup></em></a> . Todo el c&oacute;digo jQuery que afecta al elemento DOM debe estar dentro de ese controlador de eventos.
ja: <code>load</code> / <code>DOMContentLoaded</code> イベントをリッスンすることは、jQueryが<a href="http://api.jquery.com/ready/"> <code>.ready()</code> <em><sup>[ドキュメント]で</sup></em></a>行っていることとまったく同じです。 DOM要素に影響を与えるすべてのjQueryコードは、そのイベントハンドラー内にある必要があります。
ko: <code>load</code> / <code>DOMContentLoaded</code> 이벤트를 듣는 것은 jQuery가 <a href="http://api.jquery.com/ready/"> <code>.ready()</code> <em><sup>[docs]를 사용</sup></em></a> 하여 수행하는 것과 정확히 같습니다. DOM 요소에 영향을 미치는 모든 jQuery 코드는 해당 이벤트 핸들러 내에 있어야합니다.
ru: Прослушивание событий <code>load</code> / <code>DOMContentLoaded</code> - это именно то, что jQuery делает с <a href="http://api.jquery.com/ready/"> <code>.ready()</code> <em><sup>[docs]</sup></em></a> . Весь ваш код jQuery, который влияет на элемент DOM, должен быть внутри этого обработчика событий.
zh_cn: 监听 <code>load</code> / <code>DOMContentLoaded</code> 事件正是jQuery使用<a href="http://api.jquery.com/ready/"> <code>.ready()</code> <em><sup>[docs]</sup></em></a>所做的。 您所有影响DOM元素的jQuery代码都应在该事件处理程序内。

source: Make sure you pass a string to these selector methods. If you pass something that isn't a string to <code>querySelector</code>, <code>getElementById</code>, etc, it almost certainly won't work.
es: Aseg&uacute;rese de pasar una cadena a estos m&eacute;todos de selecci&oacute;n. Si pasa algo que no es una cadena a <code>querySelector</code> , <code>getElementById</code> , etc., es casi seguro que no funcionar&aacute;.
ja: これらのセレクターメソッドに文字列を渡すようにしてください。 文字列ではないものを <code>querySelector</code> 、 <code>getElementById</code> などに渡すと 、ほぼ確実に機能しません。
ko: 이 선택기 메소드에 문자열을 전달하십시오. <code>querySelector</code> , <code>getElementById</code> 등에 문자열이 아닌 것을 전달하면 거의 작동하지 않습니다.
ru: Убедитесь, что вы передали строку этим методам селектора. Если вы передадите что-то, что не является строкой, в <code>querySelector</code> , <code>getElementById</code> и т. Д., Это почти наверняка не сработает.
zh_cn: 确保将字符串传递给这些选择器方法。 如果您将不是字符串的内容传递给 <code>querySelector</code> ， <code>getElementById</code> 等，则几乎可以肯定不会起作用。

source: More than one element with the same id is present which is causing a conflict.
es: Más de un elemento con el mismo id está presente lo que está causando un conflicto.
ja: 同じidを持つ複数の要素が存在し、競合の原因となっています。
ko: 동일한 ID를 가진 둘 이상의 요소가 존재하여 충돌을 일으 킵니다.
ru: Присутствует не один элемент с одним и тем же идентификатором,который вызывает конфликт.
zh_cn: 存在一个以上具有相同ID的元素,导致冲突。

source: Move your script further down the page, just before the closing body tag. Organized in this fashion, the rest of the document is parsed before your script is executed:
es: Mueva su guión más abajo en la página,justo antes de la etiqueta de cierre del cuerpo.Organizado de esta manera,el resto del documento es analizado antes de que tu guión sea ejecutado:
ja: スクリプトをページの下の方に移動させます。このように整理することで、スクリプトを実行する前にドキュメントの残りの部分が解析されます。
ko: 닫는 body 태그 바로 앞에 스크립트를 페이지 아래로 이동하십시오. 이 방식으로 구성하면 스크립트가 실행되기 전에 문서의 나머지 부분이 구문 분석됩니다.
ru: Передвиньте свой скрипт дальше по странице,прямо перед закрывающим тегом тела.Организованный таким образом,остальная часть документа анализируется перед выполнением вашего скрипта:
zh_cn: 把你的脚本移到页面的下边,就在关闭的body标签之前。以这种方式组织,在你的脚本执行之前,文档的其他部分会被解析。

source: My solution was to not use the id of an anchor element: <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code>. Apparently blazor and other spa frameworks have issues jumping to anchors on the same page. To get around that I had to use <code>document.getElementById('star_wars')</code>. However this didn't work until I put the id in a paragraph element instead: <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code>.
es: Mi soluci&oacute;n fue no usar la identificaci&oacute;n de un elemento de anclaje: <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code> . Aparentemente, Blazor y otros marcos de spa tienen problemas para saltar a los anclajes en la misma p&aacute;gina. Para evitar eso tuve que usar <code>document.getElementById('star_wars')</code> . Sin embargo, esto no funcion&oacute; hasta que puse el id en un elemento de p&aacute;rrafo: <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code> .
ja: 私の解決策は、アンカー要素のIDを使用しないことでした： <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code> 。 どうやらブレイザーと他のスパフレームワークは同じページのアンカーにジャンプする問題を持っています。 これを回避するには、 <code>document.getElementById('star_wars')</code> を使用する必要がありました。 ただし、代わりに段落要素にIDを入れるまで、これは機能しませんでした： <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code> 。
ko: 내 솔루션은 앵커 요소의 ID를 사용하지 않는 것입니다 : <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code> . 분명히 블레이저와 다른 스파 프레임 워크는 같은 페이지의 앵커로 점프하는 데 문제가 있습니다. 그 문제를 해결하려면 <code>document.getElementById('star_wars')</code> 을 사용해야했습니다. 그러나 <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code> 과 같이 단락 요소에 ID를 넣을 때까지 작동하지 않았습니다.
ru: Моим решением было не использовать идентификатор элемента привязки: <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code> . Видимо, у блейзоров и других фреймворков спа есть проблемы с переходом на якоря на той же странице. Чтобы обойти это, я должен был использовать <code>document.getElementById('star_wars')</code> . Однако это не сработало, пока я не поместил идентификатор в элемент абзаца: <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code> .
zh_cn: 我的解决方案是不使用锚元素的ID： <code>&lt;a id='star_wars'&gt;Place to jump to&lt;/a&gt;</code> 。 显然，blazor和其他spa框架的问题跳到了同一页面上。 为了解决这个问题，我必须使用 <code>document.getElementById('star_wars')</code> 。 但是，直到我将id放入段落元素中，该方法才起作用： <code>&lt;p id='star_wars'&gt;Some paragraph&lt;p&gt;</code> 。

source: Option 1: Move your script
es: Opción 1:Mueve tu guión
ja: オプション 1:スクリプトを移動する
ko: 옵션 1 : 스크립트 이동
ru: Вариант 1:Переместить ваш сценарий
zh_cn: 选项1:移动你的脚本

source: Option 2: jQuery's <code>ready()</code>
es: Opci&oacute;n 2: jQuery's <code>ready()</code>
ja: オプション2：jQueryの <code>ready()</code>
ko: 옵션 2 : jQuery의 <code>ready()</code>
ru: Вариант 2: JQuery <code>ready()</code>
zh_cn: 选项2：jQuery的 <code>ready()</code>

source: Option 3: Event Delegation
es: Opción 3:Delegación de eventos
ja: オプション3:イベントの委任
ko: 옵션 3 : 이벤트 위임
ru: Вариант 3:Делегирование мероприятий
zh_cn: 方案3:活动授权

source: Option 4: The <code>defer</code> attribute
es: Opci&oacute;n 4: el atributo de <code>defer</code>
ja: オプション4： <code>defer</code> 属性
ko: 옵션 4 : <code>defer</code> 속성
ru: Вариант 4: атрибут <code>defer</code>
zh_cn: 选项4： <code>defer</code> 属性

source: Other solutions include listening to the <a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"><code>load</code> <em><sup>[MDN]</sup></em></a> or <a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"><code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a> events. In these cases it does not matter where in the document you place the JavaScript code, you just have to remember to put all DOM processing code in the event handlers.
es: Otras soluciones incluyen escuchar los eventos de <a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"> <code>load</code> <em><sup>[MDN]</sup></em></a> o <a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"> <code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a> . En estos casos, no importa en qu&eacute; parte del documento coloque el c&oacute;digo JavaScript, solo debe recordar colocar todo el c&oacute;digo de procesamiento DOM en los controladores de eventos.
ja: 他のソリューションには、 <a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"> <code>load</code> <em><sup>[MDN]</sup></em></a>または<a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"> <code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a>イベントのリスニングが含まれます。 これらの場合、ドキュメントのどこにJavaScriptコードを配置するかは重要ではありません。すべてのDOM処理コードをイベントハンドラーに配置することを忘れないでください。
ko: 다른 솔루션으로는 <a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"> <code>load</code> <em><sup>[MDN]</sup></em></a> 또는 <a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"> <code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a> 이벤트 청취가 있습니다. 이 경우 문서에서 JavaScript 코드를 배치하는 위치는 중요하지 않으며 모든 DOM 처리 코드를 이벤트 핸들러에 배치해야합니다.
ru: Другие решения включают прослушивание событий <a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"> <code>load</code> <em><sup>[MDN]</sup></em></a> или <a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"> <code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a> . В этих случаях не имеет значения, где в документе вы размещаете код JavaScript, вы просто должны помнить, чтобы поместить весь код обработки DOM в обработчики событий.
zh_cn: 其他解决方案包括侦听<a href="https://developer.mozilla.org/en-US/docs/DOM/window.onload"> <code>load</code> <em><sup>[MDN]</sup></em></a>或<a href="https://developer.mozilla.org/en-US/docs/Mozilla_event_reference/DOMContentLoaded_%28event%29"> <code>DOMContentLoaded</code> <em><sup>[MDN]</sup></em></a>事件。 在这些情况下，将JavaScript代码放在文档中的位置并不重要，您只需要记住将所有DOM处理代码放在事件处理程序中即可。

source: Please see the <a href="http://www.quirksmode.org/js/introevents.html">articles at quirksmode.org</a> for more information regarding event handling and browser differences.
es: Consulte los <a href="http://www.quirksmode.org/js/introevents.html">art&iacute;culos en quirksmode.org</a> para obtener m&aacute;s informaci&oacute;n sobre el manejo de eventos y las diferencias del navegador.
ja: イベント処理とブラウザの違いに関する詳細については<a href="http://www.quirksmode.org/js/introevents.html">、quirksmode.org</a>の記事を参照してください。
ko: 이벤트 처리 및 브라우저 차이점에 대한 자세한 내용은 <a href="http://www.quirksmode.org/js/introevents.html">quirksmode.org</a> 의 기사를 참조하십시오.
ru: Пожалуйста, смотрите <a href="http://www.quirksmode.org/js/introevents.html">статьи на quirksmode.org</a> для получения дополнительной информации об обработке событий и различиях в браузерах.
zh_cn: 有关事件处理和浏览器差异的更多信息，请参见<a href="http://www.quirksmode.org/js/introevents.html">quirksmode.org上</a>的文章 。

source: Similarly, for <code>getElementsByClassName</code>, don't prefix the passed string with a <code>.</code>:
es: Del mismo modo, para <code>getElementsByClassName</code> , no prefije la cadena pasada con a <code>.</code> :
ja: 同様に、 <code>getElementsByClassName</code> の場合、渡された文字列の前にを付けないでください <code>.</code> ：
ko: 마찬가지로 <code>getElementsByClassName</code> 의 경우 전달 된 문자열 앞에 접두사를 붙이지 마십시오 <code>.</code> :
ru: Аналогично, для <code>getElementsByClassName</code> не добавляйте переданную строку с префиксом <code>.</code> :
zh_cn: 同样，对于 <code>getElementsByClassName</code> ，不要在传递的字符串前添加前缀 <code>.</code> ：
