Repository: rueisnom/feedback
Catalog: xlf/14/02/89/59/14028959.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Similarly, the new "Shadow DOM" functionality being rolled out across modern browsers allows elements to be part of the document, but not query-able by document.getElementById and all of its sibling methods (querySelector, etc.). This is done to encapsulate functionality and specifically hide it.
es: De manera similar,la nueva funcionalidad "Shadow DOM" que se está desplegando en los navegadores modernos permite que los elementos formen parte del documento,pero no se puedan consultar por document.getElementById y todos sus métodos hermanos (querySelector,etc.).Esto se hace para encapsular la funcionalidad y ocultarla específicamente.
ja: 同様に、最新のブラウザで展開されている新しい "Shadow DOM "機能では、要素はドキュメントの一部でありながら、document.getElementByIdやその兄弟メソッド(querySelectorなど)では問い合わせができないようになっています。これは機能をカプセル化し、特に非表示にするために行われています。
ko: 마찬가지로 최신 브라우저에서 롤아웃되는 새로운 "Shadow DOM"기능을 사용하면 요소를 문서의 일부로 만들 수 있지만 document.getElementById 및 모든 형제 메서드 (querySelector 등)에서 쿼리 할 수는 없습니다. 이것은 기능을 캡슐화하고 구체적으로 숨기려고 수행됩니다.
ru: Аналогично,новая функциональность "Shadow DOM",распространяемая в современных браузерах,позволяет элементам быть частью документа,но не запрашиваться Document.getElementById и всеми его родственными методами (querySelector и т.д.).Это сделано для того,чтобы инкапсулировать функциональность и специально скрыть ее.
zh_cn: 同样的,新的 "影子DOM "功能也在现代浏览器中推出,它允许元素成为文档的一部分,但不能通过document.getElementById和它的所有同类方法(querySelector等)查询。这样做是为了封装功能并特别隐藏它。

source: So, what should you do? You've got a few options:
es: Entonces,¿qué deberías hacer? Tienes algunas opciones:
ja: では、どうすればいいのでしょうか?選択肢はいくつかあります。
ko: 그래서 어떻게해야합니까? 몇 가지 옵션이 있습니다.
ru: Так что же тебе делать? У тебя есть несколько вариантов:
zh_cn: 那么,你应该怎么做?你有几个选择。

source: The <code>div</code> appears <em>after</em> the <code>script</code>. At the moment the script is executed, the element does not exist <em>yet</em> and <code>getElementById</code> will return <code>null</code>.
es: El <code>div</code> aparece <em>despu&eacute;s</em> del <code>script</code> . En el momento en que se ejecuta el script, el elemento a&uacute;n no existe y <code>getElementById</code> devolver&aacute; <code>null</code> .
ja: <code>script</code> <em>後に</em> <code>div</code> が表示さ<em>れ</em> ます 。 スクリプトが実行された時点では、要素はまだ存在せ<em>ず</em> 、 <code>getElementById</code> は <code>null</code> を返します 。
ko: <code>script</code> <em>뒤에</em> <code>div</code> 가 나타납니다. 스크립트가 실행되는 시점에 요소는 <em>아직</em> 존재하지 않으며 <code>getElementById</code> 는 <code>null</code> 을 리턴 합니다.
ru: <code>div</code> появляется <em>после</em> <code>script</code> . В настоящий момент скрипт выполняется, элемент еще не существует, и <code>getElementById</code> вернет значение <code>null</code> .
zh_cn: <code>div</code> 出现<em>在</em> <code>script</code> 。 在执行脚本的那一刻，该元素尚不存在<em>，</em>并且 <code>getElementById</code> 将返回 <code>null</code> 。

source: The element does not exist <em>at the moment</em> you call <code>getElementById</code>.
es: El elemento no existe <em>en el momento en</em> que llama a <code>getElementById</code> .
ja: <code>getElementById</code> を呼び出し<em>た時点では、</em>要素は存在<em>し</em>ません。
ko: <code>getElementById</code> 를 호출 <em>하는 시점에</em> 요소가 없습니다.
ru: Элемент не существует <em>в тот момент, когда</em> вы вызываете <code>getElementById</code> .
zh_cn: 调用 <code>getElementById</code> <em>时，</em>该元素不存在。

source: The element exists, but it is not registered in DOM [in case of HTML nodes appended dynamically from Ajax responses].
es: El elemento existe,pero no está registrado en DOM [en el caso de nodos HTML añadidos dinámicamente a partir de respuestas de Ajax].
ja: 要素は存在するが、DOMには登録されていない[Ajax レスポンスから動的に HTML ノードが付加される場合]。
ko: 요소가 존재하지만 DOM에 등록되지 않았습니다 [Ajax 응답에서 동적으로 추가 된 HTML 노드의 경우].
ru: Элемент существует,но он не зарегистрирован в DOM [в случае HTML-узлов,динамически добавляемых из ответов Ajax].
zh_cn: 该元素存在,但没有在DOM中注册[在Ajax响应动态添加HTML节点的情况下]。

source: The element you were trying to find wasn&rsquo;t in the <a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM</a> when your script ran.
es: El elemento que intentaba encontrar no estaba en el <a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM</a> cuando se ejecut&oacute; su script.
ja: スクリプトを実行したときに、探していた要素が<a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM</a>にありませんでした。
ko: 스크립트를 실행할 때 찾으려는 요소가 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM</a> 에 없었습니다.
ru: Элемент, который вы пытались найти, отсутствовал в <a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM,</a> когда выполнялся ваш скрипт.
zh_cn: 运行脚本时，您要查找的元素不在<a href="https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model">DOM中</a> 。

source: The element/DOM with id specified doesn't exist yet.
es: El elementoDOM con id especificado no existe todavía.
ja: idを指定した要素DOMはまだ存在しません。
ko: ID가 지정된 요소 / DOM이 아직 존재하지 않습니다.
ru: ЭлементDOM с указанным id еще не существует.
zh_cn: 指定的id的元素DOM还不存在。

source: The latter case is quite common. Browsers parse and process the HTML from top to bottom. That means that any call to a DOM element which occurs before that DOM element appears in the HTML, will fail.
es: Este último caso es bastante común.Los navegadores analizan y procesan el HTML de arriba a abajo.Eso significa que cualquier llamada a un elemento DOM que ocurra antes de que ese elemento DOM aparezca en el HTML,fallará.
ja: 後者のケースはよくあります。ブラウザは HTML を上から下に向かってパースして処理します。つまり、HTML に DOM 要素が現れる前に DOM 要素を呼び出すと失敗するということです。
ko: 후자의 경우는 매우 일반적입니다. 브라우저는 HTML을 위에서 아래로 구문 분석하고 처리합니다. 즉, DOM 요소가 HTML에 나타나기 전에 발생하는 DOM 요소에 대한 호출은 실패합니다.
ru: Последний случай довольно распространен.Браузеры разбирают и обрабатывают HTML сверху вниз.Это означает,что любой вызов DOM-элемента,который произойдет до того,как этот DOM-элемент появится в HTML,будет неудачным.
zh_cn: 后一种情况很常见。浏览器会从上到下解析和处理HTML。这意味着,在HTML中出现DOM元素之前,任何对DOM元素的调用都会失败。

source: The most common forms are:
es: Las formas más comunes son:
ja: 最も一般的な形態は以下の通りです。
ko: 가장 일반적인 형태는 다음과 같습니다.
ru: Наиболее распространенные формы:
zh_cn: 最常见的形式有:

source: The position of your DOM-reliant script can have a profound effect upon its behavior. Browsers parse HTML documents from top to bottom. Elements are added to the DOM and scripts are (generally) executed as they're encountered. <strong>This means that order matters.</strong> Typically, scripts can't find elements which appear later in the markup because those elements have yet to be added to the DOM.
es: La posici&oacute;n de su script dependiente de DOM puede tener un profundo efecto sobre su comportamiento. Los navegadores analizan los documentos HTML de arriba a abajo. Los elementos se agregan al DOM y los scripts se ejecutan (generalmente) a medida que se encuentran. <strong>Esto significa que el orden importa.</strong> Por lo general, los scripts no pueden encontrar elementos que aparecen m&aacute;s adelante en el marcado porque esos elementos a&uacute;n no se han agregado al DOM.
ja: DOMに依存するスクリプトの位置は、その動作に大きな影響を与える可能性があります。 ブラウザはHTMLドキュメントを上から下に解析します。 要素はDOMに追加され、スクリプトは（一般的に）遭遇したときに実行されます。 <strong>これは、順序が重要であることを意味します。</strong> 通常、スクリプトはマークアップの後半に表示される要素を見つけることができません。これらの要素はDOMにまだ追加されていないためです。
ko: DOM 의존 스크립트의 위치는 동작에 큰 영향을 줄 수 있습니다. 브라우저는 HTML 문서를 위에서 아래로 구문 분석합니다. 요소가 DOM에 추가되고 스크립트는 일반적으로 발생하는대로 실행됩니다. <strong>이것은 순서가 중요하다는 것을 의미합니다.</strong> 일반적으로 스크립트는 마크 업에서 나중에 표시되는 요소를 찾을 수 없습니다. 이러한 요소는 아직 DOM에 추가되지 않았기 때문입니다.
ru: Положение вашего DOM-зависимого скрипта может сильно повлиять на его поведение. Браузеры анализируют HTML-документы сверху вниз. Элементы добавляются в DOM, и сценарии (как правило) выполняются по мере их появления. <strong>Это означает, что порядок имеет значение.</strong> Как правило, сценарии не могут найти элементы, которые появляются позже в разметке, поскольку эти элементы еще не добавлены в DOM.
zh_cn: 依赖DOM的脚本的位置可能对其行为产生深远的影响。 浏览器从上到下解析HTML文档。 元素被添加到DOM中，并且脚本（通常）在遇到时执行。 <strong>这意味着顺序很重要。</strong> 通常，脚本无法找到出现在标记后面的元素，因为这些元素尚未添加到DOM中。

source: The rules here are, in most cases, identical to those for CSS selectors, and can be seen in detail <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">here</a>.
es: Las reglas aqu&iacute; son, en la mayor&iacute;a de los casos, id&eacute;nticas a las de los selectores CSS, y se pueden ver en detalle <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">aqu&iacute;</a> .
ja: ここのルールは、ほとんどの場合、CSSセレクターのルールと同じであり、 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">ここ</a>で詳細を確認できます 。
ko: 여기의 규칙은 대부분 CSS 선택기의 규칙과 동일하며 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">여기</a> 에서 자세히 볼 수 있습니다.
ru: Правила здесь, в большинстве случаев, идентичны правилам для селекторов CSS, и их можно подробно увидеть <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">здесь</a> .
zh_cn: 在大多数情况下，此处的规则与CSS选择器的规则相同，请在<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Selectors">此处</a>详细查看 。

source: The same applies to all selectors with jQuery. jQuery won't find elements if you <em>misspelled</em> your selector or you are trying to select them <em>before they actually exist</em>.
es: Lo mismo se aplica a todos los selectores con jQuery. jQuery no encontrar&aacute; elementos si ha <em>escrito mal</em> su selector o est&aacute; intentando seleccionarlos <em>antes de que realmente existan</em> .
ja: jQueryを使用するすべてのセレクターにも同じことが当てはまります。 セレクターの<em>スペル</em>を<em>間違え</em>たり<em>、実際に存在</em>する<em>前にそれら</em>を選択しようとしたりすると、jQueryは要素を見つけられません。
ko: jQuery를 사용하는 모든 선택기에 동일하게 적용됩니다. 선택기의 <em>철자가 틀리</em> 거나 <em>실제로 존재하기 전에</em> 선택하려고하면 jQuery가 요소를 찾지 <em>않습니다</em> .
ru: То же самое относится ко всем селекторам с jQuery. jQuery не найдет элементы, если вы <em>неправильно написали</em> свой селектор или пытаетесь выбрать их <em>до того, как они реально появятся</em> .
zh_cn: 这同样适用于所有使用jQuery的选择器。 如果您<em>拼写</em>了选择器<em>拼写错误</em>或试图<em>在它们实际存在之前</em>对其进行选择，jQuery将无法找到<em>它们</em> 。

source: There are two reasons why an element might not exist:
es: Hay dos razones por las que un elemento podría no existir:
ja: 要素が存在しないかもしれない理由は2つあります。
ko: 요소가 존재하지 않는 데는 두 가지 이유가 있습니다.
ru: Есть две причины,по которым элемент может не существовать:
zh_cn: 有两个原因,一个元素可能不存在。

source: This can be ensured by simply putting your JavaScript <em>after</em> the corresponding DOM element
es: Esto se puede garantizar simplemente colocando su JavaScript <em>despu&eacute;s</em> del elemento DOM correspondiente
ja: これは、対応するDOM要素の<em>後</em>にJavaScriptを置くだけで確実にできます。
ko: 이는 해당 DOM 요소 다음에 JavaScript를두기 만하면 보장 할 수 있습니다.
ru: Это можно сделать, просто поместив свой JavaScript <em>после</em> соответствующего элемента DOM
zh_cn: 只需将JavaScript放在相应的DOM元素<em>之后</em> ，就可以确保这一点

source: To do this, we register a ready event for the document.
es: Para ello,registramos un evento listo para el documento.
ja: そのために、文書の準備ができたイベントを登録します。
ko: 이를 위해 문서에 대한 준비된 이벤트를 등록합니다.
ru: Для этого мы регистрируем готовое событие для документа.
zh_cn: 为了做到这一点,我们为文档注册一个准备好的事件。

source: To match an element which has two or more attributes (like two class names, or a class name and a <code>data-</code> attribute), put the selectors for each attribute next to each other in the selector string, <em>without</em> a space separating them (because a space indicates the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">descendant selector</a>). For example, to select:
es: Para hacer coincidir un elemento que tiene dos o m&aacute;s atributos (como dos nombres de clase, o un nombre de clase y un atributo de <code>data-</code> ), coloque los selectores para cada atributo uno al lado del otro en la cadena de selecci&oacute;n, <em>sin</em> un espacio que los separe (porque un el espacio indica el <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">selector descendente</a> ). Por ejemplo, para seleccionar:
ja: 2つ以上の属性（2つのクラス名、またはクラス名と <code>data-</code> 属性など）を持つ要素を一致させるには、各文字列のセレクターをセレクター文字列の隣に配置します。スペースは<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">子孫セレクターを</a>示します）。 たとえば、次のように選択します。
ko: 두 개 이상의 속성 (예 : 두 개의 클래스 이름 또는 클래스 이름 및 <code>data-</code> 속성)이있는 요소를 일치 시키려면 공백 <em>없이</em> 구분 기호 문자열에서 각 속성의 선택기를 나란히 두십시오. 공백은 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">자손 선택기를</a> 나타냅니다). 예를 들어, 다음을 선택하십시오.
ru: Чтобы сопоставить элемент, имеющий два или более атрибута (например, два имени класса или имя класса и атрибут <code>data-</code> ), поместите селекторы для каждого атрибута рядом друг с другом в строке селектора, <em>без</em> пробела, разделяющего их (поскольку пробел указывает на <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">потомок селектора</a> ). Например, чтобы выбрать:
zh_cn: 要匹配具有两个或更多属性的元素（例如两个类名，或一个类名和一个 <code>data-</code> attribute），请将每个属性的选择器在选择器字符串中彼此相邻放置， <em>不要</em>用空格隔开（因为空格表示<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Descendant_combinator">后代选择器</a> ）。 例如，选择：

source: Try to access the element after its declaration or alternatively use stuff like <code>$(document).ready();</code>
es: Intente acceder al elemento despu&eacute;s de su declaraci&oacute;n o, alternativamente, use cosas como <code>$(document).ready();</code>
ja: 宣言後に要素にアクセスするか、代わりに <code>$(document).ready();</code> のようなものを使用してください。
ko: 선언 후 요소에 액세스하거나 <code>$(document).ready();</code>
ru: Попробуйте получить доступ к элементу после его объявления или использовать что-то вроде <code>$(document).ready();</code>
zh_cn: 尝试在元素声明后访问元素，或者使用 <code>$(document).ready();</code> 之类的东西。

source: Uncaught TypeError: Cannot read property 'addEventListener' of null
es: Error de tipo no atrapado:No se puede leer la propiedad "addEventListener" de null
ja: 意図しない TypeError。null のプロパティ 'addEventListener' が読み込めません。
ko: 잡히지 않은 TypeError : null의 'addEventListener'속성을 읽을 수 없습니다
ru: Не пойманный типОшибка:Не могу прочитать свойство 'addEventListener' от нуля
zh_cn: Uncaught TypeError:无法读取空的属性'addEventListener'。

source: Uncaught TypeError: Cannot read property 'style' of null
es: Error de tipo no atrapado:No se puede leer la propiedad "estilo" de nulo
ja: 意図しない TypeError。null のプロパティ 'style' を読み込むことができません。
ko: 잡히지 않은 TypeError : null의 'style'속성을 읽을 수 없습니다
ru: Не пойманный типОшибка:Не могу прочитать свойство 'стиль' null
zh_cn: Uncaught TypeError:无法读取空的属性'style'。

source: Uncaught TypeError: Cannot set property '...' of null Uncaught TypeError: Cannot read property '...' of null
es: Error de tipo no atrapado:No se puede establecer la propiedad '...' de nulo Uncaught TypeError:No puede leer la propiedad '...' de nulo
ja: 意図しない TypeError。null のプロパティ '...' を設定できません。null のプロパティ '....' を読み込むことができません。
ko: 잡히지 않은 TypeError : null의 속성 '...'을 설정할 수 없습니다 잡히지 않은 TypeError : null의 속성 '...'을 읽을 수 없습니다
ru: Не пойманный типОшибка:Не может установить свойство '...' нулевой Uncaught TypeError:Невозможно прочитать свойство '...' от нуля
zh_cn: Uncaught TypeError:无法设置空的属性'.....'。无法读取空的属性'...'。

source: Uncaught TypeError: Cannot set property 'onclick' of null
es: Error de tipo no atrapado:No se puede establecer la propiedad "onclick" de nulo
ja: 意図しないTypeErrorです。null のプロパティ 'onclick' を設定できません。
ko: 잡히지 않은 TypeError : null 속성 'onclick'을 설정할 수 없습니다
ru: Не пойманный типОшибка:Не могу установить свойство 'onclick' равным нулю.
zh_cn: Uncaught TypeError:无法设置属性 "onclick "为空的属性 "onclick"。

source: Use the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"><code>defer</code></a> attribute of <code>&lt;script&gt;</code>.
es: Utilice el atributo de <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"> <code>defer</code> </a> de <code>&lt;script&gt;</code> .
ja: <code>&lt;script&gt;</code> の <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"> <code>defer</code> </a>属性を使用します。
ko: <code>&lt;script&gt;</code> 의 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"> <code>defer</code> </a> 속성을 사용하십시오.
ru: Используйте атрибут <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"> <code>defer</code> </a> <code>&lt;script&gt;</code> .
zh_cn: 使用 <code>&lt;script&gt;</code> 的<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script#attr-defer"> <code>defer</code> </a>属性。

source: Use tools [for example, webdeveloper plugin for browsers] to find duplicate ids and remove them.
es: Utilice herramientas [por ejemplo,el plugin de desarrollo web para navegadores]para encontrar identificaciones duplicadas y eliminarlas.
ja: ツール[ブラウザ用のWebdeveloperプラグインなど]を使用して、重複したIDを見つけて削除します。
ko: 도구 (예 : 브라우저 용 웹 개발자 플러그인)를 사용하여 중복 ID를 찾아 제거하십시오.
ru: Используйте инструменты [например,плагин веб-разработчика для браузеров],чтобы найти дубликаты идентификаторов и удалить их.
zh_cn: 使用工具[例如,浏览器的webdeveloper插件]找到重复的id并删除它们。

source: What are the possible reasons for <code>document.getElementById</code>, <code>$("#id")</code> or any other DOM method / jQuery selector not finding the elements?
es: &iquest;Cu&aacute;les son las posibles razones por las que <code>document.getElementById</code> , <code>$("#id")</code> o cualquier otro m&eacute;todo DOM / jQuery selector no encuentra los elementos?
ja: <code>document.getElementById</code> 、 <code>$("#id")</code> またはその他のDOMメソッド/ jQueryセレクターが要素を見つけられない理由として考えられるものは何ですか？
ko: <code>document.getElementById</code> , <code>$("#id")</code> 또는 다른 DOM 메소드 / jQuery 선택자가 요소를 찾지 못하는 이유는 무엇입니까?
ru: Каковы возможные причины для <code>document.getElementById</code> , <code>$("#id")</code> или любого другого селектора метода DOM / jQuery, не находящего элементы?
zh_cn: <code>document.getElementById</code> ， <code>$("#id")</code> 或任何其他DOM方法/ jQuery选择器找不到元素的可能原因是什么？

source: When an element raises an event (provided that it's a <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">bubbling</a> event and nothing stops its propagation), each parent in that element's ancestry receives the event as well. That allows us to attach a handler to an existing element and sample events as they bubble up from its descendants... even those added after the handler is attached. All we have to do is check the event to see whether it was raised by the desired element and, if so, run our code.
es: Cuando un elemento genera un evento (siempre que sea un evento <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">burbujeante</a> y nada detenga su propagaci&oacute;n), cada padre en la ascendencia de ese elemento tambi&eacute;n recibe el evento. Eso nos permite adjuntar un controlador a un elemento existente y eventos de muestra a medida que surgen de sus descendientes ... incluso los que se agregan despu&eacute;s de que se adjunta el controlador. Todo lo que tenemos que hacer es verificar el evento para ver si fue generado por el elemento deseado y, de ser as&iacute;, ejecutar nuestro c&oacute;digo.
ja: 要素がイベントを発生させると（それが<a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">バブリング</a>イベントであり、伝播が止まらない場合）、その要素の祖先の各親もイベントを受け取ります。 これにより、既存の要素にハンドラーをアタッチし、その子孫からバブルが発生するときにイベントをサンプリングできます。ハンドラーがアタッチされた後に追加されたイベントも含まれます。 イベントをチェックして、目的の要素によって発生したかどうかを確認し、発生した場合はコードを実行するだけです。
ko: 요소가 이벤트를 발생 시키면 ( <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">버블 링</a> 이벤트이고 전파를 멈추지 않는 경우) 해당 요소의 상위 항목에있는 각 부모도 이벤트를받습니다. 이를 통해 핸들러를 기존 요소에 첨부하고 이벤트가 하위 요소에서 버블 링 될 때 이벤트 핸들러를 첨부 할 수 있습니다. 우리가해야 할 일은 원하는 요소에 의해 이벤트가 발생했는지 확인하고, 그렇다면 코드를 실행하는 것입니다.
ru: Когда элемент вызывает событие (при условии, что это <a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">пузырьковое</a> событие, и ничто не останавливает его распространение), каждый родительский элемент в происхождении этого элемента также получает событие. Это позволяет нам прикрепить обработчик к существующему элементу и сэмплировать события, когда они всплывают от его потомков ... даже тех, которые были добавлены после присоединения обработчика. Все, что нам нужно сделать, это проверить событие, чтобы увидеть, было ли оно вызвано нужным элементом, и, если это так, запустить наш код.
zh_cn: 当一个元素引发一个事件时（假设它是一个<a href="http://www.w3.org/TR/DOM-Level-2-Events/events.html#Events-flow-bubbling">冒泡</a>事件，并且没有任何东西阻止其传播），则该元素祖先中的每个父对象也会接收到该事件。 这使我们能够将处理程序附加到现有元素，并在事件从其后代冒泡时进行采样，甚至是附加处理程序后添加的事件。 我们要做的就是检查事件以查看事件是否由所需的元素引发，如果是，请运行我们的代码。

source: Why does jQuery or a DOM method such as getElementById not find the element
es: ¿Por qué jQuery o un método DOM como getElementById no encuentra el elemento
ja: jQuery や getElementById などの DOM メソッドで要素が見つからないのはなぜですか?
ko: jQuery 또는 getElementById와 같은 DOM 메소드가 요소를 찾지 못하는 이유
ru: Почему jQuery или DOM метод,такой как getElementById,не находит элемент
zh_cn: 为什么jQuery或getElementById等DOM方法找不到元素?

source: With querySelector, querySelectorAll, and jQuery, to match an element with a particular class name, put a <code>.</code> directly before the class. Similarly, to match an element with a particular ID, put a <code>#</code> directly before the ID:
es: Con querySelector, querySelectorAll y jQuery, para hacer coincidir un elemento con un nombre de clase particular, coloque a <code>.</code> directamente antes de la clase. Del mismo modo, para hacer coincidir un elemento con un ID en particular, ponga un <code>#</code> directamente antes del ID:
ja: querySelector、querySelectorAll、およびjQueryで、要素を特定のクラス名と照合するには、 <code>.</code> クラスの直前。 同様に、要素を特定のIDと照合するには、IDの直前に <code>#</code> を付けます。
ko: querySelector, querySelectorAll 및 jQuery를 사용하여 특정 클래스 이름과 요소를 일치 시키려면을 입력하십시오 <code>.</code> 수업 직전에. 마찬가지로 요소를 특정 ID와 일치 시키려면 ID 바로 앞에 <code>#</code> 을 넣으십시오.
ru: С querySelector, querySelectorAll и jQuery, чтобы сопоставить элемент с определенным именем класса, поместите a <code>.</code> прямо перед классом. Аналогично, чтобы сопоставить элемент с определенным идентификатором, поставьте <code>#</code> непосредственно перед идентификатором:
zh_cn: 使用querySelector，querySelectorAll和jQuery来匹配具有特定类名的元素，请放置 <code>.</code> 就在上课之前。 同样，要匹配具有特定ID的元素，请在ID之前直接添加 <code>#</code> ：

source: You also need to make sure the methods have the proper capitalization and spelling. Use one of:
es: También hay que asegurarse de que los métodos tienen la mayúscula y la ortografía adecuadas.Use uno de:
ja: また、メソッドの大文字と小文字のスペルが適切であることを確認する必要があります。のいずれかを使用します。
ko: 또한 메소드에 대문자와 철자가 올바른지 확인해야합니다. 다음 중 하나를 사용하십시오.
ru: Вам также необходимо убедиться в том,что методы имеют правильную капитализацию и орфографию.Используйте один из них:
zh_cn: 你还需要确保这些方法有正确的大写和拼写。使用其中之一。
