Repository: rueisnom/feedback
Catalog: xlf/41/55/11/415511.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <code>.isoformat()</code> is in the documentation, but not yet here (this is mighty similar to @Ray Vega's answer):
ja: <code>.isoformat()</code> はドキュメントにありますが、まだここにはありません（これは@Ray Vegaの答えに非常に似ています）：
ko: <code>.isoformat()</code> 은 문서에 있지만 아직 여기에 없습니다 (@Ray Vega의 답변과 비슷할 수 있음).
ru: <code>.isoformat()</code> есть в документации, но еще не здесь (это очень похоже на ответ @Ray Vega):
zh_cn: <code>.isoformat()</code> 在文档中，但尚未在此处（这与@Ray Vega的答案非常相似）：

source: <code>datetime.now()</code> returns the current time as a naive datetime object that represents time in the local timezone. That value may be ambiguous e.g., during DST transitions ("fall back"). To avoid ambiguity either UTC timezone should be used:
ja: <code>datetime.now()</code> は、ローカルタイムゾーンの時刻を表す単純なdatetimeオブジェクトとして現在の時刻を返します。 その値は、たとえばDST移行中（「フォールバック」）にはあいまいな場合があります。 あいまいさを回避するには、どちらかのUTCタイムゾーンを使用する必要があります。
ko: <code>datetime.now()</code> 는 현재 시간을 현지 시간대의 시간을 나타내는 순진 날짜 / 시간 객체로 반환합니다. 그 값은 예를 들어 DST 전환 중에 모호 할 수 있습니다 ( "폴백"). 모호성을 피하려면 UTC 시간대를 사용해야합니다.
ru: <code>datetime.now()</code> возвращает текущее время как наивный объект datetime, который представляет время в местном часовом поясе. Это значение может быть неоднозначным, например, во время переходов DST (&laquo;отступление&raquo;). Чтобы избежать двусмысленности, следует использовать часовой пояс UTC:
zh_cn: <code>datetime.now()</code> 返回当前时间作为朴素的datetime对象，该对象表示本地时区中的时间。 该值可能是不明确的，例如在DST转换期间（&ldquo;回退&rdquo;）。 为避免歧义，应使用UTC时区：

source: <code>datetime</code> module
ja: <code>datetime</code> モジュール
ko: <code>datetime</code> 모듈
ru: модуль <code>datetime</code>
zh_cn: <code>datetime</code> 模块

source: <code>t</code> - float number, good for time interval measurement.
ja: <code>t</code> -浮動小数点数。時間間隔の測定に適しています。
ko: <code>t</code> - 시간 간격 측정에 적합한 부동 수.
ru: <code>t</code> - число с плавающей запятой, подходящее для измерения временного интервала.
zh_cn: <code>t</code> -浮点数，适用于时间间隔测量。

source: <strong>Current time of a timezone</strong>
ja: <strong>タイムゾーンの現在時刻</strong>
ko: <strong>시간대의 현재 시간</strong>
ru: <strong>Текущее время часового пояса</strong>
zh_cn: <strong>时区的当前时间</strong>

source: <strong>date</strong> will print date and <strong>time</strong> will print time.
ja: <strong>date</strong>は<strong>日付</strong>を印刷し、 <strong>time</strong>は<strong>時刻</strong>を印刷します。
ko: <strong>날짜</strong> 가 인쇄되고 <strong>날짜</strong> 가 <strong>시간</strong> 을 인쇄합니다.
ru: <strong>date</strong> напечатает дату, а <strong>время</strong> напечатает время.
zh_cn: <strong>日期</strong>将打印日期， <strong>时间</strong>将打印时间。

source: Add or remove zeroes from the last multiplication to adjust number of decimal points, or just:
ja: 小数点以下の数を調整するために、最後の乗算からゼロを追加したり削除したりします。
ko: 마지막 곱셈에서 0을 추가하거나 제거하여 소수점 수를 조정하거나 다음을 수행하십시오.
ru: Добавлять или удалять нули из последнего умножения для регулировки количества десятичных точек,или просто:
zh_cn: 在最后的乘法中加入或去除零,以调整小数点的数量,或者只是。

source: Also, this table is a necessary reference for choosing the appropriate format codes to get the date formatted just the way you want it (from Python "datetime" documentation <a href="https://docs.python.org/2/library/datetime.html#strftime-strptime-behavior">here</a>).
ja: また、この表は、適切なフォーマットコードを選択して、希望どおりにフォーマットされた日付を取得するために必要なリファレンスです（Pythonの「datetime」のドキュメントを<a href="https://docs.python.org/2/library/datetime.html#strftime-strptime-behavior">参照</a> ）。
ko: 또한이 표는 원하는 형식으로 날짜를 가져 오기 위해 적절한 형식 코드를 선택하는 데 필요한 참조 자료입니다 (Python "datetime"documentation <a href="https://docs.python.org/2/library/datetime.html#strftime-strptime-behavior">here</a> ).
ru: Кроме того, эта таблица является необходимой ссылкой для выбора соответствующих кодов формата, чтобы получить дату, отформатированную так, как вы этого хотите (из документации Python &laquo;datetime&raquo; <a href="https://docs.python.org/2/library/datetime.html#strftime-strptime-behavior">здесь</a> ).
zh_cn: 另外，此表对于选择适当的格式代码来获取所需格式的日期也是必要的参考（来自Python&ldquo; datetime&rdquo;文档）。

source: An hour ago:
ja: 1時間前に
ko: 한 시간 전에:
ru: Час назад:
zh_cn: 一个小时前

source: And just the time:
ja: そして、ちょうどいいタイミングで。
ko: 그리고 단지 시간 :
ru: И как раз вовремя:
zh_cn: 而就在这个时候。

source: And on it goes. Long story short: Pendulum attempts to do for date and time what requests did for HTTP. It's worth consideration, particularly for both its ease of use and extensive documentation.
ja: そして、それは続いています。長い話をすると、Pendulum はリクエストが HTTP に対して行ったことと同じことを日付と時刻に対して行おうとしています。特にその使いやすさと豊富なドキュメントの両方を考慮すると、検討する価値があります。
ko: 그리고 그것에 간다. 간단히 말해 : 진자는 요청이 HTTP에 대해 한 날짜와 시간에 시도합니다. 특히 사용 편의성과 광범위한 문서화를 위해 고려할 가치가 있습니다.
ru: И так далее.Короткая история:Pendulum пытается сделать для даты и времени,что запросы сделали для HTTP.Это заслуживает внимания,в частности,как за простоту использования и обширную документацию.
zh_cn: 然后就开始了。长话短说:Pendulum试图做的是日期和时间,而HTTP请求做的是什么。它值得考虑,特别是它的易用性和丰富的文档。

source: And we see we can easily convert to timezones from the original utc object.
ja: そして、元の utc オブジェクトから簡単にタイムゾーンに変換できることがわかります。
ko: 그리고 원래 utc 객체에서 표준 시간대로 쉽게 변환 할 수 있습니다.
ru: И мы видим,что мы можем легко конвертировать в часовые пояса из оригинального объекта utc.
zh_cn: 而我们看到,我们可以很容易地从原来的utc对象转换为时区。

source: Because no one has mentioned it yet, and this is something I ran into recently... a pytz timezone's fromutc() method combined with datetime's utcnow() is the best way I've found to get a useful current time (and date) in any timezone.
ja: まだ誰も言及していませんが、これは私が最近遭遇したことです...pytzタイムゾーンのfromutc()メソッドとdatetimeのutcnow()を組み合わせると、どのタイムゾーンでも現在の時刻(と日付)を取得するための最良の方法です。
ko: 아무도 그것을 언급하지 않았기 때문에 이것이 최근에 발생한 것입니다 ... pytz 시간대의 fromutc () 메소드와 datetime의 utcnow () 메소드가 유용한 현재 시간 (및 날짜)을 얻는 가장 좋은 방법입니다 어떤 시간대에서도.
ru: Потому что никто об этом еще не упоминал,и это то,с чем я недавно столкнулся...метод pitz timezone's fromutc()в сочетании с функцией datetime's utcnow()-это лучший способ получить полезное текущее время (и дату)в любом часовом поясе.
zh_cn: 因为还没有人提到过,而这是我最近遇到的事情......pytz时区的fromutc()方法与datetime的utcnow()方法结合起来,是我发现在任何时区获得有用的当前时间(和日期)的最好方法。

source: But I want <strong>only milliseconds</strong>, right? The shortest way to get them:
ja: でも<strong>ミリ秒しか</strong>欲しく<strong>ない</strong>よね？ それらを取得する最短の方法：
ko: 하지만 <strong>밀리 초 만</strong> 원합니다. 그들을 얻는 가장 짧은 방법 :
ru: Но я хочу <strong>только миллисекунды</strong> , верно? Самый короткий способ получить их:
zh_cn: 但是我只想<strong>毫秒</strong> ，对吗？ 获得它们的最短方法：

source: By default, <code>now()</code> function returns output in the <code>YYYY-MM-DD HH:MM:SS:MS</code> format. Use the below sample script to get the current date and time in a Python script and print results on the screen. Create file <code>getDateTime1.py</code> with the below content.
ja: デフォルトでは、 <code>now()</code> 関数は出力を <code>YYYY-MM-DD HH:MM:SS:MS</code> 形式で返します。 以下のサンプルスクリプトを使用して、Pythonスクリプトで現在の日時を取得し、結果を画面に出力します。 以下の内容でファイル <code>getDateTime1.py</code> を作成します。
ko: 기본적으로 <code>now()</code> 함수는 <code>YYYY-MM-DD HH:MM:SS:MS</code> 형식으로 출력을 반환합니다. 아래 샘플 스크립트를 사용하여 현재 날짜 및 시간을 Python 스크립트로 가져 와서 화면에 결과를 인쇄하십시오. 아래 내용으로 <code>getDateTime1.py</code> 파일을 작성하십시오.
ru: По умолчанию функция <code>now()</code> возвращает выходные данные в <code>YYYY-MM-DD HH:MM:SS:MS</code> . Используйте приведенный ниже пример скрипта, чтобы получить текущую дату и время в скрипте Python и распечатать результаты на экране. Создайте файл <code>getDateTime1.py</code> с содержимым ниже.
zh_cn: 默认情况下， <code>now()</code> 函数以 <code>YYYY-MM-DD HH:MM:SS:MS</code> 格式返回输出。 使用以下示例脚本在Python脚本中获取当前日期和时间，并在屏幕上打印结果。 使用以下内容创建文件 <code>getDateTime1.py</code> 。

source: Do <code>dir(date)</code> or any variables including the package. You can get all the attributes and methods associated with the variable.
ja: <code>dir(date)</code> またはパッケージを含むすべての変数を実行します。 変数に関連付けられているすべての属性とメソッドを取得できます。
ko: <code>dir(date)</code> 또는 패키지를 포함한 모든 변수를 수행하십시오. 변수와 관련된 모든 속성과 메소드를 얻을 수 있습니다.
ru: Сделайте <code>dir(date)</code> или любые переменные, включая пакет. Вы можете получить все атрибуты и методы, связанные с переменной.
zh_cn: 执行 <code>dir(date)</code> 或任何变量，包括软件包。 您可以获得与该变量关联的所有属性和方法。

source: Equivalently, in Python 3 we have the <code>timezone</code> class with a utc <code>timezone</code> instance attached, which also makes the object timezone aware (but to convert to another timezone without the handy <code>pytz</code> module is left as an exercise to the reader):
ja: 同様に、Python 3には、utc <code>timezone</code> インスタンスがアタッチされた <code>timezone</code> クラスがあります。これにより、オブジェクトのタイムゾーンが認識されます（ただし、便利な <code>pytz</code> モジュールを使用せずに別のタイムゾーンに変換することは、読者への課題として残されています）。
ko: 마찬가지로 Python 3에는 utc <code>timezone</code> 인스턴스가 첨부 된 <code>timezone</code> 클래스가있어 객체 ​​시간대를 인식하게합니다 (그러나 편리한 <code>pytz</code> 모듈없이 다른 시간대로 변환하는 것은 독자에게 연습으로 남습니다).
ru: Эквивалентно, в Python 3 у нас есть класс <code>timezone</code> поясов с прикрепленным экземпляром часового <code>timezone</code> utc, который также делает объект часовой пояс осведомленным (но преобразование в другой часовой пояс без удобного модуля <code>pytz</code> оставлено в качестве упражнения для читателя):
zh_cn: 等效地，在Python 3中，我们附加了带有utc <code>timezone</code> 实例的 <code>timezone</code> 类，这也使对象知道时区（但在没有方便的 <code>pytz</code> 模块的情况下将其转换为另一个时区，留给读者练习）：

source: For a specific timezone:
ja: 特定のタイムゾーンの場合。
ko: 특정 시간대의 경우 :
ru: Для определенного часового пояса:
zh_cn: 对于特定的时区。

source: For instance, the answer to the original question:
ja: 例えば、元の質問の答え。
ko: 예를 들어, 원래 질문에 대한 답변은 다음과 같습니다.
ru: Например,ответ на исходный вопрос:
zh_cn: 例如,对原问题的回答。

source: For this example, the output will be like this: <code>'2013-09-18 11:16:32'</code>
ja: この例の場合、出力は次のようになります： <code>'2013-09-18 11:16:32'</code>
ko: 이 예의 경우 출력은 다음과 같습니다. <code>'2013-09-18 11:16:32'</code>
ru: Для этого примера вывод будет выглядеть так: <code>'2013-09-18 11:16:32'</code>
zh_cn: 对于此示例，输出将如下所示： <code>'2013-09-18 11:16:32'</code>

source: Here is the list of <a href="https://docs.python.org/library/datetime.html#strftime-and-strptime-format-codes"><code>strftime</code> directives</a>.
ja: これは<a href="https://docs.python.org/library/datetime.html#strftime-and-strptime-format-codes"> <code>strftime</code> ディレクティブ</a>のリストです。
ko: 다음은 <a href="https://docs.python.org/library/datetime.html#strftime-and-strptime-format-codes"> <code>strftime</code> 지시문</a> 목록입니다.
ru: Вот список <a href="https://docs.python.org/library/datetime.html#strftime-and-strptime-format-codes">директив <code>strftime</code> </a> .
zh_cn: 这是<a href="https://docs.python.org/library/datetime.html#strftime-and-strptime-format-codes"> <code>strftime</code> 指令</a>的列表。

source: How do I get the current time in Python?
ja: Pythonで現在時刻を取得するには?
ko: 파이썬에서 현재 시간을 어떻게 알 수 있습니까?
ru: Как мне получить текущее время в Питоне?
zh_cn: 如何在Python中获取当前时间?

source: How to get the current time in Python
ja: Pythonで現在時刻を取得する方法
ko: 파이썬에서 현재 시간을 얻는 방법
ru: Как получить текущее время в Питоне...
zh_cn: 如何用Python获取当前时间

source: However, none of the datetime objects we've created so far can be easily converted to various timezones. We can solve that problem with the <code>pytz</code> module:
ja: ただし、これまでに作成したdatetimeオブジェクトは、さまざまなタイムゾーンに簡単に変換できません。 この問題は <code>pytz</code> モジュールで解決できます。
ko: 그러나 지금까지 생성 한 datetime 객체는 다양한 시간대로 쉽게 변환 할 수 없습니다. 우리는 <code>pytz</code> 모듈로 그 문제를 해결할 수 있습니다 :
ru: Однако ни один из объектов datetime, которые мы создали до сих пор, не может быть легко преобразован в различные часовые пояса. Мы можем решить эту проблему с помощью модуля <code>pytz</code> :
zh_cn: 但是，到目前为止，我们创建的datetime对象都无法轻松转换为各种时区。 我们可以使用 <code>pytz</code> 模块解决该问题：

source: I want to get the time with milliseconds. A simple way to get them:
ja: ミリ秒で時間を取得したい 簡単に取得する方法です。
ko: 나는 밀리 초로 시간을 얻고 싶다. 그들을 얻는 간단한 방법 :
ru: Я хочу получить время за миллисекунды.Простой способ получить их:
zh_cn: 我想用毫秒来获取时间。一个简单的方法来获取。

source: If all you want is the time, you can then get that with <code>local_time.time()</code>.
ja: 時間が必要な場合は、 <code>local_time.time()</code> を使用して取得できます。
ko: 원하는 모든 것이 시간 <code>local_time.time()</code> 얻을 수 있습니다.
ru: Если вам нужно только время, вы можете получить его с помощью <code>local_time.time()</code> .
zh_cn: 如果您只想要时间，则可以使用 <code>local_time.time()</code> 获得时间。

source: If you just want the current timestamp in ms (for example, to measure execution time), you can also use the "timeit" module:
ja: 現在のタイムスタンプをミリ秒単位で表示したいだけなら(例えば、実行時間を測定したい場合など)、"timeit "モジュールを使うこともできます。
ko: 현재 타임 스탬프를 ms 단위로 (예 : 실행 시간 측정) 원하는 경우 "timeit"모듈을 사용할 수도 있습니다.
ru: Если Вам нужна только текущая метка времени в мс (например,для измерения времени исполнения),Вы также можете использовать модуль "timeit":
zh_cn: 如果你只是想得到当前的时间戳(例如,测量执行时间),也可以使用 "timeit "模块。

source: If you live in the D.C. area (like me) the latency might not be too bad...
ja: D.C.エリアに住んでいれば(私のように)遅延も悪くないかもしれませんが...。
ko: DC 지역에 살고 있다면 (나 같은) 지연 시간이 너무 나쁘지 않을 수 있습니다.
ru: Если вы живете в округе Колумбия (как и я),задержка может быть не так уж и плоха...
zh_cn: 如果你住在华盛顿地区(像我一样),延迟可能不会太差。

source: If you need current time as a <code>time</code> object:
ja: <code>time</code> オブジェクトとして現在の時間が必要な場合：
ko: <code>time</code> 객체로 현재 시간이 필요한 경우 :
ru: Если вам нужно текущее время как объект <code>time</code> :
zh_cn: 如果您需要当前时间作为 <code>time</code> 对象：

source: If you're displaying the time with Python for the user, <code>ctime</code> works nicely, not in a table (it doesn't typically sort well), but perhaps in a clock. However, I personally recommend, when dealing with time in Python, either using Unix time, or a timezone aware UTC <code>datetime</code> object.
ja: ユーザーのPythonで時間を表示している場合、 <code>ctime</code> はうまく機能します。テーブルではなく（通常はうまく並べ替えられません）、おそらく時計で機能します。 ただし、個人的には、Pythonで時間を処理する場合、Unix時間またはタイムゾーン対応のUTC <code>datetime</code> オブジェクトを使用することをお勧めします。
ko: 사용자를 위해 Python으로 시간을 표시하는 경우 <code>ctime</code> 은 테이블 (일반적으로 잘 정렬되지 않음)이 아니라 시계에서 잘 작동합니다. 그러나 개인적으로 파이썬에서 시간을 다룰 때 Unix 시간 또는 UTC 인식 <code>datetime</code> 객체를 사용하는 것이 좋습니다.
ru: Если вы отображаете время с Python для пользователя, <code>ctime</code> работает хорошо, не в таблице (обычно не очень хорошо сортируется), но, возможно, в часах. Тем не менее, я лично рекомендую, когда речь идет о времени в Python, либо с использованием времени Unix, либо объекта <code>datetime</code> с указанием часового пояса.
zh_cn: 如果您要使用Python为用户显示时间，则 <code>ctime</code> 可以很好地工作，而不是在表中（通常排序不佳），而是在时钟中。 但是，我个人建议在Python中使用Unix时间或支持时区的UTC <code>datetime</code> 对象处理时间时。

source: It will print in HH:MM:SS format.
ja: HH:MM:SS形式で印刷されます。
ko: HH : MM : SS 형식으로 인쇄됩니다.
ru: Он будет печатать в формате HH:MM:SS.
zh_cn: 它将以HHH:MM:SS格式打印。

source: One could ostensibly serialize this object for UTC time and store <em>that</em> in a database, but it would require far more memory and be more prone to error than simply storing the Unix Epoch time, which I demonstrated first.
ja: 見かけ上、このオブジェクトをUTC時間でシリアル化してデータベースに格納する<em>こと</em>もできますが、最初に説明したUnixエポック時間を単に格納するよりもはるかに多くのメモリを必要とし、エラーが発生しやすくなります。
ko: UTC 시간 동안이 객체를 표면에 직렬화하여 데이터베이스에 저장할 <em>수</em> 는 있지만 Unix Epoch 시간을 저장하는 것보다 훨씬 많은 메모리가 필요하고 오류가 발생하기 쉽습니다.
ru: Можно было бы якобы сериализовать этот объект для времени UTC и сохранить его в базе данных, но это потребовало бы гораздо больше памяти и было бы более подвержено ошибкам, чем простое сохранение времени эпохи Unix, которое я продемонстрировал первым.
zh_cn: 表面上可以将这个对象序列化为UTC时间并将其存储在数据库中，但是比起我首先演示的Unix Epoch时间，它需要更多的内存并且更容易出错。

source: Or a timezone-aware object that has the corresponding timezone info attached (Python 3.2+):
ja: あるいは、対応するタイムゾーン情報が添付されたタイムゾーン対応オブジェクト(Python 3.2+)。
ko: 또는 해당 시간대 정보가 첨부 된 시간대 인식 객체 (Python 3.2 이상) :
ru: Или объект,учитывающий часовой пояс,к которому прикреплена соответствующая информация о часовом поясе (Python 3.2+):
zh_cn: 或者是一个时区感知对象,它具有相应的时区信息(Python 3.2+)。

source: Or if you want the gist.
ja: 要点を知りたいなら
ko: 또는 요점을 원한다면.
ru: Или,если ты хочешь суть.
zh_cn: 或者,如果你想知道要点。

source: Or the UTC version:
ja: もしくはUTC版。
ko: 또는 UTC 버전 :
ru: Или UTC-версия:
zh_cn: 或者说是UTC版本。

source: Presumably most of the rest of you mean somewhere else.
ja: おそらく他のほとんどの人はどこか他の場所のことを言っているのでしょう。
ko: 아마 당신의 나머지 대부분은 다른 곳을 의미합니다.
ru: Предположительно,большинство из вас имеют в виду где-то в другом месте.
zh_cn: 你们中的大多数人可能是指其他地方

source: See <a href="https://docs.python.org/3/library/datetime.html"><strong>the documentation</strong></a> for more information.
ja: 詳細について<a href="https://docs.python.org/3/library/datetime.html"><strong>は、ドキュメント</strong></a>を参照し<strong>て</strong>ください。
ko: 자세한 내용 <a href="https://docs.python.org/3/library/datetime.html"><strong>은 설명서</strong></a> 를 참조하십시오.
ru: Смотрите <a href="https://docs.python.org/3/library/datetime.html"><strong>документацию</strong></a> для получения дополнительной информации.
zh_cn: 有关更多信息，请参见<a href="https://docs.python.org/3/library/datetime.html"><strong>文档</strong></a> 。

source: Similar to <a href="https://stackoverflow.com/questions/415511/how-to-get-current-time-in-python/415519#415519">Harley's answer</a>, but use the <code>str()</code> function for a quick-n-dirty, slightly more human readable format:
ja: <a href="https://stackoverflow.com/questions/415511/how-to-get-current-time-in-python/415519#415519">Harleyの回答に</a>似ていますが、 <code>str()</code> 関数を使用して、quick-n-dirty、やや人間が読める形式にします。
ko: <a href="https://stackoverflow.com/questions/415511/how-to-get-current-time-in-python/415519#415519">Harley의 답변</a> 과 비슷하지만 <code>str()</code> 함수를 사용하여 좀 더 읽기 쉽고 약간 더 읽기 쉬운 형식으로 만듭니다.
ru: Аналогичен <a href="https://stackoverflow.com/questions/415511/how-to-get-current-time-in-python/415519#415519">ответу Харли</a> , но используйте функцию <code>str()</code> для быстро читаемого, чуть более удобочитаемого формата:
zh_cn: 与<a href="https://stackoverflow.com/questions/415511/how-to-get-current-time-in-python/415519#415519">Harley的答案</a>类似，但是将 <code>str()</code> 函数用于快速n脏的，更易理解的格式：

source: That outputs the current GMT in the specified format. There is also a <a href="https://docs.python.org/3/library/time.html#time.localtime"><code>localtime()</code></a> method.
ja: 指定された形式で現在のGMTを出力します。 <a href="https://docs.python.org/3/library/time.html#time.localtime"> <code>localtime()</code> </a>メソッドもあります。
ko: 현재 GMT를 지정된 형식으로 출력합니다. <a href="https://docs.python.org/3/library/time.html#time.localtime"> <code>localtime()</code> </a> 메소드도 있습니다.
ru: Это выводит текущее время по Гринвичу в указанном формате. Существует также метод <a href="https://docs.python.org/3/library/time.html#time.localtime"> <code>localtime()</code> </a> .
zh_cn: 以指定格式输出当前GMT。 还有一个<a href="https://docs.python.org/3/library/time.html#time.localtime"> <code>localtime()</code> </a>方法。

source: The <code>datetime.now</code> is a class method that returns the current time. It uses the <code>time.localtime</code> without the timezone info (if not given, otherwise see timezone aware below). It has a representation (which would allow you to recreate an equivalent object) echoed on the shell, but when printed (or coerced to a <code>str</code>), it is in human readable (and nearly ISO) format, and the lexicographic sort is equivalent to the chronological sort:
ja: <code>datetime.now</code> は、現在の時刻を返すクラスメソッドです。 タイムゾーン情報なしで <code>time.localtime</code> を使用します（指定されていない場合は、以下のタイムゾーン対応を参照してください）。 シェルにエコーされた（同等のオブジェクトを再作成できるようにする）表現がありますが、印刷（または <code>str</code> に強制）すると、人間が読める（ISOに近い）形式になり、辞書式ソートは次のようになります。年代順の並べ替え：
ko: <code>datetime.now</code> 는 현재 시간을 반환하는 클래스 메서드입니다. 시간대 정보없이 <code>time.localtime</code> 을 사용합니다 (제공되지 않은 경우 아래의 시간대 인식 참조). 쉘에 반영된 표현 (동등한 오브젝트를 재 작성할 수 있음)을 갖지만 인쇄 (또는 <code>str</code> 으로 강제) 할 때 사람이 읽을 수있는 (그리고 거의 ISO) 형식이며 사전 사전 정렬은 다음과 같습니다. 연대순 정렬 :
ru: <code>datetime.now</code> - это метод класса, который возвращает текущее время. Он использует <code>time.localtime</code> без информации о часовом поясе (если не указан, в противном случае смотрите информацию о часовом поясе ниже). Он имеет представление (которое позволит вам воссоздать эквивалентный объект), отраженное в оболочке, но при печати (или приведении к <code>str</code> ) оно имеет читабельный (и почти ISO) формат, а лексикографическая сортировка эквивалентна хронологический вид:
zh_cn: <code>datetime.now</code> 是一个返回当前时间的类方法。 它使用 <code>time.localtime</code> 而不包含时区信息（如果未提供，否则请参阅下面的了解时区）。 它具有在外壳上回显的表示形式（允许您重新创建等效的对象），但是在打印（或强制转换为 <code>str</code> ）时，它具有人类可读（和几乎ISO）的格式，而词典编排相当于按时间顺序排序：

source: The <code>datetime</code> module is also quite useful here:
ja: ここでも <code>datetime</code> モジュールは非常に便利です。
ko: <code>datetime</code> 모듈은 다음과 같이 매우 유용합니다.
ru: Модуль <code>datetime</code> также весьма полезен здесь:
zh_cn: <code>datetime</code> 模块在这里也非常有用：

source: The <code>pytz</code> module allows us to make our <code>datetime</code> objects timezone aware and convert the times to the hundreds of timezones available in the <code>pytz</code> module.
ja: <code>pytz</code> モジュールを使用すると、 <code>datetime</code> オブジェクトにタイムゾーンを認識させ、時間を <code>pytz</code> モジュールで使用可能な数百のタイムゾーンに変換できます。
ko: <code>pytz</code> 모듈을 사용하면 <code>datetime</code> 객체를 표준 시간대로 인식하고 시간을 <code>pytz</code> 모듈에서 사용 가능한 수백 개의 시간대로 변환 할 수 있습니다.
ru: Модуль <code>pytz</code> позволяет нам <code>datetime</code> нашим часовым поясам объектов datetime и преобразовывать время в сотни часовых поясов, доступных в модуле <code>pytz</code> .
zh_cn: <code>pytz</code> 模块允许我们使我们的 <code>datetime</code> 对象知道时区，并将时间转换为 <code>pytz</code> 模块中可用的数百个时区。

source: The <code>time</code> module
ja: <code>time</code> モジュール
ko: <code>time</code> 모듈
ru: Модуль <code>time</code>
zh_cn: <code>time</code> 模块

source: The <code>time</code> module provides functions that tells us the time in "seconds since the epoch" as well as other utilities.
ja: <code>time</code> モジュールは、「エポックからの秒数」で時間を知らせる関数と、その他のユーティリティを提供します。
ko: <code>time</code> 모듈은 다른 유틸리티뿐만 아니라 "신기원 이후의 시간"으로 시간을 알려주는 기능을 제공합니다.
ru: Модуль <code>time</code> предоставляет функции, которые сообщают нам время в &laquo;секундах с начала эпохи&raquo;, а также другие утилиты.
zh_cn: <code>time</code> 模块提供了一些功能，可以告诉我们时间&ldquo;自纪元以来的秒数&rdquo;以及其他实用程序。

source: The following is what I use to get the time without having to format. Some people don't like the split method, but it is useful here:
ja: 私がフォーマットしなくても時間を取得するために使っているのは以下のようなものです。分割法を嫌がる人もいますが、ここでは重宝しています。
ko: 다음은 형식을 지정하지 않고 시간을 얻는 데 사용하는 것입니다. 어떤 사람들은 split 방법을 좋아하지 않지만 여기서 유용합니다.
ru: Вот что я использую,чтобы получить время без необходимости форматирования.Некоторым людям не нравится метод сплит,но он полезен здесь:
zh_cn: 下面是我用的方法,不需要格式化就能得到时间。有的人不喜欢分页法,但在这里很有用。

source: The other ways of viewing times are much more error prone, especially when dealing with data that may come from different time zones. You want there to be no confusion as to which timezone a string or serialized datetime object was intended for.
ja: 他の方法で時刻を表示すると、特に異なるタイムゾーンからのデータを扱う場合には、より多くのエラーが発生しやすくなります。文字列やシリアル化されたdatetimeオブジェクトがどのタイムゾーンを対象としているのか混乱しないようにしたいものです。
ko: 시간을 보는 다른 방법은 특히 다른 시간대에서 온 데이터를 처리 할 때 오류가 발생하기 쉽습니다. 문자열 또는 직렬화 된 날짜 / 시간 객체의 시간대에 대해 혼동하지 않기를 원합니다.
ru: Другие способы просмотра времени гораздо более склонны к ошибкам,особенно при работе с данными,которые могут поступать из разных часовых поясов.Вы хотите,чтобы не было путаницы в том,для какого часового пояса предназначалась строка или сериализованный объект даты.
zh_cn: 其他查看时间的方式更容易出错,尤其是在处理来自不同时区的数据时。你希望一个字符串或序列化的日期时间对象不至于在哪个时区被混淆。

source: The output looks like below:
ja: 出力は以下のようになります。
ko: 출력은 다음과 같습니다.
ru: Выход выглядит так,как показано ниже:
zh_cn: 输出看起来像下面这个样子。

source: The previous answers are all good suggestions, but I find it easiest to use <code>ctime()</code>:
ja: 上記の答えはすべて良い提案ですが、 <code>ctime()</code> を使用するのが最も簡単です：
ko: 이전 답변은 모두 좋은 제안이지만 <code>ctime()</code> 을 사용하는 것이 가장 쉽다는 것을 알았습니다.
ru: Все предыдущие ответы - хорошие предложения, но я считаю, что проще всего использовать <code>ctime()</code> :
zh_cn: 前面的答案都是好的建议，但是我发现使用 <code>ctime()</code> 最简单：

source: The quickest way is:
ja: 一番手っ取り早いのは
ko: 가장 빠른 방법은 다음과 같습니다.
ru: Самый быстрый способ:
zh_cn: 最快捷的方法是:
