Repository: rueisnom/feedback
Catalog: xlf/41/55/11/415511.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The use of the capital <code>Y</code> gives the full year, and using <code>y</code> would give <code>06/02/15</code>.
ja: 大文字の <code>Y</code> を使用すると通年が得られ、 <code>y</code> を使用すると <code>06/02/15</code> になります。
ko: 대문자 <code>Y</code> 를 사용하면 1 년 전체가 제공 <code>06/02/15</code> <code>y</code> 를 사용하면 06/02/15가 됩니다.
ru: Использование капитала <code>Y</code> дает полный год, а использование <code>y</code> даст <code>06/02/15</code> .
zh_cn: 使用大写 <code>06/02/15</code> <code>Y</code> 表示全年，使用 <code>y</code> 表示2015年6月2日。

source: Then remove the leading <code>datetime.</code> from all of the above.
ja: 次に、先頭の <code>datetime.</code> 削除します。 上記のすべてから。
ko: 그런 다음 선행 <code>datetime.</code> 제거하십시오 . 위의 모든 것에서.
ru: Затем удалите ведущую <code>datetime.</code> из всего вышеперечисленного.
zh_cn: 然后删除前导 <code>datetime.</code> 以上所有。

source: There is some difference for Unix and Windows platforms.
ja: UnixとWindowsのプラットフォームでは多少の違いがあります。
ko: Unix와 Windows 플랫폼에는 약간의 차이가 있습니다.
ru: Есть некоторая разница для Unix и Windows платформ.
zh_cn: Unix和Windows平台有一定的区别。

source: There's a lot of standards which need addressing, including multiple RFCs and ISOs, to worry about. Ever get them mixed up; not to worry, take a little look into <code>dir(pendulum.constants)</code> There's a bit more than RFC and ISO formats there, though.
ja: 心配するために、複数のRFCやISOを含む、アドレス指定を必要とする多くの標準があります。 それらを混同してください。 心配しないで、 <code>dir(pendulum.constants)</code> を少し調べてください。ただし、そこにはRFCおよびISO形式以外にもいくつかあります。
ko: 여러 RFC 및 ISO를 포함하여 처리해야 할 표준이 많이 있습니다. 그들을 섞어 놓으십시오. 걱정하지 말고 <code>dir(pendulum.constants)</code> 조금 살펴보십시오. RFC 및 ISO 형식보다 조금 더 있습니다.
ru: Существует множество стандартов, которые необходимо учитывать, в том числе несколько RFC и ISO. Когда-нибудь перепутать их; не беспокойтесь, взгляните немного на <code>dir(pendulum.constants)</code> Там есть немного больше, чем форматы RFC и ISO.
zh_cn: 有很多需要解决的标准，包括多个RFC和ISO。 曾经把它们混在一起； 不用担心，请看一下 <code>dir(pendulum.constants)</code> ，不过那里还有RFC和ISO格式。

source: These outputs are different because the timestamp returned by <code>ctime()</code> depends on your geographical location.
ja: <code>ctime()</code> によって返されるタイムスタンプは地理的な場所に依存するため、これらの出力は異なります。
ko: <code>ctime()</code> 에 의해 반환 된 타임 스탬프는 지리적 위치에 따라 다르므로 이러한 출력은 다릅니다.
ru: Эти выходные данные отличаются, потому что метка времени, возвращаемая <code>ctime()</code> зависит от вашего географического положения.
zh_cn: 这些输出是不同的，因为 <code>ctime()</code> 返回的时间戳取决于您的地理位置。

source: This <a href="http://docs.python.org/library/time.html#module-time">page</a> has more details.
ja: この<a href="http://docs.python.org/library/time.html#module-time">ページに</a>は詳細があります。
ko: 이 <a href="http://docs.python.org/library/time.html#module-time">페이지</a> 에 자세한 내용이 있습니다.
ru: Эта <a href="http://docs.python.org/library/time.html#module-time">страница</a> имеет более подробную информацию.
zh_cn: 此<a href="http://docs.python.org/library/time.html#module-time">页面</a>有更多详细信息。

source: This conversion is also not good for record-keeping (except in text that will only be parsed by humans - and with improved Optical Character Recognition and Artificial Intelligence, I think the number of these cases will diminish).
ja: この変換も記録保存にはよくありません(人間が解析するだけのテキストは別ですが--光学式文字認識や人工知能が向上すれば、このようなケースは少なくなると思います)。
ko: 이 변환은 또한 기록을 유지하는 데 좋지 않습니다 (인간에 의해서만 구문 분석되는 텍스트는 제외하고 광학 문자 인식 및 인공 지능이 향상됨에 따라 이러한 사례의 수가 줄어들 것으로 생각합니다).
ru: Это преобразование также не очень хорошо для ведения учета (за исключением текста,который будет анализироваться только людьми-и с улучшенным оптическим распознаванием символов и искусственным интеллектом,я думаю,что количество таких случаев уменьшится).
zh_cn: 这样的转换也不利于记录保存(除非是只有人类才能解析的文本--随着光学字符识别和人工智能的改进,我想这种情况会越来越少)。

source: This gives a nicely formatted string representation of the current local time.
ja: これは、現在のローカルタイムをきれいにフォーマットされた文字列で表現します。
ko: 이것은 현재 현지 시간의 형식이 잘 지정된 문자열 표현을 제공합니다.
ru: Это дает красиво отформатированное строковое представление текущего локального времени.
zh_cn: 这就给了当前本地时间一个很好的格式化字符串表示。

source: This is not ideal for human scheduling, however. If you have a future event you wish to take place at a certain point in time, you'll want to store that time with a string that can be parsed into a datetime object or a serialized datetime object (these will be described later).
ja: しかし、これは人間によるスケジューリングには向いていません。ある時点での将来のイベントがある場合、その時刻を datetime オブジェクトやシリアライズされた datetime オブジェクトにパースできる文字列で保存したいと思うでしょう (これらについては後述します)。
ko: 그러나 이것은 사람 스케줄링에는 이상적이지 않습니다. 특정 시점에서 진행하려는 미래의 이벤트가있는 경우 날짜 시간 오브젝트 또는 직렬화 된 날짜 시간 오브젝트로 구문 분석 할 수있는 문자열로 해당 시간을 저장하려고합니다 (이에 대해서는 나중에 설명 함).
ru: Однако это не идеально для человеческого планирования.Если у вас есть будущее событие,которое вы хотите провести в определенный момент времени,вы захотите сохранить это время со строкой,которую можно разобрать на объект даты или сериализованный объект времени даты (они будут описаны позже).
zh_cn: 但是,这并不是人类调度的理想选择。如果你有一个未来事件希望在某个时间点发生,你会希望用一个可以解析成日期时间对象或序列化的日期时间对象的字符串来存储这个时间(这些将在后面描述)。

source: This is the format you should get timestamps in for saving in databases. It is a simple floating point number that can be converted to an integer. It is also good for arithmetic in seconds, as it represents the number of seconds since Jan 1, 1970 00:00:00, and it is memory light relative to the other representations of time we'll be looking at next:
ja: これは、データベースに保存するためにタイムスタンプを取得するためのフォーマットです。単純な浮動小数点数で、整数に変換することができます。1970年1月1日 00:00:00:00からの秒数を表しているので、秒単位の算術にも適しています。
ko: 이것은 데이터베이스에 저장하기 위해 타임 스탬프를 가져와야하는 형식입니다. 정수로 변환 할 수있는 간단한 부동 소수점 숫자입니다. 1970 년 1 월 1 일 00:00:00 이후의 초 수를 나타내므로 초 단위로 산술에 유용하며, 다음에 살펴볼 다른 시간 표현에 비해 메모리가 적습니다.
ru: Это формат,в котором необходимо получить временные метки для сохранения в базах данных.Это простое число с плавающей точкой,которое можно преобразовать в целое число.Он также хорош для арифметики в секундах,так как представляет собой количество секунд с 1 января 1970 00:00:00,и это светлая память по отношению к другим представлениям времени,на которые мы будем смотреть дальше:
zh_cn: 这是你在数据库中保存时间戳的格式。它是一个简单的浮点数,可以转换为整数。它也适用于以秒为单位的算术,因为它代表了从1970年1月1日00:00:00:00开始的秒数,相对于我们接下来要看的其他时间表示方式,它的内存较小。

source: This is what I ended up going with:
ja: 結局これで行くことになりました。
ko: 이것이 내가 끝내는 것입니다.
ru: Вот с чем я закончил:
zh_cn: 这就是我最后的选择。

source: This question doesn't need a new answer just for the sake of it ... a shiny new-ish toy/module, however, is enough justification. That being the <a href="https://pendulum.eustace.io/docs/">Pendulum library</a>, which appears to do the sort of things which arrow attempted, except without the inherent flaws and bugs which beset arrow.
ja: この質問はそれのためだけに新しい答えを必要としません...しかし、光沢のある新しい風のおもちゃ/モジュールは、十分な正当化です。 それは、矢印を妨げる固有の欠陥やバグがないことを除いて、矢印が試みたようなことを行うように見える<a href="https://pendulum.eustace.io/docs/">振り子ライブラリ</a>です。
ko: 이 질문은 단지 그것을 위해 새로운 대답이 필요하지 않습니다. 그러나 반짝이는 새로운 장난감 / 모듈이지만 충분합니다. 그것은 <a href="https://pendulum.eustace.io/docs/">진자 라이브러리</a> 인데, 화살표가있는 고유의 결함과 버그가 없다면 화살표가 시도한 것들을하는 것처럼 보입니다.
ru: Этот вопрос не нуждается в новом ответе только ради этого ... блестящая новая игрушка / модуль, однако, является достаточным оправданием. Это <a href="https://pendulum.eustace.io/docs/">библиотека маятника</a> , которая, похоже, выполняет те действия, которые предпринимала стрелка, за исключением тех недостатков, которые присущи стрелке.
zh_cn: 这个问题并不仅仅是为了这个问题而需要一个新的答案&hellip;&hellip;但是，一个闪亮的新玩具/模块已经足够了。 那就是<a href="https://pendulum.eustace.io/docs/">Pendulum库</a> ，它似乎可以完成arrow尝试的各种工作，但没有固有的缺陷和bug困扰着arrow。

source: This timestamp does not account for leap-seconds, so it's not linear - leap seconds are ignored. So while it is not equivalent to the international UTC standard, it is close, and therefore quite good for most cases of record-keeping.
ja: このタイムスタンプはうるう秒を考慮していないので、直線的ではない-うるう秒は無視される。そのため、国際的なUTC標準とは同等ではありませんが、近いので、ほとんどの場合の記録保存には非常に適しています。
ko: 이 타임 스탬프는 윤초를 설명하지 않으므로 선형이 아닙니다. 윤초는 무시됩니다. 따라서 국제 UTC 표준과 동일하지는 않지만 표준에 가깝기 때문에 대부분의 레코드 관리에 적합합니다.
ru: Эта метка времени не учитывает високосные секунды,поэтому она не линейная-високосные секунды игнорируются.Таким образом,хотя она и не эквивалентна международному стандарту UTC,она близка,а значит,достаточно хороша для большинства случаев ведения учета.
zh_cn: 这个时间戳不考虑闰秒,所以它不是线性的--闰秒被忽略了。因此,虽然它不等同于国际UTC标准,但它很接近,因此对于大多数情况下的记录保存来说是相当不错的。

source: To change its output, add .format():
ja: 出力を変更するには、.format()を追加します。
ko: 출력을 변경하려면 .format ()을 추가하십시오.
ru: Чтобы изменить его вывод,добавьте .format():
zh_cn: 要改变其输出,请添加.format()。

source: To get the hours, minutes, seconds and milliseconds to merge later, you can use these functions:
ja: 後でマージする時、分、秒、ミリ秒を取得するには、これらの関数を使用することができます。
ko: 나중에 병합 할 시간, 분, 초 및 밀리 초를 얻으려면 다음 함수를 사용할 수 있습니다.
ru: Чтобы получить часы,минуты,секунды и миллисекунды для слияния позже,вы можете использовать эти функции:
zh_cn: 要获得时、分、秒和毫秒的合并时间,可以使用这些功能。

source: To save typing, you can import the <code>datetime</code> object from the <code>datetime</code> module:
ja: 入力を節約するために、 <code>datetime</code> モジュールから <code>datetime</code> オブジェクトをインポートできます。
ko: 입력을 저장하기 위해 <code>datetime</code> 모듈에서 <code>datetime</code> 객체를 가져올 수 있습니다.
ru: Чтобы сохранить ввод, вы можете импортировать объект <code>datetime</code> из модуля <code>datetime</code> :
zh_cn: 要保存类型，可以从 <code>datetime</code> 模块导入 <code>datetime</code> 对象：

source: Try the arrow module from <a href="http://crsmithdev.com/arrow/">http://crsmithdev.com/arrow/</a>:
ja: <a href="http://crsmithdev.com/arrow/">http://crsmithdev.com/arrow/</a>のarrowモジュールを試してください 。
ko: <a href="http://crsmithdev.com/arrow/">http://crsmithdev.com/arrow/</a> 에서 화살표 모듈을 사용해보십시오.
ru: Попробуйте модуль стрелок с <a href="http://crsmithdev.com/arrow/">http://crsmithdev.com/arrow/</a> :
zh_cn: 试用<a href="http://crsmithdev.com/arrow/">http://crsmithdev.com/arrow/中</a>的箭头模块：

source: UTC is a time standard that is nearly equivalent to the GMT timezone. (While GMT and UTC do not change for Daylight Savings Time, their users may switch to other timezones, like British Summer Time, during the Summer.)
ja: UTCは、GMTタイムゾーンとほぼ同等の時間基準です。(GMTとUTCは夏時間には変更されませんが、ユーザーは夏の間、イギリスの夏時間のような他のタイムゾーンに切り替えることができます)。
ko: UTC는 GMT 시간대와 거의 동일한 시간 표준입니다. GMT 및 UTC는 일광 절약 시간 제로 변경되지 않지만 사용자는 여름 동안 영국 서머 타임과 같은 다른 시간대로 전환 할 수 있습니다.
ru: UTC-это стандарт времени,который почти эквивалентен часовому поясу по Гринвичу.(В то время как GMT и UTC не меняются для летнего времени,их пользователи могут переключаться на другие часовые пояса,как британское летнее время,во время лета).
zh_cn: UTC是一个时间标准,几乎等同于格林尼治标准时间。(虽然GMT和UTC不因夏令时而改变,但其用户可以在夏季期间切换到其他时区,如英国夏季时间)。

source: Unix Epoch Time
ja: ユニックスエポックじかん
ko: 유닉스 시대
ru: Эпоха Unix

source: Using <a href="https://en.wikipedia.org/wiki/Pandas_%28software%29">pandas</a> to get the current time, kind of overkilling the problem at hand:
ja: <a href="https://en.wikipedia.org/wiki/Pandas_%28software%29">パンダ</a>を使用して現在の時刻を取得し、目の前の問題を打ち倒します：
ko: <a href="https://en.wikipedia.org/wiki/Pandas_%28software%29">팬더</a> 를 사용하여 현재 시간을 가져 와서 당면한 문제 를 극복하십시오.
ru: Используя <a href="https://en.wikipedia.org/wiki/Pandas_%28software%29">панд,</a> чтобы узнать текущее время, можно решить проблему:
zh_cn: 使用<a href="https://en.wikipedia.org/wiki/Pandas_%28software%29">熊猫</a>来获取当前时间，有点过头了：

source: What is the module/method used to get the current time?
ja: 現在の時刻を取得するためのmodulemethodは何を使っているのでしょうか?
ko: 현재 시간을 얻는 데 사용되는 모듈 / 방법은 무엇입니까?
ru: Какой метод модуля используется для получения текущего времени?
zh_cn: 模块方法用于获取当前时间的模块方法是什么?

source: When we say local, though what do we mean? Well I mean:
ja: 地元と言っても何を意味するの?それは......
ko: 우리가 현지인이라고 할 때, 우리는 무엇을 의미합니까? 글쎄, 내 말은 :
ru: Когда мы говорим "местный",что мы имеем в виду? Ну,я имею в виду:
zh_cn: 当我们说本地的时候,我们是什么意思?嗯,我的意思是:

source: Why not ask the <a href="http://tycho.usno.navy.mil/cgi-bin/timer.pl">U.S. Naval Observatory</a>, the official timekeeper of the United States Navy?
ja: <a href="http://tycho.usno.navy.mil/cgi-bin/timer.pl">アメリカ海軍</a>の公式計時係であるアメリカ海軍天文台に聞いてみませんか？
ko: <a href="http://tycho.usno.navy.mil/cgi-bin/timer.pl">미국 해군</a> 의 공식 계시 원인 미 해군 천문대에 물어보십시오.
ru: Почему бы не спросить <a href="http://tycho.usno.navy.mil/cgi-bin/timer.pl">Военно-морскую обсерваторию США</a> , официального хронометриста ВМС США?
zh_cn: 为什么不问<a href="http://tycho.usno.navy.mil/cgi-bin/timer.pl">美国海军</a>的官方计时器美国海军天文台呢？

source: You can also make a naive datetime object aware with the <code>pytz</code> timezone <code>localize</code> method, or by replacing the tzinfo attribute (with <code>replace</code>, this is done blindly), but these are more last resorts than best practices:
ja: また、 <code>pytz</code> timezone <code>localize</code> メソッドを使用するか、tzinfo属性を <code>replace</code> ことにより、 単純なdatetimeオブジェクトを認識させることもできます（ replaceを使用すると 、これは盲目的に行われます）。しかし、これらはベストプラクティスよりも最後の手段です。
ko: 또한 <code>pytz</code> 시간대 <code>localize</code> 메소드를 사용하거나 tzinfo 속성을 바꾸면 (맹목적으로 수행됨) 순진한 datetime 객체를 인식 할 수 있지만 다음은 모범 사례보다 최후의 수단입니다.
ru: Вы также можете сделать наивный объект datetime осведомленным с помощью метода <code>localize</code> <code>pytz</code> timezone или путем замены атрибута tzinfo (с <code>replace</code> , это делается вслепую), но это более поздние варианты, чем лучшие практики:
zh_cn: 您还可以使用 <code>pytz</code> timezone <code>localize</code> 方法或通过替换tzinfo属性（使用 <code>replace</code> ，这是盲目的完成）来使幼稚的datetime对象知道，但是这些方法比最佳实践更多地是不得已 ：

source: You can also represent the current time in the way preferred by your operating system (which means it can change when you change your system preferences, so don't rely on this to be standard across all systems, as I've seen others expect). This is typically user friendly, but doesn't typically result in strings one can sort chronologically:
ja: また、現在の時刻をオペレーティングシステムが好む方法で表現することもできます(つまり、システムの環境設定を変更すると変更される可能性があるので、他の人が期待しているように、すべてのシステムで標準的であることに頼らないでください)。これは一般的にはユーザーフレンドリーですが、通常は時系列でソートできるような文字列にはなりません。
ko: 운영 체제에서 선호하는 방식으로 현재 시간을 나타낼 수도 있습니다 (즉, 시스템 환경 설정을 변경할 때 시간이 변경 될 수 있으므로 다른 시스템에서 예상 한대로 모든 시스템에서 표준으로 사용하지 마십시오) . 이것은 일반적으로 사용자 친화적이지만 일반적으로 시간순으로 정렬 할 수있는 문자열을 생성하지는 않습니다.
ru: Вы также можете представлять текущее время так,как предпочитает ваша операционная система (что означает,что оно может измениться,когда вы меняете системные предпочтения,поэтому не полагайтесь на это,чтобы быть стандартным для всех систем,как я видел,что ожидают другие).Это обычно удобно для пользователя,но обычно не приводит к строкам,которые можно отсортировать в хронологическом порядке:
zh_cn: 你也可以用你的操作系统所喜欢的方式来表示当前的时间(这意味着当你改变系统偏好时,它可能会改变,所以不要像我看到的其他人所期望的那样,依赖这一点成为所有系统的标准配置)。这通常是对用户友好的,但通常不会产生可以按时间顺序排序的字符串。

source: You can do so using ctime():
ja: これは ctime()を使用して行うことができます。
ko: ctime ()을 사용하면됩니다 :
ru: Вы можете сделать это с помощью ctime():
zh_cn: 你可以用ctime()来做。

source: You can get a datetime object in UTC time, a global standard, by doing this:
ja: このようにすることで、グローバルスタンダードであるUTC時間のdatetimeオブジェクトを取得することができます。
ko: 다음을 수행하여 글로벌 표준 인 UTC 시간으로 datetime 객체를 얻을 수 있습니다.
ru: Вы можете получить объект даты в UTC время,глобальный стандарт,сделав это:
zh_cn: 你可以通过这样做得到一个全局标准UTC时间的日期时间对象。

source: You can hydrate timestamps into human readable form with <code>ctime</code> as well:
ja: <code>ctime</code> を使用して、タイムスタンプを人間が読める形式にハイドレートすることもできます。
ko: <code>ctime</code> 을 사용하여 타임 스탬프를 사람이 읽을 수있는 형태로 수화 할 수 있습니다.
ru: Вы также можете перевести метки времени в удобочитаемую форму с помощью <code>ctime</code> :
zh_cn: 您也可以使用 <code>ctime</code> 将时间戳混合为易于阅读的形式：

source: You can use <a href="http://docs.python.org/3.3/library/time.html?highlight=time.strftime#time.strftime"><code>time.strftime()</code></a>:
ja: あなたは<a href="http://docs.python.org/3.3/library/time.html?highlight=time.strftime#time.strftime"> <code>time.strftime()</code> </a>を使うことができます：
ko: <a href="http://docs.python.org/3.3/library/time.html?highlight=time.strftime#time.strftime"> <code>time.strftime()</code> </a> 사용할 수 있습니다 :
ru: Вы можете использовать <a href="http://docs.python.org/3.3/library/time.html?highlight=time.strftime#time.strftime"> <code>time.strftime()</code> </a> :
zh_cn: 您可以使用<a href="http://docs.python.org/3.3/library/time.html?highlight=time.strftime#time.strftime"> <code>time.strftime()</code> </a> ：

source: You can use the <code>time</code> module:
ja: あなたは <code>time</code> モジュールを使うことができます：
ko: <code>time</code> 모듈을 사용할 수 있습니다.
ru: Вы можете использовать модуль <code>time</code> :
zh_cn: 您可以使用 <code>time</code> 模块：

source: You can use this function to get the time (unfortunately it doesn't say AM or PM):
ja: この機能を使って時間を取得することができます(残念ながらAMやPMとは書いていません)。
ko: 이 함수를 사용하여 시간을 얻을 수 있습니다 (불행히도 AM 또는 PM은 표시되지 않음).
ru: Вы можете использовать эту функцию,чтобы получить время (к сожалению,там не написано AM или PM):
zh_cn: 你可以用这个功能来获取时间(可惜它没有写上AM或PM)。

source: You could also use the following code to give a more lengthy time:
ja: また、以下のコードを使用することで、より長い時間を与えることができます。
ko: 다음 코드를 사용하여 더 긴 시간을 제공 할 수도 있습니다.
ru: Вы также можете использовать следующий код,чтобы дать более длительное время:
zh_cn: 你也可以用下面的代码来给出一个比较长的时间。

source: datetime timezone aware
ja: 日付時間時間帯認識
ko: 날짜 시간 시간대 인식
ru: указанное время
zh_cn: 时区意识

source: datetime's <code>utcnow</code>
ja: 日時の <code>utcnow</code>
ko: 날짜 시간의 <code>utcnow</code>
ru: <code>utcnow</code>
zh_cn: 日期时间的 <code>utcnow</code>

source: for only date:
ja: 日付だけのために。
ko: 날짜 만 :
ru: только на свидание:
zh_cn: 只为日期。

source: if you are using numpy already then directly you can use numpy.datetime64() function.
ja: もしすでにnumpyを使っているのであれば、直接numpy.datetime64()関数を使うことができます。
ko: numpy를 이미 사용하고 있다면 numpy.datetime64 () 함수를 직접 사용할 수 있습니다.
ru: если вы уже используете numpy,то непосредственно вы можете использовать функцию numpy.datetime64().
zh_cn: 如果你已经在使用numpy,那么你可以直接使用numpy.datetime64()函数。

source: or, if you are using pandas already then you can use pandas.to_datetime() function
ja: あるいは、すでにパンダを使用している場合は、pandas.to_datetime()関数を使用することができます。
ko: 또는 이미 판다를 사용하고 있다면 pandas.to_datetime () 함수를 사용할 수 있습니다
ru: или,если вы уже используете pandas,вы можете использовать функцию pandas.to_datetime().
zh_cn: 或者,如果你已经在使用pandas,那么你可以使用pandas.to_datetime()函数
