Repository: rueisnom/feedback
Catalog: xlf/14/20/03/142003.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The GUI form is unaware the controller is running asynchronous tasks.
es: El formulario GUI no sabe que el controlador está ejecutando tareas asincrónicas.
ja: GUIフォームは、コントローラが非同期タスクを実行していることに気づかない。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GUI 양식은 컨트롤러가 비동기 작업을 실행하고 있다는 것을 인식하지 못합니다.</font></font>
ru: Форма GUI не знает,что контроллер выполняет асинхронные задачи.
zh_cn: GUI形式不知道控制器正在运行异步任务。

source: The UI Thread
es: El hilo de la UI
ja: UIスレッド
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 스레드</font></font>
ru: Нитка пользовательского интерфейса
zh_cn: UI 线程

source: The cleanest (and proper) solution for UI cross-threading issues is to use SynchronizationContext, see <a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx">Synchronizing calls to the UI in a multi-threaded application</a> article, it explains it very nicely.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La soluci&oacute;n m&aacute;s limpia (y adecuada) para los problemas de subprocesos cruzados de la interfaz de usuario es usar SynchronizationContext, consulte </font></font><a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sincronizar llamadas a la interfaz de usuario en un</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> art&iacute;culo de </font><font style="vertical-align: inherit;">aplicaci&oacute;n multiproceso</font><font style="vertical-align: inherit;"> , lo explica muy bien.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UIクロススレッドの問題に対する最もクリーンな（そして適切な）ソリューションは、SynchronizationContextを使用</font><font style="vertical-align: inherit;">することです。</font></font><a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">マルチスレッドアプリケーションの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事で</font><font style="vertical-align: inherit;">UIへの呼び出しの</font><font style="vertical-align: inherit;">同期を参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 크로스 스레딩 문제에 대한 가장 깨끗하고 적절한 솔루션은 SynchronizationContext를 사용 </font></font><a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하는 것입니다. 다중 스레드 응용 프로그램</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기사 </font><font style="vertical-align: inherit;">에서 UI에 대한 호출</font><font style="vertical-align: inherit;"> 동기화를 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Самое чистое (и правильное) решение для проблем многопоточности пользовательского интерфейса - это использование SynchronizationContext, см. </font><font style="vertical-align: inherit;">Статью </font></font><a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Синхронизация вызовов пользовательского интерфейса в</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> статье о </font><font style="vertical-align: inherit;">многопоточных приложениях</font><font style="vertical-align: inherit;"> , это очень хорошо объясняется.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决UI跨线程问题的最干净（也是正确的）解决方案是使用SynchronizationContext，请参阅</font></font><a href="http://www.lostechies.com/blogs/gabrielschenker/archive/2009/01/23/synchronizing-calls-to-the-ui-in-a-multi-threaded-application.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多线程应用程序</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文章</font><font style="vertical-align: inherit;">中的&ldquo;同步对UI的调用</font><font style="vertical-align: inherit;"> &rdquo;，它很好地解释了该问题。</font></font>

source: The computing overhead of method being invoked should be small as well as computing overhead of event handler methods because the UI thread is used there - the same that is responsible for handling user input. Regardless if this is <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx">System.Windows.Forms.Control.Invoke</a> or <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx">System.Windows.Forms.Control.BeginInvoke</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La sobrecarga inform&aacute;tica del m&eacute;todo que se invoca debe ser peque&ntilde;a, as&iacute; como la sobrecarga inform&aacute;tica de los m&eacute;todos de manejo de eventos porque el subproceso UI se usa all&iacute;, el mismo responsable de manejar la entrada del usuario. </font><font style="vertical-align: inherit;">Independientemente de si se trata de </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出されるメソッドの計算オーバーヘッドは、イベントハンドラーメソッドの計算オーバーヘッドと同様に小さくなければなりません。これは、UIスレッドがそこで使用されるため、ユーザー入力の処理と同じです。</font><font style="vertical-align: inherit;">これが</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvokeである</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">か</font><font style="vertical-align: inherit;">どうかに関係なく</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 스레드가 사용되기 때문에 호출되는 메소드의 컴퓨팅 오버 헤드는 작고 이벤트 핸들러 메소드의 오버 헤드도 작아야합니다. 이는 사용자 입력을 처리하는 것과 동일합니다. </font><font style="vertical-align: inherit;">에 관계없이이 경우 </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Затраты на обработку вызываемого метода должны быть небольшими, а также затраты на обработку методов-обработчиков событий, поскольку там используется поток пользовательского интерфейса - тот же, что отвечает за обработку пользовательского ввода. </font><font style="vertical-align: inherit;">Независимо от того, является ли это </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">被调用的方法的计算开销应该和事件处理程序方法的计算开销一样小，因为在那里使用了UI线程-负责处理用户输入的线程。</font><font style="vertical-align: inherit;">无论是</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还是</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The control then uses the current form object to deal with the events, and will therefore be on the same thread.
es: El control utiliza entonces el objeto de forma actual para tratar los eventos,y por lo tanto estará en el mismo hilo.
ja: コントロールは現在のフォームオブジェクトを使用してイベントを処理します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 컨트롤은 현재 폼 개체를 사용하여 이벤트를 처리하므로 동일한 스레드에있게됩니다.</font></font>
ru: Затем элемент управления использует объект текущей формы для обработки событий,и,следовательно,будет находиться в том же потоке.
zh_cn: 然后该控件使用当前窗体对象来处理事件,因此将在同一线程上。

source: The pseudocode would look like this:
es: El pseudocódigo se vería así:
ja: 疑似コードは次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의사 코드는 다음과 같습니다.</font></font>
ru: Псевдокод будет выглядеть вот так:
zh_cn: 伪代码看起来是这样的。

source: The solution you want then should look like:
es: La solución que quieres entonces debe parecer:
ja: あなたが望む解決策は次のようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원하는 솔루션은 다음과 같습니다.</font></font>
ru: Тогда решение,которое ты хочешь,должно выглядеть так:
zh_cn: 那么你想要的解决方案应该是这样的。

source: The user control does some heavy data operation, such that if I directly call the <code>UserControl_Load</code> method the UI become nonresponsive for the duration for load method execution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El control de usuario realiza algunas operaciones de datos pesados, de modo que si llamo directamente al </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>UserControl_Load</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la interfaz de usuario deja de responder durante la ejecuci&oacute;n del m&eacute;todo de carga.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ユーザーコントロールが重いデータ操作を行うため、</font></font> <code>UserControl_Load</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">を直接呼び出すと、</font><font style="vertical-align: inherit;">ロードメソッドの実行中、UIが応答しなくなります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 정의 컨트롤은 무거운 데이터 작업을 수행하므로 </font></font> <code>UserControl_Load</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메서드를 </font><font style="vertical-align: inherit;">직접 호출하면 </font><font style="vertical-align: inherit;">로드 메서드 실행 기간 동안 UI가 응답 </font><font style="vertical-align: inherit;">하지 않습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пользовательский элемент управления выполняет некоторую сложную операцию с данными, так что если я напрямую вызываю </font><font style="vertical-align: inherit;">метод </font></font> <code>UserControl_Load</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пользовательский интерфейс перестает отвечать на запросы при выполнении метода загрузки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用户控件执行一些繁重的数据操作，因此，如果我直接调用</font></font> <code>UserControl_Load</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法，则UI在装入方法执行期间将无响应。</font></font>

source: There are two options for cross thread operations.
es: Hay dos opciones para las operaciones de hilo cruzado.
ja: クロススレッド操作には2つのオプションがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교차 스레드 작업에는 두 가지 옵션이 있습니다.</font></font>
ru: Существует два варианта операций с поперечной резьбой.
zh_cn: 有两个选项可以进行跨线程操作。

source: There is a main form which hosts some user control.
es: Hay un formulario principal que alberga algún control de usuario.
ja: いくつかのユーザコントロールをホストするメインフォームがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 사용자 정의 컨트롤을 호스팅하는 기본 양식이 있습니다.</font></font>
ru: Существует основная форма,в которой размещен некоторый пользовательский контроль.
zh_cn: 有一个主形式,它承载着一些用户控制。

source: There is only one thread (UI thread), that is allowed to access <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx">System.Windows.Forms.Control</a> and its subclasses members.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Solo hay un subproceso (subproceso de interfaz de usuario), que puede acceder a </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y sus miembros de subclases.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とそのサブクラスのメンバー</font><font style="vertical-align: inherit;">へのアクセスが許可されているスレッドは1つだけ（UIスレッド）</font><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 해당 서브 클래스 멤버 </font><font style="vertical-align: inherit;">에 액세스 할 수있는 스레드 (UI 스레드)는 하나뿐입니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует только один поток (поток пользовательского интерфейса), которому разрешен доступ к </font><font style="vertical-align: inherit;">элементам </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и его подклассам.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只有一个线程（UI线程）被允许访问</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">及其子类成员。</font></font>

source: This is how i access any form control from a thread.
es: Así es como accedo a cualquier forma de control desde un hilo.
ja: これは、スレッドからフォームコントロールにアクセスする方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 스레드에서 양식 컨트롤에 액세스하는 방법입니다.</font></font>
ru: Так я получаю доступ к управлению любой формой из потока.
zh_cn: 这就是我如何从一个线程中访问任何表单控制。

source: This is not the recommended way to solve this error but you can suppress it quickly, it will do the job . I prefer this for prototypes or demos . add
es: Esta no es la forma recomendada de resolver este error pero puedes suprimirlo rápidamente,hará el trabajo.Prefiero esto para los prototipos o las demostraciones.Añada
ja: これは、このエラーを解決するための推奨される方法ではありませんが、あなたはすぐにそれを抑制することができますが、それは仕事をします.私はプロトタイプやデモのためにこれを好む。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은이 오류를 해결하기 위해 권장되는 방법은 아니지만 빠르게 억제하여 작업을 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">나는 이것을 프로토 타입이나 데모에 선호한다. </font><font style="vertical-align: inherit;">더하다</font></font>
ru: Это не является рекомендуемым способом решения данной ошибки,но вы можете быстро ее подавить,она будет выполнять свою работу.Я предпочитаю это для прототипов или демо-версий.add
zh_cn: 这不是推荐的解决这个错误的方法,但你可以快速地抑制它,它将完成工作。我更喜欢这个方法来做原型或演示。

source: This is useful if you are working with the main form in a class other than the main form with an object that is in the main form, but doesn't have InvokeRequired
es: Esto es útil si estás trabajando con la forma principal en una clase distinta de la forma principal con un objeto que está en la forma principal,pero que no tiene InvokeRequired
ja: これは、メインフォームにあるオブジェクトでメインフォーム以外のクラスで、InvokeRequiredを持たないオブジェクトで作業する場合に便利です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 메인 폼에 있지만 InvokeRequired가없는 객체를 가진 메인 폼 이외의 클래스에서 메인 폼으로 작업 할 때 유용합니다.</font></font>
ru: Это полезно,если вы работаете с основной формой в классе,отличном от основной формы,с объектом,который находится в основной форме,но у которого нет InvokeRequired
zh_cn: 当你在主窗体以外的类中使用主窗体中的对象,但没有InvokeRequired的对象时,这很有用

source: Threading Model in UI
es: Modelo de rosca en la interfaz de usuario
ja: UIのスレッドモデル
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI의 스레딩 모델</font></font>
ru: Модель резьбы в пользовательском интерфейсе
zh_cn: UI中的线程模型

source: To know more about this I did some googling and a suggestion came up like using the following code
es: Para saber más sobre esto,busqué en Google y surgió una sugerencia como usar el siguiente código
ja: これについての詳細を知るために、私はいくつかのグーグルで検索し、提案は、次のコードを使用してのように出てきた。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것에 대해 더 많이 알기 위해 인터넷 검색을했고 다음 코드를 사용하는 것처럼 제안이 나왔습니다.</font></font>
ru: Чтобы узнать об этом побольше,я погуглил и предложил использовать следующий код.
zh_cn: 为了了解更多关于这个问题,我做了一些googling,并提出了一个建议,如使用以下代码

source: To overcome this I load data on different thread (trying to change existing code as little as I can)
es: Para superar esto,cargo los datos en un hilo diferente (tratando de cambiar el código existente lo menos posible)
ja: これを克服するために、私は別のスレッドでデータをロードしています(既存のコードを少しでも変更しようとしています)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 극복하기 위해 다른 스레드에 데이터를로드합니다 (가능한 한 적은 기존 코드를 변경하려고 시도 함)</font></font>
ru: Для преодоления этого я загружаю данные в другой поток (пытаясь изменить существующий код как можно меньше).
zh_cn: 为了克服这个问题,我将数据加载到不同的线程上(尽量少修改现有的代码)。
