Repository: rueisnom/feedback
Catalog: xlf/14/20/03/142003.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In order to use mentioned gaps use <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx">System.Windows.Forms.Control.Invoke</a> or <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx">System.Windows.Forms.Control.BeginInvoke</a> methods:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para usar las brechas mencionadas, use los </font><font style="vertical-align: inherit;">m&eacute;todos </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のギャップを使用するには、</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">使用し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언급 된 간격을 사용하려면 </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы использовать упомянутые пробелы, используйте </font><font style="vertical-align: inherit;">методы </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为了使用提到的差距，请使用</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法：</font></font>

source: It works the same as above, but it is a different approach if you don't have an object with invokerequired, but do have access to the MainForm
es: Funciona igual que arriba,pero es un enfoque diferente si no se tiene un objeto con invocación requerida,pero sí se tiene acceso al MainForm
ja: 上記と同じように動作しますが、invokerequiredを持つオブジェクトを持っていなくてもMainFormにアクセスできる場合は別のアプローチになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위와 동일하게 작동하지만 invokerequired가있는 객체는 없지만 MainForm에 액세스 할 수있는 경우 다른 방법입니다.</font></font>
ru: Он работает так же,как и выше,но это другой подход,если у Вас нет объекта с запросом на вызов,но у Вас есть доступ к MainForm
zh_cn: 它的工作原理与上述相同,但如果你没有一个带invokerequired的对象,但你有访问MainForm的权限,那就是不同的方法了。

source: No more messing around - simple.
es: No más tonterías...simple.
ja: これ以上のごちゃごちゃしたことはありません-シンプル。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 이상 혼란스럽지 않습니다-간단합니다.</font></font>
ru: Больше никаких шуток-просто.
zh_cn: 不用再瞎折腾了--简单。

source: Now came a real problem. All the UI (main form and its child usercontrols) was created on the primary main thread. In the LOAD method of the usercontrol I'm fetching data based on the values of some control (like textbox) on userControl.
es: Ahora llegó un verdadero problema.Toda la UI (forma principal y sus controles de usuario hijo)fue creada en el hilo principal primario.En el método LOAD del usercontrol estoy buscando datos basados en los valores de algún control (como textbox)en el userControl.
ja: 今、本当の問題が来ました。すべてのUI(メインフォームとその子usercontrols)はプライマリメインスレッドで作成されました。usercontrolのLOADメソッドでは、userControl上のいくつかのコントロール(テキストボックスのような)の値に基づいてデータをフェッチしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 진짜 문제가 생겼습니다. </font><font style="vertical-align: inherit;">모든 UI (기본 양식 및 해당 하위 사용자 컨트롤)는 기본 기본 스레드에서 작성되었습니다. </font><font style="vertical-align: inherit;">usercontrol의 LOAD 메소드에서 userControl의 텍스트 상자와 같은 일부 컨트롤 값을 기반으로 데이터를 가져옵니다.</font></font>
ru: Теперь появилась настоящая проблема.Весь пользовательский интерфейс (основная форма и его дочерние юзерконтроли)был создан на основном основном потоке.В методе LOAD юзерконтроля я получаю данные,основанные на значениях некоторого элемента управления (например,текстового поля)на userControl.
zh_cn: 现在,一个真正的问题来了。所有的UI(主窗体和它的子用户控件)都是在主线程上创建的。在usercontrol的LOAD方法中,我根据userControl上的一些控件(如textbox)的值来获取数据。

source: Please read the <em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx">Threading Model</a></em> in UI applications in order to understand basic concepts. The link navigates to page that describes the WPF threading model. However, Windows Forms utilizes the same idea.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lea el </font></font><em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Modelo de subprocesos</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en las aplicaciones de IU para comprender los conceptos b&aacute;sicos. </font><font style="vertical-align: inherit;">El enlace navega a la p&aacute;gina que describe el modelo de subprocesos WPF. </font><font style="vertical-align: inherit;">Sin embargo, Windows Forms utiliza la misma idea.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本的な概念を理解するには、UIアプリケーションの</font></font><em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スレッドモデルを</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">お読みください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">リンクは、WPFスレッドモデルを説明するページに移動します。</font><font style="vertical-align: inherit;">ただし、Windowsフォームは同じ考え方を利用しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 개념을 이해하려면 UI 응용 프로그램에서 </font></font><em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레딩 모델</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">읽으십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">링크는 WPF 스레딩 모델을 설명하는 페이지로 이동합니다. </font><font style="vertical-align: inherit;">그러나 Windows Forms는 동일한 아이디어를 사용합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пожалуйста, ознакомьтесь с </font></font><em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">моделью потоков</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в приложениях пользовательского интерфейса, чтобы понять основные понятия. </font><font style="vertical-align: inherit;">Ссылка переходит на страницу, которая описывает модель потоков WPF. </font><font style="vertical-align: inherit;">Тем не менее, Windows Forms использует ту же идею.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请阅读</font><font style="vertical-align: inherit;">UI应用程序中</font><font style="vertical-align: inherit;">的</font></font><em><a href="https://msdn.microsoft.com/library/ms741870(v=vs.100).aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">线程模型</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以了解基本概念。</font><font style="vertical-align: inherit;">链接导航到描述WPF线程模型的页面。</font><font style="vertical-align: inherit;">但是，Windows窗体使用相同的想法。</font></font>

source: Read answers on question <a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c">How to update the GUI from another thread in C#?</a>. For C# 5.0 and .NET 4.5 the recommended solution is <a href="https://stackoverflow.com/a/18033198/2042090">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lea las respuestas a la pregunta </font></font><a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo actualizar la GUI desde otro hilo en C #? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Para C # 5.0 y .NET 4.5, la soluci&oacute;n recomendada est&aacute; </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C＃の別のスレッドからGUIを更新する方法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">についての質問の回答を読んでください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">C＃5.0および.NET 4.5の場合、推奨されるソリューションは</font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">こちら</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문에 대한 답변 읽기 </font></font><a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C #의 다른 스레드에서 GUI를 업데이트하는 방법은 무엇입니까? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">C # 5.0 및 .NET 4.5의 경우 권장 솔루션은 다음과 </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같습니다</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Читайте ответы на вопрос </font></font><a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как обновить графический интерфейс из другого потока в C #? </font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font><font style="vertical-align: inherit;">Для C # 5.0 и .NET 4.5 рекомендуемое решение </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">阅读有关问题的答案</font></font><a href="https://stackoverflow.com/questions/661561/how-to-update-the-gui-from-another-thread-in-c"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如何从C＃中的另一个线程更新GUI？</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">对于C＃5.0和.NET 4.5，推荐的解决方案在</font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此处</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Return value in e.result and use it to set yout textbox value in backgroundWorker_RunWorkerCompleted event
es: Devuelve el valor en e.result y lo usa para establecer su valor de cuadro de texto en backgroundWorker_RunWorkerCompleted event
ja: e.result の値を返し、それを使用して backgroundWorker_RunWorkerCompleted イベントで yout のテキストボックスの値を設定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">e.result에 값을 반환하고 backgroundWorker_RunWorkerCompleted 이벤트에서 텍스트 상자 값을 설정하는 데 사용하십시오.</font></font>
ru: Возвращает значение в e.result и использует его для установки значения текстового поля yout в событии backgroundWorker_RunWorkerCompleted
zh_cn: 返回e.result中的值,并使用它来设置backgroundWorker_RunWorkerCompleted事件中的文本框值。

source: Same question : how-to-update-the-gui-from-another-thread-in-c
es: La misma pregunta:¿cómo actualizar la guía de otro hilo?
ja: 同じ質問:他のスレッドからのガイドを更新するには?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은 질문 : 다른 스레드에서 c를 업데이트하는 방법</font></font>
ru: Тот же вопрос:как обновить-Gui-from-another-thread-in-c

source: See my <a href="http://pobox.com/~skeet/csharp/threads">threading article</a> for a <a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml">WinForms example</a> - although the article was written before BackgroundWorker arrived on the scene, and I'm afraid I haven't updated it in that respect. BackgroundWorker merely simplifies the callback a bit.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vea mi </font></font><a href="http://pobox.com/~skeet/csharp/threads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">art&iacute;culo de subprocesos</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ver un </font></font><a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ejemplo de WinForms</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , aunque el art&iacute;culo fue escrito antes de que BackgroundWorker llegara a la escena, y me temo que no lo he actualizado al respecto. </font><font style="vertical-align: inherit;">BackgroundWorker simplemente simplifica un poco la devoluci&oacute;n de llamada.</font></font>
ja: <font style="vertical-align: inherit;"><a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml"><font style="vertical-align: inherit;">WinFormsの例</font></a><font style="vertical-align: inherit;">については、私の</font></font><a href="http://pobox.com/~skeet/csharp/threads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スレッディング記事</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">参照してください。</font><font style="vertical-align: inherit;">ただし、この記事は、BackgroundWorkerが登場する前に書かれたものであり、その点については更新していません。</font><font style="vertical-align: inherit;">BackgroundWorkerは、コールバックを少し単純化するだけです。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker가 현장에 도착하기 전에 기사가 작성되었지만 그 점에서 업데이트하지 않았기 때문에 </font><a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml"><font style="vertical-align: inherit;">WinForms 예제에</font></a><font style="vertical-align: inherit;"> 대한 </font></font><a href="http://pobox.com/~skeet/csharp/threads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레딩 기사</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">참조하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">BackgroundWorker는 콜백을 약간 단순화합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">См. Мою </font></font><a href="http://pobox.com/~skeet/csharp/threads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">многопоточную статью</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font><a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">примера WinForms</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - хотя статья была написана до появления BackgroundWorker, и я боюсь, что я не обновил ее в этом отношении. </font><font style="vertical-align: inherit;">BackgroundWorker просто немного упрощает обратный вызов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请参阅我的</font></font><a href="http://pobox.com/~skeet/csharp/threads"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">线程文章</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中的</font></font><a href="http://pobox.com/~skeet/csharp/threads/winforms.shtml"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">WinForms示例</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -尽管该文章是在BackgroundWorker出现之前编写的，但恐怕我在这方面还没有进行更新。</font><font style="vertical-align: inherit;">BackgroundWorker只是稍微简化了回调。</font></font>

source: Simply use this:
es: Simplemente usa esto:
ja: 単純にこれを使ってください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단히 이것을 사용하십시오 :</font></font>
ru: Просто используй это:
zh_cn: 只需使用这个就可以了。

source: Since there is only one thread, all UI operations are queued as work items into that thread:
es: Como sólo hay un hilo,todas las operaciones de UI están en cola como elementos de trabajo en ese hilo:
ja: スレッドは1つしかないので、すべてのUI操作はそのスレッドに作業アイテムとしてキューに入れられます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레드가 하나뿐이므로 모든 UI 작업은 해당 스레드에 작업 항목으로 대기합니다.</font></font>
ru: Поскольку существует только один поток,все операции пользовательского интерфейса ставятся в очередь как рабочие элементы в этом потоке:
zh_cn: 因为只有一个线程,所以所有的UI操作都作为工作项目排队进入该线程。

source: Situation is this: I want to load data into a global variable based on the value of a control. I don't want to change the value of a control from the child thread. I'm not going to do it ever from a child thread.
es: La situación es ésta:Quiero cargar datos en una variable global basada en el valor de un control.No quiero cambiar el valor de un control desde el hilo infantil.No voy a hacerlo nunca desde un hilo hijo.
ja: 状況はこんな感じです。コントロールの値を元にグローバル変数にデータをロードしたい 子スレッドからコントロールの値を変更したくない 子スレッドからは絶対にやりたくない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상황은 이것입니다 : 컨트롤 값을 기반으로 전역 변수에 데이터를로드하고 싶습니다. </font><font style="vertical-align: inherit;">자식 스레드에서 컨트롤 값을 변경하고 싶지 않습니다. </font><font style="vertical-align: inherit;">나는 자식 스레드에서 그것을하지 않을 것입니다.</font></font>
ru: Ситуация такова:Я хочу загрузить данные в глобальную переменную,основанную на значении управления.Я не хочу изменять значение элемента управления из дочернего потока.Я не собираюсь делать это когда-либо из дочернего потока.
zh_cn: 现在的情况是这样的。我想根据一个控件的值将数据加载到一个全局变量中。我不想从子线程中改变一个控件的值。我不打算从子线程中进行。

source: So only accessing the value so that corresponding data can be fetched from the database.
es: Así que sólo se accede al valor para que los datos correspondientes puedan ser recuperados de la base de datos.
ja: そのため、対応するデータをデータベースから取得できるように値にアクセスするだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 해당 데이터를 데이터베이스에서 가져올 수 있도록 값에 액세스하는 것만 가능합니다.</font></font>
ru: Поэтому доступ к значению осуществляется только для того,чтобы из базы данных можно было получить соответствующие данные.
zh_cn: 所以只有访问值,才能从数据库中提取相应的数据。

source: So only accessing the value so that the corresponding data can be fetched from the database.
es: Así que sólo se accede al valor para que los datos correspondientes puedan ser sacados de la base de datos.
ja: そのため、対応するデータをデータベースから取得できるように値にアクセスするだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 해당 데이터를 데이터베이스에서 가져올 수 있도록 값에 액세스하는 것만 가능합니다.</font></font>
ru: Поэтому доступ к значению осуществляется только для того,чтобы из базы данных можно было получить соответствующие данные.
zh_cn: 所以只有访问该值,才能从数据库中获取相应的数据。

source: The Exception it gave was
es: La excepción que dio fue
ja: それが与えた例外は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것이 준 예외는</font></font>
ru: Исключение,которое она сделала.
zh_cn: 它给出的例外是
