Repository: rueisnom/feedback
Catalog: xlf/14/20/03/142003.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To perform computing expensive operation always use separate thread. Since .NET 2.0 <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx">BackgroundWorker</a> is dedicated to performing computing expensive operations in Windows Forms. However in new solutions you should use the async-await pattern as described <a href="https://stackoverflow.com/a/18033198/2042090">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para realizar operaciones costosas de computaci&oacute;n, utilice siempre hilos separados. </font><font style="vertical-align: inherit;">Desde .NET 2.0 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se dedica a realizar operaciones costosas de computaci&oacute;n en formularios Windows Forms. </font><font style="vertical-align: inherit;">Sin embargo, en las nuevas soluciones, debe usar el patr&oacute;n de espera as&iacute;ncrona como se describe </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">負荷の高い演算を実行するには、常に別のスレッドを使用します。</font><font style="vertical-align: inherit;">.NET 2.0以降、</font></font><a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はWindowsフォームでの計算コストの高い操作の実行に専念しています。</font><font style="vertical-align: inherit;">ただし、新しいソリューションでは、</font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明するようにasync-awaitパターンを使用する必要があり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고가의 연산을 수행하려면 항상 별도의 스레드를 사용하십시오. </font><font style="vertical-align: inherit;">.NET 2.0 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 Windows Forms에서 고가의 연산을 수행하는 데 전념하고 있습니다. </font><font style="vertical-align: inherit;">그러나 새로운 솔루션에서는 </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설명 된대로 async-await 패턴을 사용해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для выполнения вычислительных дорогостоящих операций всегда используйте отдельный поток. </font><font style="vertical-align: inherit;">Начиная с .NET 2.0 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предназначен для выполнения дорогостоящих операций в Windows Forms. </font><font style="vertical-align: inherit;">Однако в новых решениях вы должны использовать шаблон async-await, как описано </font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要执行计算昂贵的操作，请始终使用单独的线程。</font><font style="vertical-align: inherit;">由于.NET 2.0 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BackgroundWorker</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">致力于在Windows窗体中执行计算昂贵的操作。</font><font style="vertical-align: inherit;">然而，在新的解决方案所描述的，你应该使用异步的await模式</font></font><a href="https://stackoverflow.com/a/18033198/2042090"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Two Ways:
es: Dos maneras:
ja: 二つの方法。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 방법:</font></font>
ru: Двумя путями:

source: Use <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx">System.Windows.Forms.Control.Invoke</a> or <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx">System.Windows.Forms.Control.BeginInvoke</a> methods only to update a user interface. If you use them for heavy computations, your application will block:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use los </font><font style="vertical-align: inherit;">m&eacute;todos </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solo para actualizar una interfaz de usuario. </font><font style="vertical-align: inherit;">Si los usa para c&aacute;lculos pesados, su aplicaci&oacute;n bloquear&aacute;:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドは、ユーザーインターフェイスを更新する場合にのみ</font><font style="vertical-align: inherit;">使用してください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これらを重い計算に使用すると、アプリケーションがブロックします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용자 인터페이스를 업데이트 </font><font style="vertical-align: inherit;">하려면 </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 만 </font><font style="vertical-align: inherit;">사용하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">무거운 계산에 사용하면 응용 프로그램이 다음을 차단합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font><font style="vertical-align: inherit;">методы </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> только для обновления пользовательского интерфейса. </font><font style="vertical-align: inherit;">Если вы используете их для тяжелых вычислений, ваше приложение заблокирует:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">仅使用</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font><a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法来更新用户界面。</font><font style="vertical-align: inherit;">如果将它们用于繁重的计算，则您的应用程序将阻止：</font></font>

source: You can add other things to the Extension method such as wrapping it in a Try/Catch statement, allowing caller to tell it what type to return after completion, an exception callback to caller:
es: Puedes añadir otras cosas al método de extensión como envolverlo en una declaración TryCatch,permitiendo a la persona que llama decirle que tipo devolver después de la finalización,una excepción de devolución de llamada a la persona que llama:
ja: このメソッドをTryCatch文でラップしたり、呼び出し元が完了後に返す型を指定できるようにしたり、呼び出し元への例外コールバックなど、Extensionメソッドに他の機能を追加することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Try / Catch 문으로 래핑하는 것과 같이 Extension 메서드에 다른 것을 추가하여 호출자에게 완료 후 반환 할 형식, 호출자에게 예외 콜백을 알려줄 수 있습니다.</font></font>
ru: В метод Extension можно добавить и другие вещи,например,обернуть его в оператор TryCatch,позволяя вызывающему абоненту сказать ему,какой тип возвращать после завершения,обратный вызов исключения для вызывающего абонента:
zh_cn: 你可以给Extension方法添加其他的东西,比如把它封装在一个TryCatch语句中,让调用者告诉它完成后返回什么类型,异常回调给调用者。

source: You need to look at the Backgroundworker example:
es: Tienes que mirar el ejemplo de Backgroundworker:
ja: Backgroundworkerの例を見る必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Backgroundworker 예제를 살펴 봐야합니다.</font></font>
ru: Вам нужно взглянуть на пример с фоновым дизайнером:
zh_cn: 你需要看一下背景工人的例子。

source: You only want to use Invoke or BeginInvoke for the bare minimum piece of work required to change the UI. Your "heavy" method should execute on another thread (e.g. via BackgroundWorker) but then using Control.Invoke/Control.BeginInvoke just to update the UI. That way your UI thread will be free to handle UI events etc.
es: Sólo quieres usar Invoke o BeginInvoke para el mínimo trabajo requerido para cambiar la UI.Su método "pesado" debería ejecutarse en otro hilo (por ejemplo,a través de BackgroundWorker)pero luego usando Control.InvokeControl.BeginInvoke sólo para actualizar la UI.De esa manera tu hilo de la UI será libre de manejar los eventos de la UI,etc.
ja: UIを変更するために必要な最低限の作業のためだけにInvokeやBeginInvokeを使用したいと思います。あなたの "重い "メソッドは、別のスレッド(例えばBackgroundWorkerを介して)で実行されるべきですが、UIを更新するためだけにControl.InvokeControl.BeginInvokeを使用します。そうすれば、UIスレッドはUIイベントなどを処理するために自由になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI를 변경하는 데 필요한 최소한의 작업에만 Invoke 또는 BeginInvoke를 사용하려고합니다. </font><font style="vertical-align: inherit;">"무거운"메서드는 다른 스레드 (예 : BackgroundWorker를 통해)에서 실행 한 다음 Control.Invoke / Control.BeginInvoke를 사용하여 UI를 업데이트해야합니다. </font><font style="vertical-align: inherit;">그렇게하면 UI 스레드가 UI 이벤트 등을 자유롭게 처리 할 수 ​​있습니다.</font></font>
ru: Вы хотите использовать Invoke или BeginInvoke только для минимальной работы,необходимой для изменения пользовательского интерфейса.Ваш "тяжелый" метод должен выполняться на другом потоке (например,через BackgroundWorker),но затем с помощью Control.InvokeControl.BeginInvoke просто для обновления пользовательского интерфейса.Таким образом,ваш поток пользовательского интерфейса сможет свободно обрабатывать события пользовательского интерфейса и т.д.
zh_cn: 你只想用Invoke或BeginInvoke来完成改变UI所需的最基本的工作。你的 "重 "方法应该在另一个线程上执行(例如,通过BackgroundWorker),但使用Control.InvokeControl.BeginInvoke只是为了更新UI。这样,你的UI线程就可以自由地处理UI事件等。

source: and second one is to use
es: y la segunda es usar
ja: で、2つ目は
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 번째는 사용하는 것입니다</font></font>
ru: а второй-использовать
zh_cn: 二是用

source: in <code>Form1()</code> constructor .
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">en el </font><font style="vertical-align: inherit;">constructor </font></font> <code>Form1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font></font> <code>Form1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンストラクタ。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font> <code>Form1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 생성자입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">в конструкторе </font></font> <code>Form1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font> <code>Form1()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">构造函数中。</font></font>
