Repository: rueisnom/feedback
Catalog: xlf/14/20/03/142003.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx">System.Windows.Forms.Control.Invoke</a> causes separate thread to wait till invoked method is completed:
es: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace que un subproceso independiente espere hasta que se complete el m&eacute;todo invocado:</font></font>
ja: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、呼び出されたメソッドが完了するまで別のスレッドを待機させます。</font></font>
ko: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 호출 된 메소드가 완료 될 때까지 별도의 스레드를 대기시킵니다.</font></font>
ru: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заставляет отдельный поток ожидать завершения вызванного метода:</font></font>
zh_cn: <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.Invoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.Invoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">导致单独的线程等待被调用的方法完成：</font></font>

source: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx">http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx</a> Especially how it interacts with the UI layer. Based on your posting, this seems to answer your issues.
es: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Especialmente c&oacute;mo interact&uacute;a con la capa de la interfaz de usuario. </font><font style="vertical-align: inherit;">Seg&uacute;n su publicaci&oacute;n, esto parece responder a sus problemas.</font></font>
ja: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 特にUIレイヤーとの相互作用。</font><font style="vertical-align: inherit;">あなたの投稿に基づいて、これはあなたの問題に答えているようです。</font></font>
ko: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 특히 UI 계층과 상호 작용하는 방식. </font><font style="vertical-align: inherit;">귀하의 게시물을 바탕으로 귀하의 문제에 대한 답변으로 보입니다.</font></font>
ru: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Особенно о том, как он взаимодействует со слоем пользовательского интерфейса. </font><font style="vertical-align: inherit;">Судя по вашей публикации, это, кажется, отвечает на ваши вопросы.</font></font>
zh_cn: <a href="http://msdn.microsoft.com/en-us/library/system.componentmodel.backgroundworker.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://msdn.microsoft.com/zh-cn/library/system.componentmodel.backgroundworker.aspx</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 特别是它如何与UI层交互。</font><font style="vertical-align: inherit;">根据您的发布，这似乎可以回答您的问题。</font></font>

source: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx">System.Windows.Forms.Control.BeginInvoke</a> doesn't cause the separate thread to wait till invoked method is completed:
es: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no hace que el hilo separado espere hasta que se complete el m&eacute;todo invocado:</font></font>
ja: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、呼び出されたメソッドが完了するまで別のスレッドを待機させません。</font></font>
ko: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 호출 된 메소드가 완료 될 때까지 별도의 스레드를 기다리지 않습니다.</font></font>
ru: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не заставляет отдельный поток ожидать завершения вызванного метода:</font></font>
zh_cn: <a href="http://msdn.microsoft.com/en-us/library/system.windows.forms.control.begininvoke.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control.BeginInvoke</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不会导致单独的线程等待被调用的方法完成：</font></font>

source: <strong>Adding Try Catch, Auto Exception Logging and CallBack</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Agregar Try Catch, Auto Exception Logging y CallBack</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Try Catch、Auto Exception Logging、CallBackを追加する</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캐치 시도, 자동 예외 로깅 및 콜백 추가</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Добавление Try Catch, Автоматическое ведение журнала исключений и CallBack</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加尝试捕获，自动异常记录和回调</font></font></strong>

source: <strong>CODE 1</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&Oacute;DIGO 1</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コード1</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드 1</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">КОД 1</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码1</font></font></strong>

source: <strong>CODE 2</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&Oacute;DIGO 2</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コード2</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드 2</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Код 2</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码2</font></font></strong>

source: <strong>Helper Method</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todo de ayuda</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヘルパーメソッド</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">도우미 방법</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вспомогательный метод</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">辅助方法</font></font></strong>

source: <strong>Sample Usage</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uso de muestra</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用例</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">샘플 사용법</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Образец использования</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">样品用量</font></font></strong>

source: <strong>The situation is this</strong>: I want to load data into a global variable based on the value of a control. I don't want to change the value of a control from the child thread. I'm not going to do it ever from a child thread.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La situaci&oacute;n es la siguiente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : quiero cargar datos en una variable global basada en el valor de un control. </font><font style="vertical-align: inherit;">No quiero cambiar el valor de un control desde el hilo secundario. </font><font style="vertical-align: inherit;">Nunca lo voy a hacer desde un hilo secundario.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">状況は次の</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とおりです。コントロールの値に基づいてデータをグローバル変数にロードしたいのです。</font><font style="vertical-align: inherit;">子スレッドからコントロールの値を変更したくありません。</font><font style="vertical-align: inherit;">子スレッドからこれを行うつもりはありません。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상황은 이것입니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 컨트롤의 값을 기준으로 전역 변수에 데이터를로드하고 싶습니다. </font><font style="vertical-align: inherit;">자식 스레드에서 컨트롤 값을 변경하고 싶지 않습니다. </font><font style="vertical-align: inherit;">나는 자식 스레드에서 그것을하지 않을 것입니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ситуация такова</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : я хочу загрузить данные в глобальную переменную на основе значения элемента управления. </font><font style="vertical-align: inherit;">Я не хочу менять значение элемента управления из дочернего потока. </font><font style="vertical-align: inherit;">Я не собираюсь делать это когда-либо из детской ветки.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">情况是这样的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：我想根据控件的值将数据加载到全局变量中。</font><font style="vertical-align: inherit;">我不想从子线程更改控件的值。</font><font style="vertical-align: inherit;">我永远不会从子线程执行此操作。</font></font>

source: A new look using Async/Await and callbacks. You only need one line of code if you keep the extension method in your project.
es: Un nuevo aspecto usando AsyncAwait y las llamadas de retorno.Sólo necesitas una línea de código si mantienes el método de extensión en tu proyecto.
ja: AsyncAwaitとコールバックを使った新風。プロジェクト内に拡張メソッドを保持していれば、1行のコードで済みます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Async / Await 및 콜백을 사용하는 새로운 모습. </font><font style="vertical-align: inherit;">확장 메소드를 프로젝트에 유지하는 경우 한 줄의 코드 만 필요합니다.</font></font>
ru: Новый вид с использованием AsyncAwait и обратных звонков.Вам понадобится только одна строка кода,если вы сохраните метод расширения в своем проекте.
zh_cn: 使用AsyncAwait和回调的新外观。如果你的项目中保留了扩展方法,你只需要一行代码。

source: Action y; //declared inside class
es: Acción y;/declarado dentro de la clase
ja: アクション y;/クラス内で宣言されている
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">액션 y; </font><font style="vertical-align: inherit;">// 클래스 안에서 선언</font></font>
ru: Действие у;/объявленное внутри класса

source: Along the same lines as previous answers, but a very short addition that Allows to use all Control properties without having cross thread invokation exception.
es: En la misma línea que las respuestas anteriores,pero con una adición muy corta que permite utilizar todas las propiedades de Control sin tener la excepción de la invocación de hilos cruzados.
ja: 前の回答と同じラインに沿っていますが、クロススレッド呼び出し例外を持たずにすべてのコントロールプロパティを使用できるようにする非常に短い追加です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 답변과 같은 줄을 따라 교차 스레드 호출 예외없이 모든 Control 속성을 사용할 수있는 매우 짧은 추가.</font></font>
ru: По тем же строкам,что и в предыдущих ответах,но с очень коротким дополнением,которое позволяет использовать все свойства управления,не имея исключений по межпоточной инвокации.
zh_cn: 与前面的答案相同,但有一个非常简短的补充,允许使用所有的Control属性而不需要跨线程调用异常。

source: And then you can simply do this:
es: Y luego puedes simplemente hacer esto:
ja: そして、単純にこうすればいいんです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 당신은 단순히 이것을 할 수 있습니다 :</font></font>
ru: И тогда ты можешь просто сделать это:
zh_cn: 然后你就可以简单地这样做。

source: As per <a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108">Prerak K's update comment</a> (since deleted):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Seg&uacute;n </font></font><a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el comentario de actualizaci&oacute;n de Prerak K</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (desde que se elimin&oacute;):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あたりとして</font></font><a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prera​​k Kの更新コメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（削除されたため）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당으로 </font></font><a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prerak K의 업데이트 코멘트</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (삭제 이후) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно </font></font><a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обновленному комментарию Prerak K</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (после удаления):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="https://stackoverflow.com/questions/142003/cross-thread-operation-not-valid-control-accessed-from-a-thread-other-than-the#142108"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prera​​k K的更新评论</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（已删除）：</font></font>

source: Attempt to access member of <a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx">System.Windows.Forms.Control</a> from different thread than UI thread will cause cross-thread exception.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intentar acceder al miembro de </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> desde un subproceso diferente al subproceso de la interfaz de usuario provocar&aacute; una excepci&oacute;n entre subprocesos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UIスレッド以外のスレッドから</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Controlの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メンバーにアクセスしようとする</font><font style="vertical-align: inherit;">と、スレッド間例外が発生します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 스레드와 다른 스레드에서 </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 멤버에 액세스하려고 </font><font style="vertical-align: inherit;">하면 스레드 간 예외가 발생합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попытка доступа к члену </font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из потока, отличного от потока пользовательского интерфейса, вызовет межпотоковое исключение.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试</font><font style="vertical-align: inherit;">从与UI线程不同的线程</font><font style="vertical-align: inherit;">访问</font></font><a href="http://msdn.microsoft.com/en-us/library/System.Windows.Forms.Control.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">System.Windows.Forms.Control的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">成员</font><font style="vertical-align: inherit;">将导致跨线程异常。</font></font>

source: BUT BUT BUT... it seems I'm back to square one. The Application again become nonresponsive. It seems to be due to the execution of line #1 if condition. The loading task is again done by the parent thread and not the third that I spawned.
es: PERO PERO PERO...parece que he vuelto al punto de partida.La aplicación vuelve a no responder.Parece ser debido a la ejecución de la línea #1 si la condición.La tarea de carga se hace de nuevo con el hilo padre y no con el tercero que he engendrado.
ja: でも、でも、でも、でも...どうやら振り出しに戻ってしまったようです。またもやアプリケーションが無反応になってしまいました。これは1行目のif条件を実行したことが原因のようです。読み込みタスクは再び親スレッドで行われ、私がスポーンした3番目のスレッドではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 그러나 ... 나는 다시 광장으로 돌아온 것 같습니다. </font><font style="vertical-align: inherit;">응용 프로그램이 다시 응답하지 않게됩니다. </font><font style="vertical-align: inherit;">조건 1 번 라인의 실행으로 인한 것 같습니다. </font><font style="vertical-align: inherit;">로딩 작업은 부모 스레드에 의해 다시 수행되며 내가 생성 한 세 번째 스레드는 아닙니다.</font></font>
ru: Но,но...но...похоже,я вернулся к началу.Приложение опять не реагирует.Похоже,это связано с выполнением строки #1 if condition.Задача загрузки снова выполняется родительским потоком,а не третьим,который я породил.
zh_cn: 但是,但是,但是...........看来我又回到了原点。应用程序再次变得没有响应。这似乎是由于执行第1行的if条件造成的。加载任务又是由父线程完成,而不是我生成的第三个线程。

source: BeginInvoke and Invoke methods
es: ComenzarInvocar e Invocar métodos
ja: BeginInvokeメソッドとInvokeメソッド
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">BeginInvoke 및 Invoke 메소드</font></font>
ru: Спровоцировать и спровоцировать методы
zh_cn: BeginInvoke和Invoke方法

source: Code solution
es: Código de solución
ja: ソリューションコード
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드 솔루션</font></font>
ru: Код решения
zh_cn: 解决方案代码

source: Control.InvokeRequired is only useful when working controls inherited from Control class while SynchronizationContext can be used anywhere. Some useful information is as following links
es: Control.InvokeRequired sólo es útil cuando se trabaja con controles heredados de la clase Control,mientras que SynchronizationContext puede utilizarse en cualquier lugar.Algunas informaciones útiles son los siguientes enlaces
ja: Control.InvokeRequired は Control クラスを継承している場合にのみ有用ですが、SynchronizationContext はどこでも使用できます。便利な情報は以下のリンクを参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Control.InvokeRequired는 Control 클래스에서 상속 된 컨트롤을 작업 할 때만 유용하며 SynchronizationContext는 어디에서나 사용할 수 있습니다. </font><font style="vertical-align: inherit;">유용한 정보는 다음과 같습니다.</font></font>
ru: Control.InvokeRequired полезен только при работе с элементами управления,унаследованными от класса Control,в то время как SynchronizationContext может быть использован где угодно.Некоторая полезная информация представлена следующими ссылками
zh_cn: Control.InvokeRequired只在继承自Control类的工作控件时有用,而SynchronizationContext可以在任何地方使用。一些有用的信息如下链接
