Repository: rueisnom/feedback
Catalog: xlf/14/20/03/142003.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Controls in .NET are not generally thread safe. That means you shouldn't access a control from a thread other than the one where it lives. To get around this, you need to <em>invoke</em> the control, which is what your 2nd sample is attempting.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los controles en .NET generalmente no son seguros para subprocesos. </font><font style="vertical-align: inherit;">Eso significa que no debe acceder a un control desde un hilo que no sea el que vive. </font><font style="vertical-align: inherit;">Para evitar esto, debe </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">invocar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> el control, que es lo que intenta su segunda muestra.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.NETのコントロールは一般にスレッドセーフではありません。</font><font style="vertical-align: inherit;">つまり、コントロールが存在するスレッド以外のスレッドからコントロールにアクセスしないでください。</font><font style="vertical-align: inherit;">これを回避</font><font style="vertical-align: inherit;">するには、2番目のサンプルが試行しているコントロール</font><font style="vertical-align: inherit;">を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出す</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.NET의 컨트롤은 일반적으로 스레드로부터 안전하지 않습니다. </font><font style="vertical-align: inherit;">즉, 스레드가 아닌 스레드에서 컨트롤에 액세스하면 안됩니다. </font><font style="vertical-align: inherit;">이 문제를 해결하려면 </font><font style="vertical-align: inherit;">두 번째 샘플이 시도하는 컨트롤 </font><font style="vertical-align: inherit;">을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호출</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Элементы управления в .NET не являются потокобезопасными. </font><font style="vertical-align: inherit;">Это означает, что вы не должны обращаться к элементу управления из потока, отличного от того, в котором он находится. </font><font style="vertical-align: inherit;">Чтобы обойти это, вам нужно </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вызвать</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> элемент управления, который пытается </font><font style="vertical-align: inherit;">выполнить </font><font style="vertical-align: inherit;">ваш второй пример.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.NET中的控件通常不是线程安全的。</font><font style="vertical-align: inherit;">这意味着您不应从线程所在的线程之外的其他线程访问控件。</font><font style="vertical-align: inherit;">为了解决这个问题，您需要</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">控件，这是您的第二个示例正在尝试的操作。</font></font>

source: Cross Thread Update UI using SynchronizationContext | .Net
es: .Net
ja: .Net
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SynchronizationContext를 사용한 크로스 스레드 업데이트 UI | </font><font style="vertical-align: inherit;">.그물</font></font>
ru: .Net
zh_cn: .Net

source: Cross Thread Update UI | .Net
es: .Net
ja: .Net
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교차 스레드 업데이트 UI | </font><font style="vertical-align: inherit;">.그물</font></font>
ru: .Net
zh_cn: .Net

source: Cross-thread operation not valid: Control accessed from a thread other than the thread it was created on
es: La operación de cruce de hilos no es válida:Control accedido desde un hilo diferente al hilo en el que fue creado
ja: クロススレッド操作は有効ではありません。作成されたスレッド以外のスレッドからアクセスされたコントロール
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교차 스레드 작업이 유효하지 않음 : 작성된 스레드 이외의 스레드에서 액세스 한 제어</font></font>
ru: Операция с поперечной резьбой недействительна:Доступ к управлению из потока,отличного от того,на котором он был создан.
zh_cn: 跨线程操作无效。从其创建的线程以外的线程访问的控件

source: Cross-thread operation not valid: Control accessed from a thread other than the thread it was created on.
es: La operación de cruce de hilos no es válida:Control accedido desde un hilo diferente al hilo en el que fue creado.
ja: クロススレッド操作は有効ではありません。作成されたスレッド以外のスレッドからアクセスされたコントロール。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교차 스레드 작업이 유효하지 않음 : 작성된 스레드 이외의 스레드에서 액세스 한 제어.</font></font>
ru: Операция с поперечной резьбой недействительна:Доступ к управлению осуществляется из потока,отличного от того,в котором он был создан.
zh_cn: 跨线程操作无效。控件从其创建的线程以外的线程访问。

source: Declare some variable to hold these kind of values in a separate class (which will work as data holder) . Create static instance of this class adn you can access it over any thread.
es: Declare alguna variable para mantener este tipo de valores en una clase separada (que funcionará como poseedora de datos).Crea una instancia estática de esta clase y puedes acceder a ella a través de cualquier hilo.
ja: これらの種類の値を保持するための変数を別のクラスに宣言します (データホルダーとして動作します)。このクラスの静的インスタンスを作成して、どのスレッドからでもアクセスできるようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 종류의 값을 별도의 클래스 (데이터 홀더로 작동)에서 보유하도록 일부 변수를 선언하십시오. </font><font style="vertical-align: inherit;">이 클래스의 정적 인스턴스를 만들고 모든 스레드를 통해 액세스 할 수 있습니다.</font></font>
ru: Объявите какую-нибудь переменную,чтобы хранить такие значения в отдельном классе (который будет работать в качестве владельца данных).Создать статический экземпляр объявления данного класса можно через любой поток.
zh_cn: 在一个单独的类中声明一些变量来保存这些值(它将作为数据持有者)。创建这个类的静态实例,你可以在任何线程中访问它。

source: Do your serious processing in the separate thread <em>before</em> you attempt to switch back to the control's thread. For example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Realice su procesamiento serio en el hilo separado </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">antes de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> intentar volver al hilo del control. </font><font style="vertical-align: inherit;">Por ejemplo:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントロールのスレッドに戻る</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に、別のスレッドで本格的な処理を行ってください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例えば：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제어 스레드로 다시 전환 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하기 전에</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 별도의 스레드에서 심각한 처리를 수행하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Выполните серьезную обработку в отдельном потоке, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">прежде</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чем пытаться переключиться обратно на поток элемента управления. </font><font style="vertical-align: inherit;">Например:</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">尝试切换回控件的线程</font><em><font style="vertical-align: inherit;">之前，</font></em><font style="vertical-align: inherit;">请</font><font style="vertical-align: inherit;">在单独的线程中</font><em><font style="vertical-align: inherit;">进行</font></em><font style="vertical-align: inherit;">认真的处理</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">例如：</font></font>

source: Follow the simplest (in my opinion) way to modify objects from another thread:
es: Sigue la forma más simple (en mi opinión)de modificar objetos de otro hilo:
ja: 別のスレッドからオブジェクトを修正する最もシンプルな(私の考えでは)方法に従ってください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 스레드에서 객체를 수정하는 가장 간단한 방법은 다음과 같습니다.</font></font>
ru: Следуйте простейшему (на мой взгляд)пути модификации объектов из другого потока:
zh_cn: 按照最简单的方法(在我看来)从另一个线程修改对象。

source: For example to get the text from a Control of the UI thread:
es: Por ejemplo,para obtener el texto de un control del hilo de la interfaz de usuario:
ja: 例えば、UIスレッドのコントロールからテキストを取得するには、次のようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 UI 스레드의 컨트롤에서 텍스트를 가져 오려면</font></font>
ru: Например,чтобы получить текст из элемента управления потоком пользовательского интерфейса:
zh_cn: 例如,从UI线程的Control中获取文本。

source: Here is an alternative way if the object you are working with doesn't have
es: Aquí hay una forma alternativa si el objeto con el que está trabajando no tiene
ja: 作業をしているオブジェクトが
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작업중 인 객체에없는 경우 다른 방법이 있습니다.</font></font>
ru: Вот альтернативный способ,если объект,с которым вы работаете,не имеет
zh_cn: 如果你所处理的对象不具备下列条件,这里有一个替代方法

source: How do I resolve this and also what is the effect of execution of Line#1 if block?
es: ¿Cómo resuelvo esto y también cuál es el efecto de la ejecución de la Línea #1 si se bloquea?
ja: これを解決するにはどうすればいいのでしょうか?また、Ifブロックを実行した場合のLine#1の効果は?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 문제를 어떻게 해결하고 라인 # 1 if 블록의 실행 효과는 무엇입니까?</font></font>
ru: Как это разрешить,а также каков эффект от выполнения строки #1 if block?
zh_cn: 如何解决,还有就是执行Line#1 if块的效果如何?

source: However, in your case all you've done is pass the long-running method back to the main thread. Of course, that's not really what you want to do. You need to rethink this a little so that all you're doing on the main thread is setting a quick property here and there.
es: Sin embargo,en tu caso todo lo que has hecho es pasar el método de largo plazo de nuevo al hilo principal.Por supuesto,eso no es realmente lo que quieres hacer.Necesitas repensar esto un poco para que todo lo que hagas en el hilo principal sea establecer una propiedad rápida aquí y allá.
ja: しかし、あなたの場合は、ロングランメソッドをメインスレッドに戻して渡すだけです。もちろん、これはあなたがやりたいことではありません。メインスレッドでやっていることは、あちこちにクイックプロパティを設定することだけになるように、少し考え直す必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 귀하의 경우에는 장기 실행 방법을 기본 스레드로 다시 전달하면됩니다. </font><font style="vertical-align: inherit;">물론, 그것은 당신이 정말로 원하는 것이 아닙니다. </font><font style="vertical-align: inherit;">메인 스레드에서 수행하는 모든 작업이 여기 저기에서 빠른 속성을 설정하도록이 부분을 다시 생각해야합니다.</font></font>
ru: Однако в вашем случае все,что вы сделали-это передали длительный метод обратно в основной поток.Конечно,это не совсем то,что вы хотите сделать.Вам нужно немного переосмыслить это,чтобы все,что вы делаете в основном потоке-это устанавливаете быстрое свойство здесь и там.
zh_cn: 然而,在你的情况下,你所做的只是将长效方法传回主线程。当然,这不是你想做的。你需要重新思考一下,让你在主线程上做的只是在这里和那里设置一个快速属性。

source: I don't know whether I perceived this right or wrong. I'm new to threading.
es: No sé si percibí esto bien o mal.Soy nuevo en el mundo de los hilos.
ja: 私の認識が正しいのか間違っているのかわかりません。スレタイは初めてです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것이 옳은지인지 아닌지를 알지 못한다. </font><font style="vertical-align: inherit;">스레딩을 처음 사용합니다.</font></font>
ru: Я не знаю,правильно я это воспринял или нет.Я новичок в резьбе.
zh_cn: 我不知道我的看法是对还是错。我是个新手,对线程是个新手。

source: I find the check-and-invoke code which needs to be littered within all methods related to forms to be way too verbose and unneeded. Here's a simple extension method which lets you do away with it completely:
es: Creo que el código de comprobación e invocación que debe ser cubierto por todos los métodos relacionados con las formas es demasiado verborreico e innecesario.Aquí hay un simple método de extensión que te permite eliminarlo por completo:
ja: フォームに関連するすべてのメソッド内に散らばっている必要のあるチェックアンドインボークのコードは、あまりにも冗長で不要だと思います。ここにシンプルな拡張メソッドがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">양식과 관련된 모든 메소드 내에서 너무 장황하고 불필요하게 처리 해야하는 체크 앤 호출 코드를 발견했습니다. </font><font style="vertical-align: inherit;">다음은 간단한 확장 방법으로 완전히 제거 할 수 있습니다.</font></font>
ru: Я нахожу код проверки и вызова,который необходимо замусорять во всех методах,связанных с формами,слишком многословным и ненужным.Вот простой метод расширения,который позволяет полностью отказаться от него:
zh_cn: 我发现在所有与表单相关的方法中,检查和调用的代码都需要在表单相关的方法中出现,这样的代码太过冗长,也不需要。这里有一个简单的扩展方法,可以让你完全不需要它。

source: I found a need for this while programming an iOS-Phone monotouch app controller in a visual studio winforms prototype project outside of xamarin stuidio. Preferring to program in VS over xamarin studio as much as possible, I wanted the controller to be completely decoupled from the phone framework. This way implementing this for other frameworks like Android and Windows Phone would be much easier for future uses.
es: Encontré una necesidad de esto mientras programaba un controlador de aplicaciones monotouch iOS-Phone en un estudio visual winforms proyecto prototipo fuera de xamarin stuidio.Prefiriendo programar en VS sobre el estudio xamarin tanto como sea posible,quería que el controlador estuviera completamente desacoplado del marco del teléfono.De esta manera,implementar esto para otros frameworks como Android y Windows Phone sería mucho más fácil para futuros usos.
ja: xamarin stuidio の外の visual studio winforms プロトタイププロジェクトで iOS-Phone モノタッチアプリコントローラをプログラミングしているときに、この必要性を発見しました。可能な限り xamarin studio よりも VS でプログラミングすることを好む私は、コントローラを Phone フレームワークから完全に切り離したいと思っていました。このようにして、AndroidやWindows Phoneのような他のフレームワークへの実装は、将来の使用のためにはるかに簡単になるでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">xamarin stuidio 외부의 Visual Studio Winforms 프로토 타입 프로젝트에서 iOS-Phone 모노 터치 앱 컨트롤러를 프로그래밍 할 때이 기능이 필요하다는 것을 알았습니다. </font><font style="vertical-align: inherit;">가능한 한 xamarin 스튜디오보다 VS에서 프로그래밍하는 것을 선호하기 위해 컨트롤러가 전화 프레임 워크에서 완전히 분리되기를 원했습니다. </font><font style="vertical-align: inherit;">이렇게하면 Android 및 Windows Phone과 같은 다른 프레임 워크에이를 구현하는 것이 나중에 사용하기가 훨씬 쉬워집니다.</font></font>
ru: Я нашел необходимость в этом при программировании монотач-контроллера приложения iOS-Phone в визуальной студии Winforms прототип проекта за пределами xamarin stuidio.Предпочитая программировать в VS,а не в студии xamarin,я хотел,чтобы контроллер был полностью отделен от фреймворка телефона.Таким образом,реализовать это для других фреймворков,таких как Android и Windows Phone,было бы намного проще для будущего использования.
zh_cn: 我在xamarin stuidio之外的visual studio winforms原型项目中编程一个iOS-Phone单点触控应用控制器时发现了这样的需求。我希望尽可能的在VS中编程,而不是在xamarin studio中编程,我希望控制器完全脱离手机框架。这样一来,在其他框架如Android和Windows Phone等框架中实现这一点,在未来的使用中会更容易。

source: I guess I have not presented the question properly.
es: Supongo que no he presentado la pregunta correctamente.
ja: 質問をきちんと提示していなかったようですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">질문을 제대로 제시하지 않은 것 같습니다.</font></font>
ru: Похоже,я неправильно сформулировал вопрос.
zh_cn: 我想我没有把这个问题说得很好。

source: I have a scenario. (Windows Forms, C#, .NET)
es: Tengo un escenario.(Windows Forms,C#,.NET)
ja: シナリオがあります。(Windows Forms,C#,.NET)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시나리오가 있습니다. </font><font style="vertical-align: inherit;">(Windows Forms, C #, .NET)</font></font>
ru: У меня есть сценарий.(Windows Forms,C#,.NET)
zh_cn: 我有一个场景。(Windows Forms,C#,.NET)

source: I have had this problem with the <code>FileSystemWatcher</code> and found that the following code solved the problem:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He tenido este problema con </font></font> <code>FileSystemWatcher</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y descubr&iacute; que el siguiente c&oacute;digo resolvi&oacute; el problema:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>FileSystemWatcher</code> で<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この問題が発生し</font><font style="vertical-align: inherit;">、次のコードで問題が解決されたことがわかりました。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>FileSystemWatcher</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서이 문제가 발생 </font><font style="vertical-align: inherit;">했으며 다음 코드가 문제를 해결한다는 것을 알았습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У меня была эта проблема с </font></font> <code>FileSystemWatcher</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и я обнаружил, что следующий код решил эту проблему:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我在</font></font> <code>FileSystemWatcher</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">遇到了这个问题，</font><font style="vertical-align: inherit;">发现以下代码解决了该问题：</font></font>

source: I know its too late now. However even today if you are having trouble accessing cross thread controls? This is the shortest answer till date :P
es: Sé que ya es demasiado tarde.Sin embargo,incluso hoy si tienes problemas para acceder a los controles de los hilos cruzados...Esta es la respuesta más corta hasta la fecha :P
ja: 私はそれが遅すぎるのを知っています。しかし、今日でもあなたがクロススレッドコントロールにアクセスすることに問題がある場合は?これは、これまでの最短の答えです :P
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">너무 늦었 어 </font><font style="vertical-align: inherit;">그러나 오늘날에도 크로스 스레드 컨트롤에 액세스하는 데 문제가 있습니까? </font><font style="vertical-align: inherit;">이것은 날짜까지 가장 짧은 답변입니다 : P</font></font>
ru: Теперь я знаю,что уже слишком поздно.Однако даже сегодня,если у вас есть проблемы с доступом к управлению поперечной резьбой? Это самый короткий ответ до даты :P
zh_cn: 我知道现在太晚了。然而,即使是今天,如果你在访问跨线程控制方面遇到了困难?这是到目前为止最短的答案:P

source: I used a background worker thread which will be loading the data and when done will notify the application that it has done its work.
es: Utilicé un hilo de trabajo de fondo que cargará los datos y cuando lo haga notificará a la aplicación que ha hecho su trabajo.
ja: 私はバックグラウンドワーカースレッドを使用して、データをロードし、完了したときに、それがその仕事を行ったことをアプリケーションに通知します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터를로드 할 백그라운드 작업자 스레드를 사용했으며 완료되면 응용 프로그램에 작업이 완료되었음을 알립니다.</font></font>
ru: Я использовал фоновый рабочий поток,который будет загружать данные и по окончании работы уведомит приложение о том,что оно выполнило свою работу.
zh_cn: 我使用了一个后台工作者线程,它将加载数据,完成后会通知应用程序完成工作。

source: I wanted a solution where the GUI could respond to events without the burden of dealing with the cross threading switching code behind every button click. Basically let the class controller handle that to keep the client code simple. You could possibly have many events on the GUI where as if you could handle it in one place in the class would be cleaner. I am not a multi theading expert, let me know if this is flawed.
es: Quería una solución en la que la interfaz gráfica pudiera responder a los eventos sin la carga de tener que lidiar con el código de conmutación de hilos cruzados que hay detrás de cada clic del botón.Básicamente,dejar que el controlador de la clase se encargue de eso para mantener el código del cliente simple.Podrías tener muchos eventos en el GUI donde si pudieras manejarlo en un lugar de la clase sería más limpio.No soy un experto en multi-lectura,hazme saber si esto es defectuoso.
ja: 私は、ボタンをクリックするたびにクロススレッドの切り替えコードを処理する負担をかけずに、GUIがイベントに応答できるようなソリューションが欲しかったのです。基本的には、クライアントコードをシンプルに保つために、クラスコントローラに処理を任せています。あなたはおそらく、クラス内の1つの場所でそれを扱うことができる場合のように、GUI上で多くのイベントを持っている可能性がありますクリーンであろう。私はマルチブラウジングの専門家ではありませんが、これが欠陥がある場合は、私に知らせてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버튼을 클릭 할 때마다 크로스 스레딩 스위칭 코드를 처리해야하는 부담없이 GUI가 이벤트에 응답 할 수있는 솔루션이 필요했습니다. </font><font style="vertical-align: inherit;">기본적으로 클래스 컨트롤러가 클라이언트 코드를 단순하게 유지하도록 처리하도록합니다. </font><font style="vertical-align: inherit;">클래스의 한 곳에서 처리 할 수있는 것처럼 더 깔끔한 GUI에 많은 이벤트가있을 수 있습니다. </font><font style="vertical-align: inherit;">저는 멀티 테스팅 전문가가 아닙니다. 결함이 있는지 알려주세요.</font></font>
ru: Мне нужно было решение,в котором графический интерфейс мог бы реагировать на события без необходимости иметь дело с кодом переключения кросс-потоков за каждым нажатием кнопки.По сути,позволить контроллеру класса справиться с этим,чтобы код клиента оставался простым.Возможно,у вас будет много событий в графическом интерфейсе,где,как если бы вы могли работать с ним в одном месте в классе,было бы чище.Я не эксперт в области многозадачности,дайте мне знать,если что-то не так.
zh_cn: 我想要一个解决方案,让GUI可以响应事件,而不需要处理每个按钮点击后的跨线程切换代码。基本上让类控制器来处理,以保持客户端代码简单。你可以在GUI上有很多事件,如果你可以在类中的一个地方处理,那就更干净了。我不是一个多着色专家,如果这有什么缺陷请告诉我。

source: If there is no work for UI thread, then there are idle gaps that can be used by a not-UI related computing.
es: Si no hay trabajo para el hilo de UI,entonces hay lagunas ociosas que pueden ser utilizadas por una computación no relacionada con la UI.
ja: UIスレッドの作業がない場合は、UI関連ではない演算で使えるアイドルギャップがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI 스레드에 대한 작업이 없으면 UI와 관련이없는 컴퓨팅에서 사용할 수있는 유휴 간격이 있습니다.</font></font>
ru: Если нет работы для потока UI,то есть незадействованные пробелы,которые могут быть использованы не связанными с пользовательским интерфейсом вычислениями.
zh_cn: 如果没有UI线程的工作,那么就有闲置的空隙,可以通过非UI相关的计算来使用。
