Repository: rueisnom/feedback
Catalog: xlf/16/28/56/3/1628563.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Undoes the last three commits (and their messages) to <code>master</code>, yet leaves all working files intact
es: Deshace las &uacute;ltimas tres confirmaciones (y sus mensajes) para <code>master</code> , pero deja intactos todos los archivos de trabajo
ja: <code>master</code> への最後の3つのコミット（およびそのメッセージ）を元に戻しますが、すべての作業ファイルはそのまま残します
ko: <code>master</code> 에 대한 마지막 3 개의 커밋 (및 해당 메시지)을 취소하지만 모든 작업 파일은 그대로 둡니다.
ru: Отменяет последние три коммита (и их сообщения) для <code>master</code> , но оставляет все рабочие файлы нетронутыми
zh_cn: 撤消对 <code>master</code> 的最后三次提交（及其消息），但所有工作文件保持不变

source: Update! Use up-arrow to scroll through your command buffer to reapply the prior commit with its commit message (thanks @ARK)
es: ¡Actualización! Use la flecha hacia arriba para desplazarse a través de su buffer de comandos para volver a aplicar la confirmación previa con su mensaje de confirmación (gracias @ARK)
ja: 更新しました。上矢印を使ってコマンドバッファをスクロールして、コミットメッセージと一緒に前のコミットを再適用する (ありがとう @ARK)
ko: 최신 정보! 위쪽 화살표를 사용하여 명령 버퍼를 스크롤하여 이전 커밋을 커밋 메시지와 함께 다시 적용하십시오 (@ARK 덕분에)
ru: Обновление! Используйте стрелку вверх для прокрутки командного буфера,чтобы повторно применить предыдущий коммит с его сообщением о фиксации (спасибо @ARK).
zh_cn: 更新! 使用向上箭头滚动你的命令缓冲区,重新应用之前的提交信息(感谢@ARK)。

source: Using your local reflog, <code>git rebase</code> can see that you forked from an earlier incarnation of the origin/master branch, and hence that the M2 and M3 commits are not really part of your topic branch. Hence it reasonably assumes that since M2 was removed from the upstream branch, you no longer want it in your topic branch either once the topic branch is rebased:
es: Usando su reflog local, <code>git rebase</code> puede ver que se bifurc&oacute; de una encarnaci&oacute;n anterior de la rama de origen / maestra, y por lo tanto, las confirmaciones de M2 ​​y M3 no son realmente parte de su rama de tema. Por lo tanto, se supone razonablemente que, dado que M2 se elimin&oacute; de la rama ascendente, ya no lo desea en su rama tem&aacute;tica ni una vez que la rama tem&aacute;tica se haya modificado:
ja: ローカルのreflogを使用すると、 <code>git rebase</code> はorigin / masterブランチの以前のインカネーションから分岐したこと、したがってM2およびM3コミットは実際にはトピックブランチの一部ではないことを確認できます。 したがって、M2は上流のブランチから削除されたため、トピックブランチがリベースされると、トピックブランチでM2が不要になると合理的に想定しています。
ko: 로컬 reflog를 사용하여 <code>git rebase</code> 는 원점 / 마스터 브랜치의 초기 화신에서 분기 된 것을 볼 수 있으므로 M2 및 M3 커밋은 실제로 토픽 브랜치의 일부가 아닙니다. 따라서 M2가 업스트림 브랜치에서 제거되었으므로 토픽 브랜치가 리베이스 된 후에는 더 이상 토픽 브랜치에서 원하지 않는 것으로 가정합니다.
ru: Используя ваш локальный reflog, <code>git rebase</code> может увидеть, что вы разветвились из более ранней инкарнации ветки origin / master, и, следовательно, коммиты M2 и M3 на самом деле не являются частью вашей ветки тем. Следовательно, это разумно предполагает, что, поскольку M2 был удален из вышестоящей ветки, вы больше не захотите его в своей ветке тем, как только ветка тем будет перебазирована:
zh_cn: 使用本地reflog， <code>git rebase</code> 可以看到您是从origin / master分支的较早版本中派生的，因此M2和M3提交实际上不是您的主题分支的一部分。 因此，可以合理地假设由于M2已从上游分支中删除，因此一旦主题分支重新建立基础，您就不再希望在主题分支中使用它：

source: What this does, by line number
es: Lo que esto hace,por número de línea
ja: これが何をするかというと、行番号別に
ko: 이것이 행 번호로하는 일
ru: Что это делает,по номеру строки
zh_cn: 按行号分,这是在做什么?

source: What this doesn't do
es: Lo que esto no hace
ja: これではできないこと
ko: 이것이하지 않는 것
ru: Чего это не делает.
zh_cn: 这并没有起到什么作用

source: When to use this?
es: ¿Cuándo usar esto?
ja: どんな時に使うの?
ko: 이것을 언제 사용합니까?
ru: Когда использовать это?
zh_cn: 什么时候用这个?

source: Why would <code>git rebase</code> discard the 3 commits after the first example? It's because <code>git rebase</code> with no arguments enables the <code>--fork-point</code> option by default, which uses the local reflog to try to be robust against the upstream branch being force-pushed.
es: &iquest;Por qu&eacute; <code>git rebase</code> descarta los 3 commits despu&eacute;s del primer ejemplo? Es porque <code>git rebase</code> sin argumentos habilita la opci&oacute;n <code>--fork-point</code> por defecto, que usa el registro local para tratar de ser robusto contra la rama ascendente que se empuja a la fuerza.
ja: 最初の例の後で <code>git rebase</code> が3つのコミットを破棄するのはなぜですか？ これは、引数なしの <code>git rebase</code> がデフォルトで <code>--fork-point</code> オプションを有効にするためです。このオプションでは、ローカルのreflogを使用して、強制的にプッシュされる上流ブランチに対してロバストになるように試みます。
ko: 왜 <code>git rebase</code> 가 첫 번째 예제 후에 3 개의 커밋을 버릴까요 ? <code>--fork-point</code> 없는 <code>git rebase</code> 는 기본적으로 --fork-point 옵션을 활성화합니다.이 옵션은 로컬 참조 로그 를 사용하여 강제 푸시되는 업스트림 브랜치에 견고합니다.
ru: Зачем <code>git rebase</code> отбрасывать 3 коммита после первого примера? Это потому, что <code>git rebase</code> без аргументов по умолчанию включает <code>--fork-point</code> , которая использует локальный журнал reflog, чтобы попытаться быть устойчивым к принудительной принудительной передаче в ветке upstream.
zh_cn: 为什么 <code>git rebase</code> 在第一个示例之后会丢弃3次提交？ 这是因为不带参数的 <code>git rebase</code> 默认情况下会启用 <code>--fork-point</code> 选项，该选项使用本地reflog来尝试对强行推入的上游分支保持鲁棒性。

source: With two commands
es: Con dos comandos
ja: 2つのコマンドで
ko: 두 가지 명령으로
ru: С двумя командами
zh_cn: 有两个命令

source: Yet another way to do this, using just 2 commands. Also keeps your current working tree intact.
es: Otra forma de hacer esto,usando sólo dos comandos.También mantiene intacto el árbol de trabajo actual.
ja: 2 つのコマンドを使用した別の方法もあります。また、現在の作業ツリーをそのままにしておくこともできます。
ko: 단 두 개의 명령을 사용하여이를 수행하는 또 다른 방법입니다. 또한 현재 작업 트리를 그대로 유지하십시오.
ru: Еще один способ сделать это,используя всего 2 команды.Также сохранит ваше текущее рабочее дерево в целости и сохранности.
zh_cn: 然而另一种方法,只需使用2个命令就能完成。还可以保持你当前的工作树的完整。

source: You can do this is just 3 simple step that i used.
es: Puedes hacer esto es sólo 3 simples pasos que yo usé.
ja: あなたはこれを行うことができますちょうど私が使用した3つの簡単なステップです。
ko: 당신이 할 수있는 것은 내가 사용한 3 단계입니다.
ru: Вы можете сделать это всего лишь 3 простых шага,которые я использовал.
zh_cn: 你可以做到这一点,这只是3个简单的步骤,我使用的。

source: You can now use <code>git add</code> and <code>git commit</code> as you normally would. All new commits will be added to <code>newbranch</code>.
es: Ahora puede usar <code>git add</code> y <code>git commit</code> como lo har&iacute;a normalmente. Todos los nuevos commits se agregar&aacute;n a <code>newbranch</code> .
ja: これで、通常どおりに <code>git add</code> および <code>git commit</code> を使用できます。 新しいコミットはすべて <code>newbranch</code> に追加されます 。
ko: 이제 평상시처럼 <code>git add</code> 및 <code>git commit</code> 을 사용할 수 있습니다. 모든 새로운 커밋이 <code>newbranch</code> 에 추가됩니다.
ru: Теперь вы можете использовать <code>git add</code> и <code>git commit</code> как обычно. Все новые коммиты будут добавлены в <code>newbranch</code> .
zh_cn: 现在，您可以像平常一样使用 <code>git add</code> 和 <code>git commit</code> 了 。 所有新的提交都将添加到 <code>newbranch</code> 中 。

source: You don't care about the messages on the mistaken commits
es: No te importan los mensajes de los compromisos equivocados
ja: 勘違いコミュのメッセージを気にしない
ko: 실수 한 커밋에 대한 메시지는 신경 쓰지 않습니다
ru: Тебя не волнуют сообщения об ошибках.
zh_cn: 你根本就不关心那些被误犯的信息

source: You don't want complications like temporary/new branches, finding and copying commit hashes, and other headaches
es: No quieres complicaciones como las ramas temporales,encontrar y copiar cometer hashes,y otros dolores de cabeza.
ja: 一時的に新しいブランチを作成したり、コミットハッシュを見つけてコピーしたり、その他の頭痛の種になるような複雑な作業は避けたいものです。
ko: 임시 / 새 브랜치, 커밋 해시 찾기 및 복사 및 기타 두통과 같은 합병증을 원하지 않습니다.
ru: Тебе не нужны осложнения вроде височной ветви,поиска и копирования хэшей коммитов и других головных болей.
zh_cn: 你不希望出现时效性分支、查找和复制提交哈希等并发症,以及其他令人头疼的问题。

source: You haven't pushed yet
es: No has presionado todavía
ja: まだ押してないの?
ko: 아직 밀지 않았습니다
ru: Ты еще не толкнул
zh_cn: 你还没推呢

source: You want this to be easy to memorize
es: Quieres que esto sea fácil de memorizar
ja: これを簡単に覚えたいのか
ko: 당신은 이것을 암기하기 쉽기를 원합니다.
ru: Ты хочешь,чтобы это было легко запомнить.
zh_cn: 你想让这个东西容易记住

source: You want to go back to C, and move D and E to the new branch. Here's what it looks like at first:
es: Quieres volver a C,y trasladar a D y E a la nueva sucursal.Esto es lo que parece al principio:
ja: Cに戻って、DとEを新しい枝に移動させたいのですね。最初はこんな感じです。
ko: C로 돌아가서 D와 E를 새 분기로 이동하려고합니다. 처음에는 다음과 같습니다.
ru: Ты хочешь вернуться в C,и перевести D и E в новый филиал.Вот как это выглядит поначалу:
zh_cn: 你想回C,把D和E搬到新的分支上。下面是一开始的样子。

source: You want to keep file changes
es: Quieres mantener los cambios en los archivos
ja: ファイルの変更を保存したい場合
ko: 파일 변경 사항을 유지하려고합니다
ru: Вы хотите сохранить изменения в файлах
zh_cn: 你想保持文件的变化

source: but then someone rewrites history by force-pushing origin/master to remove M2:
es: pero entonces alguien reescribe la historia empujando a la fuerza al maestro de origen para eliminar el M2:
ja: でも、誰かがオリジンマスターに無理やりM2を削除させて歴史を書き換えたんだよね。
ko: 그러나 누군가가 M2를 제거하기 위해 강제 푸시 원점 / 마스터로 기록을 다시 작성합니다.
ru: но потом кто-то переписывает историю,подталкивая оригинал-мастера к удалению М2:
zh_cn: 但后来有人通过强推 originmaster删除M2,改写了历史。

source: is because they leave the reflog in the wrong state. Git sees <code>newbranch</code> as having forked off the upstream branch at a revision that includes the 3 commits, then the <code>reset --hard</code> rewrites the upstream's history to remove the commits, and so next time you run <code>git rebase</code> it discards them like any other commit that has been removed from the upstream.
es: es porque dejan el reflog en el estado incorrecto. Git ve a <code>newbranch</code> como una bifurcaci&oacute;n de la rama ascendente en una revisi&oacute;n que incluye los 3 commits, luego el <code>reset --hard</code> reescribe el historial del upstream para eliminar los commits, por lo que la pr&oacute;xima vez que ejecute <code>git rebase</code> los descarta como cualquier otro commit que ha sido eliminado de la corriente arriba.
ja: これは、reflogを間違った状態のままにするためです。 Gitは、3つのコミットを含むリビジョンでアップストリームブランチを分岐したものとして <code>newbranch</code> を認識し、次に <code>reset --hard</code> はアップストリームの履歴を書き直してコミットを削除します。そのため、次に <code>git rebase</code> を実行すると、他のコミットと同様に破棄されます。アップストリームから削除されました。
ko: 리플 로그를 잘못된 상태로두기 때문입니다. Git은 <code>newbranch</code> 가 3 개의 커밋을 포함하는 개정판에서 업스트림 브랜치를 분기 한 것으로보고, <code>reset --hard</code> 는 커밋을 제거하기 위해 업스트림의 히스토리를 다시 작성하므로 다음에 <code>git rebase</code> 를 실행하면 다른 커밋처럼 버립니다. 업스트림에서 삭제되었습니다.
ru: потому что они оставляют reflog в неправильном состоянии. Git считает, что <code>newbranch</code> разветвляется от ветки upstream в ревизии, включающей 3 коммита, затем <code>reset --hard</code> переписывает историю апстрима для удаления коммитов , и поэтому в следующий раз, когда вы запустите <code>git rebase</code> , он отбрасывает их, как и любой другой коммит, который был удален из выше по течению.
zh_cn: 是因为它们使reflog处于错误状态。 Git认为 <code>newbranch</code> 在包含3个提交的修订版本中分叉了上游分支，然后 <code>reset --hard</code> 重写了上游的历史记录以删除提交，因此，下次运行 <code>git rebase</code> 时,它将像其他提交一样丢弃它们已从上游移除。

source: to this?
es: a esto?
ja: これに?
ko: 이에?
ru: к этому?
zh_cn: 到这个?

source: you can also provide some rang of commit id.
es: ...también puedes proporcionar algún rango de identificación de compromiso.
ja: コミットIDを指定することもできます。
ko: 커밋 ID를 제공 할 수도 있습니다.
ru: ты также можешь предоставить немного идентификатора коммитинга.
zh_cn: 你也可以提供一些rong的commit id。
