Repository: rueisnom/feedback
Catalog: xlf/16/28/56/3/1628563.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Here's a far simpler solution for commits to the wrong branch. Starting on branch <code>master</code> that has three mistaken commits:
es: Aqu&iacute; hay una soluci&oacute;n mucho m&aacute;s simple para los compromisos con la rama incorrecta. Comenzando en la rama <code>master</code> que tiene tres confirmaciones err&oacute;neas:
ja: これは、間違ったブランチへのコミットのためのはるかに簡単な解決策です。 3つの誤ったコミットがあるブランチ <code>master</code> から開始します。
ko: 다음은 잘못된 브랜치에 대한 커밋을위한 훨씬 간단한 솔루션입니다. 세 가지 잘못된 커밋이있는 지점 <code>master</code> 에서 시작 :
ru: Вот гораздо более простое решение для фиксации в неправильной ветви. Начиная с ветки <code>master</code> , которая имеет три ошибочных коммита:
zh_cn: 这是提交错误分支的简单得多的解决方案。 从具有三个错误提交的分支 <code>master</code> 节点开始：

source: How can I go from this
es: ¿Cómo puedo pasar de esto
ja: ここから先はどうすればいいのか
ko: 이걸 어떻게 할 수 있습니까
ru: Как я могу от этого избавиться
zh_cn: 我怎么能从这一点出发

source: I do this at least once a week when I accidentally make new commits to <code>master</code> instead of <code>develop</code>. Usually I have only one commit to rollback in which case using <code>git reset HEAD^</code> on line 1 is a simpler way to rollback just one commit.
es: Hago esto al menos una vez a la semana cuando accidentalmente realizo nuevos compromisos para <code>master</code> lugar de <code>develop</code> . Por lo general, solo tengo un commit para revertir, en cuyo caso usar <code>git reset HEAD^</code> en la l&iacute;nea 1 es una forma m&aacute;s simple de revertir solo un commit.
ja: これは、少なくとも週に1回、 <code>develop</code> なく誤って <code>master</code> に新しいコミットを行ったときに行います。 通常、ロールバックするコミットは1つだけです。その場合、1行目で <code>git reset HEAD^</code> を使用すると、1つのコミットだけをロールバックする最も簡単な方法です。
ko: 나는 일주일에 한 번 이상 <code>develop</code> 대신 <code>master</code> 새로운 커밋을 할 때이 작업을 수행합니다. 일반적으로 롤백 할 커밋은 하나뿐입니다.이 경우 1 행에서 <code>git reset HEAD^</code> 를 사용하면 커밋을 롤백하는 간단한 방법입니다.
ru: Я делаю это, по крайней мере, один раз в неделю, когда я делаю новые коммиты для <code>master</code> вместо <code>develop</code> . Обычно у меня есть только один коммит для отката, в этом случае использование <code>git reset HEAD^</code> в строке 1 - это более простой способ отката только одного коммита.
zh_cn: 当我不小心做出新的承诺而不是 <code>develop</code> 时，我每周至少这样做一次。 通常我只有一个提交回滚，在这种情况下，在第1行使用 <code>git reset HEAD^</code> 是回滚一个提交的更简单方法。

source: I expected that commit I would be the HEAD, but commit L is it now...
es: Esperaba que el compromiso I fuera la CABEZA,pero el compromiso L es ahora...
ja: コミット I が HEAD になると思っていたのですが、コミット L になってしまいました・・・。
ko: 커밋은 HEAD가 될 것이라고 기대했지만 L 커밋은 지금입니다 ...
ru: Я ожидал,что я буду ГОЛОВОМ,но сейчас я должен...
zh_cn: 我以为提交I会是HEAD,但提交L是现在......

source: I performed:
es: He actuado:
ja: 演技しました。
ko: 나는 수행했다 :
ru: Я выступал:
zh_cn: 我的表演。

source: I'd like to move the last several commits I've committed to master to a new branch and take master back to before those commits were made. Unfortunately, my Git-fu is not strong enough yet, any help?
es: Me gustaría trasladar los últimos compromisos que me he comprometido a dominar a una nueva rama y llevar al maestro de vuelta a antes de que se hicieran esos compromisos.Desafortunadamente,mi Git-fu no es lo suficientemente fuerte todavía,¿alguna ayuda?
ja: master にコミットした最後のいくつかのコミットを新しいブランチに移動して、master をそのコミットが行われる前の状態に戻したいと思います。残念ながら、私のGit-fuはまだ十分に強力ではありません。
ko: 마지막 브랜치 몇 가지 커밋을 새 브랜치로 마스터하고 커밋하기 전에 다시 마스터로 가져 가고 싶습니다. 불행히도 내 Git-fu는 아직 충분히 강력하지 않습니다.
ru: Я хотел бы перенести последние несколько коммитов,которые я собирался освоить,в новое ответвление и перенести их обратно до того,как эти коммиты будут сделаны.К сожалению,мой Git-fu ещё не достаточно силён,какая-нибудь помощь?
zh_cn: 我想把最后几个提交到master的提交转移到一个新的分支,然后把master移回提交之前。不幸的是,我的 Git-fu 还不够强大,有什么帮助吗?

source: I.e. How can I go from this
es: Es decir,¿cómo puedo pasar de esto
ja: つまり、この状態からどのようにして
ko: 즉, 나는 이것을 어떻게 갈 수 있습니까
ru: Т.е.как я могу от этого отказаться.
zh_cn: 即:我如何才能从这个

source: If you just need to move all your <strong>unpushed</strong> commits to a <em>new branch</em>, then you just need to,
es: Si solo necesita mover todas sus confirmaciones no <strong>apresuradas</strong> a una <em>nueva sucursal</em> , entonces solo necesita,
ja: <strong>プッシュされ</strong>ていないすべてのコミットを<em>新しいブランチ</em>に移動する必要があるだけの場合は、
ko: <strong>푸시되지 않은</strong> 커밋을 모두 <em>새로운 브랜치</em> 로 옮길 필요가 있다면,
ru: Если вам просто нужно переместить все ваши <strong>невыполненные</strong> коммиты в <em>новую ветку</em> , то вам просто нужно,
zh_cn: 如果您只需要将所有未<strong>推送的</strong>提交移动到<em>新分支</em> ，则只需，

source: If you want to move your commits to an <strong>existing branch</strong>, it will look like this:
es: Si desea mover sus confirmaciones a una <strong>rama existente</strong> , se ver&aacute; as&iacute;:
ja: コミットを<strong>既存のブランチ</strong>に移動する場合は、次のようになります。
ko: 커밋을 <strong>기존 브랜치</strong> 로 옮기려면 다음과 같이 보일 것입니다.
ru: Если вы хотите переместить ваши коммиты в <strong>существующую ветку</strong> , это будет выглядеть так:
zh_cn: 如果要将提交移至<strong>现有分支</strong> ，则它将如下所示：

source: If your primary purpose is to roll back <code>master</code>
es: Si su prop&oacute;sito principal es hacer retroceder al <code>master</code>
ja: 主な目的が <code>master</code> ロールバックである場合
ko: 주된 목적이 <code>master</code> 를 롤백하는 경우
ru: Если вашей основной целью является откат <code>master</code>
zh_cn: 如果您的主要目的是回滚 <code>master</code>

source: In General...
es: En general...
ja: 一般的には...
ko: 일반적으로 ...
ru: В общем...
zh_cn: 一般来说.....

source: It doesn't leave random temporary branches cluttering your tree
es: No deja ramas temporales aleatorias desordenando tu árbol
ja: それはあなたの木を乱雑にしているランダムな一時的な枝を残しません。
ko: 임의의 임시 가지가 나무를 혼란스럽게하지 않습니다.
ru: Это не оставляет случайных временных ветвей,загромождающих ваше дерево.
zh_cn: 它不会在你的树上留下随意的临时枝条,让你的树变得杂乱无章。

source: Most previous answers are dangerously wrong!
es: ¡La mayoría de las respuestas anteriores están peligrosamente equivocadas!
ja: 過去の回答のほとんどが危険なほど間違っています
ko: 대부분의 이전 답변은 위험합니다!
ru: Большинство предыдущих ответов опасны!
zh_cn: 前面的答案大多都是危险的错误!

source: Move the most recent commit(s) to a new branch with Git
es: Mover los compromisos más recientes a una nueva sucursal con Git
ja: Git で最新のコミットを新しいブランチに移動します。
ko: Git을 사용하여 가장 최근의 커밋을 새로운 브랜치로 옮깁니다.
ru: Переместить последний коммит(ы)в новую ветку с помощью Git'а.
zh_cn: 将最近的提交转移到一个新的分支中,使用Git

source: Moving to a new branch
es: Mudándose a una nueva sucursal
ja: 新しい支店への移転
ko: 새로운 지점으로 이동
ru: Переезд в новый филиал
zh_cn: 搬迁到新的分支机构

source: Moving to an existing branch
es: Mudarse a una sucursal existente
ja: 既存の支店への移動
ko: 기존 지점으로 이동
ru: Переход к существующему филиалу
zh_cn: 搬迁到现有的分支机构

source: Much simpler solution using git stash
es: Una solución mucho más simple usando el alijo de git
ja: git stash を使うよりもずっとシンプルなソリューションです。
ko: git stash를 사용하는 훨씬 간단한 솔루션
ru: Гораздо более простое решение с использованием гит-тайника
zh_cn: 更简单的解决方案是使用git stash

source: Note the hashes of (say 3) commits you want on <code>newbranch</code>. Here I shall use:
es: Tenga en cuenta los hashes de (digamos 3) confirmaciones que desee en <code>newbranch</code> . Aqu&iacute; usar&eacute;:
ja: <code>newbranch</code> で必要な（たとえば3つの）​​コミットのハッシュに注意してください。 ここで私は使用します：
ko: <code>newbranch</code> 에서 원하는 (예를 들어 3) 커밋의 해시를 주목하십시오. 여기서는 다음을 사용합니다.
ru: Обратите внимание на хеши (скажем, 3) <code>newbranch</code> вы хотите на newbranch . Здесь я буду использовать:
zh_cn: 注意在 <code>newbranch</code> 上想要的（假设3）提交的哈希值。 在这里我将使用：

source: Now you can push your code
es: Ahora puedes presionar tu código
ja: これで、あなたのコードをプッシュすることができるようになりました。
ko: 이제 코드를 푸시 할 수 있습니다
ru: Теперь ты можешь нажать свой код
zh_cn: 现在你可以推送你的代码

source: Now your job done. If you picked correct id and correct branch then you will success. So before do this be careful. else another problem can occur.
es: Ahora tu trabajo está hecho.Si eliges la identificación correcta y la rama correcta,entonces tendrás éxito.Así que antes de hacer esto ten cuidado.De lo contrario,puede ocurrir otro problema.
ja: これであなたの仕事は完了です。正しいidと正しいブランチを選択した場合は成功です。だから、これを行う前に注意してください。
ko: 이제 당신의 일이 끝났습니다. 올바른 ID와 올바른 지점을 선택하면 성공합니다. 따라서이 작업을 수행하기 전에주의하십시오. 다른 문제가 발생할 수 있습니다.
ru: Теперь твоя работа сделана.Если вы выбрали правильный ID и правильное ответвление,то вы добьетесь успеха.Поэтому,прежде чем это сделать,будьте осторожны.В противном случае может возникнуть другая проблема.
zh_cn: 现在你的工作完成了。如果你选择了正确的ID和正确的分支,那么你就成功了。所以在做这个之前要小心,否则会出现另一个问题。

source: OR (on Git 1.7.2+, use ranges)
es: O (en Git 1.7.2+,usar rangos)
ja: OR (Git 1.7.2 以降では ranges を使用)
ko: 또는 (Git 1.7.2 이상에서 사용 범위)
ru: ИЛИ (на Git 1.7.2+,диапазон использования)
zh_cn: 或(在Git 1.7.2以上版本中,使用范围)。

source: Since a branch is just a pointer, <em>master</em> pointed to the last commit. When you made <em>newBranch</em>, you simply made a new pointer to the last commit. Then using <code>git reset</code> you moved the <em>master</em> pointer back two commits. But since you didn't move <em>newBranch</em>, it still points to the commit it originally did.
es: Como una rama es solo un puntero, el <em>maestro</em> se&ntilde;al&oacute; la &uacute;ltima confirmaci&oacute;n. Cuando cre&oacute; <em>newBranch</em> , simplemente cre&oacute; un nuevo puntero a la &uacute;ltima confirmaci&oacute;n. Luego, usando <code>git reset</code> , movi&oacute; el puntero <em>maestro</em> hacia atr&aacute;s dos commits. Pero como no movi&oacute; <em>newBranch</em> , todav&iacute;a se&ntilde;ala la confirmaci&oacute;n que hizo originalmente.
ja: ブランチは単なるポインタなので、 <em>マスター</em>は最後のコミットをポイントしました。 <em>newBranch</em>を作成したときは、最後のコミットへの新しいポインタを作成しただけです。 次に、 <code>git reset</code> を使用して、 <em>マスター</em>ポインターを2つのコミットに戻しました。 しかし、 <em>newBranchを</em>移動しなかった<em>ので</em> 、それは最初に行ったコミットをまだ指し示しています。
ko: 브랜치는 단지 포인터이기 때문에 <em>마스터</em> 는 마지막 커밋을 가리 켰습니다. <em>newBranch</em> 를 만들었을 때 마지막 커밋에 대한 새로운 포인터를 만들었습니다. 그런 다음 <code>git reset</code> 을 사용하여 <em>마스터</em> 포인터를 두 커밋으로 다시 이동했습니다. 그러나 <em>newBranch를</em> 이동하지 않았 <em>으므로</em> 여전히 원래 커밋을 가리 킵니다.
ru: Поскольку ветвь является просто указателем, <em>мастер</em> указал на последний коммит. Когда вы сделали <em>newBranch</em> , вы просто сделали новый указатель на последний коммит. Затем, используя <code>git reset</code> , вы переместили <em>главный</em> указатель назад на два коммита. Но так как вы не переместили <em>newBranch</em> , он все еще указывает на коммит, который он сделал изначально.
zh_cn: 由于分支只是一个指针，因此<em>master</em>指向最后一次提交。 当您创建<em>newBranch时</em> ，您仅创建了指向最后一次提交的新指针。 然后使用 <code>git reset</code> 将<em>主</em>指针移回两次提交。 但是由于您没有移动<em>newBranch</em> ，它仍然指向它最初所做的提交。

source: So the reason that the following commands fail:
es: Así que la razón por la que los siguientes comandos fallan:
ja: ということで、以下のコマンドが失敗する理由です。
ko: 따라서 다음 명령이 실패하는 이유는 다음과 같습니다.
ru: Итак,причина,по которой следующие команды не работают:
zh_cn: 所以,以下命令失败的原因。

source: Some people also have other <code>upstreams</code> rather than <code>origin</code>, they should use appropriate <code>upstream</code>
es: Algunas personas tambi&eacute;n tienen otras <code>upstreams</code> lugar de <code>origin</code> , deben usar <code>upstream</code> apropiadas
ja: 一部の人々はまた、 <code>origin</code> ではなく他の <code>upstreams</code> 持っています、彼らは適切な <code>upstream</code> を使うべきです
ko: 일부 사람들은 <code>origin</code> 아닌 다른 <code>upstreams</code> 가지고 있기 때문에 적절한 <code>upstream</code> 를 사용해야합니다
ru: У некоторых людей также есть другие источники, а не <code>origin</code> , они должны использовать соответствующие <code>upstream</code>
zh_cn: 有些人还有其他 <code>upstreams</code> 而不是 <code>origin</code> ，应该使用适当的 <code>upstream</code>

source: Someone else may have pulled those changes. If you are only rewriting your local master there's no impact when it's pushed upstream, but pushing a rewritten history to collaborators can cause headaches.
es: Alguien más puede haber hecho esos cambios.Si sólo estás reescribiendo tu maestro local no hay impacto cuando se empuja río arriba,pero empujar una historia reescrita a los colaboradores puede causar dolores de cabeza.
ja: 他の誰かがその変更を引っ張ってきた可能性があります。ローカルマスターを書き換えているだけなら上流にプッシュされても影響はありませんが、書き換えた履歴を共同作業者にプッシュすると頭痛の種になります。
ko: 다른 사람이 이러한 변경 사항을 가져 왔을 수 있습니다. 로컬 마스터 만 다시 작성하는 경우 업스트림으로 푸시해도 아무런 영향이 없지만 다시 작성된 기록을 공동 작업자에게 푸시하면 두통이 발생할 수 있습니다.
ru: Кто-то другой,возможно,вытянул эти изменения.Если вы переписываете только своего локального мастера,это не имеет никакого эффекта,когда его толкают вверх по течению,но толкание переписанной истории к коллегам может вызвать головную боль.
zh_cn: 可能是别人把这些改动拉了出来。如果你只是改写本地的主程序,推送到上游时不会有什么影响,但把改写的历史推送给合作者会让人头疼。

source: Stashes away all the working file changes, making the <code>master</code> working tree exactly equal to the HEAD~3 state
es: Guarda todos los cambios del archivo de trabajo, haciendo que el &aacute;rbol de trabajo <code>master</code> exactamente igual al estado HEAD ~ 3
ja: すべての作業ファイルの変更を隠し、 <code>master</code> 作業ツリーをHEAD〜3状態と完全に一致させます
ko: 모든 작업 파일 변경 사항을 숨기고 <code>master</code> 작업 트리를 HEAD ~ 3 상태와 정확히 동일하게 만듭니다.
ru: Сохраняет все изменения рабочего файла, делая <code>master</code> рабочее дерево точно равным состоянию HEAD ~ 3
zh_cn: 整理所有工作文件的更改，使 <code>master</code> 工作树与HEAD〜3状态完全相等

source: Step 1 - Note which commits from master you want on a <code>newbranch</code>
es: Paso 1: <code>newbranch</code> qu&eacute; confirmaciones del maestro desea en una rama nueva
ja: ステップ1- <code>newbranch</code> マスターからどのコミットが必要かをメモします
ko: 1 단계- <code>newbranch</code> 원하는 마스터에서 커밋하는 메모
ru: Шаг 1 - Обратите внимание, какой коммит от мастера вы хотите на <code>newbranch</code>
zh_cn: 第1步-记下您想要在新 <code>newbranch</code> 上提交的主提交

source: Step 2 - Put them on the <code>newbranch</code>
es: Paso 2: <code>newbranch</code> en la rama nueva
ja: ステップ2- <code>newbranch</code> 置く
ko: 2 단계-새 가지에 놓으십시오
ru: Шаг 2 - Положите их на <code>newbranch</code>
zh_cn: 第2步-将它们放在新 <code>newbranch</code>

source: Suppose you branched off origin/master when it contained commits M1, M2, M3, then made three commits yourself:
es: Supongamos que te separaste del maestro de origen cuando contenía confirmaciones M1,M2,M3,y luego hiciste tres confirmaciones tú mismo:
ja: originmaster に M1,M2,M3 のコミットが含まれているときに originmaster を分岐させ、自分で 3 つのコミットを行ったとします。
ko: 커밋 M1, M2, M3을 포함 할 때 출발지 / 마스터에서 분기 한 다음 세 개의 커밋을 스스로 수행했다고 가정합니다.
ru: Предположим,что вы разветвились от оригинала,когда он содержал коммиты M1,M2,M3,а затем сделали три коммита самостоятельно:
zh_cn: 假设你分出了原点管理员,当它包含了M1、M2、M3的提交,然后自己做了三个提交。

source: Switches to an existing branch <code>newbranch</code>
es: Cambia a una rama existente <code>newbranch</code>
ja: 既存のブランチ <code>newbranch</code> に切り替えます
ko: 기존 지점 <code>newbranch</code> 지점으로 전환
ru: Переключение на существующую ветку <code>newbranch</code>
zh_cn: 切换到现有分支 <code>newbranch</code>

source: Technical explanation
es: Explicación técnica
ja: 技術的な説明
ko: 기술 설명
ru: Техническое пояснение
zh_cn: 技术解释

source: The <code>--keep</code> option preserves any uncommitted changes that you might have in unrelated files, or aborts if those changes would have to be overwritten -- similarly to what <code>git checkout</code> does. If it aborts, <code>git stash</code> your changes and retry, or use <code>--hard</code> to lose the changes (even from files that didn't change between the commits!)
es: La opci&oacute;n <code>--keep</code> conserva cualquier cambio no confirmado que pueda tener en archivos no relacionados, o aborta si esos cambios tuvieran que sobrescribirse, de manera similar a lo que hace <code>git checkout</code> . Si aborta, <code>git stash</code> sus cambios y <code>--hard</code> a intentarlo, o use --hard para perder los cambios (&iexcl;incluso de archivos que no cambiaron entre los commits!)
ja: <code>--keep</code> オプションは、関係のないファイルにある可能性のあるコミットされていない変更を保持するか、それらの変更を上書きする必要がある場合は <code>git checkout</code> と同様に中止します。 中止した場合は、 <code>git stash</code> 変更を隠して再試行するか、-- <code>--hard</code> を使用して変更を失います（コミット間で変更されなかったファイルからでも！）
ko: <code>--keep</code> 옵션은 관련없는 파일에서 발생할 수있는 커밋되지 않은 변경 사항을 유지하거나 <code>git checkout</code> 과 마찬가지로 해당 변경 사항을 덮어 써야하는 경우 중단됩니다. 중단되면 <code>git stash</code> 를 변경하고 다시 시도하거나 <code>--hard</code> 를 사용하여 변경 사항을 잃어 버리 십시오 (커밋간에 변경되지 않은 파일에서도)!
ru: Опция <code>--keep</code> сохраняет любые незафиксированные изменения, которые могут быть у вас в несвязанных файлах, или отменяется, если эти изменения необходимо будет перезаписать - аналогично тому, что делает <code>git checkout</code> . Если это <code>--hard</code> <code>git stash</code> свои изменения и повторите попытку или используйте --hard, чтобы потерять изменения (даже из файлов, которые не изменились между коммитами!)
zh_cn: <code>--keep</code> 选项会保留您可能在不相关的文件中进行的所有未提交的更改，如果必须覆盖这些更改，则中止该操作&ndash;与 <code>git checkout</code> 所做的操作类似。 如果它中止， <code>git stash</code> 您的更改 <code>--hard</code> 试，或使用--hard来丢失更改（即使来自提交之间未更改的文件！）

source: The OP stated the goal was to "take master back to before those commits were made" without losing changes and this solution does that.
es: La OP declaró que el objetivo era "llevar al maestro de vuelta a antes de que se hicieran esos compromisos" sin perder los cambios y esta solución hace eso.
ja: OPは、変更を失うことなく「マスターをコミット前の状態に戻す」ことを目標としていると述べていますが、このソリューションはそれを実現しています。
ko: OP는 목표가 변경 사항을 잃지 않고 "커밋하기 전에 마스터로 돌아가는 것"이라고 목표를 밝혔으며이 솔루션은 그렇게합니다.
ru: В ОП было заявлено,что цель заключается в том,чтобы "вернуть мастера обратно до того,как эти коммиты будут сделаны",не теряя при этом изменений,и это решение делает это.
zh_cn: OP表示,目标是 "在不丢失更改的情况下,将主控器收回到那些提交之前",而这个解决方案做到了这一点。

source: The method exposed by sykora is the best option in this case. But sometimes is not the easiest and it's not a general method. For a general method use <em>git cherry-pick</em>:
es: El m&eacute;todo expuesto por sykora es la mejor opci&oacute;n en este caso. Pero a veces no es lo m&aacute;s f&aacute;cil y no es un m&eacute;todo general. Para un m&eacute;todo general, use <em>git cherry-pick</em> :
ja: この場合、sykoraによって公開されるメソッドが最良のオプションです。 しかし、これは最も簡単な方法ではなく、一般的な方法ではありません。 一般的な方法では、 <em>git cherry-pickを</em>使用します。
ko: 이 경우 sykora에 의해 노출되는 방법이 가장 좋습니다. 그러나 때로는 가장 쉬운 방법이 아니며 일반적인 방법이 아닙니다. 일반적인 방법으로 <em>git cherry-pick을 사용하십시오</em> .
ru: Метод, раскрытый Sykora, является лучшим вариантом в этом случае. Но иногда это не самый простой и не общий метод. Для общего метода используйте <em>git cherry-pick</em> :
zh_cn: 在这种情况下，sykora公开的方法是最佳选择。 但是有时不是最简单的方法，也不是通用方法。 对于一般方法，请使用<em>git cherry-pick</em> ：

source: Then it cherry-picks those 3 commits back onto <code>newbranch</code>. Since they're no longer referenced by a branch, it does that by using git's <a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a>: <code>HEAD@{2}</code> is the commit that <code>HEAD</code> used to refer to 2 operations ago, i.e. before we 1. checked out <code>newbranch</code> and 2. used <code>git reset</code> to discard the 3 commits.
es: Luego, recoge los 3 commits de nuevo en <code>newbranch</code> . Como ya no se hace referencia a ellos por una rama, lo hace mediante el uso del <a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a> de git: <code>HEAD@{2}</code> es el commit que <code>HEAD</code> sol&iacute;a referirse a 2 operaciones hace, es decir, antes de que 1. comprob&aacute;ramos <code>newbranch</code> y 2. use <code>git reset</code> para descartar las 3 confirmaciones.
ja: 次に、それらの3つのコミットを <code>newbranch</code> にチェリーピックします 。 それらはブランチによって参照されなくなったので、gitの<a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a>を使用してそれを行います。HEAD <code>HEAD@{2}</code> は、 <code>HEAD</code> が2つの操作を参照するために使用したコミットです。 <code>git reset</code> して3つのコミットを破棄します。
ko: 그런 다음 해당 3 개의 커밋을 <code>newbranch</code> 로 다시 선택합니다. 그것들은 더 이상 브랜치에서 참조하지 않기 때문에 git의 <a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a> 를 사용하여 수행합니다. <code>HEAD@{2}</code> 는 <code>HEAD</code> 가 2 가지 작업을 참조하는 데 사용한 커밋입니다. 3 개의 커밋을 버리려면 <code>git reset</code> 하십시오.
ru: Затем он выбирает эти 3 <code>newbranch</code> обратно на новый филиал . Поскольку на них больше не ссылается ветвь, он делает это с помощью git <a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a> : <code>HEAD@{2}</code> - это коммит, который <code>HEAD</code> использовал для ссылки на 2 операции назад, то есть до того, как мы 1. проверили <code>newbranch</code> и 2. использовали <code>git reset</code> чтобы отменить 3 коммитов.
zh_cn: 然后，将这3次提交重选到 <code>newbranch</code> 。 由于它们不再被分支引用，因此通过使用git的<a href="http://gitready.com/intermediate/2009/02/09/reflog-your-safety-net.html">reflog</a>来做到这一点： <code>HEAD@{2}</code> 是 <code>HEAD</code> 之前用来引用2个操作的提交，即在我们1.检出 <code>newbranch</code> 和2.使用 <code>git reset</code> 以丢弃3次提交。

source: Then it forks off <code>newbranch</code>.
es: Luego se bifurca de <code>newbranch</code> .
ja: 次に、 <code>newbranch</code> を分岐します 。
ko: 그런 다음 <code>newbranch</code> 를 분기합니다.
ru: Затем он разветвляется.
zh_cn: 然后它分叉 <code>newbranch</code> 。

source: This behavior makes sense, and is generally the right thing to do when rebasing.
es: Este comportamiento tiene sentido,y generalmente es lo correcto cuando se rebaja.
ja: この動作は理にかなっており、一般的にはリベース時に行うのが正解です。
ko: 이 동작은 의미가 있으며 일반적으로 리베이스 할 때해야 할 일입니다.
ru: Такое поведение имеет смысл и,как правило,является правильным при перезагрузке.
zh_cn: 这种行为是有道理的,一般情况下,重新打基础的时候,这种行为是正确的。

source: This doesn't "move" them in the technical sense but it has the same effect:
es: Esto no los "mueve" en el sentido técnico,pero tiene el mismo efecto:
ja: これでは技術的な意味で「動かす」ことはできませんが、同じ効果があります。
ko: 이것은 기술적 의미에서 "이동"하지 않지만 동일한 효과가 있습니다.
ru: Это не "двигает" их в техническом смысле,но имеет тот же эффект:
zh_cn: 这并不是技术意义上的 "移动 "他们,但效果是一样的。

source: This method works by creating a new branch with the first command (<code>git branch newbranch</code>) but not switching to it. Then we roll back the current branch (master) and switch to the new branch to continue working.
es: Este m&eacute;todo funciona creando una nueva rama con el primer comando ( <code>git branch newbranch</code> ) pero sin cambiar a ella. Luego, retrocedemos la rama actual (maestra) y cambiamos a la nueva rama para continuar trabajando.
ja: この方法は、最初のコマンド（ <code>git branch newbranch</code> ）で新しいブランチを作成することで機能しますが、それには切り替えません。 次に、現在のブランチ（マスター）をロールバックし、新しいブランチに切り替えて作業を続けます。
ko: 이 방법은 첫 번째 명령 ( <code>git branch newbranch</code> )으로 새 분기를 작성하지만 전환하지는 않습니다. 그런 다음 현재 지점 (마스터)을 롤백하고 새 지점으로 전환하여 작업을 계속합니다.
ru: Этот метод работает, создавая новую ветку с первой командой ( <code>git branch newbranch</code> ), но не переключаясь на нее. Затем мы откатываем текущую ветку (master) и переключаемся на новую ветку, чтобы продолжить работу.
zh_cn: 此方法通过使用第一个命令（ <code>git branch newbranch</code> ）创建一个新分支但不切换到该分支来起作用 。 然后，我们回滚当前分支（主节点）并切换到新分支以继续工作。

source: To achieve what OP wants, its a 2-step process:
es: Para lograr lo que quiere OP,es un proceso de dos pasos:
ja: OPが欲しいものを実現するためには、2段階のプロセスが必要です。
ko: OP가 원하는 것을 달성하기 위해 2 단계 프로세스는 다음과 같습니다.
ru: Для достижения того,что хочет ОП,это двухступенчатый процесс:
zh_cn: 要达到OP的目的,需要一个2个步骤的过程。

source: To be sure to land on the right spot in the history its easier to work with the hash of the commit
es: Para asegurarse de aterrizar en el lugar correcto de la historia es más fácil trabajar con el hachís del compromiso
ja: コミットのハッシュを使って作業する方が簡単です。
ko: 커밋의 해시로 작업하기가 더 쉬운 역사의 올바른 지점에 도달하기 위해
ru: Чтобы быть уверенным,что приземлиться на нужное место в истории,проще работать с хэшем коммита.
zh_cn: 为了确保在历史记录中找到正确的位置,使用提交的哈希值比较容易。

source: To do this without rewriting history (i.e. if you've already pushed the commits):
es: Hacer esto sin reescribir la historia (es decir,si ya has empujado los compromisos):
ja: 履歴を書き換えずにこれを行うには(つまり、すでにコミットをプッシュしている場合)。
ko: 기록을 다시 쓰지 않고이 작업을 수행하려면 (예 : 커밋을 이미 푸시 한 경우) :
ru: Сделать это без переписывания истории (т.е.если вы уже толкнули коммиты):
zh_cn: 要做到不重写历史记录(即如果你已经推送了提交)。
