Repository: rueisnom/feedback
Catalog: xlf/16/28/56/3/1628563.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (if you prefer you can write <code>@{-1}</code> - the previously checked out branch - instead of <code>oldbranch</code>).
es: (si lo prefiere, puede escribir <code>@{-1}</code> , la rama desprotegida anteriormente, en lugar de <code>oldbranch</code> ).
ja: （必要に応じて、 <code>oldbranch</code> の代わりに、以前にチェックアウトしたブランチである <code>@{-1}</code> 記述できます）。
ko: (원하는 경우 <code>oldbranch</code> 대신 <code>@{-1}</code> -이전에 체크 아웃 한 분기)를 작성할 수 있습니다.
ru: (если вы предпочитаете, вы можете написать <code>@{-1}</code> - ранее проверенную ветвь - вместо <code>oldbranch</code> ).
zh_cn: （如果您愿意，可以编写 <code>@{-1}</code> -先前签出的分支-代替 <code>oldbranch</code> ）。

source: 1) Create a new branch, which moves all your changes to new_branch.
es: 1)Crear una nueva rama,que mueva todos sus cambios a new_branch.
ja: 1)新しいブランチを作成し、すべての変更を new_branch に移動します。
ko: 1) 새 브랜치를 작성하면 모든 변경 사항이 new_branch로 이동합니다.
ru: 1)Создайте новую ветку,которая перенесет все ваши изменения в new_branch.
zh_cn: 1)创建一个新的分支,将你所有的修改都移动到new_branch。

source: 1) make new branch where you want to commit you recent update.
es: 1)hacer una nueva sucursal en la que quieras enviar tu reciente actualización.
ja: 1)最近のアップデートをコミットしたい場所に新しいブランチを作成します。
ko: 1) 최근 업데이트를 커밋하려는 지점을 새로 만듭니다.
ru: 1)создать новую ветку,в которой вы хотите зафиксировать ваше последнее обновление.
zh_cn: 1)做一个新的分支,你想在哪里提交你最近的更新。

source: 2) Find Recent Commit Id for commit on new branch.
es: 2)Encuentra la identificación de compromiso reciente para el compromiso en la nueva rama.
ja: 2)新しいブランチのコミットの最近のコミットIDを探します。
ko: 2) 새로운 지점에서 커밋 할 최근 커밋 ID를 찾습니다.
ru: 2)Найти Id недавнего коммита для коммита на новую ветку.
zh_cn: 2)在新分支上找到最近提交的提交ID。

source: 2) Then go back to old branch.
es: 2)Entonces vuelve a la vieja rama.
ja: 2)その後、旧枝に戻ります。
ko: 2) 그런 다음 오래된 지점으로 돌아갑니다.
ru: 2)Затем вернись в старое отделение.
zh_cn: 2)然后回老支部。

source: 3) Copy that commit id note that Most Recent commit list take place on top. so you can find your commit. you also find this via message.
es: 3)Copia ese ID de confirmación,nota que la lista de confirmaciones más recientes se encuentra en la parte superior,para que puedas encontrar tu confirmación.También puedes encontrarla a través de un mensaje.
ja: 3)コミットIDをコピーして、一番上にある最新のコミットリストに注意してください。
ko: 3) 해당 커밋 ID를 복사하십시오. 가장 최근의 커밋 목록이 맨 위에 나타납니다. 커밋을 찾을 수 있습니다. 당신은 또한 메시지를 통해 이것을 찾을 수 있습니다.
ru: 3)Скопируйте идентификатор коммита,заметку о том,что самый последний список коммитов находится сверху,так что вы сможете найти ваш коммит.вы также найдете его в сообщении.
zh_cn: 3)复制该提交的id,注意最近的提交列表中的 "最近的提交 "放在最上面,这样你就可以找到你的提交。

source: 3) Do git rebase
es: 3)Hacer git rebase
ja: 3)git リベースを行う
ko: 3) 자식 리베이스 수행
ru: 3)Сделать скидку
zh_cn: 3)做git rebase

source: 4) Then the opened editor contains last 3 commit information.
es: 4)Luego el editor abierto contiene la información de los últimos 3 commits.
ja: 4)開いたエディタには、最後の3つのコミット情報が含まれています。
ko: 4) 그런 다음 열린 편집기에는 마지막 3 개의 커밋 정보가 포함됩니다.
ru: 4)Затем в открывшемся редакторе содержится последняя информация о 3-х коммитах.
zh_cn: 4)然后打开的编辑器包含最后3个提交信息。

source: 5) Change <code>pick</code> to <code>drop</code> in all those 3 commits. Then save and close the editor.
es: 5) Cambia la <code>pick</code> para <code>drop</code> todos esos 3 commits. Luego guarde y cierre el editor.
ja: 5）これら3つのコミットすべてを <code>drop</code> するように <code>pick</code> を変更します 。 次に、エディターを保存して閉じます。
ko: 5) 모든 3 개의 커밋에 <code>pick</code> 을 변경하십시오. 그런 다음 편집기를 저장하고 닫습니다.
ru: 5) Измените <code>pick</code> чтобы <code>drop</code> все эти 3 коммита. Затем сохраните и закройте редактор.
zh_cn: 5）更改 <code>pick</code> 以 <code>drop</code> 所有这3个提交。 然后保存并关闭编辑器。

source: 6) Now last 3 commits are removed from current branch (<code>master</code>). Now push the branch forcefully, with <code>+</code> sign before branch name.
es: 6) Ahora se eliminan las &uacute;ltimas 3 confirmaciones de la rama actual ( <code>master</code> ). Ahora empuje la rama con fuerza, con el signo <code>+</code> antes del nombre de la rama.
ja: 6）最後の3つのコミットが現在のブランチ（ <code>master</code> ）から削除されます。 ブランチ名の前に <code>+</code> 記号を付けて、ブランチを強制的にプッシュします。
ko: 6) 이제 마지막 분기 3 개의 커밋이 현재 분기 ( <code>master</code> )에서 제거됩니다. 이제 지점 이름 앞에 <code>+</code> 기호를 사용하여 지점을 강제로 밀어 넣으십시오.
ru: 6) Теперь последние 3 коммита удалены из текущей ветки ( <code>master</code> ). Теперь принудительно нажмите на ветку, со знаком <code>+</code> перед именем ветви.
zh_cn: 6）现在，最后3个提交已从当前分支（ <code>master</code> ）中删除。 现在，用力推分支，在分支名称前加 <code>+</code> 号。

source: <em>Warning: the reflog is enabled by default, but if you've manually disabled it (e.g. by using a "bare" git repository), you won't be able to get the 3 commits back after running <code>git reset --keep HEAD~3</code>.</em>
es: <em>Advertencia: el reflog est&aacute; habilitado de forma predeterminada, pero si lo ha deshabilitado manualmente (por ejemplo, utilizando un repositorio git "desnudo"), no podr&aacute; recuperar los 3 commits despu&eacute;s de ejecutar <code>git reset --keep HEAD~3</code> </em>
ja: <em>警告：reflogはデフォルトで有効になっていますが、手動で無効にした場合（たとえば、「裸」のgitリポジトリを使用して）、 <code>git reset --keep HEAD~3</code> 実行した後に3つのコミットを取得できなくなります--HEAD〜を維持してください〜 ３ 。</em>
ko: <em>경고 : reflog는 기본적으로 활성화되어 있지만 수동으로 비활성화하면 (예 : "bare"git 저장소를 사용하여) <code>git reset --keep HEAD~3</code> 실행 한 후 3 개의 커밋을 다시 가져올 수 없습니다. 3 .</em>
ru: <em>Предупреждение: reflog включен по умолчанию, но если вы отключили его вручную (например, с помощью &laquo;чистого&raquo; git-репозитория), вы не сможете вернуть 3 коммита после запуска <code>git reset --keep HEAD~3</code> </em>
zh_cn: <em>警告：默认情况下已启用reflog，但是如果您手动禁用了reflog（例如，通过使用&ldquo;裸露&rdquo;的git仓库），则在运行 <code>git reset --keep HEAD~3</code> 之后，您将无法取回3次提交--keep HEAD〜 3 。</em>

source: <em>git cherry-pick</em> applies those three commits to newbranch.
es: <em>git cherry-pick</em> aplica esos tres commits a newbranch.
ja: <em>git cherry-pick</em>はこれら3つのコミットをnewbranchに適用します。
ko: <em>git cherry-pick</em> 은 세 가지 커밋을 newbranch에 적용합니다.
ru: <em>git cherry-pick</em> применяет эти три коммита к newbranch.
zh_cn: <em>git cherry-pick</em>将这三个提交应用于newbranch。

source: <strong>Don't do this if you pushed master's changes upstream</strong>
es: <strong>No hagas esto si empujaste los cambios del maestro hacia arriba</strong>
ja: <strong>マスターの変更を上流にプッシュした場合は、これを行わないでください</strong>
ko: <strong>마스터 변경 사항을 업스트림으로 푸시 한 경우이 작업을 수행하지 마십시오</strong>
ru: <strong>Не делайте этого, если вы отправили изменения мастера вверх по течению</strong>
zh_cn: <strong>如果您将主控的更改推到上游，请不要这样做</strong>

source: <strong>Instead do this:</strong>
es: <strong>En cambio, haz esto:</strong>
ja: <strong>代わりにこれを行います：</strong>
ko: <strong>대신 이것을하십시오 :</strong>
ru: <strong>Вместо этого сделайте это:</strong>
zh_cn: <strong>而是这样做：</strong>

source: <strong>It doesn't preserve the mistaken commit messages,</strong> so you'll need to add a new commit message to this new commit
es: <strong>No conserva los mensajes de confirmaci&oacute;n err&oacute;neos,</strong> por lo que deber&aacute; agregar un nuevo mensaje de confirmaci&oacute;n a esta nueva confirmaci&oacute;n
ja: <strong>誤ったコミットメッセージは保持されないため、</strong>この新しいコミットに新しいコミットメッセージを追加する必要があります
ko: <strong>잘못된 커밋 메시지를 보존하지 않으므로이</strong> 새로운 커밋에 새로운 커밋 메시지를 추가해야합니다.
ru: <strong>Он не сохраняет ошибочные сообщения о коммите,</strong> поэтому вам нужно добавить новое сообщение о коммите в этот новый коммит
zh_cn: <strong>它不会保留错误的提交消息，</strong>因此您需要向此新提交添加新的提交消息。

source: <strong>Note:</strong> You can use the first seven characters or the whole commit hash
es: <strong>Nota:</strong> Puede usar los primeros siete caracteres o el hash de confirmaci&oacute;n completo
ja: <strong>注：</strong>最初の7文字またはコミットハッシュ全体を使用できます
ko: <strong>참고 :</strong> 처음 7 자 또는 전체 커밋 해시를 사용할 수 있습니다
ru: <strong>Примечание:</strong> вы можете использовать первые семь символов или весь хеш коммита
zh_cn: <strong>注意：</strong>您可以使用前七个字符或整个提交哈希

source: <strong>Old version</strong> - before I learned about <code>git branch -f</code>
es: <strong>Versi&oacute;n</strong> anterior: antes de aprender sobre <code>git branch -f</code>
ja: <strong>古いバージョン</strong> <code>git branch -f</code> について学ぶ前
ko: <strong>이전 버전</strong> - <code>git branch -f</code> 에 대해 배우기 전에 -f
ru: <strong>Старая версия</strong> - прежде чем я узнал о <code>git branch -f</code>
zh_cn: <strong>旧版本</strong> -在我了解 <code>git branch -f</code> 之前

source: <strong>WARNING:</strong> With Git version 2.0 and later, if you later <code>git rebase</code> the new branch upon the original (<code>master</code>) branch, you may need an explicit <code>--no-fork-point</code> option during the rebase to avoid losing the commits you moved from the master branch. Having <code>branch.autosetuprebase always</code> set makes this more likely. See <a href="https://stackoverflow.com/a/36463546/1256452">John Mellor's answer</a> for details.
es: <strong>ADVERTENCIA:</strong> con Git versi&oacute;n 2.0 y posteriores, si luego <code>git rebase</code> la nueva rama en la rama original ( <code>master</code> ), es posible que necesite una <code>--no-fork-point</code> expl&iacute;cita sin punto de bifurcaci&oacute;n durante la nueva versi&oacute;n para evitar perder las confirmaciones que movi&oacute; del rama maestra Tener <code>branch.autosetuprebase always</code> configurado hace que esto sea m&aacute;s probable. Vea <a href="https://stackoverflow.com/a/36463546/1256452">la respuesta de John Mellor</a> para m&aacute;s detalles.
ja: <strong>警告：</strong> Gitバージョン2.0以降では、後で新しいブランチを元の（ <code>master</code> ）ブランチに <code>git rebase</code> する場合、リベース中に明示的な <code>--no-fork-point</code> オプションが必要になる場合があります。マスターブランチ。 <code>branch.autosetuprebase always</code> 設定すると、これが起こりやすくなります。 詳細については、 <a href="https://stackoverflow.com/a/36463546/1256452">John Mellorの回答</a>を参照してください。
ko: <strong>경고 :</strong> Git 버전 2.0 이상에서 나중에 새 브랜치를 원래 ( <code>master</code> ) 브랜치에 리베이스하면, 리베이스 동안 이동 한 커밋을 잃지 않도록 명시적인 <code>--no-fork-point</code> 옵션이 필요할 수 있습니다. 마스터 브랜치. <code>branch.autosetuprebase always</code> 설정하면이 가능성이 높아집니다. 자세한 내용은 <a href="https://stackoverflow.com/a/36463546/1256452">John Mellor의 답변</a> 을 참조하십시오.
ru: <strong>ВНИМАНИЕ:</strong> В Git версии 2.0 и новее, если вы позже <code>git rebase</code> новую ветку на оригинальную ( <code>master</code> ) ветку, вам может понадобиться явная опция <code>--no-fork-point</code> во время перебазировки, чтобы избежать потери коммитов, перемещенных вами из мастер ветка. Наличие <code>branch.autosetuprebase always</code> установленного значения branch.autosetuprebase делает это более вероятным. См <a href="https://stackoverflow.com/a/36463546/1256452">. Ответ Джона Меллора</a> для деталей.
zh_cn: <strong>警告：</strong>在Git 2.0版及更高版本中，如果稍后 <code>git rebase</code> 将新分支重新设置为原始（ <code>master</code> ）分支，则在重新设置过程中可能需要显式的 <code>--no-fork-point</code> 选项，以避免丢失从主分支。 <code>branch.autosetuprebase always</code> 设置branch.autosetuprebase使其更有可能。 有关详细信息，请参见<a href="https://stackoverflow.com/a/36463546/1256452">John Mellor的答案</a> 。

source: <strong>[ 1 ]</strong> Rename <code>master</code> branch to your <code>newbranch</code> (assuming you are on <code>master</code> branch):
es: <strong>[1]</strong> Cambie el nombre de la rama <code>master</code> a su <code>newbranch</code> rama (suponiendo que est&eacute; en la rama <code>master</code> ):
ja: <strong>[1]</strong> <code>master</code> ブランチの名前を <code>newbranch</code> ブランチに変更します（ マスターブランチにいると仮定します）：
ko: <strong>[1]</strong> <code>master</code> 브랜치의 이름을 새 브랜치로 바꿉니다 ( 마스터 브랜치에 있다고 가정).
ru: <strong>[1]</strong> Переименуйте <code>master</code> ветку в вашу <code>newbranch</code> (при условии, что вы находитесь в <code>master</code> ветке):
zh_cn: <strong>[1]</strong>将 <code>master</code> 分支重命名为您的 <code>newbranch</code> （假设您位于 <code>master</code> 分支上）：

source: <strong>[ 2 ]</strong> Create <code>master</code> branch from the commit that you wish:
es: <strong>[2]</strong> Crea <code>master</code> rama maestra a partir del commit que desees:
ja: <strong>[2]</strong>希望するコミットから <code>master</code> ブランチを作成します。
ko: <strong>[2]</strong> 원하는 커밋에서 <code>master</code> 브랜치를 만듭니다 :
ru: <strong>[2]</strong> Создайте <code>master</code> ветку из коммита, который вы хотите:
zh_cn: <strong>[2]</strong>根据您希望的提交创建 <code>master</code> 分支：

source: <strong>create</strong> a <em>new branch</em> from the current one :<code>git branch new-branch-name</code>
es: <strong>crear</strong> una <em>nueva rama</em> de la actual: <code>git branch new-branch-name</code>
ja: 現在の<em>ブランチ</em>から<em>新しいブランチ</em>を<strong>作成します</strong> ： <code>git branch new-branch-name</code>
ko: 현재 <em>분기</em> 에서 <em>새 분기</em> 를 <strong>만듭니다</strong> <code>git branch new-branch-name</code>
ru: <strong>создайте</strong> <em>новую ветку</em> из текущей: <code>git branch new-branch-name</code>
zh_cn: 从当前<em>分支</em> <strong>创建</strong>一个<em>新分支</em> ： <code>git branch new-branch-name</code>

source: <strong>git branch -m master newbranch</strong>
ko: <strong>자식 분기 -m 마스터 새 분기</strong>
zh_cn: <strong>git branch -m主newbranch</strong>

source: <strong>git branch master B</strong>
ja: <strong>gitブランチマスターB</strong>
ko: <strong>자식 분기 마스터 B</strong>
zh_cn: <strong>git分支主管B</strong>

source: <strong>push</strong> your <em>new branch</em>: <code>git push origin new-branch-name</code>
es: <strong>empuje</strong> su <em>nueva sucursal</em> : <code>git push origin new-branch-name</code>
ja: <em>新しいブランチを</em> <strong>プッシュ</strong>する： <code>git push origin new-branch-name</code>
ko: <em>새 브랜치</em> <code>git push origin new-branch-name</code> : git push origin new-branch-name
ru: <strong>нажмите</strong> вашу <em>новую ветку</em> : <code>git push origin new-branch-name</code>
zh_cn: <strong>推送</strong>您的<em>新分支</em> ： <code>git push origin new-branch-name</code>

source: <strong>revert</strong> your <em>old(current) branch</em> to the last pushed/stable state: <code>git reset --hard origin/old-branch-name</code>
es: <strong>revierta</strong> su <em>rama anterior (actual)</em> al &uacute;ltimo estado de <code>git reset --hard origin/old-branch-name</code> / estable: git reset --hard origin / old-branch-name
ja: <em>古い（現在の）ブランチ</em>を最後にプッシュされた/安定した状態に<strong>戻し</strong>ます： <code>git reset --hard origin/old-branch-name</code>
ko: <em>이전 (현재) 브랜치</em> 를 마지막으로 푸시 / 안정적인 상태로 되돌 <code>git reset --hard origin/old-branch-name</code> : git reset --hard origin / old-branch-name
ru: <strong>вернуть</strong> вашу <em>старую (текущую) ветку</em> в последнее <code>git reset --hard origin/old-branch-name</code> / стабильное состояние: git reset --hard origin / old-branch-name
zh_cn: <strong>将</strong>您的<em>旧（当前）分支</em> <strong>还原</strong>到上一推送/稳定状态： <code>git reset --hard origin/old-branch-name</code>

source: After <code>git branch newBranch</code>:
es: Despu&eacute;s de <code>git branch newBranch</code> :
ja: <code>git branch newBranch</code> 後：
ko: <code>git branch newBranch</code> 후 :
ru: После <code>git branch newBranch</code> :
zh_cn: 在 <code>git branch newBranch</code> 之后 ：

source: After <code>git reset --hard HEAD~2</code>:
es: Despu&eacute;s de <code>git reset --hard HEAD~2</code> :
ja: <code>git reset --hard HEAD~2</code> 後：
ko: <code>git reset --hard HEAD~2</code> 후 --hard HEAD ~ 2 :
ru: После <code>git reset --hard HEAD~2</code> :
zh_cn: 在 <code>git reset --hard HEAD~2</code> 之后：

source: An alternative that doesn't rely on the reflog is:
es: Una alternativa que no depende del reflog es:
ja: リブログに頼らない代替案は
ko: reflog에 의존하지 않는 대안은 다음과 같습니다.
ru: Альтернатива,которая не зависит от рефлога:
zh_cn: 一个不依赖回录的替代方案是:。

source: Another way to do this:
es: Otra forma de hacer esto:
ja: もう一つの方法として
ko: 이를 수행하는 다른 방법 :
ru: Другой способ сделать это:
zh_cn: 另一种方法是:

source: Applies the stashed changes to your working directory and clears the stash
es: Aplica los cambios escondidos a tu directorio de trabajo y limpia el escondite.
ja: 隠した変更を作業ディレクトリに適用し、隠し場所をクリアします。
ko: 숨김 변경 사항을 작업 디렉토리에 적용하고 숨김을 지 웁니다.
ru: Применяет скрытые изменения в рабочей директории и очищает заначку.
zh_cn: 将隐藏的更改应用到工作目录中,并清除隐藏的更改。

source: As the next time you run <code>git rebase</code> (or <code>git pull --rebase</code>) those 3 commits would be silently discarded from <code>newbranch</code>! (see explanation below)
es: &iexcl;Como la pr&oacute;xima vez que ejecute <code>git rebase</code> (o <code>git pull --rebase</code> ), esas 3 confirmaciones se descartar&aacute;n silenciosamente de <code>newbranch</code> ! (ver explicaci&oacute;n a continuaci&oacute;n)
ja: 次回 <code>git rebase</code> （または <code>git pull --rebase</code> ）を実行すると、これらの3つのコミットは <code>newbranch</code> から自動的に破棄されます 。 （以下の説明を参照）
ko: 다음에 <code>git rebase</code> (또는 <code>git pull --rebase</code> )를 실행할 때,이 3 개의 commit은 <code>newbranch</code> 에서 자동으로 폐기됩니다! (아래 설명 참조)
ru: В следующий раз, когда вы запустите <code>git rebase</code> (или <code>git pull --rebase</code> ), эти 3 коммита будут отброшены из <code>newbranch</code> ! (см. объяснение ниже)
zh_cn: 下次运行 <code>git rebase</code> （或 <code>git pull --rebase</code> ）时，这3个提交将从 <code>newbranch</code> 中静默丢弃！ （请参阅下面的说明）

source: Being able to <code>push</code> to <code>.</code> is a nice trick to know.
es: Ser capaz de <code>push</code> <code>.</code> Es un buen truco para saber.
ja: に <code>push</code> できること <code>.</code> 知っておくと便利です。
ko: 로 <code>push</code> 할 수 <code>.</code> 알아두면 좋은 요령입니다.
ru: Будучи в состоянии <code>push</code> к <code>.</code> хороший трюк, чтобы знать.
zh_cn: 能够 <code>push</code> <code>.</code> 是个不错的窍门。

source: Both branches can then be pushed without force!
es: ¡Ambas ramas pueden ser empujadas sin fuerza!
ja: そうすれば、両枝は力を入れずに押すことができます
ko: 그러면 두 가지를 강제로 밀 수 있습니다!
ru: Обе ветки можно толкать без усилий!
zh_cn: 这样一来,两个枝条都可以不用用力就能推开!

source: But do make sure how many commits to go back. Alternatively, instead of <code>HEAD~3</code>, you can simply provide the hash of the commit (or the reference like <code>origin/master</code>) you want to revert back to, e.g:
es: Pero aseg&uacute;rese de cu&aacute;ntas confirmaciones para volver. Alternativamente, en lugar de <code>HEAD~3</code> , simplemente puede proporcionar el hash de la confirmaci&oacute;n (o la referencia como <code>origin/master</code> ) a la que desea volver, por ejemplo:
ja: ただし、戻すコミットの数を確認してください。 あるいは、 <code>HEAD~3</code> 代わりに、元に戻したいコミットのハッシュ（または <code>origin/master</code> のような参照）を提供することもできます。例えば：
ko: 그러나 얼마나 많은 커밋을 되돌릴 수 있는지 확인하십시오. 또는 <code>HEAD~3</code> 대신에 되돌릴 커밋의 해시 (또는 <code>origin/master</code> 와 같은 참조)를 간단히 제공 할 수 있습니다. 예 :
ru: Но убедитесь, сколько вернулось. В качестве альтернативы, вместо <code>HEAD~3</code> , вы можете просто предоставить хеш коммита (или ссылку, такую ​​как <code>origin/master</code> ), к которой вы хотите вернуться, например:
zh_cn: 但是请确保要返回多少次提交。 另外，除了HEAD〜3之外，您还可以提供要还原回的提交（或引用，例如 <code>origin/master</code> ）的哈希，例如：

source: But in this particular case we want those 3 commits to be considered as part of the topic branch. To achieve that, we need to fork off the upstream at the earlier revision that doesn't include the 3 commits. That's what my suggested solutions do, hence they both leave the reflog in the correct state.
es: Pero en este caso en particular queremos que esos 3 compromisos sean considerados como parte de la rama temática.Para lograrlo,necesitamos bifurcarnos en la revisión anterior que no incluye las 3 confirmaciones.Eso es lo que hacen mis soluciones sugeridas,por lo que ambas dejan el reflog en el estado correcto.
ja: しかし、この特定のケースでは、これらの 3 つのコミットをトピックブランチの一部とみなしたいのです。そのためには、3 つのコミットを含まない以前のリビジョンのアップストリームをフォークオフする必要があります。これが私の提案する解決策です。
ko: 그러나이 특별한 경우에 우리는이 3 개의 커밋이 토픽 브랜치의 일부로 간주되기를 원합니다. 이를 위해서는 3 개의 커밋이 포함되지 않은 이전 수정 버전에서 업스트림을 분기해야합니다. 그것이 내가 제안한 솔루션이하는 일이므로 둘 다 reflog를 올바른 상태로 둡니다.
ru: Но в данном конкретном случае мы хотим,чтобы эти 3 коммита рассматривались как часть тематической ветки.Для этого нам нужно отбросить восходящий поток в более ранней ревизии,которая не включает эти 3 коммита.Это то,что делают мои предложенные решения,поэтому оба они оставляют рефлог в правильном состоянии.
zh_cn: 但在这个特殊情况下,我们希望这3个提交被视为主题分支的一部分。为了实现这个目标,我们需要在之前的版本中分叉掉不包括这3个提交的上游。这就是我所建议的解决方案,因此它们都能让 reflog 处于正确的状态。

source: C commit: <code>9aa1233</code>
ja: Cコミット： <code>9aa1233</code>
ko: C 커밋 : <code>9aa1233</code>
zh_cn: C提交： <code>9aa1233</code>

source: D commit: <code>453ac3d</code>
ja: Dコミット： <code>453ac3d</code>
ko: D 커밋 : <code>453ac3d</code>
zh_cn: D提交： <code>453ac3d</code>

source: Do NOT do this:
es: No lo hagas:
ja: 絶対にやってはいけないことです。
ko: 이 작업을 수행하지 마십시오 :
ru: НЕ делайте этого:
zh_cn: 不要这样做。

source: E commit: <code>612ecb3</code>
ja: Eコミット： <code>612ecb3</code>
ko: 전자 커밋 : <code>612ecb3</code>
zh_cn: E提交： <code>612ecb3</code>

source: First it discards the 3 most recent commits (<code>--keep</code> is like <code>--hard</code>, but safer, as fails rather than throw away uncommitted changes).
es: Primero descarta los 3 commits m&aacute;s recientes ( <code>--keep</code> es como <code>--hard</code> , pero m&aacute;s seguro, ya que falla en lugar de descartar cambios no confirmados).
ja: 最初に、最新の3つのコミットを破棄します（ <code>--keep</code> は <code>--hard</code> に似ていますが、コミットされていない変更を破棄するよりも失敗するため、より安全です）。
ko: 먼저 가장 최근의 커밋 3 개를 버립니다 ( <code>--keep</code> 은 <code>--hard</code> 와 비슷하지만 커밋되지 않은 변경 사항을 버리는 대신 실패하므로 더 안전합니다).
ru: Сначала он отбрасывает 3 самых последних коммита ( <code>--hard</code> похож на --hard , но безопаснее, поскольку дает сбой, а не выбрасывает незафиксированные изменения).
zh_cn: 首先，它丢弃最近的3次提交（ <code>--keep</code> 就像 <code>--hard</code> 一样，但更安全，因为失败而不是丢弃未提交的更改）。

source: For more details, see the definition of <code>--fork-point</code> in the <a href="https://git-scm.com/docs/git-rebase">git rebase</a> and <a href="https://git-scm.com/docs/git-merge-base">git merge-base</a> docs.
es: Para obtener m&aacute;s detalles, consulte la definici&oacute;n de <code>--fork-point</code> en los documentos <a href="https://git-scm.com/docs/git-rebase">git rebase</a> y <a href="https://git-scm.com/docs/git-merge-base">git merge-base</a> .
ja: 詳細については、 <a href="https://git-scm.com/docs/git-rebase">git rebase</a>および<a href="https://git-scm.com/docs/git-merge-base">git merge-base</a>ドキュメントの <code>--fork-point</code> の定義を参照してください。
ko: 자세한 내용은 <a href="https://git-scm.com/docs/git-rebase">git rebase</a> 및 <a href="https://git-scm.com/docs/git-merge-base">git merge-base</a> docs에서 <code>--fork-point</code> 정의를 참조하십시오.
ru: Для получения более подробной информации смотрите определение <code>--fork-point</code> в документации <a href="https://git-scm.com/docs/git-rebase">git rebase</a> и <a href="https://git-scm.com/docs/git-merge-base">git merge-base</a> .
zh_cn: 有关更多详细信息，请参见<a href="https://git-scm.com/docs/git-rebase">git rebase</a>和<a href="https://git-scm.com/docs/git-merge-base">git merge-base</a>文档中的 <code>--fork-point</code> 定义。

source: For those wondering why it works (as I was at first):
es: Para aquellos que se preguntan por qué funciona (como yo al principio):
ja: なぜ効果があるのか疑問に思っている方へ(最初は私もそうでしたが)。
ko: 왜 그것이 효과가 있는지 궁금해하는 사람들을 위해 :
ru: Для тех,кто интересуется,почему это работает (как я был поначалу):
zh_cn: 对于那些想知道它为什么能用的人来说(就像我最初的时候一样)。

source: Had just this situation:
es: Tenía esta situación:
ja: ちょうどこのような状況になっていました。
ko: 이 상황 만 있었다 :
ru: Только что была такая ситуация:
zh_cn: 就有这种情况。
