Repository: rueisnom/feedback
Catalog: xlf/49/50/21/495021.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Here is an example of this for a dynamic array class.
es: Aquí hay un ejemplo de esto para una clase de arreglo dinámico.
ja: 以下に動的配列クラスの例を示します。
ko: 다음은 동적 배열 클래스에 대한 예입니다.
ru: Приведем пример для класса динамических массивов.
zh_cn: 下面是一个动态数组类的例子。

source: However since templates need to be processed in the compilation step in order to generate code for each template instantiation that you define, so simply compiling a template separate from it's header file won't work because they always go hand and hand, for the very reason that each template instantiation is a whole new class literally. In a regular class you can separate .h and .cpp because .h is a blueprint of that class and the .cpp is the raw implementation so any implementation files can be compiled and linked regularly, however using templates .h is a blueprint of how the class should look not how the object should look meaning a template .cpp file isn't a raw regular implementation of a class, it's simply a blueprint for a class, so any implementation of a .h template file can't be compiled because you need something concrete to compile, templates are abstract in that sense.
es: Sin embargo,como las plantillas necesitan ser procesadas en el paso de compilación para generar código para cada instanciación de plantilla que definas,así que simplemente compilar una plantilla separada de su archivo de cabecera no funcionará porque siempre van de la mano,por la misma razón que cada instanciación de plantilla es una clase completamente nueva literalmente.En una clase normal se pueden separar los archivos .h y .cpp porque el .h es un plano de esa clase y el .cpp es la implementación en bruto,por lo que cualquier archivo de implementación puede ser compilado y enlazado regularmente,sin embargo,el uso de plantillas .h es un plano de cómo debe ser la clase y no de cómo debe ser el objeto,lo que significa que un archivo de plantilla .cpp no es una implementación regular en bruto de una clase,es simplemente un plano de una clase,por lo que cualquier implementación de un archivo de plantilla .h no puede ser compilada porque se necesita algo concreto para compilar,las plantillas son abstractas en ese sentido.
ja: しかし、テンプレートは、定義した各テンプレートのインスタンス化のコードを生成するためにコンパイルステップで処理する必要があるので、単にテンプレートをヘッダファイルから分離してコンパイルするだけではうまくいきません。通常のクラスでは.hと.cppを分離することができます。.hはそのクラスの設計図であり、.cppは生の実装なので、実装ファイルをコンパイルして定期的にリンクすることができますが、テンプレートを使用している.hはクラスがどのように見えるかの設計図であり、オブジェクトがどのように見えるかの設計図ではないので、.cppファイルはクラスの生の通常の実装ではありません。
ko: 그러나 정의한 각 템플릿 인스턴스화에 대한 코드를 생성하기 위해 컴파일 단계에서 템플릿을 처리해야하므로 헤더 파일과 별도의 템플릿을 컴파일하는 것은 항상 손을 잡고 이동하기 때문에 작동하지 않습니다. 각 템플릿 인스턴스화는 문자 그대로 완전히 새로운 클래스입니다. 일반 클래스에서는 .h가 해당 클래스의 청사진이고 .cpp가 원시 구현이므로 .h와 .cpp를 분리 할 수 ​​있습니다. 따라서 구현 파일을 정기적으로 컴파일하고 링크 할 수 있지만 템플릿을 사용하면 .h는 클래스는 객체가 템플릿 .cpp 파일이 클래스의 원시 일반 구현이 아니라 단순히 클래스의 청사진 일 뿐이므로 .h 템플릿 파일의 구현을 컴파일 할 수 없기 때문에 객체가 어떻게 보이는지 보여서는 안됩니다. 컴파일하려면 구체적인 내용이 필요합니다. 템플릿은 그런 의미에서 추상적입니다.
ru: Однако,поскольку шаблоны необходимо обрабатывать на этапе компиляции,чтобы сгенерировать код для каждого заданного вами инстанцирования шаблона,то простая компиляция шаблона отдельно от его заголовочного файла не сработает,потому что они всегда идут рука об руку,по той самой причине,что каждое инстанцирование шаблона-это совершенно новый класс в буквальном смысле слова.В обычном классе Вы можете разделить .h и .cpp,потому что .h-это чертеж этого класса,а .cpp-это сырая реализация,так что любые файлы реализации могут компилироваться и компоноваться регулярно,однако использование шаблонов .h-это чертеж того,как должен выглядеть класс,а не то,как должен выглядеть объект,что означает,что шаблонный .cpp файл-это не сырая обычная реализация класса,это просто чертеж класса,так что любая реализация .h шаблонного файла не может быть скомпилирована,потому что Вам нужно что-то конкретное для компиляции,шаблоны абстрактны в этом смысле.
zh_cn: 然而,由于模板需要在编译步骤中处理,以便为你定义的每一个模板实例生成代码,所以简单地将模板与头文件分开编译是行不通的,因为它们总是相辅相成的,因为每个模板实例都是一个全新的类。在一个常规类中,你可以把.h和.cpp分开,因为.h是该类的蓝图,而.cpp是原始的实现,所以任何实现文件都可以被编译和链接,但是使用模板.h是一个蓝图,它是类应该如何看的蓝图,而不是对象应该如何看的蓝图,也就是说模板.cpp文件不是一个类的原始常规实现,它只是一个类的蓝图,所以任何实现.h模板文件都不能被编译,因为你需要具体的东西来编译,模板在这个意义上是抽象的。

source: I do this because static analyzers for the code break when it does not see the forward declarations of class in *.tpp. This is annoying when writing code in any IDE or using YouCompleteMe or others.
es: Hago esto porque los analizadores estáticos para la ruptura de código cuando no ve las declaraciones de clase en *.tpp.Esto es molesto cuando se escribe código en cualquier IDE o se utiliza YouCompleteMe u otros.
ja: これは、*.tppのクラスの前方宣言が表示されないとコードのスタティックアナライザが壊れてしまうので、私はこれを行います。これは、任意のIDEでコードを書いたり、YouCompleteMeなどを使ってコードを書くときに迷惑です。
ko: 코드의 정적 분석기가 * .tpp에서 클래스의 전달 선언을 볼 수 없을 때 중단되기 때문에이 작업을 수행합니다. IDE에서 코드를 작성하거나 YouCompleteMe 또는 기타를 사용할 때 성가신 일입니다.
ru: Я делаю это потому,что статические анализаторы кода ломаются,когда не видно прямых объявлений класса в *.tpp.Это раздражает при написании кода в любой IDE,использовании YouCompleteMe или других.
zh_cn: 我这样做是因为当静态分析器的代码没有看到*.tpp中的类的前向声明时,静态分析器就会崩溃。当在任何IDE中写代码或使用YouCompleteMe或其他的代码时,这很烦人。

source: I suggest looking at this gcc page which discusses the tradeoffs between the "cfront" and "borland" model for template instantiations.
es: Sugiero que mire esta página de GCC que discute los intercambios entre el modelo "cfront" y "borland" para las instancias de la plantilla.
ja: テンプレートのインスタンス化のための "cfront "モデルと "borland "モデルの間のトレードオフについて議論しているこのgccのページを見ることをお勧めします。
ko: 템플릿 인스턴스화를위한 "cfront"모델과 "borland"모델 간의 장단점을 설명하는이 gcc 페이지를 참조하십시오.
ru: Предлагаю взглянуть на эту страницу gcc,где обсуждаются компромиссы между моделью "cfront" и моделью "borland" для шаблонных инстанций.
zh_cn: 我建议看看这个gcc页面,它讨论了 "cfront "和 "borland "模板实例化模型之间的权衡。

source: I took the following approach, which works also for older compilers (gcc 4.3.4, aCC A.03.13).
es: Tomé el siguiente enfoque,que funciona también para los compiladores más antiguos (gcc 4.3.4,aCC A.03.13).
ja: 私は以下のようなアプローチをとりましたが、これは古いコンパイラ(gcc 4.3.4,aCC A.03.13)でも動作します。
ko: 이전 컴파일러 (gcc 4.3.4, aCC A.03.13)에서도 작동하는 다음과 같은 접근 방식을 취했습니다.
ru: Я использовал следующий подход,который работает и для более старых компиляторов (gcc 4.3.4,aCC A.03.13).
zh_cn: 我采取了以下方法,这对老的编译器(gcc 4.3.4,aCC A.03.13)也是有效的。

source: If <strong>foo.cpp</strong> itself uses <code>MyClass&lt;int&gt;</code>, then code for that will be generated while compiling <strong>foo.cpp</strong>, so when <strong>bar.o</strong> is linked to <strong>foo.o</strong> they can be hooked up and will work. We can use that fact to allow a finite set of template instantiations to be implemented in a .cpp file by writing a single template. But there's no way for <strong>bar.cpp</strong> to use the template <em>as a template</em> and instantiate it on whatever types it likes; it can only use pre-existing versions of the templated class that the author of <strong>foo.cpp</strong> thought to provide.
es: Si <strong>foo.cpp</strong> usa <code>MyClass&lt;int&gt;</code> , entonces el c&oacute;digo para eso se generar&aacute; al compilar <strong>foo.cpp</strong> , de modo que cuando <strong>bar.o</strong> est&eacute; vinculado a <strong>foo.o</strong> se puedan conectar y funcionar&aacute;n. Podemos usar ese hecho para permitir que se implemente un conjunto finito de instancias de plantilla en un archivo .cpp escribiendo una sola plantilla. Pero no hay forma de que <strong>bar.cpp</strong> use la plantilla <em>como plantilla</em> y la instancia en los tipos que le gusten; solo puede usar versiones preexistentes de la clase con plantilla que el autor de <strong>foo.cpp</strong> pens&oacute; proporcionar.
ja: <strong>foo.cpp</strong>自体が <code>MyClass&lt;int&gt;</code> 使用する場合、そのためのコードは<strong>foo.cppの</strong>コンパイル中に生成されるため、 <strong>bar.o</strong>が<strong>foo.o</strong>にリンクされている場合は、それらを接続して機能します。 この事実を利用して、単一のテンプレートを作成することで、テンプレートのインスタンス化の有限セットを.cppファイルに実装できます。 しかし、 <strong>bar.cpp</strong>がテンプレートをテンプレート<em>として</em>使用し、好きなタイプでインスタンス化する方法はありません。 <strong>foo.cpp</strong>の作者が提供<strong>しよ</strong>うと考えていたテンプレートクラスの既存のバージョンのみを使用できます。
ko: <strong>foo.cpp</strong> 자체가 <code>MyClass&lt;int&gt;</code> 사용하는 경우 <strong>foo.cpp</strong> 를 컴파일하는 동안 해당 코드가 생성되므로 <strong>bar.o</strong> 가 <strong>foo.o에</strong> 연결되면 연결되어 작동합니다. 이 사실을 사용하여 단일 템플릿을 작성하여 유한 템플릿 인스턴스화를 .cpp 파일로 구현할 수 있습니다. 그러나 <strong>bar.cpp</strong> 가 템플릿을 템플릿 <em>으로</em> 사용하고 원하는 형식으로 인스턴스화하는 방법은 없습니다. <strong>foo.cpp</strong> 작성자가 제공 한 템플릿 클래스의 기존 버전 만 사용할 수 있습니다.
ru: Если сам <strong>foo.cpp</strong> использует <code>MyClass&lt;int&gt;</code> , то код для этого будет сгенерирован при компиляции <strong>foo.cpp</strong> , поэтому, когда <strong>bar.o</strong> связан с <strong>foo.o,</strong> они могут быть подключены и будут работать. Мы можем использовать этот факт, чтобы разрешить реализацию конечного набора шаблонов в файле .cpp, написав один шаблон. Но <strong>bar.cpp не</strong> может использовать шаблон <em>в качестве шаблона</em> и создавать его экземпляры для любых типов; он может использовать только существующие версии шаблонного класса, которые автор <strong>foo.cpp</strong> решил предоставить.
zh_cn: 如果<strong>foo.cpp</strong>本身使用 <code>MyClass&lt;int&gt;</code> ，则将在编译<strong>foo.cpp</strong>时生成该代码，因此，当<strong>bar.o</strong>与<strong>foo.o</strong>链接时，它们可以被连接起来并可以正常工作。 我们可以利用这一事实，通过编写单个模板，在.cpp文件中实现一组有限的模板实例化。 但是， <strong>bar.cpp</strong>无法将模板<em>用作模板</em> ，并在所需的任何类型上实例化它。 它只能使用<strong>foo.cpp</strong>的作者认为提供的模板化类的现有版本。

source: If I was really worried about speed, I suppose I would explore using Precompiled Headers <a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html</a>
es: Si realmente me preocupara la velocidad, supongo que explorar&iacute;a el uso de encabezados precompilados <a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html</a>
ja: 速度が本当に心配だった場合は、プリコンパイル済みヘッダーを使用して探索すると思い<a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">ますhttps://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html</a>
ko: 속도가 정말 걱정된다면 미리 컴파일 된 헤더를 사용하여 탐색한다고 가정합니다 <a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html</a>
ru: Если бы я действительно беспокоился о скорости, я полагаю, что я бы изучил использование предварительно скомпилированных заголовков <a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html.</a>
zh_cn: 如果我真的担心速度，我想我会探索使用预编译头<a href="https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html">https://gcc.gnu.org/onlinedocs/gcc/Precompiled-Headers.html</a>

source: If my explanation isn't clear enough, you can have a look at the <a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">C++ Super-FAQ on this subject</a>.
es: Si mi explicaci&oacute;n no es lo suficientemente clara, puede echar un vistazo a las <a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">preguntas frecuentes de C ++ Super sobre este tema</a> .
ja: 私の説明が十分に明確でない場合は、 <a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">このテーマに関するC ++ Super-FAQをご覧ください</a> 。
ko: 내 설명이 명확하지 않으면 <a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">이 주제에</a> 대한 C ++ Super-FAQ을 살펴볼 수 있습니다.
ru: Если мое объяснение недостаточно ясно, вы можете взглянуть на <a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">C ++ Super-FAQ по этому вопросу</a> .
zh_cn: 如果我的解释不够清楚，您可以查看<a href="https://isocpp.org/wiki/faq/templates#templates-defn-vs-decl">有关此主题</a>的C ++ Super-FAQ 。

source: If the concern is the extra compilation time and binary size bloat produced by compiling the .h as part of all the .cpp modules using it, in many cases what you can do is make the template class descend from a non-templatized base class for non type-dependent parts of the interface, and that base class can have its implementation in the .cpp file.
es: Si lo que preocupa es el tiempo extra de compilación y la hinchazón de tamaño binario que se produce al compilar el .h como parte de todos los módulos .cpp que lo utilizan,en muchos casos lo que se puede hacer es hacer que la clase de plantilla descienda de una clase base no templada para las partes no dependientes del tipo de la interfaz,y esa clase base puede tener su implementación en el archivo .cpp.
ja: .hを使用しているすべての.cppモジュールの一部としてコンパイルすることで、余分なコンパイル時間とバイナリサイズの肥大化が懸念される場合、多くの場合、あなたができることは、インターフェイスの型に依存しない部分のためにテンプレート化されていないベースクラスからテンプレートクラスを降順させ、そのベースクラスは.cppファイルにその実装を持つことができます。
ko: .h를 사용하여 모든 .cpp 모듈의 일부로 .h를 컴파일하여 생성되는 추가 컴파일 시간과 이진 크기 팽창이 우려되는 경우, 템플릿 클래스가 템플릿 화되지 않은 기본 클래스에서 내려 오는 것입니다. 인터페이스의 유형에 의존하지 않는 부분과 해당 기본 클래스는 .cpp 파일에서 구현할 수 있습니다.
ru: Если речь идет о дополнительном времени компиляции и раздувании бинарного размера при компиляции .h как части всех модулей .cpp,использующих его,то во многих случаях можно сделать так,чтобы базовый класс шаблона происходил от базового класса,не зависящего от типа,для не зависящих от типа частей интерфейса,и этот базовый класс может иметь свою реализацию в .cpp-файле.
zh_cn: 如果你担心的是将.h作为所有使用.cpp模块的一部分来编译.h所产生的额外的编译时间和二进制大小的臃肿,那么在很多情况下,你可以做的是让模板类从一个非模板化的基类中降生出来,用于接口的非类型依赖部分,而这个基类可以在.cpp文件中实现。

source: If you, at the bottom of the implementation cpp file, do explicit instantiation of all the types the template will be used with, the linker will be able to find them as usual.
es: Si usted,en la parte inferior del archivo cpp de implementación,hace una instanciación explícita de todos los tipos con los que se utilizará la plantilla,el enlazador podrá encontrarlos como de costumbre.
ja: 実装cppファイルの一番下で、テンプレートが使用するすべての型のインスタンス化を明示的に行うと、リンカは通常通りそれらを見つけることができるようになります。
ko: 구현 cpp 파일의 맨 아래에서 템플릿에 사용될 모든 유형을 명시 적으로 인스턴스화하면 링커에서 평소처럼 찾을 수 있습니다.
ru: Если Вы,внизу реализации cpp файла,сделаете явное инстанцирование всех типов,с которыми будет использоваться шаблон,то компоновщик сможет найти их,как обычно.
zh_cn: 如果你在实现cpp文件的底部,对模板要使用的所有类型做了显式实例化,链接器就能像往常一样找到它们。

source: In my experience, I rely on the C++ Standard Library and Boost templates being instantiated for each compilation unit (using a template library). For my large template classes, I do manual template instantiation, once, for the types I need.
es: En mi experiencia,confío en que las plantillas de la Biblioteca Estándar de C++y de Boost sean instanciadas para cada unidad de compilación (usando una biblioteca de plantillas).Para mis clases de plantillas grandes,hago la instanciación manual de plantillas,una vez,para los tipos que necesito.
ja: 私の経験では、私は C++標準ライブラリと Boost テンプレートをコンパイル単位ごとに(テンプレート ライブラリを使用して)インスタンス化することに依存しています。大規模なテンプレートクラスの場合は、必要な型については一度手動でテンプレートのインスタンス化を行っています。
ko: 필자는 경험에 따라 C ++ 표준 라이브러리 및 부스트 템플릿을 사용하여 각 컴파일 단위마다 인스턴스화되고 있습니다 (템플릿 라이브러리 사용). 큰 템플릿 클래스의 경우 필요한 유형에 대해 수동 템플릿 인스턴스화를 한 번 수행합니다.
ru: По своему опыту я полагаюсь на стандартную библиотеку C++и Boost шаблоны,инстанцируемые для каждой единицы компиляции (с использованием библиотеки шаблонов).Для моих больших классов шаблонов я делаю ручную инстанцификацию шаблонов,один раз,для тех типов,которые мне нужны.
zh_cn: 根据我的经验,我依靠C++标准库和Boost模板为每个编译单元实例化(使用模板库)。对于我的大型模板类,我对我需要的类型进行手动模板实例化,一次就完成了。

source: It contains explicit recommendations concerning using manual and automatic template instantiation. For example, the "-repo" option can be used to collect templates which need to be instantiated. Or another option is to disable automatic template instantiations using "-fno-implicit-templates" to force manual template instantiation.
es: Contiene recomendaciones explícitas sobre el uso de la instanciación manual y automática de plantillas.Por ejemplo,la opción "-repo" puede utilizarse para recoger las plantillas que deben ser instanciadas.Otra opción es desactivar la instanciación automática de plantillas usando "-fno-implicit-templates" para forzar la instanciación manual de plantillas.
ja: これには、手動および自動テンプレートのインスタンス化に関する明確な推奨事項が含まれています。例えば、"-repo "オプションは、インスタンス化が必要なテンプレートを収集するために使用することができます。あるいは、"-fno-implicit-templates "を使って自動テンプレートのインスタンス化を無効にし、手動テンプレートのインスタンス化を強制的に行うこともできます。
ko: 수동 및 자동 템플릿 인스턴스화 사용과 관련된 명시적인 권장 사항이 포함되어 있습니다. 예를 들어, "-repo"옵션을 사용하여 인스턴스화해야하는 템플릿을 수집 할 수 있습니다. 또는 다른 옵션은 "-fno-implicit-templates"를 사용하여 자동 템플릿 인스턴스화를 비활성화하여 수동 템플릿 인스턴스화를 강제하는 것입니다.
ru: В нем содержатся четкие рекомендации по использованию ручной и автоматической инстанцификации шаблонов.Например,опция "-repo" может быть использована для сбора шаблонов,которые необходимо инстанцировать.Или другая опция-отключить автоматическую инстанцирование шаблонов с помощью "-fno-implicit-templates" для принудительной ручной инстанцирования шаблона.
zh_cn: 它包含了关于使用手动和自动模板实例化的明确建议。例如,可以使用"-repo "选项来收集需要实例化的模板。或者另一个选项是使用"-fno-implicit-templates "禁用自动模板实例化,强制手动模板实例化。

source: It is technically possible to create some sort of functionality that will save the template.cpp file and switch out the types when it finds them in other sources, I think that the standard does have a keyword <code>export</code> that will allow you to put templates in a separate cpp file but not that many compilers actually implement this.
es: Es t&eacute;cnicamente posible crear alg&uacute;n tipo de funcionalidad que guardar&aacute; el archivo template.cpp y cambiar&aacute; los tipos cuando los encuentre en otras fuentes, creo que el est&aacute;ndar tiene una <code>export</code> aci&oacute;n de palabras clave que le permitir&aacute; colocar plantillas en un archivo cpp separado pero no muchos compiladores realmente implementan esto.
ja: template.cppファイルを保存し、他のソースでそれらを見つけたときにタイプを切り替える何らかの機能を作成することは技術的に可能です。標準には、テンプレートを個別のcppファイルですが、実際には多くのコンパイラがこれを実装していません。
ko: 기술적으로 template.cpp 파일을 저장하고 다른 소스에서 찾을 때 유형을 전환하는 일종의 기능을 만들 수 있습니다. 표준에는 템플릿을 파일에 넣을 수있는 키워드 <code>export</code> 가 있다고 생각합니다 별도의 cpp 파일이지만 많은 컴파일러가 실제로 이것을 구현하지는 않습니다.
ru: Технически возможно создать какую-то функциональность, которая будет сохранять файл template.cpp и переключать типы, когда он находит их в других источниках. Я думаю, что в стандарте есть <code>export</code> ключевых слов, который позволит вам помещать шаблоны в отдельный файл cpp, но не так много компиляторов фактически реализуют это.
zh_cn: 从技术上讲，可以创建某种功能来保存template.cpp文件，并在其他来源中找到它们时切换出类型，我认为该标准确实具有关键字 <code>export</code> ，可将模板放入一个单独的cpp文件，但实际上并没有很多编译器实现。

source: It means that the most portable way to define method implementations of template classes is to define them inside the template class definition.
es: Significa que la forma más portátil de definir implementaciones de métodos de clases de plantillas es definirlas dentro de la definición de la clase de plantillas.
ja: テンプレートクラスのメソッド実装を定義する最も移植性の高い方法は、テンプレートクラスの定義内で定義することだということを意味します。
ko: 템플릿 클래스의 메소드 구현을 정의하는 가장 이식 가능한 방법은 템플릿 클래스 정의 내에서 정의하는 것입니다.
ru: Это означает,что наиболее переносимым способом определения реализации методов шаблонных классов является их определение внутри определения шаблонного класса.
zh_cn: 这意味着,定义模板类的方法实现,最可移植的方式是在模板类定义中定义方法实现。

source: It's because of the requirement for separate compilation and because templates are instantiation-style polymorphism.
es: Es por el requisito de la compilación por separado y porque las plantillas son un polimorfismo de tipo instanciación.
ja: 別々にコンパイルする必要があるのと、テンプレートがインスタンシエーション風のポリモーフィズムだからです。
ko: 별도의 컴파일이 필요하고 템플릿이 인스턴스화 스타일의 다형성이기 때문입니다.
ru: Это связано с требованием отдельной компиляции,а также с тем,что шаблоны являются полиморфизмом в стиле инстанцирования.
zh_cn: 这是因为要求单独编译,也是因为模板是实例化式的多态性。

source: Just a side note, when making specializations for a template class, you can separate the header from the implementation because a specialization by definition means that I am specializing for a concrete type that can be compiled and linked individually.
es: Sólo una nota al margen,cuando se hacen especializaciones para una clase de plantilla,se puede separar el encabezamiento de la implementación porque una especialización por definición significa que me estoy especializando para un tipo concreto que puede ser compilado y vinculado individualmente.
ja: 余談ですが、テンプレートクラスの特殊化を行う際には、定義による特殊化は、個別にコンパイルしてリンクできる具体的な型のために特殊化していることを意味するので、ヘッダと実装を分離することができます。
ko: 참고로 템플릿 클래스에 대한 전문화를 수행 할 때 헤더를 구현에서 분리 할 수 ​​있습니다. 정의에 의한 전문화는 개별적으로 컴파일하고 링크 할 수있는 구체적 유형을 전문화한다는 의미이기 때문입니다.
ru: Просто обратите внимание,что при создании специализации для класса шаблонов можно отделить заголовок от реализации,поскольку специализация по определению означает,что я специализируюсь на конкретном типе,который может быть скомпилирован и скомпонован по отдельности.
zh_cn: 只是从侧面说明一下,在给模板类做专门化的时候,可以把头像和实现分开,因为从定义上看,专门化就意味着我是针对一个具体的类型进行专门化,可以单独编译和链接。

source: Just to add something noteworthy here. One can define methods of a templated class just fine in the implementation file when they are not function templates.
es: Sólo para añadir algo digno de mención aquí.Uno puede definir los métodos de una clase planificada muy bien en el archivo de implementación cuando no son plantillas de funciones.
ja: ここで注目すべきことを追加しておきます。テンプレート化されたクラスのメソッドは、関数テンプレートではない場合、実装ファイルでうまく定義することができます。
ko: 여기에 주목할만한 것을 추가하십시오. 함수 템플릿이 아닌 경우 구현 파일에서 템플릿 클래스의 메서드를 잘 정의 할 수 있습니다.
ru: Просто добавлю кое-что примечательное.Методы класса с шаблонами можно просто отлично определить в файле реализации,когда они не являются шаблонами функций.
zh_cn: 只是在这里补充一点值得注意的地方。当一个模板化类的方法不是函数模板时,可以在实现文件中定义这些方法。

source: Lets get a little closer to concrete for an explanation. Say I've got the following files:
es: Acerquémonos un poco más al concreto para una explicación.Digamos que tengo los siguientes archivos:
ja: もう少し具体的に説明しましょう。以下のファイルを持っているとします。
ko: 설명을 위해 콘크리트에 조금 더 가까워집니다. 다음 파일이 있다고 가정 해보십시오.
ru: Давайте подойдем немного ближе к бетону для объяснения.Скажем,у меня есть следующие файлы:
zh_cn: 让我们再来具体的解释一下。说我有以下几个文件。

source: Meaning <code>typename T</code> get's replaced during the compilation step not the linking step so if I try to compile a template without <code>T</code> being replaced as a concrete value type that is completely meaningless to the compiler and as a result object code can't be created because it doesn't know what <code>T</code> is.
es: Lo que significa que el <code>typename T</code> se reemplaza durante el paso de compilaci&oacute;n, no el paso de vinculaci&oacute;n, por lo que si intento compilar una plantilla sin que <code>T</code> sea ​​reemplazado como un tipo de valor concreto que no tiene ning&uacute;n significado para el compilador y, como resultado, el c&oacute;digo objeto no se puede crear porque No sabe qu&eacute; es <code>T</code> .
ja: タイプ名 <code>T</code> はリンクのステップではなくコンパイルのステップ中に置き換えられるので、 Tがコンパイラに完全に無意味な具体的な値のタイプとして置き換えられずにテンプレートをコンパイルしようとすると、オブジェクトコードは作成できません。 <code>T</code> が何であるかを知らない。
ko: 의미 <code>typename T</code> 는 링크 단계가 아닌 컴파일 단계에서 대체되므로 <code>T</code> 를 사용하지 않고 템플릿을 컴파일하려고하면 컴파일러에 완전히 의미가없는 구체적인 값 유형으로 결과 객체 코드를 작성할 수 없으므로 <code>T</code> 가 무엇인지 모릅니다.
ru: Значение <code>typename T</code> get заменено на этапе компиляции, а не на этапе компоновки, поэтому, если я попытаюсь скомпилировать шаблон без замены <code>T</code> в качестве конкретного типа значения, который совершенно бессмыслен для компилятора и, как результат, код объекта не может быть создан, поскольку он не знает что такое <code>T</code>
zh_cn: 含义是在编译步骤而不是链接步骤期间替换了 <code>typename T</code> get，因此，如果我尝试编译模板而没有将 <code>T</code> 替换为对编译器完全没有意义的具体值类型，则由于它不能创建目标代码不知道 <code>T</code> 是什么

source: My main concern is avoiding recompilation of all template users, when I change its definition.
es: Mi principal preocupación es evitar la recompilación de todos los usuarios de la plantilla,cuando cambio su definición.
ja: 私の主な関心事は、私がその定義を変更したときに、すべてのテンプレートユーザーの再コンパイルを避けることです。
ko: 저의 주요 관심사는 정의를 변경할 때 모든 템플릿 사용자의 재 컴파일을 피하는 것입니다.
ru: Моя главная забота-избежать перекомпиляции всех пользователей шаблонов,когда я изменяю его определение.
zh_cn: 我主要关心的是,当我改变它的定义时,避免对所有模板用户进行重新编译。
