Repository: rueisnom/feedback
Catalog: xlf/49/50/21/495021.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Instantiation-style polymorphism" means that the template <code>MyClass&lt;T&gt;</code> isn't really a generic class that can be compiled to code that can work for any value of <code>T</code>. That would add overhead such as boxing, needing to pass function pointers to allocators and constructors, etc. The intention of C++ templates is to avoid having to write nearly identical <code>class MyClass_int</code>, <code>class MyClass_float</code>, etc, but to still be able to end up with compiled code that is mostly as if we <em>had</em> written each version separately. So a template is <em>literally</em> a template; a class template is <em>not</em> a class, it's a recipe for creating a new class for each <code>T</code> we encounter. A template cannot be compiled into code, only the result of instantiating the template can be compiled.
es: "Polimorfismo de estilo de instanciaci&oacute;n" significa que la plantilla <code>MyClass&lt;T&gt;</code> no es realmente una clase gen&eacute;rica que pueda compilarse en un c&oacute;digo que pueda funcionar para cualquier valor de <code>T</code> . Eso agregar&iacute;a gastos generales como el boxeo, la necesidad de pasar punteros de funci&oacute;n a asignadores y constructores, etc. La intenci&oacute;n de las plantillas de C ++ es evitar tener que escribir <code>class MyClass_int</code> casi id&eacute;nticas MyClass_int , <code>class MyClass_float</code> , etc., pero a&uacute;n as&iacute; poder terminar con c&oacute;digo compilado que es principalmente como si hubi&eacute;ramos escrito cada versi&oacute;n por separado. Entonces una plantilla es <em>literalmente</em> una plantilla; una plantilla de clase <em>no</em> es una clase, es una receta para crear una nueva clase para cada <code>T</code> que encontremos. Una plantilla no se puede compilar en c&oacute;digo, solo se puede compilar el resultado de instanciar la plantilla.
ja: 「インスタンス化スタイルのポリモーフィズム」とは、テンプレート <code>MyClass&lt;T&gt;</code> が、 <code>T</code> の任意の値で機能するコードにコンパイルできる実際のジェネリッククラスではないことを意味します。 これにより、ボクシング、アロケーターやコンストラクターに関数ポインターを渡す必要などのオーバーヘッドが追加されます。C++テンプレートの目的は、ほぼ同一の <code>class MyClass_int</code> 、 <code>class MyClass_float</code> などを記述する必要がないようにすることですが、ほとんどの場合、各バージョンを個別に作成したかのようにコンパイルされたコード。 したがって、テンプレートは<em>文字通り</em>テンプレートです。 クラステンプレートはクラスでは<em>なく</em> 、遭遇する <code>T</code> ごとに新しいクラスを作成するためのレシピです。 テンプレートをコードにコンパイルすることはできません。テンプレートをインスタンス化した結果のみをコンパイルできます。
ko: "Instantiation-style polymorphism"은 <code>MyClass&lt;T&gt;</code> 템플릿이 <code>T</code> 의 모든 값에 대해 작동 할 수있는 코드로 컴파일 될 수있는 일반 클래스가 아니라는 것을 의미합니다. 이것은 boxing과 같은 오버 헤드를 추가하고 할당 자와 생성자에 함수 포인터를 전달할 필요가 있습니다. C ++ 템플릿의 의도는 거의 동일한 <code>class MyClass_int</code> , <code>class MyClass_float</code> 등을 작성하지 않아도되지만 여전히 끝날 수 있습니다. 각 버전을 개별적으로 작성한 것처럼 대부분 컴파일 된 코드. 따라서 템플릿은 <em>말 그대로</em> 템플릿입니다. 클래스 템플릿은 클래스가 <em>아니며</em> , 우리가 만나는 각각의 <code>T</code> 에 대해 새로운 클래스를 만들기위한 레시피입니다. 템플릿은 코드로 컴파일 할 수 없으며 템플릿 인스턴스화 결과 만 컴파일 할 수 있습니다.
ru: &laquo;Полиморфизм стиля реализации&raquo; означает, что шаблон <code>MyClass&lt;T&gt;</code> самом деле не является универсальным классом, который можно скомпилировать в код, который может работать для любого значения <code>T</code> . Это добавило бы дополнительные издержки, такие как бокс, необходимость передавать указатели на функции для распределителей и конструкторов и т. Д. Цель шаблонов C ++ состоит в том, чтобы избежать необходимости писать почти идентичный <code>class MyClass_int</code> , <code>class MyClass_float</code> и т. Д., Но при этом иметь возможность завершать работу с скомпилированный код, который выглядит так, как будто мы написали каждую версию отдельно. Таким образом, шаблон <em>буквально</em> шаблон; шаблон класса - это <em>не</em> класс, это рецепт создания нового класса для каждого <code>T</code> ,с которым мы сталкиваемся. Шаблон не может быть скомпилирован в код, может быть скомпилирован только результат создания шаблона.
zh_cn: &ldquo;实例化样式多态性&rdquo;意味着模板 <code>MyClass&lt;T&gt;</code> 并不是真正的泛型类，可以将其编译为可用于任何 <code>T</code> 值的代码。 这将增加诸如装箱之类的开销，需要将函数指针传递给分配器和构造函数等。C++模板的目的是避免不得不编写几乎相同的 <code>class MyClass_int</code> ， <code>class MyClass_float</code> 等，但最终仍可以编译后的代码，就像我们<em>分别</em>编写每个版本一样。 因此，模板<em>实际上</em>就是模板。 类模板<em>不是</em>类，而是为我们遇到的每个 <code>T</code> 创建一个新类的秘诀。 模板不能编译成代码，只能实例化模板的结果。

source: (Clarification: header files are not the <em>only</em> portable solution. But they are the most convenient portable solution.)
es: (Aclaraci&oacute;n: los archivos de encabezado no son la <em>&uacute;nica</em> soluci&oacute;n port&aacute;til. Pero son la soluci&oacute;n port&aacute;til m&aacute;s conveniente).
ja: （明確化：ヘッダーファイルは<em>唯一の</em>ポータブルソリューションではありませんが、最も便利なポータブルソリューションです。）
ko: (설명 : 헤더 파일이 <em>유일한</em> 휴대용 솔루션은 아니지만 가장 편리한 휴대용 솔루션입니다.)
ru: (Пояснение: заголовочные файлы - не <em>единственное</em> переносимое решение. Но это наиболее удобное переносимое решение.)
zh_cn: （澄清：头文件不是<em>唯一的</em>可移植解决方案。但是它们是最方便的可移植解决方案。）

source: <strong>bar.cpp</strong> doesn't even need to exist when I compile <strong>foo.cpp</strong>, but I should still be able to link the <strong>foo.o</strong> I already had together with the <strong>bar.o</strong> I've only just produced, without needing to recompile <strong>foo.cpp</strong>. <strong>foo.cpp</strong> could even be compiled into a dynamic library, distributed somewhere else without <strong>foo.cpp</strong>, and linked with code they write years after I wrote <strong>foo.cpp</strong>.
es: <strong>bar.cpp</strong> ni siquiera necesita existir cuando compilo <strong>foo.cpp</strong> , pero a&uacute;n as&iacute; deber&iacute;a poder vincular el <strong>foo.o</strong> Ya lo ten&iacute;a junto con el <strong>bar.o</strong> Acabo de producir, sin necesidad de recompilar <strong>foo .cpp</strong> . <strong>foo.cpp</strong> incluso podr&iacute;a compilarse en una biblioteca din&aacute;mica, distribuirse en otro lugar sin <strong>foo.cpp</strong> y vincularse con el c&oacute;digo que escriben a&ntilde;os despu&eacute;s de que escrib&iacute; <strong>foo.cpp</strong> .
ja: <strong>foo.cpp</strong>をコンパイルするとき、 <strong>bar.cpp</strong>は存在する必要さえありませんが、すでに持っている<strong>foo.o</strong>をリンクすることができるはずです<strong>。foo</strong>を再コンパイルする必要なく、作成したばかりです。 <strong>.cpp</strong> 。 <strong>foo.cppを</strong>動的ライブラリにコンパイルし、 <strong>foo.cpp</strong>なしで他の場所に<strong>配布し</strong> 、私が<strong>foo.cpp</strong>を作成してから数年後に作成したコードにリンクすることもできます。
ko: <strong>foo.cpp를</strong> 컴파일 할 때 <strong>bar.cpp</strong> 가 존재할 필요조차 없지만, 나는 이미 <strong>foo.o를</strong> 이미 <strong>bar</strong> 와 함께 연결할 수 있어야합니다 <strong>.o</strong> <strong>foo</strong> 를 다시 컴파일 할 필요없이 방금 생성했습니다. <strong>.cpp</strong> . <strong>foo.cpp</strong> 는 동적 라이브러리로 컴파일하고 <strong>foo.cpp</strong> 없이 다른 곳에 배포하고 <strong>foo.cpp를</strong> 쓴 후 몇 년 동안 작성한 코드와 연결할 수 있습니다.
ru: <strong>bar.cpp</strong> даже не должен существовать, когда я компилирую <strong>foo.cpp</strong> , но я все еще должен иметь возможность связать <strong>foo.o, который</strong> я уже имел вместе с <strong>bar.o,</strong> который я только что произвел, без необходимости перекомпилировать <strong>foo .cpp</strong> . <strong>foo.cpp</strong> можно даже скомпилировать в динамическую библиотеку, распространять где-то еще без <strong>foo.cpp</strong> и связывать с кодом, который они пишут спустя годы после того, как я написал <strong>foo.cpp</strong> .
zh_cn: 当我编译<strong>foo.cpp时</strong> ， <strong>bar.cpp</strong>甚至不需要存在，但我仍然应该可以将<strong>foo.o</strong>与<strong>bar.o</strong>一起使用<strong>。o</strong>我刚刚生成的文件，而无需重新编译<strong>foo .cpp</strong> 。 甚至可以将<strong>foo.cpp</strong>编译成动态库，而无需<strong>foo.cpp</strong>即可将<strong>其</strong>分发到其他地方，并与他们在我编写<strong>foo.cpp</strong>之后数年编写的代码链接。

source: A common solution to this is to write the template declaration in a header file, then implement the class in an implementation file (for example .tpp), and include this implementation file at the end of the header.
es: Una solución común a esto es escribir la declaración de la plantilla en un archivo de encabezamiento,luego implementar la clase en un archivo de implementación (por ejemplo .tpp),e incluir este archivo de implementación al final del encabezamiento.
ja: これに対する一般的な解決策は、ヘッダファイルにテンプレート宣言を記述してから、実装ファイル(例えば.tpp)にクラスを実装し、ヘッダの最後にこの実装ファイルをインクルードすることです。
ko: 이에 대한 일반적인 해결책은 헤더 파일에 템플릿 선언을 작성한 다음 구현 파일 (예 : .tpp)에서 클래스를 구현하고이 구현 파일을 헤더 끝에 포함시키는 것입니다.
ru: Общим решением является запись шаблонной декларации в заголовочный файл,затем реализация класса в реализационном файле (например,.tpp)и включение этого реализационного файла в конце заголовка.
zh_cn: 一个常见的解决方案是将模板声明写在头文件中,然后在一个实现文件(例如.tpp)中实现该类,并在头文件的末尾包含该实现文件。

source: A schematic example:
es: Un ejemplo esquemático:
ja: 模式的な例。
ko: 개략적 인 예 :
ru: Схематический пример:
zh_cn: 一个原理图的例子。

source: A way to have separate implementation is as follows.
es: Una forma de tener una aplicación separada es la siguiente.
ja: 別々の実装を持つ方法は以下の通りです。
ko: 별도의 구현 방법은 다음과 같습니다.
ru: Способ отдельной реализации заключается в следующем.
zh_cn: 分开实施的方法如下:

source: Actually, prior to C++11 the standard defined the <code>export</code> keyword that <em>would</em> make it possible to declare templates in a header file and implement them elsewhere.
es: En realidad, antes de C ++ 11, el est&aacute;ndar defin&iacute;a la palabra clave de <code>export</code> aci&oacute;n que <em>permitir&iacute;a</em> declarar plantillas en un archivo de encabezado e implementarlas en otro lugar.
ja: 実際、C ++ 11より前のバージョンでは、ヘッダーファイルでテンプレートを宣言して他の場所に実装できるようにする <code>export</code> キーワードが定義されていました。
ko: 실제로 C ++ 11 이전에는 표준에서 <code>export</code> 키워드를 정의하여 헤더 파일에서 템플릿을 선언하고 다른 곳에서 구현할 수있게했습니다.
ru: Фактически, до C ++ 11 стандарт определял ключевое слово <code>export</code> , <em>которое</em> позволяло бы объявлять шаблоны в заголовочном файле и реализовывать их в другом месте.
zh_cn: 实际上，在C ++ 11之前，该标准定义了 <code>export</code> 关键字， <em>这</em>使得可以在头文件中声明模板并在其他地方实现它们。

source: Alternative solution
es: Solución alternativa
ja: 代替ソリューション
ko: 대체 솔루션
ru: Альтернативное решение
zh_cn: 替代性解决方案

source: Although standard C++ has no such requirement, some compilers require that all function and class templates need to be made available in every translation unit they are used. In effect, for those compilers, the bodies of template functions must be made available in a header file. To repeat: that means those compilers won't allow them to be defined in non-header files such as .cpp files
es: Aunque el estándar C++no tiene ese requisito,algunos compiladores exigen que todas las plantillas de funciones y clases estén disponibles en cada unidad de traducción que se utilice.En efecto,para esos compiladores,los cuerpos de las funciones de las plantillas deben estar disponibles en un archivo de cabecera.Repito:eso significa que esos compiladores no permitirán que se definan en archivos que no sean de cabecera,como los archivos .cpp
ja: 標準C++にはそのような要件はありませんが、一部のコンパイラでは、すべての関数やクラスのテンプレートを使用するすべての翻訳ユニットで利用できるようにする必要があります。事実上、そのようなコンパイラでは、テンプレート関数の本体をヘッダファイルで利用できるようにしなければなりません。繰り返しになりますが、これらのコンパイラは.cppファイルのようなヘッダファイルではないファイルでの定義を許可しません。
ko: 표준 C ++에는 이러한 요구 사항이 없지만 일부 컴파일러에서는 사용되는 모든 변환 단위에서 모든 함수 및 클래스 템플릿을 사용할 수 있어야합니다. 실제로 이러한 컴파일러의 경우 템플릿 함수 본문을 헤더 파일에서 사용할 수 있어야합니다. 반복 : 즉, 해당 컴파일러는 .cpp 파일과 같은 헤더가 아닌 파일에서 정의 할 수 없습니다.
ru: Хотя в стандартном Си++такого требования нет,некоторые компиляторы требуют,чтобы все шаблоны функций и классов были доступны в каждой используемой единице трансляции.По сути,для этих компиляторов тела шаблонных функций должны быть доступны в заголовочном файле.Повторюсь:это означает,что эти компиляторы не позволят определять их в незаголовочных файлах,таких как .cpp-файлы.
zh_cn: 虽然标准的C++没有这样的要求,但有些编译器要求所有的函数和类模板都需要在每个翻译单元中提供。实际上,对于这些编译器来说,模板函数的体必须在头文件中提供。重复一下:这意味着这些编译器不允许在非头文件中定义函数,如.cpp文件。

source: And in the Utility.cpp:
es: Y en el Utility.cpp:
ja: そして、Utility.cppで
ko: 그리고 Utility.cpp에서 :
ru: И в Утилите:
zh_cn: 而在Utility.cpp中。

source: Another reason that it's a good idea to write both declarations and definitions in header files is for readability. Suppose there's such a template function in Utility.h:
es: Otra razón por la que es una buena idea escribir tanto declaraciones como definiciones en los archivos de encabezamiento es por la legibilidad.Supongamos que existe una función de plantilla de este tipo en Utility.h:
ja: 宣言と定義の両方をヘッダファイルに書くのが良いというもう一つの理由は、読みやすさのためです。Utility.hにこのようなテンプレート関数があるとします。
ko: 헤더 파일에 선언과 정의를 모두 작성하는 것이 좋은 이유는 읽기 쉽기 때문입니다. Utility.h에 이러한 템플릿 기능이 있다고 가정합니다.
ru: Еще одна причина,по которой рекомендуется записывать как декларации,так и определения в заголовочные файлы,заключается в удобочитаемости.Предположим,что такая шаблонная функция есть в Utility.h:
zh_cn: 在头文件中同时写声明和定义的另一个原因是为了可读性。假设在 Utility.h 中有这样一个模板函数。

source: Another solution is to keep the implementation separated, and explicitly instantiate all the template instances you'll need:
es: Otra solución es mantener la implementación separada,e instanciar explícitamente todas las instancias de plantillas que se necesiten:
ja: もう一つの解決策は、実装を分離しておき、必要なテンプレートインスタンスをすべて明示的にインスタンス化することです。
ko: 또 다른 해결책은 구현을 분리하여 유지하고 필요한 모든 템플릿 인스턴스를 명시 적으로 인스턴스화하는 것입니다.
ru: Другим решением является разделение реализации и явная инстанциация всех необходимых экземпляров шаблонов:
zh_cn: 另一个解决方案是将实现分开,明确地实例化所有你需要的模板实例。

source: Anyway, the reason your code is failing is that, when instantiating a template, the compiler creates a new class with the given template argument. For example:
es: De todos modos,la razón por la que tu código está fallando es que,al instanciar una plantilla,el compilador crea una nueva clase con el argumento de la plantilla dada.Por ejemplo:
ja: とにかく、あなたのコードが失敗する理由は、テンプレートをインスタンス化するときに、コンパイラが与えられたテンプレート引数で新しいクラスを作成するからです。例えば、以下のようになります。
ko: 어쨌든 코드가 실패하는 이유는 템플릿을 인스턴스화 할 때 컴파일러가 주어진 템플릿 인수로 새 클래스를 생성하기 때문입니다. 예를 들면 다음과 같습니다.
ru: Как бы то ни было,причина,по которой ваш код не работает,заключается в том,что при инициализации шаблона компилятор создает новый класс с заданным аргументом шаблона.Например:
zh_cn: 总之,你的代码失败的原因是,在实例化一个模板时,编译器会用给定的模板参数创建一个新的类。比如说

source: As a result, the ISO C++ standard committee decided to remove the <code>export</code> feature of templates with C++11.
es: Como resultado, el comit&eacute; est&aacute;ndar ISO C ++ decidi&oacute; eliminar la funci&oacute;n de <code>export</code> aci&oacute;n de plantillas con C ++ 11.
ja: その結果、ISO C ++標準委員会は、C ++ 11でテンプレートの <code>export</code> 機能を削除することを決定しました。
ko: 결과적으로 ISO C ++ 표준위원회는 C ++ 11을 사용하여 템플릿의 <code>export</code> 기능을 제거하기로 결정했습니다.
ru: В результате комитет по стандарту ISO C ++ решил удалить функцию <code>export</code> шаблонов с C ++ 11.
zh_cn: 结果，ISO C ++标准委员会决定删除具有C ++ 11的模板的 <code>export</code> 功能。

source: Caveat: It is <em>not</em> necessary to put the implementation in the header file, see the alternative solution at the end of this answer.
es: Advertencia: <em>no</em> es necesario poner la implementaci&oacute;n en el archivo de encabezado; consulte la soluci&oacute;n alternativa al final de esta respuesta.
ja: 注意：ヘッダーファイルに実装を含める必要はあり<em>ません</em> 。この回答の最後にある代替ソリューションを参照してください。
ko: 주의 사항 : 구현을 헤더 파일에 넣을 필요는 <em>없습니다</em> .이 답변 끝에있는 대체 솔루션을 참조하십시오.
ru: Предостережение: <em>нет</em> необходимости помещать реализацию в заголовочный файл, см. Альтернативное решение в конце этого ответа.
zh_cn: 注意：不必将实现放在头文件中，请参阅此答案末尾的替代解决方案。

source: Consequently, the compiler needs to have access to the implementation of the methods, to instantiate them with the template argument (in this case <code>int</code>). If these implementations were not in the header, they wouldn't be accessible, and therefore the compiler wouldn't be able to instantiate the template.
es: En consecuencia, el compilador necesita tener acceso a la implementaci&oacute;n de los m&eacute;todos, para instanciarlos con el argumento de la plantilla (en este caso <code>int</code> ). Si estas implementaciones no estuvieran en el encabezado, no ser&iacute;an accesibles y, por lo tanto, el compilador no podr&iacute;a crear una instancia de la plantilla.
ja: したがって、コンパイラーは、メソッドをテンプレート引数（この場合は <code>int</code> ）でインスタンス化するために、メソッドの実装にアクセスできる必要があります。 これらの実装がヘッダーになかった場合、それらにアクセスできなくなり、コンパイラーはテンプレートをインスタンス化できなくなります。
ko: 따라서 컴파일러는 메소드의 구현에 액세스하여 템플리트 인수 (이 경우 <code>int</code> )로 메소드를 인스턴스화해야합니다. 이러한 구현이 헤더에 없으면 액세스 할 수 없으므로 컴파일러에서 템플릿을 인스턴스화 할 수 없습니다.
ru: Следовательно, компилятор должен иметь доступ к реализации методов, чтобы создавать их экземпляры с помощью аргумента шаблона (в данном случае <code>int</code> ). Если бы эти реализации не были в заголовке, они не были бы доступны, и поэтому компилятор не смог бы создать экземпляр шаблона.
zh_cn: 因此，编译器需要访问方法的实现，以使用模板参数（在本例中为 <code>int</code> ）实例化它们。 如果这些实现不在头文件中，则将无法访问它们，因此编译器将无法实例化模板。

source: Don't forget to have your compiler treat your .template file as a c++ file to keep the intelli sense.
es: No olvides que tu compilador trate tu archivo .template como un archivo c++para mantener el sentido de la inteligencia.
ja: コンパイラが.templateファイルをc++ファイルとして扱うようにして、インテリセンスを保つことを忘れないでください。
ko: 컴파일러가 지능적으로 .template 파일을 c ++ 파일로 처리하도록하는 것을 잊지 마십시오.
ru: Не забудьте,чтобы ваш компилятор относился к вашему файлу .template как к файлу c++,чтобы сохранить смысл intelli.
zh_cn: 不要忘记让你的编译器把你的.template文件当作一个c++文件来处理,以保持intelli的意义。

source: Each user of the template includes that header file and uses the typedef.
es: Cada usuario de la plantilla incluye ese archivo de encabezamiento y utiliza el tipedef.
ja: テンプレートの各ユーザは、そのヘッダファイルをインクルードし、typedefを使用します。
ko: 템플릿의 각 사용자는 해당 헤더 파일을 포함하고 typedef를 사용합니다.
ru: Каждый пользователь шаблона включает этот заголовочный файл и использует typedef.
zh_cn: 模板的每个用户都包含了那个头文件,并使用类型化的ef。

source: Edit: Adding example of explicit template instantiation. Used after the template has been defined, and all member functions has been defined.
es: Editar:Añadir ejemplo de instanciación de plantilla explícita.Se utiliza después de que se haya definido la plantilla y se hayan definido todas las funciones de los miembros.
ja: 編集:明示的なテンプレートのインスタンス化の例を追加しました。テンプレートが定義され、すべてのメンバ関数が定義された後に使用されます。
ko: 편집 : 명시 적 템플릿 인스턴스화 예제 추가. 템플릿이 정의되고 모든 멤버 함수가 정의 된 후에 사용됩니다.
ru: Правка:Добавление примера явной конкретизации шаблона.Используется после того,как шаблон определен,и все функции-членов определены.
zh_cn: 编辑:增加了显式模板实例化的例子。在模板已经定义好了,并且所有成员函数都定义好了之后使用。

source: Even though there are plenty of good explanations above, I'm missing a practical way to separate templates into header and body.
es: Aunque hay muchas buenas explicaciones arriba,me falta una forma práctica de separar las plantillas en la cabecera y el cuerpo.
ja: 上記のように良い説明がたくさんあるにもかかわらず、テンプレートをヘッダーとボディに分ける実用的な方法が見つからないのです。
ko: 위에 좋은 설명이 많이 있지만 템플릿을 머리글과 본문으로 분리하는 실용적인 방법이 없습니다.
ru: Несмотря на то,что выше приведено много хороших объяснений,мне не хватает практического способа разделить шаблоны на заголовок и тело.
zh_cn: 虽然上面有很多很好的解释,但我还是缺少一个实用的方法,将模板分为页眉和正文。

source: For each template usage there's a typedef in its own header file (generated from the UML model). Its body contains the instantiation (which ends up in a library which is linked in at the end).
es: Para cada uso de la plantilla hay un tipedef en su propio archivo de cabecera (generado a partir del modelo UML).Su cuerpo contiene la instanciación (que termina en una biblioteca que está enlazada al final).
ja: この図では、「UML」という名前で、「UML」という名前を付けて、「UML」という名前を使用しています。このように、「UML」を使用することで、「UML」を使用することができるようになります。
ko: 각 템플리트 사용법마다 자체 헤더 파일 (UML 모델에서 생성)에 typedef가 있습니다. 그 본문에는 인스턴스화가 포함되어 있습니다 (마지막에 연결된 라이브러리에서 끝납니다).
ru: Для каждого использования шаблона в собственном заголовочном файле (генерируемом по UML модели)имеется типовой текст.Его тело содержит инстанцирование (которое заканчивается в библиотеке,в конце которой находится ссылка).
zh_cn: 对于每一个模板的使用,都有一个类型化的ef在它自己的头文件中(由UML模型生成)。它的正文包含了实例化(最后在库中链接的库中)。

source: For separate compilation to be achieved, separate template body checking must be possible. It seems that a solution is possible with concepts. Take a look at this <a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">paper</a> recently presented at the standards commitee meeting. I think this is not the only requirement, since you still need to instantiate code for the template code in user code.
es: Para lograr una compilaci&oacute;n por separado, debe ser posible la verificaci&oacute;n del cuerpo de la plantilla por separado. Parece que una soluci&oacute;n es posible con conceptos. Eche un vistazo a este <a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">documento</a> presentado recientemente en la reuni&oacute;n del comit&eacute; de normas. Creo que este no es el &uacute;nico requisito, ya que a&uacute;n necesita crear instancias de c&oacute;digo para el c&oacute;digo de plantilla en el c&oacute;digo de usuario.
ja: 個別のコンパイルを実現するには、個別のテンプレート本文チェックが可能でなければなりません。 コンセプトがあれば解決できるようです。 規格委員会で最近発表されたこの<a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">ペーパーを</a>ご覧ください。 ユーザーコードでテンプレートコードのコードをインスタンス化する必要があるため、これが唯一の要件ではないと思います。
ko: 별도의 컴파일을 수행하려면 별도의 템플릿 본문 검사가 가능해야합니다. 개념으로 해결책이 가능한 것 같습니다. 최근 표준위원회 회의에서 발표 된이 <a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">문서를</a> 살펴보십시오. 사용자 코드에서 템플릿 코드의 코드를 인스턴스화해야하기 때문에 이것이 유일한 요구 사항은 아니라고 생각합니다.
ru: Для отдельной компиляции должна быть возможна отдельная проверка тела шаблона. Кажется, что решение возможно с концепциями. Взгляните на этот <a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">документ,</a> недавно представленный на заседании комитета по стандартам. Я думаю, что это не единственное требование, так как вам все еще нужно создать экземпляр кода для шаблона в пользовательском коде.
zh_cn: 为了实现单独的编译，必须可以进行单独的模板主体检查。 似乎可以通过概念来解决。 看一下最近在标准委员会会议上发表的这篇<a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3629.pdf">论文</a> 。 我认为这不是唯一的要求，因为您仍然需要为用户代码中的模板代码实例化代码。

source: Have to recompile <strong>foo.cpp</strong> every time we change <em>any other file in the program</em>, in case it added a new novel instantiation of <code>MyClass&lt;T&gt;</code>
es: <strong>Debe volver</strong> a compilar <strong>foo.cpp</strong> cada vez que cambiemos <em>cualquier otro archivo en el programa</em> , en caso de que agregue una nueva instancia de <code>MyClass&lt;T&gt;</code>
ja: <code>MyClass&lt;T&gt;</code> 新しい新規インスタンス化が追加された場合に備えて<em>、プログラムの他のファイル</em>を変更<em>する</em>たびに<strong>foo.cpp</strong>を再コンパイルする<strong>必要があり</strong> <em>ます。</em>
ko: <code>MyClass&lt;T&gt;</code> 의 새로운 인스턴스화를 추가 한 경우 <em>프로그램에서 다른 파일을</em> 변경할 때마다 <strong>foo.cpp</strong> 를 다시 컴파일해야합니다.
ru: <strong>Приходится</strong> перекомпилировать <strong>foo.cpp</strong> каждый раз, когда мы меняем <em>любой другой файл в программе</em> , на случай, если он добавит новый экземпляр <code>MyClass&lt;T&gt;</code>
zh_cn: 每次更改程序中的<em>任何其他文件时，</em>都必须重新编译<strong>foo.cpp</strong> ，以防它添加了 <code>MyClass&lt;T&gt;</code> 的新的新颖实例。

source: Having all template instantiations in the template body is not a viable solution for me, since the template author may not know all if its usage and the template user may not have the right to modify it.
es: Tener todas las instancias de la plantilla en el cuerpo de la plantilla no es una solución viable para mí,ya que el autor de la plantilla puede no saberlo todo si su uso y el usuario de la plantilla puede no tener derecho a modificarla.
ja: すべてのテンプレートのインスタンスをテンプレート本体に持つことは、私にとって実行可能な解決策ではありません。
ko: 템플릿 작성자가 사용법과 템플릿 사용자가 템플릿을 수정할 수있는 권한이 없을 경우 템플릿 작성자가 모든 것을 알 수 없기 때문에 템플릿 본문에 모든 템플릿 인스턴스를 갖는 것은 실용적이지 않습니다.
ru: Наличие всех инстанций шаблона в теле шаблона не является для меня жизнеспособным решением,так как автор шаблона может не знать всех,если его использование и пользователь шаблона может не иметь права изменять его.
zh_cn: 让所有的模板实例都在模板正文中,对我来说并不是一个可行的解决方案,因为模板作者可能不知道它的所有用途,而且模板用户可能没有权利修改它。
