Repository: rueisnom/feedback
Catalog: xlf/49/50/21/495021.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Nobody likes (1), because whole-program-analysis compilation systems take <em>forever</em> to compile , and because it makes it impossible to distribute compiled libraries without the source code. So we have (2) instead.
es: A nadie le gusta (1), porque los sistemas de compilaci&oacute;n de an&aacute;lisis de todo el programa tardan una <em>eternidad</em> en compilarse, y porque hace que sea imposible distribuir bibliotecas compiladas sin el c&oacute;digo fuente. Entonces tenemos (2) en su lugar.
ja: プログラム全体の分析コンパイルシステムはcompileに<em>永遠</em>にかかるため、ソースコードなしでコンパイル済みライブラリを配布することが不可能になるため、誰も（1）を好みません。 したがって、代わりに（2）があります。
ko: 전체 프로그램 분석 컴파일 시스템은 컴파일하는 데 시간이 <em>오래</em> 걸리고 소스 코드없이 컴파일 된 라이브러리를 배포 할 수 없기 때문에 아무도 (1)을 좋아하지 않습니다. 그래서 우리는 (2)를 가지고 있습니다.
ru: Никому не нравится (1), потому что системам компиляции анализа целых программ требуется <em>вечность</em> для компиляции, и потому что это делает невозможным распространение скомпилированных библиотек без исходного кода. Таким образом, мы имеем (2) вместо этого.
zh_cn: 没有人喜欢（1），因为整个程序分析编译系统需要花费大量的时间进行编译，并且由于没有源代码就无法分发已编译的库。 因此，我们改为（2）。

source: None of the popular compilers implemented this keyword. The only one I know about is the frontend written by the Edison Design Group, which is used by the Comeau C++ compiler. All others required you to write templates in header files, because the compiler needs the template definition for proper instantiation (as others pointed out already).
es: Ninguno de los compiladores populares implementó esta palabra clave.El único que conozco es el frontend escrito por el Edison Design Group,que es usado por el compilador Comeau C++.Todos los demás requerían que se escribieran plantillas en los archivos de cabecera,porque el compilador necesita la definición de la plantilla para la correcta instanciación (como ya han señalado otros).
ja: 人気のあるコンパイラはどれもこのキーワードを実装していませんでした。私が知っているのは Edison Design Group によって書かれたフロントエンドだけで、 Comeau C++コンパイラで使用されています。他のコンパイラはすべて、ヘッダファイルにテンプレートを書く必要がありました。
ko: 인기있는 컴파일러는이 키워드를 구현하지 않았습니다. 내가 아는 유일한 것은 Edison Design Group이 작성한 프론트 엔드이며 Comeau C ++ 컴파일러가 사용합니다. 컴파일러는 적절한 인스턴스화를 위해 템플릿 정의가 필요하기 때문에 헤더 파일에 템플릿을 작성해야했습니다 (다른 사람들이 이미 지적했듯이).
ru: Ни один из популярных компиляторов не реализовал это ключевое слово.Единственное,о котором я знаю,это фронтенд,написанный Edison Design Group,который используется компилятором Comeau C++.Все остальные требовали написания шаблонов в заголовочных файлах,потому что компилятору нужно определение шаблона для правильной инстанцирования (как уже указывали другие).
zh_cn: 流行的编译器都没有实现这个关键字。我所知道的唯一一个是Edison Design Group写的前端,它被Comeau C++编译器使用。其他的都要求你在头文件中写模板,因为编译器需要模板定义来进行正确的实例化(其他人已经指出了)。

source: Now inside you .template file you define your functions just how you normally would.
es: Ahora dentro de tu archivo .template defines tus funciones como lo harías normalmente.
ja: これで.templateファイルの中で、通常の方法で関数を定義することができるようになりました。
ko: 이제 .template 파일 내부에서 평소와 같이 함수를 정의합니다.
ru: Теперь внутри вас .шаблонный файл вы определяете свои функции так,как вы обычно делаете.
zh_cn: 现在,在你的.模板文件中,你定义了你的功能,就像你通常所说的那样。

source: On compile time, contents of foo.h are copied to foo.tpp and then the whole file is copied to foo.h after which it compiles. This way, there is no limitations, and the naming is consistent, in exchange for one extra file.
es: En tiempo de compilación,el contenido de foo.h se copia a foo.tpp y luego todo el archivo se copia a foo.h después de lo cual se compila.De esta manera,no hay limitaciones,y la denominación es consistente,a cambio de un archivo extra.
ja: コンパイル時には、foo.h の内容が foo.tpp にコピーされ、ファイル全体が foo.h にコピーされてコンパイルされます。この方法では、制限はなく、名前の付け方も一貫しています。
ko: 컴파일 타임에 foo.h의 내용은 foo.tpp에 복사 된 다음 전체 파일이 foo.h에 복사 된 후 컴파일됩니다. 이런 식으로, 하나의 추가 파일과 교환 할 때 제한이 없으며 이름이 일관됩니다.
ru: Во время компиляции содержимое foo.h копируется в foo.tpp,а затем весь файл копируется в foo.h,после чего он компилируется.Таким образом,нет никаких ограничений,а именование является последовательным,в обмен на один дополнительный файл.
zh_cn: 在编译时,foo.h的内容会被复制到foo.tpp,然后整个文件被复制到foo.h中,然后再编译。这样一来,没有任何限制,而且命名也是一致的,只是多了一个文件。

source: One can argue that compilers can be made smarter to "look ahead" for all uses of the template, but I'm sure that it wouldn't be difficult to create recursive or otherwise complicated scenarios. AFAIK, compilers don't do such look aheads. As Anton pointed out, some compilers support explicit export declarations of template instantiations, but not all compilers support it (yet?).
es: Se puede argumentar que se puede hacer que los compiladores sean más inteligentes para "mirar hacia adelante" para todos los usos de la plantilla,pero estoy seguro de que no sería difícil crear escenarios recursivos o de otro modo complicados.AFAIK,los compiladores no hacen tales miradas hacia adelante.Como señaló Anton,algunos compiladores apoyan las declaraciones explícitas de exportación de las instancias de la plantilla,pero no todos los compiladores lo apoyan (¿todavía?).
ja: コンパイラがテンプレートのすべての用途を「先読み」するように賢くできることは議論の余地がありますが、再帰的なシナリオや複雑なシナリオを作ることは難しくないと思います。AFAIKでは、コンパイラはそのような先読みはしません。Antonが指摘したように、いくつかのコンパイラはテンプレートインスタンスの明示的なエクスポート宣言をサポートしていますが、すべてのコンパイラがそれをサポートしているわけではありません(まだ?
ko: 템플릿의 모든 용도에 대해 컴파일러가 더 똑똑해 보일 수 있다고 주장 할 수 있지만 재귀 적이거나 복잡한 시나리오를 만드는 것은 어렵지 않을 것이라고 확신합니다. AFAIK, 컴파일러는 그러한 전망을하지 않습니다. Anton이 지적한 것처럼 일부 컴파일러는 템플릿 인스턴스화의 명시 적 내보내기 선언을 지원하지만 모든 컴파일러가이를 지원하지는 않습니다 (아직?).
ru: Можно поспорить,что компиляторы можно сделать умнее,чтобы "смотреть вперед" при любом использовании шаблона,но я уверен,что не составит труда создать рекурсивные или иные сложные сценарии.AFAIK,компиляторы не смотрят в будущее.Как отметил Антон,некоторые компиляторы поддерживают явные экспортные декларации инстанцинаций шаблонов,но не все компиляторы это поддерживают (пока?).
zh_cn: 人们可以争辩说,编译器可以更聪明地对模板的所有用途进行 "超前展望",但我相信创建递归或其他复杂的场景并不难。AFAIK,编译器不做这样的超前展望。正如Anton所指出的,有些编译器支持模板实例的显式导出声明,但并不是所有的编译器都支持(还没有?

source: Plenty correct answers here, but I wanted to add this (for completeness):
es: Hay muchas respuestas correctas aquí,pero quería añadir esto (para completar):
ja: ここではたくさんの正解がありますが、私はこれを追加したいと思いました(完全性のために)。
ko: 여기에 많은 정답이 있지만 (완전하게) 이것을 추가하고 싶었습니다.
ru: Здесь много правильных ответов,но я хотел бы добавить это (для полноты):
zh_cn: 这里有很多正确的答案,但我想在此补充一下(为了完整)。

source: Quote from <a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">The C++ standard library: a tutorial and handbook</a>:
es: Cita de <a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">la biblioteca est&aacute;ndar de C ++: un tutorial y un manual</a> :
ja: <a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">C ++標準ライブラリ</a>からの引用：チュートリアルとハンドブック ：
ko: <a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">C ++ 표준 라이브러리</a> 에서 인용 : 튜토리얼 및 핸드북 :
ru: Цитата из <a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">стандартной библиотеки C ++: учебное пособие и справочник</a> :
zh_cn: 引用来自<a href="http://books.google.com/books?id=n9VEG2Gp5pkC&amp;pg=PA10&amp;lpg=PA10&amp;dq=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;source=bl&amp;ots=Ref8pl8dPX&amp;sig=t4K5gvxtBblpcujNxodpwMfei8I&amp;hl=en&amp;ei=qkR6TvbiGojE0AHq4IzqAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=3&amp;ved=0CC8Q6AEwAg#v=onepage&amp;q=%22The%20only%20portable%20way%20of%20using%20templates%20at%20the%20moment%20is%20to%20implement%20them%20in%20header%20files%20by%20using%20inline%20functions.%22&amp;f=false">C ++标准库：教程和手册</a> ：

source: Require that <strong>baz.cpp</strong> contains (possibly via header includes) the full template of <code>MyClass&lt;T&gt;</code>, so that the compiler can generate <code>MyClass&lt;BazPrivate&gt;</code> during compilation of <strong>baz.cpp</strong>.
es: Requerir que <strong>baz.cpp</strong> contenga (posiblemente mediante el encabezado incluye) la plantilla completa de <code>MyClass&lt;T&gt;</code> , para que el compilador pueda generar <code>MyClass&lt;BazPrivate&gt;</code> durante la compilaci&oacute;n de <strong>baz.cpp</strong> .
ja: コンパイラーが <code>MyClass&lt;BazPrivate&gt;</code> コンパイル中にMyClass &lt;BazPrivate&gt;を生成できるように、 baz.cppに <code>MyClass&lt;T&gt;</code> 完全なテンプレートが含まれている（ヘッダーインクルード経由の場合もある）必要が<strong>あり</strong>ます。
ko: <strong>baz.cpp</strong> 컴파일시 컴파일러가 <code>MyClass&lt;BazPrivate&gt;</code> 생성 할 수 있도록 baz.cpp 에 <code>MyClass&lt;T&gt;</code> 의 전체 템플리트가 포함되어 <strong>있어야</strong> 합니다 (헤더 포함을 통해).
ru: Требуется, чтобы <strong>baz.cpp</strong> содержал (возможно, через заголовок) полный шаблон <code>MyClass&lt;T&gt;</code> , чтобы компилятор мог генерировать <code>MyClass&lt;BazPrivate&gt;</code> во время компиляции <strong>baz.cpp</strong> .
zh_cn: 要求<strong>baz.cpp</strong>包含（可能通过标头包含） <code>MyClass&lt;T&gt;</code> 的完整模板，以便编译器可以在<strong>baz.cpp</strong>编译期间生成 <code>MyClass&lt;BazPrivate&gt;</code> 。

source: Separate compilation means I should be able to compile <strong>foo.cpp</strong> independently from <strong>bar.cpp</strong>. The compiler does all the hard work of analysis, optimization, and code generation on each compilation unit completely independently; we don't need to do whole-program analysis. It's only the linker that needs to handle the entire program at once, and the linker's job is substantially easier.
es: La compilaci&oacute;n separada significa que deber&iacute;a poder compilar <strong>foo.cpp</strong> independientemente de <strong>bar.cpp</strong> . El compilador realiza todo el trabajo duro de an&aacute;lisis, optimizaci&oacute;n y generaci&oacute;n de c&oacute;digo en cada unidad de compilaci&oacute;n de forma completamente independiente; No necesitamos hacer un an&aacute;lisis completo del programa. Es solo el enlazador que necesita manejar todo el programa a la vez, y el trabajo del enlazador es sustancialmente m&aacute;s f&aacute;cil.
ja: 個別のコンパイルは、 <strong>foo.cppをbar.cpp</strong>から独立してコンパイルできることを意味します。 コンパイラーは、分析、最適化、およびコード生成のすべてのハードワークを、各コンパイル単位で完全に独立して実行します。 プログラム全体を分析する必要はありません。 プログラム全体を一度に処理する必要があるのはリンカだけであり、リンカの仕事はかなり簡単です。
ko: 별도의 컴파일은 <strong>bar.cpp와</strong> 독립적으로 <strong>foo.cpp</strong> 를 컴파일 할 수 있어야 함을 의미합니다. 컴파일러는 각 컴파일 단위에서 분석, 최적화 및 코드 생성의 모든 어려운 작업을 완전히 독립적으로 수행합니다. 전체 프로그램 분석을 수행 할 필요가 없습니다. 전체 프로그램을 한 번에 처리해야하는 것은 링커 일 뿐이며 링커의 작업이 훨씬 쉽습니다.
ru: Отдельная компиляция означает, что я должен иметь возможность компилировать <strong>foo.cpp</strong> независимо от <strong>bar.cpp</strong> . Компилятор выполняет всю тяжелую работу по анализу, оптимизации и генерации кода на каждом модуле компиляции полностью независимо; нам не нужно делать анализ всей программы. Только компоновщик должен обрабатывать всю программу одновременно, и работа компоновщика существенно проще.
zh_cn: 单独的编译意味着我应该能够独立于<strong>bar.cpp</strong>来编译<strong>foo.cpp</strong> 。 编译器完全独立地在每个编译单元上进行分析，优化和代码生成的所有艰苦工作。 我们不需要进行整个程序分析。 只是链接程序需要立即处理整个程序，因此链接程序的工作实际上要容易得多。

source: So when <strong>foo.cpp</strong> is compiled, the compiler can't see <strong>bar.cpp</strong> to know that <code>MyClass&lt;int&gt;</code> is needed. It can see the template <code>MyClass&lt;T&gt;</code>, but it can't emit code for that (it's a template, not a class). And when <strong>bar.cpp</strong> is compiled, the compiler can see that it needs to create a <code>MyClass&lt;int&gt;</code>, but it can't see the template <code>MyClass&lt;T&gt;</code> (only its interface in <strong>foo.h</strong>) so it can't create it.
es: Entonces, cuando se compila <strong>foo.cpp</strong> , el compilador no puede ver <strong>bar.cpp</strong> para saber que se necesita <code>MyClass&lt;int&gt;</code> . Puede ver la plantilla <code>MyClass&lt;T&gt;</code> , pero no puede emitir c&oacute;digo para eso (es una plantilla, no una clase). Y cuando se compila <strong>bar.cpp</strong> , el compilador puede ver que necesita crear <code>MyClass&lt;int&gt;</code> , pero no puede ver la plantilla <code>MyClass&lt;T&gt;</code> (solo su interfaz en <strong>foo.h</strong> ), por lo que no puede crear eso.
ja: そのため、 <strong>foo.cpp</strong>がコンパイルされると、コンパイラは<strong>bar.cpp</strong>を見て <code>MyClass&lt;int&gt;</code> が必要であることを認識できません。 テンプレート <code>MyClass&lt;T&gt;</code> できますが、そのためのコードを出力することはできません（これはテンプレートであり、クラスではありません）。 そして、 <strong>bar.cpp</strong>がコンパイルされると、コンパイラーは <code>MyClass&lt;int&gt;</code> を作成する必要があることを認識できますが、テンプレート <code>MyClass&lt;T&gt;</code> （ <strong>foo.hの</strong>インターフェースのみ）を<strong>認識</strong>できないため、作成できません。それ。
ko: 따라서 <strong>foo.cpp</strong> 가 컴파일되면 컴파일러는 <strong>bar.cpp</strong> 에서 <code>MyClass&lt;int&gt;</code> 가 필요하다는 것을 알 수 없습니다. <code>MyClass&lt;T&gt;</code> 템플릿을 볼 수 있지만 코드를 생성 할 수는 없습니다 (클래스가 아니라 템플릿 임). 그리고 <strong>bar.cpp</strong> 가 컴파일되면 컴파일러는 <code>MyClass&lt;int&gt;</code> 생성이 필요하다는 것을 알 수 있지만 <code>MyClass&lt;T&gt;</code> 템플릿 ( <strong>foo.h</strong> 의 인터페이스 만)을 볼 수 없으므로 생성 할 수 없습니다. 그것.
ru: Поэтому, когда <strong>foo.cpp</strong> компилируется, компилятор не может видеть <strong>bar.cpp,</strong> чтобы знать, что <code>MyClass&lt;int&gt;</code> необходим. Он может видеть шаблон <code>MyClass&lt;T&gt;</code> , но не может генерировать код для этого (это шаблон, а не класс). И когда <strong>bar.cpp</strong> скомпилирован, компилятор может увидеть, что ему нужно создать <code>MyClass&lt;int&gt;</code> , но он не может видеть шаблон <code>MyClass&lt;T&gt;</code> (только его интерфейс в <strong>foo.h</strong> ), поэтому он не может создать Это.
zh_cn: 因此，在编译<strong>foo.cpp</strong>时，编译器看不到<strong>bar.cpp</strong>来知道需要 <code>MyClass&lt;int&gt;</code> 。 它可以看到模板 <code>MyClass&lt;T&gt;</code> ，但不能为此发出代码（它是模板，而不是类）。 并且在编译<strong>bar.cpp</strong>时，编译器可以看到它需要创建 <code>MyClass&lt;int&gt;</code> ，但是它看不到模板 <code>MyClass&lt;T&gt;</code> （仅其在<strong>foo.h中的</strong>接口），因此无法创建它。

source: Templates must be used in headers because the compiler needs to instantiate different versions of the code, depending on the parameters given/deduced for template parameters. Remember that a template doesn't represent code directly, but a template for several versions of that code. When you compile a non-template function in a <code>.cpp</code> file, you are compiling a concrete function/class. This is not the case for templates, which can be instantiated with different types, namely, concrete code must be emitted when replacing template parameters with concrete types.
es: Las plantillas deben usarse en los encabezados porque el compilador necesita crear instancias de diferentes versiones del c&oacute;digo, dependiendo de los par&aacute;metros dados / deducidos para los par&aacute;metros de la plantilla. Recuerde que una plantilla no representa el c&oacute;digo directamente, sino una plantilla para varias versiones de ese c&oacute;digo. Cuando compila una funci&oacute;n que no es de plantilla en un archivo <code>.cpp</code> , est&aacute; compilando una funci&oacute;n / clase concreta. Este no es el caso de las plantillas, que se pueden instanciar con diferentes tipos, a saber, se debe emitir un c&oacute;digo concreto al reemplazar los par&aacute;metros de la plantilla con tipos concretos.
ja: ヘッダーでテンプレートを使用する必要があります。これは、コンパイラーが、テンプレートパラメーターに指定または推定されたパラメーターに応じて、異なるバージョンのコードをインスタンス化する必要があるためです。 テンプレートはコードを直接表すのではなく、そのコードのいくつかのバージョンのテンプレートを表すことに注意してください。 非テンプレート関数を <code>.cpp</code> ファイルでコンパイルすると、具体的な関数/クラスがコンパイルされます。 これは、異なるタイプでインスタンス化できるテンプレートには当てはまりません。つまり、テンプレートパラメーターを具象タイプに置き換えるときに具象コードを生成する必要があります。
ko: 컴파일러는 템플릿 매개 변수에 대해 주어진 / 제거 된 매개 변수에 따라 다른 버전의 코드를 인스턴스화해야하므로 템플릿을 헤더에 사용해야합니다. 템플릿은 코드를 직접 나타내는 것이 아니라 해당 코드의 여러 버전에 대한 템플릿입니다. 템플릿이 아닌 함수를 <code>.cpp</code> 파일로 컴파일하면 구체적인 함수 / 클래스가 컴파일됩니다. 템플릿의 경우에는 다른 유형으로 인스턴스화 할 수 있습니다. 즉, 템플릿 매개 변수를 콘크리트 유형으로 바꿀 때 콘크리트 코드가 생성되어야합니다.
ru: Шаблоны должны использоваться в заголовках, потому что компилятор должен создавать различные версии кода в зависимости от параметров, заданных / выведенных для параметров шаблона. Помните, что шаблон не представляет код напрямую, а шаблон для нескольких версий этого кода. Когда вы компилируете не шаблонную функцию в файле <code>.cpp</code> , вы компилируете конкретную функцию / класс. Это не относится к шаблонам, которые могут быть созданы с различными типами, а именно, конкретный код должен генерироваться при замене параметров шаблона на конкретные типы.
zh_cn: 必须在标头中使用模板，因为编译器需要根据给定/推导的模板参数实例化不同版本的代码。 请记住，模板并不直接代表代码，而是代表该代码的多个版本的模板。 当您在 <code>.cpp</code> 文件中编译一个非模板函数时，您正在编译一个具体的函数/类。 模板不是这种情况，可以用不同的类型实例化模板，即，用具体类型替换模板参数时必须发出具体代码。

source: Templates need to be <em>instantiated</em> by the compiler before actually compiling them into object code. This instantiation can only be achieved if the template arguments are known. Now imagine a scenario where a template function is declared in <code>a.h</code>, defined in <code>a.cpp</code> and used in <code>b.cpp</code>. When <code>a.cpp</code> is compiled, it is not necessarily known that the upcoming compilation <code>b.cpp</code> will require an instance of the template, let alone which specific instance would that be. For more header and source files, the situation can quickly get more complicated.
es: El compilador debe <em>crear instancias</em> de las plantillas antes de compilarlas en el c&oacute;digo objeto. Esta instanciaci&oacute;n solo se puede lograr si se conocen los argumentos de la plantilla. Ahora imagine un escenario donde una funci&oacute;n de plantilla se declara en <code>a.h</code> , se define en <code>a.cpp</code> y se usa en <code>b.cpp</code> . Cuando se compila <code>a.cpp</code> , no se sabe necesariamente que la pr&oacute;xima compilaci&oacute;n <code>b.cpp</code> requerir&aacute; una instancia de la plantilla, y mucho menos qu&eacute; instancia espec&iacute;fica ser&iacute;a esa. Para m&aacute;s archivos de cabecera y fuente, la situaci&oacute;n puede volverse m&aacute;s complicada r&aacute;pidamente.
ja: テンプレートは、実際にオブジェクトコードにコンパイルする前に、コンパイラによって<em>インスタンス化</em>する必要があり<em>ます</em> 。 このインスタンス化は、テンプレートの引数がわかっている場合にのみ実行できます。 テンプレート関数が <code>a.h</code> で宣言され、 <code>a.cpp</code> で定義され、 b.cppで使用されるシナリオを想像して <code>b.cpp</code> 。 <code>a.cpp</code> がコンパイルされるとき、次のコンパイル <code>b.cpp</code> がテンプレートのインスタンスを必要とすることは、必ずしもそうである必要はありません。 ヘッダーファイルとソースファイルが増えると、状況はすぐに複雑になります。
ko: 템플릿은 실제로 객체 코드로 컴파일하기 전에 컴파일러에서 <em>인스턴스화</em> 해야합니다. 이 인스턴스화는 템플릿 인수가 알려진 경우에만 달성 할 수 있습니다. 이제 <code>a.cpp</code> 에 정의되고 b.cpp 에 사용되는 템플릿 함수가 <code>a.h</code> 로 선언 된 시나리오를 상상해보십시오. <code>a.cpp</code> 가 컴파일 될 때 다가오는 컴파일 <code>b.cpp</code> 가 특정 인스턴스가 아닌 템플릿의 인스턴스가 필요하다는 것을 반드시 알 필요는 없습니다. 더 많은 헤더 및 소스 파일의 경우 상황이 더 복잡해질 수 있습니다.
ru: Шаблоны должны быть <em>созданы</em> компилятором до фактической компиляции их в объектный код. Эта реализация может быть достигнута только в том случае, если известны аргументы шаблона. Теперь представьте сценарий, в котором функция шаблона объявляется в <code>a.h</code> , определяется в <code>a.cpp</code> и используется в <code>b.cpp</code> . Когда <code>a.cpp</code> компилируется, необязательно известно, что для предстоящей компиляции <code>b.cpp</code> потребуется экземпляр шаблона, не говоря уже о том, какой конкретный экземпляр будет. Для большего количества заголовочных и исходных файлов ситуация может быстро усложниться.
zh_cn: 模板需要<em>先由</em>编译器<em>实例化</em> ，然后才能将其实际编译为目标代码。 仅在知道模板参数的情况下才能实现此实例化。 现在想象一个场景，其中在 <code>a.h</code> 声明了模板函数，在 <code>a.cpp</code> 中定义了该模板函数，并在 <code>b.cpp</code> 中使用了该模板函数。 编译 <code>a.cpp</code> 时 ，不一定要知道即将进行的编译 <code>b.cpp</code> 将需要模板的实例，更不用说那个具体实例了。 对于更多的头文件和源文件，情况可能很快变得更加复杂。
