Repository: rueisnom/feedback
Catalog: xlf/49/50/21/495021.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: That is exactly correct because the compiler has to know what type it is for allocation. So template classes, functions, enums,etc.. must be implemented as well in the header file if it is to be made public or part of a library (static or dynamic) because header files are NOT compiled unlike the c/cpp files which are. If the compiler doesn't know the type is can't compile it. In .Net it can because all objects derive from the Object class. This is not .Net.
es: Eso es exactamente correcto porque el compilador tiene que saber de qué tipo es para la asignación.Por lo tanto,las clases de plantillas,las funciones,los enums,etc.,deben implementarse también en el archivo de cabecera si se va a hacer público o formar parte de una biblioteca (estática o dinámica)porque los archivos de cabecera NO se compilan como los archivos ccpp que sí lo hacen.Si el compilador no conoce el tipo es no puede compilarlo.En .Net puede porque todos los objetos derivan de la clase Object.Esto no es .Net.
ja: その通りです。なぜならば、コンパイラはそれがどのようなタイプの割り当てなのかを知る必要があるからです。ccppファイルと違ってヘッダファイルはコンパイルされていないので、もしそれを公開したりライブラリの一部(静的または動的)にする場合は、テンプレートクラス、関数、列挙型などもヘッダファイルに実装しなければなりません。コンパイラが型を知らないとコンパイルできません。.Netでは、すべてのオブジェクトはObjectクラスから派生しているので、コンパイルできます。これは .Net ではありません。
ko: 컴파일러가 할당 유형을 알아야하기 때문에 정확히 맞습니다. 따라서 헤더 파일은 c / cpp 파일과 달리 컴파일되지 않기 때문에 템플릿 클래스, 함수, 열거 형 등을 헤더 파일에서 공개하거나 라이브러리의 일부 (정적 또는 동적)로 만들려면 헤더 파일에서도 구현해야합니다. 아르. 컴파일러가 타입을 모른다면 컴파일 할 수 없습니다. .Net에서는 모든 객체가 Object 클래스에서 파생되기 때문에 가능합니다. 이것은 .Net이 아닙니다.
ru: Это совершенно верно,так как компилятор должен знать,какой это тип для выделения.Поэтому шаблонные классы,функции,перечисления и т.д..должны быть реализованы и в заголовочном файле,если его нужно сделать публичным или частью библиотеки (статической или динамической),потому что заголовочные файлы НЕ компилируются в отличие от ccpp-файлов,которые являются таковыми.Если компилятор не знает тип не может его скомпилировать.В .Net это возможно потому,что все объекты происходят от класса Object.Это не .Net.
zh_cn: 这是完全正确的,因为编译器必须知道它是什么类型的分配。所以模板类、函数、enums等必须在头文件中实现,如果它是公开的或者是库的一部分(静态或动态),因为头文件是不像ccpp文件那样被编译的。如果编译器不知道类型是什么,就不能编译它。在.Net中,它可以,因为所有的对象都来自于Object类。这与.Net不同。

source: The "borland" model corresponds to what the author suggests, providing the full template definition, and having things compiled multiple times.
es: El modelo "borland" corresponde a lo que el autor sugiere,proporcionando la definición completa de la plantilla,y teniendo las cosas compiladas varias veces.
ja: borland」モデルは、完全なテンプレート定義を提供し、複数回コンパイルされたものを持つことで、著者が提案したことに対応しています。
ko: "borland"모델은 저자가 제안한 것과 일치하며, 완전한 템플릿 정의를 제공하고 여러 번 컴파일 된 것들을 갖습니다.
ru: Модель "Борланд" соответствует тому,что предлагает автор,предоставляя полное определение шаблона и многократно компилируя вещи.
zh_cn: "borland "模式对应的是笔者的建议,提供完整的模板定义,并让事情多次编译。

source: The above example is fairly useless since vector is fully defined in headers, except when a common include file (precompiled header?) uses <code>extern template class vector&lt;int&gt;</code> so as to keep it from instantiating it in all the <em>other</em> (1000?) files that use vector.
es: El ejemplo anterior es bastante in&uacute;til ya que el vector est&aacute; completamente definido en los encabezados, excepto cuando un archivo de inclusi&oacute;n com&uacute;n (encabezado precompilado?) Usa el <code>extern template class vector&lt;int&gt;</code> para evitar que lo instancia en todos los <em>otros</em> archivos (1000?) que usan el vector
ja: 一般的なインクルードファイル（プリコンパイル済みヘッダー？）が<em>他の</em>すべて<em>の</em> （1000？）ファイルでインスタンス化されないように <code>extern template class vector&lt;int&gt;</code> 使用する場合を除いて、ベクターはヘッダーで完全に定義されているため、上記の例はかなり役に立ちません。そのベクトルを使用します。
ko: 일반적인 포함 파일 (사전 컴파일 된 헤더?)이 <code>extern template class vector&lt;int&gt;</code> 하여 <em>다른</em> 모든 (1000?) 파일에서 인스턴스화하지 못하도록하는 경우를 제외하고는 벡터가 헤더에 완전히 정의되어 있으므로 위 예제는 상당히 쓸모가 없습니다. 벡터를 사용합니다.
ru: Приведенный выше пример довольно бесполезен, так как вектор полностью определен в заголовках, за исключением случаев, когда общий включаемый файл (предварительно скомпилированный заголовок?) Использует <code>extern template class vector&lt;int&gt;</code> чтобы не создавать его экземпляров во всех <em>других</em> (1000?) Файлах. которые используют вектор.
zh_cn: 上面的示例是没有用的，因为矢量完全在标头中定义，除非通用的包含文件（预编译的标头？）使用 <code>extern template class vector&lt;int&gt;</code> 以避免在所有<em>其他</em> （1000？）文件中实例化它时除外使用向量。

source: The compiler will generate code for each template instantiation when you use a template during the compilation step. In the compilation and linking process .cpp files are converted to pure object or machine code which in them contains references or undefined symbols because the .h files that are included in your main.cpp have no implementation YET. These are ready to be linked with another object file that defines an implementation for your template and thus you have a full a.out executable.
es: El compilador generará código para cada instanciamiento de plantilla cuando use una plantilla durante el paso de compilación.En el proceso de compilación y enlace,los archivos .cpp se convierten en puro código de objeto o máquina que en ellos contiene referencias o símbolos indefinidos porque los archivos .h que se incluyen en su main.cpp no tienen implementación TAMBIÉN.Estos están listos para ser enlazados con otro archivo objeto que define una implementación para su plantilla y así usted tiene un ejecutable a.out completo.
ja: コンパイル・ステップでテンプレートを使用すると、コンパイラは各テンプレートのインスタンス化のためのコードを生成します。コンパイルとリンクのプロセスでは、.cppファイルは純粋なオブジェクトコードまたはマシンコードに変換され、その中には参照や未定義のシンボルが含まれています。これらのファイルは、テンプレートの実装を定義する別のオブジェクトファイルとリンクする準備ができています。
ko: 컴파일러는 컴파일 단계에서 템플릿을 사용할 때 각 템플릿 인스턴스화에 대한 코드를 생성합니다. 컴파일 및 연결 프로세스에서 .cpp 파일은 main.cpp에 포함 된 .h 파일에 YET 구현이 없기 때문에 참조 또는 정의되지 않은 기호가 포함 된 순수 객체 또는 기계 코드로 변환됩니다. 이들은 템플릿의 구현을 정의하는 다른 객체 파일과 연결될 준비가되어 있으므로 전체 a.out 실행 파일이 있습니다.
ru: Компилятор сгенерирует код для каждого инстанцирования шаблона при использовании шаблона на этапе компиляции.В процессе компиляции и компоновки .cpp файлы преобразуются в чистый объектный или машинный код,который в них содержит ссылки или неопределённые символы,потому что .h-файлы,которые включены в ваш main.cpp,не имеют реализации YET.Они готовы к компоновке с другим объектным файлом,который определяет реализацию вашего шаблона,и,таким образом,у вас есть полный исполняемый файл a.out.
zh_cn: 当你在编译步骤中使用模板时,编译器会为每个模板实例化生成代码。在编译和链接的过程中,.cpp文件会被转换为纯对象或机器代码,其中包含引用或未定义的符号,因为main.cpp中包含的.h文件没有实现YET。这些文件可以与另一个定义了模板实现的对象文件链接,这样你就有了一个完整的a.out可执行文件。

source: The only portable way of using templates at the moment is to implement them in header files by using inline functions.
es: La única forma portátil de utilizar plantillas por el momento es implementarlas en los archivos de cabecera mediante el uso de funciones en línea.
ja: 現在のところ、テンプレートを使用する唯一のポータブルな方法は、インライン関数を使用してヘッダーファイルにテンプレートを実装することです。
ko: 현재 템플릿을 사용하는 유일한 이식 방법은 인라인 함수를 사용하여 헤더 파일로 템플릿을 구현하는 것입니다.
ru: На данный момент единственным портативным способом использования шаблонов является их реализация в заголовочных файлах с помощью встроенных функций.
zh_cn: 目前使用模板的唯一可移植的方式是通过使用内嵌函数在头文件中实现模板。

source: The separate compilation problem for templates I guess it's also a problem that is arising with the migration to modules, which is currently being worked.
es: El problema de la compilación separada de las plantillas supongo que también es un problema que está surgiendo con la migración a los módulos,que se está trabajando actualmente.
ja: テンプレートの個別コンパイル問題 現在作業中のモジュールへの移行に伴って発生している問題でもあると思います。
ko: 템플릿에 대한 별도의 컴파일 문제 또한 현재 작동중인 모듈로의 마이그레이션으로 인해 발생하는 문제라고 생각합니다.
ru: Проблема отдельной компиляции шаблонов,наверное,также возникает в связи с переходом на модули,который в настоящее время работает.
zh_cn: 模板单独编译的问题,我猜想这也是目前正在做模板迁移到模块的时候出现的问题。

source: There is an <em>export</em> keyword which is supposed to mitigate this problem, but it's nowhere close to being portable.
es: Hay una palabra clave de <em>exportaci&oacute;n</em> que se supone que mitiga este problema, pero no est&aacute; cerca de ser port&aacute;til.
ja: この問題を軽減することになっている<em>export</em>キーワードがありますが、移植性にほど遠いものです。
ko: 이 문제를 완화시키기위한 <em>내보내기</em> 키워드가 있지만 이식성이 거의 없습니다.
ru: Существует ключевое слово <em>экспорта,</em> которое должно смягчить эту проблему, но оно далеко от того, чтобы быть переносимым.
zh_cn: 有一个<em>export</em>关键字可以缓解此问题，但是它几乎没有可移植性。

source: There is no possible way that this could work unless we either
es: No hay forma posible de que esto pueda funcionar a menos que nosotros
ja: 次のどちらかにしない限り、うまくいくはずがありません。
ko: 우리가 아니면 이것이 작동 할 수있는 가능한 방법은 없습니다
ru: Невозможно,чтобы это сработало,если только мы оба не
zh_cn: 没有任何可能的办法,除非我们要么

source: There was a feature with the <code>export</code> keyword that was meant to be used for separate compilation. The <code>export</code> feature is deprecated in <code>C++11</code> and, AFAIK, only one compiler implemented it. You shouldn't make use of <code>export</code>. Separate compilation is not possible in <code>C++</code> or <code>C++11</code> but maybe in <code>C++17</code>, if concepts make it in, we could have some way of separate compilation.
es: Hab&iacute;a una funci&oacute;n con la palabra clave de <code>export</code> aci&oacute;n que deb&iacute;a usarse para una compilaci&oacute;n separada. La funci&oacute;n de <code>export</code> aci&oacute;n est&aacute; en desuso en <code>C++11</code> y, AFAIK, solo un compilador la implement&oacute;. No debe hacer uso de la <code>export</code> aci&oacute;n . La compilaci&oacute;n separada no es posible en <code>C++</code> o <code>C++11</code> pero tal vez en <code>C++17</code> , si los conceptos lo logran, podr&iacute;amos tener alguna forma de compilaci&oacute;n separada.
ja: 別のコンパイルに使用することを目的とした <code>export</code> キーワードの機能がありました。 <code>export</code> 機能は <code>C++11</code> 非推奨であり、AFAIKでは、1つのコンパイラーのみがそれを実装しました。 <code>export</code> を利用しないでください。 <code>C++</code> または <code>C++11</code> では個別のコンパイルは不可能ですが、おそらく <code>C++17</code> では可能です。概念が組み込まれていれば、何らかの方法で個別のコンパイルを行うことができます。
ko: 별도의 컴파일에 사용되는 <code>export</code> 키워드 기능이있었습니다. <code>export</code> 기능은 <code>C++11</code> 에서 더 이상 사용되지 않으며 AFAIK에서는 하나의 컴파일러 만 구현했습니다. <code>export</code> 를 사용해서는 안됩니다. <code>C++</code> 또는 <code>C++11</code> 에서는 별도의 컴파일이 불가능하지만 <code>C++17</code> 에서는 개념이 적용되는 경우 별도의 컴파일 방법이있을 수 있습니다.
ru: Была функция с ключевым словом <code>export</code> , предназначенная для отдельной компиляции. Функция <code>export</code> устарела в <code>C++11</code> и, AFAIK, ее реализовал только один компилятор. Вы не должны использовать <code>export</code> . Раздельная компиляция невозможна в <code>C++</code> или <code>C++11</code> но, возможно, в <code>C++17</code> , если концепции это делают, у нас может быть какой-то способ раздельной компиляции.
zh_cn: 带有 <code>export</code> 关键字的功能旨在用于单独的编译。 <code>export</code> 功能在 <code>C++11</code> 和AFAIK中已弃用，只有一个编译器实现了该功能。 您不应该利用 <code>export</code> 。 在 <code>C++</code> 或 <code>C++11</code> 不可能进行单独的编译，但是在 <code>C++17</code> 中可能无法进行单独的编译，如果有概念的话，我们可以采用某种方式进行单独的编译。

source: Therefore if you separate the template declaration and definition, you won't be able to only read the header file to see the ins and outs of this template in order to use this API on your own classes, though the compiler will tell you in this case about which operator needs to be overridden.
es: Por lo tanto,si separa la declaración y la definición de la plantilla,no podrá leer únicamente el archivo de cabecera para ver los detalles de esta plantilla con el fin de utilizar esta API en sus propias clases,aunque el compilador le dirá en este caso sobre qué operador debe ser anulado.
ja: したがって、テンプレートの宣言と定義を分離すると、自分のクラスでこのAPIを使用するために、ヘッダファイルを読むだけでこのテンプレートの内部と外部を見ることができなくなりますが、この場合、コンパイラはどの演算子をオーバーライドする必要があるかを教えてくれます。
ko: 따라서 템플릿 선언과 정의를 분리하면 자신의 클래스에서이 API를 사용하기 위해 헤더 파일을 읽고이 템플릿의 내용을 볼 수 없으며 컴파일러에서 어떤 연산자를 재정의해야하는지에 대한 사례입니다.
ru: Поэтому,если разделить декларацию и определение шаблона,то вы не сможете только прочитать заголовочный файл,чтобы увидеть вхождения и выходы этого шаблона,чтобы использовать это API на своих классах,хотя компилятор в этом случае скажет вам,какой оператор нужно переопределить.
zh_cn: 因此,如果你把模板声明和定义分开,你就不能只读取头文件来查看这个模板的来龙去脉,以便在你自己的类上使用这个API,尽管编译器会在这种情况下告诉你需要重写哪个操作符。

source: Therefore templates are never separately compiled and are only compiled wherever you have a concrete instantiation in some other source file. However, the concrete instantiation needs to know the implementation of the template file, because simply modifying the <code>typename T</code> using a concrete type in the .h file is not going to do the job because what .cpp is there to link, I can't find it later on because remember templates are abstract and can't be compiled, so I'm forced to give the implementation right now so I know what to compile and link, and now that I have the implementation it gets linked into the enclosing source file. Basically, the moment I instantiate a template I need to create a whole new class, and I can't do that if I don't know how that class should look like when using the type I provide unless I make notice to the compiler of the template implementation, so now the compiler can replace <code>T</code> with my type and create a concrete class that's ready to be compiled and linked.
es: Por lo tanto, las plantillas nunca se compilan por separado y solo se compilan donde sea que tenga una instanciaci&oacute;n concreta en alg&uacute;n otro archivo fuente. Sin embargo, la instanciaci&oacute;n concreta necesita conocer la implementaci&oacute;n del archivo de plantilla, porque simplemente modificar el <code>typename T</code> usando un tipo concreto en el archivo .h no va a hacer el trabajo porque lo que .cpp est&aacute; all&iacute; para vincular, no puedo lo encuentro m&aacute;s tarde porque las plantillas de recuerdo son abstractas y no se pueden compilar, por lo que me veo obligado a dar la implementaci&oacute;n en este momento, as&iacute; que s&eacute; qu&eacute; compilar y vincular, y ahora que tengo la implementaci&oacute;n, se vincula a la fuente adjunta expediente. B&aacute;sicamente, en el momento en que instancia una plantilla, necesito crear una clase completamente nueva, y no puedo hacerlo si no s&eacute; c&oacute;mo deber&iacute;a ser esa clase cuando uso el tipo que proporciono, a menos que notifique al compilador de la implementaci&oacute;n de la plantilla, por lo que ahora el compilador puede reemplazar <code>T</code> con mi tipo y crear una clase concreta que est&eacute; lista para ser compilada y vinculada.
ja: したがって、テンプレートは個別にコンパイルされることはなく、他のソースファイルに具体的なインスタンスがある場合にのみコンパイルされます。 ただし、具体的なインスタンス化では、テンプレートファイルの実装を知る必要があります。.hファイルの具体的な型を使用してタイプ名 <code>typename T</code> を変更するだけでは機能しません。リンクする.cppがあるため、私はできません。テンプレートは抽象的でコンパイルできないので、後で見つけます。テンプレートをコンパイルしてリンクできないので、今すぐ実装を提供する必要があります。コンパイルとリンクの対象がわかったので、囲んでいるソースにリンクする実装を用意しました。ファイル。 基本的に、テンプレートをインスタンス化した瞬間に、まったく新しいクラスを作成する必要があります。コンパイラに通知しない限り、提供する型を使用するときにそのクラスがどのように見えるかわからない場合は、それを行うことができません。テンプレートの実装なので、コンパイラーは <code>T</code> を私の型に置き換えて、コンパイルおよびリンクできる状態の具象クラスを作成できます。
ko: 따라서 템플릿은 개별적으로 컴파일되지 않으며 다른 소스 파일에서 구체적인 인스턴스가있는 경우에만 컴파일됩니다. 그러나 구체적인 인스턴스화는 템플릿 파일의 구현을 알아야합니다. .h 파일에서 구체적인 유형을 사용하여 <code>typename T</code> 를 수정하는 것만으로는 .cpp가 링크 할 수 없기 때문에 작업을 수행하지 않기 때문에 기억하십시오 템플릿은 추상적이며 컴파일 할 수 없기 때문에 나중에 찾으십시오. 지금 구현을 제공해야하므로 컴파일하고 링크 할 것을 알고 이제 구현 소스를 묶는 소스에 연결했습니다. 파일. 기본적으로 템플릿을 인스턴스화하는 순간 완전히 새로운 클래스를 만들어야하며, 컴파일러에 통지하지 않으면 제공하는 형식을 사용할 때 해당 클래스가 어떻게 표시되는지 알 수없는 경우 그렇게 할 수 없습니다 템플릿 구현이므로 이제 컴파일러는 <code>T</code> 를 내 유형으로 바꾸고 컴파일 및 링크 준비가 된 구체적인 클래스를 만들 수 있습니다.
ru: Поэтому шаблоны никогда не компилируются отдельно, а компилируются только там, где у вас есть конкретный экземпляр в каком-либо другом исходном файле. Тем не менее, конкретный экземпляр должен знать реализацию файла шаблона, потому что простое изменение <code>typename T</code> с использованием конкретного типа в файле .h не будет делать работу, потому что .cpp есть для ссылки, я не могу узнайте об этом позже, потому что помните, что шаблоны являются абстрактными и не могут быть скомпилированы, поэтому я вынужден дать реализацию прямо сейчас, чтобы я знал, что компилировать и ссылаться, и теперь, когда у меня есть реализация, она связана с исходным кодом файл. По сути, в тот момент, когда я создаю экземпляр шаблона, мне нужно создать целый новый класс, и я не могу этого сделать, если не знаю, как должен выглядеть этот класс при использовании предоставляемого мной типа, если я не сделаю уведомление компилятору реализация шаблона, так что теперь компилятор может заменить <code>T</code> моим типом и создать конкретный класс, который будет готов к компиляции и компоновке.
zh_cn: 因此，模板永远不会单独编译，仅在其他源文件中有具体实例化的位置才编译。 但是，具体的实例化需要知道模板文件的实现，因为仅使用.h文件中的具体类型修改类型名 <code>typename T</code> 并不能完成工作，因为要链接的是什么.cpp，我无法稍后找到它，因为记住模板是抽象的并且无法编译，所以我被迫现在提供实现，所以我知道要编译和链接的内容，现在有了实现，它就被链接到随附的源代码中文件。 基本上，实例化模板的那一刻，我需要创建一个全新的类，并且如果不知道使用所提供的类型时该类的外观，则无法这样做，除非我通知编译器模板实现，因此现在编译器可以用我的类型替换 <code>T</code> 并创建一个准备好进行编译和链接的具体类。

source: This is my approach because I am providing a working program, not a template library for use in other programs. The author of the book, Josuttis, works a lot on template libraries.
es: Este es mi enfoque porque estoy proporcionando un programa de trabajo,no una biblioteca de plantillas para su uso en otros programas.El autor del libro,Josuttis,trabaja mucho en bibliotecas de plantillas.
ja: これは、他のプログラムで使用するためのテンプレートライブラリではなく、動作するプログラムを提供しているからです。この本の著者であるJosuttisは、テンプレートライブラリについて多くの研究をしています。
ko: 다른 프로그램에서 사용할 템플릿 라이브러리가 아닌 작업 프로그램을 제공하고 있기 때문에 이것은 나의 접근 방식입니다. 이 책의 저자 인 Josuttis는 템플릿 라이브러리에서 많은 작업을 수행합니다.
ru: Это мой подход,потому что я предоставляю рабочую программу,а не библиотеку шаблонов для использования в других программах.Автор книги,Йосуттис,много работает над библиотеками шаблонов.
zh_cn: 这是我的做法,因为我提供的是一个工作程序,而不是模板库供其他程序使用。这本书的作者Josuttis在模板库方面做了很多工作。

source: This requires every T class here to implement the less than operator (&lt;). It will throw a compiler error when you compare two class instances that haven't implemented the "&lt;".
es: Esto requiere que cada clase T aqu&iacute; implemente el operador menor que (&lt;). Lanzar&aacute; un error de compilaci&oacute;n cuando compare dos instancias de clase que no hayan implementado el "&lt;".
ja: そのため、ここではすべてのTクラスに小なり演算子（&lt;）を実装する必要があります。 「&lt;」を実装していない2つのクラスインスタンスを比較すると、コンパイラエラーがスローされます。
ko: 여기에서는 모든 T 클래스에서보다 작음 연산자 (&lt;)를 구현해야합니다. "&lt;"를 구현하지 않은 두 개의 클래스 인스턴스를 비교하면 컴파일러 오류가 발생합니다.
ru: Это требует, чтобы каждый класс T здесь реализовывал оператор less than (&lt;). Он сгенерирует ошибку компилятора, когда вы сравните два экземпляра класса, которые не реализовали &laquo;&lt;&raquo;.
zh_cn: 这要求这里的每个T类都实现小于运算符（&lt;）。 当您比较尚未实现&ldquo; &lt;&rdquo;的两个类实例时，它将引发编译器错误。

source: This way only the template instantiations will need to be recompiled, not all template users (and dependencies).
es: De esta manera sólo las instancias de la plantilla deberán ser recompiladas,no todos los usuarios de la plantilla (y las dependencias).
ja: この方法では、テンプレートのインスタンスのみを再コンパイルする必要があり、すべてのテンプレートユーザー(および依存関係)を再コンパイルする必要はありません。
ko: 이 방법으로 모든 템플릿 사용자 (및 종속성)가 아니라 템플릿 인스턴스화 만 다시 컴파일하면됩니다.
ru: Таким образом,необходимо будет перекомпилировать только инстанциии шаблонов,а не всех пользователей шаблонов (и зависимостей).
zh_cn: 这样只需要对模板实例进行重新编译,而不是所有的模板用户(和依赖关系)。

source: This way, implementation is still separated from declaration, but is accessible to the compiler.
es: De esta manera,la aplicación sigue estando separada de la declaración,pero es accesible para el compilador.
ja: この方法では、実装は宣言から切り離されていますが、コンパイラからはアクセス可能です。
ko: 이런 식으로 구현은 여전히 ​​선언과 분리되어 있지만 컴파일러가 액세스 할 수 있습니다.
ru: Таким образом,реализация все еще отделена от декларирования,но доступна компилятору.
zh_cn: 这样一来,实现与声明仍然是分开的,但对编译器来说是可以访问的。

source: This will instantiate (and thus make available to the linker) the class and all its member functions (only). Similar syntax works for template functions, so if you have non-member operator overloads you may need to do the same for those.
es: Esto instanciará (y por lo tanto pondrá a disposición del enlazador)la clase y todas sus funciones de miembro (solamente).Una sintaxis similar funciona para las funciones de plantilla,por lo que si tiene sobrecargas de operadores no miembros puede que tenga que hacer lo mismo para aquellos.
ja: これは、クラスとそのすべてのメンバ関数 (のみ)のインスタンスを作成します (したがって、リンカが利用できるようになります)。同様の構文はテンプレート関数でも動作するので、非メンバ演算子のオーバーロードがある場合は、それらについても同様の処理を行う必要があるかもしれません。
ko: 이렇게하면 클래스와 모든 멤버 함수가 인스턴스화되어 (링커가 사용할 수있게됩니다) 전용입니다. 템플릿 함수에도 비슷한 구문이 적용되므로 비 멤버 연산자 오버로드가있는 경우 이와 동일한 구문을 수행해야 할 수도 있습니다.
ru: Это позволит инстанцировать (и тем самым сделать доступным для компоновщика)класс и все его функции-членов (только).Аналогичный синтаксис работает и для шаблонных функций,поэтому,если у вас перегрузки операторов,не являющихся членами,вам может понадобиться сделать то же самое для них.
zh_cn: 这将实例化(从而使链接器可用)类和它的所有成员函数(仅)。类似的语法也适用于模板函数,所以如果你有非成员操作符重载,你可能需要对这些函数做同样的操作。
