Repository: rueisnom/feedback
Catalog: xlf/49/50/21/495021.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To sum up, templates are blueprints for how classes should look, classes are blueprints for how an object should look. I can't compile templates separate from their concrete instantiation because the compiler only compiles concrete types, in other words, templates at least in C++, is pure language abstraction. We have to de-abstract templates so to speak, and we do so by giving them a concrete type to deal with so that our template abstraction can transform into a regular class file and in turn, it can be compiled normally. Separating the template .h file and the template .cpp file is meaningless. It is nonsensical because the separation of .cpp and .h only is only where the .cpp can be compiled individually and linked individually, with templates since we can't compile them separately, because templates are an abstraction, therefore we are always forced to put the abstraction always together with the concrete instantiation where the concrete instantiation always has to know about the type being used.
es: En resumen,las plantillas son planos de cómo deben verse las clases,las clases son planos de cómo debe verse un objeto.No puedo compilar plantillas por separado de su instanciación concreta porque el compilador sólo compila tipos concretos,en otras palabras,las plantillas al menos en C++,es pura abstracción del lenguaje.Tenemos que des-abstruir plantillas por así decirlo,y lo hacemos dándoles un tipo concreto con el que lidiar para que nuestra abstracción de plantillas se transforme en un archivo de clase regular y a su vez,pueda ser compilado normalmente.Separar el archivo de plantilla .h y el archivo de plantilla .cpp no tiene sentido.No tiene sentido porque la separación del archivo .cpp y del archivo .h sólo es posible cuando el .cpp puede ser compilado individualmente y enlazado individualmente,con plantillas ya que no podemos compilarlas por separado,porque las plantillas son una abstracción,por lo que siempre estamos obligados a poner la abstracción siempre junto con la instanciación concreta donde la instanciación concreta siempre tiene que saber sobre el tipo que se está utilizando.
ja: 要約すると、テンプレートはクラスがどのように見えるかの設計図であり、クラスはオブジェクトがどのように見えるかの設計図です。テンプレートを具体的なインスタンス化から切り離してコンパイルすることはできません。なぜなら、コンパイラは具体的な型しかコンパイルしないからです。いわばテンプレートの抽象化を解除する必要がありますが、テンプレートに具体的な型を与えることで、テンプレートの抽象化が通常のクラスファイルに変換され、それによって通常のコンパイルが可能になります。テンプレート.hファイルとテンプレート.cppファイルを分けることは無意味です。.cppと.hの分離は、.cppを個別にコンパイルして個別にリンクすることができる場合のみであり、テンプレートを個別にコンパイルすることはできません。
ko: 요약하면 템플릿은 클래스의 모양을 나타내는 청사진이고 클래스는 객체의 모양을 나타내는 청사진입니다. 컴파일러는 구체적인 유형 만 컴파일합니다. 즉, 적어도 C ++의 템플릿은 순수한 언어 추상화이기 때문에 템플릿을 구체적인 인스턴스화와 별도로 컴파일 할 수 없습니다. 우리는 말을하기 위해 템플릿의 추상을 제거해야하며, 템플릿 추상화가 정규 클래스 파일로 변환 될 수 있고, 정상적으로 컴파일 될 수 있도록 구체적인 유형을 제공함으로써 그렇게합니다. 템플릿 .h 파일과 템플릿 .cpp 파일을 분리하는 것은 의미가 없습니다. .cpp와 .h의 구분은 .cpp를 개별적으로 컴파일하고 개별적으로 링크 할 수있는 곳에서만 가능하기 때문에 의미가 없습니다. 템플릿은 추상화이기 때문에 템플릿을 따로 컴파일 할 수 없기 때문에 템플릿과 추상화해야하기 때문에 항상 구체적인 인스턴스화는 항상 사용되는 유형에 대해 알아야하는 구체적인 인스턴스화와 추상화를 함께 사용하십시오.
ru: Подводя итог,можно сказать,что шаблоны-это чертежи того,как должны выглядеть классы,а классы-это чертежи того,как должен выглядеть объект.Я не могу компилировать шаблоны отдельно от их конкретной конкретизации,потому что компилятор компилирует только конкретные типы,то есть шаблоны хотя бы на Си++,это чистая языковая абстракция.Так сказать,нам приходится деабстрагировать шаблоны,и мы делаем это,давая им конкретный тип,чтобы наша абстракция шаблона могла трансформироваться в обычный файл класса и,в свою очередь,компилироваться нормально.Разделение шаблона .h файла и шаблона .cpp файла бессмысленно.Это бессмысленно,потому что разделение .cpp и .h только там,где .cpp может быть скомпилирован по отдельности и связан по отдельности с шаблонами,так как мы не можем скомпилировать их по отдельности,так как шаблоны-это абстракции,поэтому мы всегда вынуждены ставить абстракцию вместе с конкретной инстанцинацией,где конкретная инстанцинация всегда должна знать об используемом типе.
zh_cn: 总结一下,模板是类应该怎么看的蓝图,类是对象应该怎么看的蓝图。我不能把模板与具体的实例化分开编译,因为编译器只编译具体的类型,换句话说,模板至少在C++中,是纯粹的语言抽象。我们要对模板进行去抽象化,可以说,我们要做的就是给模板一个具体的类型来处理,这样,我们的模板抽象就可以转化成一个普通的类文件,反过来,它也可以正常编译。把模板.h文件和模板.cpp文件分开是没有意义的。这是没有意义的,因为只有在.cpp和.h分离的情况下才可以单独编译.cpp,并与模板分开,因为我们不能单独编译,因为模板是一个抽象,所以我们总是被迫把抽象总是和具体的实例放在一起,其中具体的实例总是要知道正在使用的类型。

source: When reading this line, the compiler will create a new class (let's call it <code>FooInt</code>), which is equivalent to the following:
es: Al leer esta l&iacute;nea, el compilador crear&aacute; una nueva clase (llam&eacute;mosla <code>FooInt</code> ), que es equivalente a lo siguiente:
ja: この行を読み取ると、コンパイラーは新しいクラス（ <code>FooInt</code> と呼ぶことにします ）を作成します。これは次と同等です。
ko: 이 줄을 읽을 때 컴파일러는 다음과 같은 새 클래스를 만듭니다 ( <code>FooInt</code> 라고 함 ).
ru: При чтении этой строки компилятор создаст новый класс (назовем его <code>FooInt</code> ), который эквивалентен следующему:
zh_cn: 阅读此行时，编译器将创建一个新类（我们将其 <code>FooInt</code> ），其等效于以下内容：

source: Why can templates only be implemented in the header file
es: ¿Por qué las plantillas sólo pueden ser implementadas en el archivo de cabecera
ja: テンプレートはヘッダーファイルにしか実装できないのはなぜですか?
ko: 헤더 파일에서만 템플릿을 구현할 수있는 이유
ru: Почему шаблоны могут быть реализованы только в заголовочном файле.
zh_cn: 为什么模板只能在标题文件中实现?

source: Why is this?
es: ¿Por qué?
ja: なぜなんでしょうか?
ko: 왜 이런거야?
ru: Почему это?
zh_cn: 为什么会这样?

source: You can actually define your template class inside a .template file rather than a .cpp file. Whoever is saying you can only define it inside a header file is wrong. This is something that works all the way back to c++ 98.
es: En realidad puedes definir tu clase de plantilla dentro de un archivo .template en lugar de un archivo .cpp.Quienquiera que diga que sólo puedes definirla dentro de un archivo de encabezado está equivocado.Esto es algo que funciona hasta el c++98.
ja: 実際には.cppファイルではなく.templateファイルの中でテンプレートクラスを定義することができます。ヘッダーファイルの中でしか定義できないと言っている人は誰でも間違っています。これはc++98までさかのぼって動作しています。
ko: 실제로 템플릿 클래스를 .cpp 파일이 아닌 .template 파일 내에 정의 할 수 있습니다. 헤더 파일 내에서만 정의 할 수 있다고 말하는 사람은 잘못되었습니다. 이것은 C ++ 98로 거슬러 올라가는 것입니다.
ru: Вы можете фактически определить свой класс шаблона внутри файла .template,а не файла .cpp.Кто бы ни говорил,что вы можете определить его только внутри заголовочного файла,он ошибается.Это что-то,что работает вплоть до c++98.
zh_cn: 实际上,你可以在.template文件中定义你的模板类,而不是在.cpp文件中定义。无论谁说你只能在头文件中定义它,都是错误的。这种情况可以追溯到C++98年的时候。

source: You might think that when compiling a template the compiler should "generate all versions", with the ones that are never used being filtered out during linking. Aside from the huge overhead and the extreme difficulties such an approach would face because "type modifier" features like pointers and arrays allow even just the built-in types to give rise to an infinite number of types, what happens when I now extend my program by adding:
es: Se podría pensar que al compilar una plantilla el compilador debería "generar todas las versiones",filtrando las que nunca se utilizan durante el enlace.Aparte de la enorme sobrecarga y las extremas dificultades que tal enfoque enfrentaría porque las características del "modificador de tipos" como punteros y matrices permiten que incluso sólo los tipos incorporados den lugar a un número infinito de tipos,lo que sucede cuando ahora extiendo mi programa añadiendo:
ja: テンプレートをコンパイルするとき、コンパイラは「すべてのバージョンを生成し、リンク時には使用されないものはフィルタリングされる」べきだと思うかもしれません。ポインタや配列のような「型修飾子」機能によって、組み込みの型だけでも無限の型を生成することができるので、そのようなアプローチは膨大なオーバーヘッドと極端な困難さに直面するでしょう。
ko: 템플릿을 컴파일 할 때 컴파일러는 "모든 버전을 생성"해야하며, 링크하는 동안 사용되지 않은 버전을 필터링해야한다고 생각할 수 있습니다. 포인터 및 배열과 같은 "유형 수정 자"기능을 사용하면 내장 유형만으로도 무한한 유형의 유형을 생성 할 수 있기 때문에 엄청난 오버 헤드와 이러한 접근 방식이 직면하는 극심한 어려움 외에도 이제 프로그램을 확장하면 어떻게됩니까? 추가하여:
ru: Можно подумать,что при компиляции шаблона компилятор должен "сгенерировать все версии",при этом те,которые никогда не использовались,будут отфильтрованы при компоновке.Кроме огромных накладных расходов и экстремальных трудностей,с которыми может столкнуться такой подход,потому что возможности "модификаторов типов",таких как указатели и массивы,позволяют даже просто встроенным типам давать бесконечное количество типов,что происходит,когда я сейчас расширяю свою программу путем добавления:
zh_cn: 你可能会认为,在编译模板时,编译器应该 "生成所有的版本",在链接过程中过滤掉那些从未被使用过的类型。除了巨大的开销和这样的方法会面临巨大的困难,因为像指针和数组这样的 "类型修改器 "特性允许即使只是内置的类型,也可以产生无限多的类型,那么当我现在通过添加的方式扩展我的程序时,会发生什么呢?

source: declares and implements <code>class BazPrivate</code>, and uses <code>MyClass&lt;BazPrivate&gt;</code>
es: declara e implementa la <code>class BazPrivate</code> , y usa <code>MyClass&lt;BazPrivate&gt;</code>
ja: <code>class BazPrivate</code> 宣言および実装し、 <code>MyClass&lt;BazPrivate&gt;</code> を使用します
ko: <code>class BazPrivate</code> 선언하고 구현하며 <code>MyClass&lt;BazPrivate&gt;</code>
ru: объявляет и реализует <code>class BazPrivate</code> и использует <code>MyClass&lt;BazPrivate&gt;</code>
zh_cn: 声明并实现 <code>class BazPrivate</code> ，并使用 <code>MyClass&lt;BazPrivate&gt;</code>

source: declares the interface of <code>class MyClass&lt;T&gt;</code>
es: declara la interfaz de la <code>class MyClass&lt;T&gt;</code>
ja: <code>class MyClass&lt;T&gt;</code> インターフェースを宣言します
ko: <code>class MyClass&lt;T&gt;</code> 의 인터페이스를 선언합니다.
ru: объявляет интерфейс <code>class MyClass&lt;T&gt;</code>
zh_cn: 声明 <code>class MyClass&lt;T&gt;</code> 的接口

source: defines the implementation of <code>class MyClass&lt;T&gt;</code>
es: define la implementaci&oacute;n de la <code>class MyClass&lt;T&gt;</code>
ja: <code>class MyClass&lt;T&gt;</code> 実装を定義します
ko: <code>class MyClass&lt;T&gt;</code> 의 구현을 정의
ru: определяет реализацию <code>class MyClass&lt;T&gt;</code>
zh_cn: 定义 <code>class MyClass&lt;T&gt;</code>

source: inner_foo has the forward declarations. foo.tpp has the implementation and include inner_foo.h; and foo.h will have just one line, to include foo.tpp.
es: inner_foo tiene las declaraciones delanteras.foo.tpp tiene la implementación e incluye inner_foo.h;y foo.h tendrá una sola línea,para incluir foo.tpp.
ja: inner_foo は前方宣言を持っています。 foo.tpp は実装を持っており、inner_foo.h をインクルードします。
ko: inner_foo에는 forward 선언이 있습니다. foo.tpp는 구현이 있으며 inner_foo.h를 포함합니다. foo.h는 foo.tpp를 포함하기 위해 한 줄만 가질 것입니다.
ru: Internal_foo имеет прямые объявления.foo.tpp имеет реализацию и включает internal_foo.h;и foo.h будет иметь только одну строку,чтобы включить foo.tpp.
zh_cn: inner_foo.tpp有前向声明,foo.tpp有实现和包含 inner_foo.h;而foo.h只有一行,要包含foo.tpp。

source: uses <code>MyClass&lt;int&gt;</code>
es: utiliza <code>MyClass&lt;int&gt;</code>
ja: <code>MyClass&lt;int&gt;</code> 使用
ko: <code>MyClass&lt;int&gt;</code>
ru: использует <code>MyClass&lt;int&gt;</code>
zh_cn: 使用 <code>MyClass&lt;int&gt;</code>

source: which is gaining support in many compilers. However, I think precompiled headers would be difficult with template header files.
es: que está ganando apoyo en muchos compiladores.Sin embargo,creo que los encabezados precompilados serían difíciles con archivos de encabezados de plantillas.
ja: は多くのコンパイラでサポートされるようになってきています。しかし、プリコンパイルされたヘッダはテンプレートヘッダファイルでは難しいと思います。
ko: 많은 컴파일러에서 지원을 받고 있습니다. 그러나 템플릿 헤더 파일로는 사전 컴파일 된 헤더가 어려울 것이라고 생각합니다.
ru: которая получает поддержку во многих компиляторах.Однако,я думаю,что прекомпилированные заголовки будут сложны с шаблонными заголовочными файлами.
zh_cn: 这在许多编译器中越来越得到支持。然而,我认为预编译的头文件将很难使用模板头文件。
