Repository: rueisnom/feedback
Catalog: xlf/16/94/03/6/1694036.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: It provides the same protections as <code>fgets</code> in that it prevents buffer overflows but it also notifies the caller as to what happened and clears out the excess characters so that they do not affect your next input operation.
ja: バッファーオーバーフローを防ぐという点で <code>fgets</code> と同じ保護を提供しますが、何が起こったのかを呼び出し元に通知し、余分な文字をクリアして、次の入力操作に影響を与えないようにします。
ko: 버퍼 오버플로를 방지한다는 점에서 <code>fgets</code> 와 동일한 보호 기능을 제공하지만 호출자에게 발생한 상황에 대해 알리고 초과 문자를 지워 다음 입력 작업에 영향을 미치지 않도록합니다.
ru: Он обеспечивает ту же защиту, что и <code>fgets</code> , в том смысле, что он предотвращает переполнение буфера, но также уведомляет вызывающую сторону о том, что произошло, и удаляет лишние символы, чтобы они не влияли на вашу следующую операцию ввода.
zh_cn: 它提供了与 <code>fgets</code> 相同的保护，它可以防止缓冲区溢出，而且还可以通知调用者发生了什么并清除多余的字符，以免它们影响您的下一个输入操作。

source: It remained an official part of the language up to the 1999 ISO C standard, but it was officially removed by the 2011 standard. Most C implementations still support it, but at least gcc issues a warning for any code that uses it.
ja: 1999年のISO C標準までは公式に言語の一部として使われていましたが、2011年の標準で公式に削除されました。ほとんどの C の実装ではまだサポートされていますが、少なくとも gcc はそれを使用するコードに対して警告を発します。
ko: 이 언어는 1999 ISO C 표준까지 언어의 공식적인 부분으로 유지되었지만 2011 표준에 의해 공식적으로 제거되었습니다. 대부분의 C 구현은 여전히 ​​그것을 지원하지만 적어도 gcc는 그것을 사용하는 코드에 대해 경고를 발행합니다.
ru: Он оставался официальной частью языка вплоть до стандарта ИСО С 1999 года,но был официально удален стандартом 2011 года.Большинство реализаций С по-прежнему поддерживают его,но,по крайней мере,gcc выдает предупреждение на любой код,который его использует.
zh_cn: 在1999年ISO C标准之前,它一直是C语言的官方部分,但在2011年的标准中正式删除了它。大多数C语言的实现仍然支持它,但至少gcc会对任何使用它的代码发出警告。

source: Modern versions of the Linux compilation system generates warnings if you link <code>gets()</code> &mdash; and also for some other functions that also have security problems (<code>mktemp()</code>, &hellip;).
ja: 最新バージョンのLinuxコンパイルシステムでは、 <code>gets()</code> をリンクすると警告が生成されます。また、セキュリティ上の問題がある他のいくつかの関数（ <code>mktemp()</code> 、&hellip;）も警告されます。
ko: 최신 버전의 Linux 컴파일 시스템 <code>gets()</code> 를 링크 하면 보안 문제가있는 다른 함수 ( <code>mktemp()</code> ,&hellip;)에 대해 경고를 생성합니다.
ru: Современные версии системы компиляции Linux генерируют предупреждения при ссылке <code>gets()</code> а также для некоторых других функций, которые также имеют проблемы с безопасностью ( <code>mktemp()</code> ,&hellip;).
zh_cn: 如果您链接 <code>gets()</code> 以及其他一些也存在安全问题的函数（ <code>mktemp()</code> &hellip;），则现代版本的Linux编译系统会生成警告。

source: Now, first of all you are allowed to input how many characters you want, <code>gets</code> won't care about it. Secondly the bytes over the size of the array in which you put them (in this case <code>array1</code>) will overwrite whatever they find in memory because <code>gets</code> will write them. In the previous example this means that if you input <code>"abcdefghijklmnopqrts"</code> maybe, unpredictably, it will overwrite also <code>array2</code> or whatever.
ja: さて、まず第一にあなたはあなたが望む何文字を入力することを許されます、それは気 <code>gets</code> なりません。 次に、 <code>gets</code> がそれらを書き込むため、それらを配置した配列（この場合は <code>array1</code> ）のサイズを超えるバイトが、メモリ内で見つかったものを上書きします。 前の例では、これは、 <code>"abcdefghijklmnopqrts"</code> を入力した場合、おそらく、予期せず、 <code>array2</code> なども上書きすることを意味します。
ko: 이제, 당신이 원하는 수의 문자를 입력 할 수 있습니다. 두 번째로 배열의 크기를 초과하는 바이트 (이 경우 <code>array1</code> )는 메모리에서 찾은 모든 것을 덮어 씁니다. 앞의 예에서 이것은 <code>"abcdefghijklmnopqrts"</code> 를 입력하면 예상치 <code>array2</code> 을 덮어 씁니다.
ru: Теперь, во-первых, вам разрешено вводить, сколько символов вы хотите, <code>gets</code> не будет заботиться об этом. Во-вторых, байты по размеру массива, в который вы их помещаете (в данном случае <code>array1</code> ), будут перезаписывать все, что они находят в памяти, потому что get будет их записывать. В предыдущем примере это означает, что если вы <code>"abcdefghijklmnopqrts"</code> возможно, непредсказуемо, он будет перезаписывать также <code>array2</code> или что-то еще.
zh_cn: 现在，首先您可以输入想要的字符个数， <code>gets</code> 不必担心。 其次，超过放置它们的数组大小的字节（在本例中为 <code>array1</code> ）将覆盖它们在内存中找到的所有内容，因为 <code>gets</code> 会写入它们。 在上一个示例中，这意味着，如果您输入 <code>"abcdefghijklmnopqrts"</code> 可能会不可预测地将覆盖 <code>array2</code> 或其他内容。

source: Or, better:
ja: というか、もっといい。
ko: 또는 더 나은 :
ru: Или,лучше:
zh_cn: 或者说,更好。

source: POSIX 2008 also provides a safe alternative to <code>gets()</code> called <a href="http://www.opengroup.org/onlinepubs/9699919799/functions/getline.html"><code>getline()</code></a>. It allocates space for the line dynamically, so you end up needing to free it. It removes the limitation on line length, therefore. It also returns the length of the data that was read, or <code>-1</code> (and not <code>EOF</code>!), which means that null bytes in the input can be handled reliably. There is also a 'choose your own single-character delimiter' variation called <code>getdelim()</code>; this can be useful if you are dealing with the output from <code>find -print0</code> where the ends of the file names are marked with an ASCII NUL <code>'\0'</code> character, for example.
ja: POSIX 2008は、 <code>gets()</code> の安全な代替手段として<a href="http://www.opengroup.org/onlinepubs/9699919799/functions/getline.html"> <code>getline()</code> </a>も提供しています。 それはラインにスペースを動的に割り当てます、それであなたはそれを解放する必要があることになります。 したがって、行の長さの制限がなくなります。 また、読み取られたデータの長さ、または <code>-1</code> （ <code>EOF</code> ではなく！）も返します。つまり、入力のnullバイトを確実に処理できます。 <code>getdelim()</code> と呼ばれる「独自の単一文字区切り文字を選択する」バリエーションもあります。 これは、 <code>find -print0</code> 、ファイル名の末尾がASCII NUL <code>'\0'</code> 文字でマークされているfind -print0からの出力を処理する場合に役立ちます。
ko: POSIX 2008은 <a href="http://www.opengroup.org/onlinepubs/9699919799/functions/getline.html"> <code>getline()</code> </a> 이라는 gets () 대신 안전한 대안을 제공합니다. 라인을위한 공간을 동적으로 할당하므로 결국이를 해제해야합니다. 따라서 줄 길이에 대한 제한을 제거합니다. 또한 읽은 데이터의 길이 또는 <code>-1</code> ( <code>EOF</code> ! 아님)을 리턴합니다. 즉, 입력의 널 바이트를 안정적으로 처리 할 수 ​​있습니다. <code>getdelim()</code> 이라는 '자신의 단일 문자 구분 기호 선택'변형도 있습니다. 예를 들어 파일 이름의 끝 부분에 ASCII NUL <code>'\0'</code> 문자가 표시되는 <code>find -print0</code> 의 출력을 처리 할 때 유용합니다.
ru: POSIX 2008 также предоставляет безопасную альтернативу <code>gets()</code> называемую <a href="http://www.opengroup.org/onlinepubs/9699919799/functions/getline.html"> <code>getline()</code> </a> . Он динамически распределяет пространство для строки, поэтому вам, в конечном итоге, придется ее освободить. Таким образом, он снимает ограничение на длину строки. Он также возвращает длину прочитанных данных или <code>-1</code> (а не <code>EOF</code> !), Что означает, что нулевые байты на входе могут быть надежно обработаны. Существует также вариант &laquo;выберите свой собственный односимвольный разделитель&raquo;, называемый <code>getdelim()</code> ; это может быть полезно, если вы имеете дело с выводом команды <code>find -print0</code> , где, например, концы имен файлов помечены символом ASCII NUL <code>'\0'</code> .
zh_cn: POSIX 2008还为 <code>gets()</code> 提供了一个安全的替代方法，称为<a href="http://www.opengroup.org/onlinepubs/9699919799/functions/getline.html"> <code>getline()</code> </a> 。 它为该行动态分配空间，因此最终需要释放它。 因此，它消除了对线长的限制。 它还返回读取的数据长度，或者为 <code>-1</code> （而不是 <code>EOF</code> ！），这意味着可以可靠地处理输入中的空字节。 还有一个名为&ldquo;选择您自己的单字符定界符&rdquo;的变体，称为 <code>getdelim()</code> ； 例如，在处理 <code>find -print0</code> 的输出时，这很有用，在该输出中文件名的末尾用ASCII NUL <code>'\0'</code> 字符标记。

source: Reading a line that overflows the array pointed to by s results in undefined behavior. The use of fgets() is recommended.
ja: s が指す配列をオーバーフローさせた行を読み込むと、未定義の動作になります。fgets()の使用を推奨します。
ko: 에 의해 지정된 배열을 오버플로하는 행을 읽으면 정의되지 않은 동작이 발생합니다. fgets ()를 사용하는 것이 좋습니다.
ru: Чтение строки,перекрывающей массив,на который указывает s,приводит к неопределенному поведению.Рекомендуется использовать функцию fgets().
zh_cn: 读取一个由s指向的数组溢出的行会导致未定义的行为。建议使用fgets()。

source: Recommended practice
ja: おすすめの練習方法
ko: 권장 연습
ru: Рекомендуемая практика
zh_cn: 建议的做法

source: The <code>fgets</code> function allows properly-written programs to safely process input lines too long to store in the result array. In general this requires that callers of <code>fgets</code> pay attention to the presence or absence of a new-line character in the result array. Consider using <code>fgets</code> (along with any needed processing based on new-line characters) instead of <code>gets_s</code>.
ja: <code>fgets</code> 関数を使用すると、適切に作成されたプログラムで、結果の配列に格納するには長すぎる入力行を安全に処理できます。 一般に、これには <code>fgets</code> の呼び出し元が結果配列内の改行文字の有無に注意を払う必要があります。 <code>gets_s</code> の代わりに <code>fgets</code> （改行文字に基づく必要な処理とともに）の使用を検討してください 。
ko: <code>fgets</code> 기능을 사용하면 올바르게 작성된 프로그램이 입력 배열을 너무 길어서 결과 배열에 저장하기에 안전하게 처리 할 수 ​​있습니다. 일반적으로 <code>fgets</code> 호출자는 결과 배열에 개행 문자가 있는지 여부에주의를 기울여야합니다. <code>gets_s</code> 대신 <code>fgets</code> 를 사용하십시오 (줄 바꾸기 문자를 기반으로 필요한 처리와 함께).
ru: Функция <code>fgets</code> позволяет правильно написанным программам безопасно обрабатывать входные строки, слишком длинные для хранения в массиве результатов. В общем случае это требует, чтобы вызывающие функции <code>fgets</code> обращали внимание на наличие или отсутствие символа новой строки в массиве результатов. Попробуйте использовать <code>fgets</code> (вместе с любой необходимой обработкой, основанной на символах новой строки) вместо <code>gets_s</code> .
zh_cn: <code>fgets</code> 函数允许正确编写的程序安全地处理输入行太长而无法存储在结果数组中的行。 通常，这要求 <code>fgets</code> 调用者注意结果数组中是否存在换行符。 考虑使用 <code>fgets</code> （以及基于换行符的所有必要处理）代替 <code>gets_s</code> 。

source: The C gets function is dangerous and has been a very costly mistake. Tony Hoare singles it out for specific mention in his talk "Null References: The Billion Dollar Mistake":
ja: C get 関数は危険であり、非常にコストのかかる間違いです。Tony Hoare氏の講演「Null References.10億ドルの間違い」の中で具体的に言及しています。
ko: C gets 함수는 위험하며 매우 비용이 많이 드는 실수였습니다. Tony Hoare는 그의 연설 "Null References : Billion Dollar Mistake"에서 구체적으로 언급하기 위해 그것을 인용합니다.
ru: C получает функцию опасна и была очень дорогостоящей ошибкой.Тони Хоар выделяет его для конкретного упоминания в своем докладе "Null References:Ошибка на миллиард долларов":
zh_cn: C得到函数是危险的,而且是一个代价很高的错误。Tony Hoare在他的演讲《Null References》中特别提到了它。十亿美金的错误"。

source: The C11 standard ISO/IEC 9899:2011 eliminated <code>gets()</code> as a standard function, which is A Good Thing&trade; (it was formally marked as 'obsolescent' and 'deprecated' in ISO/IEC 9899:1999/Cor.3:2007 &mdash; Technical Corrigendum 3 for C99, and then removed in C11). Sadly, it will remain in libraries for many years (meaning 'decades') for reasons of backwards compatibility. If it were up to me, the implementation of <code>gets()</code> would become:
ja: C11標準ISO / IEC 9899：2011は、get <code>gets()</code> を標準関数として削除しました。これはA Good Thing&trade;です（ISO / IEC 9899：1999 / Cor.3：2007では正式に「廃止」および「非推奨」とマークされていました） &mdash; C99の技術的正誤表3。C11で削除されました。 悲しいことに、下位互換性の理由から、ライブラリは何年​​も（「数十年」を意味する）ライブラリに残ります。 それが私次第だったら、 <code>gets()</code> の実装は次のようになります。
ko: C11 표준 ISO / IEC 9899 : 2011은 표준 함수 인 <code>gets()</code> 를 A Good Thing &trade; (ISO / IEC 9899 : 1999 / Cor.3 : 2007에서 공식적으로 '폐기'및 '더 이상 사용되지 않음'으로 표시)로 제거했습니다. &mdash; C99 용 기술 강령 3, C11에서 제거됨). 안타깝게도 이전 버전과의 호환성으로 인해 수년 동안 라이브러리에 남아있을 것입니다 ( '수십 년'). 그것이 나에게 달려 있다면 <code>gets()</code> 구현은 다음과 같습니다.
ru: Стандарт C11 ISO / IEC 9899: 2011 исключает <code>gets()</code> в качестве стандартной функции, которая называется A Good Thing &trade; (она была официально помечена как &laquo;устаревшая&raquo; и &laquo;устарела&raquo; в ISO / IEC 9899: 1999 / Cor.3: 2007). - Техническое исправление 3 для C99, а затем удалено в C11). К сожалению, из-за обратной совместимости он будет храниться в библиотеках в течение многих лет (что означает &laquo;десятилетия&raquo;). Если бы это было до меня, реализация <code>gets()</code> стала бы:
zh_cn: C11标准ISO / IEC 9899：2011取消了 <code>gets()</code> 作为标准功能，这是A Good Thing&trade;（在ISO / IEC 9899：1999 / Cor.3：2007中正式标记为&ldquo;过时&rdquo;和&ldquo;弃用&rdquo; &mdash; C99的技术勘误3，然后在C11中删除）。 可悲的是，由于向后兼容的原因，它将在图书馆中保留很多年（意思是&ldquo;十年&rdquo;）。 如果由我决定， <code>gets()</code> 的实现将变为：

source: The C11 standard, ISO/IEC 9899-2011, includes TR24731 in Annex K as an optional part of the library. Unfortunately, it is seldom implemented on Unix-like systems.
ja: C11規格であるISOIEC 9899-2011では、TR24731をライブラリのオプションの一部として附属書Kに含んでいます。残念ながら、Unix ライクなシステムではほとんど実装されていません。
ko: C11 표준 ISO / IEC 9899-2011에는 라이브러리의 선택적 부분으로 Annex K의 TR24731이 포함되어 있습니다. 불행히도 유닉스 계열 시스템에서는 거의 구현되지 않습니다.
ru: Стандарт C11,ISOIEC 9899-2011,включает TR24731 в приложение K в качестве факультативной части библиотеки.К сожалению,он редко реализуется на Unix-подобных системах.
zh_cn: C11标准,ISOIEC 9899-2011,在附件K中包含了TR24731作为库的可选部分。不幸的是,它很少在类似Unix的系统中实现。

source: The Microsoft Visual Studio compilers implement an approximation to the TR 24731-1 standard, but there are differences between the signatures implemented by Microsoft and those in the TR.
ja: Microsoft Visual Studio コンパイラは TR 24731-1 標準に近似したシグネチャを実装していますが、Microsoft が実装したシグネチャと TR のシグネチャには違いがあります。
ko: Microsoft Visual Studio 컴파일러는 TR 24731-1 표준에 대한 근사치를 구현하지만 Microsoft에서 구현 한 서명과 TR의 서명 간에는 차이가 있습니다.
ru: Компиляторы Microsoft Visual Studio реализуют приближение к стандарту TR 24731-1,однако есть различия между сигнатурами,реализованными Microsoft и TR.
zh_cn: Microsoft Visual Studio 编译器实现了对 TR 24731-1 标准的近似值,但 Microsoft 实现的签名与 TR 中的签名之间存在差异。

source: The correct thing to do is to use the <code>fgets</code> function with the <code>stdin</code> file handle since you can limit the characters read from the user.
ja: ユーザーから読み取られる文字を制限できるため、正しいことは、 <code>fgets</code> 関数を <code>stdin</code> ファイルハンドルで使用することです。
ko: 사용자가 읽는 문자를 제한 할 수 있으므로 <code>stdin</code> 파일 핸들에 <code>fgets</code> 함수를 사용하는 것이 올바른 방법입니다.
ru: Правильнее всего использовать функцию <code>fgets</code> с дескриптором файла <code>stdin</code> , поскольку вы можете ограничить число символов, читаемых пользователем.
zh_cn: 正确的做法是将 <code>fgets</code> 函数与 <code>stdin</code> 文件句柄一起使用，因为您可以限制从用户读取的字符。

source: The first internet worm (the <a href="https://en.wikipedia.org/wiki/Morris_worm">Morris Internet Worm</a>) escaped about 30 years ago (1988-11-02), and it used <code>gets()</code> and a buffer overflow as one of its methods of propagating from system to system. The basic problem is that the function doesn't know how big the buffer is, so it continues reading until it finds a newline or encounters EOF, and may overflow the bounds of the buffer it was given.
ja: 最初のインターネットワーム（ <a href="https://en.wikipedia.org/wiki/Morris_worm">Morris Internet Worm</a> ）は約30年前（1988-11-02）にエスケープし、 <code>gets()</code> とバッファオーバーフローをシステムからシステムへの伝播方法の1つとして使用しました。 基本的な問題は、関数がバッファーの大きさを認識しないため、改行が見つかるか、EOFに遭遇するまで読み取りを続け、指定されたバッファーの境界をオーバーフローする可能性があることです。
ko: 첫 번째 인터넷 웜 ( <a href="https://en.wikipedia.org/wiki/Morris_worm">Morris Morris Worm</a> )은 약 30 년 전 (1988-11-02) 탈출했으며 시스템에서 시스템으로 전파하는 방법 중 하나로 <code>gets()</code> 및 버퍼 오버플로를 사용했습니다. 기본적인 문제는 함수가 버퍼의 크기를 알지 못하므로 줄 바꿈을 찾거나 EOF를 발견 할 때까지 계속 읽으며 주어진 버퍼의 범위를 오버플로 할 수 있다는 것입니다.
ru: Первый интернет-червь ( <a href="https://en.wikipedia.org/wiki/Morris_worm">Morris Internet Worm</a> ) сбежал около 30 лет назад (1988-11-02), и он использовал get <code>gets()</code> и переполнение буфера в качестве одного из методов распространения от системы к системе. Основная проблема заключается в том, что функция не знает, насколько велик буфер, поэтому она продолжает чтение, пока не найдет новую строку или не встретит EOF, и может переполнить границы заданного буфера.
zh_cn: 第一个Internet蠕虫（ <a href="https://en.wikipedia.org/wiki/Morris_worm">Morris Internet Worm</a> ）大约在30年前（1988-11-02）逃脱了，它使用 <code>gets()</code> 和缓冲区溢出作为其在系统之间传播的方法之一。 基本问题是该函数不知道缓冲区有多大，因此它会继续读取直到找到换行符或遇到EOF为止，并且可能会溢出给定缓冲区的范围。

source: The function is unsafe because it assumes consistent input. <strong>NEVER USE IT!</strong>
ja: 関数は一貫した入力を想定しているため、安全ではありません。 <strong>絶対に使用しないでください。</strong>
ko: 함수는 일관된 입력을 가정하기 때문에 안전하지 않습니다. <strong>절대 사용하지 마십시오!</strong>
ru: Функция небезопасна, потому что предполагает согласованный ввод. <strong>НИКОГДА НЕ ИСПОЛЬЗУЙТЕ ЕГО!</strong>
zh_cn: 该函数不安全，因为它假定输入一致。 <strong>永远不要使用它！</strong>

source: The residual problem is how to report the three different result states &mdash; EOF or error, line read and not truncated, and partial line read but data was truncated.
ja: 残りの問題は、3つの異なる結果の状態（EOFまたはエラー、行が切り捨てられていない、および行が部分的に読み込まれたがデータが切り捨てられた）を報告する方法です。
ko: 잔차 문제는 EOF 또는 오류, 줄 읽기 및 잘리지 않음 및 부분 줄 읽기이지만 데이터가 잘린 세 가지 결과 상태를보고하는 방법입니다.
ru: Остаточная проблема заключается в том, как сообщать о трех различных состояниях результата - EOF или ошибке, чтение строки не усечено, а частично прочитано, но данные были усечены.
zh_cn: 剩余的问题是如何报告三种不同的结果状态-EOF或错误，行读取但未截断，部分行读取但数据被截断。

source: The whole hour is worth watching but for his comments view from 30 minutes on with the specific gets criticism around 39 minutes.
ja: 全体の時間は見る価値がありますが、彼のコメントビューのために特定の上で30分から39分の周りに批判を取得します。
ko: 한 시간 내내 볼 가치가 있지만 그의 의견에 대해서는 30 분부터 특정 39 분에 대한 비평을 얻습니다.
ru: Весь час стоит посмотреть,но за его комментарии вид из 30 минут с учетом специфики подвергается критике около 39 минут.
zh_cn: 整个小时是值得观看,但对于他的评论视图从30分钟的具体得到批评39分钟左右。

source: There is also the <a href="https://stackoverflow.com/questions/372980/do-you-use-the-tr-24731-safe-functions-in-your-c-code">TR 24731-1</a> (Technical Report from the C Standard Committee) which provides safer alternatives to a variety of functions, including <code>gets()</code>:
ja: <a href="https://stackoverflow.com/questions/372980/do-you-use-the-tr-24731-safe-functions-in-your-c-code">get</a> （）を含むさまざまな関数のより安全な代替手段を提供するTR 24731-1 （C標準委員会からの技術レポート）もあります。
ko: 또한 <code>gets()</code> 포함한 다양한 기능에 대한 안전한 대안을 제공하는 <a href="https://stackoverflow.com/questions/372980/do-you-use-the-tr-24731-safe-functions-in-your-c-code">TR 24731-1</a> (C 표준위원회의 기술 보고서 )이 있습니다 .
ru: Существует также <a href="https://stackoverflow.com/questions/372980/do-you-use-the-tr-24731-safe-functions-in-your-c-code">TR 24731-1</a> (Технический отчет от Стандартного комитета C), который предоставляет более безопасные альтернативы множеству функций, включая <code>gets()</code> :
zh_cn: 还有<a href="https://stackoverflow.com/questions/372980/do-you-use-the-tr-24731-safe-functions-in-your-c-code">TR 24731-1</a> （C标准委员会的技术报告），它为各种功能（包括 <code>gets()</code> ）提供了更安全的替代方法：

source: This is the reason that <a href="http://www.opengroup.org/onlinepubs/009695399/functions/gets.html">one reference</a> gives:
ja: これが、 <a href="http://www.opengroup.org/onlinepubs/009695399/functions/gets.html">1つのリファレンス</a>が与える理由です。
ko: 이것이 <a href="http://www.opengroup.org/onlinepubs/009695399/functions/gets.html">하나의 참조가</a> 제공하는 이유입니다.
ru: Это причина того, что <a href="http://www.opengroup.org/onlinepubs/009695399/functions/gets.html">одна ссылка</a> дает:
zh_cn: 这就是<a href="http://www.opengroup.org/onlinepubs/009695399/functions/gets.html">一个参考</a>给出的原因：

source: This problem doesn't arise with <code>gets()</code> because it doesn't know where your buffer ends and merrily tramples beyond the end, wreaking havoc on your beautifully tended memory layout, often messing up the return stack (a <a href="https://stackoverflow.com/">Stack Overflow</a>) if the buffer is allocated on the stack, or trampling over the control information if the buffer is dynamically allocated, or copying data over other precious global (or module) variables if the buffer is statically allocated. None of these is a good idea &mdash; they epitomize the phrase 'undefined behaviour`.
ja: この問題は、 <code>gets()</code> では発生しません。バッファがどこで終了しているのかがわからないため、最後から楽に踏みにじって、美しく手入れされたメモリレイアウトに大混乱を引き起こし、多くの場合バッファがリターンスタック（ <a href="https://stackoverflow.com/">スタックオーバーフロー</a> ）スタックに割り当てられているか、バッファが動的に割り当てられている場合は制御情報を踏みつけ、静的に割り当てられている場合は他の貴重なグローバル（またはモジュール）変数にデータをコピーします。 これらはどれも良いアイデアではありません。「未定義の動作」というフレーズの典型です。
ko: 이 문제는 <code>gets()</code> 발생하지 않습니다. 버퍼가 끝나는 곳을 모르고 끝까지 즐겁게 짓밟는 것을 알지 못하기 때문에 아름답게 꾸며진 메모리 레이아웃을 혼란스럽게 만들고 종종 버퍼가 반환 스택 ( <a href="https://stackoverflow.com/">스택 오버플로</a> )을 엉망으로 만듭니다 버퍼에 동적으로 할당 된 경우 스택에 할당되거나 제어 정보를 짓밟거나 버퍼가 정적으로 할당 된 경우 다른 중요한 전역 (또는 모듈) 변수를 통해 데이터를 복사합니다. 이것들 중 어느 것도 좋은 생각이 아닙니다. '정의되지 않은 행동'이라는 문구를 나타냅니다.
ru: Эта проблема не возникает с <code>gets()</code> потому что она не знает, где заканчивается ваш буфер, и весело растоптывает за ее пределами, нанося ущерб вашей красиво улаженной структуре памяти, часто путая возвращаемый стек ( <a href="https://stackoverflow.com/">переполнение стека</a> ), если буфер выделяется в стеке, либо попирает управляющую информацию, если буфер динамически распределяется, либо копирует данные в другие важные глобальные (или модульные) переменные, если буфер статически распределен. Ничто из этого не является хорошей идеей - они воплощают фразу &laquo;неопределенное поведение&raquo;.
zh_cn: 使用 <code>gets()</code> 不会出现此问题，因为它不知道缓冲区的结束位置并快乐地践踏缓冲区的末尾，从而对漂亮的内存布局造成严重破坏，如果缓冲区经常弄乱返回堆栈（ <a href="https://stackoverflow.com/">Stack Overflow</a> ）是在堆栈上分配的；如果动态分配了缓冲区，则践踏控制信息；如果静态分配了缓冲区，则通过其他宝贵的全局（或模块）变量复制数据。 这些都不是一个好主意-它们概括了&ldquo;未定义的行为&rdquo;一词。

source: This will help make sure nobody is still depending on it. Thank you.
ja: これでまだ誰も依存していないことを確認できます。ありがとうございます。
ko: 이것은 아무도 그것에 의존하지 않도록하는 데 도움이됩니다. 감사합니다.
ru: Это поможет убедиться,что никто от этого не зависит.Спасибо.
zh_cn: 这将有助于确保没有人还在依赖它。谢谢你的帮助

source: To read from the stdin:
ja: stdinから読み込むには
ko: stdin에서 읽으려면 :
ru: Читать из венецианского:
zh_cn: 要从stdin中读取。

source: To that end, almost every C coder at some point in their career will write a more useful wrapper around <code>fgets</code> as well. Here's mine:
ja: そのために、キャリアのある時点でのほとんどすべてのCコーダーは、 <code>fgets</code> のより便利なラッパーも作成します。 これが私のものです：
ko: 이를 위해 커리어의 어느 시점에서든 거의 모든 C 코더는 <code>fgets</code> 주위에 더 유용한 래퍼를 작성할 것입니다. 내 꺼야 :
ru: С этой целью почти каждый C-кодер в какой-то момент своей карьеры также напишет более полезную оболочку для <code>fgets</code> . Вот мой:
zh_cn: 为此，几乎每个C程序员在其职业生涯中的某个时候都将为 <code>fgets</code> 编写一个更有用的包装器。 这是我的：

source: What no-one else yet mentioned is that <code>gets()</code> does not include the newline but <code>fgets()</code> does. So, you might need to use a wrapper around <code>fgets()</code> that deletes the newline:
ja: 他に誰も言及していないのは、 <code>gets()</code> には改行が含まれていませんが、 <code>fgets()</code> には含まれていることです。 したがって、改行を削除する <code>fgets()</code> のラッパーを使用する必要がある場合があります。
ko: 아무도 아직 언급하지 않은 것은 <code>gets()</code> 는 개행을 포함하지 않지만 <code>fgets()</code> 는 포함한다는 것입니다. 따라서 개행을 삭제하는 <code>fgets()</code> 주위에 래퍼를 사용해야 할 수도 있습니다.
ru: Что еще никто не упомянул, так это то, что <code>gets()</code> не включает символ новой строки, а <code>fgets()</code> . Таким образом, вам может понадобиться обертка вокруг <code>fgets()</code> которая удаляет символ новой строки:
zh_cn: 还没有人提到的是， <code>gets()</code> 不包括换行符，而 <code>fgets()</code> 包括了换行符。 因此，您可能需要在 <code>fgets()</code> 周围使用包装器，以删除换行符：

source: When I try to compile C code that uses the <code>gets()</code> function with GCC, I get this warning:
ja: GCCで <code>gets()</code> 関数を使用するCコードをコンパイルしようとすると、次の警告が表示されます。
ko: GCC와 함께 <code>gets()</code> 함수를 사용하는 C 코드를 컴파일하려고하면 다음 경고가 표시됩니다.
ru: Когда я пытаюсь скомпилировать код C, который использует функцию <code>gets()</code> с GCC, я получаю это предупреждение:
zh_cn: 当我尝试使用GCC编译使用 <code>gets()</code> 函数的C代码时，出现以下警告：

source: Why is <code>gets()</code> dangerous
ja: get <code>gets()</code> 危険な理由
ko: <code>gets()</code> 위험한 이유
ru: Почему <code>gets()</code> опасным
zh_cn: 为什么 <code>gets()</code> 很危险

source: Why is the gets function so dangerous that it should not be used
ja: なぜ gets 関数は使用してはいけないほど危険なのでしょうか?
ko: gets 함수가 너무 위험한 이유는 무엇입니까?
ru: Почему функция get настолько опасна,что ее не следует использовать.
zh_cn: 为什么GETES功能如此危险,不应该使用它?
