Repository: rueisnom/feedback
Catalog: xlf/16/94/03/6/1694036.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: You can't remove API functions without breaking the API. If you would, many applications would no longer compile or run at all.
ja: APIを壊さずにAPI関数を削除することはできません。もしそうすれば、多くのアプリケーションがコンパイルされなくなったり、全く実行されなくなったりします。
ko: API를 중단하지 않으면 API 함수를 제거 할 수 없습니다. 그렇다면 많은 응용 프로그램이 더 이상 컴파일되거나 실행되지 않습니다.
ru: Нельзя удалить функции API,не взломав API.Если бы вы это сделали,многие приложения перестали бы компилироваться или запускаться вообще.
zh_cn: 你不能在不破坏API的情况下删除API函数。如果你这样做的话,很多应用程序就会不再编译或运行。

source: You should forget you ever heard that <code>gets()</code> existed.
ja: <code>gets()</code> が存在したと聞いたことは忘れてください。
ko: <code>gets()</code> 존재한다는 말을 잊었을 것입니다.
ru: Вы должны забыть, что когда-либо слышали, что <code>gets()</code> существует.
zh_cn: 您应该忘记曾经听说过 <code>gets()</code> 存在。

source: You should not use <code>gets</code> since it has no way to stop a buffer overflow. If the user types in more data than can fit in your buffer, you will most likely end up with corruption or worse.
ja: バッファオーバーフローを停止する方法 <code>gets</code> ないため、 getsを使用しないでください。 ユーザーがバッファーに収まりきらないほど多くのデータを入力すると、破損またはさらに悪い結果になる可能性が高くなります。
ko: 버퍼 오버 플로우를 중지 할 방법이 없으므로 <code>gets</code> 를 사용하지 않아야합니다. 사용자가 버퍼에 넣을 수있는 것보다 많은 데이터를 입력하면 손상이 발생하거나 더 악화 될 수 있습니다.
ru: Вы не должны использовать <code>gets</code> поскольку он не может остановить переполнение буфера. Если пользователь вводит больше данных, чем может поместиться в вашем буфере, вы, скорее всего, в конечном итоге будете повреждены или хуже.
zh_cn: 您不应该使用 <code>gets</code> ,因为它无法停止缓冲区溢出。 如果用户输入的数据超出缓冲区的容量，则很可能会导致损坏甚至更糟。

source: You'll be happy to know that the committee just voted (unanimously, as it turns out) to remove gets() from the draft as well.
ja: 委員会が(結果的には満場一致で)草案から gets()を削除するように投票したことを知っていると、あなたは喜ぶでしょう。
ko: 위원회가 드래프트에서 gets ()를 제거하기 위해 방금 투표했다는 사실을 알게되어 기쁩니다.
ru: Вы будете рады узнать,что комитет только что проголосовал (единогласно,как оказалось)за то,чтобы убрать get()из проекта.
zh_cn: 你会很高兴地知道,委员会刚刚投票(一致同意)将GETES()也从草案中删除。

source: extra characters entered by the user will be picked up the next time around.
ja: ユーザーが入力した余分な文字は、次回以降にピックアップされます。
ko: 다음에 사용자가 입력 한 추가 문자가 선택됩니다.
ru: Дополнительные символы,введенные пользователем,будут отображаться в следующий раз.
zh_cn: 用户输入的额外字符将在下一次输入时被捡起。

source: there's no quick notification that the user entered too much data.
ja: ユーザーが入力したデータが多すぎるというクイック通知はありません。
ko: 사용자가 너무 많은 데이터를 입력했다는 빠른 알림이 없습니다.
ru: нет быстрого уведомления о том,что пользователь ввел слишком много данных.
zh_cn: 没有快速通知用户输入的数据太多。

source: with some test code:
ja: テストコードを使って
ko: 몇 가지 테스트 코드 :
ru: с каким-то тестовым кодом:
zh_cn: 加上一些测试代码。
