Repository: rueisnom/feedback
Catalog: xlf/16/94/03/6/1694036.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: &sect;6.5.4.1 The <code>gets_s</code> function
ja: &sect;6.5.4.1gets_s関数
ko: &sect;6.5.4.1 <code>gets_s</code> 함수
ru: &sect;6.5.4.1 Функция <code>gets_s</code>
zh_cn: <code>gets_s</code> 函数

source: (.text+0x34): warning: the `gets' function is dangerous and should not be used.
ja: (.text+0x34):warning:`gets' 関数は危険であり、使用すべきではありません。
ko: (.text + 0x34) : 경고 :`gets '함수는 위험하므로 사용해서는 안됩니다.
ru: (.text+0x34):предупреждение:функция `gets' опасна и не должна использоваться.
zh_cn: (.text+0x34):警告:"gets "函数很危险,不应使用。

source: (<code>fgets</code>, if it reads an entire line, will leave the <code>'\n'</code> in the string; you'll have to deal with that.)
ja: （ <code>fgets</code> は 、行全体を読み取る場合、文字列に <code>'\n'</code> を残します。これに対処する必要があります。）
ko: ( <code>fgets</code> 는 전체 행을 읽으면 문자열에 <code>'\n'</code> 을 남겨 둡니다. 그러면 처리해야합니다.)
ru: ( <code>fgets</code> , если он читает всю строку, оставит <code>'\n'</code> в строке; вам придется с этим справиться.)
zh_cn: （ <code>fgets</code> 如果读取整行，将在字符串中保留 <code>'\n'</code> ；您将不得不处理该问题。）

source: 3 If there is a runtime-constraint violation, <code>s[0]</code> is set to the null character, and characters are read and discarded from <code>stdin</code> until a new-line character is read, or end-of-file or a read error occurs.
ja: 3実行時制約違反がある場合、 <code>s[0]</code> はヌル文字に設定され、改行文字が読み取られるか、ファイルの終わりまたは読み取りエラーが発生するまで、文字が読み取られて <code>stdin</code> から破棄されます。
ko: 3 런타임 제약 조건 위반이있는 경우 <code>s[0]</code> 이 널 문자로 설정되고 개행 문자를 읽거나 파일 끝 또는 읽기 오류가 발생할 때까지 문자를 <code>stdin</code> 에서 읽고 버립니다.
ru: 3 Если есть нарушение ограничения времени выполнения, для <code>s[0]</code> устанавливается нулевой символ, и символы считываются и отбрасываются из стандартного <code>stdin</code> до тех пор, пока не будет прочитан символ новой строки, не произойдет конец файла или ошибка чтения.
zh_cn: 3如果存在运行时约束冲突，则将 <code>s[0]</code> 设置为空字符，然后从 <code>stdin</code> 读取并丢弃字符，直到读取换行符，或者出现文件结尾或读取错误。

source: 4 The <code>gets_s</code> function reads at most one less than the number of characters specified by <code>n</code> from the stream pointed to by <code>stdin</code>, into the array pointed to by <code>s</code>. No additional characters are read after a new-line character (which is discarded) or after end-of-file. The discarded new-line character does not count towards number of characters read. A null character is written immediately after the last character read into the array.
ja: 4 <code>gets_s</code> 関数は、 <code>stdin</code> が指すストリームから、 <code>s</code> が指す配列に、 <code>n</code> で指定された文字数より多くても1つ少ない値を読み込みます。 改行文字（破棄される）の後、またはファイルの終わりの後は、追加の文字は読み取られません。 破棄された改行文字は、読み取られた文字数にはカウントされません。 配列に読み込まれた最後の文字の直後にnull文字が書き込まれます。
ko: 4 <code>gets_s</code> 함수는 <code>stdin</code> 에 의해 지시 된 스트림에서 <code>s</code> 에 의해 지시 된 배열로 <code>n</code> 에 의해 지정된 문자 수보다 최대 1 개 적은 문자를 읽습니다. 줄 바꿈 문자 (폐기) 이후 또는 파일 끝 이후에는 추가 문자를 읽을 수 없습니다. 버려진 개행 문자는 읽은 문자 수에 포함되지 않습니다. 널 문자는 마지막 문자를 배열로 읽은 직후에 작성됩니다.
ru: 4 Функция <code>gets_s</code> считывает самое большее на единицу меньше числа символов, указанного в <code>n</code> , из потока, на который указывает <code>stdin</code> , в массив, на который указывает <code>s</code> . Никакие дополнительные символы не читаются после символа новой строки (который отбрасывается) или после конца файла. Выброшенный символ новой строки не учитывается в количестве прочитанных символов. Нулевой символ записывается сразу после последнего прочитанного символа в массив.
zh_cn: 4 <code>gets_s</code> 函数从 <code>stdin</code> 指向的流中读取最多比 <code>n</code> 指定的字符数少1的字符到 <code>s</code> 指向的数组中。 在换行符（已被丢弃）之后或文件结尾之后，不会再读取其他字符。 丢弃的换行符不计入读取的字符数。 在将最后一个字符读入数组后，立即写入一个空字符。

source: 5 If end-of-file is encountered and no characters have been read into the array, or if a read error occurs during the operation, then <code>s[0]</code> is set to the null character, and the other elements of <code>s</code> take unspecified values.
ja: 5ファイルの終わりが検出され、配列に文字が読み込まれていない場合、または操作中に読み込みエラーが発生した場合、 <code>s[0]</code> はnull文字に設定され、 <code>s</code> の他の要素は未指定の値をとります。
ko: 5 파일 끝이 발견되고 배열로 읽은 문자가 없거나 조작 중에 읽기 오류가 발생하면 <code>s[0]</code> 이 널 문자로 설정되고 <code>s</code> 의 다른 요소는 지정되지 않은 값을 갖습니다. .
ru: 5 Если обнаружен конец файла, и в массив не было прочитано ни одного символа, или если во время операции возникла ошибка чтения, то для <code>s[0]</code> устанавливается нулевой символ, а другие элементы <code>s</code> принимают неопределенные значения ,
zh_cn: 5如果遇到文件结尾，并且没有字符读入数组，或者在操作期间发生读取错误，则 <code>s[0]</code> 设置为空字符，而 <code>s</code> 的其他元素采用未指定的值。

source: 6 The <code>fgets</code> function allows properly-written programs to safely process input lines too long to store in the result array. In general this requires that callers of <code>fgets</code> pay attention to the presence or absence of a new-line character in the result array. Consider using <code>fgets</code> (along with any needed processing based on new-line characters) instead of <code>gets_s</code>.
ja: 6 <code>fgets</code> 関数を使用すると、適切に作成されたプログラムで、結果の配列に格納するには長すぎる入力行を安全に処理できます。 一般に、これには <code>fgets</code> の呼び出し元が結果配列内の改行文字の有無に注意を払う必要があります。 <code>gets_s</code> の代わりに <code>fgets</code> （改行文字に基づく必要な処理とともに）の使用を検討してください 。
ko: 6 <code>fgets</code> 기능을 사용하면 올바르게 작성된 프로그램이 입력 배열을 너무 길어 결과 배열에 저장하기에 너무 안전하게 처리 할 수 ​​있습니다. 일반적으로 <code>fgets</code> 호출자는 결과 배열에 개행 문자가 있는지 여부에주의를 기울여야합니다. <code>gets_s</code> 대신 <code>fgets</code> 를 사용하십시오 (줄 바꾸기 문자를 기반으로 필요한 처리와 함께).
ru: 6 Функция <code>fgets</code> позволяет правильно написанным программам безопасно обрабатывать строки ввода, слишком длинные для хранения в массиве результатов. В общем случае это требует, чтобы вызывающие функции <code>fgets</code> обращали внимание на наличие или отсутствие символа новой строки в массиве результатов. Попробуйте использовать <code>fgets</code> (вместе с любой необходимой обработкой, основанной на символах новой строки) вместо <code>gets_s</code> .
zh_cn: 6 <code>fgets</code> 函数允许正确编写的程序安全地处理过长的行，以至于无法存储在结果数组中。 通常，这要求 <code>fgets</code> 调用者注意结果数组中是否存在换行符。 考虑使用 <code>fgets</code> （以及基于换行符的所有必要处理）代替 <code>gets_s</code> 。

source: <code>fgets()</code> allows you to specify how many characters are taken out of the standard input buffer, so they don't overrun the variable.
ja: <code>fgets()</code> を使用すると、標準入力バッファーから取り出す文字数を指定できるため、変数がオーバーランすることはありません。
ko: <code>fgets()</code> 사용하면 표준 입력 버퍼에서 몇 개의 문자를 가져 와서 변수를 오버런하지 않도록 지정할 수 있습니다.
ru: <code>fgets()</code> позволяет вам указать, сколько символов вынимается из стандартного входного буфера, чтобы они не выходили за пределы переменной.
zh_cn: <code>fgets()</code> 允许您指定从标准输入缓冲区中取出多少个字符，因此它们不会超出变量。

source: <code>getline()</code> &mdash; POSIX
ru: <code>getline()</code> - POSIX

source: <code>gets()</code> is dangerous because it is possible for the user to crash the program by typing too much into the prompt. It can't detect the end of available memory, so if you allocate an amount of memory too small for the purpose, it can cause a seg fault and crash. Sometimes it seems very unlikely that a user will type 1000 letters into a prompt meant for a person's name, but as programmers, we need to make our programs bulletproof. (it may also be a security risk if a user can crash a system program by sending too much data).
ja: <code>gets()</code> は、ユーザーがプロンプトに入力しすぎるとプログラムをクラッシュさせる可能性があるため、危険です。 使用可能なメモリの終わりを検出できないため、目的に対して小さすぎる量のメモリを割り当てると、セグメンテーション違反とクラッシュが発生する可能性があります。 ユーザーが人の名前を示すプロンプトに1000文字を入力することはほとんどありそうにありませんが、プログラマーとして、プログラムを完全なものにする必要があります。 （また、ユーザーが大量のデータを送信してシステムプログラムをクラッシュさせる可能性がある場合は、セキュリティリスクになる可能性もあります）。
ko: <code>gets()</code> 는 사용자가 프롬프트에 너무 많이 입력하여 프로그램을 중단시킬 수 있기 때문에 위험합니다. 사용 가능한 메모리의 끝을 감지 할 수 없으므로 목적에 비해 너무 적은 양의 메모리를 할당하면 세그먼트 오류 및 충돌이 발생할 수 있습니다. 때때로 사용자가 사람의 이름을 알리는 프롬프트에 1000자를 입력 할 가능성은 거의 없지만 프로그래머는 프로그램을 방탄으로 만들어야합니다. (사용자가 너무 많은 데이터를 보내 시스템 프로그램을 중단시킬 수있는 경우 보안 위험이있을 수 있습니다).
ru: <code>gets()</code> опасен, потому что пользователь может аварийно завершить работу программы, набрав слишком много в приглашении. Он не может определить конец доступной памяти, поэтому, если вы выделите слишком мало памяти для этой цели, это может вызвать сбой сегмента и сбой. Иногда кажется маловероятным, чтобы пользователь набрал 1000 букв в приглашении, предназначенном для имени человека, но как программисты мы должны сделать наши программы пуленепробиваемыми. (это также может представлять угрозу безопасности, если пользователь может завершить работу системной программы, отправив слишком много данных).
zh_cn: <code>gets()</code> 很危险，因为用户可能会在提示中输入过多内容而使程序崩溃。 它无法检测到可用内存的结束，因此，如果为此目的分配的内存太小，则可能导致段错误和崩溃。 有时，用户似乎不太可能在提示一个人名字的提示符下键入1000个字母，但是作为程序员，我们需要使程序防弹。 （如果用户通过发送太多数据而使系统程序崩溃，也可能会带来安全隐患）。

source: <code>s</code> shall not be a null pointer. <code>n</code> shall neither be equal to zero nor be greater than RSIZE_MAX. A new-line character, end-of-file, or read error shall occur within reading <code>n-1</code> characters from <code>stdin</code>.<sup>25)</sup>
ja: <code>s</code> はnullポインタであってはなりません。 <code>n</code> はゼロに等しくなく、RSIZE_MAXより大きくてはなりません。 <code>stdin</code> から <code>n-1</code> 文字を読み取るときに、改行文字、ファイルの終わり、または読み取りエラーが発生します。 <sup>25）</sup>
ko: <code>s</code> 는 널 포인터가 아니어야합니다. <code>n</code> 은 0과 같거나 RSIZE_MAX보다 크지 않아야합니다. 개행 문자, 파일 끝 또는 읽기 오류는 <code>stdin</code> 에서 <code>n-1</code> 문자를 읽을 때 발생합니다. <sup>25)</sup>
ru: <code>s</code> не должен быть нулевым указателем. <code>n</code> не должно быть равно нулю или быть больше RSIZE_MAX. Символ новой строки, конец файла или ошибка чтения должны возникать при чтении <code>n-1</code> символов из <code>stdin</code> . <sup>25)</sup>
zh_cn: <code>s</code> 不能为空指针。 <code>n</code> 既不等于零也不大于RSIZE_MAX。 从 <code>stdin</code> 读取 <code>n-1</code> 个字符时，将出现换行符，文件结尾或读取错误。 <sup>25）</sup>

source: <sup>25)</sup> The <code>gets_s</code> function, unlike <code>gets</code>, makes it a runtime-constraint violation for a line of input to overflow the buffer to store it. Unlike <code>fgets</code>, <code>gets_s</code> maintains a one-to-one relationship between input lines and successful calls to <code>gets_s</code>. Programs that use <code>gets</code> expect such a relationship.
ja: <sup>25）</sup> <code>gets_s</code> 関数は、 <code>gets</code> とは異なり、それを格納するためにバッファをオーバーフローさせるために、入力行が実行時制約違反になります。 <code>fgets</code> とは異なり、 <code>gets_s</code> は入力行と <code>gets_s</code> の正常な呼び出しとの1対1の関係を維持します。 getを使用するプログラム <code>gets</code> 、このような関係を期待しています。
ko: <sup>25)</sup> <code>gets_s</code> 함수는 <code>gets</code> 와 달리 입력 라인이 버퍼를 오버플로하여 저장하기 위해 런타임 제약 조건 위반을 만듭니다. <code>fgets</code> 와 달리 <code>gets_s</code> 는 입력 라인과 <code>gets_s</code> 에 대한 성공적인 호출 간의 일대일 관계를 유지합니다. 사용하는 프로그램은 그러한 관계를 기대합니다.
ru: <sup>25)</sup> Функция <code>gets_s</code> , в отличие от <code>gets</code> , делает нарушение ограничения времени выполнения для строки ввода переполнением буфера для ее хранения. В отличие от <code>fgets</code> , <code>gets_s</code> поддерживает взаимно-однозначное соотношение между строками ввода и успешными вызовами <code>gets_s</code> . Программы, которые используют, ожидают таких отношений.
zh_cn: <sup>25）</sup>与 <code>gets</code> 不同， <code>gets_s</code> 函数使它违反了运行时约束，导致一行输入溢出缓冲区来存储它。 与 <code>fgets</code> 不同， <code>gets_s</code> 在输入行和对 <code>gets_s</code> 的成功调用之间保持一对一的关系。 使用 <code>gets</code> 程序期望这种关系。

source: Also, as <a href="https://stackoverflow.com/users/134633/caf">caf</a> points out in a comment and <a href="https://stackoverflow.com/users/14860/paxdiablo">paxdiablo</a> shows in his answer, with <code>fgets()</code> you might have data left over on a line. My wrapper code leaves that data to be read next time; you can readily modify it to gobble the rest of the line of data if you prefer:
ja: また、 <a href="https://stackoverflow.com/users/14860/paxdiablo">caf</a>がコメントで指摘し、 paxdiabloが彼の回答で示しているように、 <code>fgets()</code> を使用すると、行にデータが残っている可能性があります。 私のラッパーコードは、そのデータを次回読み取るために残します。 必要に応じて、簡単に変更して残りのデータ行を取得することができます。
ko: 또한 <a href="https://stackoverflow.com/users/134633/caf">caf</a> 가 주석에서 지적하고 <a href="https://stackoverflow.com/users/14860/paxdiablo">paxdiablo</a> 가 그의 대답에 표시하는 것처럼 <code>fgets()</code> 하면 줄에 데이터가 남아있을 수 있습니다. 래퍼 코드는 다음에 해당 데이터를 읽습니다. 원하는 경우 나머지 데이터 라인을 고치기 위해 쉽게 수정할 수 있습니다.
ru: Кроме того, как отмечает <a href="https://stackoverflow.com/users/134633/caf">caf</a> в комментарии, а <a href="https://stackoverflow.com/users/14860/paxdiablo">paxdiablo</a> показывает в своем ответе, с помощью <code>fgets()</code> вас могут остаться данные в строке. Мой код оболочки оставляет эти данные для чтения в следующий раз; вы можете легко изменить его, чтобы поглотить остальную часть строки данных, если вы предпочитаете:
zh_cn: 另外，正如<a href="https://stackoverflow.com/users/14860/paxdiablo">caf</a>在评论中指出， paxdiablo在他的答案中显示的那样，使用 <code>fgets()</code> 可能会将数据遗留在一行上。 我的包装器代码使该数据下次可以读取； 您可以根据需要随时对其进行修改，以吞噬其余数据行：

source: Alternatives to <code>gets()</code>
ja: <code>gets()</code> の代替
ko: <code>gets()</code> 대안
ru: Альтернативы <code>gets()</code>
zh_cn: <code>gets()</code> 的替代方法

source: As everyone else said, the canonical alternative to <code>gets()</code> is <a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/fgets.html"><code>fgets()</code></a> specifying <code>stdin</code> as the file stream.
ja: 他の誰もが言ったように、 <code>gets()</code> の標準的な代替案は、ファイルストリームとして <code>stdin</code> を指定する<a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/fgets.html"> <code>fgets()</code> </a>です。
ko: 다른 사람들이 말했듯이 <code>gets()</code> 대한 표준 대안은 <code>stdin</code> 을 파일 스트림으로 지정하는 <a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/fgets.html"> <code>fgets()</code> </a> 입니다.
ru: Как и все остальные, каноническая альтернатива <code>gets()</code> - это <a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/fgets.html"> <code>fgets()</code> </a> указывающая <code>stdin</code> в качестве файлового потока.
zh_cn: 就像其他人所说的， <code>gets()</code> 的典型替代方法是<a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/fgets.html"> <code>fgets()</code> ,</a>将 <code>stdin</code> 指定为文件流。

source: Because <code>gets</code> doesn't do any kind of check while getting bytes from <em>stdin</em> and putting them somewhere. A simple example:
ja: なぜなら、 <code>gets</code> は、 <em>stdin</em>からバイトを取得してそれらをどこかに置く間、いかなる種類のチェックも行わないからです。 簡単な例：
ko: <code>gets</code> 는 <em>stdin</em> 에서 바이트를 가져 와서 어딘가에 두는 동안 어떤 종류의 검사도 수행하지 않기 때문입니다. 간단한 예 :
ru: Потому что <code>gets</code> не выполняет никаких проверок при получении байтов из <em>stdin</em> и их размещении где-либо. Простой пример:
zh_cn: 因为从<em>stdin</em>获取字节并将它们放在某个地方时， <code>gets</code> 不会做任何形式的检查。 一个简单的例子：

source: But this also has its problems such as:
ja: しかし、これには次のような問題点もあります。
ko: 그러나 이것은 또한 다음과 같은 문제가 있습니다.
ru: Но у этого есть и свои проблемы:
zh_cn: 但这也有其问题,如。

source: C11 K.3.5.4.1 The <code>gets_s</code> function
ja: C11 K.3.5.4.1 <code>gets_s</code> 関数
ko: C11 K.3.5.4.1 <code>gets_s</code> 함수
ru: C11 K.3.5.4.1 Функция <code>gets_s</code>
zh_cn: C11 K.3.5.4.1 <code>gets_s</code> 函数

source: Feel free to use it as you wish, I hereby release it under the "do what you damn well want to" licence :-)
ja: お好きなように自由にお使いください。)
ko: 당신이 원하는대로 자유롭게 사용하십시오, 나는 "당신이 원하는 것을하세요"라이센스하에 배포합니다 :-)
ru: Не стесняйтесь использовать его по своему усмотрению,настоящим я выпускаю его под лицензией "делайте то,что вы,черт возьми,хотите" :-).
zh_cn: 你可以随意使用它,我在此发布 "为所欲为 "的许可下使用它:-)

source: Given that your code will crash anyway, sooner or later, it is better to head the trouble off sooner rather than later. I'd be prepared to add an error message:
ja: あなたのコードはいずれにせよ、遅かれ早かれクラッシュすることを考えると、トラブルを回避するためには、遅かれ早かれ対処した方が良いでしょう。私はエラーメッセージを追加する準備をしています。
ko: 어쨌든 코드가 조만간 충돌 할 수 있으므로 문제를 빨리 해결하는 것이 좋습니다. 오류 메시지를 추가 할 준비가되었습니다.
ru: Учитывая,что ваш код все равно рано или поздно рухнет,лучше рано или поздно устранить проблему.Я буду готов добавить сообщение об ошибке:
zh_cn: 考虑到你的代码迟早都会崩溃,还是早晚都会崩溃,所以还是早点把问题解决掉比较好。我会准备好添加错误信息。

source: Hopefully this whets your appetite for the whole talk, which draws attention to how we need more formal correctness proofs in languages and how language designers should be blamed for the mistakes in their languages, not the programmer. This seems to have been the whole dubious reason for designers of bad languages to push the blame to programmers in the guise of 'programmer freedom'.
ja: この講演では、言語におけるより正式な正しさの証明が必要であることや、言語設計者はプログラマではなく、その言語の誤りの責任を負うべきであることに注意を喚起しています。これは、悪い言語の設計者が「プログラマの自由」という名目でプログラマに責任を押し付けようとする怪しげな理由のように思えます。
ko: 잘하면 이것이 전체 대화에 대한 당신의 식욕을 자극 할 것입니다. 이것은 우리가 언어로보다 공식적인 정확성 증명이 필요한 방법과 언어 디자이너가 프로그래머가 아닌 그들의 언어로 인한 실수에 대해 비난받는 방법에주의를 기울입니다. 이것은 나쁜 언어의 설계자들이 프로그래머의 책임을 '프로그래머의 자유'라는 시각으로 프로그래머에게 전가해야하는 모호한 이유 인 것 같습니다.
ru: Надеюсь,это подогреет аппетит на весь разговор,что привлекает внимание к тому,как нужны более формальные доказательства корректности в языках и как винить дизайнеров языка в ошибках в их языках,а не программиста.Похоже,что это и есть та самая сомнительная причина,по которой дизайнеры плохих языков перекладывают вину на программистов под видом "свободы программиста".
zh_cn: 希望这篇文章能让你对整场讲座的内容有兴趣,因为它让你注意到我们如何在语言中需要更多正式的正确性证明,以及语言设计者应该为语言中的错误负责,而不是程序员。这似乎是不好的语言设计者以 "程序员自由 "为幌子,把责任推给程序员的原因。

source: How can I remove this warning and why is there such a warning about using <code>gets()</code>?
ja: この警告を削除するにはどうすればよいですか。また、 <code>gets()</code> の使用に関する警告が表示されるのはなぜですか。
ko: 이 경고를 어떻게 제거 할 수 있습니까? 왜 <code>gets()</code> 사용에 대한 경고 가 있습니까?
ru: Как я могу удалить это предупреждение и почему появляется такое предупреждение об использовании <code>gets()</code> ?
zh_cn: 如何删除此警告，为什么会有关于使用 <code>gets()</code> 的警告？

source: However, in the <em>Recommended practice</em> section, <code>fgets()</code> is still preferred.
ja: ただし、「 <em>推奨されるプラクティス」</em>セクションでは、 <code>fgets()</code> が推奨されています。
ko: 그러나 <em>권장 연습</em> 섹션에서 <code>fgets()</code> 가 여전히 선호됩니다.
ru: Тем не менее, в разделе <em>Рекомендуемая практика</em> <code>fgets()</code> по-прежнему предпочтительнее.
zh_cn: 但是，在&ldquo; <em>推荐做法&rdquo;</em>部分，仍然首选 <code>fgets()</code> 。

source: I read recently, in a <a href="http://groups.google.com/group/comp.lang.c/msg/7e92710bc5ff2ba8">USENET post to <code>comp.lang.c</code></a>, that <code>gets()</code> is getting removed from the Standard. <strong>WOOHOO</strong>
ja: 最近読んだ、 <a href="http://groups.google.com/group/comp.lang.c/msg/7e92710bc5ff2ba8"> <code>comp.lang.c</code> へのUSENETの投稿</a>で、 <code>gets()</code> が標準から削除されています。 <strong>うん</strong>
ko: <a href="http://groups.google.com/group/comp.lang.c/msg/7e92710bc5ff2ba8"> <code>comp.lang.c</code> </a> 의 USENET 게시물 에서 최근에 <code>gets()</code> 가 표준에서 제거되고 있습니다. <strong>우 호우</strong>
ru: Я недавно прочитал в <a href="http://groups.google.com/group/comp.lang.c/msg/7e92710bc5ff2ba8">посте USENET для <code>comp.lang.c</code> </a> , что <code>gets()</code> удаляется из Стандарта. <strong>WooHoo</strong>
zh_cn: 我最近在<a href="http://groups.google.com/group/comp.lang.c/msg/7e92710bc5ff2ba8">USENET的 <code>comp.lang.c</code> 帖子中阅读到</a> ， <code>gets()</code> 已从标准中删除。 <strong>OH</strong>

source: I remember this has something to do with stack protection and security, but I'm not sure exactly why.
ja: これはスタックの保護とセキュリティに関係があると記憶していますが、はっきりとした理由はわかりません。
ko: 나는 이것이 스택 보호 및 보안과 관련이 있다는 것을 기억하지만 정확히 왜 그런지 잘 모르겠습니다.
ru: Я помню,что это как-то связано с защитой и безопасностью стека,но я не совсем понимаю,почему.
zh_cn: 我记得这和堆栈保护和安全有关,但我不太清楚具体原因。

source: I would like to extend an earnest invitation to any C library maintainers out there who are still including <code>gets</code> in their libraries "just in case anyone is still depending on it": Please replace your implementation with the equivalent of
ja: 「だれかがまだそれに依存している場合に備えて」、ライブラリにまだgetを含めているCライブラリのメンテナに真剣な招待を送りたいと思います。実装を同等のものに置き換えてください
ko: "아직도 라이브러리에 의존하는 경우를 위해"라이브러리에 여전히 포함되어있는 C 라이브러리 관리자에게 진지한 초대를하고 싶습니다.
ru: Я хотел бы направить искреннее приглашение всем сопровождающим библиотек C, которые все еще включают в свои библиотеки &laquo;на всякий случай, если кто-то еще полагается на это&raquo;: пожалуйста, замените вашу реализацию эквивалентом
zh_cn: 我谨向所有仍在库中包含 <code>gets</code> C库维护者致以诚挚的邀请：&ldquo;以防万一仍然有人依赖它&rdquo;：请用

source: If <code>gets()</code> is so dangerous then why can't we remove it?
ja: <code>gets()</code> が非常に危険な場合、それを削除できないのはなぜですか？
ko: <code>gets()</code> 가 너무 위험한 경우 왜 제거 할 수 없습니까?
ru: Если <code>gets()</code> настолько опасен, то почему мы не можем его удалить?
zh_cn: 如果 <code>gets()</code> 如此危险，那么为什么我们不能删除它呢？

source: In C11(ISO/IEC 9899:201x), <code>gets()</code> has been removed. (It's deprecated in ISO/IEC 9899:1999/Cor.3:2007(E))
ja: C11（ISO / IEC 9899：201x）では、 <code>gets()</code> が削除されました。 （ISO / IEC 9899：1999 / Cor.3：2007（E）では非推奨）
ko: C11 (ISO / IEC 9899 : 201x)에서 <code>gets()</code> 가 제거되었습니다. (ISO / IEC 9899 : 1999 / Cor.3 : 2007 (E)에서 사용되지 않습니다.)
ru: В C11 (ISO / IEC 9899: 201x) функция <code>gets()</code> была удалена. (Это устарело в ISO / IEC 9899: 1999 / Cor.3: 2007 (E))
zh_cn: 在C11（ISO / IEC 9899：201x）中， <code>gets()</code> 已被删除。 （在ISO / IEC 9899：1999 / Cor.3：2007（E）中已弃用）

source: In addition to <code>fgets()</code>, C11 introduces a new safe alternative <code>gets_s()</code>:
ja: <code>fgets()</code> に加えて、C11は新しい安全な代替物 <code>gets_s()</code> を導入します：
ko: <code>fgets()</code> 외에도 C11에는 새로운 안전한 대안 <code>gets_s()</code> 도입되었습니다.
ru: В дополнение к <code>fgets()</code> , C11 представляет новую безопасную альтернативу <code>gets_s()</code> :
zh_cn: 除了 <code>fgets()</code> 之外 ，C11还引入了新的安全替代方法 <code>gets_s()</code> ：

source: In fact, ISO have actually taken the step of <em>removing</em><code>gets</code> from the C standard (as of C11, though it was deprecated in C99) which, given how highly they rate backward compatibility, should be an indication of how bad that function was.
ja: 実際、ISOは実際にC標準からgetを<em>削除</em>するステップを踏んでいます（C99では非推奨になりましたが、C11以降）。これは、下位互換性の評価の高さを考えると、その機能がどれほど悪かったかを示すものです。
ko: 실제로 ISO는 실제로 C 표준에서 <code>gets</code> 오기를 <em>제거</em> 하는 단계를 <em>밟았</em> 습니다 (C99에서는 더 이상 사용되지 않지만 C99에서는 더 이상 사용되지 않음). 이전 버전과의 호환성이 얼마나 높은지에 따라 해당 기능이 얼마나 나쁜지를 나타냅니다.
ru: Фактически, ISO фактически предпринял шаг, <em>удалив</em> <code>gets</code> из стандарта C (начиная с C11, хотя в C99 он был признан устаревшим), который, учитывая, насколько высоко они оценивают обратную совместимость, должен указывать на то, насколько плохой была эта функция.
zh_cn: 实际上，ISO实际上已经采取了从C标准中<em>删除</em> <code>gets</code> 的步骤（从C11开始，尽管在C99中已弃用），鉴于它们对向后兼容性的评价很高，这应该表明该功能有多糟糕。

source: In order to use <code>gets</code> safely, you have to know exactly how many characters you will be reading, so that you can make your buffer large enough. You will only know that if you know exactly what data you will be reading.
ja: 安全に使用 <code>gets</code> には、バッファを十分な大きさにできるように、読み取る文字数を正確に把握する必要があります。 どのデータを読み取るかが正確にわかっている場合にのみ、そのことがわかります。
ko: 안전하게 사용하기 위해서는 읽을 문자 수를 정확히 알아야 버퍼를 충분히 크게 만들 수 있습니다. 어떤 데이터를 읽을 것인지 정확히 아는 경우에만 알 수 있습니다.
ru: Чтобы безопасно использовать get, вы должны точно знать, сколько символов вы будете читать, чтобы вы могли сделать свой буфер достаточно большим. Вы будете знать это только в том случае, если точно знаете, какие данные вы будете читать.
zh_cn: 为了安全使用，您必须确切地知道将要读取多少个字符，以便可以使缓冲区足够大。 您只会知道，如果您确切知道将要读取的数据。

source: Instead of using <code>gets</code>, you want to use <a href="http://en.cppreference.com/w/c/io/fgets"><code>fgets</code></a>, which has the signature
ja: getを使用 <code>gets</code> 代わりに、シグネチャを持つ<a href="http://en.cppreference.com/w/c/io/fgets"> <code>fgets</code> </a>を使用したい
ko: <code>gets</code> 를 사용하는 대신 서명이있는 <a href="http://en.cppreference.com/w/c/io/fgets"> <code>fgets</code> </a> 를 사용하려고합니다.
ru: Вместо использования <code>gets</code> вы хотите использовать <a href="http://en.cppreference.com/w/c/io/fgets"> <code>fgets</code> </a> с подписью
zh_cn: 您要使用具有签名的<a href="http://en.cppreference.com/w/c/io/fgets"> <code>fgets</code> </a>而不是使用 <code>gets</code>
