Repository: rueisnom/feedback
Catalog: xlf/33/23/65/332365.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It's important to notice that during the <code>INSERT</code> operation the application isn't checking the input for any special characters, and is therefore allowing arbitrary input to be entered into the SQL command. This means that a malicious user can insert, into a field normally intended for user input, special symbols such as quotes along with arbitrary SQL code to cause the database system to execute it, hence <a href="http://en.wikipedia.org/wiki/SQL_injection">SQL&nbsp;<em>injection</em></a>.
es: Es importante tener en cuenta que durante la operaci&oacute;n <code>INSERT</code> la aplicaci&oacute;n no verifica la entrada de caracteres especiales y, por lo tanto, permite la entrada arbitraria en el comando SQL. Esto significa que un usuario malintencionado puede insertar, en un campo normalmente destinado a la entrada del usuario, s&iacute;mbolos especiales como comillas junto con un c&oacute;digo SQL arbitrario para hacer que el sistema de base de datos lo ejecute, por lo tanto, la <a href="http://en.wikipedia.org/wiki/SQL_injection"><em>inyecci&oacute;n</em> SQL</a> .
ja: <code>INSERT</code> 操作中、アプリケーションは特殊文字の入力をチェックしていないため、SQLコマンドに任意の入力を入力できることに注意してください。 これは、悪意のあるユーザーが、通常はユーザー入力を目的としたフィールドに、引用符などの特別な記号と任意のSQLコードを挿入して、データベースシステムに実行させ、 <a href="http://en.wikipedia.org/wiki/SQL_injection">SQL <em>インジェクション</em></a>を実行させることを意味します 。
ko: <code>INSERT</code> 조작 중에 응용 프로그램은 특수 문자에 대한 입력을 점검하지 않으므로 SQL 명령에 임의의 입력을 입력 할 수 있습니다. 이는 악의적 인 사용자가 일반적으로 사용자 입력을 목적으로하는 필드에 따옴표와 같은 특수 기호를 임의의 SQL 코드와 함께 삽입하여 데이터베이스 시스템이이를 실행하도록하여 <a href="http://en.wikipedia.org/wiki/SQL_injection">SQL <em>주입</em></a> 을 수행 할 수 있음을 의미합니다.
ru: Важно отметить, что во время операции <code>INSERT</code> приложение не проверяет ввод на наличие каких-либо специальных символов, и поэтому позволяет вводить произвольный ввод в команду SQL. Это означает, что злонамеренный пользователь может вставить в поле, обычно предназначенное для ввода данных пользователем, специальные символы, такие как кавычки, а также произвольный код SQL, чтобы система базы данных выполнила его, следовательно, <a href="http://en.wikipedia.org/wiki/SQL_injection">SQL- <em>инъекция</em></a> .
zh_cn: 重要的是要注意，在 <code>INSERT</code> 操作期间，应用程序不会检查输入是否有任何特殊字符，因此允许将任意输入输入到SQL命令中。 这意味着恶意用户可以在通常用于用户输入的字段中插入特殊符号（例如引号）以及任意SQL代码，以使数据库系统执行该操作，从而进行<a href="http://en.wikipedia.org/wiki/SQL_injection">SQL <em>注入</em></a> 。

source: Just looking at:
es: Sólo miraba:
ja: 見ているだけで
ko: 그냥보고 :
ru: Просто смотрю:
zh_cn: 只是看了看。

source: Let's assume the application uses the following SQL to insert data into the table:
es: Supongamos que la aplicación utiliza el siguiente SQL para insertar datos en la tabla:
ja: アプリケーションが以下のSQLを使用してテーブルにデータを挿入するとします。
ko: 애플리케이션이 다음 SQL을 사용하여 데이터를 테이블에 삽입한다고 가정 해 봅시다.
ru: Предположим,что приложение использует следующий SQL для вставки данных в таблицу:
zh_cn: 让我们假设应用程序使用下面的SQL将数据插入到表中。

source: Let's say the name was used in a variable, <code>$Name</code>. You then run this query:
es: Digamos que el nombre se us&oacute; en una variable, <code>$Name</code> . Luego ejecuta esta consulta:
ja: 名前が変数 <code>$Name</code> 使用されていたとしましょう。 次に、このクエリを実行します。
ko: 이름이 변수 <code>$Name</code> 에 사용되었다고 가정 해 봅시다. 그런 다음이 쿼리를 실행하십시오.
ru: Допустим, имя использовалось в переменной <code>$Name</code> . Затем вы запускаете этот запрос:
zh_cn: 假设该名称用于变量 <code>$Name</code> 。 然后，您运行以下查询：

source: Mmm, I am too slow, I see already 8 answers before mine in the orange band... :-) A popular topic, it seems.
es: Mmm,soy demasiado lento,ya veo 8 respuestas antes que la mía en la banda naranja...:-)Un tema popular,parece.
ja: うーん、私は遅すぎて、オレンジ色の帯に私の前にすでに8つの回答が表示されています...:-)人気のある話題のようですね。
ko: 음, 나는 너무 느리다. 나는 주황색 밴드에서 나의 앞에 8 개의 대답을 벌써 본다. :-) 대중적인 주제, 그것은 보인다.
ru: Ммм,я слишком медленно,я уже вижу 8 ответов перед своими в оранжевой группе...:-)Популярная тема,кажется.
zh_cn: 嗯,我太慢了,我在橘色带里看到已经有8个答案在我之前的答案了......:-)看来是个热门话题啊。

source: Mom supposed the database programmer made a request looking like:
es: Mamá supuso que el programador de la base de datos hizo una petición que parecía:
ja: 母さんはデータベースプログラマーがこんな風にリクエストしたんだろうな
ko: 엄마는 데이터베이스 프로그래머가 다음과 같이 요청했다고 가정했습니다.
ru: Мама предположила,что программист базы данных сделал запрос:
zh_cn: 妈妈应该是数据库程序员提出的要求,看起来像。

source: Mostly we will try to patch forms input. But this is not the only place where you can get attacked with SQL injection. You can do very simple attack with URL which send data through GET request; Consider the fallowing example:
es: La mayoría de las veces intentaremos parchear las formas de entrada.Pero este no es el único lugar donde puedes ser atacado con inyección SQL.Puedes hacer un ataque muy simple con URL que envían datos a través de una petición GET;considera el siguiente ejemplo:
ja: 大抵はフォーム入力にパッチを当ててみます。しかし、SQLインジェクションで攻撃される場所はこれだけではありません。あなたは、GETリクエストを介してデータを送信するURLを使用して非常に単純な攻撃を行うことができます;以下の例を考えてみましょう。
ko: 대부분 양식 입력을 패치하려고합니다. 그러나 이것이 SQL 인젝션으로 공격받을 수있는 유일한 곳은 아닙니다. GET 요청을 통해 데이터를 보내는 URL로 매우 간단한 공격을 수행 할 수 있습니다. 다음 예를 고려하십시오.
ru: В основном мы попытаемся исправить ввод форм.Но это не единственное место,где можно подвергнуться атаке с помощью SQL-инъекции.Можно сделать очень простую атаку по URL,который посылает данные через GET-запрос;Рассмотрим пример падения:
zh_cn: 大多数情况下,我们会尝试对表单输入进行修补。但这并不是唯一可以被SQL注入攻击的地方。你可以通过GET请求发送数据的URL进行非常简单的攻击;下面的例子是这样的。

source: No one pointed this out before so through I might alert some of you.
es: Nadie ha señalado esto antes,así que a través de mí podría alertar a algunos de ustedes.
ja: 誰も指摘していないので、私はあなたの一部を警告するかもしれないので、スルーしてください。
ko: 아무도 당신을 경고하기 전에 이것을 지적하지 않았습니다.
ru: Никто не указывал на это раньше,поэтому я могу предупредить некоторых из вас.
zh_cn: 之前没有人指出,所以我可能会提醒你们中的一些人。

source: No, <code>'</code> isn't a comment in SQL, but a delimiter.
es: No <code>'</code> no es un comentario en SQL, sino un delimitador.
ja: いいえ、 <code>'</code> はSQLのコメントではなく、区切り文字です。
ko: 아니요, <code>'</code> 는 SQL의 주석이 아니라 구분 기호입니다.
ru: Нет, это не комментарий в SQL, а разделитель.
zh_cn: 不， <code>'</code> 不是SQL中的注释，而是定界符。

source: Now someone could try something like this
es: Ahora alguien podría intentar algo como esto
ja: これで誰かが次のようなことを試すことができるようになりました。
ko: 이제 누군가 이런 식으로 시도 할 수 있습니다
ru: Теперь кто-нибудь может попробовать что-нибудь подобное
zh_cn: 现在有人可以试试这样的东西

source: Now the query would be something like this (to search the student table)
es: Ahora la consulta sería algo así (para buscar en la mesa de los estudiantes)
ja: クエリは次のようになります(学生テーブルを検索する場合)。
ko: 이제 쿼리는 다음과 같습니다 (학생 테이블을 검색하기 위해)
ru: Теперь запрос будет что-то вроде этого (для поиска в таблице учеников).
zh_cn: 现在的查询方式是这样的(搜索学生表

source: On some systems, the <code>select</code> would get ran first followed by the <code>drop</code> statement! The message is: DONT EMBED VALUES INTO YOUR SQL. Instead use parameters!
es: &iexcl;En algunos sistemas, la <code>select</code> se ejecuta primero seguida de la declaraci&oacute;n de <code>drop</code> ! El mensaje es: NO INCORPORE VALORES EN SU SQL. En su lugar, use par&aacute;metros.
ja: 一部のシステムでは、 <code>select</code> が最初に実行され、その後に <code>drop</code> ステートメントが実行されます。 メッセージは次のとおりです。SQLに値を埋め込まないでください。 代わりにパラメータを使用してください！
ko: 일부 시스템에서는 <code>select</code> 가 먼저 실행 된 후 <code>drop</code> 문이 실행됩니다! 메시지는 다음과 같습니다. SQL에 값이 없습니다. 대신 매개 변수를 사용하십시오!
ru: В некоторых системах <code>select</code> запускается первым, а затем оператором <code>drop</code> ! Сообщение: не вставляйте значения в ваш SQL. Вместо этого используйте параметры!
zh_cn: 在某些系统上， <code>select</code> 将首先运行，然后是 <code>drop</code> 语句！ 消息是：不要将值嵌入SQL。 而是使用参数！

source: Replace <code>foobar</code> with the actual name of the student. A normal insert operation would look like this:
es: Reemplace <code>foobar</code> con el nombre real del alumno. Una operaci&oacute;n de inserci&oacute;n normal se ver&iacute;a as&iacute;:
ja: <code>foobar</code> を実際の学生の名前に置き換えます。 通常の挿入操作は次のようになります。
ko: <code>foobar</code> 를 학생의 실제 이름으로 바꿉니다. 일반적인 삽입 작업은 다음과 같습니다.
ru: Замените <code>foobar</code> реальным именем ученика. Обычная операция вставки будет выглядеть так:
zh_cn: 将 <code>foobar</code> 替换为学生的实际姓名。 正常的插入操作如下所示：

source: Robert Tables
es: Robert Tablas
ja: ロバートテーブル
ko: 로버트 테이블
ru: Роберт Таблз

source: Robert'); DROP TABLE Students; --
es: Robert');estudiantes de DROP TABLE;--
ko: Robert '); DROP TABLE 학생; -
zh_cn: Robert'));DROP TABLE学生;----

source: SQL injection is the database equivalent of a remote <a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">arbitrary code execution</a> vulnerability in an operating system or application. The potential impact of a successful SQL injection attack cannot be underestimated--depending on the database system and application configuration, it can be used by an attacker to cause data loss (as in this case), gain unauthorized access to data, or even execute arbitrary code on the host machine itself.
es: La inyecci&oacute;n SQL es el equivalente de la base de datos de una vulnerabilidad de <a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">ejecuci&oacute;n</a> remota de c&oacute;digo arbitrario en un sistema operativo o aplicaci&oacute;n. El impacto potencial de un ataque de inyecci&oacute;n SQL exitoso no puede subestimarse; seg&uacute;n el sistema de la base de datos y la configuraci&oacute;n de la aplicaci&oacute;n, un atacante puede usarlo para causar p&eacute;rdida de datos (como en este caso), obtener acceso no autorizado a los datos o incluso ejecutar c&oacute;digo arbitrario en la m&aacute;quina host misma.
ja: SQLインジェクションは、オペレーティングシステムまたはアプリケーションにおけるリモートの<a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">任意コード実行の</a>脆弱性に相当するデータベースです。 SQLインジェクション攻撃が成功した場合の潜在的な影響を過小評価することはできません-データベースシステムとアプリケーションの構成によっては、攻撃者がこれを使用して（この場合のように）データ損失を引き起こしたり、データへの不正アクセスを実行したり、実行したりすることさえできますホストマシン自体の任意のコード。
ko: SQL 주입은 운영 체제 또는 응용 프로그램의 원격 <a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">임의 코드 실행</a> 취약점과 동등한 데이터베이스입니다. 성공적인 SQL 주입 공격의 잠재적 영향은 데이터베이스 시스템 및 응용 프로그램 구성에 따라 과소 평가할 수 없으며 공격자가 데이터 손실 (이 경우와 같이)을 유발하거나 데이터에 대한 무단 액세스를 얻거나 심지어 실행할 수도 있습니다 호스트 시스템 자체의 임의 코드
ru: SQL-инъекция является эквивалентом уязвимости удаленного выполнения <a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">произвольного кода</a> в операционной системе или приложении. Потенциальное влияние успешной атаки с использованием SQL-инъекции нельзя недооценивать - в зависимости от системы базы данных и конфигурации приложения злоумышленник может использовать ее для потери данных (как в этом случае), получения несанкционированного доступа к данным или даже выполнения произвольный код на самой машине.
zh_cn: SQL注入等同于操作系统或应用程序中的远程<a href="http://en.wikipedia.org/wiki/Arbitrary_code_execution">任意代码执行</a>漏洞。 不能低估一次成功的SQL注入攻击的潜在影响-根据数据库系统和应用程序配置，攻击者可以使用它来导致数据丢失（在这种情况下），获得对数据的未授权访问甚至执行主机本身上的任意代码。

source: Say you naively wrote a student creation method like this:
es: Digamos que ingenuamente escribiste un método de creación de estudiantes como este:
ja: こんな感じで学生の作り方をナイーブに書いたとしましょう。
ko: 다음과 같이 학생 생성 방법을 순진하게 작성했다고 가정 해보십시오.
ru: Скажем,ты наивно написал такой метод создания учеников:
zh_cn: 说你天真地写出了这样的学生创作方法。

source: Since the admin account has high privileges deleting the table from this account is possible.
es: Dado que la cuenta de administración tiene altos privilegios,es posible borrar la tabla de esta cuenta.
ja: 管理者アカウントは高い権限を持っているので、このアカウントからテーブルを削除することができます。
ko: 관리자 계정에는 높은 권한이 있으므로이 계정에서 테이블을 삭제할 수 있습니다.
ru: Так как учетная запись администратора имеет высокие привилегии,удаление таблицы из этой учетной записи возможно.
zh_cn: 由于管理员账户拥有高权限,所以可以从这个账户中删除表。

source: Since the user input is not sanitized, The above query has is manipulated into 2 parts
es: Dado que la entrada del usuario no está saneada,la consulta anterior se ha manipulado en 2 partes
ja: ユーザ入力はサニタイズされていないので、上記のクエリは2つの部分に操作されます。
ko: 사용자 입력이 삭제되지 않았으므로 위의 쿼리는 두 부분으로 조작됩니다.
ru: Так как пользовательский ввод не дезинфицирован,вышеприведенный запрос манипулируется в 2 части
zh_cn: 由于用户的输入没有经过消毒处理,所以上面的查询被操作成2个部分

source: So if <code>$firstName</code> contains <code>Robert'); DROP TABLE students; --</code> the database program will execute the following request directly on the DB:
es: Entonces, si <code>$firstName</code> contiene <code>Robert'); DROP TABLE students; --</code> DROP TABLE estudiantes; - el programa de la base de datos ejecutar&aacute; la siguiente solicitud directamente en la base de datos:
ja: <code>$firstName</code> に <code>Robert'); DROP TABLE students; --</code> が含まれている場合'）; DROP TABLEの学生。 -データベースプログラムは、DBで次の要求を直接実行します。
ko: <code>$firstName</code> 에 <code>Robert'); DROP TABLE students; --</code> 가 포함되어 있다면 ); DROP TABLE 학생; - 데이터베이스 프로그램은 DB에서 직접 다음 요청을 실행합니다.
ru: Так что, если <code>$firstName</code> содержит <code>Robert'); DROP TABLE students; --</code> DROP TABLE студенты; - программа базы данных выполнит следующий запрос непосредственно в БД:
zh_cn: 因此，如果 <code>$firstName</code> 包含 <code>Robert'); DROP TABLE students; --</code> DROP TABLE学生； -数据库程序将直接在DB上执行以下请求：

source: So now the ' character ends the string literal before the programmer was expecting it. Combined with the ; character to end the statement, an attacker can now add whatever sql they want. The -- comment at the end is to make sure any remaining sql in the original statement does not prevent the query from compiling on the server.
es: Así que ahora el personaje termina la cadena literalmente antes de que el programador lo esperara.Combinado con el carácter;para terminar la declaración,un atacante puede ahora añadir cualquier cantidad de sql que quiera.El comentario --al final es para asegurarse de que el resto de sql en la declaración original no impide que la consulta se compile en el servidor.
ja: これで、プログラマが期待する前に'文字が文字列リテラルを終了させることになります。文の最後の;文字と組み合わせることで、攻撃者は好きなSQLを追加することができるようになりました。最後の --コメントは、元の文に残っている SQL がサーバ上でのコンパイルを妨げないことを確認するためのものです。
ko: 이제 '문자는 프로그래머가 예상하기 전에 문자열 리터럴을 끝냅니다. 와 결합하여; 공격자는 이제 원하는 SQL을 추가 할 수 있습니다. 끝에-주석은 원래 명령문에 남아있는 SQL이 서버에서 쿼리를 컴파일하지 못하게하는 것입니다.
ru: Итак,теперь символ ' заканчивается строковым литералом до того,как его ожидал программист.В сочетании с символом;в конце оператора злоумышленник теперь может добавлять любой квадратный метр.Комментарий --в конце должен быть уверен,что любой оставшийся sql в оригинальном утверждении не помешает компиляции запроса на сервере.
zh_cn: 因此,现在'字符在程序员预料到它之前就结束了字符串的字段。结合;字符来结束语句,攻击者现在可以添加任何他们想要的SQL。结尾的 ---注释是为了确保原始语句中的任何剩余的 sql 不会阻止服务器上的查询编译。

source: Solution - use PDO prepare() &amp; bindParam() methods:
es: Soluci&oacute;n: utilice los m&eacute;todos PDO prepare () y bindParam ():
ja: 解決策-PDO prepare（）およびbindParam（）メソッドを使用します。
ko: 솔루션-PDO Prepare () 및 bindParam () 메소드를 사용하십시오.
ru: Решение - используйте методы PDO prepare () и bindParam ():
zh_cn: 解决方案-使用PDO prepare（）和bindParam（）方法：

source: That would enable you to log in to any account without knowing the password. So you don't need to be able to use two statements in order to use SQL injection, although you can do more destructive things if you are able to supply multiple statements.
es: Eso le permitiría acceder a cualquier cuenta sin saber la contraseña.Por lo tanto,no es necesario que puedas usar dos sentencias para usar la inyección SQL,aunque puedes hacer cosas más destructivas si eres capaz de suministrar varias sentencias.
ja: これにより、パスワードを知らなくても、どのアカウントにもログインできるようになります。つまり、SQLインジェクションを使用するためには、2つのステートメントを使用できる必要はありませんが、複数のステートメントを供給することができれば、より破壊的なことができるようになります。
ko: 암호를 몰라도 모든 계정에 로그인 할 수 있습니다. 따라서 SQL 삽입을 사용하기 위해 두 개의 명령문을 사용할 필요는 없지만 여러 명령문을 제공 할 수 있으면 더 파괴적인 작업을 수행 할 수 있습니다.
ru: Это позволит вам войти в любой аккаунт,не зная пароля.Таким образом,для использования SQL инъекции вам не нужно иметь возможность использовать два оператора,хотя вы можете делать более разрушительные вещи,если сможете предоставить несколько операторов.
zh_cn: 这将使你可以在不知道密码的情况下登录任何账户。所以,你不需要能够使用两条语句就可以使用SQL注入,虽然如果你能够提供多条语句,你可以做更多的破坏性的事情。

source: The <code>');</code> ends the query, it doesn't start a comment. Then it drops the students table and comments the rest of the query that was supposed to be executed.
es: El <code>');</code> finaliza la consulta, no comienza un comentario. Luego, suelta la tabla de estudiantes y comenta el resto de la consulta que se supon&iacute;a que deb&iacute;a ejecutarse.
ja: <code>');</code> クエリを終了し、コメントを開始しません。 次に、studentsテーブルを削除し、実行されるはずだった残りのクエリにコメントを付けます。
ko: <code>');</code> 쿼리를 끝내면 주석이 시작되지 않습니다. 그런 다음 학생 테이블을 삭제하고 실행될 나머지 쿼리를 주석으로 처리합니다.
ru: <code>');</code> заканчивает запрос, комментарий не начинается Затем он удаляет таблицу студентов и комментирует оставшуюся часть запроса, который должен был быть выполнен.
zh_cn: <code>');</code> 结束查询，它不会开始注释。 然后，它删除了students表并注释了应该执行的其余查询。

source: The <code>'</code> character in SQL is used for string constants. In this case it is used for ending the string constant and not for comment.
es: El <code>'</code> car&aacute;cter en SQL se usa para constantes de cadena. En este caso, se utiliza para finalizar la cadena constante y no para comentarios.
ja: SQLの <code>'</code> 文字は、文字列定数に使用されます。 この場合、コメントではなく文字列定数の終了に使用されます。
ko: SQL에서 <code>'</code> 문자는 문자열 상수에 사용됩니다. 이 경우 주석이 아닌 문자열 상수를 종료하는 데 사용됩니다.
ru: Символ <code>'</code> в SQL используется для строковых констант. В этом случае он используется для окончания строковой константы, а не для комментария.
zh_cn: SQL中的 <code>'</code> 字符用于字符串常量。 在这种情况下，它用于结束字符串常量，而不用于注释。

source: The <code>'</code> in the student's name is not a comment, it's the closing <a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">string delimiter</a>. Since the student's name is a string, it's needed syntactically to complete the hypothetical query. Injection attacks only work <em>when the SQL query they inject results in valid SQL</em>.
es: El <code>'</code> en el nombre del alumno no es un comentario, es el <a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">delimitador de cadena de</a> cierre. Como el nombre del alumno es una cadena, se necesita sint&aacute;cticamente para completar la consulta hipot&eacute;tica. Los ataques de inyecci&oacute;n solo funcionan <em>cuando la consulta SQL que inyectan da como resultado un SQL v&aacute;lido</em> .
ja: 学生の名前の <code>'</code> はコメントではなく、終了<a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">文字列の区切り文字</a>です。 学生の名前は文字列であるため、仮想クエリを完了するには構文的に必要です。 インジェクション攻撃は<em>、それらがインジェクトするSQLクエリが有効なSQLになる場合に</em>のみ機能<em>します</em> 。
ko: 학생 이름의 <code>'</code> 은 주석이 아니며 닫는 <a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">문자열 구분 기호</a> 입니다. 학생의 이름은 문자열이므로 가상 쿼리를 완료하려면 구문 적으로 필요합니다. 주입 공격은 주입 <em>한 SQL 쿼리가 유효한 SQL 결과를 얻을</em> 때만 작동 <em>합니다</em> .
ru: &laquo;Имя студента - это не комментарий, это <a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">разделитель</a> закрывающей строки . Поскольку имя студента является строкой, оно необходимо синтаксически для завершения гипотетического запроса. Атаки с использованием инъекций работают только <em>тогда, когда вводимые ими SQL-запросы приводят к действительному SQL</em> .
zh_cn: 学生姓名中的 <code>'</code> 不是注释，是结束<a href="http://msdn.microsoft.com/en-us/library/ms179899.aspx">字符串定界符</a> 。 由于学生的名字是一个字符串，因此在语法上需要它来完成假设的查询。 注入攻击仅<em>在其将有效查询注入结果的SQL查询时</em>起作用。

source: The <code>--</code> only comments the remainder of the line.
es: El <code>--</code> solo comenta el resto de la l&iacute;nea.
ja: <code>--</code> は行の残りの部分にのみコメントします。
ko: <code>--</code> 나머지 줄만 주석으로 처리합니다.
ru: The <code>--</code> только комментирует остаток строки.
zh_cn: <code>--</code> 仅注释该行的其余部分。

source: The SQL injection here is the result of the name of the student terminating the statement and including a separate <code>DROP TABLE</code> command; the two dashes at the end of the input are intended to comment out any leftover code that would otherwise cause an error. The last line of the output confirms that the database server has dropped the table.
es: La inyecci&oacute;n SQL aqu&iacute; es el resultado del nombre del estudiante que termina la declaraci&oacute;n e incluye un comando <code>DROP TABLE</code> separado; los dos guiones al final de la entrada tienen la intenci&oacute;n de comentar cualquier c&oacute;digo sobrante que de otro modo causar&iacute;a un error. La &uacute;ltima l&iacute;nea de la salida confirma que el servidor de bases de datos ha descartado la tabla.
ja: ここでのSQLインジェクションは、ステートメントを終了し、別の <code>DROP TABLE</code> コマンドを含む学生の名前の結果です。 入力の最後にある2つのダッシュは、エラーが発生する残りのコードをコメント化するためのものです。 出力の最後の行は、データベースサーバーがテーブルを削除したことを確認します。
ko: 여기에 SQL 삽입은 명령문을 종료하고 별도의 <code>DROP TABLE</code> 명령을 포함하는 학생 이름의 결과입니다. 입력 끝에있는 두 개의 대시는 남은 코드를 주석 처리하여 오류가 발생할 수 있습니다. 출력의 마지막 행은 데이터베이스 서버가 테이블을 삭제했음을 확인합니다.
ru: Внедрение SQL здесь является результатом того, что имя студента завершает оператор и включает отдельную команду <code>DROP TABLE</code> ; две черты в конце ввода предназначены для закомментирования любого оставшегося кода, который в противном случае мог бы вызвать ошибку. Последняя строка вывода подтверждает, что сервер базы данных отбросил таблицу.
zh_cn: 此处的SQL注入是终止该语句的学生名称的结果，并包括一个单独的 <code>DROP TABLE</code> 命令； 输入末尾的两个破折号用于注释掉所有否则会导致错误的剩余代码。 输出的最后一行确认数据库服务器已删除该表。

source: The SQL would become:
es: El SQL se convertiría:
ja: SQLになってしまう。
ko: SQL은 다음과 같습니다.
ru: SQL станет:
zh_cn: SQL将成为:

source: The code is mistakenly placing anything the user supplied as the variable. You wanted the SQL to be:
es: El código está colocando erróneamente todo lo que el usuario suministró como la variable.Usted quería que el SQL fuera:
ja: このコードは、ユーザーが指定したものを誤って変数として配置しています。SQLにしたかったのですね。
ko: 코드가 실수로 사용자가 변수로 제공 한 것을 배치하고 있습니다. SQL이되기를 원했습니다.
ru: Код ошибочно помещает в переменную все,что пользователь указал в качестве переменной.Вы хотели,чтобы SQL был:
zh_cn: 这段代码错误地将用户提供的任何东西都作为变量放置。你想要的SQL是。

source: The code to retrieve user name from request is
es: El código para recuperar el nombre de usuario de la solicitud es
ja: リクエストからユーザー名を取得するコードは
ko: 요청에서 사용자 이름을 검색하는 코드는
ru: Код для получения имени пользователя из запроса -
zh_cn: 从请求中获取用户名的代码是

source: The double dash (--) will just comment out remaining part of the query.
es: El doble guión (--)sólo comentará la parte restante de la consulta.
ja: 二重ダッシュ(--)は、クエリの残りの部分をコメントアウトするだけです。
ko: 이중 대시 (-)는 쿼리의 나머지 부분을 주석 처리합니다.
ru: Двойная тире (--)просто прокомментирует оставшуюся часть запроса.
zh_cn: 双破折号(--)只是注释了查询的剩余部分。

source: The first one will do the normal search.
es: El primero hará la búsqueda normal.
ja: 最初の方は通常の検索を行います。
ko: 첫 번째는 일반 검색을 수행합니다.
ru: Первый выполнит обычный поиск.
zh_cn: 前者会做正常的搜索。

source: The original code in the school's program probably looks something like
es: El código original del programa de la escuela probablemente se parece a algo como
ja: 学校のプログラムの元のコードは、おそらく次のようなものでしょう。
ko: 학교 프로그램의 원래 코드는 다음과 같습니다.
ru: Оригинальный код в школьной программе,вероятно,выглядит так.
zh_cn: 学校程序中的原始代码大概是这样的样子

source: The result?
es: ¿El resultado?
ja: 結果は?
ko: 결과?
ru: Результат?
zh_cn: 结果呢?

source: The resultant query becomes
es: La consulta resultante se convierte en
ja: 結果のクエリは次のようになります。
ko: 결과 쿼리는
ru: Результирующий запрос становится
zh_cn: 由此产生的查询变为
