Repository: rueisnom/feedback
Catalog: xlf/33/23/65/332365.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The second one will drop the table student if the account has sufficient privileges (Generally the school admin account will run such query and will have the privileges talked about above).
es: El segundo dejará al estudiante de la mesa si la cuenta tiene suficientes privilegios (Por lo general,la cuenta de administración de la escuela ejecutará dicha consulta y tendrá los privilegios mencionados anteriormente).
ja: 2つ目は、アカウントが十分な権限を持っている場合は、テーブルの学生をドロップします(一般的に学校の管理者アカウントは、このようなクエリを実行し、上記の話の権限を持つことになります)。
ko: 두 번째 계정은 계정에 충분한 권한이있는 경우 테이블 학생을 삭제합니다 (일반적으로 학교 관리자 계정은 이러한 쿼리를 실행하고 위에서 언급 한 권한을 갖습니다).
ru: Второй уронит ученика таблицы,если учетная запись имеет достаточные привилегии (как правило,учетная запись администратора школы выполнит такой запрос и получит привилегии,о которых говорилось выше).
zh_cn: 第二种,如果账号有足够的权限,就会把表学生丢掉(一般来说,学校的管理员账号会运行这样的查询,会有上面讲到的权限)。

source: The semicolon ends the insert command and starts another; the -- comments out the rest of the line. The DROP TABLE command is executed...
es: El punto y coma termina el comando de inserción y comienza otro;el --comenta el resto de la línea.El comando DROP TABLE se ejecuta...
ja: セミコロンはinsertコマンドを終了し、別のコマンドを開始します;--は行の残りの部分をコメントアウトします。DROP TABLEコマンドが実行されます。
ko: 세미콜론은 삽입 명령을 종료하고 다른 명령을 시작합니다. -나머지 줄을 주석으로 처리합니다. DROP TABLE 명령이 실행됩니다 ...
ru: Точка с запятой заканчивается командой вставки и начинается другая;точка с запятой --комментирует оставшуюся часть строки.Команда DROP TABLE выполняется...
zh_cn: 分号结束插入命令并开始另一个命令;----注释了该行的其余部分。DROP TABLE命令被执行.....。

source: The writer of the database probably did a
es: El escritor de la base de datos probablemente hizo un
ja: データベースの作者はおそらく
ko: 데이터베이스 작성자가 아마
ru: Автор базы данных,вероятно,сделал
zh_cn: 数据库的作者可能做了一个

source: Then the resulting SQL string would be this:
es: Entonces la cadena SQL resultante sería esta:
ja: そうすると、結果として得られるSQL文字列は次のようになります。
ko: 그런 다음 결과 SQL 문자열은 다음과 같습니다.
ru: Тогда результирующая SQL-строка была бы такой:
zh_cn: 那么得出的SQL字符串是这样的。

source: This drops (deletes) the student table.
es: Esto deja caer (borra)la mesa de los estudiantes.
ja: 学生テーブルを削除します。
ko: 학생 테이블이 삭제 (삭제)됩니다.
ru: При этом таблица ученика удаляется.
zh_cn: 这样一来,学生表就会被(删除)。

source: This is dangerous as it can nullify password authentication, if present
es: Esto es peligroso ya que puede anular la autentificación de la contraseña,si está presente.
ja: これはパスワード認証を無効にすることができるので危険です。
ko: 비밀번호 인증이있는 경우 비밀번호 인증을 무효화 할 수 있으므로 위험합니다.
ru: Это опасно,так как может свести на нет аутентификацию по паролю,если она присутствует.
zh_cn: 这是很危险的,因为如果存在的话,会使密码认证失效。

source: This is how it works: Lets suppose the administrator is looking for records of student
es: Así es como funciona:Supongamos que el administrador está buscando los registros de los estudiantes
ja: これがその仕組みです。管理者が学生の記録を探しているとします。
ko: 작동 방식 : 관리자가 학생의 기록을 찾고 있다고 가정합니다.
ru: Вот как это работает:Предположим,что администратор ищет записи об ученике.
zh_cn: 这就是它的工作原理。假设管理员正在寻找学生的记录

source: This is the naive way to add text input into a query, and is <em>very bad</em>, as you will see.
es: Esta es la forma ingenua de agregar entradas de texto en una consulta, y es <em>muy mala</em> , como ver&aacute;.
ja: これは、クエリにテキスト入力を追加する素朴な方法であり、後で説明するように<em>非常に悪い方法</em>です。
ko: 이것은 쿼리에 텍스트 입력을 추가하는 순진한 방법이며 보시 <em>다시피 매우 나쁩니다</em> .
ru: Это наивный способ добавить ввод текста в запрос, и, как вы увидите, он <em>очень плохой</em> .
zh_cn: 如您所见，这是将文本输入添加到查询中的简单方法，并且<em>非常糟糕</em> 。

source: This is why bind parameters are a good thing.
es: Por eso los parámetros de unión son algo bueno.
ja: だからこそ、バインドパラメータが良いのです。
ko: 이것이 바인드 매개 변수가 좋은 이유입니다.
ru: Вот почему параметры связывания-это хорошо.
zh_cn: 这就是为什么绑定参数是个好东西。

source: To make it clear what's happening, let's try this with a simple table containing only the name field and add a single row:
es: Para aclarar lo que está sucediendo,intentemos esto con una simple tabla que contenga sólo el campo del nombre y agreguemos una sola fila:
ja: 何が起こっているのかを明確にするために、名前フィールドのみを含むシンプルなテーブルで、1行を追加してみましょう。
ko: 무슨 일이 일어나고 있는지 명확히하기 위해 이름 필드 만 포함하는 간단한 테이블로 시도하고 단일 행을 추가하십시오.
ru: Чтобы прояснить,что происходит,давайте попробуем это сделать с помощью простой таблицы,содержащей только поле имени,и добавим одну строку:
zh_cn: 为了清楚地说明情况,让我们用一个只包含名称字段的简单表格来尝试一下,并添加一行。

source: Try to replace table_name with the real table name. If he get your table name right they would empty your table! <strong>(It is very easy to brut force this URL with simple script)</strong>
es: Intente reemplazar table_name con el nombre real de la tabla. Si acertaba el nombre de su mesa, &iexcl;vaciar&iacute;an su mesa! <strong>(Es muy f&aacute;cil forzar esta URL con un script simple)</strong>
ja: table_nameを実際のテーブル名に置き換えてください。 彼があなたのテーブル名を正しければ、彼らはあなたのテーブルを空にするでしょう！ <strong>（単純なスクリプトでこのURLを強制するのは非常に簡単です）</strong>
ko: table_name을 실제 테이블 이름으로 바꾸십시오. 그가 당신의 테이블 이름을 올바르게 얻는다면 그들은 당신의 테이블을 비울 것입니다! <strong>(단순한 스크립트로이 URL을 강제로 처리하는 것은 매우 쉽습니다)</strong>
ru: Попробуйте заменить table_name реальным именем таблицы. Если он получит правильное название вашей таблицы, они очистят вашу таблицу! <strong>(Очень просто взломать этот URL простым скриптом)</strong>
zh_cn: 尝试用实际的表名替换table_name。 如果他正确设置了您的表名，他们将清空您的表！ <strong>（用简单的脚本强行强制使用此URL很容易）</strong>

source: What does this SQL do:
es: ¿Qué hace este SQL:
ja: このSQLは何をするのか。
ko: 이 SQL의 기능은 무엇입니까?
ru: Что делает этот SQL:
zh_cn: 这个SQL是做什么的。

source: What gets run on the database is this query:
es: Lo que se ejecuta en la base de datos es esta consulta:
ja: データベース上で実行されるのは、このクエリです。
ko: 데이터베이스에서 실행되는 것은 다음 쿼리입니다.
ru: Что запускается в базе данных,так это этот запрос:
zh_cn: 在数据库中运行的是这样的查询。

source: What happens when we insert Little Bobby Tables's name into the table?
es: ¿Qué pasa cuando insertamos el nombre del pequeño Bobby Tablas en la mesa?
ja: リトル・ボビー・テーブルズの名前をテーブルに挿入するとどうなりますか?
ko: Little Bobby Tables 이름을 테이블에 삽입하면 어떻게됩니까?
ru: Что случится,когда мы вставим имя Маленького Бобби Таблиша в стол?
zh_cn: 当我们将小波比表的名字插入到表格中时,会发生什么情况?

source: What you get is:
es: Lo que obtienes es:
ja: あなたが得るものは
ko: 당신이 얻는 것은 :
ru: То,что ты получаешь:
zh_cn: 你得到的是。

source: When we query the table, we get this:
es: Cuando consultamos la mesa,obtenemos esto:
ja: テーブルに問い合わせをすると、こんな感じになります。
ko: 테이블을 쿼리하면 다음과 같은 결과를 얻습니다.
ru: Когда мы запрашиваем таблицу,мы получаем это:
zh_cn: 当我们查询该表时,我们得到这样的结果。

source: You can, however, manipulate an existing SQL statement via SQL injection without having to add a second statement. Let's say you have a login system which checks a username and a password with this simple select:
es: Sin embargo,puede manipular una declaración SQL existente mediante inyección SQL sin tener que añadir una segunda declaración.Digamos que tienes un sistema de acceso que comprueba un nombre de usuario y una contraseña con esta simple selección:
ja: しかし、2つ目のステートメントを追加することなく、SQLインジェクションを使用して既存のSQLステートメントを操作することができます。例えば、このような単純な選択でユーザ名とパスワードをチェックするログインシステムがあるとしましょう。
ko: 그러나 두 번째 명령문을 추가하지 않고도 SQL 삽입을 통해 기존 SQL 문을 조작 할 수 있습니다. 이 간단한 선택으로 사용자 이름과 비밀번호를 확인하는 로그인 시스템이 있다고 가정 해 봅시다.
ru: Однако вы можете манипулировать существующим SQL-оператором с помощью SQL-инъекции без необходимости добавлять второй оператор.Допустим,у вас есть система логина,которая проверяет имя пользователя и пароль с помощью этого простого выбора:
zh_cn: 但是,你可以通过SQL注入来操作现有的SQL语句,而不需要添加第二个语句。假设你有一个登录系统,用这个简单的选择来检查用户名和密码。

source: You don't need to input form data to make SQL injection.
es: No es necesario introducir los datos de los formularios para hacer la inyección SQL.
ja: フォームデータを入力しなくてもSQLインジェクションができます。
ko: SQL 삽입을 위해 양식 데이터를 입력 할 필요가 없습니다.
ru: Вам не нужно вводить данные из формы,чтобы сделать SQL инъекцию.
zh_cn: 你不需要输入表单数据就可以进行SQL注入。

source: Your query would look something like this...
es: Su consulta se vería algo así...
ja: あなたのクエリは次のようになります...
ko: 귀하의 검색어는 다음과 같습니다.
ru: Ваш запрос будет выглядеть так...
zh_cn: 你的询问看起来像这样......

source: Your url would look <a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1</a>
es: Tu url se ver&iacute;a <a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1</a>
ja: あなたのURLは<a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1の</a>ようになります
ko: URL은 <a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1로</a> 보입니다.
ru: Ваш URL будет выглядеть <a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1</a>
zh_cn: 您的网址应为<a href="http://yoursite.com/show?id=1">http://yoursite.com/show?id=1</a>

source: ie. it will terminate early the insert statement, execute whatever malicious code the cracker wants, then comment out whatever remainder of code there might be.
es: es decir,terminará pronto la declaración de inserción,ejecutará cualquier código malicioso que el cracker quiera,y luego comentará cualquier resto de código que pueda haber.
ja: つまり、挿入文を早期に終了させ、クラッカーが望む悪意のあるコードを実行し、残りのコードをコメントアウトします。
ko: 즉. insert 문을 일찍 종료하고 크래커가 원하는 악성 코드를 실행 한 다음 나머지 코드가 있으면 주석 처리합니다.
ru: т.е.он досрочно прекратит вставку,выполнит любой вредоносный код,который захочет взломщик,а затем прокомментирует любой оставшийся код.
zh_cn: 即:它将提前终止插入语句,执行破解者想要的任何恶意代码,然后注释出可能存在的任何剩余代码。

source: which, in plain English, roughly translates to the two queries:
es: que,en inglés,se traduce aproximadamente a las dos preguntas:
ja: これは、平易な英語では、大まかには2つのクエリに翻訳されます。
ko: 일반 영어로 두 가지 쿼리로 대략적으로 번역됩니다.
ru: что,на простом английском,примерно переводится на два запроса:
zh_cn: 用通俗的英语来说,大致可以翻译成两个疑问。
