Repository: rueisnom/feedback
Catalog: xlf/33/23/65/332365.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<em>All code examples in this answer were run on a PostgreSQL 9.1.2 database server.</em>)
es: ( <em>Todos los ejemplos de c&oacute;digo en esta respuesta se ejecutaron en un servidor de base de datos PostgreSQL 9.1.2</em> ) <em>.</em>
ja: （ <em>この回答のすべてのコード例は、PostgreSQL 9.1.2データベースサーバーで実行されました。</em> ）
ko: ( <em>이 답변의 모든 코드 예제는 PostgreSQL 9.1.2 데이터베이스 서버에서 실행되었습니다.</em> )
ru: ( <em>Все примеры кода в этом ответе выполнялись на сервере базы данных PostgreSQL 9.1.2.</em> )
zh_cn: （ <em>此答案中的所有代码示例均在PostgreSQL 9.1.2数据库服务器上运行。</em> ）

source: (for example) to add the new student, where the <code>$xxx</code> variable contents was taken directly out of an HTML form, without checking format nor escaping special characters.
es: (por ejemplo) para agregar el nuevo alumno, donde el contenido de la variable <code>$xxx</code> se tom&oacute; directamente de un formulario HTML, sin verificar el formato ni escapar caracteres especiales.
ja: （たとえば） <code>$xxx</code> 変数の内容がHTMLフォームから直接取り出された新しい学生を追加します。形式をチェックしたり、特殊文字をエスケープしたりすることはありません。
ko: 예를 들어 <code>$xxx</code> 변수 내용이 형식을 확인하거나 특수 문자를 이스케이프하지 않고 HTML 양식에서 직접 가져온 새 학생을 추가합니다.
ru: (например), чтобы добавить нового студента, где содержимое переменной <code>$xxx</code> было взято непосредственно из HTML-формы, без проверки формата или экранирования специальных символов.
zh_cn: （例如）添加新学生，其中 <code>$xxx</code> 变量内容直接从HTML表单中获取，而无需检查格式或转义特殊字符。

source: <em>(Source: <a href="https://xkcd.com/327/">https://xkcd.com/327/</a>)</em>
es: <em>(Fuente: <a href="https://xkcd.com/327/">https://xkcd.com/327/</a> )</em>
ja: <em>（出典： <a href="https://xkcd.com/327/">https</a> : //xkcd.com/327/ ）</em>
ko: <em>(출처 : <a href="https://xkcd.com/327/">https://xkcd.com/327/</a> )</em>
ru: <em>(Источник: <a href="https://xkcd.com/327/">https://xkcd.com/327/</a> )</em>
zh_cn: <em>（来源： <a href="https://xkcd.com/327/">https</a> : //xkcd.com/327/ ）</em>

source: <strong>It drops the students table.</strong>
es: <strong>Se cae la mesa de los alumnos.</strong>
ja: <strong>それは学生のテーブルを落とします。</strong>
ko: <strong>학생 테이블을 떨어 뜨립니다.</strong>
ru: <strong>Это опускает стол студентов.</strong>
zh_cn: <strong>它放下学生桌。</strong>

source: <sup><sup>Edited <strong><em>again</em></strong> as per <a href="https://stackoverflow.com/users/287586/dan04">dan04</a>'s astute comment</sup></sup>
es: <sup><sup>Editado <strong><em>nuevamente</em></strong> seg&uacute;n el astuto comentario de <a href="https://stackoverflow.com/users/287586/dan04">dan04</a></sup></sup>
ja: <sup><sup><a href="https://stackoverflow.com/users/287586/dan04">dan04の慎重</a>なコメントに従って <strong><em>再度</em></strong>編集</sup></sup>
ko: <sup><sup><a href="https://stackoverflow.com/users/287586/dan04">dan04</a> 의 독창적 인 설명에 따라 <strong><em>다시</em></strong> 편집</sup></sup>
ru: <sup><sup>Отредактировано <strong><em>снова</em></strong> в соответствии с проницательным комментарием <a href="https://stackoverflow.com/users/287586/dan04">dan04</a></sup></sup>
zh_cn: <sup><sup>根据<a href="https://stackoverflow.com/users/287586/dan04">dan04</a>的敏锐评论<strong><em>重新</em></strong>编辑</sup></sup>

source: A single quote is the start and end of a string. A semicolon is the end of a statement. So if they were doing a select like this:
es: Una sola cita es el principio y el final de una cadena.Un punto y coma es el final de una declaración.Así que si estuvieran haciendo una selección como esta:
ja: シングルクォートは文字列の先頭と末尾です。セミコロンは文の終わりです。ですから、もし彼らが次のようなセレクトをしていたとします。
ko: 작은 따옴표는 문자열의 시작과 끝입니다. 세미콜론은 문장의 끝입니다. 그래서 그들이 이와 같은 선택을하고 있다면 :
ru: Одиночная кавычка-это начало и конец строки.Точка с запятой-это конец утверждения.Так что,если бы они делали такую выборку:
zh_cn: 单引号是一个字符串的开头和结尾。分号是语句的结尾。所以,如果他们做的是这样的选择。

source: Add a new record to the Students table with a Name value of 'Robert'
es: Añade un nuevo registro a la tabla de estudiantes con un valor de nombre de 'Robert'.
ja: 学生テーブルに名前の値が「Robert」の新しいレコードを追加します。
ko: 이름 값이 'Robert'인 Students 테이블에 새 레코드를 추가하십시오.
ru: Добавьте новую запись в таблицу "Студенты" со значением имени "Роберт".
zh_cn: 在学生表中添加一条新记录,名称为'Robert'。

source: After the values from the first name, middle name textbox <em>FNMName.Text</em> (which is <code>Robert'); DROP TABLE STUDENTS; --</code>) and the last name textbox <em>LName.Text</em> (let's call it <code>Derper</code>) are concatenated with the rest of the query, the result is now actually <em>two queries</em> separated by the <a href="http://en.wikipedia.org/wiki/SQL#Language_elements">statement terminator</a> (semicolon). The second query has been <strong>injected</strong> into the first. When the code executes this query against the database, it will look like this
es: Despu&eacute;s de los valores del primer nombre, cuadro de texto del segundo nombre <em>FNMName.Text</em> (que es <code>Robert'); DROP TABLE STUDENTS; --</code> ESTUDIANTES DE CUADRO - ) y el cuadro de texto de apellido <em>LName.Text</em> (llam&eacute;moslo <code>Derper</code> ) se concatenan con el resto de la consulta, el resultado ahora es en realidad <em>dos consultas</em> separadas por el <a href="http://en.wikipedia.org/wiki/SQL#Language_elements">terminador de sentencia</a> (punto y coma). La segunda consulta se ha <strong>inyectado</strong> en la primera. Cuando el c&oacute;digo ejecuta esta consulta en la base de datos, se ver&aacute; as&iacute;
ja: 名、ミドルネームのテキストボックス<em>FNMName.Text</em> （ <code>Robert'); DROP TABLE STUDENTS; --</code> の値の後に、 ドロップテーブルの生徒; - ）と姓のテキストボックス<em>LName.Text</em> （ <em>Derper</em>と呼ぶことにし <code>Derper</code> ）が残りのクエリと連結され、結果は実際には<a href="http://en.wikipedia.org/wiki/SQL#Language_elements">ステートメントターミネーター</a> （セミコロン）で区切られた<em>2つのクエリになり</em>ます。 2番目のクエリは最初のクエリに<strong>挿入さ</strong>れています。 コードがデータベースに対してこのクエリを実行すると、次のようになります。
ko: 이름의 값 뒤에 중간 이름 텍스트 상자 <em>FNMName.Text</em> ( <code>Robert'); DROP TABLE STUDENTS; --</code> 드롭 테이블 학생; - )와 성 텍스트 상자 <em>LName.Text</em> ( <em>Derper</em> 라고 함)는 나머지 쿼리와 연결되며 결과는 실제로 <a href="http://en.wikipedia.org/wiki/SQL#Language_elements">명령문 종료 자</a> (세미콜론)로 구분 된 <em>두 개의 쿼리</em> 입니다. 두 번째 쿼리는 첫 번째 쿼리에 <strong>삽입</strong> 되었습니다. 코드가 데이터베이스에 대해이 쿼리를 실행하면 다음과 같이 나타납니다.
ru: После значений из имени, отчество текстовое поле <em>FNMName.Text</em> (что <code>Robert'); DROP TABLE STUDENTS; --</code> КАПЛИ СТОЛБОВ; - ) и текстовое поле фамилии <em>LName.Text</em> (назовем его <code>Derper</code> ) объединяются с остальной частью запроса, в результате теперь фактически <em>два запроса</em> разделены <a href="http://en.wikipedia.org/wiki/SQL#Language_elements">оператором-</a> разделителем (точка с запятой). Второй запрос был <strong>введен</strong> в первый. Когда код выполняет этот запрос к базе данных, он будет выглядеть так
zh_cn: 在名字的值之后，中间名称文本框<em>FNMName.Text</em> （是 <code>Robert'); DROP TABLE STUDENTS; --</code> 拖放表学生； - ）和姓氏文本框<em>LName.Text</em> （我们称其为 <code>Derper</code> ）与其余查询串联在一起，结果实际上是<em>两个查询，</em>由<a href="http://en.wikipedia.org/wiki/SQL#Language_elements">语句终止符</a> （分号）分隔。 第二个查询已<strong>注入</strong>到第一个查询中。 当代码对数据库执行此查询时，它将看起来像这样

source: And someone enters the name <code>Robert'); DROP TABLE STUDENTS; --</code>
es: Y alguien ingresa el nombre <code>Robert'); DROP TABLE STUDENTS; --</code> ESTUDIANTES DE TABLA DE GOTA; -
ja: そして誰かが <code>Robert'); DROP TABLE STUDENTS; --</code> という名前を入力します '）; ドロップテーブルの生徒; -
ko: 그리고 누군가 <code>Robert'); DROP TABLE STUDENTS; --</code> 이름을 입력 ); 드롭 테이블 학생; -
ru: И кто-то вводит имя <code>Robert'); DROP TABLE STUDENTS; --</code> КАПЛИ СТОЛБОВ; -
zh_cn: 有人输入 <code>Robert'); DROP TABLE STUDENTS; --</code> 的名字； 拖放表学生； -

source: As everyone else has pointed out already, the <code>');</code> closes the original statement and then a second statement follows. Most frameworks, including languages like PHP, have default security settings by now that don't allow multiple statements in one SQL string. In PHP, for example, you can only run multiple statements in one SQL string by using the <code>mysqli_multi_query</code> function.
es: Como todos los dem&aacute;s ya han se&ntilde;alado, el <code>');</code> cierra la declaraci&oacute;n original y luego sigue una segunda declaraci&oacute;n. La mayor&iacute;a de los marcos, incluidos los lenguajes como PHP, tienen configuraciones de seguridad predeterminadas que no permiten m&uacute;ltiples sentencias en una cadena SQL. En PHP, por ejemplo, solo puede ejecutar varias declaraciones en una cadena SQL utilizando la funci&oacute;n <code>mysqli_multi_query</code> .
ja: 他の皆がすでに指摘したように、 <code>');</code> 元のステートメントを閉じてから、2番目のステートメントが続きます。 PHPなどの言語を含むほとんどのフレームワークには、デフォルトのセキュリティ設定があり、1つのSQL文字列で複数のステートメントを使用することはできません。 たとえば、PHPでは、 <code>mysqli_multi_query</code> 関数を使用して1つのSQL文字列で複数のステートメントのみを実行できます。
ko: 다른 사람들이 이미 지적했듯이 <code>');</code> 원래 문장을 닫고 두 번째 문장이 이어집니다. PHP와 같은 언어를 포함한 대부분의 프레임 워크에는 기본 보안 설정이있어 하나의 SQL 문자열에 여러 명령문을 허용하지 않습니다. 예를 들어, PHP에서는 <code>mysqli_multi_query</code> 함수를 사용하여 하나의 SQL 문자열에서만 여러 명령문을 실행할 수 있습니다.
ru: Как уже отмечали все остальные, <code>');</code> закрывает исходное утверждение, а затем следует второе утверждение. Большинство фреймворков, в том числе такие языки, как PHP, к настоящему времени имеют настройки безопасности по умолчанию, которые не позволяют использовать несколько операторов в одной строке SQL. Например, в PHP вы можете выполнять несколько операторов в одной строке SQL только с <code>mysqli_multi_query</code> функции mysqli_multi_query .
zh_cn: 正如其他人已经指出的那样， <code>');</code> 关闭原始语句，然后再执行第二条语句。 到目前为止，大多数框架（包括PHP之类的语言）都具有默认的安全设置，这些设置不允许在一个SQL字符串中包含多个语句。 例如，在PHP中，只能使用 <code>mysqli_multi_query</code> 函数在一个SQL字符串中运行多个语句。

source: As noted by the XKCD comic, one way of protecting against SQL injection attacks is to sanitize database inputs, such as by escaping special characters, so that they cannot modify the underlying SQL command and therefore cannot cause execution of arbitrary SQL code. If you use parameterized queries, such as by using <a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"><code>SqlParameter</code></a> in ADO.NET, the input will, at minimum, be automatically sanitized to guard against SQL injection.
es: Como se&ntilde;al&oacute; el c&oacute;mic XKCD, una forma de protegerse contra los ataques de inyecci&oacute;n SQL es desinfectar las entradas de la base de datos, como escapar caracteres especiales, para que no puedan modificar el comando SQL subyacente y, por lo tanto, no puedan causar la ejecuci&oacute;n de c&oacute;digo SQL arbitrario. Si utiliza consultas parametrizadas, como mediante el uso de <a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"> <code>SqlParameter</code> </a> en ADO.NET, la entrada, como m&iacute;nimo, se desinfectar&aacute; autom&aacute;ticamente para evitar la inyecci&oacute;n de SQL.
ja: XKCDコミックで述べられているように、SQLインジェクション攻撃から保護する1つの方法は、特殊文字をエスケープするなどしてデータベース入力をサニタイズすることです。これにより、特殊文字が基礎となるSQLコマンドを変更できなくなり、任意のSQLコードを実行できなくなります。 ADO.NETで<a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"> <code>SqlParameter</code> </a>を使用するなど、パラメーター化されたクエリを使用する場合、SQLインジェクションを防ぐために、入力は少なくとも自動的にサニタイズされます。
ko: XKCD 만화에서 알 수 있듯이 SQL 삽입 공격을 방지하는 한 가지 방법은 특수 문자를 이스케이프 처리하는 등의 방법으로 기본 SQL 명령을 수정할 수 없으므로 임의의 SQL 코드가 실행될 수 없도록 데이터베이스 입력을 삭제하는 것입니다. ADO.NET에서 <a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"> <code>SqlParameter</code> </a> 를 사용하는 등의 매개 변수화 된 쿼리를 사용하는 경우 SQL 주입을 방지하기 위해 최소한 입력이 자동으로 삭제됩니다.
ru: Как отмечалось в комиксе XKCD, одним из способов защиты от атак с использованием SQL-инъекций является очистка входных данных базы данных, например, путем экранирования специальных символов, чтобы они не могли изменить базовую команду SQL и, следовательно, не могли вызвать выполнение произвольного кода SQL. Если вы используете параметризованные запросы, такие как <a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"> <code>SqlParameter</code> </a> в ADO.NET, входные данные, как минимум, будут автоматически очищены для защиты от внедрения SQL.
zh_cn: 正如XKCD漫画所指出的那样，防止SQL注入攻击的一种方法是对数据库输入进行清理，例如转义特殊字符，以使它们无法修改基础SQL命令，从而不会导致执行任意SQL代码。 如果使用参数化查询（例如通过在ADO.NET中使用<a href="http://msdn.microsoft.com/en-us/library/yy6y35y8.aspx"> <code>SqlParameter</code> </a> ），则输入将至少自动进行清理以防止SQL注入。

source: But a clever user can supply whatever they want:
es: Pero un usuario inteligente puede suministrar lo que quiera:
ja: しかし、賢いユーザーは、彼らが望むものを何でも供給することができます。
ko: 그러나 영리한 사용자는 원하는 것을 제공 할 수 있습니다.
ru: Но умный пользователь может поставлять все,что захочет:
zh_cn: 但聪明的用户可以提供他们想要的东西。

source: Delete the Students table
es: Eliminar la mesa de los estudiantes
ja: 学生」テーブルを削除します。
ko: 학생 테이블 삭제
ru: Удалить таблицу "Студенты
zh_cn: 删除学生表

source: Everything past the second query is <a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">marked as a comment</a>: <code>--', 'Derper')</code>
es: Todo lo que haya pasado la segunda consulta se <a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">marca como un comentario</a> : <code>--', 'Derper')</code>
ja: 2番目のクエリを過ぎたものはすべて<a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">コメントとしてマークされ</a>ます： <code>--', 'Derper')</code>
ko: 두 번째 쿼리 이후의 모든 내용 <a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">은 주석으로 표시됩니다</a> <code>--', 'Derper')</code>
ru: Все после второго запроса <a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">помечается как комментарий</a> : <code>--', 'Derper')</code>
zh_cn: 第二个查询之后的所有内容都<a href="http://msdn.microsoft.com/en-us/library/ms181627.aspx">标记为注释</a> ： <code>--', 'Derper')</code>

source: Everything's fine. Now imagine you provide this string as the password:
es: Todo está bien.Ahora imagina que proporcionas esta cadena como la contraseña:
ja: 問題ありません。この文字列をパスワードとして入力すると想像してみてください。
ko: 다 좋아. 이제이 문자열을 암호로 제공한다고 가정하십시오.
ru: Все в порядке.Теперь представьте,что вы предоставляете эту строку в качестве пароля:
zh_cn: 一切都很好。现在想象一下,你提供这个字符串作为密码。

source: Example of PHP vulnerable code using PDO:
es: Ejemplo de código vulnerable de PHP usando PDO:
ja: PDOを使ったPHPの脆弱性コードの例。
ko: PDO를 사용하는 PHP 취약한 코드의 예 :
ru: Пример уязвимого кода PHP с использованием PDO:
zh_cn: 使用PDO的PHP漏洞代码示例。

source: FWIW, I also think the comic in question has an important detail wrong: if you're thinking about <em>sanitizing</em> your database inputs, as the comic suggests, you're still doing it wrong. Instead, you should think in terms of <em>quarantining</em> your database inputs, and the correct way to do this is via parameterized queries.
es: FWIW, tambi&eacute;n creo que el c&oacute;mic en cuesti&oacute;n tiene un detalle importante incorrecto: si est&aacute; pensando en <em>desinfectar las</em> entradas de su base de datos, como sugiere el c&oacute;mic, todav&iacute;a lo est&aacute; haciendo mal. En cambio, debe pensar en t&eacute;rminos de <em>poner</em> en <em>cuarentena las</em> entradas de su base de datos, y la forma correcta de hacerlo es mediante consultas parametrizadas.
ja: FWIW、私はまた、問題のコミックに重要な詳細が間違っていると思います。データベースの入力を<em>サニタイズ</em>することを考えている場合、コミックが示唆しているように、それはまだ間違っています。 代わりに、データベース入力の<em>隔離</em>という観点から考える必要があります。これを行う正しい方法は、パラメーター化されたクエリを使用することです。
ko: FWIW, 나는 또한 문제의 만화가 중요한 세부 사항이 잘못되었다고 생각합니다. 만화가 제안한 것처럼 데이터베이스 입력을 <em>살균</em> 하는 것에 대해 생각하고 있다면 여전히 잘못하고 있습니다. 대신 데이터베이스 입력을 <em>격리</em> 하는 관점에서 생각해야하며이를 수행하는 올바른 방법은 매개 변수화 된 쿼리를 사용하는 것입니다.
ru: FWIW, я также думаю, что в комиксе есть неправильная важная деталь: если вы думаете о <em>дезинфекции</em> входных данных вашей базы данных, как предлагает комикс, вы все равно делаете это неправильно. Вместо этого вы должны думать с точки зрения <em>карантина</em> входных данных вашей базы данных, и правильный способ сделать это - через параметризованные запросы.
zh_cn: FWIW，我还认为所涉及的漫画有一个重要的细节错误：如果您正在考虑<em>清理</em>数据库输入（正如漫画所暗示的那样），那么您仍然做错了。 相反，您应该考虑<em>隔离</em>数据库输入，而正确的方法是通过参数化查询。

source: How does the SQL injection from the “Bobby Tables” XKCD comic work
es: ¿Cómo funciona la inyección SQL del cómic XKCD "Tablas de Bobby"?
ja: どのように "ボビーのテーブル "XKCDコミックからのSQLインジェクションは動作します。
ko: "Bobby Tables"XKCD 만화에서 SQL 삽입은 어떻게 작동합니까
ru: Как работает SQL-инъекция из комикса "Bobby Tables" XKCD
zh_cn: 波比表》XKCD漫画中的SQL注入是如何进行的?

source: However, sanitizing inputs at the application level may not stop more advanced SQL injection techniques. For example, <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string">there are ways to circumvent the <code>mysql_real_escape_string</code> PHP function</a>. For added protection, many database systems support <a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>prepared statements</em></a>. If properly implemented in the backend, prepared statements can make SQL injection impossible by treating data inputs as semantically separate from the rest of the command.
es: Sin embargo, las entradas de desinfecci&oacute;n a nivel de aplicaci&oacute;n pueden no detener las t&eacute;cnicas de inyecci&oacute;n SQL m&aacute;s avanzadas. Por ejemplo, <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string">hay formas de eludir la funci&oacute;n PHP <code>mysql_real_escape_string</code> </a> . Para mayor protecci&oacute;n, muchos sistemas de bases de datos admiten <a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>declaraciones preparadas</em></a> . Si se implementa correctamente en el backend, las declaraciones preparadas pueden hacer que la inyecci&oacute;n de SQL sea imposible al tratar las entradas de datos como sem&aacute;nticamente separadas del resto del comando.
ja: ただし、アプリケーションレベルで入力をサニタイズしても、より高度なSQLインジェクションテクニックを停止できない場合があります。 たとえば、 <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string">PHP関数 <code>mysql_real_escape_string</code> を回避する方法があります</a> 。 保護を強化するために、多くのデータベースシステムは<a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>準備済みステートメントを</em></a>サポート<em>してい</em>ます。 バックエンドで適切に実装されている場合、準備されたステートメントは、データ入力をコマンドの残りの部分から意味的に分離して扱うことにより、SQLインジェクションを不可能にする可能性があります。
ko: 그러나 응용 프로그램 수준에서 입력을 삭제해도 고급 SQL 주입 기술이 중단되지 않을 수 있습니다. 예를 들어, <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string"> <code>mysql_real_escape_string</code> PHP 함수를 우회하는 방법이 있습니다</a> . 추가 보호를 위해 많은 데이터베이스 시스템이 <a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>준비된 명령문을</em></a> 지원 <em>합니다</em> . 백엔드에서 올바르게 구현 된 경우 준비된 명령문은 데이터 입력을 의미 적으로 나머지 명령과 분리하여 처리하여 SQL 삽입을 불가능하게 할 수 있습니다.
ru: Однако очистка входных данных на уровне приложений может не остановить более продвинутые методы внедрения SQL. Например, <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string">есть способы обойти PHP-функцию <code>mysql_real_escape_string</code> </a> . Для дополнительной защиты многие системы баз данных поддерживают <a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>подготовленные операторы</em></a> . При правильной реализации в бэкэнде подготовленные операторы могут сделать внедрение SQL невозможным, обрабатывая ввод данных как семантически отдельный от остальной части команды.
zh_cn: 但是，在应用程序级别清理输入可能不会停止更高级的SQL注入技术。 例如， <a href="https://stackoverflow.com/questions/5741187/sql-injection-that-gets-around-mysql-real-escape-string">有一些方法可以绕过 <code>mysql_real_escape_string</code> PHP函数</a> 。 为了增加保护，许多数据库系统都支持<a href="https://en.wikipedia.org/wiki/Prepared_statement"><em>预备语句</em></a> 。 如果在后端正确实现，则预备语句可以通过将数据输入与其余命令在语义上分开来使SQL注入无法进行。

source: I know both <code>'</code> and <code>--</code> are for comments, but doesn't the word <code>DROP</code> get commented as well since it is part of the same line?
es: S&eacute; que ambos y <code>--</code> son para comentarios, pero &iquest;no se comenta tambi&eacute;n la palabra <code>DROP</code> ya que es parte de la misma l&iacute;nea?
ja: <code>'</code> と <code>--</code> 両方がコメント用であることはわかっていますが、 <code>DROP</code> という単語は同じ行の一部なのでコメントもされませんか？
ko: 나는 <code>'</code> 와 <code>--</code> 가 모두 주석 이라는 것을 알고 있지만 같은 줄의 일부이기 때문에 <code>DROP</code> 이라는 단어도 주석을 달지 않습니까?
ru: Я знаю, что <code>'</code> и <code>--</code> для комментариев, но разве слово <code>DROP</code> тоже не комментируется, поскольку оно является частью одной строки?
zh_cn: 我知道 <code>'</code> 和 <code>--</code> 都是注释，但是 <code>DROP</code> 这个词不是同一行的一部分吗？

source: INSERT INTO Students VALUES ( '
es: INSERTAR EN LOS VALORES DE LOS ESTUDIANTES('
ko: 학생의 가치관에 삽입 ( '
ru: ИНСЕРТ В СТУДЕНЧЕСКИХ ЦЕНАХ(''
zh_cn: INSERT INTO Student VALUES('

source: If student_name is the one given, that does the selection with the name "Robert" and then drops the table. The "-- " part changes the rest of the given query into a comment.
es: Si el nombre del estudiante es el que se da,eso hace la selección con el nombre "Robert" y luego deja caer la tabla.La parte "--" cambia el resto de la consulta dada en un comentario.
ja: student_nameが指定されたものであれば、"Robert "という名前の選択を行い、テーブルを削除します。"--"の部分は、与えられたクエリの残りの部分をコメントに変更します。
ko: student_name이 주어진 이름이면 "Robert"라는 이름으로 선택을 수행 한 다음 테이블을 삭제합니다. "-"부분은 주어진 쿼리의 나머지 부분을 주석으로 변경합니다.
ru: Если задано имя student_name,то это делает выбор с именем "Robert",а затем бросает таблицу.Часть "--" превращает оставшуюся часть заданного запроса в комментарий.
zh_cn: 如果给定的是 student_name,则以 "Robert "为名进行选择,然后丢弃该表。"---"部分会将给定查询的其余部分改变为注释。

source: If you provide <code>peter</code> as the username and <code>secret</code> as the password, the resulting SQL string would look like this:
es: Si proporciona <code>peter</code> como nombre de usuario y <code>secret</code> o como contrase&ntilde;a, la cadena SQL resultante se ver&iacute;a as&iacute;:
ja: ユーザー名に <code>peter</code> を、パスワードに <code>secret</code> を指定すると、結果のSQL文字列は次のようになります。
ko: <code>peter</code> 을 사용자 이름으로 제공하고 <code>secret</code> 을 암호로 제공하면 결과 SQL 문자열은 다음과 같습니다.
ru: Если вы <code>peter</code> качестве имени пользователя и <code>secret</code> в качестве пароля, результирующая строка SQL будет выглядеть следующим образом:
zh_cn: 如果提供 <code>peter</code> 作为用户名并提供 <code>secret</code> 作为密码，则生成的SQL字符串将如下所示：

source: In this case, ' is not a comment character. It's used to delimit string literals. The comic artist is banking on the idea that the school in question has dynamic sql somewhere that looks something like this:
es: En este caso,no es un personaje de comentario.Se usa para delimitar los literales de la cadena.El dibujante de cómics se basa en la idea de que la escuela en cuestión tiene un cuadrado dinámico en algún lugar que se parece a esto:
ja: この場合、'はコメント文字ではありません。これは文字列リテラルの区切りに使われます。この漫画家は、問題の学校がどこかにこのような動的なSQLを持っているという考えに基づいています。
ko: 이 경우 '는 주석 문자가 아닙니다. 문자열 리터럴을 구분하는 데 사용됩니다. 만화가는 문제의 학교에 다음과 같은 동적 SQL이 있다고 생각합니다.
ru: В данном случае ' не является символом комментария.Он используется для разграничения строковых литералов.Художник комиксов делает ставку на идею,что в данной школе есть динамический sql,который выглядит примерно так:
zh_cn: 在这种情况下,'不是注释字符。它是用来分隔字符串的字面意义。漫画家是基于这样的想法,即该学校有一个动态的sql,看起来像这样。
