Repository: rueisnom/feedback
Catalog: xlf/26/70/09/24/26700924.*.001.xlf
Languages: es, ja, ko, zh_cn

source: Using <a href="https://www.firebase.com/docs/beta/queries/web.html">Firebase's Query API</a>, you might be tempted to try this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font><a href="https://www.firebase.com/docs/beta/queries/web.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la API de consulta de Firebase</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede tener la tentaci&oacute;n de probar esto:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://www.firebase.com/docs/beta/queries/web.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">FirebaseのQuery API</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">すると、これを試してみたくなるかもしれません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용 </font></font><a href="https://www.firebase.com/docs/beta/queries/web.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">중포 기지의 쿼리 API를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 당신이 시도 유혹 될 수 있습니다</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><a href="https://www.firebase.com/docs/beta/queries/web.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firebase的Query API</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您可能会想尝试以下方法：</font></font>

source: What options do I have?
es: ¿Qué opciones tengo?
ja: どのような選択肢があるのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 옵션이 있습니까?</font></font>
zh_cn: 我有哪些选择?

source: What you <em>can</em> do is execute one <code>orderBy().startAt()./endAt()</code> on the server, pull down the remaining data and filter that in JavaScript code on your client.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Lo que </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">puede</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hacer es ejecutar un </font></font> <code>orderBy().startAt()./endAt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el servidor, extraiga los datos restantes y filtre eso en el c&oacute;digo JavaScript en su cliente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたが</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">することができ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません、1つ実行している</font></font> <code>orderBy().startAt()./endAt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クライアント上のJavaScriptコードであること、サーバー上に残っているデータとフィルタプルダウン。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">할 수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 것은 하나의 실행이다 </font></font> <code>orderBy().startAt()./endAt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서버, 클라이언트에서 그 자바 스크립트 코드에 남아있는 데이터 및 필터 풀다운.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做的是</font><font style="vertical-align: inherit;">在服务器上</font><font style="vertical-align: inherit;">执行一个</font></font> <code>orderBy().startAt()./endAt()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，下拉剩余的数据，然后在客户端的JavaScript代码中进行过滤。</font></font>

source: Yet another alternative is to do what we've all done before this new Query API was added: create an index in a different node:
es: Otra alternativa es hacer lo que todos hemos hecho antes de que se añadiera esta nueva API de consulta:crear un índice en un nodo diferente:
ja: もう一つの方法は、この新しい Query API が追加される前に私たちが行っていたこと、つまり別のノードにインデックスを作成することです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른 대안은이 새로운 Query API가 추가되기 전에 우리가 한 모든 작업을 수행하는 것입니다. 다른 노드에서 색인을 작성하십시오.</font></font>
zh_cn: 然而,另一种选择是在这个新的Query API添加之前我们都做过的事情:在不同的节点中创建一个索引。

source: You can create a <code>filters</code> field to add you filters. You can add as many values as you need. For example to filter by <em>comedy</em> and <em>Jack Nicholson</em> you can add the value <code>comedy_Jack Nicholson</code> but if you also you want to by <em>comedy</em> and <em>2014</em> you can add the value <code>comedy_2014</code> without creating more fields.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede crear un </font><font style="vertical-align: inherit;">campo de </font></font> <code>filters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para agregar sus filtros. </font><font style="vertical-align: inherit;">Puede agregar tantos valores como necesite. </font><font style="vertical-align: inherit;">Por ejemplo, para filtrar por </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">comedia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jack Nicholson</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede agregar el valor </font></font> <code>comedy_Jack Nicholson</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pero si tambi&eacute;n lo desea por </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">comedia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2014</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede agregar el valor </font></font> <code>comedy_2014</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sin crear m&aacute;s campos.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>filters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールドを</font><font style="vertical-align: inherit;">作成して、</font><font style="vertical-align: inherit;">フィルター</font><font style="vertical-align: inherit;">を追加できます。</font><font style="vertical-align: inherit;">必要な数の値を追加できます。</font><font style="vertical-align: inherit;">たとえば、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コメディ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ジャックニコルソンで</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィルタリング</font><font style="vertical-align: inherit;">するには、</font></font> <code>comedy_Jack Nicholson</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という値を追加できますが</font><font style="vertical-align: inherit;">、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コメディ</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2014で</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">追加し</font><font style="vertical-align: inherit;">たい</font><font style="vertical-align: inherit;">場合は、</font><font style="vertical-align: inherit;">フィールドを</font><font style="vertical-align: inherit;">追加</font><font style="vertical-align: inherit;">せずに</font><em><font style="vertical-align: inherit;">コメディ</font></em></font> <code>comedy_2014</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という値を追加でき</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>filters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 필드를 </font><font style="vertical-align: inherit;">만들어 </font><font style="vertical-align: inherit;">필터</font><font style="vertical-align: inherit;"> 를 추가 할 수 있습니다. </font><font style="vertical-align: inherit;">필요한만큼 값을 추가 할 수 있습니다. </font><font style="vertical-align: inherit;">예를 들어 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코미디</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잭 니콜슨</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 기준으로 필터링 </font><font style="vertical-align: inherit;">하려면 </font></font> <code>comedy_Jack Nicholson</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값을 추가 할 수 </font><font style="vertical-align: inherit;">있지만 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코미디</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2014</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><em><font style="vertical-align: inherit;">기준으로</font></em><font style="vertical-align: inherit;"> 추가 </font><font style="vertical-align: inherit;">필드를 만들지 않고 </font></font> <code>comedy_2014</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값을 추가 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以创建一个</font></font> <code>filters</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">字段以添加过滤器。</font><font style="vertical-align: inherit;">您可以根据需要添加任意多个值。</font><font style="vertical-align: inherit;">例如，按</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">喜剧</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jack Nicholson</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行过滤，</font><font style="vertical-align: inherit;">您可以添加值</font></font> <code>comedy_Jack Nicholson</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但如果您也希望按</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">喜剧</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2014</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行过滤，</font><font style="vertical-align: inherit;">则</font><font style="vertical-align: inherit;">可以添加值</font></font> <code>comedy_2014</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不创建更多字段。</font></font>

source: You could even do relative/range queries, let's say that you want to allow querying movies by category and year. You'd use this data structure:
es: Incluso podrías hacer consultas de rango relativo,digamos que quieres permitir la consulta de películas por categoría y año.Usarías esta estructura de datos:
ja: relativerangeクエリを行うこともできます。例えば、映画をカテゴリと年で検索できるようにしたいとします。このようなデータ構造を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상대 / 범위 쿼리를 수행 할 수도 있습니다. 카테고리 및 연도별로 영화 쿼리를 허용한다고 가정 해 봅시다. </font><font style="vertical-align: inherit;">이 데이터 구조를 사용합니다.</font></font>
zh_cn: 你甚至可以做关联查询,比如说你想允许按类别和年份查询电影。你会使用这样的数据结构。

source: You're essentially building your own multi-column index that way and can query it with:
es: Esencialmente estás construyendo tu propio índice multicolumna de esa manera y puedes consultarlo con:
ja: このようにして自分自身のマルチカラムインデックスを構築し、それを使ってクエリを実行することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">본질적으로 그런 식으로 자신의 다중 열 인덱스를 작성하고 다음을 사용하여 쿼리 할 수 ​​있습니다.</font></font>
zh_cn: 你本质上是在建立自己的多列索引,可以用这种方式查询。

source: multiple <code>orderBy()</code> calls will throw an error
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&uacute;ltiples </font><font style="vertical-align: inherit;">llamadas de </font></font> <code>orderBy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> arrojar&aacute;n un error</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">複数の</font></font> <code>orderBy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出しはエラーをスローします</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 </font></font> <code>orderBy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출에서 오류가 발생합니다</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多个</font></font> <code>orderBy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用将引发错误</font></font>
