Repository: rueisnom/feedback
Catalog: xlf/26/70/09/24/26700924.*.001.xlf
Languages: es, ja, ko, zh_cn

source: 1. filter most on the server, do the rest on the client
es: 1.filtrar la mayoría en el servidor,hacer el resto en el cliente
ja: 1.大部分をサーバーでフィルタリングし、残りはクライアントで行う
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. 서버에서 대부분을 필터링하고 클라이언트에서 나머지를 수행하십시오.</font></font>
zh_cn: 1.在服务器上过滤大部分,其余的在客户端上进行过滤

source: 2. add a property that combines the values that you want to filter on
es: 2.Añade una propiedad que combina los valores que quieres filtrar
ja: フィルタリングしたい値を組み合わせたプロパティを追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. 필터링 할 값을 결합한 속성을 추가하십시오.</font></font>
zh_cn: 2.添加一个属性,结合你要过滤的值,在

source: 3. create a custom index programmatically
es: 3.crear un índice personalizado de forma programada
ja: 3.プログラムでカスタムインデックスを作成する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. 프로그래밍 방식으로 맞춤 색인 만들기</font></font>
zh_cn: 3.按程序创建一个自定义索引

source: <strong>Meet Querybase!</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Conoce Querybase!</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クエリベースに会います！</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Querybase를 만나십시오!</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">认识Querybase！</font></font></strong>

source: <strong>Once we obtain the initial filtered data from the database, we need to do further filter in our backend.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una vez que obtengamos los datos filtrados iniciales de la base de datos, necesitamos hacer m&aacute;s filtros en nuestro backend.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">データベースから最初のフィルター処理されたデータを取得したら、バックエンドでさらにフィルター処理を行う必要があります。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스에서 초기 필터링 된 데이터를 얻으면 백엔드에서 추가 필터링을 수행해야합니다.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从数据库中获取初始过滤后的数据后，我们需要在后端进行进一步的过滤。</font></font></strong>

source: <strong>We need to download the initial filtered data from the database and store it in an array list.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Necesitamos descargar los datos filtrados iniciales de la base de datos y almacenarlos en una lista de matriz.</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初のフィルター処理されたデータをデータベースからダウンロードして、配列リストに格納する必要があります。</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터베이스에서 필터링 된 초기 데이터를 다운로드하여 배열 목록에 저장해야합니다.</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们需要从数据库下载初始过滤的数据，并将其存储在数组列表中。</font></font></strong>

source: A very special variant of this is implemented by the <a href="https://github.com/firebase/geofire-js">GeoFire library for Firebase</a>. This library combines the latitude and longitude of a location into a so-called <a href="https://en.wikipedia.org/wiki/Geohash">Geohash</a>, which can then be used to do realtime range queries on Firebase.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una variante muy especial de esto es implementada por la </font></font><a href="https://github.com/firebase/geofire-js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">biblioteca GeoFire para Firebase</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esta biblioteca combina la latitud y la longitud de una ubicaci&oacute;n en un llamado </font></font><a href="https://en.wikipedia.org/wiki/Geohash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Geohash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que luego se puede usar para realizar consultas de rango en tiempo real en Firebase.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これの非常に特殊なバリアントは</font></font><a href="https://github.com/firebase/geofire-js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、FirebaseのGeoFireライブラリ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">によって実装され</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">このライブラリは、場所の緯度と経度をいわゆる</font></font><a href="https://en.wikipedia.org/wiki/Geohash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Geohash</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">結合し、</font><font style="vertical-align: inherit;">Firebaseでリアルタイムの範囲クエリを実行するために使用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">매우 특별한 변형은 </font></font><a href="https://github.com/firebase/geofire-js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firebase 용 GeoFire 라이브러리에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의해 구현됩니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 라이브러리는 위치의 위도와 경도를 소위 </font></font><a href="https://en.wikipedia.org/wiki/Geohash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Geohash로 결합한</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음 Firebase에서 실시간 범위 쿼리를 수행하는 데 사용할 수 있습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是一个非常特殊的变体，由</font></font><a href="https://github.com/firebase/geofire-js"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firebase</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font><font style="vertical-align: inherit;">GeoFire库实现</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">该库将位置的纬度和经度组合到一个所谓的</font></font><a href="https://en.wikipedia.org/wiki/Geohash"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Geohash中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后可用于在Firebase上进行实时范围查询。</font></font>

source: And then query for comedies of the 90s with:
es: Y luego buscar comedias de los 90 con:
ja: そして、90年代のコメディを検索します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 90 년대 코미디를 요청하십시오 :</font></font>
zh_cn: 然后查询90年代的喜剧片与。

source: But as @RobDiMarco from Firebase says in the comments:
es: Pero como @RobDiMarco de la Base de Fuego dice en los comentarios:
ja: しかし、Firebaseの@RobDiMarcoさんがコメントで言っているように
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 Firebase의 @RobDiMarco는 주석에서 다음과 같이 말합니다.</font></font>
zh_cn: 但正如Firebase的@RobDiMarco在评论中所说。

source: David East has written a <a href="https://github.com/davideast/Querybase">library called QueryBase that helps with generating such properties</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">David East ha escrito una </font></font><a href="https://github.com/davideast/Querybase"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">biblioteca llamada QueryBase que ayuda a generar tales propiedades</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">David Eastは、</font></font><a href="https://github.com/davideast/Querybase"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このようなプロパティの生成に役立つQueryBaseと呼ばれるライブラリ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を作成しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">David East는 </font></font><a href="https://github.com/davideast/Querybase"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 속성을 생성하는 데 도움이되는 QueryBase라는 라이브러리</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 작성했습니다 </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">David East编写了一个</font></font><a href="https://github.com/davideast/Querybase"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名为QueryBase</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font><font style="vertical-align: inherit;">库，</font><font style="vertical-align: inherit;">该</font><font style="vertical-align: inherit;">库有助于生成此类属性</font><font style="vertical-align: inherit;">。</font></font>

source: Firebase doesn't allow querying with multiple conditions. However, I did find a way around for this:
es: La Base de Fuego no permite consultas con múltiples condiciones.Sin embargo,encontré una forma de evitarlo:
ja: Firebaseでは複数の条件を指定してクエリを実行することはできません。しかし、これを回避する方法を見つけました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firebase에서는 여러 조건으로 쿼리 할 수 ​​없습니다. </font><font style="vertical-align: inherit;">그러나 나는 이것에 대한 길을 찾았습니다.</font></font>
zh_cn: Firebase不允许用多个条件查询。不过,我确实找到了一个方法来解决这个问题。

source: Frank's answer is good but Firestore introduced <a href="https://firebase.google.com/docs/firestore/query-data/queries#array_membership"><code>array-contains</code></a> recently that makes it easier to do AND queries.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La respuesta de Frank es buena, pero Firestore introdujo </font></font><a href="https://firebase.google.com/docs/firestore/query-data/queries#array_membership"> <code>array-contains</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> recientemente que hace que sea m&aacute;s f&aacute;cil hacer Y consultas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フランクの答えは良いですが、Firestore </font></font><a href="https://firebase.google.com/docs/firestore/query-data/queries#array_membership"> <code>array-contains</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近ANDクエリの実行を容易にする</font><font style="vertical-align: inherit;">配列</font><font style="vertical-align: inherit;">コンテナを導入しました</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Frank의 대답은 좋지만 Firestore </font></font><a href="https://firebase.google.com/docs/firestore/query-data/queries#array_membership"> <code>array-contains</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 최근에 </font><font style="vertical-align: inherit;">배열이 포함되어</font><font style="vertical-align: inherit;"> 있어 AND 쿼리를보다 쉽게 ​​수행 할 수 있습니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Frank的回答很好，但是Firestore </font><font style="vertical-align: inherit;">最近</font><font style="vertical-align: inherit;">引入了</font></font><a href="https://firebase.google.com/docs/firestore/query-data/queries#array_membership"> <code>array-contains</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这使得执行AND查询变得更加容易。</font></font>

source: I am a Firebase newbie. How can I retrieve a result from the data above <strong>where <code>genre = 'comedy'</code> AND <code>lead = 'Jack Nicholson'</code></strong>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soy un novato de Firebase. </font><font style="vertical-align: inherit;">&iquest;C&oacute;mo puedo recuperar un resultado de los datos anteriores </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">donde </font></font> <code>genre = 'comedy'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Y </font></font> <code>lead = 'Jack Nicholson'</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はFirebase初心者です。</font><font style="vertical-align: inherit;">どのように私は上記のデータから結果を取得することができます</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">どこ</font></font> <code>genre = 'comedy'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>lead = 'Jack Nicholson'</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">저는 Firebase 초보자입니다. </font><font style="vertical-align: inherit;">어떻게 위의 데이터에서 결과를 검색 할 수있는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">곳 </font></font> <code>genre = 'comedy'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>lead = 'Jack Nicholson'</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我是Firebase新手。</font><font style="vertical-align: inherit;">我怎样才能检索到从上述数据的结果</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，其中</font></font> <code>genre = 'comedy'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>lead = 'Jack Nicholson'</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font>

source: I know of three approaches that will work.
es: Sé de tres enfoques que funcionarán.
ja: 私は3つのアプローチを知っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 작동 할 세 가지 접근법을 알고 있습니다.</font></font>
zh_cn: 据我所知,有三种方法会有效果。

source: I've written a personal library that allows you to order by multiple values, with all the ordering done on the server.
es: He escrito una biblioteca personal que le permite ordenar por múltiples valores,con todo el ordenamiento hecho en el servidor.
ja: 個人的なライブラリを書いてみたのですが、複数の値で順番を決めて、全てサーバー上で順番を決められるようにしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서버에서 모든 주문을 수행하면서 여러 값으로 주문할 수있는 개인 라이브러리를 작성했습니다.</font></font>
zh_cn: 我写了一个个人库,允许你用多个值来排序,所有的排序都在服务器上完成。

source: If that isn't good enough, you should consider modifying/expanding your data to allow your use-case. For example: you could stuff genre+lead into a single property that you just use for this filter.
es: Si eso no es suficiente,debería considerar modificar y ampliar sus datos para permitir su uso.Por ejemplo:podrías rellenar género+liderazgo en una sola propiedad que sólo usas para este filtro.
ja: それでも十分でない場合は、あなたのユースケースに合わせてデータを拡張することを検討すべきです。例えば、ジャンルとリードを一つのプロパティに詰め込んで、このフィルタのためだけに使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것으로 충분하지 않으면 사용 사례를 허용하도록 데이터 수정 / 확장을 고려해야합니다. </font><font style="vertical-align: inherit;">예를 들어, 장르 + 리드를이 필터에 사용하는 단일 속성에 넣을 수 있습니다.</font></font>
zh_cn: 如果这还不够好,你应该考虑修改你的数据,以允许你的用例。例如:你可以把genre+lead塞进一个单独的属性中,而这个属性只是用于这个过滤器。

source: If you need to filter on more than just the year, make sure to add the other date parts in descending order, e.g. <code>"comedy_1997-12-25"</code>. This way the lexicographical ordering that Firebase does on string values will be the same as the chronological ordering.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si necesita filtrar m&aacute;s all&aacute; del a&ntilde;o, aseg&uacute;rese de agregar las otras partes de la fecha en orden descendente, por ejemplo, </font></font> <code>"comedy_1997-12-25"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">De esta forma, el orden lexicogr&aacute;fico que Firebase hace en los valores de cadena ser&aacute; el mismo que el orden cronol&oacute;gico.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">年だけでなくフィルタリングする必要がある場合は、他の日付部分を降順で追加してください（例：</font></font> <code>"comedy_1997-12-25"</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このように、Firebaseが文字列値に対して行う辞書式順序は、年代順と同じになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연도 이상을 필터링해야하는 경우 다른 날짜 부분을 내림차순으로 추가하십시오 (예 : </font></font> <code>"comedy_1997-12-25"</code> )<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이런 식으로 Firebase가 문자열 값에서 수행하는 사전 식 순서는 시간 순서와 동일합니다.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您需要过滤的不仅仅是一年，请确保以降序添加其他日期部分，例如</font></font> <code>"comedy_1997-12-25"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这样，Firebase对字符串值进行的词典编排顺序将与时间顺序相同。</font></font>

source: Query based on multiple where clauses in Firebase
es: Consulta basada en las cláusulas de múltiple where en Firebase
ja: Firebaseの複数のwhere句に基づくクエリ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firebase의 여러 where 절을 기반으로 한 쿼리</font></font>
zh_cn: 基于Firebase中多个where子句的查询

source: Querybase takes in a Firebase Database Reference and an array of fields you wish to index on. When you create new records it will automatically handle the generation of keys that allow for multiple querying. The caveat is that it only supports straight equivalence (no less than or greater than).
es: La base de datos Querybase toma una referencia de la base de datos de la base de fuego y una serie de campos que desea indexar.Cuando se crean nuevos registros,automáticamente se encargará de la generación de claves que permitan realizar múltiples consultas.La salvedad es que sólo admite equivalencia directa (no menor o mayor que).
ja: QuerybaseはFirebaseデータベースリファレンスとインデックスを作成したいフィールドの配列を受け取ります。新しいレコードを作成する際には、複数のクエリを可能にするキーを自動的に生成します。注意点としては、ストレートな同等性(以下でもそれ以上でもない)しかサポートしていません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Querybase는 Firebase 데이터베이스 참조 및 색인을 생성 할 필드 배열을받습니다. </font><font style="vertical-align: inherit;">새 레코드를 만들면 여러 쿼리를 허용하는 키 생성이 자동으로 처리됩니다. </font><font style="vertical-align: inherit;">주의 사항은 직선 동등성을 지원한다는 것입니다.</font></font>
zh_cn: Querybase会接收一个Firebase数据库参考资料和一个你希望建立索引的字段数组。当你创建新记录时,它将自动处理生成允许多次查询的密钥。注意事项是,它只支持直接等价(不小于或大于)。

source: So <strong>my code above will not work</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mi c&oacute;digo anterior no funcionar&aacute;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、上記の私のコードは機能しません</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 코드는 작동하지 않습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所以</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我上面的代码将无法工作</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: There are probably more approaches. For example, this answer highlights an alternative tree-shaped custom index: <a href="https://stackoverflow.com/a/34105063">https://stackoverflow.com/a/34105063</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Probablemente hay m&aacute;s enfoques. </font><font style="vertical-align: inherit;">Por ejemplo, esta respuesta destaca un &iacute;ndice personalizado alternativo en forma de &aacute;rbol: </font></font><a href="https://stackoverflow.com/a/34105063"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/34105063</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おそらくもっと多くのアプローチがあります。</font><font style="vertical-align: inherit;">たとえば、この回答は、代わりのツリー型のカスタムインデックスを強調してい</font><a href="https://stackoverflow.com/a/34105063"><font style="vertical-align: inherit;">ます。https</font></a><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//stackoverflow.com/a/34105063</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아마도 더 많은 접근법이있을 것입니다. </font><font style="vertical-align: inherit;">예를 들어이 답변은 대체 트리 모양의 사용자 지정 인덱스 ( </font><a href="https://stackoverflow.com/a/34105063"><font style="vertical-align: inherit;">https://stackoverflow.com/a/34105063)를</font></a><font style="vertical-align: inherit;"> 강조합니다.</font></font><font style="vertical-align: inherit;"></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可能有更多的方法。</font><font style="vertical-align: inherit;">例如，此答案突出显示了替代的树形自定义索引：</font><a href="https://stackoverflow.com/a/34105063"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//stackoverflow.com/a/34105063</font></font>

source: This combining of values in a property can work with more than two values, but you can only do a range filter on the last value in the composite property.
es: Esta combinación de valores en una propiedad puede funcionar con más de dos valores,pero sólo se puede hacer un filtro de rango en el último valor de la propiedad compuesta.
ja: このプロパティ内の値の組み合わせは、2つ以上の値で動作しますが、合成プロパティ内の最後の値に対してのみ範囲フィルタを行うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 속성 값 조합은 둘 이상의 값으로 작동 할 수 있지만 복합 속성의 마지막 값에 대해서만 범위 필터를 수행 할 수 있습니다.</font></font>
zh_cn: 这种复合属性中的值的组合可以使用两个以上的值,但你只能对复合属性中的最后一个值进行范围过滤。

source: This will work.
es: Esto funcionará.
ja: これなら大丈夫。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작동합니다.</font></font>
zh_cn: 这样就可以了。
