Repository: rueisnom/feedback
Catalog: xlf/41/72/72/2/4172722.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You allocated memory in your constructor and so you need to write a destructor to delete it. Otherwise you will cause a memory leak.
es: Asignaste memoria en tu constructor y por eso necesitas escribir un destructor para borrarla.De lo contrario,causará una fuga de memoria.
ja: コンストラクタでメモリを確保しているので、それを削除するためにデストラクタを書く必要があります。そうしないとメモリリークの原因になります。
ko: 생성자에 메모리를 할당 했으므로 소멸자를 작성하여 삭제해야합니다. 그렇지 않으면 메모리 누수가 발생합니다.
ru: Вы выделили память в конструкторе,поэтому для ее удаления необходимо записать деструктор.Иначе произойдет утечка памяти.
zh_cn: 你在构造函数中分配了内存,所以你需要写一个destructor来删除它。否则你会造成内存泄漏。

source: You allocated memory in your constructor to a member pointer of your class. When you copy an object of this class the default assignment operator and copy constructor will copy the value of this member pointer to the new object.
es: Asignó la memoria de su constructor a un miembro de su clase.Al copiar un objeto de esta clase,el operador de asignación por defecto y el constructor de copia copiarán el valor de este puntero miembro al nuevo objeto.
ja: コンストラクタでクラスのメンバポインタにメモリを割り当てました。このクラスのオブジェクトをコピーすると、デフォルトの代入演算子とコピーコンストラクタは、このメンバポインタの値を新しいオブジェクトにコピーします。
ko: 생성자의 메모리를 클래스의 멤버 포인터에 할당했습니다. 이 클래스의 객체를 복사하면 기본 할당 연산자와 복사 생성자가이 멤버 포인터의 값을 새 객체에 복사합니다.
ru: Вы выделили память в конструкторе указателю на член вашего класса.При копировании объекта этого класса оператор присваивания по умолчанию и конструктор копирования скопируют значение указателя этого члена в новый объект.
zh_cn: 你在构造函数中为类的成员指针分配了内存。当你复制这个类的一个对象时,默认的赋值操作符和copy构造函数将把这个成员指针的值复制到新对象上。

source: You might think that this is job done.
es: Podrías pensar que esto es un trabajo hecho.
ja: これは仕事だと思うかもしれません。
ko: 이 작업이 완료된 것으로 생각할 수 있습니다.
ru: Ты можешь подумать,что это работа.
zh_cn: 你可能会认为这就是工作了。

source: a <strong>copy constructor</strong>,
es: un <strong>constructor de copias</strong> ,
ja: <strong>コピーコンストラクタ</strong> 、
ko: <strong>복사 생성자</strong>
ru: <strong>конструктор копирования</strong> ,
zh_cn: <strong>复制构造函数</strong> ，

source: an <strong>assignment operator</strong>,
es: un <strong>operador de asignaci&oacute;n</strong> ,
ja: <strong>代入演算子</strong> 、
ko: <strong>할당 연산자</strong>
ru: <strong>оператор присваивания</strong> ,
zh_cn: <strong>赋值运算符</strong>

source: copy assignment operator
es: operador de asignación de copias
ja: コピー代入演算子
ko: 복사 할당 연산자
ru: оператор копирования
zh_cn: 复制分配器

source: copy constructor
es: constructor de copias
ja: コピーコンストラクタ
ko: 복사 생성자
ru: копировальный конструктор
zh_cn: 复制构造函数

source: defined explictly, then it is likely to need <strong>all three of them</strong>.
es: definido expl&iacute;citamente, entonces es probable que los necesite a <strong>los tres</strong> .
ja: 明示的に定義すると<strong>、3つすべて</strong>が必要になる可能性があり<strong>ます</strong> 。
ko: 명확하게 정의 <strong>하면 세 가지</strong> 가 <strong>모두</strong> 필요할 <strong>것</strong> 입니다.
ru: определяется точно, тогда, вероятно, понадобятся <strong>все три из них</strong> .
zh_cn: 明确定义，则可能需要<strong>全部三个</strong> 。

source: or a <strong>destructor</strong>,
es: o un <strong>destructor</strong> ,
ja: または<strong>デストラクタ</strong> 、
ko: 또는 <strong>소멸자</strong>
ru: или <strong>деструктор</strong> ,
zh_cn: 或<strong>破坏者</strong> ，

source: the class destructor would also be participating in management of the resource (usually releasing it). The classic resource to be managed was memory, and this is why all Standard Library classes that manage memory (e.g., the STL containers that perform dynamic memory management) all declare &ldquo;the big three&rdquo;: both copy operations and a destructor.
es: el destructor de clase tambi&eacute;n estar&iacute;a participando en la gesti&oacute;n del recurso (generalmente solt&aacute;ndolo). El recurso cl&aacute;sico que se administr&oacute; fue la memoria, y esta es la raz&oacute;n por la cual todas las clases de la Biblioteca est&aacute;ndar que administran la memoria (por ejemplo, los contenedores STL que realizan la administraci&oacute;n din&aacute;mica de la memoria) declaran "los tres grandes": operaciones de copia y un destructor.
ja: クラスのデストラクタもリソースの管理に参加します（通常はリソースを解放します）。 管理される古典的なリソースはメモリでした。これが、メモリを管理するすべての標準ライブラリクラス（たとえば、動的メモリ管理を実行するSTLコンテナ）がすべて「大きな3つ」、つまりコピー操作とデストラクタの両方を宣言する理由です。
ko: 클래스 소멸자는 리소스 관리에 참여할 것입니다 (보통 리소스를 공개). 관리해야 할 기본 리소스는 메모리 였기 때문에 메모리를 관리하는 모든 표준 라이브러리 클래스 (예 : 동적 메모리 관리를 수행하는 STL 컨테이너)가 모두 복사 작업과 소멸자 모두 "큰 세 가지"를 선언하는 것입니다.
ru: деструктор класса также будет участвовать в управлении ресурсом (обычно освобождая его). Классическим ресурсом, которым нужно управлять, была память, и именно поэтому все классы стандартной библиотеки, которые управляют памятью (например, контейнеры STL, которые выполняют динамическое управление памятью), объявляют &laquo;большую тройку&raquo;: и операции копирования, и деструктор.
zh_cn: 类析构函数也将参与资源的管理（通常是释放资源）。 要管理的经典资源是内存，这就是为什么所有管理内存的标准库类（例如，执行动态内存管理的STL容器）都声明&ldquo;三者&rdquo;：复制操作和析构函数。

source: then you should declare all three. It grew out of the observation that the need to take over the meaning of a copy operation almost always stemmed from the class performing some kind of resource management, and that almost always implied that
es: entonces deberías declarar los tres.Surgió de la observación de que la necesidad de asumir el significado de una operación de copia casi siempre provenía de la clase que realizaba algún tipo de gestión de recursos,y que casi siempre implicaba que
ja: の場合は、3つすべてを宣言しなければなりません。これは、コピー操作の意味を引き継ぐ必要性は、ほとんどの場合、クラスが何らかのリソース管理を行っていることに起因しているという観察から生まれました。
ko: 그런 다음 세 가지를 모두 선언해야합니다. 복사 작업의 의미를 인계해야 할 필요성은 거의 항상 일종의 자원 관리를 수행하는 클래스에서 비롯되었으며 거의 ​​항상 그 의미를 암시했습니다.
ru: тогда тебе следует объявить все три.Это выросло из наблюдения,что необходимость взять на себя значение операции копирования почти всегда вытекала из класса,выполняющего какое-то управление ресурсами,и это почти всегда подразумевало,что
zh_cn: 那么你应该声明这三个都要声明。它是出于这样的观察而产生的,即需要接管复制操作的意义几乎总是来自于类执行某种资源管理,而这几乎总是意味着

source: whatever resource management was being done in one copy operation probably needed to be done in the other copy operation and
es: cualquier gestión de recursos que se hiciera en una operación de copia probablemente debía hacerse en la otra operación de copia y
ja: あるコピー操作で行われていたリソース管理は、おそらく他のコピー操作で行われる必要があり
ko: 한 번의 복사 작업에서 수행 된 모든 자원 관리는 다른 복사 작업에서 수행되어야 할 것입니다.
ru: какое бы управление ресурсами ни осуществлялось в одной операции копирования,вероятно,нужно было сделать в другой операции копирования и
zh_cn: 无论在一个副本操作中进行的资源管理,很可能需要在另一个副本操作中进行,并且
