Repository: rueisnom/feedback
Catalog: xlf/41/72/72/2/4172722.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (If you are puzzled by the <code>name(name), age(age)</code> part, this is called a <a href="https://stackoverflow.com/questions/1272680/">member initializer list</a>.)
es: (Si le desconcierta la parte del <code>name(name), age(age)</code> , esto se llama <a href="https://stackoverflow.com/questions/1272680/">lista de inicializador de miembros</a> ).
ja: （ <code>name(name), age(age)</code> 部分に戸惑っている場合、これは<a href="https://stackoverflow.com/questions/1272680/">メンバー初期化子リスト</a>と呼ばれます 。）
ko: ( <code>name(name), age(age)</code> 부분에 의아해하는 경우이를 <a href="https://stackoverflow.com/questions/1272680/">멤버 이니셜 라이저 목록</a> 이라고 합니다 .)
ru: (Если вы озадачены <code>name(name), age(age)</code> части, это называется <a href="https://stackoverflow.com/questions/1272680/">списком инициализатора участника</a> .)
zh_cn: （如果您对 <code>name(name), age(age)</code> 部分感到困惑，这称为<a href="https://stackoverflow.com/questions/1272680/">成员初始化器列表</a> 。）

source: (Note that the forthcoming new version of the C++ standard (which is C++11) adds move semantics to C++, which will likely change the Rule of Three. However, I know too little about this to write a C++11 section about the Rule of Three.)
es: (Obsérvese que la nueva versión del estándar C++(que es C++11)añade la semántica del movimiento a C++,lo que probablemente cambiará la Regla de Tres.Sin embargo,sé muy poco sobre esto como para escribir una sección de C++11 sobre la Regla de Tres).
ja: (C++標準の近々の新バージョン(これはC++11です)では、C++にmoveセマンティクスが追加されており、それによってRule of Threeが変更される可能性が高いことに注意してください。しかし、私はこれについてあまり知らないので、「3の法則」についてC++11のセクションを書くことはできません)。
ko: (다가오는 C ++ 표준의 새로운 버전 (C ++ 11)은 C ++에 이동 의미를 추가하여 3의 규칙을 변경 할 수 있습니다. 그러나 C ++ 11 섹션을 작성하기에는 이것에 대해 거의 알지 못합니다. 3의 법칙에 대해.)
ru: (Обратите внимание,что в грядущей новой версии стандарта C++(то есть C++11)к C++добавлена семантика перемещений,что,скорее всего,изменит Правило трех.Однако,я знаю об этом слишком мало,чтобы написать раздел на C++11 о правиле трех).
zh_cn: (注意,即将发布的C++标准新版本(也就是C++11)在C++中增加了移动语义,这很可能会改变三条规则。不过,我对这方面的了解太少,所以不可能写一篇C++11中关于 "三原则 "的章节)。)

source: (Unfortunately, this "rule" is not enforced by the C++ standard or any compiler I am aware of.)
es: (Desafortunadamente,esta "regla" no es aplicada por el estándar C++o cualquier otro compilador que yo conozca.)
ja: (残念ながら、この「ルール」はC++標準や私が知っているコンパイラでは施行されていません)。
ko: (안타깝게도이 "규칙"은 C ++ 표준 또는 내가 알고있는 컴파일러에 의해 시행되지 않습니다.)
ru: (К сожалению,это "правило" не выполняется ни стандартом языка Си++,ни каким-либо известным мне компилятором).
zh_cn: 不幸的是,这个 "规则 "并没有被C++标准或我所知道的任何编译器执行)。

source: <strong>A consequence of the Rule of Three</strong> is that the presence of a user-declared destructor indicates that simple member wise copy is unlikely to be appropriate for the copying operations in the class. That, in turn, suggests that if a class declares a destructor, the copy operations probably shouldn&rsquo;t be automatically generated, because they wouldn&rsquo;t do the right thing. At the time C++98 was adopted, the significance of this line of reasoning was not fully appreciated, so in C++98, the existence of a user declared destructor had no impact on compilers&rsquo; willingness to generate copy operations. That continues to be the case in C++11, but only because restricting the conditions under which the copy operations are generated would break too much legacy code.
es: <strong>Una consecuencia de la Regla de tres</strong> es que la presencia de un destructor declarado por el usuario indica que es improbable que la copia simple por parte del miembro sea apropiada para las operaciones de copia en la clase. Eso, a su vez, sugiere que si una clase declara un destructor, las operaciones de copia probablemente no deber&iacute;an generarse autom&aacute;ticamente, porque no har&iacute;an lo correcto. En el momento en que se adopt&oacute; C ++ 98, la importancia de esta l&iacute;nea de razonamiento no se apreciaba completamente, por lo que en C ++ 98, la existencia de un destructor declarado por el usuario no tuvo ning&uacute;n impacto en la disposici&oacute;n de los compiladores para generar operaciones de copia. Ese sigue siendo el caso en C ++ 11, pero solo porque restringir las condiciones bajo las cuales se generan las operaciones de copia romper&iacute;a demasiado c&oacute;digo heredado.
ja: <strong>3つのルールの結果は、</strong>ユーザー宣言のデストラクタの存在が、単純なメンバーごとのコピーがクラスのコピー操作に適切である可能性が低いことを示していることです。 つまり、クラスがデストラクタを宣言している場合、コピー操作は正しく行われないため、おそらくコピー操作は自動的に生成されないはずです。 C ++ 98が採用された時点では、この推論の重要性は十分に評価されていなかったため、C ++ 98では、ユーザー宣言のデストラクタの存在は、コピー操作を生成するコンパイラの意欲に影響を与えませんでした。 これはC ++ 11でも同じですが、コピー操作が生成される条件を制限するとレガシーコードが破壊されてしまうためです。
ko: <strong>3의 규칙의 결과는</strong> 사용자가 선언 한 소멸자가 있다는 것은 간단한 멤버 현명한 사본이 클래스의 복사 작업에 적합하지 않을 것임을 나타냅니다. 즉, 클래스가 소멸자를 선언하면 올바른 작업을 수행하지 않기 때문에 복사 작업이 자동으로 생성되지 않아야합니다. C ++ 98이 채택되었을 때,이 추론의 중요성은 충분히 인식되지 않았으므로 C ++ 98에서는 사용자 선언 소멸자가 존재한다는 것은 복사 작업을 생성하려는 컴파일러의 의지에 영향을 미치지 않았습니다. C ++ 11에서는 계속 그렇습니다. 그러나 복사 작업이 생성되는 조건을 제한하면 너무 많은 레거시 코드가 손상되기 때문입니다.
ru: <strong>Следствием правила три</strong> является то, что наличие деструктора, объявленного пользователем, указывает на то, что простое копирование в виде члена вряд ли подходит для операций копирования в классе. Это, в свою очередь, говорит о том, что если класс объявляет деструктор, операции копирования, вероятно, не должны генерироваться автоматически, потому что они не будут делать правильные вещи. В то время, когда был принят C ++ 98, значение этой линии рассуждений не было полностью оценено, поэтому в C ++ 98 существование объявленного пользователем деструктора не оказало влияния на готовность компиляторов генерировать операции копирования. Это продолжает иметь место в C ++ 11, но только потому, что ограничение условий, при которых генерируются операции копирования, нарушило бы слишком много устаревшего кода.
zh_cn: <strong>三规则的结果</strong>是，用户声明的析构函数的存在表明简单的成员明智的复制不太可能适用于该类中的复制操作。 反过来，这表明如果类声明了析构函数，则复制操作可能不应该自动生成，因为它们不会做正确的事情。 在采用C ++ 98时，这种思路的重要性并未得到充分认识，因此在C ++ 98中，用户声明的析构函数的存在对编译器生成复制操作的意愿没有影响。 在C ++ 11中，情况仍然如此，但这仅是因为限制复制操作的生成条件会破坏太多的旧代码。

source: <strong>Assignment operator and copy constructor</strong>
es: <strong>Operador de asignaci&oacute;n y constructor de copia</strong>
ja: <strong>代入演算子とコピーコンストラクター</strong>
ko: <strong>할당 연산자 및 복사 생성자</strong>
ru: <strong>Оператор присваивания и конструктор копирования</strong>
zh_cn: <strong>赋值运算符和副本构造函数</strong>

source: <strong>Non default destructor</strong>
es: <strong>Destructor no predeterminado</strong>
ja: <strong>デフォルト以外のデストラクタ</strong>
ko: <strong>기본이 아닌 소멸자</strong>
ru: <strong>Деструктор не по умолчанию</strong>
zh_cn: <strong>非默认析构函数</strong>

source: A deep copy is if we declare an object and then create a completely separate copy of the object...we end up with 2 objects in 2 completely sets of memory.
es: Una copia profunda es que si declaramos un objeto y luego creamos una copia completamente separada del objeto...terminamos con 2 objetos en 2 conjuntos completos de memoria.
ja: ディープコピーとは、オブジェクトを宣言してから、そのオブジェクトの完全に別のコピーを作成することです。
ko: 딥 카피는 객체를 선언 한 다음 객체의 완전히 별개의 사본을 생성하는 것입니다. 우리는 2 개의 메모리 세트에 2 개의 객체가 생깁니다.
ru: Глубокая копия-это если мы объявим объект,а затем создадим полностью отдельную копию объекта...в конечном итоге мы получим 2 объекта в 2-х полных комплектах памяти.
zh_cn: 深度复制就是如果我们声明一个对象,然后创建一个完全独立的对象的副本...........我们最终会在2个完全独立的内存中拥有2个对象。

source: After executing the body of the destructor and destroying any automatic objects allocated within the body, a destructor for class X calls the destructors for X's direct [...] members [n3126.pdf 12.4 &sect;6]
es: Despu&eacute;s de ejecutar el cuerpo del destructor y destruir cualquier objeto autom&aacute;tico asignado dentro del cuerpo, un destructor para la clase X llama a los destructores para los miembros directos [...] de X [n3126.pdf 12.4 &sect;6]
ja: デストラクタの本体を実行し、本体内に割り当てられた自動オブジェクトを破棄した後、クラスXのデストラクタは、Xの直接[...]メンバのデストラクタを呼び出します[n3126.pdf 12.4&sect;6]
ko: 소멸자의 본문을 실행하고 본문 내에 할당 된 자동 객체를 삭제 한 후, 클래스 X의 소멸자는 X의 직접 [...] 멤버의 소멸자를 호출합니다. [n3126.pdf 12.4 &sect;6]
ru: После выполнения тела деструктора и уничтожения любых автоматических объектов, размещенных в теле, деструктор для класса X вызывает деструкторы для прямых [...] членов X [n3126.pdf 12.4 &sect;6]
zh_cn: 在执行析构函数的主体并销毁主体中分配的所有自动对象之后，类X的析构函数调用X的直接成员的析构函数[n3126.pdf 12.4&sect;6]

source: Alternatively, you can inherit from <code>boost::noncopyable</code> or declare them as deleted (in C++11 and above):
es: Alternativamente, puede heredar de <code>boost::noncopyable</code> o declararlos como eliminados (en C ++ 11 y superior):
ja: または、 <code>boost::noncopyable</code> から継承するか、削除されたものとして宣言することもできます（C ++ 11以降）：
ko: 또는 <code>boost::noncopyable</code> 에서 상속하거나 삭제 된 것으로 선언 할 수 있습니다 (C ++ 11 이상에서).
ru: Кроме того, вы можете наследовать от <code>boost::noncopyable</code> или объявить их как удаленные (в C ++ 11 и выше):
zh_cn: 另外，您可以继承 <code>boost::noncopyable</code> 或声明它们已删除（在C ++ 11及更高版本中）：

source: An easy example, in plain English, of the kind of problem it solves:
es: Un ejemplo fácil,en inglés,del tipo de problema que resuelve:
ja: それが解決する問題の種類の簡単な例を平易な英語で説明します。
ko: 일반 영어로 해결되는 문제의 쉬운 예 :
ru: Легкий пример,на простом английском языке,той проблемы,которую он решает:
zh_cn: 一个简单的例子,用通俗易懂的英语来说明它所解决的问题。

source: An example with the signatures:
es: Un ejemplo con las firmas:
ja: サインを入れた例。
ko: 서명이있는 예 :
ru: Пример с подписями:
zh_cn: 签名的一个例子。

source: Basically if you have a destructor (not the default destructor) it means that the class that you defined has some memory allocation. Suppose that the class is used outside by some client code or by you.
es: Básicamente,si tienes un destructor (no el destructor por defecto)significa que la clase que has definido tiene alguna asignación de memoria.Supongamos que la clase es usada fuera por algún código de cliente o por ti.
ja: 基本的にデストラクタ(デフォルトのデストラクタではありません)がある場合は、定義したクラスが何らかのメモリ割り当てを持っていることを意味します。そのクラスがクライアントコードや自分で外部で使われているとしましょう。
ko: 기본적으로 소멸자 (기본 소멸자가 아님)가있는 경우 정의한 클래스에 메모리 할당이 있음을 의미합니다. 클래스가 일부 클라이언트 코드 또는 사용자가 외부에서 사용한다고 가정하십시오.
ru: В принципе,если у вас есть деструктор (не деструктор по умолчанию),это означает,что класс,который вы определили,имеет некоторое выделение памяти.Предположим,что класс используется снаружи каким-то клиентским кодом или вами.
zh_cn: 基本上,如果你有一个destructor(不是默认的destructor),这意味着你定义的类有一些内存分配。假设这个类被一些客户端的代码或你自己在外面使用。

source: By default, copying an object means copying its members:
es: Por defecto,copiar un objeto significa copiar sus miembros:
ja: デフォルトでは、オブジェクトをコピーすると、そのオブジェクトのメンバをコピーすることになります。
ko: 기본적으로 객체를 복사한다는 것은 해당 멤버를 복사하는 것을 의미합니다.
ru: По умолчанию копирование объекта означает копирование его членов:
zh_cn: 默认情况下,复制一个对象意味着复制其成员。

source: C++ treats variables of user-defined types with <em>value semantics</em>. This means that objects are implicitly copied in various contexts, and we should understand what "copying an object" actually means.
es: C ++ trata las variables de tipos definidos por el usuario con <em>sem&aacute;ntica de valores</em> . Esto significa que los objetos se copian impl&iacute;citamente en varios contextos, y debemos entender lo que realmente significa "copiar un objeto".
ja: C ++は、ユーザー定義型の変数を<em>値セマンティクスで</em>扱います。 これは、オブジェクトがさまざまなコンテキストで暗黙的にコピーされることを意味し、「オブジェクトのコピー」が実際に何を意味するかを理解する必要があります。
ko: C ++는 사용자 정의 유형의 변수를 <em>값 의미론으로 처리</em> 합니다. 이는 객체가 다양한 컨텍스트에서 암시 적으로 복사됨을 의미하며, "객체 복사"가 실제로 무엇을 의미하는지 이해해야합니다.
ru: C ++ обрабатывает переменные пользовательских типов с помощью <em>семантики значений</em> . Это означает, что объекты неявно копируются в различных контекстах, и мы должны понимать, что на самом деле означает &laquo;копирование объекта&raquo;.
zh_cn: C ++使用<em>值语义</em>处理用户定义类型的变量。 这意味着在各种上下文中隐式复制对象，我们应该了解&ldquo;复制对象&rdquo;的实际含义。

source: Changes via <code>a</code> can be observed via <code>b</code>.
es: Los cambios a trav&eacute;s de <code>a</code> pueden observarse a trav&eacute;s de <code>b</code> .
ja: <code>b</code> を介し <code>a</code> 変更は、 bを介して監視できます。
ko: <code>a</code> 를 통한 변경은 <code>b</code> 를 통해 확인할 수 있습니다.
ru: Изменения через <code>a</code> можно наблюдать через <code>b</code> .
zh_cn: 通过 <code>b</code> 可以观察到a的变化 。

source: Copy assignment operator is a special assignment operator that is usually used to specify an existing object to others of the same type of object.
es: El operador de asignación de copias es un operador de asignación especial que suele utilizarse para especificar un objeto existente a otros del mismo tipo de objeto.
ja: コピー代入演算子は、通常、既存のオブジェクトを同じ種類のオブジェクトの他の人に指定するために使用される特殊な代入演算子です。
ko: 복사 할당 연산자는 일반적으로 기존 객체를 동일한 유형의 객체로 다른 객체에 지정하는 데 사용되는 특수 할당 연산자입니다.
ru: Оператор копирования присваивания-это специальный оператор присваивания,который обычно используется для указания существующего объекта другим объектам того же типа.
zh_cn: 复制赋值运算符是一种特殊的赋值运算符,通常用来指定一个已有的对象给其他同类型的对象。

source: Copy constructor in C++ is a special constructor. It is used to build a new object, which is the new object equivalent to a copy of an existing object.
es: El constructor de copias en C++es un constructor especial.Se utiliza para construir un nuevo objeto,que es el nuevo objeto equivalente a una copia de un objeto existente.
ja: C++のコピーコンストラクタは、特殊なコンストラクタです。既存のオブジェクトのコピーに相当する新しいオブジェクトを構築するために使用します。
ko: C ++의 복사 생성자는 특수 생성자입니다. 기존 객체의 복사본과 동일한 새로운 객체 인 새 객체를 만드는 데 사용됩니다.
ru: Конструктор копирования на C++-это специальный конструктор.Он используется для создания нового объекта,который является новым объектом,эквивалентным копии существующего объекта.
zh_cn: C++中的Copy构造函数是一个特殊的构造函数。它用于构建一个新对象,也就是新对象相当于现有对象的复制。

source: Declare copy constructor &amp; copy assignment operator as private access specifier.
es: Declare el constructor de copia y el operador de asignaci&oacute;n de copia como especificador de acceso privado.
ja: コピーコンストラクターとコピー代入演算子をプライベートアクセス指定子として宣言します。
ko: 복사 생성자 및 복사 할당 연산자를 개인용 액세스 지정자로 선언하십시오.
ru: Объявите конструктор копирования и оператор назначения копирования как частный указатель доступа.
zh_cn: 声明复制构造函数和复制赋值运算符作为私有访问说明符。

source: Even today, people still write classes in this style and get into trouble: "<em>I pushed a person into a vector and now I get crazy memory errors!</em>" Remember that by default, copying an object means copying its members, but copying the <code>name</code> member merely copies a pointer, <em>not</em> the character array it points to! This has several unpleasant effects:
es: Incluso hoy en d&iacute;a, la gente todav&iacute;a escribe clases en este estilo y se mete en problemas: " <em>&iexcl;Empuj&eacute; a una persona a un vector y ahora tengo errores de memoria locos!</em> " Recuerde que, de forma predeterminada, copiar un objeto significa copiar sus miembros, pero copiar el <code>name</code> miembro simplemente copia un puntero, <em>no</em> el conjunto de caracteres al que apunta. Esto tiene varios efectos desagradables:
ja: 今日でも、人々はこのスタイルでクラスを記述して問題を抱えています：「 <em>私は人をベクターにプッシュしましたが、今ではクレイジーなメモリエラーが発生します！</em> 」デフォルトでは、オブジェクトのコピーはそのメンバーのコピーを意味しますが、 <code>name</code> メンバーのコピーを意味しますポインタをコピーするだけで、ポインタが指す文字配列<em>は</em>コピーし<em>ません</em> 。 これにはいくつかの不快な影響があります。
ko: 오늘날에도 사람들은 여전히이 스타일로 수업을 작성하고 어려움을 겪습니다. " <em>나는 사람을 벡터로 밀어 넣고 이제는 메모리 오류가 발생합니다!</em> "기본적으로 객체를 복사한다는 것은 멤버를 복사하지만 <code>name</code> 복사하는 것을 의미합니다. 가리키는 문자 배열이 <em>아닌</em> 포인터 만 복사합니다! 이것은 몇 가지 불쾌한 효과가 있습니다.
ru: Даже сегодня люди все еще пишут классы в этом стиле и попадают в неприятности: &laquo; <em>Я толкнул человека в вектор, и теперь у меня возникают сумасшедшие ошибки памяти!</em> &raquo; Помните, что по умолчанию копирование объекта означает копирование его членов, но копирование <code>name</code> члена просто копирует указатель, а <em>не</em> массив символов, на который он указывает! Это имеет несколько неприятных эффектов:
zh_cn: 即使在今天，人们仍然以这种风格编写类并遇到麻烦：&ldquo; <em>我将一个人推到向量中，现在我出现了疯狂的内存错误！</em> &rdquo;请记住，默认情况下，复制对象意味着复制其成员，但复制 <code>name</code> 成员仅复制一个指针， <em>而不</em>复制它指向的字符数组！ 这有几个令人不愉快的影响：

source: Exception safety
es: Seguridad de excepción
ja: 例外的な安全性
ko: 예외 안전
ru: Исключительная безопасность
zh_cn: 例外安全

source: Explicit definitions
es: Definiciones explícitas
ja: 明示的な定義
ko: 명시 적 정의
ru: Четкие определения
zh_cn: 明确的定义

source: From C++11 on, an object has 2 extra special member functions: the move constructor and move assignment. The rule of five states to implement these functions as well.
es: A partir de C++11,un objeto tiene 2 funciones especiales extra:el constructor de movimientos y la asignación de movimientos.La regla de cinco estados para implementar estas funciones también.
ja: C++11 以降、オブジェクトには 2 つの特別なメンバ関数が追加されました。これらの関数も同様に実装するための 5 つの状態のルール。
ko: C ++ 11부터 객체에는 2 개의 추가 특수 멤버 함수 인 이동 생성자와 이동 지정이 있습니다. 이러한 기능을 구현하기위한 5 가지 상태 규칙.
ru: Начиная с C++11,объект имеет 2 дополнительные специальные функции-членов:конструктор перемещения и назначение перемещения.Правило пяти состояний для реализации этих функций также.
zh_cn: 从C++11开始,一个对象有两个额外的特殊成员函数:移动构造函数和移动赋值。五种状态的规则来实现这些函数。

source: How can I prevent my objects from being copied?
es: ¿Cómo puedo evitar que mis objetos sean copiados?
ja: 自分のオブジェクトがコピーされないようにするにはどうすればいいですか?
ko: 객체가 복사되지 않도록하려면 어떻게해야합니까?
ru: Как я могу предотвратить копирование моих предметов?
zh_cn: 如何防止我的对象被复制?

source: How can I prevent my objects from being copied? Override all of the ways you're allowed to allocate memory for your object with a private function is a reasonable start. If you really don't want people copying them, you could make it public and alert the programmer by throwing an exception and also not copying the object.
es: ¿Cómo puedo evitar que mis objetos sean copiados? Anular todas las formas en que se le permite asignar memoria para su objeto con una función privada es un comienzo razonable.Si realmente no quieres que la gente los copie,puedes hacerlo público y alertar al programador lanzando una excepción y tampoco copiando el objeto.
ja: オブジェクトがコピーされないようにするには?プライベート関数でオブジェクトにメモリを割り当てる方法をすべてオーバーライドすることは、合理的なスタートです。もし本当にコピーされたくないのであれば、それを公開して例外を投げてプログラマに警告し、オブジェクトをコピーしないようにすることもできます。
ko: 객체가 복사되지 않도록하려면 어떻게해야합니까? 개인 기능으로 객체에 메모리를 할당하도록 허용 된 모든 방법을 무시하는 것이 합리적 시작입니다. 사람들이 실제로 복사하는 것을 원하지 않으면 공개를 만들고 예외를 발생시키고 객체를 복사하지 않음으로써 프로그래머에게 경고 할 수 있습니다.
ru: Как я могу предотвратить копирование моих предметов? Отменить все способы,которыми вам разрешено выделять память для вашего объекта с помощью приватной функции-это разумное начало.Если вы действительно не хотите,чтобы люди их копировали,вы можете сделать это публичным и предупредить программиста,бросив исключение,а также не копировать объект.
zh_cn: 如何防止我的对象被复制?用一个私有函数覆盖所有允许你为对象分配内存的方式是一个合理的开始。如果你真的不希望别人复制,你可以把它公开化,通过抛出一个例外来提醒程序员,同时也可以不复制对象。

source: If <code>a</code> is destroyed, deleting the dangling pointer yields <a href="https://stackoverflow.com/questions/2397984/">undefined behavior</a>.
es: Si se destruye a, eliminar el puntero colgante produce <a href="https://stackoverflow.com/questions/2397984/">un comportamiento indefinido</a> .
ja: が破棄された場合 <code>a</code> ぶら下がりポインタを削除すると、 <a href="https://stackoverflow.com/questions/2397984/">未定義の動作が発生し</a>ます。
ko: <code>a</code> 가 파괴되면 매달려있는 포인터를 삭제하면 <a href="https://stackoverflow.com/questions/2397984/">정의되지 않은 동작이</a> 생성됩니다.
ru: Если <code>a</code> уничтожено, удаление висящего указателя приводит к <a href="https://stackoverflow.com/questions/2397984/">неопределенному поведению</a> .
zh_cn: 如果 <code>a</code> 被销毁，则删除悬空指针会产生<a href="https://stackoverflow.com/questions/2397984/">未定义的行为</a> 。

source: If MyClass has only some primitive typed members a default assignment operator would work but if it has some pointer members and objects that do not have assignment operators the result would be unpredictable. Therefore we can say that if there is something to delete in destructor of a class, we might need a deep copy operator which means we should provide a copy constructor and assignment operator.
es: Si MiClase tiene sólo algunos miembros de tipo primitivo un operador de asignación por defecto funcionaría pero si tiene algunos miembros de tipo puntero y objetos que no tienen operadores de asignación el resultado sería impredecible.Por lo tanto podemos decir que si hay algo que eliminar en el destructor de una clase,podríamos necesitar un operador de copia profundo,lo que significa que deberíamos proporcionar un constructor de copia y un operador de asignación.
ja: MyClassがプリミティブな型付きメンバしか持っていない場合はデフォルトの代入演算子が有効ですが、ポインタ・メンバや代入演算子を持たないオブジェクトを持っている場合は、結果が予測できません。そのため、クラスのデストラクタで削除したいものがある場合には、ディープコピー演算子が必要になるかもしれませんが、これはコピーコンストラクタと代入演算子を用意することを意味します。
ko: MyClass에 기본 형식의 멤버가 일부만 있으면 기본 할당 연산자가 작동하지만 할당 연산자가없는 포인터 멤버 및 개체가 있으면 결과를 예측할 수 없습니다. 따라서 클래스의 소멸자에서 삭제할 항목이 있으면 깊은 복사 연산자가 필요할 수 있습니다. 즉 복사 생성자와 할당 연산자를 제공해야합니다.
ru: Если в MyClass есть только несколько членов с примитивным типом,то оператор присваивания будет работать по умолчанию,но если в нем есть несколько членов с указателями и объекты,которые не имеют операторов присваивания,то результат будет непредсказуемым.Поэтому можно сказать,что если в деструкторе класса есть что удалять,то может понадобиться оператор глубокого копирования,а значит,следует предоставить конструктор копирования и оператор присваивания.
zh_cn: 如果MyClass只有一些基元类型的成员,那么默认的赋值操作符就可以工作,但是如果它有一些指针成员和没有赋值操作符的对象,那么结果就很难预料了。因此,我们可以说,如果在类的destructor里有东西要删除,我们可能需要一个深度复制操作符,这意味着我们应该提供一个复制构造函数和赋值操作符。

source: If there is no good semantic for copying the resource your class manages, then consider to forbid copying by declaring (not <em><a href="https://stackoverflow.com/questions/1410563/what-is-the-difference-between-a-definition-and-a-declaration/1410632#1410632">defining</a></em>) the copy constructor and assignment operator as <code>private</code>.
es: Si no hay una buena sem&aacute;ntica para copiar el recurso que administra su clase, considere prohibir la copia declarando (no <em><a href="https://stackoverflow.com/questions/1410563/what-is-the-difference-between-a-definition-and-a-declaration/1410632#1410632">definiendo</a></em> ) el constructor de copia y el operador de asignaci&oacute;n como <code>private</code> .
ja: クラスが管理するリソースをコピーするための適切なセマンティクスがない場合は、コピーコンストラクターと代入演算子を <code>private</code> として宣言（ <em><a href="https://stackoverflow.com/questions/1410563/what-is-the-difference-between-a-definition-and-a-declaration/1410632#1410632">定義で</a></em>はなく）して、コピーを禁止することを検討してください。
ko: 클래스가 관리하는 리소스를 복사하는 데 의미가 없으면 복사 생성자와 할당 연산자를 <code>private</code> 로 선언 ( <em><a href="https://stackoverflow.com/questions/1410563/what-is-the-difference-between-a-definition-and-a-declaration/1410632#1410632">정의</a></em> 하지 않음)하여 복사를 금지하는 것이 좋습니다.
ru: Если нет хорошей семантики для копирования ресурса, которым управляет ваш класс, тогда попробуйте запретить копирование, объявив (не <em><a href="https://stackoverflow.com/questions/1410563/what-is-the-difference-between-a-definition-and-a-declaration/1410632#1410632">определяя</a></em> ) конструктор копирования и оператор присваивания как <code>private</code> .
zh_cn: 如果没有很好的语义来复制类管理的资源，请考虑通过将复制构造函数和赋值运算符声明为 <code>private</code> 来禁止复制。

source: If you need to explicitly declare either the destructor, copy constructor or copy assignment operator yourself, you probably need to explicitly declare all three of them.
es: Si necesita declarar explícitamente el destructor,el constructor de la copia o el operador de la asignación de la copia usted mismo,probablemente necesite declarar explícitamente los tres.
ja: デストラクタ、コピーコンストラクタ、コピー代入演算子のいずれかを自分で明示的に宣言する必要がある場合は、おそらくこれら3つの演算子をすべて明示的に宣言する必要があるでしょう。
ko: 소멸자, 복사 생성자 또는 복사 할당 연산자를 명시 적으로 선언해야하는 경우 세 가지 모두 명시 적으로 선언해야합니다.
ru: Если вам необходимо явно объявить либо деструктор,либо конструктор копирования,либо оператор присваивания,то,вероятно,вам необходимо явно объявить все три из них.
zh_cn: 如果你需要自己明文声明destructor、copy构造函数或copy assignment操作符,那么你可能需要明文声明这三者中的任何一个。

source: If your class needs any of
es: Si su clase necesita algo de
ja: もしあなたのクラスが以下のものを必要としているならば
ko: 수업이 필요한 경우
ru: Если вашему классу нужно
zh_cn: 如果你的班级需要以下任何一项
