Repository: rueisnom/feedback
Catalog: xlf/41/72/72/2/4172722.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Special member functions
es: Funciones especiales de los miembros
ja: 特別会員機能
ko: 특별 회원 기능
ru: Специальные функции члена
zh_cn: 特别成员的职能

source: The <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">Rule of Three</a> is a rule of thumb for C++, basically saying
es: La <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">regla de tres</a> es una regla general para C ++, b&aacute;sicamente diciendo
ja: <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">3つ</a>のルールは C ++の経験則であり、基本的には
ko: <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">3</a> 의 규칙은 기본적으로 C ++의 경험 법칙입니다.
ru: <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">Правило трех</a> является практическим правилом для C ++, в основном говоря,
zh_cn: <a href="http://en.wikipedia.org/wiki/Rule_of_three_%28C%2B%2B_programming%29">三个</a>规则是C ++的经验法则，基本上说

source: The Rule of Three states that if you declare any of a
es: La Regla de Tres establece que si declaras algo de un
ja: のいずれかを宣言した場合、3つのルールでは、次のようになります。
ko: 세 가지 규칙에 따르면
ru: Правило трех гласит,что если вы объявите что-либо из
zh_cn: "三原则 "规定,如果你申报的任何一项是

source: The [...] copy constructor and copy assignment operator, [...] and destructor are special member functions. [ <em>Note</em>: <strong>The implementation will implicitly declare these member functions for some class types when the program does not explicitly declare them.</strong> The implementation will implicitly define them if they are used. [...] <em>end note</em> ] [n3126.pdf section 12 &sect;1]
es: El constructor de [...] copia y el operador de asignaci&oacute;n de copia, [...] y el destructor son funciones miembro especiales. [ <em>Nota</em> : <strong>La implementaci&oacute;n declarar&aacute; impl&iacute;citamente estas funciones miembro para algunos tipos de clase cuando el programa no las declare expl&iacute;citamente.</strong> La implementaci&oacute;n los definir&aacute; impl&iacute;citamente si se usan. [...] <em>nota final</em> ] [n3126.pdf secci&oacute;n 12 &sect;1]
ja: [...]コピーコンストラクターとコピー代入演算子、[...]とデストラクターは特別なメンバー関数です。 [ <em>注</em> ： <strong>プログラムが明示的に宣言していない場合、実装はこれらのメンバー関数をいくつかのクラス型に対して暗黙的に宣言します。</strong> それらが使用される場合、実装はそれらを暗黙的に定義します。 [...] <em>エンドノート</em> ] [n3126.pdfセクション12&sect;1]
ko: [...] 복사 생성자 및 복사 할당 연산자, [...] 및 소멸자는 특수 멤버 함수입니다. [ <em>참고</em> : <strong>구현시 프로그램에서 명시 적으로 선언하지 않은 경우 일부 클래스 유형에 대해 이러한 멤버 함수를 암시 적으로 선언합니다.</strong> 구현은 사용되는 경우 암시 적으로 정의합니다. [...] <em>끝 참고</em> ] [n3126.pdf section 12 &sect;1]
ru: [...] конструктор копирования и оператор присваивания копии, [...] и деструктор являются специальными функциями-членами. [ <em>Примечание</em> : <strong>Реализация будет неявно объявлять эти функции-члены для некоторых типов классов, когда программа явно не объявляет их.</strong> Реализация будет неявно определять их, если они используются. [...] <em>конец примечания</em> ] [n3126.pdf раздел 12 &sect;1]
zh_cn: 复制构造函数和复制赋值运算符，析构函数是特殊的成员函数。 [ <em>注意</em> ： <strong>当程序未明确声明它们时，实现将为某些类类型隐式声明这些成员函数。</strong> 如果使用它们，实现将隐式定义它们。 [... <em>尾注</em> ] [n3126.pdf第12节&sect;1]

source: The implicitly-defined copy assignment operator for a non-union class X performs memberwise copy assignment of its subobjects. [n3126.pdf section 12.8 &sect;30]
es: El operador de asignaci&oacute;n de copia definido impl&iacute;citamente para una clase X no sindical realiza la asignaci&oacute;n de copia de sus subobjetos a nivel de miembro. [n3126.pdf secci&oacute;n 12.8 &sect;30]
ja: 非共用クラスXの暗黙的に定義されたコピー代入演算子は、そのサブオブジェクトのメンバーごとのコピー代入を実行します。 [n3126.pdfセクション12.8&sect;30]
ko: 비 유니언 클래스 X에 대해 암시 적으로 정의 된 복사 할당 연산자는 해당 서브 오브젝트의 멤버 별 복사 할당을 수행합니다. [n3126.pdf 섹션 12.8 &sect;30]
ru: Неявно определенный оператор присваивания копии для класса X, не являющегося объединением, выполняет присваивание для каждого элемента подобъекта. [n3126.pdf раздел 12.8 &sect;30]
zh_cn: 非联合类X的隐式定义的副本分配运算符执行其子对象的成员式副本分配。 [n3126.pdf第12.8&sect;30节]

source: The implicitly-defined copy constructor for a non-union class X performs a memberwise copy of its subobjects. [n3126.pdf section 12.8 &sect;16]
es: El constructor de copia impl&iacute;citamente definido para una clase X sin uni&oacute;n realiza una copia miembro de sus subobjetos. [n3126.pdf secci&oacute;n 12.8 &sect;16]
ja: 非ユニオンクラスXの暗黙的に定義されたコピーコンストラクターは、そのサブオブジェクトのメンバーごとのコピーを実行します。 [n3126.pdfセクション12.8&sect;16]
ko: 비 유니언 클래스 X에 대한 암시 적으로 정의 된 복사 생성자는 해당 서브 오브젝트의 멤버 별 사본을 수행합니다. [n3126.pdf 섹션 12.8 &sect;16]
ru: Неявно определенный конструктор копирования для класса X, не являющегося объединением, выполняет пошаговую копию своих подобъектов. [n3126.pdf раздел 12.8 &sect;16]
zh_cn: 非联合类X的隐式定义的副本构造函数执行其子对象的成员式副本。 [n3126.pdf第12.8&sect;16节]

source: The implicitly-defined special member functions for <code>person</code> look like this:
es: Las funciones de miembro especiales definidas impl&iacute;citamente para <code>person</code> a se ven as&iacute;:
ja: <code>person</code> の暗黙的に定義された特別なメンバー関数は次のようになります。
ko: 사람에 대한 암시 적으로 정의 된 특수 멤버 함수는 다음과 같습니다.
ru: Неявно определенные специальные функции-члены для <code>person</code> выглядят так:
zh_cn: 为 <code>person</code> 隐式定义的特殊成员函数如下所示：

source: The law of the big three is as specified above.
es: La ley de los tres grandes es la especificada anteriormente.
ja: 大三元の法則は上記の通りです。
ko: 빅 3의 법칙은 위에서 지정한대로입니다.
ru: Закон большой тройки,как указано выше.
zh_cn: 三大法则如上规定。

source: The problem will be, if a copy is made of your object, then the copy will point to the same memory as the original object.
es: El problema será que si se hace una copia de su objeto,entonces la copia apuntará a la misma memoria que el objeto original.
ja: 問題は、あなたのオブジェクトのコピーが作られた場合、コピーは元のオブジェクトと同じメモリを指していることになります。
ko: 문제는 사본이 객체로 만들어진 경우 사본이 원래 객체와 동일한 메모리를 가리킬 것입니다.
ru: Проблема будет заключаться в том,что если копия сделана с вашего объекта,то копия будет указывать на ту же самую память,что и оригинал.
zh_cn: 问题是,如果对你的对象进行了复制,那么副本将指向与原对象相同的内存。

source: The reasons for this is that all three of them are usually used to manage a resource, and if your class manages a resource, it usually needs to manage copying as well as freeing.
es: Las razones de esto es que las tres se utilizan normalmente para gestionar un recurso,y si su clase gestiona un recurso,normalmente necesita gestionar la copia así como la liberación.
ja: その理由は、3つとも通常はリソースを管理するために使用するもので、クラスがリソースを管理する場合、通常は解放だけでなくコピーも管理する必要があるからです。
ko: 그 이유는이 세 가지가 모두 리소스를 관리하는 데 주로 사용되기 때문에 클래스에서 리소스를 관리하는 경우 일반적으로 복사 및 해제를 관리해야합니다.
ru: Причины этого в том,что все три из них обычно используются для управления ресурсом,и если ваш класс управляет ресурсом,то ему обычно нужно управлять копированием,а также освобождением.
zh_cn: 原因是这三者通常都是用来管理一个资源的,如果你的类管理一个资源,通常需要管理复制的同时,也需要管理释放的资源。

source: The rule of 3/5 is also referred to as the rule of 0/3/5. The zero part of the rule states that you are allowed to not write any of the special member functions when creating your class.
es: La regla de 35 también se conoce como la regla de 035.La parte cero de la regla establece que se le permite no escribir ninguna de las funciones especiales del miembro al crear su clase.
ja: 35のルールは035のルールとも呼ばれています。このルールの0の部分は、クラスを作成する際に特別なメンバ関数を書かないことが許されていることを示しています。
ko: 3/5의 규칙은 0/3/5의 규칙이라고도합니다. 규칙의 0 부분은 클래스를 만들 때 특수 멤버 함수를 작성할 수 없다는 것을 나타냅니다.
ru: Правило 35 также называется правилом 035.Нулевая часть правила гласит,что при создании класса разрешается не писать ни одной из специальных функций-членов.
zh_cn: 35规则也被称为035规则。该规则的0部分规定,在创建类时,允许你不写任何特殊成员函数。

source: The rule of five
es: La regla de los cinco
ja: 五則
ko: 5의 규칙
ru: Правило пяти
zh_cn: 五常法则

source: The rule of three
es: La regla de tres
ja: 三つの法則
ko: 세의 규칙
ru: Правило трех
zh_cn: 三分法则

source: The rule of zero
es: La regla del cero
ja: ゼロの法則
ko: 제로의 규칙
ru: Правило обнуления
zh_cn: 零点法则

source: There are quick examples:
es: Hay ejemplos rápidos:
ja: 簡単な例があります。
ko: 빠른 예가 있습니다.
ru: Есть быстрые примеры:
zh_cn: 有快速的例子。

source: Therefore, you write a copy constructor so that it allocates new objects their own pieces of memory to destroy.
es: Por lo tanto,se escribe un constructor de copias para que asigne a los nuevos objetos sus propios trozos de memoria para destruir.
ja: したがって、あなたはそれが破壊するために新しいオブジェクトのメモリの自分の部分を割り当てるようにコピーコンストラクタを記述します。
ko: 따라서 복사 할 생성자를 작성하여 새 객체에 자체 메모리 조각을 할당하여 파기합니다.
ru: Поэтому вы пишете конструктор копирования так,чтобы он выделял новым объектам собственные куски памяти для уничтожения.
zh_cn: 因此,你写一个复制构造函数,让它分配给新对象自己的内存块来销毁。

source: This also takes care of self-assignment without an explicit check. An even more robust solution to this problem is the <a href="https://stackoverflow.com/questions/3279543/">copy-and-swap idiom</a>, but I will not go into the details of exception safety here. I only mentioned exceptions to make the following point: <strong>Writing classes that manage resources is hard.</strong>
es: Esto tambi&eacute;n se encarga de la autoasignaci&oacute;n sin una verificaci&oacute;n expl&iacute;cita. Una soluci&oacute;n a&uacute;n m&aacute;s robusta para este problema es el <a href="https://stackoverflow.com/questions/3279543/">modismo de copiar e intercambiar</a> , pero no entrar&eacute; aqu&iacute; en los detalles de seguridad de excepci&oacute;n. Solo mencion&eacute; excepciones para hacer el siguiente punto: <strong>Escribir clases que administren recursos es dif&iacute;cil.</strong>
ja: これは、明示的なチェックなしで自己割り当ても処理します。 この問題のさらに強力な解決策は、 <a href="https://stackoverflow.com/questions/3279543/">コピーとスワップのイディオム</a>ですが、ここでは例外の安全性の詳細については触れません。 私は次のポイントを作るために例外についてのみ言及しました： <strong>リソースを管理するクラスを書くのは難しいです。</strong>
ko: 또한 명시적인 확인없이 자체 할당을 처리합니다. 이 문제에 대한 더욱 강력한 해결책은 <a href="https://stackoverflow.com/questions/3279543/">copy-and-swap idiom</a> 이지만 예외 안전에 대한 자세한 내용은 다루지 않겠습니다. 나는 다음과 같은 점을 지적하기 위해 예외를 언급 <strong>했다. 자원을 관리하는 클래스를 작성하는 것은 어렵다.</strong>
ru: Это также заботится о самостоятельном назначении без явной проверки. Еще более надежное решение этой проблемы - <a href="https://stackoverflow.com/questions/3279543/">идиома копирования и обмена</a> , но я не буду вдаваться в детали безопасности исключений здесь. Я упомянул только исключения, чтобы подчеркнуть следующее: <strong>писать классы, которые управляют ресурсами, сложно.</strong>
zh_cn: 这也可以在没有明确检查的情况下进行自我分配。 解决此问题的一个更强大的解决方案是&ldquo; <a href="https://stackoverflow.com/questions/3279543/">复制和交换&rdquo;习惯用法</a> ，但是在此我将不讨论异常安全性的详细信息。 我只提到了例外，以说明以下几点： <strong>编写用于管理资源的类很困难。</strong>

source: This means that the new object and the old object will be pointing at the same piece of memory so when you change it in one object it will be changed for the other objerct too. If one object deletes this memory the other will carry on trying to use it - eek.
es: Esto significa que el nuevo y el antiguo objeto apuntarán al mismo trozo de memoria,de modo que cuando lo cambie en un objeto,también lo cambiará en el otro.Si un objeto borra esta memoria,el otro seguirá intentando usarla,eek.
ja: これは、新しいオブジェクトと古いオブジェクトが同じメモリを指していることを意味するので、一方のオブジェクトで変更すると、他方のオブジェクトでも変更されます。一方のオブジェクトがこのメモリを削除すると、他方のオブジェクトはそれを使用しようとし続けます。
ko: 즉, 새 개체와 이전 개체는 동일한 메모리 조각을 가리 키므로 한 개체에서 변경하면 다른 개체도 변경됩니다. 한 개체가이 메모리를 삭제하면 다른 개체는이 메모리를 계속 사용하려고합니다.
ru: Это означает,что новый объект и старый объект будут указывать на один и тот же участок памяти,поэтому при изменении в одном объекте он будет изменен и на другой объект.Если один объект удалит эту память,то другой продолжит пытаться ее использовать-eek.
zh_cn: 这意味着新对象和旧对象将指向同一块内存,所以当你改变一个对象时,另一个对象也会被改变。如果一个对象删除了这个内存,那么另一个对象就会继续尝试使用它-eek.

source: To resolve this you write your own version of the copy constructor and assignment operator. Your versions allocate separate memory to the new objects and copy across the values that the first pointer is pointing to rather than its address.
es: Para resolver esto,escribes tu propia versión del constructor de copias y del operador de asignaciones.Sus versiones asignan una memoria separada a los nuevos objetos y copian a través de los valores a los que apunta el primer puntero en lugar de su dirección.
ja: これを解決するには、独自のバージョンのコピーコンストラクタと代入演算子を書きます。あなたのバージョンでは、新しいオブジェクトに別々のメモリを割り当て、最初のポインタが指す値をアドレスではなくコピーします。
ko: 이 문제를 해결하려면 고유 한 버전의 복사 생성자와 할당 연산자를 작성하십시오. 버전은 새 객체에 별도의 메모리를 할당하고 첫 번째 포인터가 주소가 아닌 가리키는 값을 복사합니다.
ru: Для решения этой проблемы вы пишете свою собственную версию конструктора копирования и оператора присваивания.Ваши версии выделяют отдельную память новым объектам и копируют через значения,на которые указывает первый указатель,а не его адрес.
zh_cn: 为了解决这个问题,你可以编写自己版本的复制构造函数和赋值操作符。你的版本会给新对象分配单独的内存,并复制第一个指针指向的值而不是它的地址。

source: Unfortunately, this solution will fail if <code>new char[...]</code> throws an exception due to memory exhaustion. One possible solution is to introduce a local variable and reorder the statements:
es: Desafortunadamente, esta soluci&oacute;n fallar&aacute; si los <code>new char[...]</code> arrojan una excepci&oacute;n debido al agotamiento de la memoria. Una posible soluci&oacute;n es introducir una variable local y reordenar las declaraciones:
ja: 残念ながら、メモリ不足により <code>new char[...]</code> が例外をスローすると、このソリューションは失敗します。 考えられる解決策の1つは、ローカル変数を導入してステートメントを並べ替えることです。
ko: 불행히도 메모리 소진으로 인해 <code>new char[...]</code> 에서 예외가 발생하면이 솔루션이 실패합니다. 가능한 한 가지 해결책은 지역 변수를 도입하고 명령문을 재정렬하는 것입니다.
ru: К сожалению, это решение не сработает, если <code>new char[...]</code> вызовет исключение из-за исчерпания памяти. Одно из возможных решений - ввести локальную переменную и изменить порядок операторов:
zh_cn: 不幸的是，如果 <code>new char[...]</code> 由于内存耗尽而引发异常，则该解决方案将失败。 一种可能的解决方案是引入局部变量并对语句重新排序：

source: What are the <em>copy constructor</em> and the <em>copy assignment operator</em>?
es: &iquest;Cu&aacute;les son el <em>constructor de copia</em> y el <em>operador de asignaci&oacute;n de copia</em> ?
ja: <em>コピーコンストラクタ</em>と<em>コピー代入演算子とは</em>何ですか？
ko: <em>복사 생성자</em> 와 <em>복사 할당 연산자는</em> 무엇입니까?
ru: Что такое <em>конструктор</em> <em>копирования и оператор присваивания копии</em> ?
zh_cn: <em>复制构造函数</em>和<em>复制赋值运算符是</em>什么？

source: What are the copy constructor and the copy assignment operator? I have already used them above. The copy constructor is called when you type code such as <code>Car car2 = car1;</code> Essentially if you declare a variable and assign it in one line, that's when the copy constructor is called. The assignment operator is what happens when you use an equal sign--<code>car2 = car1;</code>. Notice <code>car2</code> isn't declared in the same statement. The two chunks of code you write for these operations are likely very similar. In fact the typical design pattern has another function you call to set everything once you're satisfied the initial copy/assignment is legitimate--if you look at the longhand code I wrote, the functions are nearly identical.
es: &iquest;Cu&aacute;les son el constructor de copia y el operador de asignaci&oacute;n de copia? Ya los he usado arriba. Se llama al constructor de copia cuando escribe c&oacute;digo como <code>Car car2 = car1;</code> Esencialmente, si declara una variable y la asigna en una l&iacute;nea, es cuando se llama al constructor de la copia. El operador de asignaci&oacute;n es lo que sucede cuando usa un signo igual: <code>car2 = car1;</code> . Observe que <code>car2</code> no se declara en la misma declaraci&oacute;n. Es probable que los dos fragmentos de c&oacute;digo que escriba para estas operaciones sean muy similares. De hecho, el patr&oacute;n de dise&ntilde;o t&iacute;pico tiene otra funci&oacute;n a la que llama para configurar todo una vez que est&aacute; satisfecho, la copia / asignaci&oacute;n inicial es leg&iacute;tima: si observa el c&oacute;digo escrito a mano, las funciones son casi id&eacute;nticas.
ja: コピーコンストラクタとコピー代入演算子とは何ですか？ 上記ですでに使用しました。 <code>Car car2 = car1;</code> などのコードを入力すると、コピーコンストラクターが呼び出されます。 基本的に、変数を宣言して1行で割り当てる場合、それはコピーコンストラクターが呼び出されるときです。 代入演算子は、等号を使用するとどうなるかです <code>car2 = car1;</code> 。 <code>car2</code> は同じステートメントで宣言されていないことに注意してください。 これらの操作のために作成する2つのコードチャンクは、非常によく似ています。 実際、典型的なデザインパターンには、最初のコピー/割り当てが正当であると満足すると、すべてを設定するために呼び出す別の関数があります-私が書いた長いコードを見ると、関数はほぼ同じです。
ko: 복사 생성자와 복사 할당 연산자는 무엇입니까? 나는 이미 그것들을 사용했다. 복사 생성자는 <code>Car car2 = car1;</code> 본질적으로 변수를 선언하고 한 줄로 지정하면 복사 생성자가 호출됩니다. 대입 연산자는 등호를 사용할 때 발생합니다 <code>car2 = car1;</code> . <code>car2</code> 는 동일한 진술에서 선언되지 않습니다. 이러한 작업을 위해 작성하는 두 코드 조각은 매우 유사합니다. 실제로 일반적인 디자인 패턴에는 초기 복사 / 할당이 만족스러운 경우 모든 것을 설정하기 위해 호출하는 또 다른 함수가 있습니다. 필자가 작성한 긴 코드를 보면 함수는 거의 동일합니다.
ru: Что такое конструктор копирования и оператор присваивания копии? Я уже использовал их выше. Конструктор копирования вызывается при вводе кода, такого как <code>Car car2 = car1;</code> По сути, если вы объявляете переменную и присваиваете ей одну строку, тогда вызывается конструктор копирования. Оператор присваивания - это то, что происходит, когда вы используете знак равенства - car2 <code>car2 = car1;</code> , Обратите внимание, что <code>car2</code> не объявлено в том же заявлении. Две части кода, которые вы пишете для этих операций, вероятно, очень похожи. На самом деле типичный шаблон проектирования имеет другую функцию, которую вы вызываете, чтобы установить все, как только вы убедитесь, что первоначальное копирование / присвоение является законным - если вы посмотрите на написанный мной от руки код, функции почти идентичны.
zh_cn: 复制构造函数和复制分配运算符是什么？ 我已经在上面使用了它们。 输入诸如 <code>Car car2 = car1;</code> 类的代码时，将调用复制构造函数。 本质上，如果您声明一个变量并在一行中分配它，那么这就是复制构造函数被调用的时候。 赋值运算符是当您使用等号时发生的事情 <code>car2 = car1;</code> 。 注意， <code>car2</code> 没有在同一语句中声明。 您为这些操作编写的两段代码可能非常相似。 实际上，典型的设计模式还提供了另一个函数，只要您对初始的复制/赋值感到满意，就可以调用它来设置所有内容-如果您查看我编写的长手代码，则这些函数几乎是相同的。

source: What does <em>copying an object</em> mean?
es: &iquest;Qu&eacute; significa <em>copiar un objeto</em> ?
ja: <em>オブジェクトのコピー</em>とはどういう意味ですか？
ko: <em>객체 복사</em> 란 무엇입니까?
ru: Что означает <em>копирование объекта</em> ?
zh_cn: <em>复制对象</em>是什么意思？

source: What does copying an object mean? There are a few ways you can copy objects--let's talk about the 2 kinds you're most likely referring to--deep copy and shallow copy.
es: ¿Qué significa copiar un objeto? Hay algunas maneras de copiar objetos...hablemos de los dos tipos a los que más probablemente te refieras...copia profunda y copia superficial.
ja: オブジェクトをコピーするとはどういうことですか?オブジェクトをコピーするにはいくつかの方法があります。
ko: 객체 복사 란 무엇입니까? 딥 카피와 얕은 카피는 객체를 복사 할 수있는 몇 가지 방법이 있습니다.
ru: Что означает копирование объекта? Есть несколько способов копирования объектов-давайте поговорим о двух видах,которые вы,скорее всего,имеете в виду-глубокое копирование и поверхностное копирование.
zh_cn: 复制对象是什么意思?有几种方法可以复制对象----让我们来谈谈你最可能提到的两种类型--深层复制和浅层复制。

source: What does it mean to copy a <code>person</code> object? The <code>main</code> function shows two distinct copying scenarios. The initialization <code>person b(a);</code> is performed by the <em>copy constructor</em>. Its job is to construct a fresh object based on the state of an existing object. The assignment <code>b = a</code> is performed by the <em>copy assignment operator</em>. Its job is generally a little more complicated, because the target object is already in some valid state that needs to be dealt with.
es: &iquest;Qu&eacute; significa copiar un objeto <code>person</code> a ? La funci&oacute;n <code>main</code> muestra dos escenarios de copia distintos. La <code>person b(a);</code> inicializaci&oacute;n b (a); es realizado por el <em>constructor de</em> la <em>copia</em> . Su trabajo es construir un objeto nuevo basado en el estado de un objeto existente. La asignaci&oacute;n <code>b = a</code> es realizada por el <em>operador de asignaci&oacute;n de copia</em> . Su trabajo es generalmente un poco m&aacute;s complicado, porque el objeto de destino ya est&aacute; en alg&uacute;n estado v&aacute;lido que necesita ser tratado.
ja: <code>person</code> オブジェクトをコピーするとはどういう意味ですか？ <code>main</code> 関数は、2つの異なるコピーシナリオを示しています。 初期化 <code>person b(a);</code> <em>コピーコンストラクタ</em>によって実行され<em>ます</em> 。 その仕事は、既存のオブジェクトの状態に基づいて新しいオブジェクトを構築することです。 代入 <code>b = a</code> は、 <em>コピー代入演算子</em>によって実行され<em>ます</em> 。 ターゲットオブジェクトは既に処理が必要な有効な状態にあるため、そのジョブは一般にもう少し複雑です。
ko: <code>person</code> 개체를 복사한다는 것은 무엇을 의미합니까? <code>main</code> 기능은 두 가지 별개의 복사 시나리오를 보여줍니다. 초기화 <code>person b(a);</code> <em>복사 생성자에</em> 의해 수행됩니다. 기존 객체의 상태에 따라 새로운 객체를 만드는 것이 그 임무입니다. 할당 <code>b = a</code> 는 <em>복사 할당 연산자에</em> 의해 수행됩니다. 대상 객체가 이미 처리해야 할 유효한 상태에 있기 때문에 작업이 일반적으로 조금 더 복잡합니다.
ru: Что значит скопировать объект <code>person</code> ? <code>main</code> функция показывает два разных сценария копирования. Инициализация <code>person b(a);</code> выполняется <em>конструктором копирования</em> . Его работа заключается в создании нового объекта на основе состояния существующего объекта. Назначение <code>b = a</code> выполняется оператором <em>копирования</em> . Его работа обычно немного сложнее, потому что целевой объект уже находится в каком-то допустимом состоянии, с которым нужно иметь дело.
zh_cn: 复制 <code>person</code> 对象是什么意思？ <code>main</code> 功能显示了两种不同的复制方案。 初始化 <code>person b(a);</code> 由<em>复制构造函数</em>执行。 它的工作是根据现有对象的状态构造一个新对象。 分配 <code>b = a</code> 由<em>副本分配运算符执行</em> 。 它的工作通常要复杂一点，因为目标对象已经处于某种需要处理的有效状态。

source: What is The Rule of Three
es: ¿Cuál es la regla de tres
ja: 三つのルールとは
ko: 세 가지 규칙은 무엇입니까
ru: Что такое правило трех
zh_cn: 什么是 "三原则"?

source: When do I need to declare them myself?
es: ¿Cuándo tengo que declararlos yo mismo?
ja: 自分で申告する必要があるのはいつですか?
ko: 언제 스스로 신고해야합니까?
ru: Когда я должен сам их объявить?
zh_cn: 我什么时候需要自己申报?

source: When do I need to declare them myself? If you are not writing code that is to be shared or for production in some manner, you really only need to declare them when you need them. You do need to be aware of what your program language does if you choose to use it 'by accident' and didn't make one--i.e. you get the compiler default. I rarely use copy constructors for instance, but assignment operator overrides are very common. Did you know you can override what addition, subtraction, etc. mean as well?
es: ¿Cuándo tengo que declararlos yo mismo? Si no estás escribiendo un código para ser compartido o para ser producido de alguna manera,sólo necesitas declararlos cuando los necesites.Necesitas ser consciente de lo que hace tu lenguaje de programa si eliges usarlo "por accidente" y no lo hiciste,es decir,obtienes el compilador por defecto.Raramente uso constructores de copias,por ejemplo,pero las anulaciones de operadores de asignaciones son muy comunes.¿Sabías que también puedes anular lo que significan la suma,la resta,etc.?
ja: 自分で宣言する必要があるのはいつですか?共有されるコードを書いていない場合や、何らかの方法で生産用のコードを書いていない場合は、本当に必要なときだけ宣言する必要があります。自分のプログラム言語を「たまたま」使っていて、それを作っていなかった場合、つまりコンパイラのデフォルト値を取得してしまった場合には、自分のプログラム言語が何をしているかを意識する必要があります。例えばコピー・コンストラクタを使うことはほとんどありませんが、代入演算子のオーバーライドは非常に一般的です。足し算、引き算などもオーバーライドできることを知っていましたか?
ko: 언제 스스로 신고해야합니까? 공유하거나 프로덕션 용 코드를 작성하지 않는 경우 필요할 때만 선언하면됩니다. 프로그램 언어를 '우연히'사용하기로 선택하고 언어를 만들지 않은 경우 (예 : 컴파일러 기본값을 사용하는 경우) 프로그램 언어의 기능을 알아야합니다. 예를 들어 복사 생성자를 거의 사용하지 않지만 할당 연산자 재정의는 매우 일반적입니다. 더하기, 빼기 등의 의미를 무시할 수 있다는 것을 알고 있습니까?
ru: Когда я должен сам их объявить? Если вы не пишете код,который должен быть распространен или для производства каким-то образом,вам действительно нужно объявлять их только тогда,когда они вам нужны.Вам действительно нужно знать,что делает ваш язык программы,если вы решили использовать его 'случайно' и не сделали его 'случайно'-т.е.вы получаете компилятор по умолчанию.Я редко использую,например,конструкторы копирования,но переопределения операторов присваивания встречаются очень часто.Знаете ли Вы,что можно переопределить и то,что означают сложение,вычитание и т.д.?
zh_cn: 我什么时候需要自己声明它们?如果你所写的代码不是以某种方式共享或用于生产,那么你只需要在需要的时候声明它们。你确实需要知道你的程序语言是怎么做的,如果你选择使用它是 "偶然 "而没有做一个--也就是说,你会得到编译器的默认值。比如说我很少使用复制构造函数,但是赋值运算符重写是很常见的。你知道你也可以覆盖加法、减法等的含义吗?
