Repository: rueisnom/feedback
Catalog: xlf/41/72/72/2/4172722.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Implicit definitions
es: Definiciones implícitas
ja: 暗黙の定義
ko: 암시 적 정의
ru: Неявные определения
zh_cn: 隐含的定义

source: In C++11 onwards you can also declare copy constructor &amp; assignment operator deleted
es: En C ++ 11 en adelante tambi&eacute;n puede declarar que el constructor de copia y el operador de asignaci&oacute;n han sido eliminados
ja: C ++ 11以降では、コピーコンストラクターと割り当て演算子の削除を宣言することもできます
ko: C ++ 11 이후에는 복사 생성자 및 할당 연산자가 삭제됨을 선언 할 수도 있습니다
ru: В C ++ 11 и далее вы также можете объявить, что конструктор копирования и оператор присваивания удалены
zh_cn: 从C ++ 11开始，您还可以声明复制构造函数和赋值运算符已删除

source: Let us consider a simple example:
es: Consideremos un simple ejemplo:
ja: 簡単な例を考えてみましょう。
ko: 간단한 예를 살펴 보겠습니다.
ru: Рассмотрим простой пример:
zh_cn: 让我们考虑一个简单的例子。

source: Let us go back in time to pre-standard C++. There was no such thing as <code>std::string</code>, and programmers were in love with pointers. The <code>person</code> class might have looked like this:
es: Volvamos en el tiempo a C ++ preest&aacute;ndar. No exist&iacute;a <code>std::string</code> , y los programadores estaban enamorados de los punteros. La clase de <code>person</code> a podr&iacute;a haberse visto as&iacute;:
ja: 以前のC ++に戻ってみましょう。 <code>std::string</code> ようなものはなく、プログラマーはポインターに夢中になりました。 <code>person</code> クラスは次のようになります。
ko: 사전 표준 C ++로 시간을 거슬러 갑시다. <code>std::string</code> 과 같은 것은 없었으며 프로그래머는 포인터를 좋아했습니다. <code>person</code> 클래스는 다음과 같습니다.
ru: Давайте вернемся назад к предстандартному C ++. Не было такого понятия, как <code>std::string</code> , и программисты были влюблены в указатели. Класс <code>person</code> мог бы выглядеть так:
zh_cn: 让我们回到过去的标准C ++。 没有 <code>std::string</code> 这样的东西，并且程序员爱上了指针。 <code>person</code> 类可能看起来像这样：

source: Managing resources
es: Gestionar los recursos...
ja: 資源の管理
ko: 자원 관리
ru: Управление ресурсами
zh_cn: 资源管理

source: Many of the existing answers already touch the copy constructor, assignment operator and destructor. However, in post C++11, the introduction of move semantic may expand this beyond 3.
es: Muchas de las respuestas existentes ya tocan al constructor de copias,al operador de asignaciones y al destructor.Sin embargo,en el post C++11,la introducción de la semántica de movimiento puede expandir esto más allá de 3.
ja: 既存の回答の多くは、すでにコピー コンストラクタ、代入演算子、デストラクタに触れています。しかし、ポスト C++11 では、move セマンティックの導入により、これが 3 を超えて拡大される可能性があります。
ko: 기존의 많은 답변이 이미 복사 생성자, 할당 연산자 및 소멸자에 닿았습니다. 그러나 포스트 C ++ 11에서 이동 의미론의 도입은 이것을 3 이상으로 확장 할 수 있습니다.
ru: Многие из существующих ответов уже касаются конструктора копирования,оператора присваивания и деструктора.Однако,в пост-С++11 введение семантики перемещения может расширить это за пределы 3.
zh_cn: 现有的很多答案已经触及到了copy构造函数、赋值操作符和destructor。但是,在C++11之后,移动语义的引入,可能会把这个扩展到3之外。

source: Memberwise copying is exactly what we want in this case: <code>name</code> and <code>age</code> are copied, so we get a self-contained, independent <code>person</code> object. The implicitly-defined destructor is always empty. This is also fine in this case since we did not acquire any resources in the constructor. The members' destructors are implicitly called after the <code>person</code> destructor is finished:
es: Copiar a los miembros es exactamente lo que queremos en este caso: se copian el <code>name</code> y la <code>age</code> , por lo que obtenemos un objeto de <code>person</code> a aut&oacute;nomo e independiente. El destructor definido impl&iacute;citamente siempre est&aacute; vac&iacute;o. Esto tambi&eacute;n est&aacute; bien en este caso ya que no adquirimos ning&uacute;n recurso en el constructor. Los destructores de los miembros se invocan impl&iacute;citamente despu&eacute;s de que el destructor de <code>person</code> as finaliza:
ja: この場合、メンバーごとのコピーがまさに必要です。 <code>name</code> と <code>age</code> がコピーされるため、自己完結型の独立した <code>person</code> オブジェクトが取得されます。 暗黙的に定義されたデストラクタは常に空です。 この場合も、コンストラクターでリソースを取得しなかったため、問題ありません。 メンバーのデストラクタは、 <code>person</code> デストラクタが終了した後に暗黙的に呼び出されます。
ko: 회원 별 복사는이 경우에 원하는 것입니다. <code>name</code> 과 <code>age</code> 가 복사되므로 독립적이고 독립적 인 <code>person</code> 개체를 얻게됩니다. 암시 적으로 정의 된 소멸자는 항상 비어 있습니다. 이 경우에도 생성자에서 리소스를 얻지 못했기 때문에 좋습니다. 구성원 소멸자는 <code>person</code> 소멸자가 완료된 후에 암시 적으로 호출됩니다.
ru: Копирование по элементам - это именно то, что мы хотим в этом случае: <code>name</code> и <code>age</code> копируются, поэтому мы получаем самостоятельный, независимый объект <code>person</code> . Неявно определенный деструктор всегда пуст. Это также хорошо в этом случае, так как мы не получили никаких ресурсов в конструкторе. Деструкторы членов неявно вызываются после завершения деструктора <code>person</code> :
zh_cn: 在这种情况下，按成员复制正是我们想要的：复制 <code>name</code> 和 <code>age</code> ，因此我们得到了一个独立的，独立的 <code>person</code> 对象。 隐式定义的析构函数始终为空。 在这种情况下也可以，因为我们没有在构造函数中获取任何资源。 在 <code>person</code> 析构函数完成之后，将隐式调用成员的析构函数：

source: Most of the time, you do not need to manage a resource yourself, because an existing class such as <code>std::string</code> already does it for you. Just compare the simple code using a <code>std::string</code> member to the convoluted and error-prone alternative using a <code>char*</code> and you should be convinced. As long as you stay away from raw pointer members, the rule of three is unlikely to concern your own code.
es: La mayor&iacute;a de las veces, no necesita administrar un recurso usted mismo, porque una clase existente como <code>std::string</code> ya lo hace por usted. Simplemente compare el c&oacute;digo simple usando un miembro <code>std::string</code> con la alternativa enrevesada y propensa a errores usando un <code>char*</code> y deber&iacute;a estar convencido. Siempre y cuando se mantenga alejado de los miembros de puntero sin procesar, es poco probable que la regla de tres se refiera a su propio c&oacute;digo.
ja: ほとんどの場合、 <code>std::string</code> などの既存のクラスがすでに管理しているため、リソースを自分で管理する必要はありません。 <code>std::string</code> メンバーを使用した単純なコードと、 <code>char*</code> を使用した複雑でエラーが発生しやすい代替コードを比較するだけで、納得するはずです。 生のポインターメンバーから離れている限り、3つのルールが自分のコードに関係することはほとんどありません。
ko: <code>std::string</code> 과 같은 기존 클래스가 이미이를 수행하므로 대부분의 경우 리소스를 직접 관리 할 필요가 없습니다. <code>std::string</code> 멤버를 사용하는 간단한 코드를 <code>char*</code> 사용하여 복잡하고 오류가 발생하기 쉬운 대안과 비교하면 확실합니다. 원시 포인터 멤버에서 멀리 떨어져있는 한 세 규칙은 자신의 코드와 관련이 없습니다.
ru: В большинстве случаев вам не нужно самостоятельно управлять ресурсом, потому что существующий класс, такой как <code>std::string</code> уже делает это за вас. Просто сравните простой код, использующий элемент <code>std::string</code> с извилистой и подверженной ошибкам альтернативой, использующей <code>char*</code> и вы должны убедиться в этом. Пока вы держитесь подальше от необработанных членов-указателей, правило трех вряд ли будет касаться вашего собственного кода.
zh_cn: 大多数时候，您不需要自己管理资源，因为诸如 <code>std::string</code> 类的现有类已经为您完成了。 只需将使用 <code>std::string</code> 成员的简单代码与使用 <code>char*</code> 进行卷积且容易出错的替代方法进行比较，您应该被说服。 只要您远离原始指针成员，三个规则就不太可能涉及您自己的代码。

source: Noncopyable resources
es: Recursos no copiables
ja: コピー不可のリソース
ko: 복사 할 수없는 리소스
ru: Некопируемые ресурсы
zh_cn: 不可复制的资源

source: Note the difference between initialization and assignment: we must tear down the old state before assigning to <code>name</code> to prevent memory leaks. Also, we have to protect against self-assignment of the form <code>x = x</code>. Without that check, <code>delete[] name</code> would delete the array containing the <em>source</em> string, because when you write <code>x = x</code>, both <code>this-&gt;name</code> and <code>that.name</code> contain the same pointer.
es: Tenga en cuenta la diferencia entre inicializaci&oacute;n y asignaci&oacute;n: debemos derribar el estado anterior antes de asignar un <code>name</code> para evitar p&eacute;rdidas de memoria. Adem&aacute;s, debemos protegernos contra la autoasignaci&oacute;n de la forma <code>x = x</code> . Sin esa verificaci&oacute;n, <code>delete[] name</code> eliminar&iacute;a la matriz que contiene la cadena de <em>origen</em> , porque cuando escribe <code>x = x</code> , tanto <code>this-&gt;name</code> como <code>that.name</code> contienen el mismo puntero.
ja: 初期化と割り当ての違いに注意してください。 <code>name</code> に割り当てる前に古い状態を破棄して、メモリリークを防ぐ必要があります。 また、 <code>x = x</code> という形式の自己割り当てから保護する必要があります。 このチェックがなければ、 <code>delete[] name</code> は<em>ソース</em>文字列を含む配列を削除します。 <code>that.name</code> は、 <code>x = x</code> と書き込むと、 <code>this-&gt;name</code> とthat.nameの両方に同じポインターが含まれるためです。
ko: 초기화와 할당의 차이점에 유의하십시오. 메모리 누수를 방지하기 위해 <code>name</code> 에 할당하기 전에 이전 상태를 해제해야합니다. 또한 <code>x = x</code> 형식의 자체 할당으로부터 보호해야합니다. 이 검사가 없으면 <code>delete[] name</code> 은 <em>소스</em> 문자열을 포함하는 배열을 삭제합니다. <code>x = x</code> 를 쓸 때 <code>this-&gt;name</code> 과 <code>that.name</code> 모두 동일한 포인터를 포함하기 때문입니다.
ru: Обратите внимание на разницу между инициализацией и назначением: мы должны разрушить старое состояние перед назначением <code>name</code> чтобы предотвратить утечки памяти. Также мы должны защитить себя от самостоятельного присвоения вида <code>x = x</code> . Без этой проверки <code>delete[] name</code> удалит массив, содержащий <em>исходную</em> строку, потому что когда вы пишете <code>x = x</code> , и <code>this-&gt;name</code> , и <code>that.name</code> содержат один и тот же указатель.
zh_cn: 注意初始化和赋值之间的区别：我们必须在分配给 <code>name</code> 之前拆除旧状态，以防止内存泄漏。 同样，我们必须防止 <code>x = x</code> 形式的自赋值。 如果没有该检查， <code>delete[] name</code> 将删除包含<em>源</em>字符串的数组，因为当您编写 <code>x = x</code> ， <code>this-&gt;name</code> 和 <code>that.name</code> 都包含相同的指针。

source: Now let's do something strange. Let's say car2 is either programmed wrong or purposely meant to share the actual memory that car1 is made of. (It's usually a mistake to do this and in classes is usually the blanket it's discussed under.) Pretend that anytime you ask about car2, you're really resolving a pointer to car1's memory space...that's more or less what a shallow copy is.
es: Ahora hagamos algo extraño.Digamos que el coche 2 está mal programado o que está destinado a compartir la memoria real de la que está hecho el coche 1.(Suele ser un error hacer esto y en las clases suele ser la manta de la que se habla.)Imagina que cada vez que preguntas por el coche 2,estás resolviendo un puntero al espacio de memoria del coche 1...eso es más o menos lo que es una copia superficial.
ja: 奇妙なことをしてみよう car2が間違ってプログラムされているか、または意図的にcar1が作られている実際のメモリを共有することを意図しているとしましょう。(通常、このようなことをするのは間違いであり、授業では大抵の場合、このようなことが議論されることになります)。あなたがcar2について尋ねるときはいつでも、あなたは本当にcar1のメモリ空間へのポインタを解決していると仮定してください...それは浅いコピーが多かれ少なかれ何であるかを示しています。
ko: 이제 이상한 것을하자. car2가 잘못 프로그래밍되었거나 의도적으로 car1의 실제 메모리를 공유하도록되어 있다고 가정 해 봅시다. (이 작업을 수행하는 것은 일반적으로 실수이며 수업 시간에는 일반적으로 아래에서 논의되는 담요입니다.) car2에 대해 질문 할 때마다 car1의 메모리 공간에 대한 포인터를 실제로 해결하고 있다고 가정하십시오. 입니다.
ru: А теперь давайте сделаем что-нибудь странное.Допустим,car2 либо неправильно запрограммирован,либо специально предназначен для совместного использования реальной памяти,из которой сделан car1.(Обычно это ошибка,а в классах это,как правило,одеяло,о котором идет речь).Притворитесь,что каждый раз,когда вы спрашиваете о car2,вы действительно разрешаете указатель на пространство памяти car1...это более или менее мелкая копия.
zh_cn: 现在我们来做一个奇怪的事情。假设car2不是编程错了,就是故意把car1的实际内存与car1共享。(这样做通常是错误的,在课堂上通常都是在这种情况下讨论的空穴来风)。假设每次问到car2的时候,你真的是在解析一个指向car1的内存空间的指针...........这差不多就是浅层次的复制。

source: Once <code>b</code> is destroyed, <code>a.name</code> is a dangling pointer.
es: Una vez que se destruye <code>b</code> , <code>a.name</code> es un puntero colgante.
ja: <code>b</code> が破棄されると、 <code>a.name</code> はぶら下がりポインタです。
ko: <code>b</code> 가 파괴되면 <code>a.name</code> 은 매달려있는 포인터입니다.
ru: Как только <code>b</code> уничтожен, <code>a.name</code> является висящим указателем.
zh_cn: 一旦 <code>b</code> 被销毁， <code>a.name</code> 是一个悬空指针。

source: Once, one of these deletes the memory in its destructor, the other will have a pointer to invalid memory (this is called a dangling pointer) when it tries to use it things are going to get hairy.
es: Una vez,uno de estos borra la memoria en su destructor,el otro tendrá un puntero a la memoria inválida (esto se llama un puntero colgante)cuando trate de usarlo las cosas se van a poner peliagudas.
ja: これらのうちの1つがデストラクタでメモリを削除すると、もう1つは無効なメモリへのポインタを持つことになります(これはダングリングポインタと呼ばれています)。
ko: 이 중 하나가 소멸자에서 메모리를 삭제하면 다른 하나는 메모리를 사용하려고 할 때 유효하지 않은 메모리 (이것은 매달려 포인터라고 함)에 대한 포인터를 갖게됩니다.
ru: Как только один из них удалит память в своем деструкторе,другой будет иметь указатель на некорректную память (это называется висячий указатель),когда он попытается ее использовать,вещи станут волосатыми.
zh_cn: 一旦,其中一个删除了它的解构器中的内存,另一个就会有一个指向无效内存的指针(这叫做悬空指针),当它试图使用它的时候,事情就会变得很麻烦。

source: Recently Michael Claisse gave a talk that touches this topic: <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class</a>
es: Recientemente, Michael Claisse dio una charla que toca este tema: <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class</a>
ja: 最近、Michael Claisseがこのトピックに触れる講演を行いました： <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http</a> ://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class
ko: 최근 마이클 클라이 스 (Michael Claisse)는이 주제에 관한 강연을했다 : <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class</a>
ru: Недавно Майкл Клэсс выступил с докладом на эту тему: <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class</a>
zh_cn: 最近，迈克尔&middot;克莱斯（Michael Claisse）发表了涉及该主题的演讲： <a href="http://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class">http</a> ://channel9.msdn.com/events/CPP/C-PP-Con-2014/The-Canonical-Class

source: Rule of three in C++ is a fundamental principle of the design and the development of three requirements that if there is clear definition in one of the following member function, then the programmer should define the other two members functions together. Namely the following three member functions are indispensable: destructor, copy constructor, copy assignment operator.
es: La regla de tres en C++es un principio fundamental del diseño y el desarrollo de tres requisitos que si hay una definición clara en una de las siguientes funciones de los miembros,entonces el programador debe definir las otras dos funciones de los miembros juntas.A saber,las siguientes tres funciones miembros son indispensables:destructor,constructor de copias,operador de asignación de copias.
ja: C++における3要件のルールとは、以下のメンバ関数のいずれかに明確な定義があれば、プログラマは他の2つのメンバ関数を一緒に定義する必要があるという設計・開発の基本原則です。具体的には、デストラクタ、コピーコンストラクタ、コピー代入演算子の3つのメンバ関数が不可欠です。
ko: C ++에서 3의 규칙은 다음 멤버 함수 중 하나에 명확한 정의가있는 경우 프로그래머가 다른 두 멤버 함수를 함께 정의해야하는 세 가지 요구 사항의 설계 및 개발의 기본 원칙입니다. 즉, 소멸자, 복사 생성자, 복사 할당 연산자의 세 가지 멤버 함수는 필수입니다.
ru: Правило трех в языке Си++-это основополагающий принцип проектирования и разработки трех требований,согласно которому если в одной из следующих членских функций дано четкое определение,то программист должен определить вместе две другие членские функции.А именно:деструктор,конструктор копирования,оператор присваивания копий.
zh_cn: 在C++中,三条规则是设计和开发中的一个基本原则,即如果在下面的成员函数中,有一个成员函数有明确的定义,那么程序员就应该把另外两个成员函数一起定义。即以下三个成员函数缺一不可:destructor、copy构造函数、copy赋值操作符。

source: Since memberwise copying does not have the desired effect, we must define the copy constructor and the copy assignment operator explicitly to make deep copies of the character array:
es: Como la copia de miembros no tiene el efecto deseado,debemos definir el constructor de la copia y el operador de asignación de la copia explícitamente para hacer copias profundas de la matriz de caracteres:
ja: メンバ単位のコピーでは期待した効果が得られないので、文字配列の深いコピーを行うには、コピーコンストラクタとコピー代入演算子を明示的に定義する必要があります。
ko: 멤버 별 복사는 원하는 효과가 없으므로 문자 배열의 깊은 복사본을 만들려면 복사 생성자와 복사 할당 연산자를 명시 적으로 정의해야합니다.
ru: Так как членское копирование не имеет желаемого эффекта,мы должны явно определить конструктор копирования и оператор присваивания копий,чтобы сделать глубокие копии символьного массива:
zh_cn: 由于成员式复制并没有达到预期的效果,所以我们必须明确定义复制构造函数和复制赋值操作符来对字符数组进行深度复制。

source: Since the assignment does not take into account what <code>name</code> pointed to before the assignment, sooner or later you will get memory leaks all over the place.
es: Dado que la asignaci&oacute;n no tiene en cuenta el <code>name</code> se&ntilde;alado antes de la asignaci&oacute;n, tarde o temprano obtendr&aacute; p&eacute;rdidas de memoria por todas partes.
ja: 割り当てでは、割り当て前に指している <code>name</code> が考慮されないため、遅かれ早かれ、場所全体でメモリリークが発生します。
ko: 배정은 배정 이전에 어떤 <code>name</code> 가리키는 지 고려하지 않기 때문에 조만간 메모리 누수가 발생합니다.
ru: Поскольку в назначении не учитывается <code>name</code> указывало до назначения, рано или поздно вы обнаружите утечки памяти повсюду.
zh_cn: 由于分配没有考虑分配前所指的 <code>name</code> ，因此迟早您会在各处发现内存泄漏。

source: Since we declared neither the copy constructor nor the assignment operator (nor the destructor) ourselves, these are implicitly defined for us. Quote from the standard:
es: Como no declaramos ni el constructor de la copia ni el operador de la asignación (ni el destructor)nosotros mismos,estos están implícitamente definidos para nosotros.Cita de la norma:
ja: コピーコンストラクタも代入演算子も(デストラクタも)自分たちで宣言していないので、これらは暗黙のうちに定義されています。標準から引用します。
ko: 우리는 복사 생성 자나 할당 연산자 (또는 소멸자)를 선언하지 않았기 때문에 암시 적으로 정의되어 있습니다. 표준에서 인용 :
ru: Поскольку мы сами не объявили ни конструктора копирования,ни оператора присваивания (ни деструктора),то для нас они неявно определены.Цитата из стандарта:
zh_cn: 由于我们自己声明了copy构造函数和赋值操作符(也没有destructor),所以这些都是隐含地为我们定义的。引用标准中的说法。

source: Since we're in an object-oriented language (or at least are assuming so), let's say you have a piece of memory allocated. Since it's an OO-language, we can easily refer to chunks of memory we allocate because they are usually primitive variables (ints, chars, bytes) or classes we defined that are made of our own types and primitives. So let's say we have a class of Car as follows:
es: Ya que estamos en un lenguaje orientado a los objetos (o al menos lo estamos asumiendo),digamos que tienes un trozo de memoria asignado.Como es un lenguaje OO,podemos referirnos fácilmente a los trozos de memoria que asignamos porque son normalmente variables primitivas (ints,chars,bytes)o clases que definimos que están hechas de nuestros propios tipos y primitivos.Así que digamos que tenemos una clase de Car como la siguiente:
ja: ここではオブジェクト指向言語を使っているので(少なくともそう仮定しています)、メモリの一部が割り当てられているとしましょう。オブジェクト指向言語なので、割り当てたメモリの塊は、通常はプリミティブ変数(int、char、byte)であったり、独自の型やプリミティブで作られたクラスを定義しているので、簡単に参照することができます。そこで、次のようなCarのクラスがあるとしましょう。
ko: 우리는 객체 지향 언어 (또는 최소한 그렇게 가정하고 있음)이므로 메모리 조각이 할당되었다고 가정 해 봅시다. OO 언어이므로 할당 된 메모리 청크를 쉽게 참조 할 수 있습니다. 메모리 청크는 대개 기본 변수 (int, char, bytes) 또는 자체 유형과 프리미티브로 정의 된 클래스이기 때문에 할당합니다. 다음과 같이 Car 클래스가 있다고 가정 해 봅시다.
ru: Поскольку мы находимся на объектно-ориентированном языке (или,по крайней мере,предполагаем,что это так),допустим,у вас выделена часть памяти.Так как это объектно-ориентированный язык,мы можем легко обратиться к выделенным кускам памяти,потому что это обычно примитивные переменные (ints,chars,bytes)или классы,которые мы определили и которые сделаны из наших собственных типов и примитивов.Так что,допустим,у нас есть класс Car следующим образом:
zh_cn: 既然我们是在面向对象语言中(或者至少是假设是这样),假设你有一块内存被分配了。因为是面向对象语言,所以我们可以很容易地引用我们分配的内存大块,因为它们通常都是我们定义的基元变量(ints、chars、bytes)或者是我们定义的类,这些类是由我们自己的类型和基元组成的。所以,我们假设我们有一个类Car,如下图所示。

source: So regardless of what language you're writing in, be very careful about what you mean when it comes to copying objects because most of the time you want a deep copy.
es: Así que,independientemente del idioma en el que escribas,ten mucho cuidado con lo que quieres decir cuando se trata de copiar objetos porque la mayoría de las veces quieres una copia profunda.
ja: だから、あなたがどの言語で書いているかに関係なく、ほとんどの場合、あなたは深いコピーを望んでいるので、それがオブジェクトをコピーすることになると、あなたが何を意味するかについて非常に注意してください。
ko: 따라서 어떤 언어로 작성하든 관계없이 대부분의 경우 딥 카피를 원하기 때문에 객체를 복사 할 때의 의미에 유의하십시오.
ru: Поэтому,независимо от того,на каком языке вы пишете,будьте очень осторожны,когда речь заходит о копировании объектов,потому что в большинстве случаев вам нужна глубокая копия.
zh_cn: 所以不管你用什么语言写作,在临摹对象的时候一定要非常小心,因为大多数时候你要的是深度临摹。

source: So when should we declare those special member functions explicitly? When our class <em>manages a resource</em>, that is, when an object of the class is <em>responsible</em> for that resource. That usually means the resource is <em>acquired</em> in the constructor (or passed into the constructor) and <em>released</em> in the destructor.
es: Entonces, &iquest;cu&aacute;ndo debemos declarar expl&iacute;citamente esas funciones miembro especiales? Cuando nuestra clase <em>administra un recurso</em> , es decir, cuando un objeto de la clase es <em>responsable</em> de ese recurso. Eso generalmente significa que el recurso se <em>adquiere</em> en el constructor (o se pasa al constructor) y se <em>libera</em> en el destructor.
ja: では、これらの特別なメンバー関数をいつ明示的に宣言する必要があるのでしょうか。 クラス<em>がリソースを管理する</em>とき、つまり、クラスのオブジェクトがそのリソースを<em>担当</em>するとき。 これは通常、リソースがコンストラクターで<em>取得</em>され（またはコンストラクターに渡され）、デストラクタで<em>解放さ</em>れることを意味します。
ko: 그렇다면 언제 특수 멤버 함수를 명시 적으로 선언해야합니까? 클래스 <em>가 리소스를 관리</em> 할 때, 즉 클래스의 객체가 해당 리소스를 <em>담당</em> 할 때. 이는 일반적으로 생성자에서 리소스를 <em>얻</em> 거나 생성자로 전달하여 소멸자에서 <em>해제</em> 한다는 것을 의미합니다.
ru: Итак, когда мы должны объявить эти специальные функции-члены явно? Когда наш класс <em>управляет ресурсом</em> , то есть когда объект класса <em>отвечает</em> за этот ресурс. Обычно это означает, что ресурс получается в конструкторе (или передается в конструктор) и <em>освобождается</em> в деструкторе.
zh_cn: 那么什么时候应该明确声明那些特殊的成员函数呢？ 当我们的班级<em>管理资源时</em> ，也就是说，当班级的对象<em>负责</em>该资源时。 这通常意味着资源是在构造函数中<em>获取</em>的（或传递到构造函数中）并在析构函数中<em>释放</em>的。

source: Some resources cannot or should not be copied, such as file handles or mutexes. In that case, simply declare the copy constructor and copy assignment operator as <code>private</code> without giving a definition:
es: Algunos recursos no pueden o no deben copiarse, como identificadores de archivos o mutexes. En ese caso, simplemente declare el constructor de copia y el operador de asignaci&oacute;n de copia como <code>private</code> sin dar una definici&oacute;n:
ja: ファイルハンドルやミューテックスなど、一部のリソースはコピーできません。 その場合は、定義を行わずに、コピーコンストラクターとコピー代入演算子を <code>private</code> として宣言するだけです。
ko: 파일 핸들 또는 뮤텍스와 같은 일부 리소스는 복사 할 수 없거나 복사해서는 안됩니다. 이 경우 정의를 제공하지 않고 복사 생성자와 복사 할당 연산자를 <code>private</code> 으로 선언하면됩니다.
ru: Некоторые ресурсы не могут или не должны копироваться, такие как дескрипторы файлов или мьютексы. В этом случае просто объявите конструктор копирования и оператор присваивания копирования как <code>private</code> без определения:
zh_cn: 某些资源不能或不应被复制，例如文件句柄或互斥体。 在这种情况下，只需将复制构造函数和复制赋值运算符声明为 <code>private</code> 而不给出定义：

source: Sometimes you need to implement a class that manages a resource. (Never manage multiple resources in a single class, this will only lead to pain.) In that case, remember the <strong>rule of three</strong>:
es: A veces necesita implementar una clase que gestione un recurso. (Nunca administre m&uacute;ltiples recursos en una sola clase, esto solo provocar&aacute; dolor). En ese caso, recuerde la <strong>regla de tres</strong> :
ja: 場合によっては、リソースを管理するクラスを実装する必要があります。 （単一のクラスで複数のリソースを管理しないでください。これは痛みにつながるだけです。）その場合、 <strong>3つ</strong>の<strong>ルールを</strong>覚えておいてください。
ko: 때때로 자원을 관리하는 클래스를 구현해야합니다. (단일 클래스에서 여러 리소스를 관리하지 않으면 고통을 초래할뿐입니다.)이 경우 <strong>세 가지 규칙을</strong> 기억하십시오.
ru: Иногда вам нужно реализовать класс, который управляет ресурсом. (Никогда не управляйте несколькими ресурсами в одном классе, это только приведет к боли.) В этом случае помните <strong>правило трех</strong> :
zh_cn: 有时您需要实现一个管理资源的类。 （永远不要在一个类中管理多个资源，这只会导致痛苦。）在这种情况下，请记住以下<strong>三个规则</strong> ：
