Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Using <a href="https://docs.python.org/3/library/os.html#os.scandir">scandir()</a> instead of <a href="https://docs.python.org/3/library/os.html#os.listdir">listdir()</a> can significantly increase the performance of code that also needs file type or file attribute information, because <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> objects expose this information if the operating system provides it when scanning a directory. All <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> methods may perform a system call, but <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir()</a> and <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file()</a> usually only require a system call for symbolic links; <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat()</a> always requires a system call on Unix but only requires one for symbolic links on Windows.
es: El uso de <a href="https://docs.python.org/3/library/os.html#os.scandir">scandir () en</a> lugar de <a href="https://docs.python.org/3/library/os.html#os.listdir">listdir ()</a> puede aumentar significativamente el rendimiento del c&oacute;digo que tambi&eacute;n necesita informaci&oacute;n de tipo de archivo o atributo de archivo, porque los objetos <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> exponen esta informaci&oacute;n si el sistema operativo la proporciona al escanear un directorio. Todos los m&eacute;todos <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> pueden realizar una llamada al sistema, pero <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir ()</a> y <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file ()</a> generalmente solo requieren una llamada al sistema para enlaces simb&oacute;licos; <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat ()</a> siempre requiere una llamada al sistema en Unix, pero solo requiere una para enlaces simb&oacute;licos en Windows.
ja: <a href="https://docs.python.org/3/library/os.html#os.scandir">listdir（）の</a>代わりに<a href="https://docs.python.org/3/library/os.html#os.listdir">scandir（）</a>を使用すると、ファイルタイプまたはファイル属性情報も必要とするコードのパフォーマンスを大幅に向上させることができます。 すべての<a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a>メソッドはシステムコールを実行できますが、 <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir（）</a>および<a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file（）</a>は通常、シンボリックリンクのシステムコールのみを必要とします。 <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat（）</a>は、Unixでは常にシステムコールを必要としますが、Windowsではシンボリックリンクに対してのみ必要です。
ko: <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> 객체는 디렉토리를 스캔 할 때 운영 체제에서 정보를 제공하는 경우 os.DirEntry 객체가이 정보를 노출하므로 <a href="https://docs.python.org/3/library/os.html#os.listdir">listdir</a> <a href="https://docs.python.org/3/library/os.html#os.scandir">()</a> 대신 scandir ()을 사용하면 파일 유형 또는 파일 속성 정보가 필요한 코드의 성능이 크게 향상 될 수 있습니다. 모든 <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> 메소드는 시스템 호출을 수행 할 수 있지만 <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir ()</a> 및 <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file ()은</a> 일반적으로 기호 링크에 대한 시스템 호출 만 필요합니다. <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat ()는</a> 항상 Unix에서 시스템 호출이 필요하지만 Windows에서는 기호 링크에 대한 호출 만 필요합니다.
ru: Использование <a href="https://docs.python.org/3/library/os.html#os.scandir">scandir ()</a> вместо <a href="https://docs.python.org/3/library/os.html#os.listdir">listdir ()</a> может значительно повысить производительность кода, который также нуждается в информации о типе файла или атрибуте файла, поскольку объекты <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> предоставляют эту информацию, если операционная система предоставляет ее при сканировании каталога. Все методы <a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a> могут выполнять системный вызов, но для <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir ()</a> и <a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file ()</a> обычно требуется только системный вызов для символических ссылок; <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat ()</a> всегда требует системного вызова в Unix, но требует только одного для символических ссылок в Windows.
zh_cn: 使用<a href="https://docs.python.org/3/library/os.html#os.scandir">scandir（）</a>而不是<a href="https://docs.python.org/3/library/os.html#os.listdir">listdir（）</a>可以大大提高还需要文件类型或文件属性信息的代码的性能，因为如果操作系统在扫描目录时提供了<a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a>对象，则os.DirEntry对象将公开此信息。 所有<a href="https://docs.python.org/3/library/os.html#os.DirEntry">os.DirEntry</a>方法都可以执行系统调用，但是<a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_dir">is_dir（）</a>和<a href="https://docs.python.org/3/library/os.html#os.DirEntry.is_file">is_file（）</a>通常只需要系统调用即可进行符号链接。 <a href="https://docs.python.org/3/library/os.html#os.DirEntry.stat">os.DirEntry.stat（）</a>在Unix上始终需要系统调用，而在Windows上只需要一个系统调用即可。

source: We like <code>try</code> because it avoids race conditions. With <code>try</code>, you simply attempt to read your file, expecting it to be there, and if not, you catch the exception and perform whatever fallback behavior makes sense.
es: Nos gusta <code>try</code> porque evita las condiciones de carrera. Con <code>try</code> , simplemente intentas leer tu archivo, esperando que est&eacute; all&iacute;, y si no, capturas la excepci&oacute;n y realizas cualquier comportamiento alternativo que tenga sentido.
ja: 競合状態を回避できるため、 <code>try</code> 好きです。 <code>try</code> を使用すると 、ファイルが存在することを期待してファイルを読み取ろうとするだけです。そうでない場合は、例外をキャッチして、意味のあるフォールバック動作を実行します。
ko: 경쟁 조건을 피하기 때문에 <code>try</code> 좋아합니다. <code>try</code> 를 사용하면 파일을 읽으려고 시도하고 파일이있을 것으로 예상하고 그렇지 않은 경우 예외를 포착하고 대체 동작이 의미가있는 모든 것을 수행합니다.
ru: Нам нравится <code>try</code> потому что это избегает условий гонки. С помощью <code>try</code> вы просто пытаетесь прочитать свой файл, ожидая, что он будет там, а если нет, то перехватываете исключение и выполняете любое резервное поведение, которое имеет смысл.
zh_cn: 我们喜欢 <code>try</code> 因为它避免了比赛条件。 使用 <code>try</code> ，您只需尝试读取文件，期望它在那里，否则，您将捕获异常并执行有意义的后备行为。

source: You can (and usually should) still use a <code>try/except</code> block when opening files:
es: Puede (y normalmente deber&iacute;a) seguir usando un bloque <code>try/except</code> al abrir archivos:
ja: ファイルを開くときに、 <code>try/except</code> ブロックを引き続き使用できます（通常はそうする必要があります）。
ko: 파일을 열 때 <code>try/except</code> 블록을 계속 사용할 수 있습니다.
ru: Вы можете (и обычно должны) по-прежнему использовать блок <code>try/except</code> при открытии файлов:
zh_cn: 您可以（通常应该）在打开文件时仍然使用 <code>try/except</code> 块：

source: You can also test if a file is a certain type of file using <code>os.path.splitext()</code> to get the extension (if you don't already know it)
es: Tambi&eacute;n puede probar si un archivo es un cierto tipo de archivo usando <code>os.path.splitext()</code> para obtener la extensi&oacute;n (si a&uacute;n no lo sabe)
ja: <code>os.path.splitext()</code> を使用してファイルが特定のタイプのファイルであるかどうかをテストして、拡張子を取得することもできます（まだわからない場合）。
ko: 확장명을 얻기 위해 <code>os.path.splitext()</code> 를 사용하여 파일이 특정 유형의 파일인지 테스트 할 수도 있습니다 ( 아직 모르는 경우)
ru: Вы также можете проверить, является ли файл файлом определенного типа, используя <code>os.path.splitext()</code> чтобы получить расширение (если вы его еще не знаете)
zh_cn: 您还可以使用 <code>os.path.splitext()</code> 来获取扩展名（如果您尚不知道），以测试文件是否为某种文件类型

source: You can also use <code>resolve(strict=True)</code> in a <code>try</code> block:
es: Tambi&eacute;n puede usar <code>resolve(strict=True)</code> en un bloque de <code>try</code> :
ja: <code>try</code> ブロックで <code>resolve(strict=True)</code> を使用することもできます。
ko: <code>try</code> 블록에서 <code>resolve(strict=True)</code> 를 사용할 수도 있습니다.
ru: Вы также можете использовать <code>resolve(strict=True)</code> в блоке <code>try</code> :
zh_cn: 您也可以在 <code>try</code> 块中使用 <code>resolve(strict=True)</code> ：

source: You can follow these three ways:
es: Puedes seguir estos tres caminos:
ja: この3つの方法を踏襲することができます。
ko: 다음 세 가지 방법을 수행 할 수 있습니다.
ru: Ты можешь следовать этим трем путям:
zh_cn: 你可以按照这三种方式进行。

source: You can use the "OS" library of Python:
es: Puedes usar la biblioteca "OS" de Python:
ja: Pythonの「OS」ライブラリが使えます。
ko: 파이썬의 "OS"라이브러리를 사용할 수 있습니다 :
ru: Вы можете использовать библиотеку "OS" на Python:
zh_cn: 你可以使用Python的 "OS "库。

source: You can write Brian's suggestion without the <code>try:</code>.
es: Puedes escribir la sugerencia de Brian sin el <code>try:</code>
ja: あなたは <code>try:</code> せずにブライアンの提案を書くことができます： 。
ko: <code>try:</code> 하지 않고 Brian의 제안을 쓸 수 있습니다.
ru: Вы можете написать предложение Брайана без <code>try:</code>
zh_cn: 您无需 <code>try:</code> 即可撰写Brian的建议： 。

source: You could try this (safer):
es: Podrías probar esto (más seguro):
ja: これを試してみてはいかがでしょうか(安全です)。
ko: 이것을 시도 할 수 있습니다 (safer) :
ru: Ты можешь попробовать это (безопаснее):
zh_cn: 你可以试试这个(更安全)。

source: You have the <a href="https://docs.python.org/2/library/os.path.html#os.path.exists"><code>os.path.exists</code></a> function:
es: Tiene la funci&oacute;n <a href="https://docs.python.org/2/library/os.path.html#os.path.exists"> <code>os.path.exists</code> </a> :
ja: あなたは<a href="https://docs.python.org/2/library/os.path.html#os.path.exists"> <code>os.path.exists</code> </a>関数を持っています：
ko: <a href="https://docs.python.org/2/library/os.path.html#os.path.exists"> <code>os.path.exists</code> </a> 함수가 있습니다 :
ru: У вас есть функция <a href="https://docs.python.org/2/library/os.path.html#os.path.exists"> <code>os.path.exists</code> </a> :
zh_cn: 您具有<a href="https://docs.python.org/2/library/os.path.html#os.path.exists"> <code>os.path.exists</code> </a>函数：

source: [Python 3]: os.<strong>walk</strong>(<em>top, topdown=True, onerror=None, followlinks=False</em>)
es: [Python 3]: os. <strong>caminar</strong> ( <em>top, topdown = True, onerror = None, followlinks = False</em> )
ja: [Python 3]：os。 <strong>ウォーク</strong> （ <em>top、topdown = True、onerror = None、followlinks = False</em> ）
ko: [파이썬 3] : os. <strong>도보</strong> ( <em>top, topdown = True, onerror = None, followlinks = False</em> )
ru: [Python 3]: ос. <strong>ходьба</strong> ( <em>top, topdown = True, onerror = None, последующие ссылки = False</em> )
zh_cn: [Python 3]：操作系统。 <strong>步行</strong> （ <em>top，topdown = True，onerror = None，followlinks = False</em> ）

source: from the <a href="https://docs.python.org/library/os.path.html#os.path.isfile">docs</a>:
es: de los <a href="https://docs.python.org/library/os.path.html#os.path.isfile">documentos</a> :
ja: <a href="https://docs.python.org/library/os.path.html#os.path.isfile">ドキュメント</a>から：
ko: <a href="https://docs.python.org/library/os.path.html#os.path.isfile">문서에서</a> :
ru: из <a href="https://docs.python.org/library/os.path.html#os.path.isfile">документов</a> :
zh_cn: 从<a href="https://docs.python.org/library/os.path.html#os.path.isfile">文档</a> ：

source: if you need to be sure it's a file.
es: si necesitas estar seguro de que es un archivo.
ja: ファイルであることを確認する必要がある場合は
ko: 파일인지 확인해야하는 경우
ru: если тебе нужно быть уверенным,что это файл.
zh_cn: 如果你需要确定它是一个文件。

source: is better written as:
es: se escribe mejor como:
ja: と書いた方が良いでしょう。
ko: 다음과 같이 작성하는 것이 좋습니다.
ru: лучше написано как:
zh_cn: 最好写成:

source: it's just a <strong><em>try</em></strong> / <strong><em>except</em></strong> block around <a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3]: os.<strong>stat</strong>(<em>path, *, dir_fd=None, follow_symlinks=True</em>)</a>. So, your code is <strong><em>try</em></strong> / <strong><em>except</em></strong> free, but lower in the framestack there's (at least) <strong>one</strong> such block. This also applies to other funcs (<strong>including</strong><code>os.path.isfile</code>).
es: es solo un bloque <strong><em>try</em></strong> / <strong><em>except</em></strong> alrededor de <a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3]: os.</a> <strong>stat</strong> ( <em>ruta, *, dir_fd = Ninguno, follow_symlinks = Verdadero</em> ) . Entonces, su c&oacute;digo es <strong><em>try</em></strong> / <strong><em>except</em></strong> free, pero m&aacute;s abajo en el framestack hay (al menos) <strong>uno de</strong> esos bloques. Esto tambi&eacute;n se aplica a otros funcs ( <strong>incluido</strong> <code>os.path.isfile</code> ).
ja: これは、 <a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3]の</a>周辺のブロックです。 <strong>stat</strong> （ <em>path、*、dir_fd = None、follow_symlinks = True</em> ） 。 したがって、あなたのコードは<strong><em>try</em></strong> / free <strong><em>を除い</em></strong>てですが、フレームスタックの下には（少なくとも） <strong>その</strong>ようなブロックが<strong>1つあり</strong>ます。 これは他の関数（ <code>os.path.isfile</code> <strong>を含む</strong> ）にも適用されます。
ko: <a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3] : os</a> 주변의 <strong><em>시도</em></strong> / <strong><em>제외</em></strong> 블록 입니다. <strong>stat</strong> ( <em>path, *, dir_fd = None, follow_symlinks = True</em> ) . 따라서 코드는 무료 / <strong><em>시도를</em></strong> <strong><em>제외하고</em></strong> <strong><em>시도</em></strong> 하지만 프레임 스택에는 (적어도) 그러한 블록이 <strong>하나</strong> 이상 있습니다. 이것은 다른 기능 ( <code>os.path.isfile</code> <strong>포함</strong> )에도 적용됩니다.
ru: это просто блок <strong><em>try</em></strong> / <strong><em>исключением</em></strong> <a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3]: os.</a> <strong>stat</strong> ( <em>путь, *, dir_fd = нет, follow_symlinks = True</em> ) . Итак, ваш код <strong><em>попробуйте</em></strong> / <strong><em>за исключением</em></strong> бесплатного, но ниже в стеке фреймов есть (по крайней мере) <strong>один</strong> такой блок. Это также относится к другим функциям ( <strong>включая</strong> <code>os.path.isfile</code> ).
zh_cn: 它只是<a href="https://docs.python.org/3/library/os.html#os.stat">[Python 3]</a> <strong><em>之外</em></strong>的<strong><em>try</em></strong> / <strong><em>except</em></strong>块：os。 <strong>stat</strong> （ <em>path，*，dir_fd = None，follow_symlinks = True</em> ） 。 因此，您的代码是<strong><em>try</em></strong> / <strong><em>除外（</em></strong>免费），但是在帧堆栈中的（至少） <strong>一个</strong>这样的块较低。 这也适用于其他功能（ <strong>包括</strong> <code>os.path.isfile</code> ）。

source: to test if it's a file specifically. It follows symlinks.
es: para comprobar si es un archivo específicamente.Sigue los enlaces simbólicos.
ja: を使って、それが特定のファイルかどうかをテストします。シンボリックリンクに従います。
ko: 구체적으로 파일인지 테스트합니다. 심볼릭 링크를 따릅니다.
ru: чтобы проверить,если это именно файл.Он следует за симлинками.
zh_cn: 来测试它是否是专门的文件。它遵循的是symlinks。

source: via <a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]: python/cpython - (master) cpython/Modules/posixmodule.c</a>
es: a trav&eacute;s de <a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]: python / cpython - (maestro) cpython / Modules / posixmodule.c</a>
ja: <a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]</a>経由：python / cpython-（マスター）cpython / Modules / posixmodule.c
ko: <a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]</a> 를 통해 : python / cpython-(마스터) cpython / Modules / posixmodule.c
ru: через <a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]: python / cpython - (основной) cpython / Modules / posixmodule.c</a>
zh_cn: 通过<a href="https://github.com/python/cpython/blob/master/Modules/posixmodule.c">[GitHub]：python / cpython-（master）cpython / Modules / posixmodule.c</a>

source: <em>Nix</em>: <a href="http://man7.org/linux/man-pages/man3/opendir.3.html">[man7]: OPENDIR(3)</a> / <a href="http://man7.org/linux/man-pages/man3/readdir.3.html">[man7]: READDIR(3)</a> / <a href="http://man7.org/linux/man-pages/man3/closedir.3.html">[man7]: CLOSEDIR(3)</a>
es: <em>Nix</em> : <a href="http://man7.org/linux/man-pages/man3/opendir.3.html">[man7]: OPENDIR (3)</a> / <a href="http://man7.org/linux/man-pages/man3/readdir.3.html">[man7]: READDIR (3)</a> / <a href="http://man7.org/linux/man-pages/man3/closedir.3.html">[man7]: CERRADO (3)</a>
