Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you intend to do something with the file, I would suggest directly attempting it with a try-except to avoid a race condition:
es: Si tiene intención de hacer algo con el archivo,le sugiero que lo intente directamente con una excepción para evitar una condición de carrera:
ja: ファイルを使って何かをするつもりなら、競合状態を避けるためにtry-exceptを使って直接試すことをお勧めします。
ko: 파일로 무언가를하려는 경우 경쟁 조건을 피하기 위해 시도를 제외하고 직접 시도해 보는 것이 좋습니다.
ru: Если вы собираетесь что-то сделать с этим файлом,я бы посоветовал попробовать напрямую,за исключением случаев,когда это необходимо,чтобы избежать состояния гонки:
zh_cn: 如果你打算对这个文件做一些事情,我建议直接用try-except来进行尝试,避免出现竞赛条件。

source: If you need file locking, that's a different matter.
es: Si necesitas un bloqueo de archivos,eso es otra cosa.
ja: ファイルロックが必要なのであれば、それは別問題です。
ko: 파일 잠금이 필요한 경우 다른 문제입니다.
ru: Если тебе нужна блокировка файлов,это другое дело.
zh_cn: 如果你需要文件锁定,那是另一回事。

source: If you need high-level operations, use <code>shutil</code>.
es: Si necesita operaciones de alto nivel, use <code>shutil</code> .
ja: 高レベルの操作が必要な場合は、 <code>shutil</code> を使用してください 。
ko: 높은 수준의 작업이 필요한 경우 <code>shutil</code> 을 사용하십시오.
ru: Если вам нужны операции высокого уровня, используйте <code>shutil</code> .
zh_cn: 如果您需要高级操作，请使用 <code>shutil</code> 。

source: If you want to check that a file exists before you attempt to read it, and you might be deleting it and then you might be using multiple threads or processes, or another program knows about that file and could delete it - you risk the chance of a <strong>race condition</strong> if you check it exists, because you are then <em>racing</em> to open it before its <em>condition</em> (its existence) changes.
es: Si desea verificar que exista un archivo antes de intentar leerlo, y podr&iacute;a estar borr&aacute;ndolo y luego podr&iacute;a estar usando m&uacute;ltiples hilos o procesos, u otro programa conoce ese archivo y podr&iacute;a eliminarlo; corre el riesgo de la posibilidad de una <strong>condici&oacute;n de carrera</strong> si verifica que existe, porque entonces est&aacute; <em>corriendo</em> para abrirla antes de que cambie su <em>condici&oacute;n</em> (su existencia).
ja: ファイルを読み取る前にファイルが存在することを確認したい場合、そのファイルを削除して複数のスレッドまたはプロセスを使用している可能性があります。または、別のプログラムがそのファイルを認識しており、削除できる可能性があります。 <em>状態</em> （存在）が変化する前に開くために<strong>競合している</strong>ため、存在を確認すると<strong>競合状態になり</strong>ます。
ko: 파일을 읽기 전에 파일이 존재하는지 확인하고 파일을 삭제 한 후 여러 스레드 또는 프로세스를 사용 중이거나 다른 프로그램이 해당 파일에 대해 알고이를 삭제할 수있는 경우 <strong>경쟁 조건</strong> 이 존재하는지 확인하는 경우 <strong>경쟁 조건</strong> 이 존재하기 전에 <strong>경쟁 조건</strong> 을 열기 위해 <em>경쟁</em> 하기 때문입니다.
ru: Если вы хотите проверить, что файл существует, прежде чем пытаться его прочитать, и, возможно, вы удаляете его, и тогда вы можете использовать несколько потоков или процессов, или другая программа знает об этом файле и может удалить его - вы рискуете состояние <strong>гонки,</strong> если вы проверяете, существует ли оно, потому что вы <em>стремитесь</em> открыть его до того, как его <em>состояние</em> (его существование) изменится.
zh_cn: 如果要在尝试读取文件之前检查文件是否存在，并且可能要删除它，然后使用多个线程或进程，或者另一个程序知道该文件并可能将其删除，则可能会有以下风险：如果您检查它是否存在，则为<strong>竞赛条件</strong> ，因为您随后在其<em>条件</em> （存在）改变之前就<em>竞相</em>打开它。

source: If you want to read a file, if it exists, do
es: Si quieres leer un archivo,si existe,hazlo.
ja: ファイルが存在する場合、ファイルを読みたい場合は
ko: 파일을 읽으려면 파일이 있으면 수행하십시오.
ru: Если вы хотите прочитать файл,если он существует,сделайте следующее.
zh_cn: 如果你想读取一个文件,如果它存在,请执行

source: If you want to write to a file, if it doesn't exist, do
es: Si quieres escribir en un archivo,si no existe,hazlo...
ja: ファイルに書き込みたい場合、ファイルが存在しない場合は
ko: 파일에 쓰려면 존재하지 않는 경우
ru: Если вы хотите записать в файл,если его не существует,сделайте следующее.
zh_cn: 如果你想写到一个文件,如果它不存在的话,请执行

source: If you're not planning to open the file immediately, you can use <a href="https://docs.python.org/library/os.path.html#os.path.isfile"><code>os.path.isfile</code></a>
es: Si no planea abrir el archivo de inmediato, puede usar <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>os.path.isfile</code> </a>
ja: ファイルをすぐに開く予定がない場合は、 <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>os.path.isfile</code> </a>を使用できます。
ko: 파일을 즉시 열지 않으려는 경우 <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>os.path.isfile</code> 을</a> 사용할 수 있습니다
ru: Если вы не планируете открывать файл немедленно, вы можете использовать <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>os.path.isfile</code> </a>
zh_cn: 如果您不打算立即打开文件，则可以使用<a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>os.path.isfile</code> </a>

source: If you're on Python 2, you can backport the pathlib module from pypi, <a href="https://pypi.python.org/pypi/pathlib2/"><code>pathlib2</code></a>, or otherwise check <code>isfile</code> from the <code>os.path</code> module:
es: Si est&aacute; en Python 2, puede hacer una copia de seguridad del m&oacute;dulo pathlib desde pypi, <a href="https://pypi.python.org/pypi/pathlib2/"> <code>pathlib2</code> </a> o, de lo contrario, verificar <code>isfile</code> desde el m&oacute;dulo <code>os.path</code> :
ja: Python 2を使用している場合は、pypi、 <a href="https://pypi.python.org/pypi/pathlib2/"> <code>pathlib2</code> </a>からpathlibモジュールをバックポートするか、os.pathモ​​ジュールからisfileを確認 <code>os.path</code> ます。
ko: Python 2를 사용하는 경우 pypi, <a href="https://pypi.python.org/pypi/pathlib2/"> <code>pathlib2</code> </a> 에서 pathlib 모듈을 백 포트하거나 <code>os.path</code> 모듈에서 <code>isfile</code> 을 확인할 수 있습니다.
ru: Если вы работаете на Python 2, вы можете перенести модуль pathlib <a href="https://pypi.python.org/pypi/pathlib2/"> <code>pathlib2</code> </a> из pypi, pathlib2 или иначе проверить <code>isfile</code> из модуля <code>os.path</code> :
zh_cn: 如果您使用的是Python 2，则可以从pypi， <a href="https://pypi.python.org/pypi/pathlib2/"> <code>pathlib2</code> 反向</a>移植pathlib模块，或者通过 <code>os.path</code> 模块检查 <code>isfile</code> ：

source: Importing <code>os</code> makes it easier to navigate and perform standard actions with your operating system.
es: Importar sistema operativo hace que sea m&aacute;s f&aacute;cil navegar y realizar acciones est&aacute;ndar con su sistema operativo.
ja: <code>os</code> をインポートすると、オペレーティングシステムでの移動や標準アクションの実行が容易になります。
ko: <code>os</code> 를 가져 오면 운영 체제에서 보다 쉽게 ​​탐색하고 표준 조치를 수행 할 수 있습니다.
ru: Импорт ОС облегчает навигацию и выполнение стандартных действий с вашей операционной системой.
zh_cn: 导入 <code>os</code> 可以更轻松地在操作系统中导航和执行标准操作。

source: In 2016 the best way is still using <code>os.path.isfile</code>:
es: En 2016, la mejor manera es seguir usando <code>os.path.isfile</code> :
ja: 2016年の最良の方法は、依然として <code>os.path.isfile</code> を使用することです。
ko: 2016 년 가장 좋은 방법은 여전히 <code>os.path.isfile</code> 을 사용하는 것입니다.
ru: В 2016 году лучшим способом по-прежнему является использование <code>os.path.isfile</code> :
zh_cn: 在2016年，最好的方法仍然是使用 <code>os.path.isfile</code> ：

source: In 2016, this is still arguably the easiest way to check if both a file exists and if it is a file:
es: En 2016,esta sigue siendo la forma más fácil de comprobar si existe un archivo y si es un archivo:
ja: 2016年になっても、ファイルが存在するかどうか、ファイルであるかどうかの両方を確認する方法としては、これが最も簡単な方法であることは間違いありません。
ko: 2016 년에도 파일이 존재하는지 파일인지 확인하는 가장 쉬운 방법입니다.
ru: В 2016 году это все еще,пожалуй,самый простой способ проверить,существует ли файл и является ли он файлом:
zh_cn: 在2016年,这可以说仍然是最简单的方法,既要检查一个文件是否存在,又要检查它是否是一个文件。

source: Install some third-party module with filesystem capabilities
es: Instalar algún módulo de terceros con capacidades de sistema de archivos
ja: ファイルシステム機能を持つサードパーティ製モジュールをインストールする
ko: 파일 시스템 기능이있는 일부 타사 모듈 설치
ru: Установите сторонний модуль с возможностями файловой системы
zh_cn: 安装一些具有文件系统功能的第三方模块

source: Instead hardcoding <em>libc</em>'s path (<em>"/lib/x86_64-linux-gnu/libc.so.6"</em>) which may (and most likely, will) vary across systems, <em>None</em> (or the empty string) can be passed to <em>CDLL</em> constructor (<strong><code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code></strong>). According to <a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]: DLOPEN(3)</a>:
es: En lugar de codificar la ruta de <em>libc</em> ( <em>"/lib/x86_64-linux-gnu/libc.so.6"</em> ) que puede (y muy probablemente variar&aacute;) entre sistemas, <em>Ninguno</em> (o la cadena vac&iacute;a) se puede pasar al constructor <em>CDLL</em> ( <strong> <code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code> </strong> ). De acuerdo con <a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]: DLOPEN (3)</a> :
ja: 代わりに、 <em>libc</em>のパス（ <em>"/lib/x86_64-linux-gnu/libc.so.6"</em> ）を<em>ハードコーディングします。</em>これは、システム間で異なる可能性があり（ほとんどの場合）、 <em>なし</em> （または空の文字列）を<em>CDLL</em>コンストラクターに渡すことができます。 （ <strong> <code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code> </strong> ）。 <a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]に</a>よると：DLOPEN（3） ：
ko: 대신 시스템에 따라 다를 수있는 <em>libc</em> 의 경로 ( <em>"/lib/x86_64-linux-gnu/libc.so.6"</em> )를 하드 코딩하는 대신 <em>CDLL</em> 생성자에 <em>None</em> (또는 빈 문자열)을 전달할 수 있습니다. ( <strong> <code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code> </strong> ). <a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]</a> 에 따르면 : DLOPEN (3) :
ru: Вместо этого, <em>жестко запрограммировав</em> путь к <em>libc</em> ( <em>"/lib/x86_64-linux-gnu/libc.so.6"</em> ), который может (и, скорее всего, будет) различаться в разных системах, <em>None</em> (или пустая строка) можно <em>передать</em> конструктору <em>CDLL</em> ( <strong> <code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code> </strong> ). Согласно <a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]: DLOPEN (3)</a> :
zh_cn: 而是硬编码<em>libc</em>的路径（ <em>&ldquo; /lib/x86_64-linux-gnu/libc.so.6&rdquo;</em> ），该路径在整个系统之间可能（而且很可能会有所不同）， <em>无</em> （或空字符串）可以传递给<em>CDLL</em>构造函数（ <strong> <code>ctypes.CDLL(None).access(b"/tmp", os.F_OK)</code> </strong> ）。 根据<a href="http://man7.org/linux/man-pages/man3/dlopen.3.html">[man7]：DLOPEN（3）</a> ：

source: It also creates a context manager which, by unconditionally returning <code>True</code>, allows all Exceptions (including <code>KeyboardInterrupt</code> and <code>SystemExit</code>!) to pass silently, which is a good way to hide bugs.
es: Tambi&eacute;n crea un administrador de contexto que, al devolver incondicionalmente <code>True</code> , permite que todas las Excepciones (&iexcl;incluyendo <code>KeyboardInterrupt</code> y <code>SystemExit</code> !) Pasen en silencio, lo cual es una buena manera de ocultar errores.
ja: また、無条件に <code>True</code> を返すことにより、すべての例外（ <code>KeyboardInterrupt</code> および <code>SystemExit</code> ！を含む）をサイレントに渡すことができるコンテキストマネージャーも作成します。これはバグを非表示にするための優れた方法です。
ko: 또한 무조건 <code>True</code> 를 반환하여 모든 예외 ( <code>KeyboardInterrupt</code> 및 <code>SystemExit</code> ! 포함)가 자동으로 전달되도록하는 컨텍스트 관리자를 작성하여 버그를 숨기는 좋은 방법입니다.
ru: Он также создает менеджер контекста, который, безоговорочно возвращая <code>True</code> , позволяет всем исключениям (включая <code>KeyboardInterrupt</code> и <code>SystemExit</code> !) Проходить без вывода сообщений, что является хорошим способом скрыть ошибки.
zh_cn: 它还创建了一个上下文管理器，通过无条件返回 <code>True</code> ，允许所有异常（包括 <code>KeyboardInterrupt</code> 和 <code>SystemExit</code> ！）以静默方式传递，这是隐藏错误的好方法。

source: It also suffers from the same race condition problems as <code>isfile</code>. From the <a href="https://docs.python.org/2/library/os.html#os.access">docs</a>:
es: Tambi&eacute;n sufre los mismos problemas de condici&oacute;n de carrera que el <code>isfile</code> . De los <a href="https://docs.python.org/2/library/os.html#os.access">documentos</a> :
ja: また、 <code>isfile</code> と同じ競合状態の問題が発生します 。 <a href="https://docs.python.org/2/library/os.html#os.access">ドキュメント</a>から：
ko: 또한 <code>isfile</code> 과 동일한 경쟁 조건 문제가 있습니다 . <a href="https://docs.python.org/2/library/os.html#os.access">문서에서</a> :
ru: Он также страдает от тех же проблем состояния гонки, что и <code>isfile</code> . Из <a href="https://docs.python.org/2/library/os.html#os.access">документов</a> :
zh_cn: 它也遭受与 <code>isfile</code> 相同的竞争条件问题。 从<a href="https://docs.python.org/2/library/os.html#os.access">文档</a> ：

source: It doesn't seem like there's a meaningful functional difference between try/except and <code>isfile()</code>, so you should use which one makes sense.
es: No parece que haya una diferencia funcional significativa entre try / except y <code>isfile()</code> , por lo que debe usar cu&aacute;l tiene sentido.
ja: try / exceptと <code>isfile()</code> の間に意味のある機能的な違いがあるようには見えないので、どちらが意味があるかを使用する必要があります。
ko: try / except와 <code>isfile()</code> 사이에 의미있는 기능적 차이가있는 것 같지 않으므로 어느 것이 적합한 지 사용해야합니다.
ru: Не похоже, что между try / исключением и <code>isfile()</code> есть существенное функциональное различие, поэтому вы должны использовать, какой из них имеет смысл.
zh_cn: 在try / except和 <code>isfile()</code> 之间似乎没有有意义的功能差异，因此您应该使用哪个才有意义。

source: It uses <code>os.listdir</code> (<code>os.scandir</code> when available)
es: Utiliza <code>os.listdir</code> ( <code>os.scandir</code> cuando est&aacute; disponible)
ja: <code>os.listdir</code> （使用可能な場合はos.scandir ）を使用します
ko: <code>os.listdir</code> (사용 가능한 경우 <code>os.scandir</code> ) 을 사용합니다.
ru: Он использует <code>os.listdir</code> ( <code>os.scandir</code> , когда доступно)
zh_cn: 它使用 <code>os.listdir</code> （ <code>os.scandir</code> 时为os.scandir ）

source: It's a fancier (and more <em>python</em>ic) way of handling paths, <strong>but</strong>
es: Es una forma m&aacute;s elegante (y m&aacute;s <em>python</em> ic) de manejar rutas, <strong>pero</strong>
ja: パスを処理するためのより洗練された（そしてより多くの<em>python</em> ic）方法です<strong>が、</strong>
ko: 경로를 다루는 더 환상적인 (그리고 <em>파이썬</em> ic) 방법 <strong>이지만</strong>
ru: Это более изящный (и более питонский) способ обработки путей, <strong>но</strong>
zh_cn: 这是一种处理路径的更好的方式（以及更多的<em>python</em> ic）， <strong>但是</strong>

source: Just to avoid confusion and based on the answers I got, current answer finds either a file <strong>or</strong> a directory with the given name.
es: Solo para evitar confusiones y seg&uacute;n las respuestas que obtuve, la respuesta actual encuentra un archivo <strong>o</strong> un directorio con el nombre.
ja: 混乱を避けるために、そして私が得た答えに基づいて、現在の答えは指定された名前のファイル<strong>または</strong>ディレクトリを見つけます。
ko: 혼란을 피하고 내가 얻은 답변을 기반으로 현재 답변은 파일 <strong>이나</strong> 주어진 이름의 디렉토리를 찾습니다.
ru: Просто чтобы избежать путаницы и основываясь на полученных мной ответах, текущий ответ находит либо файл, <strong>либо</strong> каталог с заданным именем.
zh_cn: 为了避免混淆，并根据我得到的答案，当前答案会找到具有给定名称的文件<strong>或</strong>目录。

source: Longer, much more pedantic answer
es: Una respuesta más larga y mucho más pedante
ja: より長い、はるかに衒学的な答え
ko: 더 길고 훨씬 더 답답한 답변
ru: Более длинный,гораздо более педантичный ответ
zh_cn: 更长,更迂腐的答案

source: Main (current) program (<em>python</em>) is linked against <em>libc</em>, so its symbols (including <em>access</em>) will be loaded
es: El programa principal (actual) ( <em>python</em> ) est&aacute; vinculado contra <em>libc</em> , por lo que se cargar&aacute;n sus s&iacute;mbolos (incluido el <em>acceso</em> )
ja: メイン（現在の）プログラム（ <em>python</em> ）は<em>libc</em>にリンクされているため、そのシンボル（ <em>access</em>を含む）が読み込まれます
ko: 메인 (현재) 프로그램 ( <em>python</em> )은 <em>libc에</em> 연결되어 있으므로 심볼 ( <em>액세스</em> 포함) 이로 드됩니다
ru: Основная (текущая) программа ( <em>python</em> ) связана с <em>libc</em> , поэтому ее символы (включая <em>доступ</em> ) будут загружены
zh_cn: 主（当前）程序（ <em>python</em> ）与<em>libc</em>链接，因此将加载其符号（包括<em>access</em> ）

source: Most likely, will rely on one of the ways above (maybe with slight customizations).
es: Lo más probable es que dependa de una de las formas anteriores (tal vez con ligeras personalizaciones).
ja: ほとんどの場合、上記の方法のいずれかに頼ることになるでしょう(若干のカスタマイズが必要かもしれません)。
ko: 아마도 위의 방법 중 하나에 의존 할 것입니다 (약간의 사용자 정의가있을 수 있음).
ru: Скорее всего,будет опираться на один из вышеперечисленных способов (возможно,с небольшими настройками).
zh_cn: 最有可能的是,将依靠上述方式之一(也许有轻微的自定义)。

source: Note1: The <code>os.path.isfile</code> used only for files
es: Nota 1: el archivo <code>os.path.isfile</code> utilizado solo para archivos
ja: 注1：ファイルにのみ使用される <code>os.path.isfile</code>
ko: 참고 1 : <code>os.path.isfile</code> 은 파일에만 사용됩니다.
ru: Примечание 1: <code>os.path.isfile</code> используется только для файлов
zh_cn: 注意1： <code>os.path.isfile</code> 仅用于文件

source: Note2: The <code>os.path.exists</code> used for both files and directories
es: Nota 2: el <code>os.path.exists</code> utilizado para archivos y directorios
ja: 注2：ファイルとディレクトリの両方に使用される <code>os.path.exists</code>
ko: 참고 2 : <code>os.path.exists</code> 는 파일과 디렉토리 모두에 사용됩니다.
ru: Примечание 2: <code>os.path.exists</code> используется как для файлов, так и для каталогов.
zh_cn: 注意2： <code>os.path.exists</code> 用于文件和目录

source: Note: Using access() to check if a user is authorized to e.g. open a file before actually doing so using open() creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It&rsquo;s preferable to use EAFP techniques. For example:
es: Nota: El uso de access () para verificar si un usuario est&aacute; autorizado para, por ejemplo, abrir un archivo antes de hacerlo usando open () crea un agujero de seguridad, porque el usuario podr&iacute;a explotar el breve intervalo de tiempo entre verificar y abrir el archivo para manipularlo. Es preferible utilizar t&eacute;cnicas EAFP. Por ejemplo:
ja: 注：access（）を使用して、ユーザーが実際にファイルを開くことを許可されているかどうかを確認してから、実際にopen（）を使用すると、セキュリティホールが発生します。 EAFP手法を​​使用することをお勧めします。 例えば：
ko: 참고 : open ()을 사용하여 실제로 파일을 열 수있는 권한이 있는지 확인하기 위해 access ()를 사용하는 경우 사용자가 파일을 확인하고 열어서 파일을 조작하는 데 걸리는 짧은 시간 간격을 이용할 수 있으므로 보안 허점이 생깁니다. EAFP 기술을 사용하는 것이 좋습니다. 예를 들면 다음과 같습니다.
ru: Примечание. Использование access () для проверки того, авторизован ли пользователь, например, открыть файл перед тем, как на самом деле это сделать, с помощью open () создает дыру в безопасности, поскольку пользователь может использовать короткий промежуток времени между проверкой и открытием файла для манипулирования им. Желательно использовать методики EAFP. Например:
zh_cn: 注意：在实际使用open（）之前，使用access（）检查用户是否被授权例如打开文件会造成安全漏洞，因为用户可能会利用检查和打开文件之间的较短时间间隔来操作它。 最好使用EAFP技术。 例如：

source: Now available since Python 3.4, import and instantiate a <code>Path</code> object with the file name, and check the <code>is_file</code> method (note that this returns True for symlinks pointing to regular files as well):
es: Ahora disponible desde Python 3.4, importe e instancia un objeto <code>Path</code> con el nombre del archivo y verifique el m&eacute;todo <code>is_file</code> (tenga en cuenta que esto devuelve True para los enlaces simb&oacute;licos que tambi&eacute;n apuntan a archivos normales):
ja: Python 3.4以降で利用可能になり、 <code>Path</code> オブジェクトをインポートしてファイル名でインスタンス化し、 <code>is_file</code> メソッドを確認します（これにより、通常のファイルを指すシンボリックリンクに対してもTrueが返されることに注意してください）。
ko: Python 3.4부터 사용할 수 있으므로 파일 이름으로 <code>Path</code> 객체를 가져 와서 인스턴스화하고 <code>is_file</code> 메소드를 확인하십시오 (정규 파일을 가리키는 심볼 링크의 경우 True를 반환합니다).
ru: Доступный начиная с Python 3.4, импортируйте и создайте экземпляр объекта <code>Path</code> с именем файла и проверьте метод <code>is_file</code> (обратите внимание, что он возвращает True для символических ссылок, также указывающих на обычные файлы):
zh_cn: 从Python 3.4开始可用，导入并实例化具有文件名的 <code>Path</code> 对象，并检查 <code>is_file</code> 方法（请注意，对于指向常规文件的符号链接，该方法也返回True）：

source: Now the above is probably the best pragmatic direct answer here, but there's the possibility of a race condition (depending on what you're trying to accomplish), and the fact that the underlying implementation uses a <code>try</code>, but Python uses <code>try</code> everywhere in its implementation.
es: Ahora, lo anterior es probablemente la mejor respuesta directa pragm&aacute;tica aqu&iacute;, pero existe la posibilidad de una condici&oacute;n de carrera (dependiendo de lo que intente lograr), y el hecho de que la implementaci&oacute;n subyacente usa un <code>try</code> , pero Python usa el <code>try</code> en todas partes en su implementaci&oacute;n.
ja: 今、上記はおそらくここで最も実用的な直接的な答えですが、競合状態の可能性があります（達成しようとしていることに依存します）。また、基礎となる実装は <code>try</code> を使用しますが、Pythonはそのすべての場所で <code>try</code> を使用します。実装。
ko: 위의 내용은 아마도 가장 실용적인 직접 답변이지만, 달성하려는 목표에 따라 경쟁 조건이 발생할 가능성이 있으며 기본 구현은 <code>try</code> 를 사용하지만 Python은 이행.
ru: Вышеприведенное, вероятно, является лучшим прагматическим прямым ответом здесь, но есть возможность условия гонки (в зависимости от того, что вы пытаетесь выполнить) и тот факт, что базовая реализация использует <code>try</code> , но Python использует <code>try</code> везде в своем реализация.
zh_cn: 现在，上面可能是这里最好的实用直接答案，但是有可能出现竞态条件（取决于您要完成的工作），并且底层实现使用 <code>try</code> ，但Python在其各处都使用 <code>try</code> 的事实实施。

source: One example would be (again, <em>Win</em> specific) <a href="https://github.com/mhammond/pywin32">[GitHub]: mhammond/pywin32 - Python for Windows (pywin32) Extensions</a>, which is a <em>Python</em> wrapper over <em>WINAPI</em>s.
es: Un ejemplo ser&iacute;a (nuevamente, <em>Win</em> espec&iacute;fico) <a href="https://github.com/mhammond/pywin32">[GitHub]: mhammond / pywin32 - Python para Windows (pywin32) Extensiones</a> , que es un contenedor de <em>Python</em> sobre <em>WINAPI</em> .
ja: 1つの例は（再び、 <em>Win</em>固有） <a href="https://github.com/mhammond/pywin32">[GitHub]です：mhammond / pywin32-Python for Windows（pywin32）Extensions</a> 、これは<em>WINAPI</em>の<em>Python</em>ラッパーです。
ko: 하나의 예는 (다시 <em>Win에</em> 따라) <a href="https://github.com/mhammond/pywin32">[GitHub] : mhammond / pywin32-Windows 용 Python (pywin32) Extensions</a> 는 <em>WINAPI</em> 의 <em>Python</em> 래퍼입니다.
ru: Одним примером может быть (опять же, специфичный для <em>Win</em> ) <a href="https://github.com/mhammond/pywin32">[GitHub]: mhammond / pywin32 - расширения Python для Windows (pywin32)</a> , которые являются оболочкой <em>Python</em> поверх <em>WINAPI</em> .
zh_cn: 一个示例是（再次，特定于<em>Win</em> ） <a href="https://github.com/mhammond/pywin32">[GitHub]：mhammond / pywin32-Windows专用的Python（pywin32）Extensions</a> ，它是<em>WINAPI</em>的<em>Python</em>包装器。

source: Opening the file will always verify the existence of the file. You can make a function just like so:
es: Abrir el archivo siempre verificará la existencia del mismo.Puedes hacer una función igual:
ja: ファイルを開くと必ずファイルの存在が確認されます。みたいな機能を作ることができます。
ko: 파일을 열면 항상 파일이 있는지 확인합니다. 다음과 같이 기능을 만들 수 있습니다.
ru: При открытии файла всегда будет проверяться его существование.Вы можете сделать такую же функцию:
zh_cn: 打开文件总是会验证文件的存在。你可以像这样做一个功能。

source: Or in Python 3 you can use <code>pathlib</code>:
es: O en Python 3 puedes usar <code>pathlib</code> :
ja: または、Python 3では <code>pathlib</code> を使用できます。
ko: 또는 파이썬 3에서는 <code>pathlib</code> 를 사용할 수 있습니다 :
ru: Или в Python 3 вы можете использовать <code>pathlib</code> :
zh_cn: 或者在Python 3中，您可以使用 <code>pathlib</code> ：

source: Other options that don't meet the ask for "without try":
es: Otras opciones que no cumplen con la petición de "sin intentarlo":
ja: 試さずに」という要望に応えられない他の選択肢
ko: "시도없이"를 요구하지 않는 다른 옵션 :
ru: Другие варианты,которые не отвечают на просьбу "без попытки":
zh_cn: 其他不符合要求 "不试 "的选项。

source: Perhaps easier with a try:
es: Tal vez sea más fácil con un intento:
ja: 試してみると簡単かもしれません。
ko: 시도해 보면 더 쉬울 것입니다.
ru: Возможно,проще с попыткой:
zh_cn: 也许是试一试更容易。
