Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Personally, I prefer this one because under the hood, it calls native APIs (via "${PYTHON_SRC_DIR}/Modules/posixmodule.c"), but it also opens a gate for possible user errors, and it's not as Pythonic as other variants:
es: Personalmente,prefiero esta porque bajo el capó,llama a las APIs nativas (a través de "${PYTHON_SRC_DIR}Modulesposixmodule.c"),pero también abre una puerta para posibles errores de usuario,y no es tan pitónica como otras variantes:
ja: 個人的には、これの方がいいと思います。なぜなら、フードの下ではネイティブAPIを呼び出していますが("${PYTHON_SRC_DIR}Modulesposixmodule.c "を介して)、ユーザーのエラーの可能性のあるゲートを開いていますし、他の亜種ほどPythonicではないからです。
ko: 개인적으로 필자는 기본 API ( "$ {PYTHON_SRC_DIR} /Modules/posixmodule.c"를 통해)를 호출하지만 가능한 사용자 오류에 대한 문을 열며 다른 변형만큼 파이썬 적이 지 않기 때문에 이것을 선호합니다. :
ru: Лично я предпочитаю этот,потому что под капотом он вызывает нативные API (через "${PYTHON_SRC_DIR}Modulesposixmodule.c"),но также открывает ворота для возможных пользовательских ошибок,и он не такой Pythonic,как другие варианты:
zh_cn: 我个人更喜欢这个,因为在引擎盖下,它可以调用原生API(通过"${PYTHON_SRC_DIR}Modulesposixmodule.c"),但它也为用户可能的错误打开了一扇门,而且它不像其他变体那样Pythonic。

source: Prefer the try statement. It's considered better style and avoids race conditions.
es: Prefiero la declaración de prueba.Se considera un mejor estilo y evita las condiciones de la carrera.
ja: トライステートメントを好む。それはより良いスタイルと考えられており、レースの条件を避けることができます。
ko: try 문을 선호하십시오. 더 나은 스타일로 간주되며 경쟁 조건을 피합니다.
ru: Предпочитаю попробовать.Считается лучшим стилем и избегает условий гонки.
zh_cn: 更喜欢尝试的说法。这被认为是比较好的风格,避免了比赛的情况。

source: Python 3.4 gives us the <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"><code>suppress</code></a> context manager (previously the <a href="https://bugs.python.org/issue19266"><code>ignore</code></a> context manager), which does semantically exactly the same thing in fewer lines, while also (at least superficially) meeting the original ask to avoid a <code>try</code> statement:
es: Python 3.4 nos da el administrador de contexto de <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"> <code>suppress</code> </a> (anteriormente el administrador de contexto de <a href="https://bugs.python.org/issue19266"> <code>ignore</code> </a> ), que hace sem&aacute;nticamente exactamente lo mismo en menos l&iacute;neas, mientras que tambi&eacute;n (al menos superficialmente) cumple con la solicitud original para evitar una declaraci&oacute;n de <code>try</code> :
ja: Python 3.4により、 <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"> <code>suppress</code> </a>コンテキストマネージャー（以前は<a href="https://bugs.python.org/issue19266"> <code>ignore</code> </a>コンテキストマネージャー）が提供されます。これは、意味的にはまったく同じことを少ない行で実行すると同時に、（少なくとも表面的には）元の要求を満たし、 <code>try</code> ステートメントを回避します。
ko: 파이썬 3.4는 <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"> <code>suppress</code> </a> 컨텍스트 관리자 (이전의 컨텍스트 관리자 <a href="https://bugs.python.org/issue19266"> <code>ignore</code> </a> )를 제공합니다.이 컨텍스트 관리자는 의미 상 정확히 몇 줄로 동일한 것을 수행하며 <code>try</code> 문을 피하라는 원래의 요청을 (적어도 피상적으로) 충족시킵니다.
ru: Python 3.4 предоставляет нам менеджер <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"> <code>suppress</code> </a> контекста (ранее менеджер <a href="https://bugs.python.org/issue19266"> <code>ignore</code> </a> контекста), который выполняет семантически точно то же самое в меньшем количестве строк, а также (по крайней мере, поверхностно) отвечает первоначальному запросу, чтобы избежать оператора <code>try</code> :
zh_cn: Python 3.4为我们提供了<a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress"> <code>suppress</code> </a>上下文管理器（以前为<a href="https://bugs.python.org/issue19266"> <code>ignore</code> </a>上下文管理器），它在较少的行中在语义上完全相同，而也（至少表面上）满足了避免 <code>try</code> 语句的原始要求：

source: Race Conditions: Why we like try
es: Condiciones de la raza:Por qué nos gusta intentar
ja: レースの条件。トライが好きな理由
ko: 경쟁 조건 : 우리가 시도하는 것을 좋아하는 이유
ru: Условия гонки:Почему мы любим пробовать
zh_cn: 比赛条件。为什么我们喜欢尝试

source: Race conditions are very hard to debug because there's a very small window in which they can cause your program to fail.
es: Las condiciones de la carrera son muy difíciles de depurar porque hay una ventana muy pequeña en la que pueden hacer que su programa falle.
ja: レースコンディションは、プログラムが失敗する原因となる小さなウィンドウがあるため、デバッグが非常に困難です。
ko: 경쟁 조건은 프로그램이 실패 할 수있는 매우 작은 창이 있으므로 디버깅하기가 매우 어렵습니다.
ru: Условия гонки очень трудно отлаживать,потому что есть очень маленькое окно,в котором они могут привести к сбою вашей программы.
zh_cn: 竞赛条件是很难调试的,因为有一个非常小的窗口,在这个窗口中,它们会导致你的程序失败。

source: Raising exceptions is considered to be an acceptable, and Pythonic, approach for flow control in your program. Consider handling missing files with IOErrors. In this situation, an IOError exception will be raised if the file exists but the user does not have read permissions.
es: El aumento de las excepciones se considera un enfoque aceptable,y pitónico,para el control del flujo en su programa.Considere la posibilidad de manejar los archivos perdidos con IOErrors.En esta situación,una excepción de IOError será levantada si el archivo existe pero el usuario no tiene permisos de lectura.
ja: 例外を発生させることは、あなたのプログラムのフロー制御のために、Pythonicなアプローチとして受け入れられると考えられています。見つからないファイルを IOErrors で処理することを検討してください。この状況では、ファイルは存在するが、ユーザに読み取り権限がない場合に IOError 例外が発生します。
ko: 예외를 발생시키는 것은 프로그램에서 흐름 제어를위한 허용 가능한 파이썬 방식으로 간주됩니다. IOError로 누락 된 파일 처리를 고려하십시오. 이 상황에서는 파일이 있지만 사용자에게 읽기 권한이 없으면 IOError 예외가 발생합니다.
ru: Повышение исключений считается приемлемым,и Pythonic,подход для управления потоком в вашей программе.Рассмотрим обработку отсутствующих файлов с помощью IOErrors.В этой ситуации будет поднято исключение IOError,если файл существует,но у пользователя нет прав на чтение.
zh_cn: 提出异常被认为是一种可以接受的,也是Pythonic的程序流控制方法。可以考虑用IOErrors来处理缺失文件。在这种情况下,如果文件存在但用户没有读取权限,就会引发IOError异常。

source: Return <code>True</code> if <em>path</em> refers to an existing path or an open file descriptor. Returns <code>False</code> for broken symbolic links. On some platforms, this function may return <code>False</code> if permission is not granted to execute <a href="https://docs.python.org/3/library/os.html#os.stat">os.stat()</a> on the requested file, even if the <em>path</em> physically exists.
es: Devuelve <code>True</code> si la <em>ruta se</em> refiere a una ruta existente o un descriptor de archivo abierto. Devuelve <code>False</code> para enlaces simb&oacute;licos rotos. En algunas plataformas, esta funci&oacute;n puede devolver <code>False</code> si no se otorga permiso para ejecutar <a href="https://docs.python.org/3/library/os.html#os.stat">os.stat ()</a> en el archivo solicitado, incluso si la <em>ruta</em> existe f&iacute;sicamente.
ja: <em>パスが</em>既存のパスまたは開いているファイル記述子を参照している場合は、 <code>True</code> を返します。 壊れたシンボリックリンクに対して <code>False</code> を返します。 一部のプラットフォームでは、 <em>パスが</em>物理的に存在していても、要求されたファイルに対して<a href="https://docs.python.org/3/library/os.html#os.stat">os.stat（）</a>を実行する権限が付与されていない場合、この関数は <code>False</code> を返すことがあります。
ko: <em>path</em> 가 기존 경로 또는 열린 파일 설명자를 참조하면 <code>True</code> 를 반환합니다. 깨진 심볼릭 링크에 대해 <code>False</code> 를 반환합니다. 일부 플랫폼에서 물리적으로 <em>경로</em> 가 존재하더라도 요청 된 파일에서 <a href="https://docs.python.org/3/library/os.html#os.stat">os.stat ()</a> 를 실행할 권한이 부여되지 않은 경우이 함수는 <code>False</code> 를 반환 할 수 있습니다.
ru: Верните <code>True</code> , если <em>путь</em> ссылается на существующий путь или дескриптор открытого файла. Возвращает <code>False</code> для неработающих символических ссылок. На некоторых платформах эта функция может возвращать <code>False</code> , если не предоставлено разрешение на выполнение <a href="https://docs.python.org/3/library/os.html#os.stat">os.stat ()</a> для запрошенного файла, даже если <em>путь</em> физически существует.
zh_cn: 如果<em>path</em>引用现有路径或打开的文件描述符，则返回 <code>True</code> 。 对于断开的符号链接返回 <code>False</code> 。 在某些平台上，即使未实际执行<em>路径</em> ，如果未授予在请求的文件上执行<a href="https://docs.python.org/3/library/os.html#os.stat">os.stat（）的</a>权限，此函数也可能返回 <code>False</code> 。

source: Return <code>True</code> if path is an existing regular file. This follows symbolic links, so both <a href="https://docs.python.org/library/os.path.html#os.path.islink">islink()</a> and <a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile()</a> can be true for the same path.
es: Devuelve <code>True</code> si la ruta es un archivo regular existente. Esto sigue los enlaces simb&oacute;licos, por lo que tanto <a href="https://docs.python.org/library/os.path.html#os.path.islink">islink ()</a> como <a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile ()</a> pueden ser verdaderos para la misma ruta.
ja: パスが既存の通常のファイルである場合は <code>True</code> を返します。 これはシンボリックリンクをたどるので、同じパスに対して<a href="https://docs.python.org/library/os.path.html#os.path.islink">islink（）</a>と<a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile（）の</a>両方をtrueにすることができます。
ko: path가 기존 일반 파일 인 경우 <code>True</code> 를 반환합니다. 이는 심볼릭 링크를 따르므로 동일한 경로에 대해 <a href="https://docs.python.org/library/os.path.html#os.path.islink">islink ()</a> 및 <a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile ()</a> 이 모두 참일 수 있습니다.
ru: Верните <code>True</code> , если путь - это существующий обычный файл. Это следует за символическими ссылками, поэтому и <a href="https://docs.python.org/library/os.path.html#os.path.islink">islink (),</a> и <a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile ()</a> могут быть истинными для одного и того же пути.
zh_cn: 如果path是现有的常规文件，则返回 <code>True</code> 。 这遵循符号链接，因此，对于同一路径， <a href="https://docs.python.org/library/os.path.html#os.path.islink">islink（）</a>和<a href="https://docs.python.org/library/os.path.html#os.path.isfile">isfile（）</a>都可以为true。

source: Return True if path is an existing regular file. This follows symbolic links, so both <code>islink()</code> and <code>isfile()</code> can be true for the same path.
es: Devuelve True si la ruta es un archivo regular existente. Esto sigue los enlaces simb&oacute;licos, por lo que tanto <code>islink()</code> como <code>isfile()</code> pueden ser verdaderos para la misma ruta.
ja: パスが既存の通常のファイルである場合はTrueを返します。 これはシンボリックリンクをたどるので、同じパスに対して <code>islink()</code> と <code>isfile()</code> の両方をtrueにすることができます。
ko: path가 기존 일반 파일 인 경우 True를 반환합니다. 이는 심볼릭 링크를 따르므로 동일한 경로에 대해 <code>islink()</code> 및 <code>isfile()</code> 이 모두 참일 수 있습니다.
ru: Верните True, если путь - это существующий обычный файл. Это следует за символическими ссылками, поэтому и <code>islink()</code> и <code>isfile()</code> могут быть истинными для одного и того же пути.
zh_cn: 如果path是现有的常规文件，则返回True。 这遵循符号链接，因此，对于同一路径， <code>islink()</code> 和 <code>isfile()</code> 都可以为true。

source: SRC: <a href="http://www.pfinn.net/python-check-if-file-exists.html">http://www.pfinn.net/python-check-if-file-exists.html</a>
ja: SRC： <a href="http://www.pfinn.net/python-check-if-file-exists.html">http</a> : //www.pfinn.net/python-check-if-file-exists.html
zh_cn: SRC： <a href="http://www.pfinn.net/python-check-if-file-exists.html">http</a> ： //www.pfinn.net/python-check-if-file-exists.html

source: Since I also work in <em>C</em>, I use this method as well because under the hood, it calls <strong>native <em>API</em>s</strong> (again, via <em>"${PYTHON_SRC_DIR}/Modules/posixmodule.c"</em>), but it also opens a gate for possible <strong>user errors</strong>, and it's not as <em>Python</em>ic as other variants. So, as @AaronHall rightly pointed out, don't use it unless you know what you're doing:
es: Como tambi&eacute;n trabajo en <em>C</em> , tambi&eacute;n uso este m&eacute;todo porque, bajo el cap&oacute;, llama a <strong>las <em>API</em> nativas</strong> (de nuevo, a trav&eacute;s de <em>"$ {PYTHON_SRC_DIR} /Modules/posixmodule.c"</em> ), pero tambi&eacute;n abre una puerta para posibles <strong>usuarios errores</strong> , y no es tan <em>Python</em> ic como otras variantes. Entonces, como se&ntilde;al&oacute; correctamente @AaronHall, no lo use a menos que sepa lo que est&aacute; haciendo:
ja: 私も<em>C</em>で作業しているため、このメソッドも使用します。これは、 <em>内部</em>では<strong>ネイティブ<em>APIを</em></strong>呼び出し<strong><em>ます</em></strong> （ここでも<em>"$ {PYTHON_SRC_DIR} /Modules/posixmodule.c"を使用</em> ）が、可能性のある<strong>ユーザーの</strong>ゲートも開くためです。 <strong>エラー</strong> 、それは他のバリアントほど<em>Python</em> icではありません。 したがって、@ AaronHallが正しく指摘したように、何をしているのかを理解していない限り、これを使用しないでください。
ko: <em>C</em> 에서도 작업하기 때문에이 방법도 사용합니다.이 방법은 <strong>기본 <em>API</em></strong> ( <em>"$ {PYTHON_SRC_DIR} /Modules/posixmodule.c"</em> 를 통해)를 호출하지만 가능한 <strong>사용자를</strong> 위한 게이트를 <em>열기 때문에이</em> 방법도 <strong>사용합니다 errors</strong> 이며 다른 변형만큼 <em>Python</em> ic이 아닙니다. 따라서 @AaronHall이 올바르게 지적했듯이 수행중인 작업을 모르는 경우 사용하지 마십시오.
ru: Так как я также работаю в <em>C</em> , я также использую этот метод, потому что внутри он вызывает <strong>собственные <em>API-интерфейсы</em></strong> (опять же, через <em>"$ {PYTHON_SRC_DIR} /Modules/posixmodule.c"</em> ), но он также открывает ворота для возможного <strong>пользователя. ошибки</strong> , и это не так, как <em>Python</em> ic, как другие варианты. Итак, как правильно заметил @AaronHall, не используйте его, если не знаете, что делаете:
zh_cn: 由于我也使用<em>C语言</em> ，因此我也使用此方法，因为在<em>后台</em>它调用了<strong>本机<em>API</em></strong> （同样通过<em>&ldquo; $ {PYTHON_SRC_DIR} /Modules/posixmodule.c&rdquo;</em> ），但它也为可能的<strong>用户</strong>打开了一扇门<strong>errors</strong> ，它不像其他变体那样像<em>Python</em> ic。 因此，正如@AaronHall正确指出的那样，除非您知道自己在做什么，否则不要使用它：

source: Since these iterate over folders, (in most of the cases) they are inefficient for our problem (there are exceptions, like non wildcarded <em>glob</em>bing - as @ShadowRanger pointed out), so I'm not going to insist on them. Not to mention that in some cases, filename processing might be required.
es: Dado que estos iteran sobre las carpetas (en la mayor&iacute;a de los casos) son ineficientes para nuestro problema (hay excepciones, como el bing de <em>globo</em> no comod&iacute;n, como se&ntilde;al&oacute; @ShadowRanger), por lo que no voy a insistir en ellos. Sin mencionar que en algunos casos, el procesamiento del nombre de archivo puede ser requerido.
ja: これらはフォルダーを反復処理するため、（ほとんどの場合）それらは私たちの問題に対して非効率的です（ワイルドカードのないグロビングのような例外があります-@ShadowRangerが指摘したように）。したがって、私はそれらを主張しません。 言うまでもなく、ファイル名の処理が必要になる場合もあります。
ko: 이들은 폴더를 반복하므로 (대부분의 경우) 우리 문제에 비효율적입니다 (@ShadowRanger가 지적한 것처럼 와일드 카드가 아닌 글 로빙 빙과 같은 예외가 있습니다). 그래서 나는 그것을 고집하지 않을 것입니다. 경우에 따라 파일 이름 처리가 필요할 수 있습니다.
ru: Так как они перебирают папки, (в большинстве случаев) они неэффективны для нашей проблемы (есть исключения, такие как глобальные переменные без подстановочных знаков - как указывал @ShadowRanger), поэтому я не буду настаивать на них. Не говоря уже о том, что в некоторых случаях может потребоваться обработка имени файла.
zh_cn: 由于这些遍历文件夹，（在大多数情况下）它们对于我们的问题效率不高（有一些例外，例如非通配<em>glob</em> bing-如@ShadowRanger所指出），因此我不再坚持使用它们。 更不用说在某些情况下，可能需要文件名处理。

source: So let's get a file that we know is a file:
es: Así que consigamos un archivo que sepamos que es un archivo:
ja: ということで、ファイルとわかっているものを取得してみましょう。
ko: 우리가 알고있는 파일을 가져 오십시오 :
ru: Так что давайте получим файл,который,как мы знаем,является файлом:
zh_cn: 所以,让我们得到一个我们知道是文件的文件。

source: So raising exceptions is considered to be an acceptable, and Pythonic, approach for flow control in your program. And one should consider handling missing files with IOErrors, rather than <code>if</code> statements (<em>just an advice</em>).
es: Por lo tanto, aumentar las excepciones se considera un enfoque aceptable y Pythonic para el control de flujo en su programa. Y uno debe considerar manejar los archivos que faltan con IOErrors, en lugar de <code>if</code> declaraciones ( <em>solo un consejo</em> ).
ja: したがって、例外を発生させることは、プログラムでフロー制御を行うための受け入れ可能なPythonicのアプローチと見なされます。 また、 <code>if</code> ステートメントではなく、IOErrorを使用して欠落ファイルを処理することを検討する必要があります（ <em>単なるアドバイス</em> ）。
ko: 따라서 예외를 발생시키는 것은 프로그램에서 흐름 제어를 위해 허용 가능한 파이썬 방식으로 간주됩니다. 그리고 <code>if</code> 문이 아닌 IOErrors로 누락 된 파일을 처리하는 것을 고려해야합니다 ( <em>단지 조언</em> ).
ru: Поэтому повышение исключений считается приемлемым и питонским подходом для управления потоком в вашей программе. И нужно рассмотреть обработку отсутствующих файлов с ошибками ввода-вывода, а не операторы <code>if</code> ( <em>просто совет</em> ).
zh_cn: 因此，引发异常被认为是程序中流控制的可接受且Pythonic的方法。 并且应该考虑使用IOErrors处理丢失的文件，而不是 <code>if</code> 语句（ <em>只是建议</em> ）。

source: So we need to use <code>is_file</code>:
es: Entonces necesitamos usar <code>is_file</code> :
ja: したがって、 <code>is_file</code> を使用する必要があります。
ko: 따라서 <code>is_file</code> 을 사용해야합니다 :
ru: Итак, нам нужно использовать <code>is_file</code> :
zh_cn: 因此，我们需要使用 <code>is_file</code> ：

source: Starting with Python 3.4, the <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file"><code>pathlib</code> module</a> offers an object-oriented approach (backported to <code>pathlib2</code> in Python 2.7):
es: Comenzando con Python 3.4, el <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">m&oacute;dulo <code>pathlib</code> </a> ofrece un enfoque orientado a objetos ( <code>pathlib2</code> a pathlib2 en Python 2.7):
ja: Python 3.4以降、 <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file"> <code>pathlib</code> モジュール</a>はオブジェクト指向のアプローチを提供しています（Python 2.7では <code>pathlib2</code> にバックポートされています ）。
ko: Python 3.4부터 <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file"> <code>pathlib</code> 모듈</a> 은 객체 지향 접근 방식을 제공합니다 (Python 2.7의 <code>pathlib2</code> 로 백 포트 됨).
ru: Начиная с Python 3.4, <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">модуль <code>pathlib</code> </a> предлагает объектно-ориентированный подход ( <code>pathlib2</code> в pathlib2 в Python 2.7):
zh_cn: 从Python 3.4开始， <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file"> <code>pathlib</code> 模块</a>提供了一种面向对象的方法（在Python 2.7中 <code>pathlib2</code> 移植到pathlib2 ）：

source: Style: Section "Handling unusual conditions" of <a href="http://allendowney.com/sd/notes/notes11.txt">http://allendowney.com/sd/notes/notes11.txt</a>
es: Estilo: Secci&oacute;n "Manejo de condiciones inusuales" de <a href="http://allendowney.com/sd/notes/notes11.txt">http://allendowney.com/sd/notes/notes11.txt</a>
ja: スタイル： <a href="http://allendowney.com/sd/notes/notes11.txt">http://allendowney.com/sd/notes/notes11.txtの</a>セクション「異常な状態の処理」
ko: 스타일 : <a href="http://allendowney.com/sd/notes/notes11.txt">http://allendowney.com/sd/notes/notes11.txt의</a> "특별한 조건 처리"섹션
ru: Стиль: раздел &laquo;Работа с необычными условиями&raquo; <a href="http://allendowney.com/sd/notes/notes11.txt">http://allendowney.com/sd/notes/notes11.txt</a>
zh_cn: 样式： <a href="http://allendowney.com/sd/notes/notes11.txt">http</a> ：//allendowney.com/sd/notes/notes11.txt的&ldquo;处理异常情况&rdquo;部分

source: Testing for files and folders with <code>os.path.isfile()</code>, <code>os.path.isdir()</code> and <code>os.path.exists()</code>
es: Prueba de archivos y carpetas con <code>os.path.isfile()</code> , <code>os.path.isdir()</code> y <code>os.path.exists()</code>
ja: <code>os.path.isfile()</code> 、 <code>os.path.isdir()</code> および <code>os.path.exists()</code> を使用したファイルとフォルダーのテスト
ko: <code>os.path.isfile()</code> , <code>os.path.isdir()</code> 및 <code>os.path.exists()</code> 하여 파일 및 폴더 테스트
ru: Тестирование файлов и папок с помощью <code>os.path.isfile()</code> , <code>os.path.isdir()</code> и <code>os.path.exists()</code>
zh_cn: 使用 <code>os.path.isfile()</code> ， <code>os.path.isdir()</code> 和 <code>os.path.exists()</code> 测试文件和文件夹

source: The <code>pathlib.Path</code> method (included in Python 3+, installable with pip for Python 2)
es: El m&eacute;todo <code>pathlib.Path</code> (incluido en Python 3+, instalable con pip para Python 2)
ja: <code>pathlib.Path</code> メソッド（Python 3以降に含まれ、Python 2のpipでインストール可能）
ko: <code>pathlib.Path</code> 메소드 (Python 3 이상에 포함, Python 2 용 pip로 설치 가능)
ru: Метод <code>pathlib.Path</code> (включен в Python 3+, устанавливается с помощью pip для Python 2)
zh_cn: <code>pathlib.Path</code> 方法（包含在Python 3+中，可通过pip安装在Python 2中）

source: The <em>Lnx</em> (<em>Ubtu (16 x64)</em>) counterpart as well:
es: La <em>contraparte de Lnx</em> ( <em>Ubtu (16 x64)</em> ) tambi&eacute;n:
ja: <em>Lnx</em> （ <em>Ubtu（16 x64）</em> ）の対応物：
ko: <em>Lnx</em> ( <em>Ubtu (16 x64)</em> ) 대응 :
ru: <em>Аналог Lnx</em> ( <em>Ubtu (16 x64)</em> ):
zh_cn: <em>Lnx</em> （ <em>Ubtu（16 x64）</em> ）对应项也是如此：

source: The code itself does not use a <code>try</code> block&hellip; except in determining the operating system and thus steering you to the "Unix"-style <code>find</code> or the hand-buillt <code>find</code>. Timing tests showed that the <code>try</code> was faster in determining the OS, so I did use one there (but nowhere else).
es: El c&oacute;digo en s&iacute; mismo no usa un bloque de <code>try</code> ... excepto para determinar el sistema operativo y as&iacute; dirigirlo al <code>find</code> estilo "Unix" o al <code>find</code> manual. Las pruebas de tiempo mostraron que el <code>try</code> fue m&aacute;s r&aacute;pido para determinar el sistema operativo, por lo que utilic&eacute; uno all&iacute; (pero en ning&uacute;n otro lugar).
ja: コード自体は <code>try</code> ブロックを使用しません...オペレーティングシステムを決定し、「Unix」スタイルの <code>find</code> または手動で作成した <code>find</code> にユーザーを誘導する場合を除きます 。 タイミングテストの結果、OSを決定する方が高速であることがわかったので、OSを使用しました（他の場所では使用しませんでした）。
ko: 코드 자체는 <code>try</code> 블록을 사용하지 않습니다. 운영 체제를 결정하고 "Unix"스타일 <code>find</code> 또는 수동 내장 <code>find</code> 로 안내하는 경우를 제외하고 는 . 타이밍 테스트에 따르면 OS를 결정하는 데 더 빠른 <code>try</code> 가 있었으므로 거기에서 사용했습니다 (그러나 다른 곳에서는 사용하지 않았습니다).
ru: Сам код не использует блок <code>try</code> &hellip; за исключением определения операционной системы и, следовательно, перехода к <code>find</code> стиле &laquo;Unix&raquo; или &laquo;hand-buillt&raquo;. Временные тесты показали, что <code>try</code> была быстрее при определении ОС, поэтому я использовал ее там (но больше нигде).
zh_cn: 该代码本身不使用 <code>try</code> 块&hellip;&hellip;除非确定操作系统，然后使您转向&ldquo; Unix&rdquo;风格的 <code>find</code> 或手动编译 <code>find</code> 。 时序测试表明， <code>try</code> 确定操作系统的速度更快，因此我确实在那里使用了操作系统（但没有其他地方使用）。

source: The implementation, if you care to look, is here: <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190</a>
es: La implementaci&oacute;n, si quiere mirar, est&aacute; aqu&iacute;: <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190</a>
ja: 実装を確認したい場合は、こちらにあります： <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https</a> : //github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190
ko: 구현이 필요하다면 <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190에</a> 있습니다.
ru: Реализация, если вы хотите посмотреть, здесь: <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190</a>
zh_cn: 如果您愿意看的话，可以在这里找到实现： <a href="https://github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190">https</a> : //github.com/uqfoundation/pox/blob/89f90fb308f285ca7a62eabe2c38acb87e89dad9/pox/shutils.py#L190

source: The ouput would be:
es: El resultado sería:
ja: オープットはそうだろう。
ko: 출력은 다음과 같습니다.
ru: Упут будет:
zh_cn: 产量将是:
