Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The pathlib module has lots of cool stuff in it: convenient globbing, checking file's owner, easier path joining, etc. It's worth checking out. If you're on an older Python (version 2.6 or later), you can still install pathlib with pip:
es: El módulo pathlib tiene un montón de cosas interesantes en él:conveniente globbing,comprobar el propietario del archivo,facilitar la unión de rutas,etc.Vale la pena comprobarlo.Si estás en un Python más antiguo (versión 2.6 o posterior),todavía puedes instalar pathlib con pip:
ja: pathlib モジュールには、便利なグローバル化、ファイルの所有者の確認、より簡単なパス結合など、多くのクールな機能が含まれています。チェックアウトする価値はあります。古い Python (バージョン 2.6 以降)を使っている場合は、pip で pathlib をインストールすることができます。
ko: pathlib 모듈에는 편리한 글 로빙, 파일 소유자 확인, 쉬운 경로 조인 등 멋진 항목이 많이 있습니다. 체크 아웃 할 가치가 있습니다. 이전 Python (버전 2.6 이상)을 사용하는 경우 pip를 사용하여 pathlib를 계속 설치할 수 있습니다.
ru: В модуле pathlib много интересного:удобный глобус,проверка владельца файла,более легкое присоединение к пути и т.д.Это стоит проверить.Если вы находитесь на старом Python (версия 2.6 или более поздняя),вы всё равно можете установить pathlib с помощью pip:
zh_cn: pathlib模块有很多很酷的东西:方便的globbing,检查文件的所有者,更方便的路径连接等等。它值得一试。如果你使用的是旧的 Python (2.6 或更高版本),你仍然可以用 pip 安装 pathlib。

source: Then import it as follows:
es: Luego lo importan de la siguiente manera:
ja: そして、以下のようにインポートします。
ko: 그런 다음 다음과 같이 가져 오십시오.
ru: Затем импортируйте его следующим образом:
zh_cn: 然后按以下方法导入。

source: Then, depending on the result, your program can just keep running from there or you can code to stop it if you want.
es: Entonces,dependiendo del resultado,tu programa puede seguir funcionando desde ahí o puedes codificar para detenerlo si quieres.
ja: その後、結果に応じて、あなたのプログラムはそこから実行し続けることができますし、必要に応じてそれを停止するためのコードを記述することができます。
ko: 그런 다음 결과에 따라 프로그램이 계속 실행되거나 원하는 경우 중지하도록 코드를 작성할 수 있습니다.
ru: Тогда,в зависимости от результата,ваша программа может просто продолжать работать оттуда или вы можете кодировать,чтобы остановить ее,если хотите.
zh_cn: 然后,根据结果,你的程序可以从那里继续运行,或者如果你想的话,你可以用代码来停止它。

source: This allows common <a href="https://docs.python.org/3/reference/compound_stmts.html#try">try</a>...<a href="https://docs.python.org/3/reference/compound_stmts.html#except">except</a>...<a href="https://docs.python.org/3/reference/compound_stmts.html#finally">finally</a> usage patterns to be encapsulated for convenient reuse.
es: Esto permite un <a href="https://docs.python.org/3/reference/compound_stmts.html#try">intento</a> com&uacute;n ... <a href="https://docs.python.org/3/reference/compound_stmts.html#except">excepto</a> ... <a href="https://docs.python.org/3/reference/compound_stmts.html#finally">finalmente,</a> los patrones de uso se encapsulan para una reutilizaci&oacute;n conveniente.
ja: これにより、共通の<a href="https://docs.python.org/3/reference/compound_stmts.html#try">試み</a> ... <a href="https://docs.python.org/3/reference/compound_stmts.html#except">を除いて</a> ... <a href="https://docs.python.org/3/reference/compound_stmts.html#finally">最終的に</a>使用パターンをカプセル化して、簡単に再利用できます。
ko: 이를 통해 일반적인 <a href="https://docs.python.org/3/reference/compound_stmts.html#try">시도</a> ... ... ... 사용 패턴을 캡슐화하여 편리하게 재사용 할 수 있습니다.
ru: Это позволяет инкапсулировать обычные <a href="https://docs.python.org/3/reference/compound_stmts.html#try">попытки</a> ... <a href="https://docs.python.org/3/reference/compound_stmts.html#except">кроме</a> ... <a href="https://docs.python.org/3/reference/compound_stmts.html#finally">наконец,</a> шаблонов использования для удобного повторного использования.
zh_cn: <a href="https://docs.python.org/3/reference/compound_stmts.html#except">除了</a> <a href="https://docs.python.org/3/reference/compound_stmts.html#finally">最终</a>使用模式外，这可以封装常见的<a href="https://docs.python.org/3/reference/compound_stmts.html#try">尝试</a>模式，以便方便重用。

source: This answer says it prefers a non-Pythonic, error-prone method, with no justification. It seems to encourage users to use low-level APIs without understanding them.
es: Esta respuesta dice que prefiere un método no pitónico,propenso a errores,sin justificación.Parece alentar a los usuarios a utilizar API de bajo nivel sin entenderlas.
ja: この回答では、正当な理由もなく、Pythonicではない、エラーになりやすい方法を好むとしています。これは、ユーザーが低レベルAPIを理解せずに使用することを奨励しているようです。
ko: 이 답변은 정당화없이 비 피톤의 오류가 발생하기 쉬운 방법을 선호한다고 말합니다. 사용자가 이해하지 않고 저수준 API를 사용하도록 권장하는 것 같습니다.
ru: В этом ответе говорится,что он предпочитает непитонический,склонный к ошибкам метод,без всякого обоснования.Похоже,что он поощряет пользователей использовать низкоуровневые API,не понимая их.
zh_cn: 这个回答说它更喜欢用非Pythonic,容易出错的方法,没有任何理由。这似乎是在鼓励用户在不了解API的情况下使用低级API。

source: This doesn't also apply to <em>Win</em> (but that's not such a big deal, since <em>msvcrt.dll</em> is located in <em>"%SystemRoot%\System32"</em> which is in <em>%PATH%</em> by default). I wanted to take things further and replicate this behavior on <em>Win</em> (and submit a patch), but as it turns out, <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">[MS.Docs]: GetProcAddress function</a> only "sees" <strong>exported</strong> symbols, so unless someone declares the functions in the main executable as <code>__declspec(dllexport)</code> (why on Earth the <em>regular</em> person would do that?), the main program is loadable but pretty much unusable
es: Esto tampoco se aplica a <em>Win</em> (pero eso no es un gran problema, ya que <em>msvcrt.dll</em> se encuentra en <em>"% SystemRoot% \ System32"</em> que est&aacute; en <em>% PATH%</em> por defecto). Quer&iacute;a ir m&aacute;s all&aacute; y replicar este comportamiento en <em>Win</em> (y enviar un parche), pero resulta que, <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">[MS.Docs]: la funci&oacute;n GetProcAddress</a> solo "ve" los s&iacute;mbolos <strong>exportados</strong> , por lo que a menos que alguien declare las funciones en el ejecutable principal como <code>__declspec(dllexport)</code> (&iquest;por qu&eacute; demonios la persona <em>normal</em> har&iacute;a eso?), el programa principal se puede cargar pero es pr&aacute;cticamente inutilizable
ja: これは<em>Winに</em>も当てはまりません（ただし、 <em>msvcrt.dll</em>はデフォルトで<em>％PATH％</em>にある<em>"％SystemRoot％\ System32"に</em>あるため、それほど大きな問題ではあり<em>ません</em> ）。 私は物事をさらに進めて、 <em>Winで</em>この動作を再現したかった（そしてパッチを提出した）が、 <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">結局のところ[MS.Docs]：GetProcAddress関数</a>は<strong>エクスポートされた</strong>シンボルのみを「見る」ため、誰かがメイン実行可能ファイルで関数を宣言しない限り <code>__declspec(dllexport)</code> （なぜ地球上で<em>通常の</em>人がそうするのか）のように、メインプログラムはロード可能ですがほとんど使用できません
ko: 이것은 <em>Win</em> 에도 적용되지 않습니다 (그러나 <em>msvcrt.dll</em> 은 기본적으로 <em>% PATH %</em> 에있는 <em>"% SystemRoot % \ System32"</em> 에 있기 때문에 그렇게 큰 문제는 아닙니다). 더 나아가서 <em>Win</em> 에서이 동작을 복제하고 패치를 제출하고 <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">싶었지만</a> , [MS.Docs] : GetProcAddress 함수 는 <strong>내 보낸</strong> 심볼 만 "보여", 누군가 주 실행 파일에서 함수를 선언하지 않는 한 <code>__declspec(dllexport)</code> (지구에서 <em>일반</em> 사람이 그렇게하는 이유는 무엇입니까?)과 같이 주 프로그램은로드 할 수 있지만 거의 사용할 수 없습니다
ru: Это также не относится к <em>Win</em> (но это не такая уж большая проблема, поскольку <em>msvcrt.dll</em> находится в <em>"% SystemRoot% \ System32",</em> который по умолчанию находится в <em>% PATH%</em> ). Я хотел пойти дальше и повторить это поведение на <em>Win</em> (и отправить патч), но, как оказалось, <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">[MS.Docs]: функция GetProcAddress</a> только &laquo;видит&raquo; <strong>экспортированные</strong> символы, поэтому, если кто-то не объявит функции в основном исполняемом файле как <code>__declspec(dllexport)</code> (почему на Земле <em>обычный</em> человек будет делать это?), основная программа загружаема, но в значительной степени непригодна для использования
zh_cn: 这也不适用于<em>Win</em> （但是这没什么大不了的，因为<em>msvcrt.dll</em>位于<em>&ldquo;％SystemRoot％\ System32&rdquo;中</em> ，默认情况下位于<em>％PATH％中</em> ）。 我想更进一步，在<em>Win</em>上复制此行为（并提交补丁），但事实证明， <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/libloaderapi/nf-libloaderapi-getprocaddress">[MS.Docs]：GetProcAddress函数</a>仅&ldquo;看到&rdquo; <strong>导出的</strong>符号，因此除非有人在主可执行文件中声明该函数就像 <code>__declspec(dllexport)</code> （为什么普通人会这样做？），主程序是可加载的，但是几乎不可用

source: This has to be handled with care, since functions like <em>main</em>, <em>Py_Main</em> and (all the) others are available; calling them could have disastrous effects (on the current program)
es: Esto debe manejarse con cuidado, ya que funciones como <em>main</em> , <em>Py_Main</em> y (todas las dem&aacute;s) est&aacute;n disponibles; llamarlos podr&iacute;a tener efectos desastrosos (en el programa actual)
ja: <em>main</em> 、 <em>Py_Main</em>など（すべて）のよう<em>な</em>関数が利用できるので、これは注意して扱う必要があります。 それらを呼び出すと、（現在のプログラムに）悲惨な影響を与える可能性があります
ko: <em>main</em> , <em>Py_Main</em> 및 기타 기능과 같은 기능을 사용할 수 있으므로주의해서 다루어야합니다. 그것들을 호출하면 비참한 영향을 줄 수 있습니다 (현재 프로그램에서)
ru: С этим нужно обращаться осторожно, так как <em>доступны</em> такие функции, как <em>main</em> , <em>Py_Main</em> и (все остальные); их вызов может иметь катастрофические последствия (для текущей программы)
zh_cn: 这必须谨慎处理，因为像<em>main</em> ， <em>Py_Main</em>和（所有）其他函数都可用。 打电话给他们可能会造成灾难性的影响（对当前程序）

source: This is the simplest way to check if a file exists. Just <strong>because</strong> the file existed when you checked doesn't <strong>guarantee</strong> that it will be there when you need to open it.
es: Esta es la forma m&aacute;s simple de verificar si existe un archivo. El hecho de <strong>que</strong> el archivo existiera cuando lo verific&oacute; no <strong>garantiza</strong> que estar&aacute; all&iacute; cuando necesite abrirlo.
ja: これは、ファイルが存在するかどうかを確認する最も簡単な方法です。 チェックしたときにファイルが存在した<strong>からと</strong>いって、ファイルを開く必要があるときにファイルが存在することは<strong>保証され</strong>ません。
ko: 파일이 존재하는지 확인하는 가장 간단한 방법입니다. 확인했을 때 파일이 존재했다고해서 파일을 열어야 할 때 파일이 있다고 <strong>보장</strong> 할 수는 없습니다.
ru: Это самый простой способ проверить, существует ли файл. Тот факт, <strong>что</strong> файл существовал при проверке, не <strong>гарантирует,</strong> что он будет там, когда вам нужно его открыть.
zh_cn: 这是检查文件是否存在的最简单方法。 仅仅<strong>因为</strong>文件在您检查时存在并不<strong>保证</strong>在您需要打开文件时该文件就会存在。

source: This returns <code>True</code> for both files and directories but you can instead use
es: Esto devuelve <code>True</code> tanto para archivos como para directorios, pero en su lugar puede usar
ja: これはファイルとディレクトリの両方に対して <code>True</code> を返しますが、代わりに使用できます
ko: 파일과 디렉토리 모두에 대해 <code>True</code> 를 반환하지만 대신 사용할 수 있습니다.
ru: Это возвращает <code>True</code> как для файлов, так и для каталогов, но вместо этого вы можете использовать
zh_cn: 这对文件和目录都返回 <code>True</code> ，但是您可以改用

source: This seems to encourage users to adopt poor practices.
es: Esto parece alentar a los usuarios a adoptar prácticas deficientes.
ja: これは、ユーザーに悪い習慣を取り入れることを促しているようです。
ko: 이것은 사용자가 좋지 않은 관행을 채택하도록 장려하는 것 같습니다.
ru: Это,по-видимому,побуждает пользователей перенимать некачественную практику.
zh_cn: 这似乎是在鼓励用户采用不良的做法。

source: This will check the existence of what you specify. However, it checks for files <em>and</em> directories so beware about how you use it.
es: Esto verificar&aacute; la existencia de lo que especifique. Sin embargo, busca archivos <em>y</em> directorios, as&iacute; que ten cuidado con c&oacute;mo lo usas.
ja: これにより、指定したものの存在が確認されます。 ただし、ファイル<em>と</em>ディレクトリをチェックするため、使用方法に注意してください。
ko: 지정한 내용이 있는지 확인합니다. 그러나 파일 <em>과</em> 디렉토리를 확인하므로 사용 방법에주의하십시오.
ru: Это проверит наличие того, что вы укажете. Тем не менее, он проверяет файлы <em>и</em> каталоги, поэтому будьте осторожны с тем, как вы его используете.
zh_cn: 这将检查您指定的内容是否存在。 但是，它会检查文件<em>和</em>目录，因此请注意如何使用它们。

source: This will check whether you have access to the file. It will check for permissions. Based on the os.py documentation, typing in <code>os.F_OK</code>, it will check the existence of the path. However, using this will create a security hole, as someone can attack your file using the time between checking the permissions and opening the file. You should instead go directly to opening the file instead of checking its permissions. (<a href="https://docs.python.org/2/glossary.html#term-eafp">EAFP</a> vs <a href="https://docs.python.org/2/glossary.html#term-lbyl">LBYP</a>). If you're not going to open the file afterwards, and only checking its existence, then you can use this.
es: Esto verificar&aacute; si tiene acceso al archivo. Verificar&aacute; los permisos. Seg&uacute;n la documentaci&oacute;n de os.py, tecleando <code>os.F_OK</code> , verificar&aacute; la existencia de la ruta. Sin embargo, usar esto crear&aacute; un agujero de seguridad, ya que alguien puede atacar su archivo usando el tiempo entre verificar los permisos y abrir el archivo. En su lugar, debe ir directamente a abrir el archivo en lugar de verificar sus permisos. ( <a href="https://docs.python.org/2/glossary.html#term-eafp">EAFP</a> vs <a href="https://docs.python.org/2/glossary.html#term-lbyl">LBYP</a> ). Si no va a abrir el archivo despu&eacute;s, y solo verifica su existencia, puede usar esto.
ja: これにより、ファイルにアクセスできるかどうかが確認されます。 権限をチェックします。 os.pyのドキュメントに基づいて、os.F_OKと入力すると、パスの存在が確認されます。 ただし、権限を確認してからファイルを開くまでの時間を利用して誰かがファイルを攻撃する可能性があるため、これを使用するとセキュリティホールが発生します。 代わりに、ファイルのアクセス許可を確認する代わりに、ファイルを直接開く必要があります。 （ <a href="https://docs.python.org/2/glossary.html#term-eafp">EAFP</a> vs <a href="https://docs.python.org/2/glossary.html#term-lbyl">LBYP</a> ）。 後でファイルを開かず、その存在を確認するだけの場合は、これを使用できます。
ko: 파일에 액세스 할 수 있는지 확인합니다. 권한을 확인합니다. os.py 문서를 기반으로 os.F_OK를 입력하면 경로가 있는지 확인합니다. 그러나이 권한을 사용하면 권한 확인과 파일 열기 사이의 시간을 사용하여 파일을 공격 할 수 있으므로 보안 허점이 생깁니다. 대신 사용 권한을 확인하는 대신 파일을 직접 열어야합니다. ( <a href="https://docs.python.org/2/glossary.html#term-eafp">EAFP</a> 대 <a href="https://docs.python.org/2/glossary.html#term-lbyl">LBYP</a> ). 나중에 파일을 열지 않고 존재 여부 만 확인하는 경우이 파일을 사용할 수 있습니다.
ru: Это проверит, есть ли у вас доступ к файлу. Он проверит разрешения. На основании документации os.py, введя <code>os.F_OK</code> , он проверит наличие пути. Однако использование этого создаст дыру в безопасности, поскольку кто-то может атаковать ваш файл, используя время между проверкой прав доступа и открытием файла. Вместо этого вам следует перейти непосредственно к открытию файла вместо проверки его прав доступа. ( <a href="https://docs.python.org/2/glossary.html#term-lbyl">EAFP</a> против LBYP ). Если вы не собираетесь открывать файл впоследствии, а только проверяете его существование, то вы можете использовать это.
zh_cn: 这将检查您是否有权访问该文件。 它将检查权限。 根据os.py文档，输入 <code>os.F_OK</code> ，它将检查路径的存在。 但是，使用此选项将创建一个安全漏洞，因为有人可以使用检查权限到打开文件之间的时间来攻击您的文件。 相反，您应该直接打开文件而不是检查其权限。 （ <a href="https://docs.python.org/2/glossary.html#term-eafp">EAFP</a>与<a href="https://docs.python.org/2/glossary.html#term-lbyl">LBYP</a> ）。 如果您以后不打算打开文件，而仅检查其存在，则可以使用它。

source: This will handle the case of the <code>file_path</code> being <code>None</code> or empty string.
es: Esto manejar&aacute; el caso de <code>file_path</code> siendo <code>None</code> o cadena vac&iacute;a.
ja: これは、 <code>file_path</code> が <code>None</code> または空の文字列の場合を処理します。
ko: 이것은 <code>file_path</code> 가 <code>None</code> 이거나 빈 문자열 인 경우를 처리합니다.
ru: Это будет обрабатывать случай, когда <code>file_path</code> является <code>None</code> или пустой строкой.
zh_cn: 这将处理 <code>file_path</code> 为 <code>None</code> 或为空字符串的情况。

source: This will return true or false based on its existence.
es: Esto regresará verdadero o falso basado en su existencia.
ja: これは、その存在に基づいて真か偽かを返します。
ko: 존재 여부에 따라 true 또는 false를 반환합니다.
ru: Это вернёт истину или ложь,основанную на её существовании.
zh_cn: 这将根据它的存在返回真或假。

source: To check a directory, do:
es: Para comprobar un directorio,hazlo:
ja: ディレクトリを確認するには、以下のようにします。
ko: 디렉토리를 확인하려면 다음을 수행하십시오.
ru: Чтобы проверить каталог,сделайте:
zh_cn: 要检查一个目录,要做。

source: To check whether a <code>Path</code> object exists independently of whether is it a file or directory, use <code>exists()</code>:
es: Para verificar si un objeto <code>Path</code> existe independientemente de si es un archivo o directorio, use <code>exists()</code> :
ja: <code>Path</code> オブジェクトがファイルまたはディレクトリであるかどうかに関係なく存在するかどうかを確認するには、 <code>exists()</code> を使用します 。
ko: <code>Path</code> 객체가 파일인지 디렉토리인지에 관계없이 존재하는지 확인하려면 <code>exists()</code> .
ru: Чтобы проверить, существует ли объект <code>Path</code> независимо от того, является ли он файлом или каталогом, используйте <code>exists()</code> :
zh_cn: 要检查 <code>Path</code> 对象是否独立于文件还是目录而 <code>exists()</code> ，请使用exist（） ：

source: Try opening the file:
es: Intenta abrir el archivo:
ja: ファイルを開いてみてください。
ko: 파일을 열어보십시오 :
ru: Попробуйте открыть файл:
zh_cn: 试着打开文件。

source: Under the hood, both use:
es: Bajo el capó,ambos usan:
ja: ボンネットの下では、どちらも使用しています。
ko: 후드 아래에서 다음을 모두 사용하십시오.
ru: Под капотом,оба используют:
zh_cn: 罩下,都用。

source: Under the hood, it does <strong>exactly</strong> the same thing (<em>pathlib.py</em>, line <em>~#1330</em>):
es: Debajo del cap&oacute;, hace <strong>exactamente</strong> lo mismo ( <em>pathlib.py</em> , l&iacute;nea <em>~ # 1330</em> ):
ja: <em>内部的には</em> 、 <strong>まったく</strong>同じことを実行します（ <em>pathlib.py</em> 、行<em>〜＃1330</em> ）：
ko: 후드에서 <strong>정확히</strong> 똑같은 일을합니다 ( <em>pathlib.py</em> , line <em>~ # 1330</em> ) :
ru: Под капотом он делает то же самое ( <em>pathlib.py</em> , строка <em>~ # 1330</em> ):
zh_cn: 在<em>后台</em> ，它做的<strong>完全</strong>一样（ <em>pathlib.py</em> ，行<em>〜＃1330</em> ）：

source: Unlike <a href="https://docs.python.org/library/os.path.html#os.path.isfile"><code>isfile()</code></a>, <a href="https://docs.python.org/library/os.path.html#os.path.exists"><code>exists()</code></a> will return <code>True</code> for directories. So depending on if you want only plain files or also directories, you'll use <code>isfile()</code> or <code>exists()</code>. Here is some simple REPL output:
es: A diferencia de <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>isfile()</code> </a> , exist () devolver&aacute; <code>True</code> para los directorios. Entonces, dependiendo de si solo desea archivos simples o tambi&eacute;n directorios, usar&aacute; <code>isfile()</code> o exist <code>exists()</code> . Aqu&iacute; hay una salida REPL simple:
ja: <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>isfile()</code> </a>とは異なり、 <a href="https://docs.python.org/library/os.path.html#os.path.exists"> <code>exists()</code> </a>はディレクトリに対して <code>True</code> を返します 。 したがって、プレーンファイルだけが必要かディレクトリも必要かどうかに応じて、 <code>isfile()</code> または <code>exists()</code> を使用します。 以下に簡単なREPL出力を示します。
ko: <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>isfile()</code> </a> 과는 달리 exist () 는 디렉토리에 대해 <code>True</code> 를 반환합니다. 따라서 일반 파일 또는 디렉토리 만 원하는지 여부에 따라 <code>isfile()</code> 또는 exist ()를 사용 <code>exists()</code> . 다음은 간단한 REPL 출력입니다.
ru: В отличие от <a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>isfile()</code> </a> , exist () вернет <code>True</code> для каталогов. Таким образом, в зависимости от того, хотите ли вы только простые файлы или каталоги, вы будете использовать <code>isfile()</code> или exist <code>exists()</code> . Вот простой вывод REPL:
zh_cn: 与<a href="https://docs.python.org/library/os.path.html#os.path.isfile"> <code>isfile()</code> </a>不同， exist（）对于目录将返回 <code>True</code> 。 因此，取决于您只需要纯文件还是目录，您将使用 <code>isfile()</code> 或exist <code>exists()</code> 。 这是一些简单的REPL输出：

source: Use <a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"><code>os.path.isfile()</code></a> with <a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"><code>os.access()</code></a>:
es: Use <a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"> <code>os.path.isfile()</code> </a> con <a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"> <code>os.access()</code> </a> :
ja: <a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"> <code>os.access()</code> </a> <a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"> <code>os.path.isfile()</code> </a>でos.path.isfile（）を使用します。
ko: <a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"> <code>os.access()</code> </a> 와 함께 <a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"> <code>os.path.isfile()</code> </a> 을 사용하십시오.
ru: Используйте <a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"> <code>os.path.isfile()</code> </a> с <a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"> <code>os.access()</code> </a> :
zh_cn: 将<a href="https://docs.python.org/3.3/library/os.path.html?highlight=os.path#os.path.isfile"> <code>os.path.isfile()</code> </a>与<a href="https://docs.python.org/3.3/library/os.html?highlight=os.access#os.access"> <code>os.access()</code> 结合使用</a> ：

source: Use <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3]: contextlib.<strong>suppress</strong>(<em>*exceptions</em>)</a> - which was <strong>specifically</strong> designed for selectively suppressing exceptions
es: Utilice <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3]: contextlib.</a> <strong>suprimir</strong> ( <em>* excepciones</em> ) - que fue dise&ntilde;ado <strong>espec&iacute;ficamente</strong> para suprimir selectivamente excepciones
ja: <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3]：contextlibを使用します。</a> <strong>suppress</strong> （ <em>* exceptions</em> ） - <em>例外</em>を選択的に抑制するために<strong>特別に</strong>設計されました
ko: <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3] : contextlib를</a> 사용하십시오 . <strong>suppress</strong> ( <em>* exceptions</em> ) - <em>예외</em> 를 선택적으로 억제하기 위해 <strong>특별히</strong> 고안되었습니다.
ru: Используйте <a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3]: contextlib.</a> <strong>подавить</strong> ( <em>* исключения</em> ) - который был <strong>специально</strong> разработан для выборочного подавления исключений
zh_cn: 使用<a href="https://docs.python.org/3/library/contextlib.html#contextlib.suppress">[Python 3]：contextlib。</a> <strong>抑制</strong> （ <em>* exceptions</em> ） -专为选择性抑制异常而设计

source: Use <code>os.access(path, mode)</code>:
es: Utilice <code>os.access(path, mode)</code> :
ja: <code>os.access(path, mode)</code> 使用します 。
ko: <code>os.access(path, mode)</code> 사용하십시오 :
ru: Используйте <code>os.access(path, mode)</code> :
zh_cn: 使用 <code>os.access(path, mode)</code> ：

source: Use <code>os.path.exists(path)</code>:
es: Utilice <code>os.path.exists(path)</code> :
ja: <code>os.path.exists(path)</code> を使用します 。
ko: <code>os.path.exists(path)</code> 사용하십시오 :
ru: Используйте <code>os.path.exists(path)</code> :
zh_cn: 使用 <code>os.path.exists(path)</code> ：
