Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<strong><em>Win</em></strong> specific): Since <em>vcruntime*</em> (<em>msvcr*</em>) <em>.dll</em> exports a <a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs]: _access, _waccess</a> function family as well, here's an example:
es: ( <strong><em>Win</em></strong> espec&iacute;fico): dado que <em>vcruntime *</em> ( <em>msvcr *</em> ) <em>.dll</em> exporta una <a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs]: _access, _waccess</a> function family tambi&eacute;n, aqu&iacute; hay un ejemplo:
ja: （ <strong><em>Win</em></strong>固有）： <em>vcruntime *</em> （ <em>msvcr *</em> ）. <em>dll</em>は<a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs]を</a>エクスポートするため、 _access、_waccess関数ファミリーも同様に、以下に例を示します。
ko: ( <strong><em>Win</em></strong> 관련) : <em>vcruntime *</em> ( <em>msvcr *</em> ) <em>.dll</em> 이 <a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs] : _access, _waccess</a> 함수 제품군도 내보내므로 다음 예제가 있습니다.
ru: ( <em>Зависит от</em> <strong><em>Win</em></strong> ): поскольку <em>vcruntime *</em> ( <em>msvcr *</em> ) <em>.dll также</em> экспортирует семейство функций <a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs]: _access, _waccess</a> , вот пример:
zh_cn: （特定于<strong><em>Win</em></strong> ）：由于<em>vcruntime *</em> （ <em>msvcr *</em> ）. <em>dll</em>导出<a href="https://docs.microsoft.com/en-us/cpp/c-runtime-library/reference/access-waccess?view=vs-2015">[MS.Docs]：_access，_waccess</a>函数族，因此以下示例：

source: ([Errno 2] No such file or directory: 'whatever.txt')
es: ([Errno 2]No existe tal archivo o directorio:'lo que sea.txt')
ja: ([Errno 2]そのようなファイルまたはディレクトリがありません:'whatever.txt')
ko: ([Errno 2] 해당 파일이나 디렉토리가 없습니다 : 'whatever.txt')
zh_cn: ([Errno 2]没有这样的文件或目录:'whatever.txt')

source: ...test if the invoking user has the specified access to <em>path</em>. <em>mode</em> should be <a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OK</a> to test the existence of path...
es: ... prueba si el usuario que invoca tiene el acceso especificado a la <em>ruta</em> . <em>el modo</em> debe ser <a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OK</a> para probar la existencia de ruta ...
ja: ...呼び出し元のユーザーが<em>パス</em>への指定されたアクセス権を持っているかどうかをテストし<em>ます</em> 。 パスの存在をテストするには、 <em>モード</em>を<a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OKに</a>する必要があります...
ko: ... 호출하는 사용자에게 <em>path에</em> 대한 지정된 액세스 권한이 있는지 테스트하십시오. 경로의 존재를 테스트하려면 <em>mode</em> 가 <a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OK</a> 여야합니다.
ru: ... проверить, имеет ли вызывающий пользователь указанный доступ к <em>пути</em> . <em>режим</em> должен быть <a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OK,</a> чтобы проверить существование пути ...
zh_cn: ...测试调用用户是否具有对<em>path</em>的指定访问权限。 <em>模式</em>应该为<a href="https://docs.python.org/3/library/os.html#os.F_OK">F_OK</a>以测试路径的存在...

source: 1.1. <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[Python 3]: Path.<strong>is_file</strong>()</a>
es: 1.1. <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[Python 3]: Camino.</a> <strong>is_file</strong> ()
ja: 1.1。 <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[Python 3]：パス。</a> <strong>is_file</strong> （）
ko: 1.1. <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[파이썬 3] : 경로.</a> <strong>is_file</strong> ()
ru: 1.1. <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[Python 3]: путь.</a> <strong>is_file</strong> ()
zh_cn: 1.1。 <a href="https://docs.python.org/3/library/pathlib.html#pathlib.Path.is_file">[Python 3]：路径。</a> <strong>is_file</strong> （）

source: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[Python 3]: glob.<strong>iglob</strong>(<em>pathname, *, recursive=False</em>)</a> (or its predecessor: <code>glob.glob</code>)
es: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[Python 3]: glob.</a> <strong>iglob</strong> ( <em>pathname, *, recursive = False</em> ) (o su predecesor: <code>glob.glob</code> )
ja: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[Python 3]：グロブ。</a> <strong>iglob</strong> （ <em>pathname、*、recursive = False</em> ） （またはその前身： <code>glob.glob</code> ）
ko: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[파이썬 3] : glob.</a> <strong>iglob</strong> ( <em>pathname, *, recursive = False</em> ) (또는 이전 버전 : <code>glob.glob</code> )
ru: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[Python 3]: глобус</a> <strong>iglob</strong> ( <em>pathname, *, recursive = False</em> ) (или его предшественник: <code>glob.glob</code> )
zh_cn: <a href="https://docs.python.org/3/library/glob.html#glob.iglob">[Python 3]：glob。</a> <strong>iglob</strong> （ <em>pathname，*，recursive = False</em> ） （或其前身： <code>glob.glob</code> ）

source: <a href="https://docs.python.org/3/library/os.html#os.access">[Python 3]: os.<strong>access</strong>(<em>path, mode, *, dir_fd=None, effective_ids=False, follow_symlinks=True</em>)</a> whose behavior is close to <code>os.path.exists</code> (actually it's wider, mainly because of the 2<sup>nd</sup> argument)
es: <a href="https://docs.python.org/3/library/os.html#os.access">[Python 3]: os.</a> <strong>acceso</strong> ( <em>ruta, modo, *, dir_fd = Ninguno, eficaz_id = Falso, follow_symlinks = Verdadero</em> ) cuyo comportamiento es cercano a <code>os.path.exists</code> (en realidad es m&aacute;s amplio, principalmente debido al segundo argumento)
ja: <a href="https://docs.python.org/3/library/os.html#os.access">[Python 3]：os。</a> <strong>access</strong> （ <em>path、mode、*、dir_fd = None、effective_ids = False、follow_symlinks = True</em> ）の動作は <code>os.path.exists</code> に近い（実際には、主に2 <sup>番目の</sup>引数のために、より広い）
ko: <a href="https://docs.python.org/3/library/os.html#os.access">[파이썬 3] : os.</a> <code>os.path.exists</code> 에 가까운 ( <em>path, mode, *, dir_fd = None, effective_ids = False, follow_symlinks = True</em> ) (실제로는 주로 두 <sup>번째</sup> 인수로 인해 더 넓습니다)
ru: <a href="https://docs.python.org/3/library/os.html#os.access">[Python 3]: ос.</a> <strong>access</strong> ( <em>path, mode, *, dir_fd = None ,ffective_ids = False, follow_symlinks = True</em> ) , поведение которого близко к <code>os.path.exists</code> (на самом деле оно шире, в основном из-за второго аргумента)
zh_cn: <a href="https://docs.python.org/3/library/os.html#os.access">[Python 3]：操作系统。</a> 行为接近 <code>os.path.exists</code> 的 <strong>访问</strong> （ <em>path，mode，*，dir_fd = None，Effective_ids = False，follow_symlinks = True</em> ） （实际上它更宽，主要是由于<sup>第二个</sup>参数）

source: <a href="https://docs.python.org/3/library/os.html#os.listdir">[Python 3]: os.<strong>listdir</strong>(<em>path='.'</em>)</a> (or <a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3]: os.<strong>scandir</strong>(<em>path='.'</em>)</a> on <em>Python v<strong>3.5</strong></em>+, backport: <a href="https://pypi.org/project/scandir">[PyPI]: scandir</a>)
es: <a href="https://docs.python.org/3/library/os.html#os.listdir">[Python 3]: os.</a> <strong>listdir</strong> ( <em>ruta = '.'</em> ) (o <a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3]: os. <strong>scandir</strong> ( <em>ruta = '.'</em> )</a> en <em>Python v <strong>3.5</strong></em> +, backport: <a href="https://pypi.org/project/scandir">[PyPI]: scandir</a> )
ja: <a href="https://docs.python.org/3/library/os.html#os.listdir">[Python 3]：os。</a> <strong>listdir</strong> （ <em>path = '。'</em> ） （または<a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3]： <strong>os。scandir</strong> （ <em>path = '。'</em> ）</a> on <em>Python v <strong>3.5</strong></em> +、backport： <a href="https://pypi.org/project/scandir">[PyPI]：scandir</a> ）
ko: <a href="https://docs.python.org/3/library/os.html#os.listdir">[파이썬 3] : os.</a> <strong>listdir</strong> ( <em>path = '.'</em> ) (또는 <em>Python v <strong>3.5</strong></em> +의 <a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3] : os. <strong>scandir</strong> ( <em>path = '.'</em> )</a> , 백 포트 : <a href="https://pypi.org/project/scandir">[PyPI] : scandir</a> )
ru: <a href="https://docs.python.org/3/library/os.html#os.listdir">[Python 3]: ос.</a> <strong>listdir</strong> ( <em>путь = '.'</em> ) (или <a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3]: os. <strong>scandir</strong> ( <em>путь = '.'</em> )</a> в <em>Python v</em> <a href="https://pypi.org/project/scandir">3.5+, обратный порт</a> : [PyPI]: scandir )
zh_cn: <a href="https://docs.python.org/3/library/os.html#os.listdir">[Python 3]：操作系统。</a> <strong>listdir</strong> （ <em>path ='。'</em> ） （或在<em>Python v <strong>3.5</strong></em> +上的<a href="https://docs.python.org/3/library/os.html#os.scandir">[Python 3]：操作系统<strong>scandir</strong> （ <em>path ='。'</em> ）</a> ，向后移植： <a href="https://pypi.org/project/scandir">[PyPI]：scandir</a> ）

source: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[Python 3]: os.path.<strong>exists</strong>(<em>path</em>)</a> (also check other function family members like <code>os.path.isfile</code>, <code>os.path.isdir</code>, <code>os.path.lexists</code> for slightly different behaviors)
es: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[Python 3]: os.path.</a> <strong>existe</strong> ( <em>ruta</em> ) (tambi&eacute;n verifique otros miembros de la familia de funciones como <code>os.path.isfile</code> , <code>os.path.isdir</code> , <code>os.path.lexists</code> para comportamientos ligeramente diferentes)
ja: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[Python 3]：os.path。</a> <strong>exists</strong> （ <em>path</em> ） （ <code>os.path.isfile</code> 、 <code>os.path.isdir</code> 、 <code>os.path.lexists</code> のような他の関数ファミリーのメンバーもわずかに異なる動作をチェックします）
ko: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[파이썬 3] : os.path.</a> <strong>존재합니다</strong> ( <em>path</em> ) (또한 <code>os.path.isfile</code> , <code>os.path.isdir</code> , <code>os.path.lexists</code> 와 같은 다른 함수 계열 구성원에서 약간 다른 동작을 확인하십시오)
ru: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[Python 3]: os.path.</a> <strong>Существует</strong> ( <em>путь</em> ) (также проверьте другие члены семейства функций, такие как <code>os.path.isfile</code> , <code>os.path.isdir</code> , <code>os.path.lexists</code> для немного другого поведения)
zh_cn: <a href="https://docs.python.org/3/library/os.path.html#os.path.exists">[Python 3]：os.path。</a> <strong>存在</strong> （ <em>path</em> ） （也请检查其他函数族成员，例如 <code>os.path.isfile</code> ， <code>os.path.isdir</code> 和 <code>os.path.lexists</code> 的行为是否稍有不同）

source: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3]: With Statement Context Managers</a>. Either:
es: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3]: con gestores de contexto de declaraci&oacute;n</a> . Ya sea:
ja: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3]：ステートメントコンテキストマネージャー付き</a> 。 どちらか：
ko: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3] : 명령문 컨텍스트 관리자 사용</a> 어느 한 쪽:
ru: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3]: с менеджерами контекста операторов</a> . Или:
zh_cn: <a href="https://docs.python.org/3/reference/datamodel.html#context-managers">[Python 3]：使用语句上下文管理器</a> 。 要么：

source: <code>isfile</code> is actually just a helper method that internally uses <code>os.stat</code> and <code>stat.S_ISREG(mode)</code> underneath. This <code>os.stat</code> is a lower-level method that will provide you with detailed information about files, directories, sockets, buffers, and more. <a href="https://docs.python.org/2/library/os.html#os.stat">More about os.stat here</a>
es: <code>isfile</code> es en realidad solo un m&eacute;todo auxiliar que usa internamente <code>os.stat</code> y <code>stat.S_ISREG(mode)</code> debajo. Este <code>os.stat</code> es un m&eacute;todo de nivel inferior que le proporcionar&aacute; informaci&oacute;n detallada sobre archivos, directorios, sockets, buffers y m&aacute;s. <a href="https://docs.python.org/2/library/os.html#os.stat">M&aacute;s acerca de os.stat aqu&iacute;</a>
ja: <code>isfile</code> は実際には、内部で <code>os.stat</code> と <code>stat.S_ISREG(mode)</code> を使用する単なるヘルパーメソッドです。 この <code>os.stat</code> は、ファイル、ディレクトリ、ソケット、バッファなどに関する詳細情報を提供する下位レベルのメソッドです。 <a href="https://docs.python.org/2/library/os.html#os.stat">os.statの詳細はこちら</a>
ko: <code>isfile</code> 은 실제로 내부적으로 <code>os.stat</code> 와 <code>stat.S_ISREG(mode)</code> 사용하는 도우미 메소드입니다. 이 <code>os.stat</code> 는 파일, 디렉토리, 소켓, 버퍼 등에 대한 자세한 정보를 제공하는 하위 레벨 방법입니다. <a href="https://docs.python.org/2/library/os.html#os.stat">os.stat에 대한 자세한 내용은 here</a>
ru: <code>isfile</code> самом деле isfile - это просто вспомогательный метод, который внутри использует <code>os.stat</code> и <code>stat.S_ISREG(mode)</code> . Этот <code>os.stat</code> является методом более низкого уровня, который предоставит вам подробную информацию о файлах, каталогах, сокетах, буферах и многом другом. <a href="https://docs.python.org/2/library/os.html#os.stat">Больше о os.stat здесь</a>
zh_cn: <code>isfile</code> 实际上只是一个内部使用 <code>os.stat</code> 和 <code>stat.S_ISREG(mode)</code> 的辅助方法。 此 <code>os.stat</code> 是一个较低层的方法，它将为您提供有关文件，目录，套接字，缓冲区等的详细信息。 <a href="https://docs.python.org/2/library/os.html#os.stat">有关os.stat的更多信息，请点击此处</a>

source: <code>os.path</code> - <em>posixpath.py</em> (<em>ntpath.py</em>)
ja: <code>os.path</code> -posixpath.py （ <em>ntpath.py</em> ）
ko: <em>os.path-posixpath.py</em> ( <em>ntpath.py</em> )
zh_cn: <em>os.path-posixpath.py</em> （ <em>ntpath.py</em> ）

source: <code>suppress</code> is part of Python 3.4. In older releases you can quickly write your own suppress:
es: <code>suppress</code> es parte de Python 3.4. En versiones anteriores, puede escribir r&aacute;pidamente su propia supresi&oacute;n:
ja: <code>suppress</code> はPython 3.4の一部です。 古いリリースでは、独自の抑制をすばやく作成できます。
ko: <code>suppress</code> 는 Python 3.4의 일부입니다. 이전 릴리스에서는 자신 만의 억제를 빠르게 작성할 수 있습니다.
ru: <code>suppress</code> является частью Python 3.4. В старых версиях вы можете быстро написать свой собственный подавитель:
zh_cn: <code>suppress</code> 是Python 3.4的一部分。 在较早的发行版中，您可以快速编写自己的隐匿：

source: <em>Nix</em> (<em>Lnx</em> (<em>Ubtu</em>)):
ko: <em>닉스</em> ( <em>Lnx</em> ( <em>Ubtu</em> )) :
ru: <em>Никс</em> ( <em>Lnx</em> ( <em>Убту</em> )):
zh_cn: <em>尼克斯</em> （ <em>Lnx</em> （ <em>Ubtu</em> ））：

source: <em>Nix</em>: <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7]: ACCESS(2)</a> (!!! pay attention to the note about the <strong>security hole</strong> its usage might introduce !!!)
es: <em>Nix</em> : <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7]: ACCESS (2)</a> (&iexcl;&iexcl;&iexcl;presta atenci&oacute;n a la nota sobre el <strong>agujero de seguridad que</strong> su uso podr&iacute;a introducir !!!)
ja: <em>Nix</em> ： <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7]：ACCESS（2）</a> （!!!使用により導入される可能性がある<strong>セキュリティホール</strong>に関する注意に注意してください!!!）
ko: <em>Nix</em> : <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7] : ACCESS (2)</a> (!!! 사용법으로 인해 발생할 수있는 <strong>보안 허점에</strong> 주의하십시오 !!!)
ru: <em>Nix</em> : <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7]: ACCESS (2)</a> (!!! обратите внимание на примечание о <strong>дыре</strong> в <strong>безопасности, которую</strong> может привести к его использованию !!!)
zh_cn: <em>Nix</em> ： <a href="http://man7.org/linux/man-pages/man2/access.2.html">[man7]：ACCESS（2）</a> （!!!请注意有关其用法可能引入的<strong>安全漏洞</strong>的注意事项！！！）

source: <em>Win</em>: <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs]: FindFirstFileW function</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs]: FindNextFileW function</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">[MS.Docs]: FindClose function</a>
es: <em>Win</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs]: funci&oacute;n FindFirstFileW</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs]: funci&oacute;n</a> <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">FindNextFileW</a> / [MS.Docs]: funci&oacute;n FindClose
ja: <em>Win</em> ： <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs]：FindFirstFileW関数</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs]：FindNextFileW関数</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">[MS.Docs]：FindClose関数</a>
ko: <em>승리</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs] : FindFirstFileW 함수</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs] : FindNextFileW 함수</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">[MS.Docs] : FindClose 함수</a>
ru: <em>Win</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs]: функция FindFirstFileW</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs]: функция FindNextFileW</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">[MS.Docs]: функция FindClose</a>
zh_cn: <em>Win</em> ： <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findfirstfilew">[MS.Docs]：FindFirstFileW函数</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findnextfilew">[MS.Docs]：FindNextFileW函数</a> / <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-findclose">[MS.Docs]：FindClose函数</a>

source: <em>Win</em>: <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs]: GetFileAttributesW function</a>
es: <em>Win</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs]: funci&oacute;n GetFileAttributesW</a>
ja: <em>Win</em> ： <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs]：GetFileAttributesW関数</a>
ko: <em>승리</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs] : GetFileAttributesW 함수</a>
ru: <em>Win</em> : <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs]: функция GetFileAttributesW</a>
zh_cn: <em>赢</em> ： <a href="https://docs.microsoft.com/en-gb/windows/desktop/api/fileapi/nf-fileapi-getfileattributesw">[MS.Docs]：GetFileAttributesW函数</a>

source: <em>genericpath.py</em>, line <em>~#20+</em>
es: <em>genericpath.py</em> , l&iacute;nea <em>~ # 20 +</em>
ja: <em>genericpath.py</em> 、行<em>〜＃20 +</em>
ko: <em>genericpath.py</em> , <em>~ # 20 +</em> 행
ru: <em>genericpath.py</em> , строка <em>~ # 20 +</em>
zh_cn: <em>genericpath.py</em> ，第<em>〜＃20 +行</em>

source: <strong>Bottom line</strong>:
es: <strong>L&iacute;nea inferior</strong> :
ja: <strong>結論</strong> ：
ko: <strong>결론</strong> :
ru: <strong>Итог</strong> :
zh_cn: <strong>底线</strong> ：

source: <strong>Do</strong> use <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> blocks, because they can prevent you running into a series of nasty problems. A counter-example that I can think of, is performance: such blocks are costly, so try not to place them in code that it's supposed to run hundreds of thousands times per second (but since (in most cases) it involves disk access, it won't be the case).
es: Utilice los bloques <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> , ya que pueden evitar que se encuentre con una serie de problemas desagradables. Un contraejemplo en el que puedo pensar es el rendimiento: tales bloques son costosos, as&iacute; que trate de no colocarlos en el c&oacute;digo que se supone que debe ejecutarse cientos de miles de veces por segundo (pero dado que (en la mayor&iacute;a de los casos) implica acceso al disco, No ser&aacute; el caso).
ja: 一連の厄介な問題の発生を防ぐことができるため、 <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>ブロック<strong><em>を</em></strong>使用して<strong><em>ください</em></strong> 。 私が考えることができる反例はパフォーマンスです：そのようなブロックはコストがかかるので、毎秒数十万回実行されるはずのコードに配置しないようにしてください（ただし、（ほとんどの場合）ディスクアクセスが関係するため、そうではありません）。
ko: <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> 블록을 사용하면 일련의 불쾌한 문제가 발생하지 않도록 막을 수 있습니다. 제가 생각할 수있는 반례는 성능입니다. 이러한 블록은 비용이 많이 들기 때문에 초당 수십만 번 실행되도록 코드에 배치하지 마십시오 (그러나 대부분의 경우 디스크 액세스가 필요합니다. 그렇지 않습니다).
ru: Используйте блоки <strong><em>try</em></strong> / <strong><em>исключением</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> , поскольку они могут предотвратить возникновение ряда неприятных проблем. Контр-пример, о котором я могу подумать, - это производительность: такие блоки являются дорогостоящими, поэтому постарайтесь не помещать их в код, который предполагается запускать сотни тысяч раз в секунду (но поскольку (в большинстве случаев) он предполагает доступ к диску, это не будет так).
zh_cn: <strong>请</strong>使用<strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>块，因为它们可以防止您遇到一系列令人讨厌的问题。 我可以想到的一个反例是性能：此类块非常昂贵，因此请不要将它们放在应该每秒运行数十万次的代码中（但是（在大多数情况下，由于它涉及磁盘访问，事实并非如此）。

source: <strong>Final note(s)</strong>:
es: <strong>Nota (s) final (es)</strong> :
ja: <strong>最後のメモ</strong> ：
ko: <strong>최종 메모</strong> :
ru: <strong>Финальные заметки</strong> :
zh_cn: <strong>最后说明</strong> ：

source: <strong>How do I check whether a file exists, without using the try statement?</strong>
es: <strong>&iquest;C&oacute;mo verifico si existe un archivo, sin usar la instrucci&oacute;n try?</strong>
ja: <strong>tryステートメントを使用せずに、ファイルが存在するかどうかを確認するにはどうすればよいですか？</strong>
ko: <strong>try 문을 사용하지 않고 파일이 존재하는지 어떻게 확인합니까?</strong>
ru: <strong>Как проверить, существует ли файл, без использования оператора try?</strong>
zh_cn: <strong>如何在不使用try语句的情况下检查文件是否存在？</strong>
