Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: But, they seem to be wrappers over <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> blocks, as <a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]: The <em>with</em> statement</a> states:
es: Pero, parecen ser envoltorios sobre bloques <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> , como <a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]: La declaraci&oacute;n <em>with</em></a> dice:
ja: しかし、 <a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]の</a>ように、 <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>ブロックのラッパーのように見えます。
ko: 그러나 그들은 <a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]</a> 과 같이 <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> 블록을 감싸는 래퍼 인 것처럼 보입니다.
ru: Но они, похоже, являются обертками над блоками <strong><em>try</em></strong> / <strong><em>исключением</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> , как <a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]: Оператор <em>with</em></a> гласит:
zh_cn: 但是，它们似乎是<strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>块的包装，如<a href="https://docs.python.org/3/reference/compound_stmts.html#with">[Python 3]： <em>with</em>语句</a>指出：

source: By default, <code>NamedTemporaryFile</code> deletes the file when closed (and will automatically close when no more references exist to it).
es: De forma predeterminada, <code>NamedTemporaryFile</code> elimina el archivo cuando se cierra (y se cerrar&aacute; autom&aacute;ticamente cuando no existan m&aacute;s referencias).
ja: デフォルトでは、 <code>NamedTemporaryFile</code> は閉じたときにファイルを削除します（ファイルへの参照がなくなると自動的に閉じます）。
ko: 기본적으로 <code>NamedTemporaryFile</code> 은 파일을 닫을 때 파일을 삭제합니다 (더 이상 참조가 없으면 자동으로 닫힙니다).
ru: По умолчанию <code>NamedTemporaryFile</code> удаляет файл при закрытии (и автоматически закрывается, когда на него больше нет ссылок).
zh_cn: 默认情况下， <code>NamedTemporaryFile</code> 在关闭时删除文件（并且在不再有引用时会自动关闭）。

source: Check file (<em>arguable</em>: also folder ("special" file) ?) existence
es: Comprobar existencia de archivo ( <em>discutible</em> : tambi&eacute;n carpeta (archivo "especial"))
ja: ファイル（ <em>引数</em> ：フォルダー（「特別」ファイル）も）の存在を確認する
ko: 파일 점검 ( <em>논쟁의 여지</em> : 폴더 ( "특별한"파일)?) 존재
ru: Проверить наличие файла ( <em>спорный</em> : также папка (&laquo;специальный&raquo; файл)?)
zh_cn: 检查文件（ <em>可以争论</em> ：也是文件夹（&ldquo;特殊&rdquo;文件）吗？）是否存在

source: Check file or directory exists
es: Comprobar que el archivo o directorio existe
ja: ファイルやディレクトリの存在を確認
ko: 파일 또는 디렉토리 확인
ru: Контрольный файл или каталог существует
zh_cn: 检查文件或目录是否存在

source: Create one:
es: Crea uno:
ja: 1つ作成します。
ko: 하나를 만듭니다 :
ru: Создай одну:
zh_cn: 创建一个。

source: Criticism of another answer:
es: Crítica de otra respuesta:
ja: 別の回答への批判。
ko: 다른 답변에 대한 비판 :
ru: Критика другого ответа:
zh_cn: 对另一个答案的批评。

source: Doesn't seem a traversing function <em>per se</em> (at least in some cases), but it still uses <code>os.listdir</code>
es: No parece una funci&oacute;n de desplazamiento <em>per se</em> (al menos en algunos casos), pero a&uacute;n usa <code>os.listdir</code>
ja: <em>それ自体は</em> （少なくとも一部のケースでは）トラバース関数のようには見えませんが、それでも <code>os.listdir</code> を使用します
ko: 트래버스 기능 <em>자체는 아니지만</em> (적어도 경우에 따라) <code>os.listdir</code> 을 사용합니다.
ru: Сама по себе функция обхода не выглядит (по крайней мере, в некоторых случаях), но она все еще использует <code>os.listdir</code> .
zh_cn: <em>本身</em>似乎没有遍历功能（至少在某些情况下），但仍使用 <code>os.listdir</code>

source: Don't take my word for it. There's plenty of support for this theory. Here's a couple:
es: No me creas.Hay mucho apoyo para esta teoría.Aquí hay un par:
ja: 私の言葉を鵜呑みにするな この理論には多くの裏付けがある いくつかある
ko: 내 말을 받아들이지 마 이 이론에 대한 많은 지원이 있습니다. 몇 가지 있습니다 :
ru: Не верь мне на слово.Эта теория пользуется широкой поддержкой.Вот пара:
zh_cn: 不要相信我的话。这个理论有很多支持。这里有几个例子。

source: Don't use <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> blocks
es: No use los bloques <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>
ja: <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>ブロック<strong><em>を</em></strong>使用しないでください
ko: <strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong> 블록을 사용하지 마십시오
ru: Не используйте блоки <strong><em>try</em></strong> / <strong><em>исключением</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>
zh_cn: 不要使用<strong><em>try</em></strong> / <strong><em>except</em></strong> / <strong><em>else</em></strong> / <strong><em>finally</em></strong>块

source: Every possible solution has been listed in other answers.
es: Cada posible solución se ha enumerado en otras respuestas.
ja: 可能性のある解答はすべて他の回答に記載されています。
ko: 가능한 모든 솔루션이 다른 답변에 나열되어 있습니다.
ru: Все возможные решения перечислены в других ответах.
zh_cn: 每一个可能的解决方案都已经在其他答案中列出了。

source: Filesystem traversal functions (and search the results for matching item(s))
es: Funciones de desplazamiento del sistema de archivos (y búsqueda de los resultados de los elementos coincidentes)
ja: ファイルシステムの走査関数 (および一致する項目の検索結果)
ko: 파일 시스템 탐색 기능 (및 일치하는 항목에 대한 결과 검색)
ru: Функции обхода файловой системы (и поиск по результатам поиска подходящего элемента (элементов))
zh_cn: 文件系统遍历函数(并搜索匹配项的结果)。

source: For earlier Pythons, you could roll your own <code>suppress</code>, but without a <code>try</code> will be more verbose than with. I do believe <strong>this actually is the only answer that doesn't use <code>try</code> at any level in the Python</strong> that can be applied to prior to Python 3.4 because it uses a context manager instead:
es: Para Pythons anteriores, podr&iacute;a lanzar su propia <code>suppress</code> , pero sin un <code>try</code> ser&aacute; m&aacute;s detallado que con. Creo que <strong>esta es la &uacute;nica respuesta que no utiliza <code>try</code> en ning&uacute;n nivel en Python</strong> que se pueda aplicar antes de Python 3.4 porque en su lugar utiliza un administrador de contexto:
ja: 以前のPythonでは、独自の <code>suppress</code> をロールすることができましたが、 <code>try</code> ないと、よりも冗長になります。 <strong>これが実際</strong>にPython 3.4の前に適用できる<strong>Pythonのどのレベルでも <code>try</code> を使用しない唯一の答えである</strong>と私は確信しています。 <strong>これは、</strong>代わりにコンテキストマネージャを使用しているためです。
ko: 이전 파이썬의 경우, 고유 한 <code>suppress</code> 를 굴릴 수 있지만 <code>try</code> 하지 않으면보다 더 장황합니다. 나는 <strong>이것이 실제로</strong> 컨텍스트 관리자를 사용하기 때문에 파이썬 3.4 이전에 적용될 수있는 <strong>파이썬의 어떤 수준에서도 <code>try</code> 를 사용하지 않는 유일한 대답</strong> 이라고 생각 <strong>합니다</strong> .
ru: Для более ранних Pythons, вы можете бросить свой собственный <code>suppress</code> , но без <code>try</code> будет более многословным, чем с. Я действительно считаю, <strong>что на самом деле это единственный ответ, который не использует <code>try</code> на любом уровне в Python,</strong> который может быть применен до Python 3.4, потому что вместо него используется менеджер контекста:
zh_cn: 对于较早的Python，您可以使用自己的 <code>suppress</code> ，但是如果不 <code>try</code> 则比使用它们更冗长。 我确实相信<strong>这实际上是唯一</strong>可以在Python 3.4之前的版本<strong>中不使用 <code>try</code> 的答案，</strong>因为它使用了上下文管理器代替：

source: For reference also see <a href="/q/82831">How to check whether a file exists using Python?</a>
es: Para referencia tambi&eacute;n vea <a href="/q/82831">&iquest;C&oacute;mo verificar si un archivo existe usando Python?</a>
ja: 参照については<a href="/q/82831">、Pythonを使用してファイルが存在するかどうかを確認する方法</a>も参照してください。
ko: 참고로 <a href="/q/82831">파이썬을 사용하여 파일이 있는지 확인하는 방법</a> 도 참조하십시오 .
ru: Для справки также см. <a href="/q/82831">Как проверить, существует ли файл с использованием Python?</a>
zh_cn: 供参考，请参阅<a href="/q/82831">如何使用Python检查文件是否存在？</a>

source: Here's a 1 line Python command for the Linux command line environment. I find this VERY HANDY since I'm not such a hot Bash guy.
es: Aquí hay un comando Python de una línea para el entorno de línea de comandos de Linux.Lo encuentro MUY MANUAL,ya que no soy un tipo tan sexy de Bash.
ja: Linuxのコマンドライン環境用の1行Pythonコマンドです。私はBashのようなホットな人ではないので、これは非常に便利です。
ko: 다음은 Linux 명령 행 환경을위한 1 행 Python 명령입니다. 나는 그렇게 뜨거운 배쉬 사람이 아니기 때문에이 HANDY를 발견합니다.
ru: Вот 1-строчная команда Python для командной строки Linux.Я нахожу это ОЧЕНЬ ХАНДИ,так как я не такой уж и горячий Бэш.
zh_cn: 这里有一个用于Linux命令行环境的1行Python命令。我觉得这个非常简单,因为我不是一个热衷于Bash的人。

source: Here's the help on <code>is_file</code>:
es: Aqu&iacute; est&aacute; la ayuda sobre <code>is_file</code> :
ja: <code>is_file</code> のヘルプは次のとおりです。
ko: <code>is_file</code> 에 대한 도움말은 다음과 같습니다.
ru: Вот справка по <code>is_file</code> :
zh_cn: 这是 <code>is_file</code> 的帮助：

source: How do I check whether a file exists without exceptions
es: ¿Cómo puedo comprobar si un archivo existe sin excepciones
ja: ファイルが例外なく存在するかどうかを確認する方法
ko: 예외없이 파일이 있는지 확인하는 방법
ru: Как проверить,существует ли файл без исключений.
zh_cn: 如何检查一个文件是否无异常地存在?

source: How do I check whether a file exists, using Python, without using a try statement?
es: ¿Cómo puedo comprobar si un archivo existe,usando Python,sin usar una declaración de prueba?
ja: Pythonを使って、try文を使わずにファイルが存在するかどうかを確認するにはどうすればいいですか?
ko: try 문을 사용하지 않고 Python을 사용하여 파일이 존재하는지 어떻게 확인합니까?
ru: Как проверить,существует ли файл,используя Python,без использования пробного утверждения?
zh_cn: 如何使用Python检查一个文件是否存在,而不使用try语句?

source: How do I see if a file exists or not, without using the <a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"><code>try</code></a> statement?
es: &iquest;C&oacute;mo puedo ver si un archivo existe o no, sin usar la instrucci&oacute;n <a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"> <code>try</code> </a> ?
ja: <a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"> <code>try</code> </a>ステートメントを使用せずに、ファイルが存在するかどうかを確認するにはどうすればよいですか？
ko: <a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"> <code>try</code> </a> 문을 사용하지 않고 파일이 있는지 여부를 어떻게 알 수 있습니까?
ru: Как узнать, существует файл или нет, без использования оператора <a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"> <code>try</code> </a> ?
zh_cn: 不使用<a href="https://docs.python.org/3.6/reference/compound_stmts.html#try"> <code>try</code> </a>语句如何查看文件是否存在？

source: I hope this is helpful.
es: Espero que esto sea de ayuda.
ja: 参考になれば幸いです。
ko: 도움이 되길 바랍니다.
ru: Надеюсь,это поможет.
zh_cn: 希望对你有帮助。

source: I made an exhaustive cheatsheet for your reference:
es: Hice una exhaustiva hoja de trucos para tu referencia:
ja: 参考までに網羅的なカンニングシートを作ってみました。
ko: 나는 당신의 참고를 위해 철저한 치트 시트를 만들었습니다.
ru: Я сделал исчерпывающую шпаргалку для твоей справки:
zh_cn: 我做了一个详尽的小结,供大家参考。

source: I should also mention that there are two ways that you will not be able to verify the existence of a file. Either the issue will be <code>permission denied</code> or <code>no such file or directory</code>. If you catch an <code>IOError</code>, set the <code>IOError as e</code> (like my first option), and then type in <code>print(e.args)</code> so that you can hopefully determine your issue. I hope it helps! :)
es: Tambi&eacute;n debo mencionar que hay dos formas en que no podr&aacute; verificar la existencia de un archivo. O bien, el problema ser&aacute; <code>permission denied</code> o <code>no such file or directory</code> . Si <code>IOError</code> un IOError , establezca el <code>IOError as e</code> (como mi primera opci&oacute;n), y luego escriba <code>print(e.args)</code> para que pueda determinar su problema. &iexcl;Espero que ayude! :)
ja: また、ファイルの存在を確認できない2つの方法があることにも触れておきます。 問題は、 <code>permission denied</code> か <code>no such file or directory</code> 。 <code>IOError</code> をキャッチした場合は、 <code>IOError as e</code> 設定し（最初のオプションと同様）、 <code>print(e.args)</code> と入力して問題を特定できるようにします。 お役に立てば幸いです。 :)
ko: 또한 파일의 존재를 확인할 수없는 두 가지 방법이 있습니다. 이 문제는 <code>permission denied</code> 또는 해당 <code>no such file or directory</code> . <code>IOError</code> 가 발생 하면 <code>IOError as e</code> ( 예 : 첫 번째 옵션) 로 설정 한 다음 <code>print(e.args)</code> 를 입력하여 문제를 판단 할 수 있습니다. 도움이 되길 바랍니다! :)
ru: Я должен также упомянуть, что есть два способа, которыми вы не сможете проверить существование файла. Либо проблема будет <code>permission denied</code> либо <code>no such file or directory</code> . Если вы поймаете <code>IOError</code> , установите <code>IOError as e</code> (как мой первый вариант), а затем введите <code>print(e.args)</code> чтобы вы могли надеяться определить вашу проблему. Я надеюсь, что это помогает! :)
zh_cn: 我还应该提到，有两种方法将无法验证文件的存在。 要么是问题被 <code>permission denied</code> 要么是 <code>no such file or directory</code> 。 如果捕获到 <code>IOError</code> ，请将IOError设置 <code>IOError as e</code> （就像我的第一个选项一样），然后键入 <code>print(e.args)</code> 以便希望确定问题。 希望对您有所帮助！ :)

source: I will try to keep it up to date, any suggestions are welcome, I will incorporate anything useful that will come up into the answer
es: Trataré de mantenerlo actualizado,cualquier sugerencia es bienvenida,incorporaré cualquier cosa útil que surja en la respuesta
ja: 私はそれを最新の状態に保つようにしようとします、どんな提案でも歓迎します、私は答えに出てくる有用な何かを組み込むつもりです
ko: 나는 그것을 최신 상태로 유지하려고 노력할 것입니다, 어떤 제안이라도 환영합니다, 나는 대답에 올 수있는 유용한 것을 통합 할 것입니다
ru: Я постараюсь держать его в курсе,любые предложения приветствуются,я включу все полезное,что появится в ответе
zh_cn: 我会尽量保持更新,欢迎任何建议,我将会把任何有用的东西纳入到答案中。

source: I'm the author of a package that's been around for about 10 years, and it has a function that addresses this question directly. Basically, if you are on a non-Windows system, it uses <code>Popen</code> to access <code>find</code>. However, if you are on Windows, it replicates <code>find</code> with an efficient filesystem walker.
es: Soy el autor de un paquete que ha existido durante aproximadamente 10 a&ntilde;os, y tiene una funci&oacute;n que aborda esta pregunta directamente. B&aacute;sicamente, si est&aacute; en un sistema que no es Windows, utiliza <code>Popen</code> para acceder a <code>find</code> . Sin embargo, si est&aacute; en Windows, replica <code>find</code> con un eficiente caminante de sistema de archivos.
ja: 私は約10年間使用されているパッケージの作成者で、この質問に直接対処する機能があります。 基本的に、Windows以外のシステムを使用している場合は、 <code>Popen</code> を使用して <code>find</code> にアクセスします 。 ただし、Windowsを使用している場合は、効率的なファイルシステムウォーカーを使用して <code>find</code> を複製します 。
ko: 저는 약 10 년 동안 사용되어 온 패키지의 저자이며이 질문을 직접 해결하는 기능을 가지고 있습니다. 기본적으로 Windows 이외의 시스템에있는 경우 <code>Popen</code> 을 사용하여 <code>find</code> 에 액세스합니다. 그러나 Windows에있는 경우 효율적인 파일 시스템 워커를 사용하여 <code>find</code> 를 복제합니다.
ru: Я являюсь автором пакета, который существует уже около 10 лет, и у него есть функция, которая решает этот вопрос напрямую. В основном, если вы работаете не в системе Windows, она использует <code>Popen</code> для доступа к <code>find</code> . Однако, если вы работаете в Windows, он копирует <code>find</code> с эффективным обходчиком файловой системы.
zh_cn: 我是一个已经存在大约十年的软件包的作者，它的功能可以直接解决这个问题。 基本上，如果您使用的是非Windows系统，它将使用 <code>Popen</code> 访问 <code>find</code> 。 但是，如果您使用的是Windows，它将使用高效的文件系统walker复制 <code>find</code> 。

source: I'm using <em>_waccess</em> so that the same code works on <em>Python3</em> and <em>Python2</em> (in spite of <em>unicode</em> related differences between them)
es: Estoy usando <em>_waccess</em> para que el mismo c&oacute;digo funcione en <em>Python3</em> y <em>Python2</em> (a pesar de <em>las</em> diferencias relacionadas con <em>Unicode</em> entre ellos)
ja: 同じコードが<em>Python3</em>と<em>Python2で</em>機能するように<em>_waccess</em>を<em>使用しています</em> （ <em>Unicode</em>関連の違いはありますが）。
ko: 동일한 코드가 <em>Python3</em> 과 <em>Python2</em> 에서 작동하도록 <em>_waccess를 사용</em> 하고 <em>있습니다</em> ( <em>유니 코드</em> 와의 차이점이 있음에도 불구하고)
ru: Я использую <em>_waccess,</em> чтобы один и тот же код работал на <em>Python3</em> и <em>Python2</em> (несмотря на различия между ними, связанные с <em>юникодом</em> )
zh_cn: 我正在使用<em>_waccess，</em>以便相同的代码可在<em>Python3</em>和<em>Python2上使用</em> （尽管它们之间存在与<em>Unicode</em>相关的区别）

source: If <em>filename</em> is NULL, then the returned handle is for the main program. When given to <strong>dlsym</strong>(), this handle causes a search for a symbol in the main program, followed by all shared objects loaded at program startup, and then all shared objects loaded by <strong>dlopen</strong>() with the flag <strong>RTLD_GLOBAL</strong>.
es: Si el <em>nombre de archivo</em> es NULL, el identificador devuelto es para el programa principal. Cuando se le da a <strong>dlsym</strong> (), este identificador provoca una b&uacute;squeda de un s&iacute;mbolo en el programa principal, seguido de todos los objetos compartidos cargados al inicio del programa, y ​​luego todos los objetos compartidos cargados por <strong>dlopen</strong> () con el indicador <strong>RTLD_GLOBAL</strong> .
ja: <em>filename</em>がNULLの場合、返されるハンドルはメインプログラム用です。 このハンドルを<strong>dlsym</strong> （）に指定すると、メインプログラム内のシンボルが検索され、プログラムの起動時に読み込まれるすべての共有オブジェクトが続きます。次に、フラグ<strong>RTLD_GLOBALを指定</strong>して<strong>dlopen</strong> （）によって読み込まれるすべての共有オブジェクトが続きます。
ko: <em>filename</em> 이 NULL이면 리턴 된 핸들은 기본 프로그램에 대한 것입니다. <strong>dlsym</strong> ()이 주어지면이 핸들은 기본 프로그램에서 기호를 찾은 다음 프로그램 시작시로드 된 모든 공유 객체와 <strong>RTLD_GLOBAL</strong> 플래그로 <strong>dlopen</strong> ()에 의해로드 된 모든 공유 객체를 검색합니다.
ru: Если <em>имя файла</em> NULL, то возвращаемый дескриптор для основной программы. При <strong>передаче dlsym</strong> () этот дескриптор вызывает поиск символа в основной программе, за которым следуют все общие объекты, загружаемые при запуске программы, а затем все общие объекты, загружаемые <strong>dlopen</strong> () с флагом <strong>RTLD_GLOBAL</strong> .
zh_cn: 如果<em>filename</em>为NULL，则返回的句柄用于主程序。 当赋予<strong>dlsym</strong> （）时，此句柄将在主程序中搜索符号，然后在程序启动时加载所有共享对象，然后在<strong>dlopen</strong> （）中加载带有标志<strong>RTLD_GLOBAL的</strong>所有共享对象。

source: If it's False, it will stop execution with an unhanded IOError or OSError in later versions of Python. To catch the exception, you have to use a try except clause. Of course, you can always use a <code>try</code> except` statement like so (thanks to <a href="https://stackoverflow.com/users/3256073/hsandt">hsandt</a> for making me think):
es: Si es False, detendr&aacute; la ejecuci&oacute;n con un IOError u OSError no administrado en versiones posteriores de Python. Para atrapar la excepci&oacute;n, debe utilizar una cl&aacute;usula try excepto. Por supuesto, siempre puedes usar una declaraci&oacute;n <code>try</code> excepto` as&iacute; (gracias a <a href="https://stackoverflow.com/users/3256073/hsandt">hsandt</a> por hacerme pensar):
ja: Falseの場合、それ以降のバージョンのPythonでは、手に渡らないIOErrorまたはOSErrorで実行が停止します。 例外をキャッチするには、try except節を使用する必要があります。 もちろん、次のようにいつでも <code>try</code> except`ステートメントを使用できます（考えさせてくれた<a href="https://stackoverflow.com/users/3256073/hsandt">hsandt</a>に感謝します）。
ko: False 인 경우 이후 버전의 Python에서 처리되지 않은 IOError 또는 OSError로 실행을 중지합니다. 예외를 잡으려면 try except 절을 사용해야합니다. 물론 항상 <code>try</code> except` 문을 사용할 수 있습니다 (생각해 주셔서 감사합니다).
ru: Если это значение False, оно прекратит выполнение с неуправляемым IOError или OSError в более поздних версиях Python. Чтобы поймать исключение, вы должны использовать предложение try, кроме. Конечно, вы всегда можете использовать оператор <code>try</code> кроме `` следующим образом (спасибо <a href="https://stackoverflow.com/users/3256073/hsandt">hsandt</a> за то, что заставил меня задуматься):
zh_cn: 如果为False，它将在更高版本的Python中以未处理的IOError或OSError停止执行。 要捕获异常，您必须使用tryexcept子句。 当然，您总是可以像这样使用 <code>try</code> try`语句（感谢<a href="https://stackoverflow.com/users/3256073/hsandt">hsandt</a>让我思考）：

source: If the file is for opening you could use one of the following techniques:
es: Si el archivo es para abrirlo,podría utilizar una de las siguientes técnicas:
ja: ファイルを開くためのものであれば、以下のテクニックのいずれかを使用することができます。
ko: 파일을 여는 경우 다음 기술 중 하나를 사용할 수 있습니다.
ru: Если файл предназначен для открытия,можно воспользоваться одним из следующих способов:
zh_cn: 如果文件是用来打开的,你可以使用以下技术之一。

source: If the reason you're checking is so you can do something like <code>if file_exists: open_it()</code>, it's safer to use a <code>try</code> around the attempt to open it. Checking and then opening risks the file being deleted or moved or something between when you check and when you try to open it.
es: Si la raz&oacute;n por la que est&aacute; verificando es para que pueda hacer algo como <code>if file_exists: open_it()</code> , es m&aacute;s seguro usar un intento para intentar abrirlo. Verificar y luego abrir se arriesga a que el archivo se elimine o se mueva o algo entre el momento en que verifica y cuando intenta abrirlo.
ja: チェックする理由が <code>if file_exists: open_it()</code> ようなことができるようにするためである場合、それを開こうとする試みを回避するのがより安全です。 チェックしてから開くと、ファイルを削除または移動したり、チェックしてから開こうとしたりする間にリスクが生じます。
ko: 확인하는 이유 <code>if file_exists: open_it()</code> 와 같은 방법으로 할 수 있다면 열려고 시도하는 것이 더 안전합니다. 확인 후 파일을 열면 파일을 삭제하거나 이동할 때 또는 파일을 확인할 때와 파일을 열 때 사이에 무언가 위험이 있습니다.
ru: Если причина, по которой вы проверяете, заключается в том, что вы можете сделать что-то вроде <code>if file_exists: open_it()</code> , безопаснее использовать <code>try</code> при попытке открыть его. Проверка и последующее открытие может привести к удалению или перемещению файла, а также к тому, что вы проверяете и когда пытаетесь открыть его.
zh_cn: 如果您要检查的原因是可以执行 <code>if file_exists: open_it()</code> ，则 <code>try</code> 尝试打开它更安全。 检查然后打开可能会导致文件被删除或移动，或者介于检查和尝试打开文件之间。

source: If you dig into <a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">the implementation</a>, though, you'll see that <code>is_file</code> uses <code>try</code>:
es: Sin embargo, si profundiza en <a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">la implementaci&oacute;n</a> , ver&aacute; que <code>is_file</code> usa <code>try</code> :
ja: ただし、 <a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">実装を</a>詳しく調べると、 <code>is_file</code> が <code>try</code> を使用していることがわかります。
ko: 그러나 <a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">구현</a> 을 파헤 <code>is_file</code> 이 <code>try</code> 를 사용한다는 것을 알 수 있습니다.
ru: Если вы углубитесь в <a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">реализацию</a> , то увидите, что <code>is_file</code> использует <code>try</code> :
zh_cn: 但是，如果深入研究<a href="https://github.com/python/cpython/blob/master/Lib/pathlib.py#L1318">实现</a> ，您将看到 <code>is_file</code> 使用 <code>try</code> ：

source: If you imported NumPy already for other purposes then there is no need to import other libraries like <code>pathlib</code>, <code>os</code>, <code>paths</code>, etc.
es: Si ya import&oacute; NumPy para otros fines, no es necesario importar otras bibliotecas como <code>pathlib</code> , <code>os</code> , <code>paths</code> , etc.
ja: NumPyをすでに他の目的でインポートした場合は、 <code>pathlib</code> 、 <code>os</code> 、 <code>paths</code> などのような他のライブラリをインポートする必要はありません。
ko: 다른 목적으로 NumPy를 이미 가져온 경우 <code>pathlib</code> , <code>os</code> , <code>paths</code> 등과 같은 다른 라이브러리를 가져올 필요가 없습니다.
ru: Если вы уже импортировали NumPy для других целей, то нет необходимости импортировать другие библиотеки, такие как <code>pathlib</code> , <code>os</code> , <code>paths</code> и т. Д.
zh_cn: 如果您已经导入NumPy用于其他目的，则无需导入其他库，例如 <code>pathlib</code> ， <code>os</code> ， <code>paths</code> 等。
