Repository: rueisnom/feedback
Catalog: xlf/82/83/1/82831.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>Note:</strong> However, this approach will not lock the file in any way and therefore your code can become vulnerable to "<strong>time of check to time of use</strong>" (<em>TOCTTOU</em>) bugs.
es: <strong>Nota:</strong> Sin embargo, este enfoque no bloquear&aacute; el archivo de ninguna manera y, por lo tanto, su c&oacute;digo puede volverse vulnerable a errores de " <strong>tiempo de verificaci&oacute;n a tiempo de uso</strong> " ( <em>TOCTTOU</em> ).
ja: <strong>注：</strong>ただし、この方法ではファイルがロックされないため、コードは「 <strong>チェック時刻から使用時刻</strong> 」（ <em>TOCTTOU</em> ）のバグに対して脆弱になる可能性があります。
ko: <strong>참고 :</strong> 그러나이 방법은 파일을 어떤 식 으로든 잠그지 않으므로 코드가 "사용 <strong>시간 확인</strong> "( <em>TOCTTOU</em> ) 버그에 취약해질 수 있습니다.
ru: <strong>Примечание.</strong> Однако этот подход никоим образом не блокирует файл, и поэтому ваш код может стать уязвимым к <em>ошибкам</em> &laquo; <strong>время проверки на время использования</strong> &raquo; ( <em>TOCTTOU</em> ).
zh_cn: <strong>注意：</strong>但是，这种方法不会以任何方式锁定文件，因此您的代码可能容易受到&ldquo; <strong>检查时间到使用时间</strong> &rdquo;（ <em>TOCTTOU</em> ）错误的<em>攻击</em> 。

source: <strong>Note</strong>: calling native <em>API</em>s is also possible via <a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]: <em>ctypes</em> - A foreign function library for Python</a>, but in most cases it's more complicated.
es: <strong>Nota</strong> : tambi&eacute;n es posible llamar a las <em>API</em> nativas a trav&eacute;s de <a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]: <em>ctypes</em> : una biblioteca de funciones for&aacute;neas para Python</a> , pero en la mayor&iacute;a de los casos es m&aacute;s complicada.
ja: <strong>注</strong> ：ネイティブ<em>API</em>の呼び出しは、 <a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]： <em>ctypes</em> -Python用の外部関数ライブラリで</a>も可能ですが、ほとんどの場合、より複雑です。
ko: <strong>참고</strong> : <a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]을</a> 통해 네이티브 <em>API를</em> 호출 할 수도 있습니다 . <em>ctypes</em> -Python의 외부 함수 라이브러리 이지만 대부분의 경우 더 복잡합니다.
ru: <strong>Примечание</strong> : вызов нативных <em>API</em> также возможен через <a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]: <em>ctypes</em> - библиотека <em>сторонних</em> функций для Python</a> , но в большинстве случаев она более сложная.
zh_cn: <strong>注意</strong> ：也可以通过<a href="https://docs.python.org/3/library/ctypes.html#module-ctypes">[Python 3]</a>调用本地<em>API</em> ： <em>ctypes</em> -Python的外部函数库 ，但是在大多数情况下，它更为复杂。

source: <strong>Note</strong>: every piece of <em>Python</em> standard library code that I'm going to post, belongs to version <strong>3.5.3</strong>.
es: <strong>Nota</strong> : cada parte del c&oacute;digo de la biblioteca est&aacute;ndar de <em>Python</em> que voy a publicar pertenece a la versi&oacute;n <strong>3.5.3</strong> .
ja: <strong>注</strong> ：私が投稿するすべての<em>Python</em>標準ライブラリコードは、バージョン<strong>3.5.3</strong>に属しています。
ko: <strong>참고</strong> : 게시 할 모든 <em>Python</em> 표준 라이브러리 코드는 버전 <strong>3.5.3에</strong> 속합니다.
ru: <strong>Примечание</strong> : каждый фрагмент кода стандартной библиотеки <em>Python,</em> который я собираюсь опубликовать, относится к версии <strong>3.5.3</strong> .
zh_cn: <strong>注意</strong> ：我要发布的每个<em>Python</em>标准库代码都属于<strong>3.5.3</strong>版。

source: <strong>Possible solutions</strong>:
es: <strong>Posibles soluciones</strong> :
ja: <strong>可能な解決策</strong> ：
ko: <strong>가능한 해결책</strong> :
ru: <strong>Возможные решения</strong> :
zh_cn: <strong>可能的解决方案</strong> ：

source: <strong>Problem statement</strong>:
es: <strong>Declaraci&oacute;n del problema</strong> :
ja: <strong>問題の説明</strong> ：
ko: <strong>문제 설명</strong> :
ru: <strong>Постановка проблемы</strong> :
zh_cn: <strong>问题陈述</strong> ：

source: <strong>Python 3.4+</strong> has an object-oriented path module: <a href="http://docs.python.org/3.4/library/pathlib.html"><strong>pathlib</strong></a>. Using this new module, you can check whether a file exists like this:
es: <strong>Python 3.4+</strong> tiene un m&oacute;dulo de ruta orientado a objetos: <a href="http://docs.python.org/3.4/library/pathlib.html"><strong>pathlib</strong></a> . Con este nuevo m&oacute;dulo, puede verificar si existe un archivo como este:
ja: <strong>Python 3.4以降に</strong>は、オブジェクト指向のパスモジュール<strong>pathlib</strong>があります。 この新しいモジュールを使用すると、次のようにファイルが存在するかどうかを確認できます。
ko: <strong>Python 3.4+</strong> 에는 객체 지향 경로 모듈 ( <a href="http://docs.python.org/3.4/library/pathlib.html"><strong>pathlib)이</strong></a> 있습니다. 이 새로운 모듈을 사용하여 파일이 다음과 같이 존재하는지 확인할 수 있습니다.
ru: <strong>В Python 3.4+</strong> есть объектно-ориентированный модуль пути: <a href="http://docs.python.org/3.4/library/pathlib.html"><strong>pathlib</strong></a> . Используя этот новый модуль, вы можете проверить, существует ли файл следующим образом:
zh_cn: <strong>Python 3.4+</strong>具有一个面向对象的路径模块： <a href="http://docs.python.org/3.4/library/pathlib.html"><strong>pathlib</strong></a> 。 使用这个新模块，您可以检查文件是否存在，如下所示：

source: <strong>user permissions</strong> might restrict the file "visibility" as the doc states:
es: <strong>los permisos de usuario</strong> pueden restringir la "visibilidad" del archivo como dice el documento:
ja: ドキュメントに記載されているように、 <strong>ユーザーの権限</strong>によってファイルの「表示」が制限される場合があります。
ko: doc 상태에 따라 <strong>사용자 권한으로</strong> 파일 "visibility"가 제한 될 수 있습니다.
ru: <strong>пользовательские разрешения</strong> могут ограничивать "видимость" файла, как указано в документе:
zh_cn: <strong>用户权限</strong>可能会限制文件&ldquo;可见性&rdquo;，如doc所述：

source: Adding a variant based on suggestion from Peter Wood
es: Añadiendo una variante basada en la sugerencia de Peter Wood
ja: ピーター・ウッドからの提案に基づくバリエーションの追加
ko: Peter Wood의 제안을 기반으로 변형 추가
ru: Добавление варианта,основанного на предложении Питера Вуда.
zh_cn: 根据Peter Wood的建议增加一个变体

source: Adding a variant based on suggestion from Shahbaz
es: Añadiendo una variante basada en la sugerencia de Shahbaz
ja: Shahbazさんからの提案を元にバリエーションを追加
ko: Shahbaz의 제안을 기반으로 변형 추가
ru: Добавление варианта по предложению Шахбаза
zh_cn: 根据Shahbaz的建议增加了一个变体。

source: Adding one more slight variation which isn't exactly reflected in the other answers.
es: Añadiendo una ligera variación más que no se refleja exactamente en las otras respuestas.
ja: 他の回答には正確には反映されていませんが、もう一つわずかな変化を追加します。
ko: 다른 답변에 정확하게 반영되지 않은 약간의 변형을 추가하십시오.
ru: Добавление еще одного небольшого изменения,которое неточно отражено в других ответах.
zh_cn: 再加一个不完全反映在其他答案中的细微变化。

source: Additionally, <code>os.access()</code>:
es: Adem&aacute;s, <code>os.access()</code> :
ja: さらに、 <code>os.access()</code> ：
ko: 또한 <code>os.access()</code> :
ru: Кроме того, <code>os.access()</code> :
zh_cn: 另外， <code>os.access()</code> ：

source: All good, but if following the import tree:
es: Todo bien,pero si se sigue el árbol de importación:
ja: すべての問題はありませんが、インポートツリーに従っている場合。
ko: 모두 좋지만 가져 오기 트리를 따르는 경우 :
ru: Все хорошо,но если следовать за деревом импорта:
zh_cn: 都是好的,但如果按照进口树的说法,。

source: All it's doing is using the given path to see if it can get stats on it, catching <code>OSError</code> and then checking if it's a file if it didn't raise the exception.
es: Todo lo que est&aacute; haciendo es usar la ruta dada para ver si puede obtener estad&iacute;sticas, capturar <code>OSError</code> y luego verificar si es un archivo si no gener&oacute; la excepci&oacute;n.
ja: 実行しているのは、指定されたパスを使用して統計を取得できるかどうかを確認し、 <code>OSError</code> をキャッチして、例外が発生しなかった場合にファイルかどうかを確認することだけです。
ko: 주어진 경로를 사용하여 통계를 얻을 수 있는지 확인하고 <code>OSError</code> 를 포착 한 다음 예외가 발생하지 않은 경우 파일인지 확인합니다.
ru: Все, что он делает, - использует заданный путь, чтобы посмотреть, сможет ли он получить статистику, <code>OSError</code> и затем проверяет, является ли это файл, если он не вызывает исключение.
zh_cn: 它所做的就是使用给定的路径查看它是否可以获取统计信息，捕获 <code>OSError</code> ，然后检查它是否是文件（如果未引发异常）。

source: Although I always recommend using <code>try</code> and <code>except</code> statements, here are a few possibilities for you (my personal favourite is using <code>os.access</code>):
es: Aunque siempre recomiendo usar las declaraciones <code>try</code> y <code>except</code> , aqu&iacute; hay algunas posibilidades para usted (mi favorito personal es usar <code>os.access</code> ):
ja: 私は常に <code>try</code> および <code>except</code> ステートメントを使用することをお勧めしますが、ここにいくつかの可能性があります（私の個人的なお気に入りは <code>os.access</code> の使用です）：
ko: 항상 <code>try</code> 및 <code>except</code> 문을 사용 하는 것이 좋지만 다음은 몇 가지 가능성입니다 (개인적으로 선호하는 것은 <code>os.access</code> ).
ru: Несмотря на то, что я всегда рекомендую использовать операторы <code>try</code> и <code>except</code> утверждений, вот несколько вариантов для вас (мой личный фаворит - использование <code>os.access</code> ):
zh_cn: 尽管我总是建议使用 <code>try</code> 和 <code>except</code> 语句，但是您可以使用以下 <code>os.access</code> （我个人最喜欢使用os.access ）：

source: Although almost every possible way has been listed in (at least one of) the existing answers (e.g. <em>Python 3.4</em> specific stuff was added), I'll try to group everything together.
es: Aunque casi todas las formas posibles se han enumerado en (al menos una de) las respuestas existentes (por ejemplo, se agregaron cosas espec&iacute;ficas de <em>Python 3.4</em> ), intentar&eacute; agrupar todo.
ja: ほとんどすべての可能な方法が既存の回答（少なくとも1つ）にリストされていますが（たとえば、 <em>Python 3.4</em>固有のものが追加されました）、すべてを一緒にグループ化しようとします。
ko: 거의 모든 가능한 방법이 기존 답변 (예 : <em>Python 3.4</em> 관련 항목이 추가됨)에 나열되어 있지만 모든 것을 함께 그룹화하려고 시도합니다.
ru: Хотя почти все возможные способы были перечислены в (по крайней мере, одном из) существующих ответов (например, добавлен материал, специфичный для <em>Python 3.4</em> ), я постараюсь сгруппировать все вместе.
zh_cn: 尽管在（至少一个）现有答案中已经列出了几乎所有可能的方式（例如，添加了<em>Python 3.4</em>特定的内容），但我将尝试将所有内容组合在一起。

source: Although it's not a good practice, I'm using <code>os.F_OK</code> in the call, but that's just for clarity (its value is <strong>0</strong>)
es: Aunque no es una buena pr&aacute;ctica, estoy usando <code>os.F_OK</code> en la llamada, pero eso es solo por claridad (su valor es <strong>0</strong> )
ja: これは良い方法ではありませんが、呼び出しで <code>os.F_OK</code> を使用していますが、これはわかりやすくするためです（値は<strong>0です</strong> ）。
ko: 좋은 방법은 아니지만 호출에 <code>os.F_OK</code> 를 사용하고 있지만 명확성을 위해 있습니다 (값은 <strong>0</strong> )
ru: Хотя это не очень хорошая практика, я использую <code>os.F_OK</code> в вызове, но это только для ясности (его значение равно <strong>0</strong> )
zh_cn: 尽管这不是一个好习惯，但我在调用中使用了 <code>os.F_OK</code> ，但这只是为了清楚起见（其值为<strong>0</strong> ）

source: Although this targets a very specific area, <strong>it was not mentioned in any of the previous answers</strong>
es: Aunque esto se dirige a un &aacute;rea muy espec&iacute;fica, <strong>no se mencion&oacute; en ninguna de las respuestas anteriores</strong>
ja: これは非常に特定の領域を対象<strong>としていますが、これまでの回答では言及されていませんでした</strong>
ko: 이것은 매우 구체적인 영역을 목표로하지만 <strong>이전 답변에서는 언급되지 않았습니다.</strong>
ru: Хотя это относится к очень конкретной области, <strong>она не упоминалась ни в одном из предыдущих ответов</strong>
zh_cn: 尽管这是针对非常特定的领域， <strong>但之前的任何答案都未提及</strong>

source: An intuitive and arguable way to check if a file exists is the following:
es: Una forma intuitiva y discutible de comprobar si un archivo existe es la siguiente:
ja: ファイルが存在するかどうかを確認するための直感的で議論の余地のある方法は以下の通りです。
ko: 파일이 존재하는지 확인하는 직관적이고 논쟁의 여지가있는 방법은 다음과 같습니다.
ru: Интуитивно понятным и аргументированным способом проверки существования файла является следующее:
zh_cn: 检查一个文件是否存在的直观的、可商榷的方法如下。

source: And its usage - I'll replicate the <code>os.path.isfile</code> behavior (note that this is just for demonstrating purposes, do <strong>not</strong> attempt to write such code for <em>production</em>):
es: Y su uso: replicar&eacute; el comportamiento del <code>os.path.isfile</code> (tenga en cuenta que esto es solo para fines de demostraci&oacute;n, <strong>no</strong> intente escribir dicho c&oacute;digo para la <em>producci&oacute;n</em> ):
ja: そしてその使用法-私は <code>os.path.isfile</code> の動作を複製します（これは単に説明の目的であることに注意してください。 <em>本番</em>用にこのようなコードを記述し<strong>ない</strong>でください）：
ko: 그리고 사용법 <code>os.path.isfile</code> 동작을 복제합니다 (이것은 단지 설명을 목적으로 한 것이며 <em>생산을</em> 위해 그러한 코드를 작성하려고 시도하지 <strong>마십시오</strong> ).
ru: И его использование - я <code>os.path.isfile</code> поведение os.path.isfile (обратите внимание, что это только для демонстрации, <strong>не</strong> пытайтесь писать такой код для <em>производства</em> ):
zh_cn: 及其用法-我将复制 <code>os.path.isfile</code> 行为（请注意，这只是出于演示目的，请勿尝试为<em>生产</em>编写此类代码）：

source: And the doc&hellip;
es: Y el doctor ...
ja: そして、ドキュメント&hellip;
ko: 그리고 의사&hellip;
ru: И док ...
zh_cn: 还有文件

source: Another (lame) workaround (<em>gainarie</em>) is (as I like to call it,) the <em>sysadmin</em> approach: use <em>Python</em> as a wrapper to execute shell commands
es: Otra soluci&oacute;n (poco <em>convincente</em> ) ( <em>gainarie</em> ) es (como me gusta llamarlo) el enfoque <em>sysadmin</em> : use <em>Python</em> como envoltorio para ejecutar comandos de shell
ja: 別の（ <em>不完全</em>な）回避策（ <em>gainarie</em> ）は（私がそれを呼んでみたい） <em>sysadmin</em>アプローチです： <em>Python</em>をラッパーとして使用してシェルコマンドを実行します
ko: 또 다른 (불법적 인) 해결 방법 ( <em>gainarie</em> )은 <em>sysadmin</em> 접근 방식입니다 ( <em>파이썬</em> 을 래퍼로 사용하여 쉘 명령 실행)
ru: Другой ( <em>слабый</em> ) обходной путь ( <em>gainarie</em> ) - это (как я это называю) подход <em>sysadmin</em> : использование <em>Python</em> в качестве оболочки для выполнения команд оболочки
zh_cn: 另一个（ <em>lam</em> ）解决方法（ <em>gainarie</em> ）是（我喜欢这样称呼） <em>sysadmin</em>方法：使用<em>Python</em>作为包装器执行Shell命令

source: Another answer says this about <code>os.access</code>:
es: Otra respuesta dice esto sobre <code>os.access</code> :
ja: 別の答えは <code>os.access</code> についてこれを言います：
ko: 또 다른 대답은 <code>os.access</code> 에 대해 말합니다.
ru: Другой ответ говорит об <code>os.access</code> :
zh_cn: 另一个答案是关于 <code>os.access</code> 的 ：

source: Anyway, here:
es: De todos modos,aquí:
ja: とにかく、ここで。
ko: 어쨌든, 여기 :
ru: В любом случае,здесь:
zh_cn: 总之,这里。

source: Assuming that the "path" is a valid path, this table shows what is returned by each function for files and folders:
es: Asumiendo que el "camino" es un camino válido,esta tabla muestra lo que devuelve cada función para los archivos y carpetas:
ja: path "が有効なパスであると仮定した場合、この表はファイルやフォルダに対して各関数が返す内容を示しています。
ko: "경로"가 유효한 경로라고 가정하면이 표는 파일과 폴더에 대해 각 함수가 반환하는 내용을 보여줍니다.
ru: Предполагая,что "путь" является правильным,эта таблица показывает,что возвращается каждой функцией для файлов и папок:
zh_cn: 假设 "路径 "是有效路径,本表显示了每个函数返回的文件和文件夹的内容。

source: Available for Unix and Windows is <code>os.access</code>, but to use you must pass flags, and it does not differentiate between files and directories. This is more used to test if the real invoking user has access in an elevated privilege environment:
es: Disponible para Unix y Windows es <code>os.access</code> , pero para usarlo debe pasar banderas, y no diferencia entre archivos y directorios. Esto se usa m&aacute;s para probar si el usuario real que invoca tiene acceso en un entorno de privilegios elevados:
ja: UnixとWindowsで使用できるのは <code>os.access</code> ですが、使用するにはフラグを渡す必要があり、ファイルとディレクトリを区別しません。 これは、実際の呼び出しユーザーが昇格された特権環境でアクセスできるかどうかをテストするために使用されます。
ko: 유닉스와 Windows에서 사용할 수있는 것은 <code>os.access</code> 이지만 사용하려면 플래그를 전달해야하며 파일과 디렉토리를 구분하지 않습니다. 실제 호출하는 사용자가 상승 된 권한 환경에서 액세스 할 수 있는지 테스트하는 데 더 사용됩니다.
ru: Для Unix и Windows <code>os.access</code> , но для его использования необходимо указать флаги, и он не различает файлы и каталоги. Это больше используется для проверки, имеет ли реальный вызывающий пользователь доступ в среде с повышенными привилегиями:
zh_cn: <code>os.access</code> 可用于Unix和Windows，但要使用它，必须传递标志，并且不能区分文件和目录。 这更可用于测试真正的调用用户是否在提升的特权环境中具有访问权限：

source: Available since Python 3.4, use the new <code>Path</code> object in <code>pathlib</code>. Note that <code>.exists</code> is not quite right, because directories are not files (except in the unix sense that <em>everything</em> is a file).
es: Disponible desde Python 3.4, use el nuevo objeto <code>Path</code> en <code>pathlib</code> . Tenga en cuenta que <code>.exists</code> no es del todo correcto, porque los directorios no son archivos (excepto en el sentido de Unix de que <em>todo</em> es un archivo).
ja: Python 3.4以降で使用可能です <code>pathlib</code> 新しい <code>Path</code> オブジェクトを使用してください 。 ディレクトリはファイルではないため、 <code>.exists</code> は完全に正しくないことに注意してください（UNIXでは、 <em>すべて</em>がファイルであるという意味を除きます）。
ko: Python 3.4부터 사용 가능하며 <code>pathlib</code> 의 새 <code>Path</code> 객체를 사용하십시오. 디렉토리는 파일이 아니기 때문에 <code>.exists</code> 는 옳지 않습니다 (유닉스 의미에서는 <em>모든</em> 것이 파일이라는 <em>것을</em> 제외하고).
ru: Доступный начиная с Python 3.4, используйте новый объект <code>Path</code> в <code>pathlib</code> . Обратите внимание, что <code>.exists</code> не совсем прав, потому что каталоги не являются файлами (за исключением того, что Unix означает, что <em>все</em> является файлом).
zh_cn: 从Python 3.4开始可用，请在 <code>pathlib</code> 中使用新的 <code>Path</code> 对象。 请注意， <code>.exists</code> 不太正确，因为目录不是文件（从Unix的意义上讲， <em>一切</em>都是文件）。

source: Avoid using <code>os.access</code>. It is a low level function that has more opportunities for user error than the higher level objects and functions discussed above.
es: Evite usar <code>os.access</code> . Es una funci&oacute;n de bajo nivel que tiene m&aacute;s oportunidades para el error del usuario que los objetos y funciones de nivel superior discutidos anteriormente.
ja: <code>os.access</code> の使用は避けてください。 これは、前述の高レベルのオブジェクトおよび関数よりもユーザーエラーの可能性が高い低レベルの関数です。
ko: <code>os.access</code> 사용을 피하십시오. 위에서 설명한 상위 수준 개체 및 기능보다 사용자 오류 가능성이 더 낮은 하위 수준 기능입니다.
ru: Избегайте использования <code>os.access</code> . Это функция низкого уровня, которая имеет больше возможностей для ошибок пользователя, чем объекты и функции более высокого уровня, описанные выше.
zh_cn: 避免使用 <code>os.access</code> 。 它是一个低级功能，与上面讨论的高级对象和功能相比，它有更多的用户错误机会。

source: Avoiding Race Conditions
es: Evitar las condiciones de la raza
ja: レース条件の回避
ko: 경쟁 조건 피하기
ru: Избегание условий гонки
zh_cn: 避开比赛条件

source: Avoiding race conditions without a try statement: <code>suppress</code>
es: Evitar condiciones de carrera sin una declaraci&oacute;n de prueba: <code>suppress</code>
ja: tryステートメントなしで競合状態を回避する： <code>suppress</code>
ko: try 문없이 경쟁 조건 피하기 : <code>suppress</code>
ru: Избегать условий гонки без попытки заявления: <code>suppress</code>
zh_cn: 在没有try语句的情况下避免竞争条件： <code>suppress</code>

source: Because Python uses <code>try</code> everywhere, there's really no reason to avoid an implementation that uses it.
es: Debido a que Python usa <code>try</code> en todas partes, realmente no hay raz&oacute;n para evitar una implementaci&oacute;n que lo use.
ja: Pythonはあらゆる場所で <code>try</code> を使用するため、それを使用する実装を回避する理由は本当にありません。
ko: 파이썬은 모든 곳에서 <code>try</code> 사용하기 때문에 그것을 사용하는 구현을 피할 이유가 없습니다.
ru: Поскольку Python использует <code>try</code> везде, на самом деле нет причин избегать реализации, которая его использует.
zh_cn: 由于Python在任何地方都使用 <code>try</code> ，因此实际上没有理由避免使用它的实现。

source: Being <code>R_OK</code>, <code>W_OK</code>, and <code>X_OK</code> the flags to test for permissions (<a href="https://docs.python.org/3/library/os.html#os.access">doc</a>).
es: Siendo <code>R_OK</code> , <code>W_OK</code> y <code>X_OK</code> las banderas para probar los permisos ( <a href="https://docs.python.org/3/library/os.html#os.access">doc</a> ).
ja: <code>R_OK</code> 、 <code>W_OK</code> 、および <code>X_OK</code> であるため、権限をテストするためのフラグ（ <a href="https://docs.python.org/3/library/os.html#os.access">doc</a> ）。
ko: <code>R_OK</code> , <code>W_OK</code> 및 <code>X_OK</code> 이므로 권한을 테스트 할 플래그 ( <a href="https://docs.python.org/3/library/os.html#os.access">doc</a> )입니다.
ru: Будучи <code>R_OK</code> , <code>W_OK</code> и <code>X_OK</code> , флаги для проверки прав доступа ( <a href="https://docs.python.org/3/library/os.html#os.access">doc</a> ).
zh_cn: 作为 <code>R_OK</code> ， <code>W_OK</code> 和 <code>X_OK</code> 的标志来测试权限（ <a href="https://docs.python.org/3/library/os.html#os.access">doc</a> ）。

source: But if this is your motivation, you <em>can</em> get the value of a <code>try</code> statement by using the <code>suppress</code> context manager.
es: Pero si esta es su motivaci&oacute;n, <em>puede</em> obtener el valor de una declaraci&oacute;n de <code>try</code> utilizando el administrador de contexto de <code>suppress</code> .
ja: しかし、これが動機である場合<em>は</em> 、 <code>suppress</code> コンテキストマネージャを使用して、 <code>try</code> ステートメントの値を取得<em>でき</em>ます。
ko: 그러나 이것이 동기 부여 인 경우 <code>suppress</code> 컨텍스트 관리자를 사용하여 <code>try</code> 문의 값을 얻을 <em>수 있습니다</em> .
ru: Но если это ваша мотивация, вы <em>можете</em> получить значение оператора <code>try</code> с помощью диспетчера <code>suppress</code> контекста.
zh_cn: 但是，如果这是您的动力，则<em>可以</em>通过使用 <code>suppress</code> 上下文管理器<em>来</em>获得 <code>try</code> 语句的价值。

source: But if you examine the <a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">source</a> of this function, you'll see it actually does use a try statement:
es: Pero si examina el <a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">origen</a> de esta funci&oacute;n, ver&aacute; que en realidad usa una instrucci&oacute;n try:
ja: しかし、この関数の<a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">ソース</a>を調べると、実際にtryステートメントを使用していることがわかります。
ko: 그러나이 함수의 <a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">소스</a> 를 살펴보면 실제로 try 문을 사용하는 것을 볼 수 있습니다.
ru: Но если вы изучите <a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">источник</a> этой функции, вы увидите, что она действительно использует оператор try:
zh_cn: 但是，如果您检查此函数的<a href="https://hg.python.org/cpython/file/tip/Lib/genericpath.py#l25">来源</a> ，您会发现它确实使用了try语句：

source: But if you just wanted to rename a file if it exists, and therefore don't need to open it, do
es: Pero si sólo quieres renombrar un archivo si existe,y por lo tanto no necesitas abrirlo,hazlo
ja: しかし、ファイルが存在する場合に名前を変更したいだけで、ファイルを開く必要がない場合には
ko: 그러나 파일이 있으면 파일 이름을 바꾸고 싶을 때 열 필요가 없으면
ru: Но если вы просто хотите переименовать файл,если он существует,и,следовательно,вам не нужно его открывать,сделайте следующее
zh_cn: 但是,如果你只是想重命名一个文件,如果它存在的话,因此不需要打开它,那就去做

source: But the rest of this answer attempts to consider these caveats.
es: Pero el resto de esta respuesta intenta considerar estas advertencias.
ja: しかし、この回答の残りの部分は、これらの注意点を考慮しようとしています。
ko: 그러나이 답변의 나머지 부분은 이러한주의 사항을 고려하려고합니다.
ru: Но остальная часть ответа пытается учесть эти предостережения.
zh_cn: 但本回答的其余部分试图考虑这些注意事项。

source: But, since this is more like a workaround, I'm stopping here.
es: Pero,como esto es más bien una solución alternativa,me detendré aquí.
ja: でも、これはどちらかというと回避策のようなものなので、ここで止めておきます。
ko: 그러나 이것은 해결 방법과 비슷하기 때문에 여기서 멈 춥니 다.
ru: Но,так как это больше похоже на обходной приём,я останавливаюсь здесь.
zh_cn: 但是,因为这更像是一种变通,所以我就不说了。
