Repository: rueisnom/feedback
Catalog: xlf/45/13/5/45135.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: <code>libmysqlclient</code> - static, for the sake of the example (you'd prefer the shared library, of course, as the <code>libmysqlclient</code> is huge); in <code>/usr/local/lib</code>; and dependent on stuff from <code>libz</code>
ja: <code>libmysqlclient</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例のために静的（</font></font> <code>libmysqlclient</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は巨大</font><font style="vertical-align: inherit;">であるため、もちろん、共有ライブラリをお勧めします</font><font style="vertical-align: inherit;">）; </font><font style="vertical-align: inherit;">中に</font></font> <code>/usr/local/lib</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">そして</font> <code>libz</code> <font style="vertical-align: inherit;">からのものに依存</font></font><font style="vertical-align: inherit;"></font>
ko: <code>libmysqlclient</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 예제를 위해 정적입니다 ( </font></font> <code>libmysqlclient</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">크므</font><font style="vertical-align: inherit;"> 로 공유 라이브러리를 선호합니다 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">에서 </font></font> <code>/usr/local/lib</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">그리고 </font> <code>libz</code> 의<font style="vertical-align: inherit;"> 것들에 의존</font></font><font style="vertical-align: inherit;"></font>
ru: <code>libmysqlclient</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - статический, для примера (вы бы предпочли разделяемую библиотеку, конечно, так как </font></font> <code>libmysqlclient</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> огромен); </font><font style="vertical-align: inherit;">в </font></font> <code>/usr/local/lib</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">и зависит от вещей из </font></font> <code>libz</code>
zh_cn: <code>libmysqlclient</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态的，为了举例（您更喜欢共享库，因为</font></font> <code>libmysqlclient</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很大）；</font><font style="vertical-align: inherit;">在</font></font> <code>/usr/local/lib</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">；</font><font style="vertical-align: inherit;">并依赖于</font> <code>libz</code> 的<font style="vertical-align: inherit;">东西</font></font><font style="vertical-align: inherit;"></font>

source: <code>libz</code> (dynamic)
ja: <code>libz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（動的）</font></font>
ko: <code>libz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (동적)</font></font>
ru: <code>libz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (динамический)</font></font>
zh_cn: <code>libz</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（动态）</font></font>

source: <code>myprog.o</code> - containing <code>main()</code> function, dependent on <code>libmysqlclient</code>
ja: <code>myprog.o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -含有</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に依存して、関数</font></font> <code>libmysqlclient</code> の
ko: <code>myprog.o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font> <code>libmysqlclient</code> 에<font style="vertical-align: inherit;"> 의존 </font><font style="vertical-align: inherit;">하는 </font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수 </font><font style="vertical-align: inherit;">포함</font></font><font style="vertical-align: inherit;"></font>
ru: <code>myprog.o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - содержит </font><font style="vertical-align: inherit;">функцию </font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , зависящую от </font></font> <code>libmysqlclient</code>
zh_cn: <code>myprog.o</code> -<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含</font></font> <code>main()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数，取决于</font></font> <code>libmysqlclient</code>

source: <em><strong>Careful !</strong></em>
ja: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意！</font></font></strong></em>
ko: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조심해!</font></font></strong></em>
ru: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Осторожный !</font></font></strong></em>
zh_cn: <em><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">小心点！</font></font></strong></em>

source: <sub>(See the history on this answer to get the more elaborate text, but I now think it's easier for the reader to see real command lines).</sub>
ja: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（この回答の履歴を見て、より複雑なテキストを入手してください。しかし、読者が実際のコマンドラインを見る方が簡単だと思います）。</font></font></sub>
ko: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(보다 정교한 텍스트를 얻으려면이 답변의 기록을 참조하십시오.하지만 독자가 실제 명령 줄을 보는 것이 더 쉽다고 생각합니다).</font></font></sub>
ru: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Посмотрите историю этого ответа, чтобы получить более сложный текст, но теперь я думаю, что читателю легче увидеть реальные командные строки).</font></font></sub>
zh_cn: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（请参阅此答案的历史以获取更详尽的文本，但我现在认为读者更容易看到真实的命令行）。</font></font></sub>

source: A quick tip that tripped me up: if you're invoking the linker as "gcc" or "g++", then using "--start-group" and "--end-group" won't pass those options through to the linker -- nor will it flag an error. It will just fail the link with undefined symbols if you had the library order wrong.
ja: ちょっとしたヒントで困ったことがあります。リンカを "gcc "または "g++"として起動している場合、"--start-group "および"--end-group "を使用しても、リンカにこれらのオプションを渡すことはできません --エラーフラグも立てません。ライブラリの順番が間違っていた場合は、未定義のシンボルでリンクを失敗させるだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링커를 "gcc"또는 "g ++"로 호출하는 경우 "--start-group"및 "--end-group"을 사용하면 해당 옵션을 링커-오류를 표시하지 않습니다. </font><font style="vertical-align: inherit;">라이브러리 순서가 잘못되면 정의되지 않은 기호가있는 링크가 실패합니다.</font></font>
ru: Быстрый совет,который меня сбил с толку:если вы вызываете компоновщик как "gcc" или "g++",то использование "--start-group" и "--end-group" не передаст эти опции компоновщику --и не поставит флажок на ошибку.Он просто не передаст ссылку с неопределёнными символами,если вы ошиблись с порядком в библиотеке.
zh_cn: 一个快速的小提示让我很困扰:如果你以 "gcc "或 "g++"的身份调用链接器,那么使用"--start-group "和"--end-group "不会将这些选项传递给链接器,也不会标记一个错误。如果你把库的顺序弄错了,它只会以未定义的符号导致链接失败。

source: Another alternative would be to specify the list of libraries twice:
ja: 別の方法としては、ライブラリのリストを2回指定するという方法もあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른 대안은 라이브러리 목록을 두 번 지정하는 것입니다.</font></font>
ru: Другой альтернативой было бы дважды указать список библиотек:
zh_cn: 另一种选择是指定两次图书馆的清单。

source: Common files shared by all below commands
ja: 以下のコマンドで共有されている共通ファイル
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래의 모든 명령이 공유하는 공통 파일</font></font>
ru: Общие файлы,общие для всех нижеперечисленных команд
zh_cn: 以下所有命令共享的常用文件

source: Dependencies of static libraries against each other work the same - the library that needs symbols must be first, then the library that resolves the symbol.
ja: 静的ライブラリ同士の依存関係は同じで、シンボルを必要とするライブラリが先になり、次にシンボルを解決するライブラリが先になります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 라이브러리의 서로에 대한 종속성은 동일하게 작동합니다. 즉, 기호가 필요한 라이브러리가 먼저 있어야하고, 그런 다음 기호를 해석하는 라이브러리가되어야합니다.</font></font>
ru: Зависимости статических библиотек друг от друга работают одинаково-библиотека,которой нужны символы,должна быть сначала библиотекой,которая разрешает символ.
zh_cn: 静态库之间的相互依赖关系的工作原理是一样的--需要符号的库必须先是需要符号的库,然后是解析符号的库。

source: Depending on different linkers HP/Intel/GCC/SUN/SGI/IBM/etc you can get unresolved functions/variables etc, on some platforms you have to list libraries twice.
ja: HPIntelGCCSUNSGIIBMetcのリンカの違いによっては、未解決の関数変数などを取得することができますが、プラットフォームによってはライブラリを2回リストアップしなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 링커 HP / Intel / GCC / SUN / SGI / IBM / etc에 따라 일부 플랫폼에서 라이브러리를 두 번 나열해야하는 미해결 함수 / 변수 등을 얻을 수 있습니다.</font></font>
ru: В зависимости от различных линковщиков HPIntelGCCSUNSGIIBMetc можно получить неразрешенные функции-переменные и т.д.,на некоторых платформах библиотеки приходится перечислять дважды.
zh_cn: 根据不同的链接器HPIntelGCCSUNSGIIBMetc,你可能会得到未解决的函数变量等,在某些平台上,你必须两次列出库。

source: Doing this, you don't have to bother with the right sequence since the reference will be resolved in the second block.
ja: これを行うことで、参照は2つ目のブロックで解決されるので、正しいシーケンスに悩む必要はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 수행하면 참조가 두 번째 블록에서 해결되므로 올바른 순서로 신경 쓸 필요가 없습니다.</font></font>
ru: Делая это,вам не нужно беспокоиться о правильной последовательности,так как ссылка будет разрешена во втором блоке.
zh_cn: 这样做,你就不用再纠结于正确的序列了,因为引用将在第二块中解决。

source: For the most part we use structured hierarchy of libraries, core, platform, different layers of abstraction, but for some systems you still have to play with the order in the link command.
ja: ほとんどの場合、ライブラリ、コア、プラットフォーム、さまざまな抽象度の階層構造を使用していますが、システムによっては、linkコマンドの順序を変更しなければならない場合があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 경우 라이브러리, 코어, 플랫폼, 다른 추상화 계층 구조 계층을 사용하지만 일부 시스템의 경우 여전히 link 명령에서 순서를 따라야합니다.</font></font>
ru: По большей части мы используем структурированную иерархию библиотек,ядра,платформы,различные уровни абстракции,но для некоторых систем вам все равно придется играть с порядком в команде link.
zh_cn: 大多数情况下,我们使用的是结构化的分层库、核心、平台、不同的抽象层,但对于一些系统来说,你还是要玩转链接命令中的顺序。

source: Here is an example of the implications if you miss specifying the dependencies for <code>libb.so</code>
ja: <font style="vertical-align: inherit;"> <code>libb.so</code> <font style="vertical-align: inherit;">の依存関係の指定を忘れた場合の影響の例を次に示します</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 </font> <code>libb.so</code> 에<font style="vertical-align: inherit;"> 대한 종속성을 지정하지 않은 경우의 의미에 대한 예입니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример последствий, если вы пропустите указание зависимостей для </font></font> <code>libb.so</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您错过为</font> <code>libb.so</code> <font style="vertical-align: inherit;">指定依赖项，这是一个示例。</font></font><font style="vertical-align: inherit;"></font>

source: Here's an example to make it clear how things work with GCC when <strong>static</strong> libraries are involved. So let's assume we have the following scenario:
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ライブラリが関係する</font><font style="vertical-align: inherit;">場合にGCCでどのように機能するかを明確にする例を次に示し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">それでは、次のシナリオがあるとします。</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라이브러리가 관련된 </font><font style="vertical-align: inherit;">경우 GCC와 함께 작동하는 방식을 명확하게 보여주는 예는 다음과 같습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">다음 시나리오가 있다고 가정 해 봅시다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот пример, чтобы прояснить, как работают GCC, когда </font><font style="vertical-align: inherit;">задействованы </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">статические</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> библиотеки. </font><font style="vertical-align: inherit;">Итак, давайте предположим, что у нас есть следующий сценарий:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是一个示例，用于阐明</font><font style="vertical-align: inherit;">涉及</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静态</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">库</font><font style="vertical-align: inherit;">时GCC的工作方式</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，假设我们有以下情形：</font></font>

source: How do we link this? (Note: examples from compiling on Cygwin using gcc 4.3.4)
ja: これをどうやってリンクするのか?(注:gcc 4.3.4を使ってCygwinでコンパイルした例)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 어떻게 연결합니까? </font><font style="vertical-align: inherit;">(참고 : gcc 4.3.4를 사용하여 Cygwin에서 컴파일 한 예)</font></font>
ru: Как нам связать это? (Примечание:примеры из компиляции на Cygwin с использованием gcc 4.3.4)
zh_cn: 我们该如何链接?(注:使用gcc 4.3.4在Cygwin上编译的例子)

source: I have seen this a lot, some of our modules link in excess of a 100 libraries of our code plus system &amp; 3rd party libs.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はこれをたくさん見ました、私たちのモジュールのいくつかは私たちのコードの100のライブラリに加えてシステムとサードパーティのライブラリをリンクしています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 이것을 많이 보았습니다. 우리 모듈 중 일부는 코드와 시스템 및 타사 라이브러리의 100 라이브러리를 초과하여 연결됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я видел это много, некоторые из наших модулей связывают более 100 библиотек нашего кода плюс системные и сторонние библиотеки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我已经看到很多了，我们的某些模块链接了超过100个我们的代码库以及系统库和第三方库。</font></font>

source: If a static library depends on another library, but the other library again depends on the former library, there is a cycle. You can resolve this by enclosing the cyclically dependent libraries by <code>-(</code> and <code>-)</code>, such as <code>-( -la -lb -)</code> (you may need to escape the parens, such as <code>-\(</code> and <code>-\)</code>). The linker then searches those enclosed lib multiple times to ensure cycling dependencies are resolved. Alternatively, you can specify the libraries multiple times, so each is before one another: <code>-la -lb -la</code>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">静的ライブラリが別のライブラリに依存しているが、他のライブラリも以前のライブラリに依存している場合、サイクルがあります。</font><font style="vertical-align: inherit;">これを解決するには、</font></font> <code>-(</code> <font style="vertical-align: inherit;"></font> <code>-)</code> <font style="vertical-align: inherit;"></font> <code>-( -la -lb -)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などの</font><font style="vertical-align: inherit;">-（</font><font style="vertical-align: inherit;">および</font><font style="vertical-align: inherit;">-）</font><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">循環依存ライブラリを囲み</font><font style="vertical-align: inherit;">ます</font></font> <code>-\(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および</font></font> <code>-\)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などの括弧をエスケープする必要がある場合があります</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">次に、リンカはこれらの囲まれたlibを複数回検索して、循環依存関係が解決されるようにします。</font><font style="vertical-align: inherit;">または、ライブラリを複数回指定して、ライブラリを互いに</font></font> <code>-la -lb -la</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">せることもできます：</font><font style="vertical-align: inherit;">-la -lb -la</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 라이브러리가 다른 라이브러리에 의존하지만 다른 라이브러리가 다시 이전 라이브러리에 의존하는 경우주기가 있습니다. </font></font> <code>-(</code> <font style="vertical-align: inherit;"></font> <code>-)</code> <font style="vertical-align: inherit;"></font> <code>-( -la -lb -)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같이 </font><font style="vertical-align: inherit;">-(</font><font style="vertical-align: inherit;"> 및 </font><font style="vertical-align: inherit;">-)로</font><font style="vertical-align: inherit;"> 순환 종속 라이브러리를 묶으면이를 해결할 수 있습니다 </font><font style="vertical-align: inherit;">( </font></font> <code>-\(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>-\)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 같이 파 렌스를 이스케이프해야 할 수도 있습니다 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">그런 다음 링커는 동봉 된 lib를 여러 번 검색하여 순환 종속성이 해결되도록합니다. </font><font style="vertical-align: inherit;">또는 라이브러리를 여러 번 지정할 수 있으므로 각각이 서로 앞에 있습니다 : </font></font> <code>-la -lb -la</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если статическая библиотека зависит от другой библиотеки, но другая библиотека снова зависит от предыдущей библиотеки, существует цикл. </font><font style="vertical-align: inherit;">Вы можете решить эту проблему, заключив циклически зависимые библиотеки в </font> <code>-( -la -lb -)</code> <font style="vertical-align: inherit;"> ( </font></font> <code>-(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>-)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , такие как </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">- (-la -lb -)</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (вам может понадобиться экранировать символы, такие как </font></font> <code>-\(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>-\)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Затем компоновщик просматривает эти вложенные библиотеки несколько раз, чтобы убедиться, что циклические зависимости разрешены. </font><font style="vertical-align: inherit;">В качестве альтернативы, вы можете указывать библиотеки несколько раз, так что каждая из них находится друг перед другом: </font></font> <code>-la -lb -la</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果静态库依赖于另一个库，但是另一个库又依赖于先前的库，则存在一个循环。</font><font style="vertical-align: inherit;">您可以通过用</font></font> <code>-(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>-)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包围循环依赖的库来解决此问题</font><font style="vertical-align: inherit;">，例如</font></font> <code>-( -la -lb -)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（您可能需要转义括号，例如</font></font> <code>-\(</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>-\)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">链接器然后多次搜索那些包含的lib，以确保解决循环依赖性。</font><font style="vertical-align: inherit;">另外，您可以指定多个库，因此每个库都位于另一个库之前：</font></font> <code>-la -lb -la</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: If you add <code>-Wl,--start-group</code> to the linker flags it does not care which order they're in or if there are circular dependencies.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リンカーフラグに</font></font> <code>-Wl,--start-group</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">追加した場合</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">それらがどの順序にある​​か、または循環依存関係があるかどうかは関係ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링커 플래그 </font><font style="vertical-align: inherit;">에 </font></font> <code>-Wl,--start-group</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">추가하면 </font><font style="vertical-align: inherit;">순서에 관계없이 또는 순환 종속성이 있는지 상관하지 않습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы добавляете </font></font> <code>-Wl,--start-group</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к флагам компоновщика, то все равно, в каком порядке они находятся, или существуют циклические зависимости.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font><font style="vertical-align: inherit;">在链接器标志中</font><font style="vertical-align: inherit;">添加</font></font> <code>-Wl,--start-group</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，则不在乎它们的顺序或是否存在循环依赖项。</font></font>
