Repository: rueisnom/feedback
Catalog: xlf/45/13/5/45135.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: If you now look into what dependencies the binary has, you note the binary itself depends also on <code>libd</code>, not just <code>libb</code> as it should. The binary will need to be relinked if <code>libb</code> later depends on another library, if you do it this way. And if someone else loads <code>libb</code> using <code>dlopen</code> at runtime (think of loading plugins dynamically), the call will fail as well. So the <code>"right"</code> really should be a <code>wrong</code> as well.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたは今のバイナリが持つ依存には何があるかを調べる場合は、バイナリ自体が上にも依存することに注意してください</font></font> <code>libd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">だけではなく、</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それが必要として。</font><font style="vertical-align: inherit;">この方法で行う場合、後で</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が別のライブラリに依存する</font><font style="vertical-align: inherit;">場合、バイナリを再リンクする必要があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">そして、誰かが</font><font style="vertical-align: inherit;">実行時に</font> <code>dlopen</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">ロードする場合</font><font style="vertical-align: inherit;">（プラグインを動的にロードすることを考えると）、呼び出しも失敗します。</font><font style="vertical-align: inherit;">したがって、</font> <code>"right"</code> <font style="vertical-align: inherit;">本当に</font> <code>wrong</code> <font style="vertical-align: inherit;">ている</font><font style="vertical-align: inherit;">はず</font><font style="vertical-align: inherit;">です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바이너리에 어떤 의존성이 있는지 살펴보면 바이너리 자체는 </font></font> <code>libd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 뿐만 아니라 </font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에만 </font><font style="vertical-align: inherit;">의존</font><font style="vertical-align: inherit;"> 한다는 것을 알 수 있습니다. </font><font style="vertical-align: inherit;">이 방법으로 </font></font> <code>libb</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 나중에 다른 라이브러리에 의존하는 </font><font style="vertical-align: inherit;">경우 바이너리를 다시 연결해야합니다 </font><font style="vertical-align: inherit;">. 그리고 누군가 </font><font style="vertical-align: inherit;">가 런타임에 </font> <code>dlopen</code> <font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용하여 </font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">로드하면 </font><font style="vertical-align: inherit;">(플러그인을 동적으로로드한다고 생각하면) 호출도 실패합니다. 따라서 </font> <code>"right"</code> <font style="vertical-align: inherit;"> 실제로 </font> <code>wrong</code> <font style="vertical-align: inherit;"> 되어야합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы теперь посмотрите на зависимости, которые есть у двоичного </font></font> <code>libd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font><font style="vertical-align: inherit;">вы заметите, что сам двоичный файл зависит также от </font><font style="vertical-align: inherit;">libd</font><font style="vertical-align: inherit;"> , а не только от </font></font> <code>libb</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как и должно быть. </font><font style="vertical-align: inherit;">Бинарный файл нужно будет перекомпоновать, если </font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> позже будет зависеть от другой библиотеки, если вы сделаете это таким образом. </font><font style="vertical-align: inherit;">И если кто - </font><font style="vertical-align: inherit;">то загружает </font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с использованием </font></font> <code>dlopen</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> во время выполнения (думаю загрузки плагинов динамически), то вызов будет не в состоянии, </font><font style="vertical-align: inherit;">а также. </font><font style="vertical-align: inherit;">Так что </font></font> <code>"right"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> действительно должно быть и </font></font> <code>wrong</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果现在查看二进制文件具有哪些依赖性，您会注意到二进制文件本身也取决于</font></font> <code>libd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而不仅</font><font style="vertical-align: inherit;">取决于</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以后依赖另一个库，则</font><font style="vertical-align: inherit;">需要重新链接该二进制文件</font><font style="vertical-align: inherit;">（如果您这样做）。</font><font style="vertical-align: inherit;">而且，如果其他人</font><font style="vertical-align: inherit;">在运行时</font><font style="vertical-align: inherit;">使用</font> <code>dlopen</code> <font style="vertical-align: inherit;">加载了</font></font> <code>libb</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（考虑动态加载插件），则调用也会失败。</font><font style="vertical-align: inherit;">因此，</font> <code>"right"</code> <font style="vertical-align: inherit;">确实也应该是</font> <code>wrong</code> <font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: It is not correct to omit the dependency of <code>b.so</code> against <code>d.so</code> when creating the former. You will be required to specify the library when linking <code>a</code> then, but <code>a</code> doesn't really need the integer <code>b</code> itself, so it should not be made to care about <code>b</code>'s own dependencies.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">前者を作成するときに</font><font style="vertical-align: inherit;">、</font></font> <code>b.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に対する</font></font> <code>d.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">依存関係を省略することは正しくありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">あなたは、リンク時にライブラリを指定する必要があります</font><font style="vertical-align: inherit;">、その後、しかし、</font><font style="vertical-align: inherit;">実際には整数を必要としない</font> <code>b</code> は<font style="vertical-align: inherit;">気になされるべきではないので、自分自身</font> <code>b</code> <font style="vertical-align: inherit;">自身の依存関係s「を。</font></font> <code>a</code> <font style="vertical-align: inherit;"></font> <code>a</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전자를 생성 할 때 </font></font> <code>b.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 </font></font> <code>d.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 종속성을 생략하는 것은 올바르지 않습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">당신은 링크 할 때 라이브러리를 지정해야합니다 </font><font style="vertical-align: inherit;">다음,하지만 </font> <code>a</code> 는<font style="vertical-align: inherit;"> 정말 정수를 필요로하지 않는다 </font> <code>b</code> 를<font style="vertical-align: inherit;"> 가 걱정하게해서는 안된다, 그래서 그 자체 </font> <code>b</code> <font style="vertical-align: inherit;"> 자신의 의존성 S '이 (가) 있습니다.</font></font> <code>a</code> <font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"></font> <code>b.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> опускать зависимость </font><font style="vertical-align: inherit;">b.so</font><font style="vertical-align: inherit;"> от </font></font> <code>d.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> при создании первого. </font><font style="vertical-align: inherit;">Вы должны будете указать библиотеку при связывании </font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> затем, но </font></font> <code>a</code> на<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> самом деле не нужно само целое число </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому не следует заботиться о </font><font style="vertical-align: inherit;">собственных зависимостях </font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">创建前者时</font><font style="vertical-align: inherit;">，忽略</font></font> <code>b.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对</font></font> <code>d.so</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的依赖关系是不正确</font><font style="vertical-align: inherit;">的。</font><font style="vertical-align: inherit;">链接</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时，将要求您指定库</font><font style="vertical-align: inherit;">，但是</font></font> <code>a</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并不需要整数</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">本身，因此不应考虑</font></font> <code>b</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自身的依赖性。</font></font>

source: It's the same here - the libraries must follow the object files of the program. The difference here compared with static libraries is that you need not care about the dependencies of the libraries against each other, because <em>dynamic libraries sort out their dependencies themselves</em>.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでも同じです。ライブラリはプログラムのオブジェクトファイルに従う必要があります。</font><font style="vertical-align: inherit;">静的ライブラリとの違いは、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">動的ライブラリは依存関係を自分で整理する</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ため、ライブラリの相互依存関係を気にする必要がないことです</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에서도 동일합니다. 라이브러리는 프로그램의 오브젝트 파일을 따라야합니다. </font><font style="vertical-align: inherit;">정적 라이브러리와 비교했을 때의 차이점은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동적 라이브러리가 종속성을 스스로 정렬</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하기 때문에 라이브러리의 종속성에 대해 신경 쓰지 않아도된다는 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь то же самое - библиотеки должны следовать объектным файлам программы. </font><font style="vertical-align: inherit;">Разница здесь по сравнению со статическими библиотеками заключается в том, что вам не нужно заботиться о зависимости библиотек друг от друга, потому что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">динамические библиотеки сами разбирают свои зависимости</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里是相同的-库必须遵循程序的目标文件。</font><font style="vertical-align: inherit;">与静态库相比，这里的区别在于您不必在意彼此之间的依赖关系，因为</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">动态库会自己整理其依赖关系</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Link order certainly does matter, at least on some platforms. I have seen crashes for applications linked with libraries in wrong order (where wrong means A linked before B but B depends on A).
ja: 少なくともいくつかのプラットフォームでは、リンクの順番は確かに重要です。私は、間違った順番でライブラリをリンクしたアプリケーションがクラッシュするのを見たことがあります(間違った順番とは、AはBよりも前にリンクしているが、BはAに依存しているという意味です)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링크 순서는 적어도 일부 플랫폼에서 중요합니다. </font><font style="vertical-align: inherit;">라이브러리와 연결된 응용 프로그램이 잘못된 순서로 충돌하는 것을 보았습니다.</font></font>
ru: Порядок соединения,безусловно,имеет значение,по крайней мере,на некоторых платформах.Я видел падения для приложений,связанных с библиотеками в неправильном порядке (где неправильное означает A,связанное до B,но B зависит от A).
zh_cn: 链接顺序当然很重要,至少在某些平台上是这样。我见过以错误的顺序链接库的应用程序崩溃(错误的意思是A链接在B之前,但B取决于A)。

source: Linking to dynamic libraries
ja: ダイナミックライブラリへのリンク
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동적 라이브러리에 연결</font></font>
ru: Связь с динамическими библиотеками
zh_cn: 链接到动态库

source: Linking to static libraries
ja: 静的ライブラリへのリンク
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정적 라이브러리에 연결</font></font>
ru: Связь со статическими библиотеками
zh_cn: 链接到静态库

source: My old lecturer used to say, "<em>high cohesion &amp; low coupling</em>", it&rsquo;s still true today.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の昔の講師は、「</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">凝集度が高くカップリングが低い</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」と言っていましたが、</font><font style="vertical-align: inherit;">今日でもそうです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예전 강사는 " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">높은 응집력과 낮은 커플 링</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " </font><font style="vertical-align: inherit;">이라고 말 </font><font style="vertical-align: inherit;">했지만 오늘날에도 마찬가지입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мой старый лектор говорил: &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">высокая сплоченность и низкая связь</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;, это все еще верно сегодня.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的老讲师曾经说过&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高凝聚力和低耦合</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;，今天仍然如此。</font></font>

source: On Qt this means adding:
ja: Qtでは、これは追加することを意味します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Qt에서 이것은 다음을 추가하는 것을 의미합니다.</font></font>
ru: На Qt это означает добавление:
zh_cn: 在Qt上,这意味着添加。

source: Once you hit upon a solution document it so the next developer does not have to work it out again.
ja: 一度解決策を見つけたら、次の開発者が再びそれを解決する必要がないように文書化します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">솔루션 문서에 부딪 치면 다음 개발자가 다시 해결하지 않아도됩니다.</font></font>
ru: Как только вы наткнулись на документ с решением,следующему разработчику больше не придется его отрабатывать.
zh_cn: 一旦你击中了一个解决方案的文档,那么下一个开发者就不需要再去解决它了。

source: Saves loads of time messing about and it doesn't seem to slow down linking much (which takes far less time than compilation anyway).
ja: これを使えば、いじくりまわす時間を節約できますし、リンクの速度が遅くなることもありません(コンパイルよりもはるかに短い時間で済みます)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 시간을 낭비하고 링크 속도를 늦추지 않는 것 같습니다 (어쨌든 컴파일보다 시간이 덜 걸립니다).</font></font>
ru: Экономит кучу путаницы во времени и,похоже,не сильно замедляет линковку (что в любом случае занимает намного меньше времени,чем компиляция).
zh_cn: 节约了大量的时间,而且它似乎并没有减慢链接的速度(反正比编译时间要短得多)。

source: Some recent distributions apparently default to using the <code>--as-needed</code> linker flag, which enforces that the program's object files come before the dynamic libraries. If that flag is passed, the linker will not link to libraries that are not actually needed by the executable (and it detects this from left to right). My recent archlinux distribution doesn't use this flag by default, so it didn't give an error for not following the correct order.
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最近の一部のディストリビューションでは、デフォルトで</font></font> <code>--as-needed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リンカーフラグ</font><font style="vertical-align: inherit;">を使用するように設定されています</font><font style="vertical-align: inherit;">。これにより、プログラムのオブジェクトファイルが動的ライブラリの前に配置されます。</font><font style="vertical-align: inherit;">そのフラグが渡された場合、リンカは実行可能ファイルで実際には必要とされないライブラリにリンクしません（これは左から右に検出されます）。</font><font style="vertical-align: inherit;">私の最近のarchlinuxディストリビューションはデフォルトでこのフラグを使用しないため、正しい順序に従わないことによるエラーは発生しませんでした。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최근 일부 배포판은 기본적으로 </font></font> <code>--as-needed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 링커 플래그 </font><font style="vertical-align: inherit;">를 사용 </font><font style="vertical-align: inherit;">하여 프로그램의 객체 파일이 동적 라이브러리보다 우선하도록합니다. </font><font style="vertical-align: inherit;">해당 플래그가 전달되면 링커는 실제로 실행 파일에 필요하지 않은 라이브러리에 링크하지 않습니다 (왼쪽에서 오른쪽으로 감지). </font><font style="vertical-align: inherit;">최근의 아치 리눅스 배포판은 기본적 으로이 플래그를 사용하지 않으므로 올바른 순서를 따르지 않아도 오류가 발생하지 않았습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Некоторые недавние дистрибутивы, по-видимому, по умолчанию используют </font><font style="vertical-align: inherit;">флаг компоновщика </font></font> <code>--as-needed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который предписывает, чтобы объектные файлы программы предшествовали динамическим библиотекам. </font><font style="vertical-align: inherit;">Если этот флаг передан, компоновщик не будет ссылаться на библиотеки, которые на самом деле не нужны исполняемому файлу (и он обнаруживает это слева направо). </font><font style="vertical-align: inherit;">Мой недавний дистрибутив archlinux по умолчанию не использует этот флаг, поэтому он не выдает ошибку за несоблюдение правильного порядка.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">某些最新发行版显然默认使用</font></font> <code>--as-needed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">链接程序标志，该标志强制程序的目标文件位于动态库之前。</font><font style="vertical-align: inherit;">如果传递了该标志，则链接器将不会链接到可执行文件实际上并不需要的库（并且从左到右检测到它）。</font><font style="vertical-align: inherit;">我最近的archlinux发行版默认情况下不使用此标志，因此它没有给出未遵循正确顺序的错误。</font></font>

source: The GNU ld linker is a so-called smart linker. It will keep track of the functions used by preceding static libraries, permanently tossing out those functions that are not used from its lookup tables. The result is that if you link a static library too early, then the functions in that library are no longer available to static libraries later on the link line.
ja: GNU ldリンカはいわゆるスマートリンカです。これは、先行するスタティック・ライブラリで使われている関数を追跡し、使われていない関数をルックアップ・テーブルから永久に捨てます。その結果、スタティック・ライブラリをリンクするのが早すぎると、そのライブラリの関数はリンク先のスタティック・ライブラリでは利用できなくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GNU ld 링커는 소위 스마트 링커입니다. </font><font style="vertical-align: inherit;">이전 정적 라이브러리에서 사용되는 함수를 추적하여 조회 테이블에서 사용되지 않은 함수를 영구적으로 버립니다. </font><font style="vertical-align: inherit;">결과적으로 정적 라이브러리를 너무 일찍 링크하면 나중에 해당 라이브러리의 함수를 더 이상 링크 라인의 정적 라이브러리에서 사용할 수 없게됩니다.</font></font>
ru: Линкер GNU ld-это так называемый умный линкер.Он будет отслеживать функции,используемые предыдущими статическими библиотеками,навсегда выкидывая из своих таблиц поиска те функции,которые не используются.В результате,если вы компонуете статическую библиотеку слишком рано,то функции в этой библиотеке больше не будут доступны для статических библиотек позже в строке компоновки.
zh_cn: GNU ld linker 是一个所谓的智能链接器。它将跟踪前面的静态库所使用的函数,并将那些没有被使用的函数从它的查找表中永久地扔掉。这样做的结果是,如果你过早地链接了一个静态库,那么这个库中的函数在后面的静态库中就无法使用了。

source: The linker searches from left to right, and notes unresolved symbols as it go. If a library resolves the symbol, it takes the object files of that library to resolve the symbol (b.o out of libb.a in this case).
ja: リンカは左から右へと検索し、未解決のシンボルをメモしていきます。ライブラリがシンボルを解決した場合、そのライブラリのオブジェクトファイルを使ってシンボルを解決します (この場合は libb.a から b.o を取り出します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">링커는 왼쪽에서 오른쪽으로 검색하고 확인할 수없는 기호를 메모합니다. </font><font style="vertical-align: inherit;">라이브러리가 심볼을 해석하면 해당 라이브러리의 오브젝트 파일을 사용하여 심볼을 해석합니다 (이 경우 libb.a에서 모두).</font></font>
ru: Линкер ищет слева направо и отмечает неразрешенные символы в процессе работы.Если библиотека разрешает символ,она берет объектные файлы этой библиотеки для разрешения символа (в данном случае b.o из libb.a).
zh_cn: 链接器会从左到右搜索,并将未解决的符号记录下来。如果一个库解析了这个符号,它就会取该库的对象文件来解析这个符号(本例中的b.o出libb.a)。
