Repository: rueisnom/feedback
Catalog: xlf/45/13/5/45135.*.001.xlf
Languages: ja, ko, ru, zh_cn

source: The order within a group is important ! Here's an example: a debug library has a debug routine, but the non-debug library has a weak version of the same. You must put the debug library FIRST in the group or you will resolve to the non-debug version.
ja: グループ内での順番は重要です 例えば、デバッグライブラリにはデバッグルーチンがありますが、非デバッグライブラリには同じものの弱いバージョンがあります。デバッグライブラリをグループの中で最初に置かなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그룹 내 순서는 중요합니다! </font><font style="vertical-align: inherit;">예를 들면 다음과 같습니다. 디버그 라이브러리에는 디버그 루틴이 있지만 디버그가 아닌 라이브러리의 버전은 동일합니다. </font><font style="vertical-align: inherit;">디버그 라이브러리 FIRST를 그룹에 배치해야합니다. 그렇지 않으면 디버그 버전이 아닌 버전으로 해결됩니다.</font></font>
ru: Порядок внутри группы важен ! Вот пример:отладочная библиотека имеет отладочную рутину,а не отладочная-слабую версию.Вы должны поместить отладочную библиотеку ПЕРВЫМ в группу,иначе вы решите,что это не отладочная версия.
zh_cn: 组内的顺序很重要! 这里有一个例子:一个调试库有一个调试例程,但是非调试库有一个弱的版本。你必须把调试库放在组中的第一个,否则你将解析到非调试版本。

source: The typical UNIX linker works from left to right, so put all your dependent libraries on the left, and the ones that satisfy those dependencies on the right of the link line. You may find that some libraries depend on others while at the same time other libraries depend on them. This is where it gets complicated. When it comes to circular references, fix your code!
ja: 典型的な UNIX リンカは左から右へと動作しますので、依存するライブラリをすべて左に置き、それらの依存関係を満たすライブラリをリンクラインの右に置きます。いくつかのライブラリが他のライブラリに依存していると同時に、他のライブラリが他のライブラリに依存していることに気づくかもしれません。ここがややこしくなるところです。循環参照に関しては、あなたのコードを修正してください!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 UNIX 링커는 왼쪽에서 오른쪽으로 작동하므로 모든 종속 라이브러리를 왼쪽에 놓고 해당 종속성을 만족하는 라이브러리를 링크 행의 오른쪽에 두십시오. </font><font style="vertical-align: inherit;">일부 라이브러리는 다른 라이브러리에 의존하고 다른 라이브러리는 다른 라이브러리에 의존한다는 것을 알 수 있습니다. </font><font style="vertical-align: inherit;">여기가 복잡해집니다. </font><font style="vertical-align: inherit;">순환 참조와 관련하여 코드를 수정하십시오!</font></font>
ru: Типичный компоновщик UNIX работает слева направо,поэтому все ваши зависимые библиотеки располагаются слева,а те,которые удовлетворяют этим зависимостям,-справа от строки компоновки.Вы можете обнаружить,что некоторые библиотеки зависят от других,в то время как другие библиотеки зависят от них.Здесь все усложняется.Когда дело доходит до круговых ссылок,исправьте свой код!
zh_cn: 典型的UNIX链接器是从左到右工作的,所以把所有依赖的库放在左边,满足这些依赖的库放在链接行的右边。你可能会发现,有些库依赖其他库,同时其他库也依赖它们。这时候就会变得复杂起来。当涉及到循环引用的时候,请修正你的代码!

source: Why does the order in which libraries are linked sometimes cause errors in GCC
ja: GCCでライブラリをリンクする順番がエラーになることがあるのはなぜですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GCC에서 라이브러리가 연결된 순서에 따라 때때로 오류가 발생하는 이유</font></font>
ru: Почему порядок компоновки библиотек иногда приводит к ошибкам в GCC
zh_cn: 为什么在GCC中链接库的顺序有时会出现错误?

source: Why does the order in which libraries are linked sometimes cause errors in GCC?
ja: GCCでは、ライブラリをリンクした順番でエラーが発生することがあるのはなぜですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GCC에서 라이브러리가 연결된 순서에 따라 오류가 발생하는 이유는 무엇입니까?</font></font>
ru: Почему порядок компоновки библиотек иногда приводит к ошибкам в GCC?
zh_cn: 为什么库的链接顺序有时会在GCC中出现错误?

source: You may can use -Xlinker option.
ja: Xlinkerオプションを使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">-Xlinker 옵션을 사용할 수 있습니다.</font></font>
ru: Вы можете использовать опцию -Xlinker.
zh_cn: 你可以使用-Xlinker选项。

source: You need to precede each library in the group list with -Xlinker
ja: グループリストの各ライブラリの前に -Xlinker を付ける必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그룹 목록의 각 라이브러리 앞에 -Xlinker가 있어야합니다.</font></font>
ru: Каждой библиотеке в списке групп необходимо предшествовать -Xlinker.
zh_cn: 你需要在组列表中的每个库前面加上 -Xlinker

source: You need to write them as "-Wl,--start-group" etc. to tell GCC to pass the argument through to the linker.
ja: 引数をリンカに渡すためには、"-Wl,--start-group "などと書く必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GCC에 인수를 링커에 전달하도록 지시하려면 "-Wl,-start-group"등으로 작성해야합니다.</font></font>
ru: Нужно написать их как "-Wl,--start-group" и т.д.,чтобы сказать GCC,чтобы он передал аргумент компоновщику.
zh_cn: 你需要把它们写成"-Wl,-start-group "等来告诉GCC将参数传递给链接器。

source: is ALMOST equal to
ja: にほぼ等しい
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ALMOST는</font></font>
ru: АЛМОСТ равен
zh_cn: 几乎等于
