Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In inheritance, subclass can directly invoke base class method even though it's not implementing base class method because of <strong><em>IS A</em></strong> relation. If you use composition, you have to add methods in container class to expose contained class API
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En herencia, la subclase puede invocar directamente el m&eacute;todo de la clase base aunque no est&eacute; implementando el m&eacute;todo de la clase base debido a la </font><font style="vertical-align: inherit;">relaci&oacute;n </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A. </font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si usa composici&oacute;n, debe agregar m&eacute;todos en la clase contenedor para exponer la clase contenida API</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承では、</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係の</font><font style="vertical-align: inherit;">ために基本クラスメソッドを実装していない場合でも、サブクラスは基本クラスメソッドを直接呼び出すことができ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">コンポジションを使用する場合、コンテナクラスにメソッドを追加して、含まれているクラスAPIを公開する必要があります</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속에서 하위 클래스는 </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 관계로 </font><font style="vertical-align: inherit;">인해 기본 클래스 메서드를 구현하지 않더라도 기본 클래스 메서드를 직접 호출 할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">컴포지션을 사용하는 경우 컨테이너 클래스에 메소드를 추가하여 포함 된 클래스 API를 노출해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В наследовании подкласс может напрямую вызывать метод базового класса, даже если он не реализует метод базового класса из-за </font><font style="vertical-align: inherit;">отношения </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A. </font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете композицию, вы должны добавить методы в контейнерный класс, чтобы предоставить доступ к API класса.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在继承中，子类可以直接调用基类方法，即使由于</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关系</font><font style="vertical-align: inherit;">而没有实现基类方法</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果使用组合，则必须在容器类中添加方法以公开包含的类API</font></font>

source: In the end, we tie our code in some difficult knots and get no benefit whatsoever from it except that we get to say, "Cool, I learned about inheritance and now I used it." That's not meant to be condescending because we've all done it. But we all did it because no one told us not to.
es: Al final,atamos nuestro código en algunos nudos difíciles y no obtenemos ningún beneficio en absoluto de él,excepto que podemos decir,"Genial,aprendí sobre la herencia y ahora la uso".Eso no significa ser condescendiente porque todos lo hemos hecho.Pero todos lo hicimos porque nadie nos dijo que no lo hiciéramos.
ja: 結局、私たちはコードを難しい結び目に縛り付けてしまい、そこから何の利益も得られないままになってしまいます。これは見下しているわけではありません。しかし、誰もがやるなと言わなかったからこそ、みんなやったのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">결국, 우리는 코드를 어려운 매듭으로 묶고 "쿨, 나는 상속에 대해 배웠고 이제는 그것을 사용했다"는 말을 제외하고는 그로부터 이익을 얻지 못합니다. </font><font style="vertical-align: inherit;">우리 모두가 해냈 기 때문에 그것은 하찮은 것이 아닙니다. </font><font style="vertical-align: inherit;">그러나 아무도 우리에게하지 말라고했기 때문에 우리 모두는 그렇게했습니다.</font></font>
ru: В конце концов,мы завязываем наш код в какие-то сложные узлы и не получаем от этого никакой выгоды,кроме того,что можем сказать:"Круто,я узнал о наследовании и теперь использовал его".Это не должно быть снисходительным,потому что мы все это сделали.Но мы все делали это,потому что никто не говорил нам не делать этого.
zh_cn: 到最后,我们把自己的代码打上了一些难解的结,除了可以说 "酷,我学会了继承,现在我用上了 "之外,并没有得到任何好处。这不是居高临下的意思,因为我们都做过。但我们都做过,因为没有人告诉我们不要做。

source: Inheritance creates a strong relationship between a subclass and super class; subclass must be aware of super class'es implementation details. Creating the super class is much harder, when you have to think about how it can be extended. You have to document class invariants carefully, and state what other methods overridable methods use internally.
es: La herencia crea una fuerte relación entre una subclase y una superclase;la subclase debe estar al tanto de los detalles de implementación de la superclase.La creación de la superclase es mucho más difícil,cuando tienes que pensar en cómo se puede extender.Tienes que documentar las invariantes de clase cuidadosamente,y declarar qué otros métodos de superclase usan internamente.
ja: 継承はサブクラスとスーパークラスの間に強い関係を作り、サブクラスはスーパークラスの実装の詳細を知らなければなりません。サブクラスはスーパークラスの実装の詳細を認識していなければなりません。クラスの不変性を慎重に文書化し、他のオーバーライド可能なメソッドが内部的にどのようなものを使用しているかを明記しなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 서브 클래스와 수퍼 클래스 사이에 강한 관계를 만듭니다. </font><font style="vertical-align: inherit;">서브 클래스는 수퍼 클래스의 구현 세부 사항을 알고 있어야합니다. </font><font style="vertical-align: inherit;">어떻게 수퍼 클래스를 만들 수 있는지 생각해야 할 때 슈퍼 클래스를 만드는 것이 훨씬 어렵습니다. </font><font style="vertical-align: inherit;">클래스 불변량을주의 깊게 문서화하고 재정의 가능한 다른 메소드가 내부적으로 사용하는 것을 명시해야합니다.</font></font>
ru: Наследование создает сильную связь между подклассом и суперклассом;подкласс должен знать детали реализации суперкласса.Создание супер-класса намного сложнее,когда нужно подумать о том,как его можно расширить.Вы должны внимательно документировать инварианты класса и указать,какие другие методы,которые можно переопределить,используют внутри класса.
zh_cn: 继承在子类和超级类之间建立了一个强大的关系,子类必须知道超级类的实现细节。创建超级类就难多了,这时你必须考虑如何扩展超级类。你必须仔细记录类的 invariants,并说明其他可覆盖的方法在内部使用什么方法。

source: Inheritance exposes <em>protected</em> members. This breaks encapsulation of the parent class, and if used by subclass, another dependency between the child and its parent is introduced.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La herencia expone a </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">los</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> miembros </font><em><font style="vertical-align: inherit;">protegidos</font></em><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esto interrumpe la encapsulaci&oacute;n de la clase padre y, si se usa en una subclase, se introduce otra dependencia entre el ni&ntilde;o y su padre.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">保護された</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メンバーを</font><font style="vertical-align: inherit;">公開し</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これにより、親クラスのカプセル化が解除され、サブクラスで使用された場合、子とその親の間に別の依存関係が導入されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보호 된</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구성원을 </font><font style="vertical-align: inherit;">노출시킵니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이로 인해 부모 클래스의 캡슐화가 중단되고 하위 클래스에서 사용하는 경우 자식과 부모 간의 다른 종속성이 도입됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наследование подвергает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">защищенных</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> членов. </font><font style="vertical-align: inherit;">Это нарушает инкапсуляцию родительского класса, и, если используется подклассом, вводится другая зависимость между дочерним и его родительским классом.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承公开</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">受保护的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">成员。</font><font style="vertical-align: inherit;">这破坏了父类的封装，并且如果由子类使用，则会在子代及其父代之间引入另一个依赖关系。</font></font>

source: Inheritance exposes a subclass to details of its parent class implementation, that's why it's often said that inheritance breaks encapsulation (in a sense that you really need to focus on interfaces only not implementation, so reusing by sub classing is not always preferred).
es: La herencia expone a una subclase a los detalles de su implementación de la clase madre,por eso se suele decir que la herencia rompe el encapsulamiento (en el sentido de que hay que centrarse sólo en las interfaces y no en la implementación,por lo que no siempre se prefiere la reutilización mediante la subclasificación).
ja: 継承はサブクラスが親クラスの実装の詳細を知ることができるので、よくカプセル化を破ると言われています(実装ではなくインターフェースだけに注目するという意味では、サブクラスによる再利用が必ずしも好ましいとは言えません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 서브 클래스를 부모 클래스 구현의 세부 사항에 노출 시키므로 상속이 캡슐화를 깨뜨리는 경우가 종종 있습니다 (구현이 아닌 인터페이스에만 집중해야한다는 의미에서 서브 클래 싱으로 재사용하는 것이 항상 바람직하지는 않습니다).</font></font>
ru: Наследование подвергает подкласс подробностям реализации его родительского класса,поэтому часто говорят,что наследование нарушает инкапсуляцию (в том смысле,что вам действительно нужно сосредоточиться только на интерфейсах,а не на реализации,поэтому повторное использование подкласса не всегда предпочтительнее).
zh_cn: 继承将一个子类暴露在其父类实现的细节中,这就是为什么人们常说的继承打破了封装(从某种意义上说,你真正需要关注的只是接口而不是实现,所以通过子类化重用不一定是首选)。

source: Inheritance is a very powerfull machanism for code reuse. But needs to be used properly. I would say that inheritance is used correctly if the subclass is also a subtype of the parent class. As mentioned above, the Liskov Substitution Principle is the key point here.
es: La herencia es un maquinismo muy poderoso para la reutilización del código.Pero debe ser usado apropiadamente.Diría que la herencia se usa correctamente si la subclase es también un subtipo de la clase padre.Como se mencionó anteriormente,el Principio de Sustitución de Liskov es el punto clave aquí.
ja: 継承はコードを再利用するための非常に強力な手段である。しかし、正しく使う必要があります。私は、継承は、サブクラスが親クラスのサブタイプでもある場合に正しく使われると言っています。上述したように、ここではLiskov Substitution Principleがポイントになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 코드 재사용을위한 매우 강력한 메커니즘입니다. </font><font style="vertical-align: inherit;">그러나 올바르게 사용되어야합니다. </font><font style="vertical-align: inherit;">하위 클래스가 부모 클래스의 하위 유형 인 경우 상속이 올바르게 사용된다고 말하고 싶습니다. </font><font style="vertical-align: inherit;">위에서 언급했듯이 Liskov 대체 원칙이 핵심입니다.</font></font>
ru: Наследование-это очень мощный механизм повторного использования кода.Но его нужно использовать правильно.Я бы сказал,что наследование используется правильно,если подкласс также является подтипом родительского класса.Как упоминалось выше,ключевым моментом здесь является принцип подстановки Лискова.
zh_cn: 继承是一种非常强大的代码重用机制。但是需要正确的使用。我想说的是,如果子类也是父类的子类型,那么继承的使用是正确的。如上所述,Liskov替代原则是这里的关键点。

source: Inheritance is easily overused, though, and creates additional complexity, with hard dependencies between classes. Also understanding what happens during execution of a program gets pretty hard due to layers and dynamic selection of method calls.
es: Sin embargo,la herencia es fácilmente sobreutilizada y crea una complejidad adicional,con duras dependencias entre las clases.También entender lo que sucede durante la ejecución de un programa se hace bastante difícil debido a las capas y a la selección dinámica de las llamadas a los métodos.
ja: しかし、継承は簡単に乱用されてしまい、クラス間の依存関係が厳しくなり、さらに複雑さを増してしまいます。また、プログラムの実行中に何が起こるかを理解するのは、レイヤーやメソッド呼び出しの動的な選択のためにかなり難しくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 상속은 쉽게 과도하게 사용되며 클래스 사이의 어려운 종속성으로 인해 추가 복잡성이 발생합니다. </font><font style="vertical-align: inherit;">또한 프로그램 실행 중 발생하는 상황을 이해하는 것은 계층과 메소드 호출의 동적 선택으로 인해 매우 어려워집니다.</font></font>
ru: Наследование,однако,легко переусердствуется и создает дополнительные сложности,с жесткими зависимостями между классами.Также понимание того,что происходит во время выполнения программы,становится довольно сложным из-за наслоений и динамического выбора вызова методов.
zh_cn: 不过,继承很容易被过度使用,而且会产生额外的复杂性,类之间存在着硬性的依赖关系。同时,由于层和方法调用的动态选择,理解程序执行过程中发生的事情也变得相当困难。

source: Inheritance is often taught early when we learn object-oriented programming, so it's seen as an easy solution to a common problem.
es: La herencia se enseña a menudo temprano cuando aprendemos la programación orientada a objetos,por lo que se ve como una solución fácil a un problema común.
ja: 相続は、オブジェクト指向プログラミングを学ぶ際に早い段階で教えられることが多いので、よくある問題の簡単な解決策として見られています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 종종 객체 지향 프로그래밍을 배울 때 일찍 가르치므로 일반적인 문제에 대한 쉬운 해결책으로 간주됩니다.</font></font>
ru: Наследование часто преподается рано,когда мы учимся объектно-ориентированному программированию,поэтому оно рассматривается как простое решение общей проблемы.
zh_cn: 在我们学习面向对象编程的时候,往往会很早就教给我们继承,所以大家都把它看成是一个很容易解决的常见问题。

source: Inheritance is pretty enticing especially coming from procedural-land and it often looks deceptively elegant. I mean all I need to do is add this one bit of functionality to some other class, right? Well, one of the problems is that
es: La herencia es bastante tentadora,especialmente si viene de la tierra de los procedimientos y a menudo parece engañosamente elegante.Quiero decir que todo lo que necesito hacer es añadir esta funcionalidad a alguna otra clase,¿verdad? Bueno,uno de los problemas es que
ja: 継承は非常に魅力的で、特に手続き型の世界から来ると、見かけによらずエレガントに見えることがよくあります。つまり、必要なのは他のクラスにちょっとした機能を追加するだけですよね?さて、問題の一つは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 특히 절차 적 국가에서 오는 매우 유혹적이며 종종 기만적으로 우아해 보입니다. </font><font style="vertical-align: inherit;">내가해야 할 일은이 클래스의 기능을 다른 클래스에 추가하는 것입니다. </font><font style="vertical-align: inherit;">글쎄, 문제 중 하나는</font></font>
ru: Наследство довольно заманчиво,особенно происходящее из процедурных земель,и часто выглядит обманчиво элегантно.Я имею в виду,что все,что мне нужно сделать,это добавить этот бит функциональности в какой-нибудь другой класс,не так ли? Ну,одна из проблем в том,что
zh_cn: 继承是非常诱人的,尤其是来自于程序化领域的继承,而且它通常看起来很优雅。我的意思是,我只需要把这个功能添加到其他类中就可以了,对吧?好吧,问题之一是

source: Inheritance is really a cool feature, but I'm afraid it has been overused the last couple of years. People treated inheritance as the one hammer that can nail it all, regardless if it was actually a nail, a screw, or maybe a something completely different.
es: La herencia es realmente una característica genial,pero me temo que ha sido sobreutilizada en el último par de años.La gente trataba la herencia como el único martillo que puede clavarlo todo,sin importar si era realmente un clavo,un tornillo,o tal vez algo completamente diferente.
ja: 相続は本当にクールな機能なのですが、ここ数年は酷使されすぎていると思います。人々は継承を、それが実際には釘であっても、ネジであっても、あるいは全く別のものであっても、すべてを釘付けにできる唯一のハンマーのように扱っていました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 정말 멋진 기능이지만 지난 몇 년 동안 과도하게 사용 된 것 같습니다. </font><font style="vertical-align: inherit;">사람들은 상속이 실제로 못, 나사 또는 완전히 다른 무엇이든 관계없이 모든 것을 못 박는 망치로 취급했습니다.</font></font>
ru: Наследство-это действительно крутая особенность,но,боюсь,она была чрезмерно использована в последние пару лет.Люди относились к наследству как к единственному молотку,который может прибить все это,независимо от того,был ли это на самом деле гвоздь,винт,или,может быть,что-то совершенно другое.
zh_cn: 继承确实是一个很酷的功能,但恐怕在过去几年里,它已经被过度使用了。人们把继承视为一锤定音,不管实际上是钉子、螺丝钉,或许是完全不同的东西,都能把它当成是一锤定音。

source: Inheritance is sometimes useful, if the hierarchy really represents a is-a-relationship. It relates to Open-Closed Principle, which states that classes should be closed for modification but open to extension. That way you can have polymorphism; to have a generic method that deals with super type and its methods, but via dynamic dispatch the method of subclass is invoked. This is flexible, and helps to create indirection, which is essential in software (to know less about implementation details).
es: La herencia es a veces útil,si la jerarquía representa realmente una relación es-a-relación.Se relaciona con el Principio Abierto-Cerrado,que establece que las clases deben ser cerradas para su modificación pero abiertas a la extensión.Así se puede tener polimorfismo;tener un método genérico que se ocupe del supertipo y sus métodos,pero mediante el envío dinámico se invoca el método de la subclase.Esto es flexible,y ayuda a crear la indirección,que es esencial en el software (para saber menos sobre los detalles de implementación).
ja: 階層が本当に関係性を表している場合には、継承が有用な場合があります。これは、クラスは変更に対しては閉じていても、拡張に対しては開かれているべきだというオープンクローズド原則に関連しています。このようにして、スーパー型とそのメソッドを扱う一般的なメソッドを持ち、動的なディスパッチによってサブクラスのメソッドを呼び出すというポリモーフィズムを持つことができます。これは柔軟性があり、(実装の詳細についてはあまり知られていませんが)ソフトウェアに不可欠な間接性を作るのに役立ちます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계층 구조가 실제로 관계를 나타내는 경우 상속이 유용 할 때가 있습니다. </font><font style="vertical-align: inherit;">이는 공개 폐쇄 원칙과 관련이 있으며,이 클래스는 수정을 위해 클래스를 닫아야하지만 확장 가능합니다. </font><font style="vertical-align: inherit;">그렇게하면 다형성을 가질 수 있습니다. </font><font style="vertical-align: inherit;">수퍼 유형과 해당 메소드를 처리하는 일반 메소드를 갖지만 동적 디스패치를 ​​통해 서브 클래스의 메소드가 호출됩니다. </font><font style="vertical-align: inherit;">이는 유연성이 뛰어나고 소프트웨어에 필수적인 간접 구현을 만드는 데 도움이됩니다 (구현 세부 사항에 대해 덜 알고 있음).</font></font>
ru: Наследование иногда полезно,если иерархия действительно представляет собой отношение "is-a".Это относится к принципу Open-Closed,который гласит,что классы должны быть закрыты для модификации,но открыты для расширения.Таким образом,можно иметь полиморфизм;иметь общий метод,который имеет дело с супертипом и его методами,но через динамическую диспетчеризацию вызывается метод подкласса.Это гибко,и помогает создать индирекцию,что очень важно в программном обеспечении (меньше знать о деталях реализации).
zh_cn: 继承有时是有用的,如果层次结构真的代表了一个is-a-relationship的话。它与开放封闭原则(Open-Closed Principle)有关,该原则规定,类应该是封闭的,可以修改,但也可以扩展。这样,你可以有多态性;有一个处理超级类型及其方法的通用方法,但通过动态调度调用子类的方法。这样做很灵活,而且有助于建立隐蔽性,这在软件中是必不可少的(对实现细节了解较少)。

source: Inheritance is very powerful, but you can't force it (see: the <a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem">circle-ellipse problem</a>). If you really can't be completely sure of a true "is-a" subtype relationship, then it's best to go with composition.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La herencia es muy poderosa, pero no puedes forzarla (ver: el </font></font><a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">problema c&iacute;rculo-elipse</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Si realmente no puede estar completamente seguro de una verdadera relaci&oacute;n de subtipo "es-a", entonces es mejor ir con la composici&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承は非常に強力ですが、強制することはできません（参照：</font></font><a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">円と楕円の問題</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">真の「is-a」サブタイプの関係が完全に確信できない場合は、構成を使用するのが最善です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 매우 강력하지만 강제로 할 수는 없습니다 ( </font></font><a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원-타원 문제 참조</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">진정한 "is-a"하위 유형 관계를 완전히 확신 할 수 없으면 컴포지션을 사용하는 것이 가장 좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наследование очень мощное, но вы не можете его форсировать (см .: </font></font><a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проблема круга-эллипса</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Если вы действительно не можете быть полностью уверены в истинных отношениях типа &laquo;есть&raquo;, то лучше пойти с композицией.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承非常强大，但是您不能强制继承（请参阅：</font></font><a href="http://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">圆椭圆问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">如果您不能完全确定真正的&ldquo;是&rdquo;子类型关系，那么最好使用组合。</font></font>
