Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Your base class breaks encapsulation by exposing implementation details to subclasses in the form of protected members. This makes your system rigid and fragile. The more tragic flaw however is the new subclass brings with it all the baggage and opinion of the inheritance chain.
es: Su clase base rompe la encapsulación exponiendo los detalles de implementación a subclases en forma de miembros protegidos.Esto hace que tu sistema sea rígido y frágil.Sin embargo,la falla más trágica es que la nueva subclase trae consigo todo el bagaje y la opinión de la cadena de herencia.
ja: あなたの基底クラスは、実装の詳細を protected メンバの形でサブクラスに公開することでカプセル化を破ります。これはシステムを硬直化させ、壊れやすくしてしまいます。しかし、より悲劇的な欠陥は、新しいサブクラスが継承チェーンのすべての荷物と意見を持ってくることです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스는 구현 된 세부 정보를 보호 된 멤버 형태로 하위 클래스에 노출시켜 캡슐화를 중단합니다. </font><font style="vertical-align: inherit;">이것은 시스템을 단단하고 취약하게 만듭니다. </font><font style="vertical-align: inherit;">그러나 더 비극적 인 결함은 새로운 하위 클래스가 상속 체인의 모든 수하물과 의견을 가져 오는 것입니다.</font></font>
ru: Базовый класс нарушает инкапсуляцию,подвергая детали реализации подклассам в виде защищенных членов.Это делает вашу систему жесткой и хрупкой.Тем не менее,более трагичным недостатком является то,что новый подкласс приносит с собой весь багаж и мнение цепочки наследования.
zh_cn: 你的基类通过将实现细节以protected members的形式暴露给子类来打破封装。这使得你的系统变得僵化和脆弱。然而更悲剧的缺陷是,新的子类带来了继承链的所有包袱和意见。

source: a bar is a foo
es: un bar es un foo
ja: 酒場はフーフー
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바는 foo입니다</font></font>
ru: бар-это чушь
zh_cn: 杠杠是一个Foo

source: a bar is a foo, <strong>AND</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">un bar es un foo, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y</font></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">バーはfooであり、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">かつ</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바는 foo, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AND</font></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">бар является Foo, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и</font></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">酒吧是foo，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并且</font></font></strong>

source: all of this applies less to small projects than large ones, and less to private classes than public ones
es: todo esto se aplica menos a los pequeños proyectos que a los grandes,y menos a las clases privadas que a las públicas
ja: 小規模プロジェクトは大規模プロジェクトよりも少ないし、私立クラスは公立クラスよりも少ない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 모든 것은 큰 프로젝트보다 작은 프로젝트에 덜 적용되고 공개 프로젝트보다 작은 프로젝트에 덜 적용됩니다</font></font>
ru: все это относится в меньшей степени к малым проектам,чем к крупным,и в меньшей степени к частным занятиям,чем к государственным.
zh_cn: 这一切对小项目不如大项目,对私人班不如公班

source: an engine with wings. But what if I wanted to change
es: un motor con alas.Pero,¿y si quisiera cambiar
ja: 翼のあるエンジン。しかし、私が変更したいと思ったら?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">날개가 달린 엔진. </font><font style="vertical-align: inherit;">하지만 내가 바꾸고 싶다면</font></font>
ru: двигатель с крыльями.Но что если я захочу изменить
zh_cn: 一个有翅膀的发动机。但是,如果我想改变

source: and change them to rotary wings on the fly. It's essentially
es: y cambiarlos por alas rotativas sobre la marcha.Es esencialmente
ja: で、その場で回転翼に変更します。本質的には
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">회전 날개로 즉시 변경하십시오. </font><font style="vertical-align: inherit;">본질적으로</font></font>
ru: и поменять их на вращающиеся крылья на лету.По сути
zh_cn: 并在飞行时将其改成旋转翼。它的本质是

source: bars can do everything that foos can do.
es: los bares pueden hacer todo lo que los foos pueden hacer.
ja: バーはフォーズができることは何でもできる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">바는 푸가 할 수있는 모든 것을 할 수 있습니다.</font></font>
ru: бары могут делать все,что могут ноги.
zh_cn: 吧台可以做所有Foos能做的事情。

source: e.g. A Bird may need only the fly behavior of an Airplane. In this case, it makes sense to extract it out as an interface / class / both and make it a member of both classes.
es: Por ejemplo,un pájaro puede necesitar sólo el comportamiento de vuelo de un avión.En este caso,tiene sentido extraerlo como una clase de interfaz ambos y hacerlo miembro de ambas clases.
ja: 例えば、Birdは飛行機の飛行動作だけが必要な場合があります。この場合、両方のインタフェースクラスとして取り出して、両方のクラスのメンバにするのが理にかなっています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 조류는 비행기의 비행 행동 만 필요할 수 있습니다. </font><font style="vertical-align: inherit;">이 경우 인터페이스 / 클래스 / 둘 다로 추출하여 두 클래스의 멤버로 만드는 것이 좋습니다.</font></font>
ru: Например,Птице может понадобиться только поведение полета на самолете.В этом случае имеет смысл извлечь его как интерфейсный класс и сделать членом обоих классов.
zh_cn: 例如:A Bird可能只需要Airplane的飞行行为。在这种情况下,将其作为接口类提取出来,并使其成为这两个类的成员是有意义的。

source: e.g. A Cessna biplane will expose the complete interface of an airplane, if not more. So that makes it fit to derive from Airplane.
es: Por ejemplo,un biplano Cessna expondrá la interfaz completa de un avión,si no más.Así que eso lo hace apto para derivar de Avión.
ja: 例えば、セスナの複葉機は飛行機の完全なインターフェースを露出させますが、それ以上ではないにしても。ということは飛行機から派生するのに適しているということになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 Cessna 복엽 비행기는 비행기의 전체 인터페이스를 보여줍니다. </font><font style="vertical-align: inherit;">따라서 비행기에서 파생되는 것이 적합합니다.</font></font>
ru: Например,биплан "Цессна" выставит полный интерфейс самолета,если не больше.Так что это делает его пригодным для получения из самолета.
zh_cn: 如:塞斯纳双翼飞机将暴露出飞机的完整接口,如果不是更多的话。所以,这使得它适合从Airplane派生。

source: e.g. If <em>Car</em> contains <em>Vehicle</em> and if you have to get price of the <em>Car</em>, which has been defined in <em>Vehicle</em>, your code will be like this
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, si el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">autom&oacute;vil</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">veh&iacute;culo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y si tiene que obtener el precio del </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">autom&oacute;vil</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que se ha definido en el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">veh&iacute;culo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , su c&oacute;digo ser&aacute; as&iacute;</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Car</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vehicle</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が含まれ</font><font style="vertical-align: inherit;">ていて、</font><em><font style="vertical-align: inherit;">Vehicle</font></em><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">定義されている</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Carの</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">価格を取得する必要がある場合</font><font style="vertical-align: inherit;">、コードは次のようになります。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, 만약 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자동차가</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 포함 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차량을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 가격 얻을 수있는 경우 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자동차</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 정의 된, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차량을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 코드는 다음과 같이 될 것입니다</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, если </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Автомобиль</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержит </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Автомобиль,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и если вам нужно получить цену на </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Автомобиль</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которая была определена в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Транспортном средстве</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , ваш код будет таким</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，如果 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Car</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">包含</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vehicle</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并且您必须获取</font><font style="vertical-align: inherit;">在</font><em><font style="vertical-align: inherit;">Vehicle中</font></em><font style="vertical-align: inherit;">定义</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Car的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">价格，则</font><font style="vertical-align: inherit;">您的代码将如下所示</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: implementation (for code reuse)
es: implementación (para la reutilización del código)
ja: じつよう
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현 (코드 재사용)</font></font>
ru: реализация (для повторного использования кода)
zh_cn: 实现

source: inheritance is probably the worst form of coupling you can have
es: la herencia es probablemente la peor forma de acoplamiento que puedes tener
ja: 継承はおそらく最悪の結合形態です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 아마도 최악의 결합 형태 일 것입니다</font></font>
ru: Наследование,вероятно,самая худшая форма связи,которую вы можете иметь.
zh_cn: 继承可能是你可以有的最糟糕的耦合形式。

source: interface (for polymorphism)
es: interfaz (para el polimorfismo)
ja: インタフェース
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인터페이스 (다형성)</font></font>
ru: интерфейс (для полиморфизма)
zh_cn: 多态性界面

source: properties, or I redesign <code>Aircraft</code> as:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">propiedades, o redise&ntilde;o </font></font> <code>Aircraft</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティ、または私は</font></font> <code>Aircraft</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を次のよう</font><font style="vertical-align: inherit;">に再設計</font><font style="vertical-align: inherit;">します：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 또는 </font></font> <code>Aircraft</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 다음과 같이 </font><font style="vertical-align: inherit;">재 설계 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">свойства, или я изменяю дизайн </font></font> <code>Aircraft</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性，或者我将</font></font> <code>Aircraft</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">重新设计</font><font style="vertical-align: inherit;">为：</font></font>

source: the engine on the fly as well?
es: el motor sobre la marcha también?
ja: エンジンも同様にオンザフライで?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">엔진도 즉시?</font></font>
ru: и двигатель на ходу?
zh_cn: 发动机也在飞的时候?
