Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: When you have an <strong>is-a</strong> relation between two classes (example dog is a canine), you go for inheritance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando tienes </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> relaci&oacute;n </font><strong><font style="vertical-align: inherit;">is-a</font></strong><font style="vertical-align: inherit;"> entre dos clases (por ejemplo, el perro es un canino), optas por la herencia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2つのクラスの間に</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">is-a</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係がある</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">（例：dogは犬）、継承を行います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 클래스 사이에 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">is-a</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 관계 </font><font style="vertical-align: inherit;">가 있으면 </font><font style="vertical-align: inherit;">(예 : 개는 개), 상속을받습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда у вас есть отношение </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">is-</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> между двумя классами (например, собака - собака), вы переходите на наследство.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当你有一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是，一个</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两个类（例如狗是犬科动物）之间的关系，你去继承。</font></font>

source: When you want to "copy"/Expose the base class' API, you use inheritance. When you only want to "copy" functionality, use delegation.
es: Cuando quieres "copiar "Exponer la clase base' API,usas la herencia.Cuando sólo quieres "copiar" la funcionalidad,usa la delegación.
ja: 基底クラスのAPIを "コピー "して公開する場合は継承を使います。機能だけを「コピー」したい場合は、デリゲーションを使います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스의 API를 "복사"/ 노출하려면 상속을 사용합니다. </font><font style="vertical-align: inherit;">기능 만 "복사"하려면 위임을 사용하십시오.</font></font>
ru: Когда вы хотите "скопировать" Разоблачить API базового класса,вы используете наследование.Когда вы хотите только "скопировать" функциональность,используйте делегирование.
zh_cn: 当你想 "复制 "暴露基类的API时,就使用继承。当你只想 "复制 "功能的时候,就使用授权。

source: Whether the base class can be instantiated. That is, whether the base class can be non-abstract. If it can be non-abstract I usually prefer composition
es: Si la clase base puede ser instanciada.Es decir,si la clase base puede ser no abstracta.Si puede ser no abstracta,normalmente prefiero la composición
ja: 基底クラスがインスタンス化できるかどうか。つまり、基底クラスが抽象的でないことができるかどうかです。抽象的ではない場合、私は通常 composition を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스를 인스턴스화 할 수 있는지 여부 </font><font style="vertical-align: inherit;">즉, 기본 클래스가 비 추상적 일 수 있는지 여부입니다. </font><font style="vertical-align: inherit;">그것이 비 추상적 일 수 있다면 나는 보통 구성을 선호한다</font></font>
ru: Может ли базовый класс быть инстанцирован.То есть,может ли базовый класс быть не абстрактным.Если он может быть неабстрактным,я обычно предпочитаю состав.
zh_cn: 基类是否可以被实例化。也就是说,基类是否可以非抽象。如果可以是非抽象的,我通常更喜欢用component

source: Which class design is better?
es: ¿Qué diseño de clase es mejor?
ja: どのクラスのデザインが良いのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어느 클래스 디자인이 더 낫습니까?</font></font>
ru: Какой классовый дизайн лучше?
zh_cn: 哪种班级设计比较好?

source: While in short words I would agree with "Prefer composition over inheritance", very often for me it sounds like "prefer potatoes over coca-cola". There are places for inheritance and places for composition. You need to understand difference, then this question will disappear. What it really means for me is "if you are going to use inheritance - think again, chances are you need composition".
es: Mientras que en palabras cortas estaría de acuerdo con "Preferir la composición a la herencia",muy a menudo para mí suena como "preferir las patatas a la coca-cola".Hay lugares para la herencia y lugares para la composición.Necesitas entender la diferencia,entonces esta pregunta desaparecerá.Lo que realmente significa para mí es "si vas a usar la herencia,piénsalo de nuevo,es probable que necesites la composición".
ja: 簡潔に言えば、「相続よりも構図を好む」というのは賛成ですが、私にとっては「コカコーラよりもジャガイモを好む」というように聞こえることが多いです。相続する場所と組成する場所があります。その違いを理解していれば、この疑問は消えていくでしょう。私にとって本当に意味があるのは、「もしあなたが継承を使おうとしているのなら、もう一度考えてみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단히 말해서 나는 "상속보다 구성을 선호한다"에 동의하지만, 종종 "코카콜라보다 감자를 선호한다"고 들린다. </font><font style="vertical-align: inherit;">상속 장소와 구성 장소가 있습니다. </font><font style="vertical-align: inherit;">차이점을 이해해야합니다. 그러면이 질문은 사라집니다. </font><font style="vertical-align: inherit;">그것이 저에게 실제로 의미하는 것은 "상속을 사용하려는 경우 다시 생각하면 구성이 필요할 것입니다"입니다.</font></font>
ru: Хотя в коротких словах я бы согласился с "Предпочитаю композицию,а не наследство",очень часто для меня это звучит как "предпочитаю картофель,а не кока-колу".Есть места для наследования и места для композиции.Нужно понять разницу,тогда этот вопрос исчезнет.На самом деле для меня это означает:"если Вы собираетесь использовать наследование-подумайте еще раз,есть шанс,что Вам нужна композиция".
zh_cn: 虽然简而言之,我会同意 "宁可作文,也不要继承 "的说法,但很多时候对我来说,这听起来就像 "宁可吃土豆,也不要喝可乐"。继承有继承的地方,构成也有构成的地方。你需要理解区别,那么这个问题就会消失。对我来说,它真正的意思是 "如果你要用继承--再想一想,很可能你需要作曲"。

source: Why prefer composition over inheritance?
es: ¿Por qué preferir la composición a la herencia?
ja: なぜ継承よりも構成を好むのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속보다 구성을 선호하는 이유는 무엇입니까?</font></font>
ru: Почему предпочитают композицию,а не наследование?
zh_cn: 为什么偏重于继承的成分,而不是继承?

source: Why prefer composition over inheritance? What trade-offs are there for each approach? When should you choose inheritance over composition?
es: ¿Por qué preferir la composición a la herencia? ¿Qué compensaciones hay para cada enfoque? ¿Cuándo debería elegir la herencia en lugar de la composición?
ja: なぜ継承よりも構成を好むのか?それぞれのアプローチにはどのようなトレードオフがあるのか?どのような場合にコンポジションよりも継承を選ぶべきか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속보다 구성을 선호하는 이유는 무엇입니까? </font><font style="vertical-align: inherit;">각 접근법마다 어떤 절충점이 있습니까? </font><font style="vertical-align: inherit;">구성보다 상속을 언제 선택해야합니까?</font></font>
ru: Почему предпочитают композицию,а не наследование? Какие компромиссы существуют для каждого подхода? Когда следует выбирать наследование,а не состав?
zh_cn: 为什么偏向于组成法而不是继承法?每种方法都有哪些权衡?什么时候应该选择继承而不是组成式?

source: With all the undeniable benefits provided by inheritance, here's some of its disadvantages.
es: Con todos los innegables beneficios que proporciona la herencia,he aquí algunas de sus desventajas.
ja: 相続によって得られる否定できないメリットがある中で、ここではそのデメリットをいくつかご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 통해 부인할 수없는 모든 혜택을 누리면 다음과 같은 단점이 있습니다.</font></font>
ru: Со всеми неоспоримыми преимуществами,предоставляемыми наследством,вот некоторые из его недостатков.
zh_cn: 不可否认的是,继承的好处有很多,下面是它的一些弊端。

source: With inheritance, you can define/modify/extend a capability
es: Con la herencia,se puede definir la ampliación de una capacidad
ja: 継承により、ケイパビリティの変更拡張を定義することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 통해 기능을 정의 / 수정 / 확장 할 수 있습니다</font></font>
ru: С помощью наследования,вы можете дефинемодифицировать расширение возможности
zh_cn: 有了继承,你可以定义一个能力的定义、修改和扩展。

source: With the above trade offs in mind, we hence <em>prefer</em> composition over inheritance. Yet for tightly related classes, i.e. when implicit code reuse really make benefits, or the magic power of open recursion is desired, inheritance shall be the choice.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con las compensaciones anteriores en mente, por lo tanto, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">preferimos la</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> composici&oacute;n sobre la herencia. </font><font style="vertical-align: inherit;">Sin embargo, para clases estrechamente relacionadas, es decir, cuando la reutilizaci&oacute;n impl&iacute;cita del c&oacute;digo realmente genera beneficios, o si se desea el poder m&aacute;gico de la recursi&oacute;n abierta, la herencia ser&aacute; la elecci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のトレードオフを考慮して、</font><font style="vertical-align: inherit;">継承</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成を</font><em><font style="vertical-align: inherit;">優先</font></em><font style="vertical-align: inherit;">します。</font><font style="vertical-align: inherit;">しかし、密接に関連するクラスの場合、つまり暗黙的なコードの再利用が実際にメリットをもたらす場合、またはオープンな再帰の魔法の力が望まれる場合、継承を選択する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 장단점을 염두에두고 </font><font style="vertical-align: inherit;">상속보다 구성을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선호합니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그러나 밀접하게 관련된 클래스, 즉 암시 적 코드 재사용이 실제로 이익을 얻거나 개방형 재귀의 마법의 힘이 필요한 경우 상속이 선택됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Имея в виду вышеупомянутые компромиссы, мы, следовательно, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предпочитаем</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> композицию наследованию. </font><font style="vertical-align: inherit;">Тем не менее, для тесно связанных классов, т. Е. Когда неявное повторное использование кода действительно приносит пользу, или желательна волшебная сила открытой рекурсии, наследование должно быть выбором.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考虑到上述折衷因素，因此我们</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更倾向于使用</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合而不是继承。</font><font style="vertical-align: inherit;">但是对于紧密相关的类，即当隐式代码重用确实能带来好处，或者需要开放递归的神奇力量时，继承将是选择。</font></font>

source: With the two benefits comes two different purposes for doing inheritance: subtyping oriented and code reuse oriented.
es: Con los dos beneficios vienen dos propósitos diferentes para hacer la herencia:orientado a la subtipificación y orientado a la reutilización del código.
ja: 2つの利点は、継承を行うための2つの異なる目的、つまりサブタイプ指向とコードの再利用指向です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 수행하는 두 가지 목적, 즉 서브 타이핑 지향과 코드 재사용 지향의 두 가지 이점이 있습니다.</font></font>
ru: С двумя преимуществами приходят две разные цели для осуществления наследования:ориентация на подтипирование и ориентация на повторное использование кода.
zh_cn: 有了这两个好处,就带来了做继承的两个不同目的:面向子类型和面向代码重用的代码。

source: You can't change the implementation inherited from super classes at runtime (obviously because inheritance is defined at compile time).
es: No se puede cambiar la implementación heredada de las superclases en tiempo de ejecución (obviamente porque la herencia se define en tiempo de compilación).
ja: スーパークラスから継承した実装を実行時に変更することはできません(コンパイル時に継承が定義されているので当然です)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">런타임에 수퍼 클래스에서 상속 된 구현을 변경할 수 없습니다 (물론 상속은 컴파일 타임에 정의되므로).</font></font>
ru: Вы не можете изменить реализацию,унаследованную от суперклассов во время исполнения (очевидно,потому что наследование определяется во время компиляции).
zh_cn: 你不能在运行时改变从超级类继承的实现(显然是因为继承是在编译时定义的)。

source: You have many classes with <strong>same interface</strong> and you want to save time writing them
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tienes muchas clases con la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">misma interfaz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y quieres ahorrar tiempo escribi&eacute;ndolas</font></font>
ja: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じインターフェース</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">持つ多くのクラスがあり、</font><font style="vertical-align: inherit;">それらを書く時間を節約したい</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한 인터페이스를</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가진 많은 클래스가 있으며 </font><font style="vertical-align: inherit;">작성 시간을 절약하고 싶습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У вас много классов с </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">одинаковым интерфейсом,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и вы хотите сэкономить время на их написание</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您有许多具有</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相同接口的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类，</font><font style="vertical-align: inherit;">并且您想节省编写它们的时间</font></font>

source: You have to use same Base Class for each object
es: Tienes que usar la misma clase base para cada objeto
ja: 各オブジェクトには同じベースクラスを使用しなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 객체에 대해 동일한 기본 클래스를 사용해야합니다</font></font>
ru: Вы должны использовать один и тот же базовый класс для каждого объекта.
zh_cn: 你必须对每个对象使用相同的基类。

source: You may have noticed that most OO languages don't allow multiple inheritance. While there are a couple of cases where multiple inheritance can really buy you something, but those are rather exceptions than the rule. Whenever you run into a situation where you think "multiple inheritance would be a really cool feature to solve this problem", you are usually at a point where you should re-think inheritance altogether, since even it may require a couple of extra code lines, a solution based on composition will usually turn out to be much more elegant, flexible and future proof.
es: Habrás notado que la mayoría de los idiomas OO no permiten la herencia múltiple.Aunque hay un par de casos en los que la herencia múltiple puede realmente comprar algo,pero esas son más bien excepciones que la regla.Siempre que te encuentras con una situación en la que piensas que "la herencia múltiple sería una característica realmente genial para resolver este problema",normalmente estás en un punto en el que deberías replantearte la herencia por completo,ya que incluso puede requerir un par de líneas de código extra,una solución basada en la composición normalmente resultará mucho más elegante,flexible y a prueba de futuro.
ja: ほとんどの OO 言語は多重継承を許可していないことにお気づきかもしれません。多重継承によって何かを得ることができるケースはいくつかありますが、それらはルールというよりはむしろ例外です。多重継承はこの問題を解決するのにとてもクールな機能だ」と思うような状況に遭遇した場合、通常は継承を完全に再考すべき時期に来ているのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대부분의 OO 언어는 다중 상속을 허용하지 않습니다. </font><font style="vertical-align: inherit;">다중 상속이 실제로 무언가를 구입할 수있는 몇 가지 경우가 있지만 규칙보다는 예외입니다. </font><font style="vertical-align: inherit;">"여러 상속이이 문제를 해결하는 정말 멋진 기능"이라고 생각하는 상황에 처할 때마다 대개 몇 가지 추가 코드 줄이 필요할 수 있으므로 상속을 다시 생각해야하는 시점에 있습니다. 구성에 기반한 솔루션은 일반적으로 훨씬 더 우아하고 유연하며 미래의 증거로 판명됩니다.</font></font>
ru: Вы,возможно,заметили,что большинство языков OO не допускают множественного наследования.Хотя есть пара случаев,когда множественное наследование может действительно что-то купить,но это скорее исключения,чем правило.Всякий раз,когда вы сталкиваетесь с ситуацией,когда считаете,что "многократное наследование было бы действительно крутой возможностью для решения этой проблемы",вы,как правило,находитесь в такой ситуации,когда вам следует заново подумать о многократном наследовании,поскольку даже оно может потребовать пары дополнительных строк кода,решение,основанное на композиции,обычно оказывается гораздо более элегантным,гибким и перспективным.
zh_cn: 你可能已经注意到,大多数OO语言不允许多重继承。虽然有一些情况下,多重继承确实可以为你买到一些东西,但这些都是特例而不是规则。每当你遇到这样的情况时,你会认为 "多重继承将是一个非常酷的功能来解决这个问题",你通常都应该重新考虑一下继承的问题,因为即使它可能需要额外增加几行代码,但基于组合的解决方案通常会更优雅、更灵活、更有未来感。

source: You need to have a look at <strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf">The Liskov Substitution Principle</a></strong> in Uncle Bob's <a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod">SOLID</a> principles of class design. :)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debes echar un vistazo al </font></font><strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Principio de sustituci&oacute;n de Liskov</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en los </font><font style="vertical-align: inherit;">principios </font></font><a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">S&Oacute;LIDOS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de dise&ntilde;o de clase del </font><font style="vertical-align: inherit;">t&iacute;o Bob </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">:)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス設計の</font><font style="vertical-align: inherit;">ボブおじさんの</font><a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod"><font style="vertical-align: inherit;">SOLID</font></a><font style="vertical-align: inherit;">原則</font></font><strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のリスコフ代替原則を</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">確認する必要があります</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">:)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bob 삼촌의 </font><a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod"><font style="vertical-align: inherit;">SOLID</font></a><font style="vertical-align: inherit;"> 클래스 설계 </font></font><strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원칙</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><strong><font style="vertical-align: inherit;">있는 Liskov 대체 원리</font></strong><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">살펴 봐야 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">:)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам нужно взглянуть на </font></font><strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Принцип подстановки Лискова</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font><a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SOLID</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> принципах проектирования классов </font><font style="vertical-align: inherit;">Дядей Бобом </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">:)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您需要查看</font><font style="vertical-align: inherit;">Bob叔叔的</font><a href="http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod"><font style="vertical-align: inherit;">SOLID</font></a><font style="vertical-align: inherit;">类设计</font></font><strong><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原则</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font><strong><font style="vertical-align: inherit;">的Liskov替代原则</font></strong><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">:)</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: You need to modify the private variables, which can not be public in any case
es: Hay que modificar las variables privadas,que no pueden ser públicas en ningún caso
ja: プライベート変数を変更する必要がありますが、これはどのような場合でもパブリックにすることはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 경우에도 공개 될 수없는 개인 변수를 수정해야합니다</font></font>
ru: Вам необходимо изменить приватные переменные,которые в любом случае не могут быть публичными
zh_cn: 你需要修改私有变量,在任何情况下都不能是公共变量

source: You should prefer potatoes over coca cola when you want to eat, and coca cola over potatoes when you want to drink.
es: Deberías preferir las patatas a la coca cola cuando quieras comer,y la coca cola a las patatas cuando quieras beber.
ja: 食べたいときはコカコーラよりもポテトを、飲みたいときはポテトよりもコカコーラを優先したほうがいい。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먹고 싶을 때는 코카콜라보다 감자를, 마시고 싶을 때는 감자보다 코카콜라를 선호해야합니다.</font></font>
ru: Вы должны предпочитать картофель,а не кока-колу,когда хотите есть,и кока-колу,когда хотите пить.
zh_cn: 想吃东西的时候,应该选择土豆而不是可乐,想喝东西的时候,应该选择可乐而不是土豆。
