Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: So for me it looks like if someone does not know if he needs inheritance or composition, the real problem is that he does not know if he want to drink or to eat. Think about your problem domain more, understand it better.
es: Así que para mí parece que si alguien no sabe si necesita una herencia o una composición,el verdadero problema es que no sabe si quiere beber o comer.Piensa más en el dominio de tu problema,entiéndelo mejor.
ja: だから、私にとっては、継承が必要なのか合成が必要なのかわからない人がいる場合、本当の問題は、飲みたいのか食べたいのかわからないということのように見えます。自分の問題領域をもっと考えて、もっと理解してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 누군가가 상속이나 구성이 필요한지 알지 못하는 경우 실제 문제는 그가 마시거나 먹고 싶어하는지 모른다는 것입니다. </font><font style="vertical-align: inherit;">문제 영역에 대해 더 많이 생각하고 더 잘 이해하십시오.</font></font>
ru: Поэтому для меня это выглядит так,будто если кто-то не знает,нужно ли ему наследство или композиция,то реальная проблема в том,что он не знает,хочет ли он выпить или поесть.Подумайте о своей проблемной области больше,поймите ее лучше.
zh_cn: 所以在我看来,如果有人不知道自己是需要继承还是需要构成,真正的问题是不知道自己是要喝酒还是要吃饭。多想想你的问题域,多理解一下你的问题域。

source: So only when subtyping is purposed, i.e. to use the new class later in a polymorphic manner, do we face the problem of choosing inheritance or composition. This is the assumption that gets omitted in the shortened idiom under discussion.
es: Por lo tanto,sólo cuando la subtipificación tiene un propósito,es decir,utilizar la nueva clase más tarde de manera polimórfica,nos enfrentamos al problema de elegir la herencia o la composición.Esta es la suposición que se omite en el modismo abreviado que se está discutiendo.
ja: ですから、サブタイプ化が目的の場合、つまり、新しいクラスを後から多相的に使用する場合に限って、継承と合成のどちらを選択するかという問題に直面することになります。これが、今議論中の短縮イディオムでは省略されている前提です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 서브 타이핑이 목적 일 때, 즉 새로운 클래스를 나중에 다형성 방식으로 사용하려는 경우에만 상속 또는 구성을 선택하는 문제에 직면하게됩니다. </font><font style="vertical-align: inherit;">이것은 논의중인 단축 관용구에서 생략되는 가정입니다.</font></font>
ru: Таким образом,только в случае,когда подтипирование предназначено,т.е.использование нового класса в дальнейшем полиморфным способом,мы сталкиваемся с проблемой выбора наследования или состава.Это предположение опускается в обсуждаемой сокращенной идиоме.
zh_cn: 因此,只有当子类型的目的是为了以后使用新类的多态性时,我们才会面临选择继承还是组成的问题。这就是我们讨论中的短语中被省略的假设。

source: So, if your object need to appear as a different object or behave differently depending on an object state or conditions, then use <strong>Composition</strong>: Refer to <a href="http://www.dofactory.com/Patterns/PatternState.aspx">State</a> and <a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx">Strategy</a> Design Patterns.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, si su objeto necesita aparecer como un objeto diferente o comportarse de manera diferente seg&uacute;n el estado o las condiciones de un objeto, utilice </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Composici&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : consulte </font><font style="vertical-align: inherit;">Patrones de dise&ntilde;o de </font><a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx"><font style="vertical-align: inherit;">estrategia</font></a><font style="vertical-align: inherit;"> y </font></font><a href="http://www.dofactory.com/Patterns/PatternState.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">estado</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、オブジェクトが別のオブジェクトとして表示される必要がある場合、またはオブジェクトの状態や条件に応じて異なる動作をする必要がある場合は、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンポジション</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用します</font><font style="vertical-align: inherit;">。</font></font><a href="http://www.dofactory.com/Patterns/PatternState.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">状態</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">戦略の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設計パターンを</font><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 객체가 다른 객체로 나타나거나 객체 상태 또는 조건에 따라 다르게 동작해야하는 경우 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><a href="http://www.dofactory.com/Patterns/PatternState.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상태</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전략</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 디자인 패턴 </font><font style="vertical-align: inherit;">참조를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Итак, если ваш объект должен выглядеть как другой объект или вести себя по-разному в зависимости от состояния или условий объекта, используйте </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Composition</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : см. </font><font style="vertical-align: inherit;">Шаблоны проектирования </font></font><a href="http://www.dofactory.com/Patterns/PatternState.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">состояний</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">стратегий</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，如果您的对象需要显示为不同的对象或根据对象的状态或行为而有所不同，</font><font style="vertical-align: inherit;">请</font><font style="vertical-align: inherit;">使用&ldquo; </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组成&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：请参阅</font></font><a href="http://www.dofactory.com/Patterns/PatternState.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">状态</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="http://www.dofactory.com/Patterns/PatternStrategy.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">策略</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设计模式。</font></font>

source: Sub-class adds extension to base class implementation by calling super.methodName() as first statement =&gt; <strong><em>You can extend a contract</em></strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La subclase agrega extensi&oacute;n a la implementaci&oacute;n de la clase base llamando a super.methodName () como primera instrucci&oacute;n =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede extender un contrato</font></font></em></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブクラスは、最初のステートメントとしてsuper.methodName（）を呼び出すことにより、基本クラスの実装に拡張機能を追加します=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントラクトを拡張できます</font></font></em></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하위 클래스는 super.methodName ()을 첫 번째 명령문으로 호출하여 기본 클래스 구현에 확장을 추가합니다. =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계약을 연장 할 수 있습니다</font></font></em></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подкласс добавляет расширение к реализации базового класса, вызывая super.methodName () в качестве первого оператора =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете продлить контракт</font></font></em></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子类通过调用super.methodName（）作为第一条语句为基础类实现添加扩展，</font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以扩展合同</font></font></em></strong>

source: Subclass is not the same as subtype. You might create subclasses that are not subtypes (and this is when you should use composition). To understand what a subtype is, lets start giving an explanation of what a type is.
es: La subclase no es lo mismo que el subtipo.Puede crear subclases que no son subtipos (y aquí es cuando debe usar la composición).Para entender lo que es un subtipo,empecemos a dar una explicación de lo que es un tipo.
ja: サブクラスはサブタイプと同じではありません。サブタイプではないサブクラスを作ることがあるかもしれません(これはコンポジションを使うべき時です)。サブタイプとは何かを理解するために、まず型とは何かを説明します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하위 클래스는 하위 유형과 다릅니다. </font><font style="vertical-align: inherit;">서브 타입이 아닌 서브 클래스를 작성할 수 있습니다 (이는 컴포지션을 사용해야하는 경우입니다). </font><font style="vertical-align: inherit;">하위 유형이 무엇인지 이해하려면 유형이 무엇인지 설명하십시오.</font></font>
ru: Подкласс-это не то же самое,что подтип.Можно создавать подклассы,которые не являются подтипами (и именно в этом случае следует использовать композицию).Чтобы понять,что такое подтип,давайте начнем объяснять,что такое тип.
zh_cn: 子类和子类型不一样。你可能会创建不是子类型的子类(这时你应该使用composition)。为了理解什么是子类型,我们先来解释一下什么是类型。

source: Subtype is also a type, which has a relation to another type, called parent type (or supertype). The subtype must satisfy the features (values, methods and properties) of the parent type. The relation means that in any context where the supertype is expected, it can be substitutable by a subtype, without affecting the behaviour of the execution. Let&rsquo;s go to see some code to exemplify what I&rsquo;m saying. Suppose I write a List of integers (in some sort of pseudo language):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El subtipo tambi&eacute;n es un tipo, que tiene una relaci&oacute;n con otro tipo, llamado tipo padre (o supertipo). </font><font style="vertical-align: inherit;">El subtipo debe satisfacer las caracter&iacute;sticas (valores, m&eacute;todos y propiedades) del tipo primario. </font><font style="vertical-align: inherit;">La relaci&oacute;n significa que en cualquier contexto donde se espera el supertipo, puede ser sustituible por un subtipo, sin afectar el comportamiento de la ejecuci&oacute;n. </font><font style="vertical-align: inherit;">Vamos a ver un c&oacute;digo para ejemplificar lo que estoy diciendo. </font><font style="vertical-align: inherit;">Supongamos que escribo una lista de enteros (en alg&uacute;n tipo de pseudo lenguaje):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブタイプもタイプであり、親タイプ（またはスーパータイプ）と呼ばれる別のタイプと関係があります。</font><font style="vertical-align: inherit;">サブタイプは、親タイプの機能（値、メソッド、およびプロパティ）を満たしている必要があります。</font><font style="vertical-align: inherit;">この関係は、スーパータイプが期待されるあらゆるコンテキストで、実行の動作に影響を与えることなく、サブタイプで置き換えることができることを意味します。</font><font style="vertical-align: inherit;">私が言っていることを例示するためにいくつかのコードを見に行きましょう。</font><font style="vertical-align: inherit;">整数のリストを（ある種の疑似言語で）書いたとします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하위 유형은 또한 상위 유형 (또는 상위 유형)이라고하는 다른 유형과 관계가있는 유형입니다. </font><font style="vertical-align: inherit;">하위 유형은 상위 유형의 기능 (값, 메소드 및 특성)을 충족해야합니다. </font><font style="vertical-align: inherit;">관계는 상위 유형이 예상되는 모든 컨텍스트에서 실행 동작에 영향을주지 않고 하위 유형으로 대체 할 수 있음을 의미합니다. </font><font style="vertical-align: inherit;">내가 말하는 것을 예시하는 코드를 보도록하겠습니다. </font><font style="vertical-align: inherit;">내가 어떤 종류의 의사 언어로 정수 목록을 작성한다고 가정 해보십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подтип также является типом, который имеет отношение к другому типу, называемому родительским типом (или супертипом). </font><font style="vertical-align: inherit;">Подтип должен удовлетворять признакам (значениям, методам и свойствам) родительского типа. </font><font style="vertical-align: inherit;">Отношение означает, что в любом контексте, где ожидается использование супертипа, его можно заменить на подтип, не влияя на поведение выполнения. </font><font style="vertical-align: inherit;">Давайте посмотрим код, чтобы проиллюстрировать то, что я говорю. </font><font style="vertical-align: inherit;">Предположим, я пишу список целых чисел (на каком-то псевдо-языке):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子类型也是一种类型，它与另一个类型有关系，称为父类型（或超类型）。</font><font style="vertical-align: inherit;">子类型必须满足父类型的特征（值，方法和属性）。</font><font style="vertical-align: inherit;">该关系意味着在期望超类型的任何上下文中，它都可以被子类型替代，而不会影响执行的行为。</font><font style="vertical-align: inherit;">让我们来看一些代码来举例说明我的意思。</font><font style="vertical-align: inherit;">假设我写了一个整数列表（用某种伪语言）：</font></font>

source: Subtyping is appropriate and more powerful where the <a href="https://stackoverflow.com/a/8352969">invariants can be enumerated</a>, else use function composition for extensibility.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El subtipo es apropiado y m&aacute;s poderoso cuando </font></font><a href="https://stackoverflow.com/a/8352969"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">se pueden enumerar</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> los </font><font style="vertical-align: inherit;">invariantes</font><font style="vertical-align: inherit;"> , de lo contrario, use la composici&oacute;n de funciones para la extensibilidad.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブタイピングは、</font></font><a href="https://stackoverflow.com/a/8352969"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不変条件を列挙できる場合に</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">適切でより強力</font><font style="vertical-align: inherit;">です。それ以外の場合は、拡張のために関数構成を使用します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 타이핑은 </font></font><a href="https://stackoverflow.com/a/8352969"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">불변이 열거 될 수있는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 경우 적절하고 강력하며 </font><font style="vertical-align: inherit;">, 그렇지 않으면 확장 성을 위해 함수 구성을 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подтипирование является подходящим и более мощным, когда </font></font><a href="https://stackoverflow.com/a/8352969"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">можно перечислить инварианты</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , иначе используйте композицию функций для расширяемости.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="https://stackoverflow.com/a/8352969"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以枚举不变量的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">地方，子类型化是适当的并且功能更强大</font><font style="vertical-align: inherit;">，否则，使用函数组合来实现可扩展性。</font></font>

source: Suppose an aircraft has only two parts: an engine and wings.
es: Supongamos que una aeronave sólo tiene dos partes:un motor y unas alas.
ja: 飛行機には、エンジンと翼の2つの部品しかないとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항공기에 엔진과 날개의 두 부분 만 있다고 가정합니다.</font></font>
ru: Предположим,что самолет состоит только из двух частей:двигателя и крыльев.
zh_cn: 假设一架飞机只有两部分:发动机和机翼。

source: The Manager object is composed as an Employee and a Person. The Title behaviour is taken from employee. This explicit composition removes ambiguity among other things and you'll encounter fewer bugs.
es: El objeto Manager está compuesto por un Empleado y una Persona.El comportamiento del Título se toma de empleado.Esta composición explícita elimina la ambigüedad entre otras cosas y encontrarás menos errores.
ja: Managerオブジェクトは、EmployeeとPersonで構成されています。タイトルの振る舞いは employee から取得します。このように明示的に構成することで、特に曖昧さがなくなり、バグの発生が少なくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Manager 개체는 직원과 사람으로 구성됩니다. </font><font style="vertical-align: inherit;">직함 행동은 직원으로부터 가져옵니다. </font><font style="vertical-align: inherit;">이 명시적인 구성은 무엇보다도 애매 모호함을 없애고 버그가 줄어 듭니다.</font></font>
ru: Объект Менеджер состоит из Сотрудника и Человека.Поведение Титула берётся у сотрудника.Эта явная композиция устраняет двусмысленность среди прочего,и вы столкнетесь с меньшим количеством ошибок.
zh_cn: 管理者对象由雇员和个人组成。Title行为取自于雇员。这种明确的构成,消除了其他方面的模糊性,你会遇到更少的BUG。
