Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This is called the <a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem">Circle-Ellipse problem</a>, which really isn't a problem, just a clear proof that the first test alone isn't enough to conclude that inheritance is possible. In particular, this example highlights that derived classes should <em>extend</em> the functionality of base classes, never <em>restrict</em> it. Otherwise, the base class couldn't be used polymorphically.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto se llama el </font></font><a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">problema Circle-Ellipse</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que realmente no es un problema, solo una prueba clara de que la primera prueba por s&iacute; sola no es suficiente para concluir que la herencia es posible. En particular, este ejemplo resalta que las clases derivadas deber&iacute;an </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">extender</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la funcionalidad de las clases base, nunca </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">restringirla</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . De lo contrario, la clase base no podr&iacute;a usarse polim&oacute;rficamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは</font></font><a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Circle-Ellipse問題</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれ、</font><font style="vertical-align: inherit;">実際には問題ではありません。最初のテストだけでは継承が可能であると結論付けるのに十分ではないという明確な証拠です。特に、この例は、派生クラス</font><font style="vertical-align: inherit;">が基本クラスの機能を</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">拡張し</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">制限</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">し</font><font style="vertical-align: inherit;">ないことを</font><font style="vertical-align: inherit;">強調して</font><font style="vertical-align: inherit;">います。そうしないと、基本クラスを多態的に使用できません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 </font></font><a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원형 타원 문제</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라고합니다 </font><font style="vertical-align: inherit;">. 이것은 실제로 </font><font style="vertical-align: inherit;">문제</font><font style="vertical-align: inherit;"> 가 아니며, 첫 번째 테스트만으로는 상속이 가능하다는 결론을 내리기에 충분하지 않다는 명백한 증거입니다. </font><font style="vertical-align: inherit;">특히,이 예제는 파생 클래스가 </font><font style="vertical-align: inherit;">기본 클래스의 기능을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">확장</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 절대로 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제한</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하지 </font><font style="vertical-align: inherit;">않아야 함을 강조 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">그렇지 않으면 기본 클래스를 다형성으로 사용할 수 없습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это называется </font></font><a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проблемой Circle-Ellipse</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которая на самом деле не является проблемой, просто явным доказательством того, что одного первого теста недостаточно для заключения о том, что наследование возможно. В частности, этот пример подчеркивает, что производные классы должны </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">расширять</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> функциональность базовых классов, а не </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ограничивать</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> их. В противном случае базовый класс не может быть использован полиморфно.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这被称为</font></font><a href="https://en.wikipedia.org/wiki/Circle-ellipse_problem"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Circle-Ellipse问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这实际上不是问题，只是一个明确的证明，仅第一个测试不足以得出继承是可能的结论。特别是，该示例强调了派生类应</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">扩展</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基类的功能，而从不对其进行</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">限制</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。否则，基类不能被多态使用。</font></font>

source: This is inheritance at work. The Employee "is a" Person or inherits from Person. All inheritance relationships are "is-a" relationships. Employee also shadows the Title property from Person, meaning Employee.Title will return the Title for the Employee not the Person.
es: Esto es una herencia en el trabajo.El empleado "es" una persona o hereda de la persona.Todas las relaciones de herencia son relaciones "es-a".El Empleado también ensombrece la propiedad del Título de la Persona,lo que significa que el Título del Empleado devolverá el Título para el Empleado no para la Persona.
ja: 職場での相続です。従業員が「ある」Person、またはPersonから継承します。継承関係はすべて「is-a」関係です。Employeeはまた、PersonからTitleプロパティをシャドーイングします、つまり、Employee.TitleはPersonではなく、EmployeeのTitleを返します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 직장에서의 상속입니다. </font><font style="vertical-align: inherit;">직원은 "개인"이거나 개인으로부터 상속받습니다. </font><font style="vertical-align: inherit;">모든 상속 관계는 "is-a"관계입니다. </font><font style="vertical-align: inherit;">또한 Employee는 Person의 Title 속성을 숨 깁니다. 이는 Employee를 의미합니다. Title은 Person이 아닌 Employee의 제목을 반환합니다.</font></font>
ru: Это наследство на работе.Сотрудник "является" Человеком или наследует от Человека.Все отношения наследования являются отношениями "есть-а".Сотрудник также затеняет свойство Title от Личности,имея в виду Employee.Title (Сотрудник)возвращает свойство для Сотрудника,а не для Личности.
zh_cn: 这就是工作中的继承。雇员 "是一个 "Person或从Person继承。所有的继承关系都是 "是-a "关系。Employee也会从Person继承Title属性,也就是说Employee.Title会返回Employee的Title而不是Person。

source: To address this question from a different perspective for newer programmers:
es: Para abordar esta cuestión desde una perspectiva diferente para los nuevos programadores:
ja: 新人プログラマーのための別の視点からこの問題に取り組むために。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새로운 프로그래머를위한 다른 관점에서이 질문을 해결하려면 :</font></font>
ru: Рассмотреть этот вопрос с другой точки зрения для начинающих программистов:
zh_cn: 为了解决这个问题,从不同的角度为新入行的程序员解决这个问题。

source: To give another example, think about the abstract data types, Set of integers and List of integers, the values they can hold are restricted to integers. They both support a set of methods, like add(newValue) and size(). And they both have different properties (class invariant), Sets does not allow duplicates while List does allow duplicates (of course there are other properties that they both satisfy).
es: Para dar otro ejemplo,piense en los tipos de datos abstractos,Conjunto de números enteros y Lista de números enteros,los valores que pueden contener están restringidos a números enteros.Ambos soportan un conjunto de métodos,como add(newValue)y size().Y ambos tienen diferentes propiedades (invariante de clase),Sets no permite duplicados mientras que List sí los permite (por supuesto hay otras propiedades que ambos satisfacen).
ja: 別の例として、抽象データ型である Set of integers と List of integers を考えてみましょう。どちらも add(newValue)や size()のようなメソッドのセットをサポートしています。また、Setは重複を許さないのに対し、Listは重複を許します(もちろん、両者が満たすプロパティは他にもあります)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 예제를 제공하기 위해 추상 데이터 유형, 정수 세트 및 정수 목록에 대해 생각해보십시오. 보유 할 수있는 값은 정수로 제한됩니다. 둘 다 add (newValue) 및 size ()와 같은 일련의 메소드를 지원합니다. 그리고 둘 다 다른 속성을 가지고 있습니다 (클래스 불변) .Sets는 중복을 허용하지 않지만 List는 중복을 허용합니다 (물론 둘 다 만족하는 다른 속성이 있습니다).</font></font>
ru: Чтобы привести другой пример,подумайте об абстрактных типах данных,множестве целых чисел и списке целых чисел,значения,которые они могут держать,ограничены целыми числами.Оба они поддерживают набор методов,таких как add(newValue)и size().И оба они имеют различные свойства (класс инвариант),Множества не допускают дубликатов,в то время как Список допускает дубликаты (конечно,есть и другие свойства,которым они оба удовлетворяют).
zh_cn: 再举一个例子,想想看抽象的数据类型,Set of integers和List of integers,它们能持有的值都是限制在整数的。它们都支持一组方法,比如add(newValue)和size()。而且它们都有不同的属性(类不变性),Sets不允许重复,而List允许重复(当然还有其他属性,它们都满足)。

source: To subtype is to conform to a type signature, this means composition has always to expose no less amount of APIs of the type. Now the trade offs kick in:
es: Subtipo es conformarse a una firma de tipo,esto significa que la composición siempre tiene que exponer no menos cantidad de API del tipo.Ahora los intercambios se ponen en marcha:
ja: サブタイプにすることは型のシグネチャに従うことであり、これはコンポジションが常に型のAPIの量を減らさずに公開しなければならないことを意味します。ここでトレードオフの問題が出てきました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 타입은 타입 시그니처를 따르는 것인데, 이는 컴포지션이 항상 타입의 API를 최소한으로 노출시켜야한다는 것을 의미합니다. </font><font style="vertical-align: inherit;">이제 트레이드 오프가 시작됩니다.</font></font>
ru: Подтип должен соответствовать сигнатуре типа,это означает,что состав всегда должен раскрывать не меньшее количество API типа.Теперь начинаются компромиссы:
zh_cn: 子类型就是要符合一个类型签名,这就意味着组成必须暴露出不低于类型API的数量。现在,交易开始了。

source: To understand why "<em>prefer</em> composition over inheritance", we need first get back the assumption omitted in this shortened idiom.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para entender por qu&eacute; " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">preferir la</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> composici&oacute;n a la herencia", primero necesitamos recuperar la suposici&oacute;n omitida en este lenguaje abreviado.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「</font><font style="vertical-align: inherit;">継承</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成を</font><em><font style="vertical-align: inherit;">優先する</font></em><font style="vertical-align: inherit;">」理由を理解するには、</font><font style="vertical-align: inherit;">まず、この短縮されたイディオムで省略された仮定を取り戻す必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">왜 </font><font style="vertical-align: inherit;">상속보다 구성을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선호</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는지 이해하려면 </font><font style="vertical-align: inherit;">먼저이 단축 된 관용구에서 생략 된 가정을 되 찾아야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы понять, почему &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">предпочесть</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> композицию наследованию&raquo;, нам нужно сначала вернуться к предположению, опущенному в этой сокращенной идиоме.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要了解为什么&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">宁愿</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承而不愿继承&rdquo;，我们需要首先找回在这个简短成语中省略的假设。</font></font>

source: Unfortunately, the above test alone is not reliable. Use the following instead:
es: Desafortunadamente,la prueba anterior no es fiable por sí sola.Utilice lo siguiente en su lugar:
ja: 残念ながら、上記のテストだけでは信頼性がありません。代わりに以下を使用してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">불행히도, 위의 테스트만으로는 신뢰할 수 없습니다. </font><font style="vertical-align: inherit;">대신 다음을 사용하십시오.</font></font>
ru: К сожалению,вышеупомянутый тест сам по себе не является надежным.Вместо этого используйте следующее:
zh_cn: 遗憾的是,仅靠上述测试并不可靠。请用下面的方法来代替。

source: We discover that for just one of the classes that inherits from our base class we want the base class to behave a little differently. So now we go back and tinker with our base class, maybe adding some virtual methods, or even worse, some code that says, "If I'm inherited type A, do this, but if I'm inherited type B, do that." That's bad for lots of reasons. One is that every time we change the base class, we're effectively changing every inherited class. So we're really changing class A, B, C, and D because we need a slightly different behavior in class A. As careful as we think we are, we might break one of those classes for reasons that have nothing to do with those classes.
es: Descubrimos que por una sola de las clases que heredamos de nuestra clase base queremos que la clase base se comporte de manera un poco diferente.Así que ahora volvemos y jugueteamos con nuestra clase base,tal vez añadiendo algunos métodos virtuales,o incluso peor,algún código que diga,"Si he heredado el tipo A,haz esto,pero si he heredado el tipo B,haz aquello".Eso es malo por muchas razones.Una es que cada vez que cambiamos la clase base,estamos efectivamente cambiando cada clase heredada.Así que realmente estamos cambiando la clase A,B,C y D porque necesitamos un comportamiento ligeramente diferente en la clase A.Por muy cuidadosos que creamos que somos,podríamos romper una de esas clases por razones que no tienen nada que ver con esas clases.
ja: 基底クラスを継承しているクラスのうちの一つだけでも、基底クラスの動作を少し変えたいことに気がつきました。そこで、ベースクラスをいじり直して仮想メソッドを追加したり、さらに悪いことに、「私がA型を継承している場合はこれを実行し、B型を継承している場合はこれを実行する」というようなコードを追加したりします。これは多くの理由で良くありません。一つは、基底クラスを変更するたびに、継承されているすべてのクラスを事実上変更していることです。つまり、Aクラスで少し違った動作が必要だからといって、A,B,C,Dクラスを変更しているのです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 기본 클래스에서 상속받은 클래스 중 하나에 대해서만 기본 클래스가 약간 다르게 동작하기를 원한다는 것을 발견했습니다. 이제 기본 클래스로 돌아가서 약간의 가상 메소드를 추가하거나 더 나쁜 경우, "유형 A를 상속받은 경우, 이렇게하십시오. 그러나 B를 상속받은 경우에는 그렇게하십시오. " 여러 가지 이유로 나쁘다. 하나는 기본 클래스를 변경할 때마다 상속 된 모든 클래스를 효과적으로 변경한다는 것입니다. 우리는 클래스 A에서 약간 다른 행동이 필요하기 때문에 클래스 A, B, C 및 D를 실제로 변경하고 있습니다. 우리가 생각하는대로 조심스럽게 생각하면 클래스와 관련이없는 이유로 클래스 중 하나를 중단 할 수 있습니다 클래스.</font></font>
ru: Мы обнаружили,что только для одного из классов,который наследуется от нашего базового класса,мы хотим,чтобы базовый класс вел себя немного по-другому.Итак,теперь мы возвращаемся и работаем с нашим базовым классом,может быть,добавляем какие-нибудь виртуальные методы,или,что еще хуже,какой-нибудь код,который говорит:"Если я наследую тип A,сделайте это,но если я наследую тип B,то сделайте это".Это плохо по многим причинам.Одна из них заключается в том,что каждый раз,когда мы меняем базовый класс,мы эффективно меняем каждый наследуемый класс.Так что мы действительно меняем классы A,B,C и D,потому что нам нужно немного другое поведение в классе A.Как бы осторожно мы ни думали,мы можем сломать один из этих классов по причинам,которые не имеют никакого отношения к этим классам.
zh_cn: 我们发现,仅仅对于继承自基类的其中一个类,我们希望基类的行为有点不一样。所以现在我们回去修改我们的基类,也许会增加一些虚拟方法,或者更糟糕的是,一些代码说:"如果我是继承类型A,就做这个,但如果我是继承类型B,就做那个。" 这是很糟糕的,原因有很多。其中一个原因是,每当我们改变基类时,我们实际上就是在改变每一个继承类。所以,我们实际上是在改变A类、B类、C类和D类,因为我们需要A类中的行为略有不同。

source: We discover that there are some other functions that we want our classes to have. If the way that we add functionality to classes is through inheritance, we have to decide - do we add it to the existing base class, even though not every class that inherits from it needs that functionality? Do we create another base class? But what about classes that already inherit from the other base class?
es: Descubrimos que hay otras funciones que queremos que tengan nuestras clases.Si la forma en que añadimos funcionalidad a las clases es a través de la herencia,tenemos que decidir:¿la añadimos a la clase base existente,aunque no todas las clases que heredan de ella necesitan esa funcionalidad? ¿Creamos otra clase base? ¿Pero qué pasa con las clases que ya heredan de la otra clase base?
ja: 私たちは、クラスに持たせたい機能が他にもあることを発見しました。クラスに機能を追加する方法が継承によるものだとしたら、既存のベース・クラスに機能を追加するかどうかを決めなければなりません。別のベース・クラスを作成するのか?しかし、すでに他の基底クラスを継承しているクラスはどうでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 클래스가 갖고 싶은 다른 함수가 있다는 것을 발견했습니다. </font><font style="vertical-align: inherit;">클래스에 기능을 추가하는 방법이 상속을 통해 이루어지면 결정해야합니다. 상속을받는 모든 클래스가 해당 기능을 필요로하지 않더라도 기존 기본 클래스에 추가해야합니까? </font><font style="vertical-align: inherit;">다른 기본 클래스를 작성합니까? </font><font style="vertical-align: inherit;">그러나 다른 기본 클래스에서 이미 상속받은 클래스는 어떻습니까?</font></font>
ru: Мы обнаружили,что есть и другие функции,которые мы хотим,чтобы наши классы имели.Если способ,которым мы добавляем функциональность в классы,заключается в наследовании,то мы должны решить-добавляем ли мы ее в существующий базовый класс,хотя не каждый класс,который наследует от него,нуждается в такой функциональности? Создадим ли мы еще один базовый класс? Но как быть с классами,которые уже наследуются от другого базового класса?
zh_cn: 我们发现,还有一些其他的功能是我们希望我们的类能够拥有的。如果我们给类添加功能的方式是通过继承的方式,那么我们必须决定----即使不是每个继承的类都需要这个功能,我们是否要把它添加到现有的基类中?我们要不要再创建一个基类?但对于已经从另一个基类中继承的类呢?

source: We might know why we decided to make all of these classes inherit from each other, but it might not (probably won't) make sense to someone else who has to maintain our code. We might force them into a difficult choice - do I do something really ugly and messy to make the change I need (see the previous bullet point) or do I just rewrite a bunch of this.
es: Podríamos saber por qué decidimos hacer que todas estas clases se heredaran entre sí,pero podría no tener (probablemente no lo tendrá)sentido para alguien más que tiene que mantener nuestro código.Podríamos forzarlos a tomar una decisión difícil:¿hago algo realmente feo y desordenado para hacer el cambio que necesito (ver el punto anterior)o simplemente reescribo un montón de esto.
ja: これらのクラスをすべて互いに継承させることにした理由はわかるかもしれませんが、私たちのコードを保守しなければならない他の誰かにとっては意味がないかもしれません(おそらくそうならないでしょう)。私たちは彼らに難しい選択を迫るかもしれません-私が必要とする変更を行うために、本当に醜くて厄介なことをするか (前の箇条書きを参照してください)それともこれの束を書き換えるか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 왜 이러한 클래스를 모두 서로 상속하기로 결정했는지 알 수 있지만 코드를 유지 관리해야하는 다른 사람에게는 의미가 없을 수도 있습니다. </font><font style="vertical-align: inherit;">우리는 그것들을 어려운 선택으로 강요 할 수 있습니다. 내가 필요한 변화를 만들기 위해 정말 못 생겼고 지저분한 일을합니까 (이전 글 머리표 참조).</font></font>
ru: Возможно,мы знаем,почему решили сделать все эти классы наследственными друг от друга,но это может не иметь смысла (вероятно,не будет)для кого-то другого,кто должен поддерживать наш код.Мы можем заставить их сделать трудный выбор-сделать что-то действительно уродливое и грязное,чтобы внести необходимые изменения (см.предыдущий пункт)или просто переписать кучу всего этого.
zh_cn: 我们可能知道为什么我们决定让所有这些类相互继承,但对于必须维护我们的代码的其他人来说,这可能并不(可能不会)有意义。我们可能会迫使他们陷入一个艰难的选择--我是做一些非常丑陋和混乱的事情来实现我所需要的改变(见前面的弹出点),还是直接重写一堆这样的东西。

source: What do you think about this approach?
es: ¿Qué piensas de este enfoque?
ja: このアプローチについてどう思いますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 접근법에 대해 어떻게 생각하십니까?</font></font>
ru: Что ты думаешь об этом подходе?
zh_cn: 对于这种做法,你怎么看?

source: When can you use inheritance?
es: ¿Cuándo puedes usar la herencia?
ja: 相続はどんな時に使えるの?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 언제 사용할 수 있습니까?</font></font>
ru: Когда вы можете использовать наследство?
zh_cn: 什么时候可以使用继承?

source: When should you use inheritance?
es: ¿Cuándo se debe usar la herencia?
ja: 相続はいつ使うべきか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 언제 사용해야합니까?</font></font>
ru: Когда вы должны использовать наследство?
zh_cn: 什么时候应该使用继承?

source: When we say that the number 5 is of type integer, we are stating that 5 belongs to a set of possible values (as an example, see the possible values for the Java primitive types). We are also stating that there is a valid set of methods I can perform on the value like addition and subtraction. And finally we are stating that there are a set of properties that are always satisfied, for example, if I add the values 3 and 5, I will get 8 as a result.
es: Cuando decimos que el número 5 es de tipo entero,estamos afirmando que el 5 pertenece a un conjunto de valores posibles (como ejemplo,ver los valores posibles para los tipos primitivos de Java).También estamos afirmando que hay un conjunto válido de métodos que puedo realizar sobre el valor como la suma y la resta.Y finalmente estamos afirmando que hay un conjunto de propiedades que siempre se satisfacen,por ejemplo,si sumo los valores 3 y 5,obtendré 8 como resultado.
ja: 数5が整数型であると言うとき、5は可能な値のセットに属していることを述べています(例として、Javaのプリミティブ型の可能な値を参照してください)。また、足し算や引き算のように、値に対して実行できるメソッドの有効なセットがあることを示しています。そして最後に、常に満たされるプロパティのセットがあることを述べています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">숫자 5가 정수 유형이라고 할 때 5는 가능한 값 세트에 속한다고합니다 (예를 들어, Java 기본 유형의 가능한 값 참조). </font><font style="vertical-align: inherit;">또한 덧셈과 뺄셈과 같은 값으로 수행 할 수있는 유효한 방법이 있다고 말하고 있습니다. </font><font style="vertical-align: inherit;">마지막으로 우리는 항상 만족하는 속성 세트가 있다고 말하고 있습니다. 예를 들어 값 3과 5를 추가하면 결과적으로 8이됩니다.</font></font>
ru: Когда мы говорим,что число 5-целое число,мы утверждаем,что 5 принадлежит к набору возможных значений (в качестве примера см.возможные значения для Java-примитивных типов).Мы также заявляем,что существует допустимый набор методов,которые я могу выполнить для таких значений,как сложение и вычитание.И,наконец,мы утверждаем,что существует набор свойств,которые всегда удовлетворяют меня,например,если я добавлю значения 3 и 5,то в результате получу 8.
zh_cn: 当我们说数字5是整数类型时,我们是在说明5属于一个可能的值集(作为一个例子,请看Java基元类型的可能值)。我们也是在说明有一组有效的方法可以对这个值执行加法和减法等方法。最后我们声明有一组属性总是满足的,例如,如果我把值3和5相加,就会得到8作为结果。
