Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Composition has the benefit of <a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators">combinator-oriented</a> programming, i.e. working in a way like the <a href="https://en.wikipedia.org/wiki/Composite_pattern#Java">composite pattern</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n tiene el beneficio de </font></font><a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> programaci&oacute;n </font><font style="vertical-align: inherit;">orientada al combinador</font><font style="vertical-align: inherit;"> , es decir, funciona de manera similar al </font></font><a href="https://en.wikipedia.org/wiki/Composite_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">patr&oacute;n compuesto</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">合成には、</font></font><a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンビネータ指向の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プログラミングの</font><font style="vertical-align: inherit;">利点があり</font><font style="vertical-align: inherit;">ます。つまり、</font></font><a href="https://en.wikipedia.org/wiki/Composite_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンポジットパターンの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ように機能し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션은 컴비 네이터 </font></font><a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지향</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 프로그래밍, 즉 </font></font><a href="https://en.wikipedia.org/wiki/Composite_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복합 패턴</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 같은 방식으로 작업 </font><font style="vertical-align: inherit;">하는 이점이 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Композиция имеет преимущество </font></font><a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">комбинаторно-ориентированного</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> программирования, то есть работает как </font></font><a href="https://en.wikipedia.org/wiki/Composite_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">составной шаблон</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合的好处是</font></font><a href="http://www.codecommit.com/blog/scala/the-magic-behind-parser-combinators"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">面向组合</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">程序的编程，即以类似于</font></font><a href="https://en.wikipedia.org/wiki/Composite_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">复合模式</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的方式工作</font><font style="vertical-align: inherit;">。</font></font>

source: Composition has the benefit of easy <a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance">multiple inheritance</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n tiene el beneficio de una </font></font><a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">herencia m&uacute;ltiple</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> f&aacute;cil </font><font style="vertical-align: inherit;">.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成には、</font></font><a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多重継承</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が容易であるという利点があり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션은 </font></font><a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다중 상속</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 용이 </font><font style="vertical-align: inherit;">하다는</font><font style="vertical-align: inherit;"> 이점이 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Преимущество композиции заключается в легком </font></font><a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">множественном наследовании</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合具有易于</font></font><a href="https://stackoverflow.com/questions/3556652/how-do-java-interfaces-simulate-multiple-inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多重继承</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的优点</font><font style="vertical-align: inherit;">。</font></font>

source: Composition immediately follows <a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface">programming to an interface</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n sigue inmediatamente a la </font></font><a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">programaci&oacute;n a una interfaz</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成は</font></font><a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、インターフェイスへのプログラミングの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直後に続き</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션 </font></font><a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은 인터페이스에 대한 프로그래밍을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 즉시 따릅니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Композиция сразу следует за </font></font><a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">программированием интерфейса</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/383947/what-does-it-mean-to-program-to-an-interface"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编写之后</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">立即</font><font style="vertical-align: inherit;">编写接口</font><font style="vertical-align: inherit;">。</font></font>

source: Composition is favoured over inheritance. To put it very simply you would have:
es: La composición se favorece sobre la herencia.Para decirlo de forma muy simple,lo habrías hecho:
ja: 相続よりも構成が有利です。非常に簡単に言えば あなたは持っているでしょう
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속보다 구성이 선호됩니다. </font><font style="vertical-align: inherit;">간단히 말하면 다음과 같습니다.</font></font>
ru: Составу отдается предпочтение перед наследством.Проще говоря,вы бы так и сделали:
zh_cn: 组成是偏向于继承的。说得很简单,你会有:

source: Composition is just playing it modular: you create interface similar to the parent class, create new object and delegate calls to it. If these objects need not to know of each other, it's quite safe and easy to use composition. There are so many possibilites here.
es: La composición es simplemente modular:se crea una interfaz similar a la de la clase padre,se crea un nuevo objeto y se delegan las llamadas a él.Si estos objetos no necesitan conocerse entre sí,es bastante seguro y fácil de usar la composición.Hay tantas posibilidades aquí.
ja: コンポジションとは、単にそれをモジュール化して遊ぶことです:あなたは親クラスに似たインターフェイスを作成し、新しいオブジェクトを作成し、それに呼び出しを委任します。これらのオブジェクトがお互いを知る必要がない場合、それは非常に安全で簡単に作曲を使用することができます。ここには非常に多くの可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션은 모듈 식으로 재생됩니다. 부모 클래스와 유사한 인터페이스를 만들고 새 객체를 만들고 호출을 위임합니다. </font><font style="vertical-align: inherit;">이러한 객체가 서로를 알 필요가 없다면 구성이 매우 안전하고 사용하기 쉽습니다. </font><font style="vertical-align: inherit;">여기에는 많은 가능성이 있습니다.</font></font>
ru: Композиция просто играет на модульной основе:вы создаете интерфейс,похожий на родительский класс,создаете новый объект и делегируете ему вызовы.Если этим объектам не нужно знать друг о друге,то композиция достаточно безопасна и проста в использовании.Здесь так много возможностей.
zh_cn: 组成只是发挥它的模块化:你创建类似于父类的接口,创建新的对象,并对其进行委托调用。如果这些对象不需要互相不知道,那么使用Composition是相当安全和容易的。这里有很多的可能性。

source: Composition is often more logical, it provides better abstraction, better encapsulation, better code reuse (especially in very large projects) and is less likely to break anything at a distance just because you made an isolated change anywhere in your code. It also makes it easier to uphold the "<em>Single Responsibility Principle</em>", which is often summarized as "<em>There should never be more than one reason for a class to change.</em>", and it means that every class exists for a specific purpose and it should only have methods that are directly related to its purpose. Also having a very shallow inheritance tree makes it much easier to keep the overview even when your project starts to get really large. Many people think that inheritance represents our <em>real world</em> pretty well, but that isn't the truth. The real world uses much more composition than inheritance. Pretty much every real world object you can hold in your hand has been composed out of other, smaller real world objects.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n a menudo es m&aacute;s l&oacute;gica, proporciona una mejor abstracci&oacute;n, una mejor encapsulaci&oacute;n, una mejor reutilizaci&oacute;n del c&oacute;digo (especialmente en proyectos muy grandes) y es menos probable que rompa algo a distancia solo porque realiz&oacute; un cambio aislado en cualquier parte de su c&oacute;digo. Tambi&eacute;n facilita la defensa del " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Principio de responsabilidad &uacute;nica</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ", que a menudo se resume como " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nunca debe haber m&aacute;s de una raz&oacute;n para que una clase cambie</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ", y significa que cada clase existe para un prop&oacute;sito espec&iacute;fico y debe solo tiene m&eacute;todos que est&aacute;n directamente relacionados con su prop&oacute;sito. Adem&aacute;s, tener un &aacute;rbol de herencia muy superficial hace que sea mucho m&aacute;s f&aacute;cil mantener la visi&oacute;n general incluso cuando su proyecto comienza a ser realmente grande. Mucha gente piensa que la herencia representa nuestro </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mundo real</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bastante bien, pero esa no es la verdad. </font><font style="vertical-align: inherit;">El mundo real usa mucha m&aacute;s composici&oacute;n que herencia. </font><font style="vertical-align: inherit;">Casi todos los objetos del mundo real que puedes sostener en tu mano se han compuesto de otros objetos m&aacute;s peque&ntilde;os del mundo real.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">多くの場合、コンポジションはより論理的であり、抽象化、カプセル化、コードの再利用が向上し（特に非常に大規模なプロジェクトで）、コードのどこかに孤立した変更を加えたという理由だけで、離れたところにあるものを壊す可能性が低くなります。また、「</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">単一の責任の原則</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">」</font><font style="vertical-align: inherit;">を支持することが容易になり</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、「</font><em><font style="vertical-align: inherit;">クラスが変更される理由は1つ以上あるべきではありません。</font></em><font style="vertical-align: inherit;">」と</font><font style="vertical-align: inherit;">まとめられる</font><em><font style="vertical-align: inherit;">ことが多く</font></em><font style="vertical-align: inherit;">、すべてのクラスが特定の目的のために存在し、その目的に直接関連するメソッドのみを持っています。また、継承ツリーが非常に浅いため、プロジェクトが非常に大きくなり始めたときでも、概要を簡単に維持できます。多くの人々は、継承は私たちの</font><em><font style="vertical-align: inherit;">現実の世界を</font></em><font style="vertical-align: inherit;">表すと考えてい</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">結構ですが、それは真実ではありません。</font><font style="vertical-align: inherit;">現実の世界では、継承よりもはるかに多くの構成を使用しています。</font><font style="vertical-align: inherit;">手に持つことができるほとんどすべての実世界のオブジェクトは、他のより小さな実世界のオブジェクトから構成されています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션은 종종보다 논리적이며, 더 나은 추상화, 더 나은 캡슐화, 더 나은 코드 재사용 (특히 대규모 프로젝트에서)을 제공하며 코드의 어느 곳에서든 고립 된 변경을 수행했기 때문에 멀리서도 문제가 발생하지 않습니다. 또한 " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 책임 원칙</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "을 </font><font style="vertical-align: inherit;">보다 쉽게지지 할 수 있습니다. " </font><em><font style="vertical-align: inherit;">단일 책임 원칙</font></em><font style="vertical-align: inherit;"> "은 종종 " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">교실이 바뀌어야 할 이유가 두 개 이상 있어야합니다.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "로 요약됩니다 </font><em><font style="vertical-align: inherit;">.</font></em><font style="vertical-align: inherit;"> 이는 모든 학급이 특정 목적을 위해 존재하며 목적과 직접 관련된 방법 만 있습니다. 또한 매우 얕은 상속 트리를 사용하면 프로젝트가 실제로 커지기 시작할 때에도 개요를 훨씬 쉽게 유지할 수 있습니다. 많은 사람들은 상속이 우리의 </font><em><font style="vertical-align: inherit;">실제 세계를</font></em><font style="vertical-align: inherit;"> 대표한다고 생각합니다</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">꽤 잘하지만 그것은 사실이 아닙니다. </font><font style="vertical-align: inherit;">실제 세계는 상속보다 훨씬 더 많은 구성을 사용합니다. </font><font style="vertical-align: inherit;">당신이 손에 쥐고있을 수있는 거의 모든 실제 물체는 다른 작은 실제 물체로 구성되어 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Композиция часто более логична, она обеспечивает лучшую абстракцию, лучшую инкапсуляцию, лучшее повторное использование кода (особенно в очень больших проектах) и с меньшей вероятностью что-либо сломает на расстоянии только потому, что вы сделали изолированное изменение в любом месте вашего кода. Это также облегчает соблюдение &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Принципа единой ответственности</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;, который часто резюмируется как &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">У класса никогда не должно быть более одной причины для изменения</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;. Это означает, что каждый класс существует для определенной цели, и он должен есть только методы, которые напрямую связаны с его целью. Кроме того, наличие очень мелкого дерева наследования значительно упрощает обзор, даже когда ваш проект начинает становиться действительно большим. Многие люди думают, что наследство представляет наш </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">реальный мир</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">довольно хорошо, но это не правда. </font><font style="vertical-align: inherit;">Реальный мир использует гораздо больше композиции, чем наследования. </font><font style="vertical-align: inherit;">Практически каждый объект реального мира, который вы можете держать в руке, был составлен из других, меньших объектов реального мира.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组合通常更合乎逻辑，它提供了更好的抽象，更好的封装，更好的代码重用（尤其是在非常大的项目中），并且几乎不会因为在代码中的任何地方进行孤立的更改而在远处破坏任何东西。这也使坚持&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">单一责任原则</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo; </font><font style="vertical-align: inherit;">变得更加容易，该</font><em><font style="vertical-align: inherit;">原则</font></em><font style="vertical-align: inherit;">通常被总结为&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个类别发生变化的原因绝不应该有一个以上。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;，这意味着每个类别都出于特定的目的而存在，并且应该仅具有与其目的直接相关的方法。另外，由于继承树很浅，即使您的项目开始变得很大，也更容易保留概述。许多人认为继承代表了我们的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现实世界</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很好，但这不是事实。</font><font style="vertical-align: inherit;">现实世界中使用的构成多于继承。</font><font style="vertical-align: inherit;">几乎可以握在手中的每个现实对象都是由其他较小的现实对象组成的。</font></font>

source: Composition is typically "has a" or "uses a" relationship. Here the Employee class has a Person. It does not inherit from Person but instead gets the Person object passed to it, which is why it "has a" Person.
es: La composición es típicamente "tiene una" o "usa una" relación.Aquí la clase de empleados tiene una persona.No hereda de la Persona,sino que le pasa el objeto Persona,por lo que "tiene una" Persona.
ja: 組成は通常、"have a" または "uses a" の関係です。ここでは、Employee クラスは Person を持っています。これは Person を継承するのではなく、Person オブジェクトが渡されているので、Person を "持っている" のです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성은 일반적으로 "있다"또는 "사용"관계입니다. </font><font style="vertical-align: inherit;">여기 Employee 클래스에는 Person이 있습니다. </font><font style="vertical-align: inherit;">Person으로부터 상속받지 않고 대신 Person 오브젝트를 전달받습니다. 이것이 "Person"을 갖는 이유입니다.</font></font>
ru: Композиция,как правило,"имеет" или "использует" отношения.Здесь у класса "Сотрудник" есть Человек.Он не наследует от Человека,а вместо этого получает переданный ему объект Человек,вот почему он "имеет" Человек.
zh_cn: 构成一般是 "有一个 "或 "使用一个 "的关系。这里的Employee类有一个Person。它不从Person继承,而是获得传递给它的Person对象,这就是它 "有一个 "Person的原因。

source: Composition over Inheritance
es: Composición sobre la herencia
ja: 継承を超えた構図
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속에 대한 구성</font></font>
ru: Состав по наследству
zh_cn: 继承权的组成
