Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The issue with inheritance is that it can be used for two orthogonal purposes:
es: El problema con la herencia es que puede ser utilizada para dos propósitos ortogonales:
ja: 相続の問題点は、直交する2つの目的に使えるかどうかです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속 문제는 두 가지 직교 목적으로 사용할 수 있다는 것입니다.</font></font>
ru: Проблема с наследованием заключается в том,что его можно использовать для двух ортогональных целей:
zh_cn: 继承的问题在于,它可以用于两个正交的目的。

source: The main reason for using inheritance is not as a form of composition - it is so you can get polymorphic behaviour. If you don't need polymorphism, you probably should not be using inheritance.
es: La razón principal para usar la herencia no es como una forma de composición-es para que puedas obtener un comportamiento polimórfico.Si no necesitas polimorfismo,probablemente no deberías usar la herencia.
ja: 継承を使う主な理由は、構成の形式としてではなく、多相性のある振る舞いを得るためです。多相性を必要としないのであれば、継承を使うべきではないでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 사용하는 주된 이유는 구성의 형태가 아니기 때문에 다형성 동작을 얻을 수 있기 때문입니다. </font><font style="vertical-align: inherit;">다형성이 필요하지 않으면 상속을 사용하지 않아야합니다.</font></font>
ru: Основная причина использования наследования не в форме композиции,а в том,чтобы получить полиморфное поведение.Если вам не нужен полиморфизм,то,скорее всего,вам не стоит использовать наследование.
zh_cn: 使用继承的主要原因不是作为一种组成形式,而是为了让你可以获得多态性。如果你不需要多态性,你可能不应该使用继承。

source: The tight coupling provided by inheritance makes the implementation of a subclass very bound up with the implementation of a super class that any change in the parent implementation will force the sub class to change.
es: El estrecho acoplamiento proporcionado por la herencia hace que la implementación de una subclase esté muy ligada a la implementación de una superclase que cualquier cambio en la implementación de los padres obligará a la subclase a cambiar.
ja: 継承によって提供されるタイトな結合は、親の実装の任意の変更がサブクラスの変更を強制するスーパークラスの実装と非常にバインドされています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속에 의해 제공되는 긴밀한 결합은 서브 클래스의 구현이 상위 클래스의 구현과 매우 밀접한 관계가되므로 상위 구현의 변경으로 인해 서브 클래스가 변경됩니다.</font></font>
ru: Тесная связь,обеспечиваемая наследованием,делает реализацию подкласса очень тесно связанной с реализацией суперкласса,что любое изменение в родительской реализации заставит подкласс измениться.
zh_cn: 继承所提供的紧密耦合性使得子类的实现与超类的实现非常绑定,父类实现的任何改变都会迫使子类改变。

source: Then there are two ways to design an aircraft class.
es: Entonces hay dos maneras de diseñar una clase de avión.
ja: そうなると、航空機のクラスを設計するには2つの方法があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 항공기 클래스를 설계하는 두 가지 방법이 있습니다.</font></font>
ru: Тогда есть два способа спроектировать класс самолета.
zh_cn: 那么,设计一个飞机级别有两种方法。

source: Then, I write the Set of integers as a subclass of the List of integers:
es: Entonces,escribo el Conjunto de números enteros como una subclase de la Lista de números enteros:
ja: そして、整数の集合を整数のリストのサブクラスとして書きます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 정수 목록을 정수 목록의 하위 클래스로 작성합니다.</font></font>
ru: Затем я пишу Множество целых чисел как подкласс Списка целых чисел:
zh_cn: 那么,我把整数集写成了整数列表的子类。

source: There are downsides of composition, though. If you skip inheritance altogether and only focus on composition, you will notice that you often have to write a couple of extra code lines that weren't necessary if you had used inheritance. You are also sometimes forced to repeat yourself and this violates the <em>DRY Principle</em> (DRY = Don't Repeat Yourself). Also composition often requires delegation, and a method is just calling another method of another object with no other code surrounding this call. Such "double method calls" (which may easily extend to triple or quadruple method calls and even farther than that) have much worse performance than inheritance, where you simply inherit a method of your parent. Calling an inherited method may be equally fast as calling a non-inherited one, or it may be slightly slower, but is usually still faster than two consecutive method calls.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, hay desventajas en la composici&oacute;n. </font><font style="vertical-align: inherit;">Si omite la herencia por completo y solo se enfoca en la composici&oacute;n, notar&aacute; que a menudo tiene que escribir un par de l&iacute;neas de c&oacute;digo adicionales que no ser&iacute;an necesarias si hubiera utilizado la herencia. </font><font style="vertical-align: inherit;">A veces tambi&eacute;n se ve obligado a repetir y esto viola el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Principio DRY</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(SECO = No te repitas). </font><font style="vertical-align: inherit;">Adem&aacute;s, la composici&oacute;n a menudo requiere delegaci&oacute;n, y un m&eacute;todo simplemente llama a otro m&eacute;todo de otro objeto sin ning&uacute;n otro c&oacute;digo que rodea esta llamada. </font><font style="vertical-align: inherit;">Estas "llamadas de m&eacute;todo doble" (que pueden extenderse f&aacute;cilmente a llamadas de m&eacute;todo triple o cu&aacute;druple e incluso m&aacute;s all&aacute; de eso) tienen un rendimiento mucho peor que la herencia, donde simplemente hereda un m&eacute;todo de sus padres. </font><font style="vertical-align: inherit;">Llamar a un m&eacute;todo heredado puede ser tan r&aacute;pido como llamar a uno no heredado, o puede ser un poco m&aacute;s lento, pero generalmente es a&uacute;n m&aacute;s r&aacute;pido que dos llamadas a m&eacute;todos consecutivos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、構成には欠点があります。</font><font style="vertical-align: inherit;">継承を完全にスキップして構成のみに焦点を合わせると、継承を使用した場合には不要だった追加のコード行を2、3記述しなければならないことがよくあります。</font><font style="vertical-align: inherit;">あなたは時々自分自身を繰り返すことを余儀なくされ、これは</font><em><font style="vertical-align: inherit;">DRY原則に</font></em><font style="vertical-align: inherit;">違反します</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（DRY =自分を繰り返さないでください）。</font><font style="vertical-align: inherit;">また、合成には委任が必要な場合が多く、メソッドは別のオブジェクトの別のメソッドを呼び出すだけで、この呼び出しを囲む他のコードはありません。</font><font style="vertical-align: inherit;">このような「二重メソッド呼び出し」（これは、3倍または4倍のメソッド呼び出しに簡単に拡張でき、さらにそれよりも遠い可能性があります）は、単純に親のメソッドを継承する継承よりもパフォーマンスがはるかに劣ります。</font><font style="vertical-align: inherit;">継承されたメソッドの呼び出しは、継承されていないメソッドの呼び出しと同じくらい高速かもしれませんし、少し遅いかもしれませんが、通常、2つの連続したメソッド呼び出しよりも高速です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 구성에는 단점이 있습니다. </font><font style="vertical-align: inherit;">상속을 완전히 건너 뛰고 컴포지션에만 중점을두면 상속을 사용하는 경우 필요하지 않은 몇 가지 추가 코드 줄을 작성해야하는 경우가 종종 있습니다. </font><font style="vertical-align: inherit;">당신은 또한 때때로 자신을 반복하도록 강요받으며 이것은 </font><em><font style="vertical-align: inherit;">건조 원리를</font></em><font style="vertical-align: inherit;"> 위반합니다</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(건조 = 자신을 반복하지 마십시오). 또한 컴포지션에는 종종 위임이 필요하며 메서드는이 호출을 둘러싼 다른 코드없이 다른 객체의 다른 메서드를 호출합니다. 이러한 "이중 메서드 호출"(트리플 또는 쿼드 러플 메서드 호출로 쉽게 확장 될 수 있으며 그보다 훨씬 큼)은 상속하는 것보다 성능이 훨씬 나빠 부모의 메서드를 상속합니다. 상속 된 메소드를 호출하는 것은 상속되지 않은 메소드를 호출하는 것과 똑같이 빠르거나 약간 느릴 수 있지만 일반적으로 두 번의 연속 메소드 호출보다 여전히 빠릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Хотя есть и недостатки в композиции. </font><font style="vertical-align: inherit;">Если вы вообще пропустите наследование и сконцентрируетесь только на композиции, вы заметите, что вам часто приходится писать пару дополнительных строк кода, в которых не было необходимости, если вы использовали наследование. </font><font style="vertical-align: inherit;">Вы также иногда вынуждены повторяться, и это нарушает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принцип СУХОГО</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(СУХОЙ = Не повторяйся). </font><font style="vertical-align: inherit;">Также состав часто требует делегирования, и метод просто вызывает другой метод другого объекта без какого-либо другого кода, окружающего этот вызов. </font><font style="vertical-align: inherit;">Такие &laquo;двойные вызовы методов&raquo; (которые могут легко распространяться на тройные или четырехкратные вызовы методов и даже дальше) имеют гораздо худшую производительность, чем наследование, когда вы просто наследуете метод своего родителя. </font><font style="vertical-align: inherit;">Вызов унаследованного метода может быть таким же быстрым, как и вызов не унаследованного, или немного медленнее, но обычно все же быстрее, чем два последовательных вызова метода.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，在组合方面也有缺点。</font><font style="vertical-align: inherit;">如果您完全跳过继承而只关注合成，您会发现您经常不得不编写一些额外的代码行，如果您使用了继承，则这些代码行是不必要的。</font><font style="vertical-align: inherit;">您有时还被迫重复自己，这违反了</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DRY原则</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（干=不要重复自己）。</font><font style="vertical-align: inherit;">同样，合成通常需要委托，而一个方法只是调用另一个对象的另一个方法，而此调用周围没有其他代码。</font><font style="vertical-align: inherit;">这样的&ldquo;双重方法调用&rdquo;（可能会很容易地扩展到三重或四重方法调用，甚至更远），其性能比继承要差得多，在继承中，您仅继承父方法。</font><font style="vertical-align: inherit;">调用继承的方法可能与调用非继承的方法一样快，或者可能稍慢一些，但通常仍比两个连续的方法调用快。</font></font>

source: There are two benefits of inheritance: <a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html">subtyping and subclassing</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay dos beneficios de la herencia: </font></font><a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subtipificaci&oacute;n y subclasificaci&oacute;n.</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承には2つの利点があります。</font></font><a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブタイピングとサブクラス化です。</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속의 두 가지 이점이 있습니다 : </font></font><a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 타이핑 및 서브 클래 싱</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть два преимущества наследования: </font></font><a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подтип и подклассы</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承有两个好处：</font></font><a href="https://www.cs.princeton.edu/courses/archive/fall98/cs441/mainus/node12.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子类型化和子类化</font></font></a>

source: There is nothing bad in using reason 1, it is very good thing to have a solid interface on your objects. This can be done using composition or with inheritance, no problem - if this interface is simple and does not change. Usually inheritance is quite effective here.
es: No hay nada malo en usar la razón 1,es muy bueno tener una interfaz sólida en tus objetos.Esto se puede hacer usando la composición o con la herencia,no hay problema-si esta interfaz es simple y no cambia.Normalmente la herencia es bastante efectiva aquí.
ja: 理由1を使用して悪いことは何もありません、それはあなたのオブジェクトに固体のインターフェイスを持っていることは非常に良いことです。これは、コンポジションを使用して行うことができますし、継承を使用しても問題はありません-このインターフェイスがシンプルで変更されない場合。通常、継承はここでは非常に効果的です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이유 1을 사용하는 것은 나쁘지 않습니다. 객체에 견고한 인터페이스를 갖는 것이 좋습니다. </font><font style="vertical-align: inherit;">이 인터페이스가 단순하고 변경되지 않는 경우 구성을 사용하거나 상속없이 문제없이 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">일반적으로 상속은 여기서 매우 효과적입니다.</font></font>
ru: Нет ничего плохого в использовании причины 1,очень хорошо иметь надежный интерфейс на ваших объектах.Это можно сделать с помощью композиции или с помощью наследования,без проблем-если этот интерфейс прост и не меняется.Обычно здесь наследование достаточно эффективно.
zh_cn: 使用理由1并没有什么不好,在你的对象上有一个稳固的接口是非常好的事情。这可以通过使用组成或继承来实现,没有问题--如果这个接口很简单,而且不会改变的话。通常情况下,继承在这里是相当有效的。

source: These two ways can live together just fine and actually support each other.
es: Estas dos formas pueden vivir juntas muy bien y apoyarse mutuamente.
ja: この2つの方法でちょうどいい感じに同居できて、実際に支え合うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 두 가지 방법은 함께 잘 살 수 있고 실제로 서로를 지원할 수 있습니다.</font></font>
ru: Эти два способа могут прекрасно жить вместе и фактически поддерживать друг друга.
zh_cn: 这两种方式在一起生活就好,实际上是可以互相扶持的。

source: Think of containment as a <strong>has a</strong> relationship. A car "has an" engine, a person "has a" name, etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Piense en la contenci&oacute;n como en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> relaci&oacute;n. </font><font style="vertical-align: inherit;">Un autom&oacute;vil "tiene un" motor, una persona "tiene un" nombre, etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">封じ込めに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係があると</font><font style="vertical-align: inherit;">考えてください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">車にはエンジンがあり、人には名前があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">격리 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 관계 </font><strong><font style="vertical-align: inherit;">가</font></strong><font style="vertical-align: inherit;"> 있다고 생각하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">자동차에는 "엔진", 사람에는 "이름"등이 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Думайте о сдерживании как </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">об</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отношениях. </font><font style="vertical-align: inherit;">У автомобиля "есть" двигатель, у человека "есть" имя и т. Д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将遏制视为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关系。</font><font style="vertical-align: inherit;">汽车&ldquo;具有&rdquo;引擎，人&ldquo;具有&rdquo;名称，等等。</font></font>

source: Think of inheritance as an <strong>is a</strong> relationship. A car "is a" vehicle, a person "is a" mammal, etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Piense en la herencia como una </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es una</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> relaci&oacute;n. </font><font style="vertical-align: inherit;">Un autom&oacute;vil "es un" veh&iacute;culo, una persona "es un" mam&iacute;fero, etc.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係で</font><font style="vertical-align: inherit;">ある</font><strong><font style="vertical-align: inherit;">と</font></strong><font style="vertical-align: inherit;">考えてください</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">車は乗り物であり、人は哺乳類である、など。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 관계 </font><font style="vertical-align: inherit;">라고 생각하십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">자동차는 "차량", 사람은 "동물"등</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подумайте о наследовании как </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> взаимоотношения. </font><font style="vertical-align: inherit;">Автомобиль &raquo;- это&laquo; транспортное средство, человек &raquo;- это&laquo; млекопитающее &raquo;и т. Д.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">想继承的作为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是一个</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关系。</font><font style="vertical-align: inherit;">汽车&ldquo;是&rdquo;车辆，人&ldquo;是&rdquo;哺乳动物，等等。</font></font>

source: This encourages the use of classes. Inheritance is one of the three tenets of OO design (inheritance, polymorphism, encapsulation).
es: Esto fomenta el uso de las clases.La herencia es uno de los tres principios del diseño de OO (herencia,polimorfismo,encapsulación).
ja: これはクラスの使用を奨励している。継承は、OOデザインの3つの信条(継承、ポリモーフィズム、カプセル化)の1つです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 클래스 사용을 권장합니다. </font><font style="vertical-align: inherit;">상속은 OO 디자인의 세 가지 신조 중 하나입니다 (상속, 다형성, 캡슐화).</font></font>
ru: Это поощряет использование классов.Наследование является одним из трех принципов проектирования ОО (наследование,полиморфизм,капсулирование).
zh_cn: 这就鼓励了类的使用。继承是OO设计的三大原则(继承、多态、封装)之一。

source: This example will work fine, however, what if Person and Employee both declared <code>Title</code>? Should Manager.Title return "Manager of Operations" or "Mr."? Under composition this ambiguity is better handled:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Este ejemplo funcionar&aacute; bien, sin embargo, &iquest;qu&eacute; pasa si la Persona y el Empleado declararon el </font></font> <code>Title</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">&iquest;Deber&iacute;a Manager.Title devolver "Manager of Operations" o "Mr."? </font><font style="vertical-align: inherit;">Bajo composici&oacute;n, esta ambig&uuml;edad se maneja mejor:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この例は正常に機能しますが、PersonとEmployeeの両方が</font></font> <code>Title</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">宣言した場合はどうなり</font><font style="vertical-align: inherit;">ますか？</font><font style="vertical-align: inherit;">Manager.Titleは「Manager of Operations」または「Mr.」を返す必要がありますか？</font><font style="vertical-align: inherit;">構成の下では、このあいまいさはより適切に処理されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나이 예제는 제대로 작동하지만 Person과 Employee가 모두 </font></font> <code>Title</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 선언하면 </font><font style="vertical-align: inherit;">어떻게됩니까? </font><font style="vertical-align: inherit;">Manager.Title이 "Manager of Operations"또는 "Mr."를 반환해야합니까? </font><font style="vertical-align: inherit;">구성에서이 모호성은 더 잘 처리됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот пример будет работать нормально, однако, что, если Person и Employee оба объявили </font></font> <code>Title</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">Должен ли Manager.Title вернуть &laquo;Менеджер операций&raquo; или &laquo;Мистер&raquo;? </font><font style="vertical-align: inherit;">По составу эта двусмысленность лучше решается:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">此示例可以正常工作，但是，如果Person和Employee都声明</font></font> <code>Title</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">怎么办？</font><font style="vertical-align: inherit;">Manager.Title是否应返回&ldquo;运营经理&rdquo;或&ldquo;先生&rdquo;？</font><font style="vertical-align: inherit;">在组成下，这种歧义可以更好地解决：</font></font>

source: This is a classic example of an improper use of inheritance. Use composition in this case.
es: Este es un ejemplo clásico de un uso inadecuado de la herencia.Utilice la composición en este caso.
ja: これは、継承の不適切な使用の典型的な例です。この場合はコンポジションを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 상속의 부적절한 사용에 대한 전형적인 예입니다. </font><font style="vertical-align: inherit;">이 경우 컴포지션을 사용하십시오.</font></font>
ru: Это классический пример неправильного использования наследства.В данном случае используйте состав.
zh_cn: 这是一个典型的继承使用不当的例子。在这种情况下,使用组成。
