Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Composition should be used when you do not need the new class to have the same interface, i.e. you wish to conceal certain aspects of the class' implementation which the user of that class need not know about. So composition is more in the way of supporting <em>encapsulation</em> (i.e. concealing the implementation) while inheritance is meant to support <em>abstraction</em> (i.e. providing a simplified representation of something, in this case the <strong>same</strong> interface for a range of types with different internals).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n debe usarse cuando no necesita que la nueva clase tenga la misma interfaz, es decir, desea ocultar ciertos aspectos de la implementaci&oacute;n de la clase que el usuario de esa clase no necesita conocer. </font><font style="vertical-align: inherit;">Por lo tanto, la composici&oacute;n es m&aacute;s compatible con la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">encapsulaci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (es decir, ocultando la implementaci&oacute;n), mientras que la herencia est&aacute; destinada a admitir la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">abstracci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (es decir, proporcionar una representaci&oacute;n simplificada de algo, en este caso la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">misma</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> interfaz para una gama de tipos con diferentes componentes internos).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">新しいクラスが同じインターフェースを持つ必要がない場合、つまり、そのクラスのユーザーが知る必要のないクラスの実装の特定の側面を隠したい場合は、コンポジションを使用する必要があります。</font><font style="vertical-align: inherit;">組成物は、より多くの支援の方法であるので、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">カプセル化</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、継承をサポートすることを意味している間（すなわち、隠蔽実装）</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抽象化</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（すなわち、この場合には、何かの簡略化された表現を提供</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同じ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">異なる内部構造を有するタイプの範囲に対するインターフェイス）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">새로운 클래스가 동일한 인터페이스를 가질 필요가없는 경우 구성을 사용해야합니다. 즉, 해당 클래스의 사용자가 알 필요가없는 클래스 구현의 특정 측면을 숨기려고합니다. </font><font style="vertical-align: inherit;">따라서 컴포지션은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캡슐화</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (즉, 구현 은폐)를 </font><font style="vertical-align: inherit;">지원하는 방법이 더 </font><font style="vertical-align: inherit;">많으며 상속은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추상화</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 지원하기위한 것입니다 </font><font style="vertical-align: inherit;">(즉, </font><font style="vertical-align: inherit;">내부가 다른 유형의 범위에 대해 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인터페이스를 제공합니다).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Композиция должна использоваться, когда вам не нужно, чтобы новый класс имел такой же интерфейс, т.е. вы хотите скрыть определенные аспекты реализации класса, о которых пользователь этого класса не должен знать. </font><font style="vertical-align: inherit;">Таким образом, композиция в большей степени поддерживает </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">инкапсуляцию</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (т. Е. Скрывает реализацию), а наследование предназначено для поддержки </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">абстракции</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (т. Е. Обеспечивает упрощенное представление чего-либо, в данном случае один и тот </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">же</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> интерфейс для ряда типов с различными внутренними компонентами).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当您不需要新的类具有相同的接口时，即应该隐藏该类的用户不需要知道的类实现的某些方面时，应使用组合。</font><font style="vertical-align: inherit;">因此，组合更多地是通过支持</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">封装</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（即隐藏实现）的方式，而继承是为了支持</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抽象</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（即提供某种事物的简化表示，在这种情况下，</font><font style="vertical-align: inherit;">对于具有不同内部结构的各种类型，使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">相同的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接口）。</font></font>

source: Composition v/s Inheritance is a wide subject. There is no real answer for what is better as I think it all depends on the design of the system.
es: Composición vs.Herencia es un tema muy amplio.No hay una respuesta real para lo que es mejor,ya que creo que todo depende del diseño del sistema.
ja: 組成 vs 継承は幅広いテーマです。何が良いかはシステムの設計次第だと思うので、本当の答えはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성 대 상속은 광범위한 주제입니다. </font><font style="vertical-align: inherit;">모든 것이 시스템의 디자인에 달려 있다고 생각하기 때문에 더 나은 것에 대한 진정한 대답은 없습니다.</font></font>
ru: Композиция против наследования является широкой темой.Нет реального ответа на вопрос,что лучше,так как я думаю,что все зависит от дизайна системы.
zh_cn: 组成vs继承是一个很广泛的话题。至于什么是更好的,我认为这完全取决于系统的设计,所以没有真正的答案。

source: Creating a subclass should mean more than just a convenient way to call superclass methods. You should use inheritance when subclass "is-a" super class both structurally and functionally, when it can be used as superclass and you are going to use that. If it is not the case - it is not inheritance, but something else. Composition is when your objects consists of another, or has some relationship to them.
es: Crear una subclase debería significar más que una forma conveniente de llamar a los métodos de la superclase.Deberías usar la herencia cuando la subclase "es una" superclase tanto estructural como funcionalmente,cuando puede ser usada como superclase y vas a usar eso.Si no es el caso-no es herencia,sino otra cosa.La composición es cuando tus objetos consisten en otro,o tiene alguna relación con ellos.
ja: サブクラスを作るということは、スーパークラスのメソッドを呼び出すための便利な方法だけではないはずです。サブクラスが構造的にも機能的にも "is-a "のスーパークラスで、それがスーパークラスとして使えるようになって、それを使おうとしているときに継承を使うべきです。そうでない場合は-それは継承ではなく、何か別のものです。組成とは、あなたのオブジェクトが別のもので構成されているとき、またはそれらに何らかの関係があるときです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 클래스를 생성한다는 것은 수퍼 클래스 메소드를 호출하는 편리한 방법 이상을 의미해야합니다. </font><font style="vertical-align: inherit;">서브 클래스 "is-a"수퍼 클래스가 구조적으로나 기능적으로 모두 수퍼 클래스로 사용될 수 있고 상속 할 때는 상속을 사용해야합니다. </font><font style="vertical-align: inherit;">그렇지 않은 경우-상속이 아니라 다른 것입니다. </font><font style="vertical-align: inherit;">구성은 개체가 다른 개체로 구성되거나 관계가있는 경우입니다.</font></font>
ru: Создание подкласса должно означать больше,чем просто удобный способ вызова методов суперкласса.Наследование следует использовать,когда подкласс "is-a" супер-класс как структурно,так и функционально,когда его можно использовать в качестве супер-класса,и вы собираетесь его использовать.Если это не так-это не наследование,а что-то другое.Состав-это когда ваши объекты состоят из другого,или имеют к ним какое-то отношение.
zh_cn: 创建子类的意义不应该仅仅是为了方便调用超类的方法。当子类在结构上和功能上都是 "是-a "超类的时候,当它可以作为超类的时候,你就应该使用继承,而且你要用这个继承。如果不是这样--那就不是继承,而是其他的东西。构成是当你的对象由另一个,或者说与之有一定关系的对象组成时。

source: Didn't find a satisfactory answer here, so I wrote a new one.
es: No encontré una respuesta satisfactoria aquí,así que escribí una nueva.
ja: ここでは満足のいく答えが見つからなかったので、新しいものを書きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 만족스러운 답변을 찾지 못하여 새로운 답변을 썼습니다.</font></font>
ru: Не нашел здесь удовлетворительного ответа,поэтому написал новый.
zh_cn: 在这里没有找到一个满意的答案,所以我写了一个新的。

source: Does TypeB want only some/part of the behavior exposed by TypeA? Indicates need for <strong>Composition.</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;TypeB desea solo parte / parte del comportamiento expuesto por TypeA? </font><font style="vertical-align: inherit;">Indica necesidad de </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">composici&oacute;n.</font></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeBはTypeAによって公開される動作の一部または一部のみを必要としますか？</font><strong><font style="vertical-align: inherit;">構成の</font></strong><font style="vertical-align: inherit;">必要性を示します</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeB는 TypeA에 의해 노출되는 동작의 일부 / 일부만 원합니까? </font><strong><font style="vertical-align: inherit;">구성이</font></strong><font style="vertical-align: inherit;"> 필요함을 나타냅니다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Разве TypeB хочет только часть / часть поведения, раскрываемого TypeA? </font><font style="vertical-align: inherit;">Указывает на необходимость в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">композиции.</font></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeB是否只希望TypeA公开某些/部分行为？</font><font style="vertical-align: inherit;">表示需要</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组成。</font></font></strong>

source: Does TypeB want to expose the complete interface (all public methods no less) of TypeA such that TypeB can be used where TypeA is expected? Indicates <strong>Inheritance</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;TipoB desea exponer la interfaz completa (todos los m&eacute;todos p&uacute;blicos no menos) de TipoA de modo que TipoB pueda usarse donde se espera TipoA? </font><font style="vertical-align: inherit;">Indica </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">herencia</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeBは、TypeAが期待される場所でTypeBを使用できるように、TypeAの完全なインターフェイス（すべてのパブリックメソッド以上）を公開したいですか？</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を示します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeB는 TypeA가 예상되는 곳에서 TypeB를 사용할 수 있도록 TypeA의 완전한 인터페이스 (모든 공용 메소드)를 공개하려고합니까? </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 나타냅니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Желает ли TypeB предоставить полный интерфейс (не все общедоступные методы) TypeA так, чтобы TypeB можно было использовать там, где ожидается TypeA? </font><font style="vertical-align: inherit;">Указывает на </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">наследование</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeB是否要公开TypeA的完整接口（所有公共方法都不少），以便可以在需要TypeA的地方使用TypeB？</font><font style="vertical-align: inherit;">表示</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Does your class need to re-use any high level interactions defined in another class ? The <a href="http://en.wikipedia.org/wiki/Template_method_pattern">template method</a> design pattern would be impossible to implement without inheritance. I believe all extensible frameworks use this pattern.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Necesita su clase reutilizar las interacciones de alto nivel definidas en otra clase? </font><font style="vertical-align: inherit;">El </font></font><a href="http://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">patr&oacute;n de</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dise&ntilde;o del </font><font style="vertical-align: inherit;">m&eacute;todo de plantilla</font><font style="vertical-align: inherit;"> ser&iacute;a imposible de implementar sin herencia. </font><font style="vertical-align: inherit;">Creo que todos los marcos extensibles usan este patr&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたのクラスは別のクラスで定義された高レベルの相互作用を再利用する必要がありますか？</font></font><a href="http://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テンプレートメソッド</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デザインパターンは、継承せずに実装するのは不可能であろう。</font><font style="vertical-align: inherit;">すべての拡張可能なフレームワークがこのパターンを使用していると思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수업에서 다른 수업에 정의 된 높은 수준의 상호 작용을 재사용해야합니까? </font></font><a href="http://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 메소드</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 디자인 패턴은 상속없이 구현하기가 불가능하다. </font><font style="vertical-align: inherit;">모든 확장 가능한 프레임 워크 가이 패턴을 사용한다고 생각합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нужно ли вашему классу повторно использовать взаимодействия высокого уровня, определенные в другом классе? </font></font><a href="http://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Метод шаблона</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> шаблон дизайна будет невозможно реализовать без наследования. </font><font style="vertical-align: inherit;">Я считаю, что все расширяемые рамки используют этот шаблон.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您的班级是否需要重用另一个班级中定义的任何高级交互？</font><font style="vertical-align: inherit;">该</font></font><a href="http://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">模板方法</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设计模式就不可能不继承来实现。</font><font style="vertical-align: inherit;">我相信所有可扩展的框架都使用这种模式。</font></font>

source: E.g 1. Accountant <strong>is an</strong> Employee. But I will <strong>not</strong> use inheritance because a Employee object can be instantiated.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo: 1. El contador </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es un</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> empleado. </font><font style="vertical-align: inherit;">Pero </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usar&eacute; la herencia porque se puede crear una instancia de un objeto Employee.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例1.会計士</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">従業員です。</font><font style="vertical-align: inherit;">ただし</font><font style="vertical-align: inherit;">、Employeeオブジェクトはインスタンス化できるため、継承</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用し</font><strong><font style="vertical-align: inherit;">ません</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 1. 회계사 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 직원입니다. </font><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">Employee 객체를 인스턴스화 할 수 있기 때문에 상속을 사용 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하지 않습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, 1. Бухгалтер </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Сотрудником. </font><font style="vertical-align: inherit;">Но я </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> буду </font><font style="vertical-align: inherit;">использовать наследование, потому что объект Employee может быть создан.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如1.会计师</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">雇员。</font><font style="vertical-align: inherit;">但是我</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不会</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用继承，因为可以实例化Employee对象。</font></font>
