Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The antidote is the <a href="https://en.wikipedia.org/wiki/Single_responsibility_principle">Single Responsibility Principle</a>. Think of it as a constraint. My class <em>must</em> do one thing. I <em>must</em> be able to give my class a name that somehow describes that one thing it does. (There are exceptions to everything, but absolute rules are sometimes better when we're learning.) It follows that I cannot write a base class called <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code>. Whatever distinct functionality I need must be in its own class, and then other classes that need that functionality can depend on that class, <em>not</em> inherit from it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El ant&iacute;doto es el </font></font><a href="https://en.wikipedia.org/wiki/Single_responsibility_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">principio de responsabilidad &uacute;nica</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Piense en ello como una restricci&oacute;n. Mi clase </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">debe</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hacer una cosa. Yo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">debo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser capaz de dar mi clase un nombre que de alguna manera describe que una cosa que hace. (Hay excepciones para todo, pero las reglas absolutas a veces son mejores cuando estamos aprendiendo). De esto se deduce que no puedo escribir una clase base llamada </font></font> <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Cualquier funcionalidad distinta que necesite debe estar en su propia clase, y luego otras clases que necesiten esa funcionalidad pueden depender de esa clase, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> heredar de ella.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解毒剤は</font></font><a href="https://en.wikipedia.org/wiki/Single_responsibility_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">単一の責任原則</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。それを制約と考えてください。私のクラス</font><font style="vertical-align: inherit;">は一つのことをし</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なければなり</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません。私</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスに、その1つのことをどういうわけか説明する名前を付けることができ</font><em><font style="vertical-align: inherit;">なければなりません</font></em><font style="vertical-align: inherit;">。 （すべてに例外はありますが、学習しているときは絶対ルールの方が良い場合があります。）</font></font> <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という基本クラスを作成できないということになり</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。私が必要とする明確な機能は、それ自体のクラスになければならず、その機能を必要とする他のクラスは、そのクラス</font><font style="vertical-align: inherit;">から継承するの</font><font style="vertical-align: inherit;">で</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はなく</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、そのクラスに依存することができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해독제는 </font></font><a href="https://en.wikipedia.org/wiki/Single_responsibility_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 책임 원칙</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. 그것을 제약 조건으로 생각하십시오. 수업 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 가지만 </font><em><font style="vertical-align: inherit;">해야합니다</font></em><font style="vertical-align: inherit;"> . 나는 </font><font style="vertical-align: inherit;">수업에 그 일을 묘사하는 이름을 수업에 줄 수 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있어야</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한다. (모든 것에 예외가 있지만 우리가 배우면 절대 규칙이 더 나은 경우가 있습니다.) </font></font> <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 라는 기본 클래스를 작성할 수 없습니다 </font><font style="vertical-align: inherit;">. 필요한 기능이 무엇이든 자체 클래스에 있어야하며 해당 기능이 필요한 다른 클래스는 클래스에서 </font><font style="vertical-align: inherit;">상속 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">되지 않고</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해당 클래스에 의존 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Противоядием является </font></font><a href="https://en.wikipedia.org/wiki/Single_responsibility_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принцип единой ответственности</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Думайте об этом как об ограничении. Мой класс </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">должен</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сделать одну вещь. Я </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">должен</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> быть в состоянии дать своему классу имя, которое каким-то образом описывает ту вещь, которую он делает. (Есть исключения для всего, но абсолютные правила иногда лучше, когда мы учимся.) Из этого следует, что я не могу написать базовый класс с именем </font></font> <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Независимо от того, какая отдельная функциональность мне нужна, она должна принадлежать своему классу, и тогда другие классы, которым эта функциональность нужна, могут зависеть от этого класса, а </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> наследоваться от него.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解毒剂是</font></font><a href="https://en.wikipedia.org/wiki/Single_responsibility_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">单一责任原则</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。将其视为约束。我班上</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做一件事。我</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必须</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">能够给班级一个名称，以某种方式描述它所做的一件事情。 （所有情况都有例外，但是当我们学习时，绝对规则有时会更好。）因此，我无法编写名为</font></font> <code>ObjectBaseThatContainsVariousFunctionsNeededByDifferentClasses</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的基类</font><font style="vertical-align: inherit;">。无论我需要什么独特的功能，都必须在其自己的类中，然后其他需要该功能的类可以依赖于该类，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font><font style="vertical-align: inherit;">该类</font><font style="vertical-align: inherit;">继承。</font></font>

source: The article, <a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/">Inheritance is Evil: The Epic Fail of the DataAnnotationsModelBinder</a>, walks through an example of this in C#. It shows the use of inheritance when composition should have been used and how it could be refactored.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El art&iacute;culo, La </font></font><a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">herencia es malvada: el error &eacute;pico de DataAnnotationsModelBinder</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , muestra un ejemplo de esto en C #. </font><font style="vertical-align: inherit;">Muestra el uso de la herencia cuando la composici&oacute;n deber&iacute;a haber sido utilizada y c&oacute;mo podr&iacute;a ser refactorizada.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事「</font></font><a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承は悪である：DataAnnotationsModelBinderの重大な失敗」では</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、C＃でこの例を</font><font style="vertical-align: inherit;">紹介してい</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これは、コンポジションが使用されるべきであった場合の継承の使用と、それをリファクタリングする方法を示しています。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Inheritance is Evil : DataAnnotationsModelBinder의 Epic Fail</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기사 </font><font style="vertical-align: inherit;">는 C #에서 이에 대한 예제를 설명합니다. </font><font style="vertical-align: inherit;">컴포지션을 사용해야 할 때 상속을 사용하고 리팩토링하는 방법을 보여줍니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В статье &laquo; </font></font><a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наследование есть зло: эпическая ошибка DataAnnotationsModelBinder&raquo;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> приведен пример этого в C #. </font><font style="vertical-align: inherit;">Это показывает использование наследования, когда состав должен был использоваться и как это могло быть реорганизовано.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文章</font></font><a href="http://www.agileatwork.com/inheritance-is-evil-the-story-of-the-epic-fail-of-dataannotationsmodelbinder/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Inheritance is Evil：DataAnnotationsModelBinder的史诗失败，逐步介绍</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">了C＃中的一个示例。</font><font style="vertical-align: inherit;">它显示了应在使用合成时使用继承的方式以及如何对其进行重构。</font></font>

source: The composition has a real edge here: the relationship can be reversed: the "parent class" or "abstract worker" can aggregate any specific "child" objects implementing certain interface + <strong>any child can be set inside any other type of parent, which accepts it's type</strong>. And there can be any number of objects, for example MergeSort or QuickSort could sort any list of objects implementing an abstract Compare -interface. Or to put it another way: any group of objects which implement "foo()" and other group of objects which can make use of objects having "foo()" can play together.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n tiene una ventaja real aqu&iacute;: la relaci&oacute;n se puede revertir: la "clase principal" o el "trabajador abstracto" pueden agregar cualquier objeto "secundario" espec&iacute;fico que implemente cierta interfaz + </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cualquier elemento secundario se puede establecer dentro de cualquier otro tipo de elemento primario, que acepta Es tipo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y puede haber cualquier cantidad de objetos, por ejemplo, MergeSort o QuickSort podr&iacute;an ordenar cualquier lista de objetos que implementen una interfaz de comparaci&oacute;n abstracta. </font><font style="vertical-align: inherit;">O para decirlo de otra manera: cualquier grupo de objetos que implementan "foo ()" y otro grupo de objetos que pueden hacer uso de objetos que tienen "foo ()" pueden jugar juntos.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで構成には本当の意味があります。関係は逆にすることができます。「親クラス」または「抽象ワーカー」は、特定のインターフェースを実装する特定の「子」オブジェクトを集約</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">できます。子は、他のタイプの親の内部に設定できます。タイプ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">また、オブジェクトはいくつでも存在できます。たとえば、MergeSortまたはQuickSortは、抽象的なCompareインターフェースを実装するオブジェクトのリストを並べ替えることができます。</font><font style="vertical-align: inherit;">または別の言い方をすると、「foo（）」を実装するオブジェクトのグループと、「foo（）」を持つオブジェクトを利用できる他のオブジェクトのグループは、一緒に遊ぶことができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션의 실제 장점은 다음과 같습니다. "상위 클래스"또는 "추상 작업자"는 특정 인터페이스를 구현하는 특정 "하위"개체를 집계 할 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수 있습니다. 유형</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">예를 들어 MergeSort 또는 QuickSort는 추상 비교 인터페이스를 구현하는 모든 객체 목록을 정렬 할 수 있습니다. </font><font style="vertical-align: inherit;">또는 "foo ()"를 구현하는 모든 객체 그룹과 "foo ()"를 가진 객체를 사용할 수있는 다른 객체 그룹은 함께 재생할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Здесь у композиции есть реальное преимущество: связь может быть обратной: &laquo;родительский класс&raquo; или &laquo;абстрактный работник&raquo; могут агрегировать любые конкретные &laquo;дочерние&raquo; объекты, реализующие определенный интерфейс + </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">любой дочерний</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объект </font><strong><font style="vertical-align: inherit;">может быть установлен внутри любого другого типа родителя, который принимает это тип</font></strong><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">И может быть любое количество объектов, например, MergeSort или QuickSort могут отсортировать любой список объектов, реализующих абстрактный интерфейс Compare. </font><font style="vertical-align: inherit;">Или, говоря иначе: любая группа объектов, которые реализуют "foo ()", и другая группа объектов, которые могут использовать объекты, имеющие "foo ()", могут играть вместе.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这种组合在这里具有真正的优势：这种关系可以颠倒：&ldquo;父类&rdquo;或&ldquo;抽象工作者&rdquo;可以聚合实现特定接口的任何特定&ldquo;子&rdquo;对象+ </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以在任何其他类型的父内部设置任何子，它是type</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">并且可以有任意数量的对象，例如MergeSort或QuickSort可以对实现抽象Compare接口的对象列表进行排序。</font><font style="vertical-align: inherit;">换句话说，实现&ldquo; foo（）&rdquo;的任何对象组和可以利用具有&ldquo; foo（）&rdquo;的对象的其他对象组都可以一起玩。</font></font>

source: The first test ensures that all <em>getters</em> of <code>Foo</code> make sense in <code>Bar</code> (= shared properties), while the second test makes sure that all <em>setters</em> of <code>Foo</code> make sense in <code>Bar</code> (= shared functionality).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las primeras pruebas asegura que todos los </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">captadores</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene sentido en </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (propiedades = compartidos), mientras que la segunda prueba se asegura de que todos </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">los emisores</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene sentido en el </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (= funcionalidad compartida).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初のテスト性を保証すべてが</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でメイクセンス</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（=共有プロパティ）、第二の試験は、必ずすべてのことになりつつ、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッター</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でメイクセンス</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（=共有機能）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 테스트는 </font> <code>Foo</code> 의<font style="vertical-align: inherit;"> 모든 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font> <code>Bar</code> <font style="vertical-align: inherit;"> (= 공유 속성) </font><font style="vertical-align: inherit;">에서 의미 </font><font style="vertical-align: inherit;">가 있는지 확인하고, 두 번째 테스트는 </font> <code>Foo</code> 의<font style="vertical-align: inherit;"> 모든 </font><em><font style="vertical-align: inherit;">setter</font></em><font style="vertical-align: inherit;"> 가 </font> <code>Bar</code> <font style="vertical-align: inherit;"> (= 공유 기능) </font><font style="vertical-align: inherit;">에서 의미 </font><font style="vertical-align: inherit;">가 있는지 확인합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Первые испытания гарантируют , </font><font style="vertical-align: inherit;">что все </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">добытчики</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет смысла в </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (= общие свойства), в </font><font style="vertical-align: inherit;">то время как второй тест гарантирует , </font><font style="vertical-align: inherit;">что все </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сеттер</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет смысла, в </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (= общие функциональные возможности </font><font style="vertical-align: inherit;">).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第一测试确保了所有</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的吸气剂</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中有意义</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（=共享属性），而在第二测试确保所有</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设置器</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中有意义</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（=共享的功能）。</font></font>
