Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: A circle is an ellipse BUT circles can't do everything that ellipses can do. For example, circles can't stretch, while ellipses can. Therefore, the class <code>Circle</code><strong>cannot</strong> inherit the class <code>Ellipse</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un c&iacute;rculo es una elipse PERO los c&iacute;rculos no pueden hacer todo lo que pueden hacer las elipses. </font><font style="vertical-align: inherit;">Por ejemplo, los c&iacute;rculos no pueden estirarse, mientras que las elipses s&iacute;. </font><font style="vertical-align: inherit;">Por lo tanto, la clase </font></font> <code>Circle</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no puede</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> heredar la clase </font></font> <code>Ellipse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">円は楕円ですが、円は楕円ができることすべてを行うことはできません。</font><font style="vertical-align: inherit;">たとえば、円は伸縮できませんが、楕円は伸縮できます。</font><font style="vertical-align: inherit;">したがって、クラス</font></font> <code>Circle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はクラス</font> <code>Ellipse</code> を<font style="vertical-align: inherit;">継承</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">できません</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원은 타원이지만 원은 타원으로 할 수있는 모든 것을 할 수는 없습니다. </font><font style="vertical-align: inherit;">예를 들어, 타원은 뻗을 수 있지만 원은 늘릴 수 없습니다. </font><font style="vertical-align: inherit;">따라서 </font></font> <code>Circle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스는 </font> <code>Ellipse</code> <font style="vertical-align: inherit;"> 클래스를 상속 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">할 수 없습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Круг - это эллипс, НО круги не могут делать все, что могут делать эллипсы. </font><font style="vertical-align: inherit;">Например, круги не могут растягиваться, а эллипсы могут. </font><font style="vertical-align: inherit;">Следовательно, класс </font></font> <code>Circle</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не может</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> наследовать класс </font></font> <code>Ellipse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">圆是椭圆，但是圆不能做椭圆所能做的所有事情。</font><font style="vertical-align: inherit;">例如，圆圈不能伸展，而椭圆可以伸展。</font><font style="vertical-align: inherit;">因此，</font></font> <code>Circle</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不能</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承</font></font> <code>Ellipse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">。</font></font>

source: A dog is an animal AND dogs can do everything that animals can do (such as breathing, dying, etc.). Therefore, the class <code>Dog</code><strong>can</strong> inherit the class <code>Animal</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un perro es un animal Y los perros pueden hacer todo lo que los animales pueden hacer (como respirar, morir, etc.). </font><font style="vertical-align: inherit;">Por lo tanto, la clase </font></font> <code>Dog</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">puede</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> heredar la clase </font></font> <code>Animal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">犬は動物であり、犬は動物ができるすべてのことを行うことができます（呼吸、死亡など）。</font><font style="vertical-align: inherit;">したがって、クラス</font></font> <code>Dog</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はクラス</font> <code>Animal</code> を<font style="vertical-align: inherit;">継承</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でき</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개는 동물이며 개는 동물이 할 수있는 모든 일 (호흡, 죽기 등)을 할 수 있습니다. </font><font style="vertical-align: inherit;">따라서 </font></font> <code>Dog</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스는 </font> <code>Animal</code> <font style="vertical-align: inherit;"> 클래스를 상속 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">할 수 있습니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Собака - это животное, и собаки могут делать все, что могут делать животные (например, дышать, умирать и т. Д.). </font><font style="vertical-align: inherit;">Следовательно, класс </font></font> <code>Dog</code> <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">может</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> наследовать класс </font></font> <code>Animal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">狗是动物，而狗可以做动物可以做的所有事情（例如呼吸，死亡等）。</font><font style="vertical-align: inherit;">因此，</font></font> <code>Dog</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承</font></font> <code>Animal</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">。</font></font>

source: A much more complete and concrete <a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172">answer from Tim Boudreau</a> of Sun:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una respuesta mucho m&aacute;s completa y concreta </font></font><a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">de Tim Boudreau</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Sun:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tim Boudreau</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> of Sun </font><font style="vertical-align: inherit;">からの</font><font style="vertical-align: inherit;">より完全で具体的な</font><font style="vertical-align: inherit;">答え</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sun의 </font></font><a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tim Boudreau</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 제공 </font><font style="vertical-align: inherit;">하는 훨씬 더 완전하고 구체적인 </font><font style="vertical-align: inherit;">답변</font><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Гораздо более полный и конкретный </font></font><a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответ Тима Будро</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из Sun:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sun的</font></font><a href="http://www.javalobby.org/forums/thread.jspa?forumID=61&amp;threadID=16487#91822172"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tim Boudreau</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">给出</font><font style="vertical-align: inherit;">了更为完整和具体的</font><font style="vertical-align: inherit;">答案</font><font style="vertical-align: inherit;">：</font></font>

source: A rule of thumb I have heard is inheritance should be used when its a "is-a" relationship and composition when its a "has-a". Even with that I feel that you should always lean towards composition because it eliminates a lot of complexity.
es: Una regla empírica que he oído es que la herencia debe utilizarse cuando es una relación "es-un" y la composición cuando es un "tiene-un".Aún así,creo que siempre debes inclinarte por la composición porque elimina mucha complejidad.
ja: 私が聞いた経験則では、継承は "is-a "の関係のときに使用し、"has-a "のときには構成を使用するべきであるということです。それでさえも、複雑さの多くを排除できるので、常に構成に傾くべきだと感じています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 들었던 경험은 상속은 "is-a"관계 일 때 사용되어야하고 "has-a"일 때 구성을 사용해야한다는 것입니다. </font><font style="vertical-align: inherit;">그럼에도 불구하고 나는 많은 복잡성을 제거하기 때문에 항상 구성에 의존해야한다고 생각합니다.</font></font>
ru: Я слышал правило,что наследство должно использоваться,когда оно имеет отношение "is-a",а композиция,когда оно имеет отношение "has-a".Даже при этом я считаю,что всегда следует склоняться к композиции,потому что это устраняет много сложностей.
zh_cn: 我听说的一个经验法则是,当它是 "is-a "关系时,应该使用继承,而当它是 "has-a "关系时,应该使用组合。即使是这样,我觉得你应该总是倾向于使用组成关系,因为它可以消除很多的复杂性。

source: A simple way to make sense of this would be that inheritance should be used when you need an object of your class to have the same <em>interface</em> as its parent class, so that it can thereby be treated as an object of the parent class (upcasting). Moreover, function calls on a derived class object would remain the same everywhere in code, but the specific method to call would be determined at runtime (i.e. the low-level <em>implementation</em> differs, the high-level <em>interface</em> remains the same).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una manera simple de dar sentido a esto ser&iacute;a que la herencia se debe usar cuando necesita que un objeto de su clase tenga la misma </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">interfaz</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que su clase primaria, de modo que pueda tratarse como un objeto de la clase primaria (transmisi&oacute;n ascendente) . Adem&aacute;s, las llamadas a funciones en un objeto de clase derivado permanecer&iacute;an iguales en todas partes en el c&oacute;digo, pero el m&eacute;todo espec&iacute;fico para llamar se determinar&iacute;a en tiempo de ejecuci&oacute;n (es decir, la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">implementaci&oacute;n de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bajo nivel </font><font style="vertical-align: inherit;">difiere, la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">interfaz de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> alto nivel </font><font style="vertical-align: inherit;">sigue siendo la misma).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを理解する簡単な方法は、クラスのオブジェクトが</font><font style="vertical-align: inherit;">その親クラス</font><font style="vertical-align: inherit;">と同じ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インターフェイス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を持つ必要がある場合に継承を使用する必要があることです。</font><font style="vertical-align: inherit;">これにより、それを親クラスのオブジェクトとして扱うことができます（アップキャスト） 。さらに、派生クラスオブジェクトの関数呼び出しはコードのどの部分でも同じですが、呼び出す特定のメソッドは実行時に決定されます（つまり、低レベルの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は異なり、高レベルの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インターフェイス</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は同じです）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 이해하는 간단한 방법은 클래스의 객체가 </font><font style="vertical-align: inherit;">부모 클래스 </font><font style="vertical-align: inherit;">와 동일한 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인터페이스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 갖기 위해 상속을 사용해야 </font><font style="vertical-align: inherit;">부모 클래스의 객체로 취급 될 수 있다는 것입니다 (업 캐스팅) . 또한 파생 클래스 객체의 함수 호출은 코드의 모든 곳에서 동일하게 유지되지만 호출 할 특정 메서드는 런타임에 결정됩니다 (즉, 저수준 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현이</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다르면 고수준 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인터페이스</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 동일하게 유지됨).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Простой способ разобраться в этом состоит в том, что наследование следует использовать, когда вам нужно, чтобы объект вашего класса имел тот же </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">интерфейс,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что и его родительский класс, чтобы его можно было таким образом рассматривать как объект родительского класса (апкастинг) , Более того, вызовы функций для объекта производного класса в коде будут оставаться одинаковыми везде, но конкретный вызываемый метод будет определен во время выполнения (т. Е. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Реализация</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> низкого уровня </font><font style="vertical-align: inherit;">отличается, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">интерфейс</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> высокого уровня </font><font style="vertical-align: inherit;">остается тем же).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一种简单的理解方法是，当您需要类的对象具有与</font><font style="vertical-align: inherit;">其父类</font><font style="vertical-align: inherit;">相同的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接口</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时，应使用继承</font><font style="vertical-align: inherit;">，以便可以将其视为父类的对象（向上投射）。 。此外，对派生类对象的函数调用在代码中的每个地方都将保持不变，但具体的调用方法将在运行时确定（即，低级</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实现</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不同，高级</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接口</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">保持不变）。</font></font>

source: Also, I support @anon answer in <a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1">Why use inheritance at all?</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, apoyo @anon answer en </font></font><a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Por qu&eacute; usar herencia en absoluto?</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font><a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なぜ継承を使用するのですか？</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font><a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1"><font style="vertical-align: inherit;">왜 상속을 사용합니까?에서</font></a><font style="vertical-align: inherit;"> @anon 답변을 지원 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, я поддерживаю ответ @anon в разделе </font></font><a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Почему вообще используется наследование?</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另外，我支持@anon回答&ldquo; </font></font><a href="https://stackoverflow.com/questions/3351666/why-use-inheritance-at-all?lq=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为什么要完全使用继承？&rdquo;中的内容。</font></font></a>

source: An example of this is PHP without the use of classes (particularly before PHP5). All logic is encoded in a set of functions. You may include other files containing helper functions and so on and conduct your business logic by passing data around in functions. This can be very hard to manage as the application grows. PHP5 tries to remedy this by offering more object oriented design.
es: Un ejemplo de esto es PHP sin el uso de clases (particularmente antes de PHP5).Toda la lógica está codificada en un conjunto de funciones.Puede incluir otros archivos que contengan funciones de ayuda y así sucesivamente,y llevar a cabo su lógica de negocio pasando datos en las funciones.Esto puede ser muy difícil de manejar a medida que la aplicación crece.PHP5 trata de remediar esto ofreciendo un diseño más orientado a los objetos.
ja: その例として、クラスを使わないPHPがあります(特にPHP5以前)。すべてのロジックは、関数のセットでエンコードされています。ヘルパー関数などを含む他のファイルをインクルードして、関数でデータを渡してビジネスロジックを実行することもできます。これは、アプリケーションが大きくなってくると管理が大変になります。PHP5では、よりオブジェクト指向のデザインを提供することで、この問題を解決しようとしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 클래스를 사용하지 않는 PHP (특히 PHP5 이전)가 있습니다. </font><font style="vertical-align: inherit;">모든 논리는 일련의 기능으로 인코딩됩니다. </font><font style="vertical-align: inherit;">헬퍼 함수 등을 포함하는 다른 파일을 포함하고 함수에서 데이터를 전달하여 비즈니스 로직을 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">애플리케이션이 커질수록 관리하기가 매우 어려울 수 있습니다. </font><font style="vertical-align: inherit;">PHP5는 더 많은 객체 지향 디자인을 제공함으로써이를 해결하려고합니다.</font></font>
ru: Примером может служить PHP без использования классов (особенно до PHP5).Вся логика закодирована в наборе функций.Вы можете включать другие файлы,содержащие вспомогательные функции и т.д.и вести свою бизнес-логику,передавая данные в функциях.С этим может быть очень сложно справиться по мере роста приложения.PHP5 пытается исправить это,предлагая более объектно-ориентированный дизайн.
zh_cn: 这方面的一个例子是没有使用类的PHP(尤其是在PHP5之前)。所有的逻辑都编码在一组函数中。你可以包含其他包含辅助函数等的文件,通过在函数中传递数据来进行业务逻辑。随着应用程序的发展,这可能是很难管理的。PHP5试图通过提供更多的面向对象设计来弥补这个问题。
