Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (a fragment from: <a href="http://www.copypasteisforword.com/notes/use-inheritance-properly">use inheritance properly</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(un fragmento de: </font></font><a href="http://www.copypasteisforword.com/notes/use-inheritance-properly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">use la herencia correctamente</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（からのフラグメント：</font></font><a href="http://www.copypasteisforword.com/notes/use-inheritance-properly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承を適切に使用してください</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(의 조각 : </font></font><a href="http://www.copypasteisforword.com/notes/use-inheritance-properly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 올바르게 사용하십시오</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(фрагмент из: </font></font><a href="http://www.copypasteisforword.com/notes/use-inheritance-properly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">правильно использовать наследование</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（来自：</font></font><a href="http://www.copypasteisforword.com/notes/use-inheritance-properly"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正确使用继承</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的片段</font><font style="vertical-align: inherit;">）。</font></font>

source: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance">Wikipedia</a> offers a nice overview of the topic being discussed in this question.
es: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Wikipedia</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ofrece una buena descripci&oacute;n del tema que se discute en esta pregunta.</font></font>
ja: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ウィキペディア</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、この質問で議論されているトピックの素晴らしい概要を提供します。</font></font>
ko: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Wikipedia</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는이 질문에서 다루고있는 주제에 대한 훌륭한 개요를 제공합니다.</font></font>
ru: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Википедия</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предлагает хороший обзор темы, обсуждаемой в этом вопросе.</font></font>
zh_cn: <a href="http://en.wikipedia.org/wiki/Composition_over_inheritance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Wikipedia</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很好地概述了此问题中讨论的主题。</font></font>

source: <em>Car is a Vehicle</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El auto es un veh&iacute;culo</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">車は乗り物</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자동차는 차량입니다</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Автомобиль - это Автомобиль</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">汽车是车辆</font></font></em>

source: <em>Classes get heavier</em> - you don't necessarily know what work your superclass is doing in its constructor, or how much memory it's going to use. So constructing some innocent would-be lightweight object can be far more expensive than you think, and this may change over time if the superclass evolves
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las clases se vuelven m&aacute;s pesadas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : no necesariamente sabe qu&eacute; trabajo est&aacute; haciendo su superclase en su constructor, o cu&aacute;nta memoria va a usar. </font><font style="vertical-align: inherit;">Por lo tanto, construir un objeto inocente y ligero puede ser mucho m&aacute;s costoso de lo que piensas, y esto puede cambiar con el tiempo si la superclase evoluciona</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは重くなり</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。スーパークラスがコンストラクターで実行している作業や、使用するメモリの量が必ずしもわかっているとは限りません。</font><font style="vertical-align: inherit;">したがって、無害な軽量オブジェクトを構築することは、あなたが考えるよりもはるかに高価になる可能性があり、スーパークラスが進化する場合、これは時間とともに変化する可能性があります</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스가 더 무겁습니다.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수퍼 클래스가 생성자에서 어떤 작업을 수행하는지 또는 얼마나 많은 메모리를 사용할지 반드시 알 필요는 없습니다. </font><font style="vertical-align: inherit;">따라서 무고한 가벼운 객체를 만드는 것은 생각보다 훨씬 비쌀 수 있으며 수퍼 클래스가 진화하면 시간이 지남에 따라 변경 될 수 있습니다</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Классы становятся тяжелее</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - вы не обязательно знаете, что делает ваш суперкласс в своем конструкторе, или сколько памяти он собирается использовать. </font><font style="vertical-align: inherit;">Поэтому создание какого-то невинного потенциального легковесного объекта может оказаться намного дороже, чем вы думаете, и со временем это может измениться, если суперкласс развивается</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类变得更重</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -您不一定知道您的超类在其构造函数中正在做什么，也不知道它将使用多少内存。</font><font style="vertical-align: inherit;">因此，构造一些无辜的轻量级对象可能比您想象的要昂贵得多，而且如果超类不断发展，这种情况可能会随着时间而改变。</font></font>

source: <em>Innocent acts can have unexpected results</em> - The classic example of this is calls to overridable methods from the superclass constructor, before the subclasses instance fields have been initialized. In a perfect world, nobody would ever do that. This is not a perfect world.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Los actos inocentes pueden tener resultados inesperados</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el ejemplo cl&aacute;sico de esto son las llamadas a m&eacute;todos reemplazables desde el constructor de la superclase, antes de que se inicialicen los campos de instancia de subclases. </font><font style="vertical-align: inherit;">En un mundo perfecto, nadie har&iacute;a eso. </font><font style="vertical-align: inherit;">Este no es un mundo perfecto.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">無邪気な行為は予期しない結果をもたらす可能性があります</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -この典型的な例は、サブクラスのインスタンスフィールドが初期化される前の、スーパークラスコンストラクターからのオーバーライド可能なメソッドの呼び出しです。</font><font style="vertical-align: inherit;">完璧な世界では、誰もそれをしません。</font><font style="vertical-align: inherit;">これは完璧な世界ではありません。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">무고한 행위는 예기치 않은 결과를 초래할 수 있습니다.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이것의 전형적인 예는 서브 클래스 인스턴스 필드가 초기화되기 전에 수퍼 클래스 생성자에서 재정의 가능한 메소드를 호출하는 것입니다. </font><font style="vertical-align: inherit;">완벽한 세상에서는 아무도 그렇게하지 않을 것입니다. </font><font style="vertical-align: inherit;">이것은 완벽한 세상이 아닙니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Невинные действия могут привести к неожиданным результатам</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Классическим примером этого являются вызовы переопределяемых методов из конструктора суперкласса до инициализации полей экземпляра подкласса. </font><font style="vertical-align: inherit;">В идеальном мире никто никогда бы не сделал это. </font><font style="vertical-align: inherit;">Это не идеальный мир.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">无辜的行为会产生意想不到的结果</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -典型的例子是在初始化子类实例字段之前，从超类构造函数调用可重写方法。</font><font style="vertical-align: inherit;">在理想世界中，没有人会这样做。</font><font style="vertical-align: inherit;">这不是一个完美的世界。</font></font>

source: <em>It encourages an explosion of subclasses</em>. Classloading costs time, more classes costs memory. This may be a non-issue until you're dealing with an app on the scale of NetBeans, but there, we had real issues with, for example, menus being slow because the first display of a menu triggered massive class loading. We fixed this by moving to more declarative syntax and other techniques, but that cost time to fix as well.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fomenta una explosi&oacute;n de subclases</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La carga de clases cuesta tiempo, m&aacute;s clases cuestan memoria. </font><font style="vertical-align: inherit;">Esto puede no ser un problema hasta que est&eacute; lidiando con una aplicaci&oacute;n en la escala de NetBeans, pero all&iacute; tuvimos problemas reales con, por ejemplo, que los men&uacute;s son lentos porque la primera visualizaci&oacute;n de un men&uacute; provoc&oacute; una carga masiva de clases. </font><font style="vertical-align: inherit;">Lo arreglamos movi&eacute;ndonos a una sintaxis m&aacute;s declarativa y otras t&eacute;cnicas, pero eso tambi&eacute;n cost&oacute; tiempo en solucionarlo.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブクラスの爆発的な増加を助長し</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">クラスローディングには時間がかかり、クラスが増えるとメモリが消費されます。</font><font style="vertical-align: inherit;">NetBeansの規模でアプリを扱うまでは問題にならないかもしれませんが、メニューの最初の表示が大量のクラスの読み込みをトリガーしたためにメニューが遅くなるなど、実際の問題がありました。</font><font style="vertical-align: inherit;">より宣言的な構文やその他の手法に移行することでこれを修正しましたが、修正にも時間がかかりました。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 서브 클래스의 폭발을 장려합니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . 클래스 로딩에는 시간이 걸리고 더 많은 클래스에는 메모리가 필요합니다. NetBeans 규모의 앱을 처리 할 때까지 이것은 문제가되지 않을 수 있지만 메뉴의 첫 번째 표시가 대규모 클래스로드를 트리거했기 때문에 메뉴가 느려지는 등 실제 문제가있었습니다. 우리는보다 선언적인 구문과 다른 기술로 이동하여이 문제를 해결했지만 수정하는 데 시간이 걸렸습니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это поощряет взрыв подклассов</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Загрузка классов стоит времени, больше классов - памяти. </font><font style="vertical-align: inherit;">Это может быть не проблема, пока вы не имеете дело с приложением в масштабе NetBeans, но там у нас были реальные проблемы, например, с медленным меню, потому что первое отображение меню вызвало массовую загрузку классов. </font><font style="vertical-align: inherit;">Мы исправили это, перейдя к более декларативному синтаксису и другим методам, но это также потребовало времени на исправление.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它鼓励子类的爆炸式增长</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">类加载会花费时间，更多类会消耗内存。</font><font style="vertical-align: inherit;">在您处理NetBeans规模的应用程序之前，这可能不是问题，但是在那儿，我们遇到了一些实际问题，例如菜单速度慢，因为菜单的首次显示会触发大量的类加载。</font><font style="vertical-align: inherit;">我们通过使用更具声明性的语法和其他技术来解决此问题，但这也需要花费时间来解决。</font></font>

source: <em>It makes it harder to change things later</em> - if you've made a class public, swapping the superclass is going to break subclasses - it's a choice which, once you've made the code public, you're married to. So if you're not altering the real functionality to your superclass, you get much more freedom to change things later if you use, rather than extend the thing you need. Take, for example, subclassing JPanel - this is usually wrong; and if the subclass is public somewhere, you never get a chance to revisit that decision. If it's accessed as JComponent getThePanel() , you can still do it (hint: expose models for the components within as your API).
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hace que sea m&aacute;s dif&iacute;cil cambiar las cosas m&aacute;s adelante</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : si ha hecho p&uacute;blica una clase, cambiar la superclase va a romper las subclases, es una elecci&oacute;n con la que, una vez que hace p&uacute;blico el c&oacute;digo, est&aacute; casado. Entonces, si no est&aacute; alterando la funcionalidad real de su superclase, obtendr&aacute; mucha m&aacute;s libertad para cambiar las cosas m&aacute;s adelante si las usa, en lugar de extender lo que necesita. Tomemos, por ejemplo, la subclasificaci&oacute;n de JPanel, esto generalmente es incorrecto; y si la subclase es p&uacute;blica en alg&uacute;n lugar, nunca tendr&aacute; la oportunidad de revisar esa decisi&oacute;n. Si se accede como JComponent getThePanel (), a&uacute;n puede hacerlo (pista: exponga los modelos para los componentes como su API).</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">後で変更するのが難しくなり</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。クラスをパブリックにした場合、スーパークラスをスワップするとサブクラスが壊れます。コードをパブリックにすると、結婚することになります。したがって、実際の機能をスーパークラスに変更しない場合は、必要なものを拡張するよりも、後で使用するほうがはるかに自由に変更できます。たとえば、JPanelをサブクラス化するとします-これは通常間違っています。そして、サブクラスがどこかで公開されている場合、その決定を再訪する機会はありません。 JComponent getThePanel（）としてアクセスした場合でも、それを行うことができます（ヒント：内のコンポーネントのモデルをAPIとして公開します）。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 나중에 변경 일을 어렵게 만든다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 당신이 코드 공개 한 후, 당신이 결혼하고, 선택 - 당신은 슈퍼 클래스는 서브 클래스를 깰 것입니다 스와핑, 클래스 공개 한 경우. 따라서 실제 기능을 수퍼 클래스로 변경하지 않으면 나중에 필요한 것을 확장하지 않고 나중에 사용할 경우 훨씬 더 자유롭게 변경할 수 있습니다. 예를 들어 JPanel을 서브 클래 싱하는 경우를 생각해보십시오. 일반적으로 잘못되었습니다. 서브 클래스가 어딘가에 공개되어 있으면 그 결정을 다시 방문 할 기회가 없습니다. JComponent getThePanel ()으로 액세스하면 여전히 할 수 있습니다 (힌트 : API로 구성 요소의 모델을 노출하십시오).</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Позже становится сложнее что-то менять</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - если вы сделали класс общедоступным, замена суперкласса приведет к поломке подклассов - это выбор, на котором после того, как вы сделали код общедоступным, вы будете женаты. Поэтому, если вы не изменяете реальную функциональность своего суперкласса, вы получаете гораздо больше свободы, чтобы изменить вещи позже, если вы используете, а не расширять то, что вам нужно. Взять, к примеру, создание подклассов JPanel - это обычно неправильно; и если подкласс где-то публичный, у вас никогда не будет возможности пересмотреть это решение. Если к нему обращаются как JComponent getThePanel (), вы все равно можете это сделать (подсказка: показать модели для компонентов в качестве вашего API).</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这使以后更改内容变得更加困难</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -如果您将一个类公开，则交换超类将破坏子类-这是一个选择，一旦您将代码公开，便成为您的选择。因此，如果您不更改超类的实际功能，则可以在以后使用时有更大的自由来进行更改，而不必扩展所需的内容。以子类化JPanel为例-这通常是错误的。如果子类在某个地方是公共的，则您将永远没有机会重新审视该决定。如果以JComponent getThePanel（）的形式访问它，则仍然可以执行此操作（提示：以您的API公开内部组件的模型）。</font></font>

source: <em>It offers perverse temptations for subclassers to make assumptions about order of method calls and such</em> - such assumptions tend not to be stable if the superclass may evolve over time. See also <a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530">my toaster and coffee pot analogy</a>.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ofrece tentaciones perversas para que los subclases hagan suposiciones sobre el orden de las llamadas a m&eacute;todos y tal</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , tales suposiciones tienden a no ser estables si la superclase puede evolucionar con el tiempo. </font><font style="vertical-align: inherit;">Vea tambi&eacute;n </font></font><a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mi analog&iacute;a de tostadora y cafetera</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これは、サブクラス作成者がメソッド呼び出しの順序などについて仮定を立てるというひねくれた誘惑を提供します</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。スーパークラスが時間とともに進化する可能性がある場合、そのような仮定は安定しない傾向があります。</font></font><a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">トースターとコーヒーポットの例え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もご覧ください</font><font style="vertical-align: inherit;">。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 클래스가 메소드 호출 순서에 대한</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가정을하는 </font><em><font style="vertical-align: inherit;">등의 유혹을 제공합니다.</font></em><font style="vertical-align: inherit;"> 이러한 가정은 수퍼 클래스가 시간이 지남에 따라 진화 할 경우 안정적이지 않은 경향이 있습니다. </font></font><a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 토스터와 커피 포트 비유</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он предлагает извращенные соблазны для субклассеров делать предположения о порядке вызовов методов и тому подобное</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - такие предположения, как правило, не являются стабильными, если суперкласс может развиваться со временем. </font><font style="vertical-align: inherit;">Смотрите также </font></font><a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">мою аналогию с тостером и кофейником</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它为子类提供了不正确的诱惑，使</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他们无法对</font><em><font style="vertical-align: inherit;">方法调用的顺序进行假设，并且</font></em><font style="vertical-align: inherit;">这种假设-如果超类可能随时间演变，则这种假设可能会变得不稳定。</font><font style="vertical-align: inherit;">另请参阅</font></font><a href="http://www.javalobby.org/forums/thread.jspa?threadID=16036&amp;messageID=91819530#91819530"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的烤面包机和咖啡壶类比</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
