Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <em>Object hierarchies don't scale (or making them scale later is much harder than planning ahead)</em> - this is the classic "too many layers" problem. I'll go into this below, and how the AskTheOracle pattern can solve it (though it may offend OOP purists).
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las jerarqu&iacute;as de objetos no escalan (o hacer que escalen m&aacute;s tarde es mucho m&aacute;s dif&iacute;cil que planificar con anticipaci&oacute;n)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : este es el cl&aacute;sico problema de "demasiadas capas". </font><font style="vertical-align: inherit;">Ver&eacute; esto a continuaci&oacute;n y c&oacute;mo el patr&oacute;n AskTheOracle puede resolverlo (aunque puede ofender a los puristas de la POO).</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト階層はスケーリングされません（または後でスケーリングすること</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font><em><font style="vertical-align: inherit;">事前に計画するよりもはるかに困難です）。</font></em><font style="vertical-align: inherit;">これは、古典的な「層が多すぎる」問題です。</font><font style="vertical-align: inherit;">以下でこれについて説明し、AskTheOracleパターンがそれをどのように解決できるかを示します（ただし、OOPの純粋主義者を怒らせる可能性があります）。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개체 계층 구조는 확장되지 않습니다 (또는 나중에 확장하는 것이 미리 계획하는 것보다 훨씬 어렵습니다)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . 이것은 고전적인 "너무 많은 레이어"문제입니다. </font><font style="vertical-align: inherit;">아래에서이 문제에 대해 살펴보고 AskTheOracle 패턴이이를 해결하는 방법 (OOP 순수 주의자들을 불쾌하게 할 수 있음).</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Иерархии объектов не масштабируются (или сделать их масштабирование позже гораздо сложнее, чем планировать заранее)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это классическая проблема &laquo;слишком много слоев&raquo;. </font><font style="vertical-align: inherit;">Я расскажу об этом ниже и о том, как шаблон AskTheOracle может решить эту проблему (хотя он может оскорблять пуристов ООП).</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象层次结构无法扩展（或使它们在以后扩展比预先计划要困难得多）</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -这是经典的&ldquo;层数过多&rdquo;问题。</font><font style="vertical-align: inherit;">我将在下面进行介绍，以及AskTheOracle模式如何解决它（尽管它可能会冒犯OOP纯粹主义者）。</font></font>

source: <em>Prefer composition over inheritance as it is more malleable / easy to modify later, but do not use a compose-always approach.</em> With composition, it's easy to change behavior on the fly with Dependency Injection / Setters. Inheritance is more rigid as most languages do not allow you to derive from more than one type. So the goose is more or less cooked once you derive from TypeA.
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Prefiera la composici&oacute;n sobre la herencia, ya que es m&aacute;s maleable / f&aacute;cil de modificar m&aacute;s adelante, pero no utilice un enfoque de componer siempre. </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con la composici&oacute;n, es f&aacute;cil cambiar el comportamiento sobre la marcha con Dependency Injection / Setters. </font><font style="vertical-align: inherit;">La herencia es m&aacute;s r&iacute;gida ya que la mayor&iacute;a de los idiomas no le permiten derivar de m&aacute;s de un tipo. </font><font style="vertical-align: inherit;">Entonces, el ganso se cocina m&aacute;s o menos una vez que deriva del Tipo A.</font></font>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承よりも構成が優先されます。これは、より柔軟で、後で簡単に変更できるためです。ただし、常に作成する方法は使用しないでください。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成では、依存性注入/セッターを使用して、動作をその場で簡単に変更できます。</font><font style="vertical-align: inherit;">ほとんどの言語では複数の型からの派生が許可されていないため、継承はより厳格です。</font><font style="vertical-align: inherit;">TypeAから派生したガチョウは多かれ少なかれ調理されます。</font></font>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속 가능성이 높고 나중에 수정하기가 쉽지만 작성 항상 접근 방식을 사용하지 않으므로 상속보다 구성을 선호하십시오. </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션을 사용하면 Dependency Injection / Setter를 사용하여 동작을 쉽게 변경할 수 있습니다. </font><font style="vertical-align: inherit;">대부분의 언어에서는 여러 유형에서 파생 할 수 없으므로 상속이 더 엄격합니다. </font><font style="vertical-align: inherit;">따라서 TypeA에서 파생되면 거위는 다소 요리됩니다.</font></font>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предпочитайте композицию наследованию, так как она более гибкая / ее легко изменить позже, но не используйте подход, всегда составляемый. </font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С составом, легко изменить поведение на лету с помощью инъекций / сеттеров зависимостей. </font><font style="vertical-align: inherit;">Наследование более жесткое, так как большинство языков не позволяют вам наследовать от более чем одного типа. </font><font style="vertical-align: inherit;">Таким образом, гусь более или менее готовится, как только вы получаете от TypeA.</font></font>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">优先考虑组成而不是继承，因为它在以后更容易延展/更容易修改，但不要使用总是组合的方法。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过组合，可以轻松地通过&ldquo;依赖注入/设置器&rdquo;即时更改行为。</font><font style="vertical-align: inherit;">继承更加严格，因为大多数语言不允许您从一种以上的类型派生。</font><font style="vertical-align: inherit;">因此，一旦从TypeA派生，鹅或多或少就会被煮熟。</font></font>

source: <em>Truck is a Vehicle</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El cami&oacute;n es un veh&iacute;culo</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">トラックは乗り物</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">트럭은 차량입니다</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Грузовик - это транспортное средство</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">卡车是一辆车</font></font></em>

source: <strong><em>Cons of Composition:</em></strong>
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Contras de composici&oacute;n:</font></font></em></strong>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成の短所：</font></font></em></strong>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성의 단점 :</font></font></em></strong>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Минусы композиции:</font></font></em></strong>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">组成的缺点：</font></font></em></strong>

source: <strong><em>Pros of Inheritance:</em></strong>
es: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ventajas de la herencia:</font></font></em></strong>
ja: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承の長所：</font></font></em></strong>
ko: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속의 장점 :</font></font></em></strong>
ru: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Плюсы наследования:</font></font></em></strong>
zh_cn: <strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承的优点：</font></font></em></strong>

source: <strong>Because inheritance is a poor way of moving information</strong>.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Porque la herencia es una mala forma de mover informaci&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承は情報を移動するための貧弱な方法だから</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 정보를 옮기는 데 나쁜 방법이기 때문</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Потому что наследование - плохой способ передачи информации</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为继承是传递信息的不良方法</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong>Disadvantages of Inheritance:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desventajas de la herencia:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承の短所：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속의 단점 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недостатки наследования:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承的缺点：</font></font></strong>

source: <strong>Example 1: Dog --&gt; Animal</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo 1: Perro -&gt; Animal</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例1：犬-&gt;動物</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 1 : 개-&gt; 동물</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример 1: Собака -&gt; Животное</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例1：狗-&gt;动物</font></font></strong>

source: <strong>Example 2: Circle -/-&gt; Ellipse</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo 2: C&iacute;rculo - / -&gt; Elipse</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例2：円-/-&gt;楕円</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예 2 : 원-/-&gt; 타원</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример 2: Круг - / -&gt; Эллипс</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示例2：圆形-/-&gt;椭圆</font></font></strong>

source: <strong>Subclassing</strong> means implicit reuse of method implementations.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Subclasificar</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa reutilizaci&oacute;n impl&iacute;cita de implementaciones de m&eacute;todos.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブクラス化と</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、メソッド実装を暗黙的に再利用することです。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 클래</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 싱은 메서드 구현의 암묵적인 재사용을 의미합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подклассирование</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает неявное повторное использование реализаций метода.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子类化</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">意味着方法实现的隐式重用。</font></font>

source: <strong>Subtyping</strong> means conforming to a type (interface) signature, i.e. a set of APIs, and one can override part of the signature to achieve subtyping polymorphism.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Subtipar</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa ajustarse a una firma de tipo (interfaz), es decir, un conjunto de API, y uno puede anular parte de la firma para lograr el polimorfismo de subtipificaci&oacute;n.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブタイピングと</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、タイプ（インターフェース）シグニチャー（つまり、APIのセット）に準拠することを意味し、シグニチャーの一部をオーバーライドして、サブタイピングのポリモーフィズムを実現できます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 타이핑</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 유형 (인터페이스) 서명, 즉 API 세트를 따르는 것을 의미하며 </font><strong><font style="vertical-align: inherit;">서브 타이핑</font></strong><font style="vertical-align: inherit;"> 다형성을 달성하기 위해 서명의 일부를 무시할 수 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Подтипирование</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает соответствие сигнатуре типа (интерфейса), то есть набора API, и можно переопределить часть сигнатуры для достижения полиморфизма подтипа.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型化意味着符合类型（接口）签名，即一组API，并且可以覆盖部分签名以实现子类型多态性。</font></font>

source: <strong>Update:</strong> Just came back to my answer and it seems now that it is incomplete without a specific mention of Barbara Liskov's <a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle">Liskov Substitution Principle</a> as a test for 'Should I be inheriting from this type?'
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizaci&oacute;n:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Acabo de regresar a mi respuesta y parece que ahora est&aacute; incompleta sin una menci&oacute;n espec&iacute;fica del Principio de </font></font><a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sustituci&oacute;n de Liskov</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Barbara Liskov </font><font style="vertical-align: inherit;">como prueba para '&iquest;Deber&iacute;a heredar de este tipo?'</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ちょうど私の答えに戻ってきましたが、</font><font style="vertical-align: inherit;">「このタイプから継承する必要がありますか？」のテストとして、</font><font style="vertical-align: inherit;">Barbara Liskovの</font></font><a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Liskov Substitution Principle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の具体的な言及がないと、それは不完全なよう</font><font style="vertical-align: inherit;">です。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업데이트 :</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방금 내 대답으로 돌아 왔으며 </font><font style="vertical-align: inherit;">'이 유형에서 상속해야합니까?'에 대한 테스트로 </font><font style="vertical-align: inherit;">Barbara Liskov의 </font></font><a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Liskov 대체 원칙에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 언급이 없으면 불완전한 것으로 보입니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновление:</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> только что вернулся к моему ответу, и теперь кажется, что он неполон без конкретного упоминания </font></font><a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принципа подстановки Лискова</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Барбары </font><font style="vertical-align: inherit;">в качестве теста для &laquo;Должен ли я наследовать от этого типа?&raquo;</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新：</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">刚刚回到我的答案，现在似乎没有完整提及Barbara Liskov的</font></font><a href="http://en.wikipedia.org/wiki/Liskov_substitution_principle"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Liskov替代原则</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这是不完整的</font><font style="vertical-align: inherit;">，以检验&ldquo;我是否应该继承这种类型？&rdquo;</font></font>

source: @MatthieuM. says in <a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@MatthieuM. </font><font style="vertical-align: inherit;">dice en </font></font><a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@MatthieuM。</font><a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448"><font style="vertical-align: inherit;">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448で</font></a><font style="vertical-align: inherit;">言う</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@MatthieuM. </font><a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448"><font style="vertical-align: inherit;">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448</font></a><font style="vertical-align: inherit;"> 에 나와 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@MatthieuM. </font><font style="vertical-align: inherit;">говорит в </font></font><a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@MatthieuM。</font><font style="vertical-align: inherit;">在</font><a href="https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448"><font style="vertical-align: inherit;">https://softwareengineering.stackexchange.com/questions/12439/code-smell-inheritance-abuse/12448#comment303759_12448中</font></a><font style="vertical-align: inherit;">说</font></font><font style="vertical-align: inherit;"></font>
