Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: E.g 2. Book <strong>is a</strong> SellingItem. A SellingItem cannot be instantiated - it is abstract concept. Hence I will use inheritacne. The SellingItem is an <strong>abstract base class (or interface</strong> in C#)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ej. 2. El libro </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es un art&iacute;culo de</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> venta. </font><font style="vertical-align: inherit;">Un art&iacute;culo de venta no puede ser instanciado, es un concepto abstracto. </font><font style="vertical-align: inherit;">Por lo tanto, usar&eacute; la herencia. </font><font style="vertical-align: inherit;">SellingItem es una </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase base abstracta (o interfaz</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en C #)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例2. Book </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> SellingItemです。</font><font style="vertical-align: inherit;">SellingItemはインスタンス化できません-それは抽象的な概念です。</font><font style="vertical-align: inherit;">したがって、私はinheritacneを使用します。</font><font style="vertical-align: inherit;">SellingItemは</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抽象基本クラス（または</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> C＃の</font><strong><font style="vertical-align: inherit;">インターフェース</font></strong><font style="vertical-align: inherit;">）です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 2. Book </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">은</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> SellingItem입니다. </font><font style="vertical-align: inherit;">SellingItem은 인스턴스화 할 수 없으며 추상적 개념입니다. </font><font style="vertical-align: inherit;">따라서 나는 상속을 사용합니다. </font><font style="vertical-align: inherit;">SellingItem은 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추상 기본 클래스 (또는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> C #의 </font><strong><font style="vertical-align: inherit;">인터페이스</font></strong><font style="vertical-align: inherit;"> )입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, 2. Книга </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">является</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предметом продажи. </font><font style="vertical-align: inherit;">SellingItem не может быть создан - это абстрактное понятие. </font><font style="vertical-align: inherit;">Следовательно, я буду использовать наследство. </font><font style="vertical-align: inherit;">SellingItem - это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">абстрактный базовый класс (или интерфейс</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в C #)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如2.书</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> SellingItem。</font><font style="vertical-align: inherit;">SellingItem无法实例化-这是抽象概念。</font><font style="vertical-align: inherit;">因此，我将使用Inheritacne。</font><font style="vertical-align: inherit;">SellingItem是一个</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">抽象基类（或</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> C＃中的</font><strong><font style="vertical-align: inherit;">接口</font></strong><font style="vertical-align: inherit;">）</font></font>

source: Either the base class <code>Engine</code> exposes a mutator to change its
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O bien el </font></font> <code>Engine</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> clase base </font><font style="vertical-align: inherit;">expone a un mutador para cambiar su</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本クラス</font></font> <code>Engine</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、ミューテーターを公開して、</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스 </font></font> <code>Engine</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 변경자를 변경하기 위해 뮤 테이터를 노출시킵니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Либо базовый класс </font></font> <code>Engine</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выставляет мутатор для изменения его</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基类</font></font> <code>Engine</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">公开了一个更改器以更改其</font></font>

source: Essentially, this means that inheritance is possible if the base class can be used polymorphically, which I believe is equivalent to our test "a bar is a foo and bars can do everything that foos can do".
es: Esencialmente,esto significa que la herencia es posible si la clase base puede ser usada polimórficamente,lo que creo que es equivalente a nuestra prueba "una barra es un foo y las barras pueden hacer todo lo que los foos pueden hacer".
ja: 本質的には、基底クラスが多相的に使用できる場合には継承が可能であることを意味しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본적으로 이것은 기본 클래스를 다형성으로 사용할 수있는 경우 상속이 가능하다는 것을 의미합니다. 이는 "바는 foo이고 바는 foo가 할 수있는 모든 작업을 수행 할 수 있습니다"라고 생각합니다.</font></font>
ru: По сути,это означает,что наследование возможно,если базовый класс можно использовать полиморфно,что,на мой взгляд,эквивалентно нашему тесту "бар-это фу,а бары могут делать все,что могут делать фу".
zh_cn: 本质上,这意味着如果基类可以多态化使用,那么继承是可以的,我认为这就相当于我们的测试 "a bar是foo,而bar可以做foos能做的一切事情"。

source: Even if you <em>can</em> use inheritance doesn't mean you <em>should</em>: using composition is always an option. Inheritance is a powerful tool allowing implicit code reuse and dynamic dispatch, but it does come with a few disadvantages, which is why composition is often preferred. The trade-offs between inheritance and composition aren't obvious, and in my opinion are best explained in <a href="https://stackoverflow.com/a/32557773/1951907">lcn's answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Incluso si se </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">puede</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> utilizar la herencia no significa que usted </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">debe</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el uso de la composici&oacute;n es siempre una opci&oacute;n. La herencia es una herramienta poderosa que permite la reutilizaci&oacute;n impl&iacute;cita de c&oacute;digo y el despacho din&aacute;mico, pero viene con algunas desventajas, por lo que a menudo se prefiere la composici&oacute;n. Las compensaciones entre herencia y composici&oacute;n no son obvias y, en mi opini&oacute;n, se explican mejor en </font></font><a href="https://stackoverflow.com/a/32557773/1951907"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la respuesta de lcn</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたがいても</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">することができます</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承を使用し、あなたが意味するものではありません</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">べき</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：組成物を用いて、常にオプションです。継承は、暗黙的なコードの再利用と動的なディスパッチを可能にする強力なツールですが、いくつかの欠点があるため、多くの場合、構成が優先されます。継承と構成の間のトレードオフは明らかではありません。私の意見では、</font></font><a href="https://stackoverflow.com/a/32557773/1951907"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lcnの回答</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で最もよく説明されてい</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">을</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 </font><em><font style="vertical-align: inherit;">수</font></em><font style="vertical-align: inherit;"> 있다고 </font><font style="vertical-align: inherit;">해서 </font><font style="vertical-align: inherit;">반드시 컴포지션 </font><font style="vertical-align: inherit;">을 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사용해야</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 것은 아닙니다. 상속은 암시 적 코드 재사용 및 동적 디스패치를 ​​허용하는 강력한 도구이지만 몇 가지 단점이 있으므로 구성이 종종 선호됩니다. 상속과 구성 간의 상충 관계는 분명하지 않으며 </font></font><a href="https://stackoverflow.com/a/32557773/1951907"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lcn의 답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 가장 잘 설명되어 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Даже если вы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">можете</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использовать наследование, это не значит, что вы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">должны</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> использовать композицию всегда. Наследование - это мощный инструмент, позволяющий неявное повторное использование кода и динамическую диспетчеризацию, но у него есть несколько недостатков, поэтому составление часто предпочтительнее. Компромиссы между наследованием и составом не очевидны, и, на мой взгляд, лучше всего объяснить в </font></font><a href="https://stackoverflow.com/a/32557773/1951907"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответе lcn</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即使您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用继承也不意味着您</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">应该</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：使用组合始终是一种选择。继承是一个强大的工具，允许隐式代码重用和动态分配，但是它确实有一些缺点，这就是为什么通常首选组合的原因。继承与组合之间的权衡并不明显，我认为最好在</font></font><a href="https://stackoverflow.com/a/32557773/1951907"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">lcn的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font><font style="vertical-align: inherit;">加以</font><font style="vertical-align: inherit;">解释</font><font style="vertical-align: inherit;">。</font></font>

source: Even though Composition is preferred, I would like to highlight pros of <em>Inheritance</em> and cons of <em>Composition</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aunque se prefiere la Composici&oacute;n, me gustar&iacute;a destacar los pros de la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Herencia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los contras de la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Composici&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">組成物が好まれていますが、私はプロの強調表示したい</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の継承</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">との短所</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">構成を</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구성이 바람직하더라도, 나는의 장점 강조하고 싶은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 양론 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">조성</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Несмотря на то, что композиция является предпочтительной, я хотел бы выделить плюсы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">наследования</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и минусы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">композиции</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即使首选Composition，我还是要强调</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">优点</font><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Composition的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">缺点</font><font style="vertical-align: inherit;">。</font></font>

source: Excessive reusing by sub-classing can make the inheritance stack very deep and very confusing too.
es: La reutilización excesiva por subclasificación puede hacer que la pila de herencia sea muy profunda y muy confusa también.
ja: サブクラスによる過剰な再利用は、継承スタックを非常に深くし、非常に混乱させます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 클래 싱에 의한 과도한 재사용은 상속 스택을 매우 깊고 혼란스럽게 만들 수 있습니다.</font></font>
ru: Чрезмерное повторное использование с помощью подклассов может сделать стек наследства очень глубоким и очень запутанным.
zh_cn: 通过子类的过度重用会使继承堆栈变得很深,也很混乱。

source: Expose no fields, ever, except constants
es: No exponga ningún campo,nunca,excepto las constantes
ja: 定数以外のフィールドは一切公開しない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상수를 제외하고 필드를 노출하지 마십시오.</font></font>
ru: Никогда не открывайте никаких полей,кроме констант.
zh_cn: 除了常数之外,不暴露任何字段。

source: Functions that use pointers or references to base classes must be able to use objects of derived classes without knowing it
es: Las funciones que utilizan punteros o referencias a clases base deben ser capaces de utilizar objetos de clases derivadas sin saberlo
ja: 基底クラスへのポインタや参照を使用する関数は、それを知らずに派生クラスのオブジェクトを使用することができなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스에 대한 포인터 또는 참조를 사용하는 함수는 몰래 파생 클래스의 객체를 사용할 수 있어야합니다.</font></font>
ru: Функции,использующие указатели или ссылки на базовые классы,должны уметь использовать объекты производных классов,не зная об этом.
zh_cn: 使用指针或引用基类的函数必须能够在不知道的情况下使用派生类的对象。

source: Generally type of relationship between object provide better information to choose one of them.
es: Por lo general,el tipo de relación entre los objetos proporciona mejor información para elegir uno de ellos.
ja: 一般的にオブジェクト間の関係のタイプは、それらのいずれかを選択するためのより良い情報を提供します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 객체 간의 관계 유형은 더 나은 정보를 제공하여 객체 중 하나를 선택할 수 있습니다.</font></font>
ru: Как правило,тип отношений между объектами предоставляет лучшую информацию для выбора одного из них.
zh_cn: 一般来说,对象之间的关系类型提供了较好的信息,可以选择其中的一个。

source: However, if the parent class for some reason needs to access functions provided by the "child class" for inexperienced programmer it may look like it's a great place to use inheritance. The parent class can just call it's own abstract "foo()" which is overwritten by the subclass and then it can give the value to the abstract base.
es: Sin embargo,si la clase de padres por alguna razón necesita acceder a las funciones proporcionadas por la "clase de niños" para los programadores sin experiencia,puede parecer que es un gran lugar para usar la herencia.La clase padre puede simplemente llamar a su propio abstracto "foo()",que es sobrescrito por la subclase y entonces puede dar el valor a la base abstracta.
ja: しかし、何らかの理由で親クラスが「子クラス」が提供する関数にアクセスする必要がある場合、経験の浅いプログラマーにとっては、継承を使うには最適な場所のように見えるかもしれません。親クラスはそれ自身の抽象的な「foo()」を呼び出すだけで、それをサブクラスが上書きして、抽象的なベースに値を与えることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 어떤 이유로 부모 클래스가 경험이없는 프로그래머를 위해 "자식 클래스"에서 제공하는 함수에 액세스해야하는 경우 상속을 사용하기에 좋은 장소 인 것 같습니다. </font><font style="vertical-align: inherit;">부모 클래스는 서브 클래스로 덮어 쓰는 자체 추상 "foo ()"를 호출 한 다음 추상베이스에 값을 제공 할 수 있습니다.</font></font>
ru: Однако,если родительскому классу по каким-то причинам понадобится доступ к функциям,предоставляемым "дочерним классом" для неопытного программиста,то это может показаться отличным местом для использования наследования.Родительский класс может просто назвать свой собственный абстрактный "foo()",который перезаписывается подклассом,а затем передать значение в абстрактную базу.
zh_cn: 但是,如果父类因为某种原因需要访问 "子类 "提供的函数,对于没有经验的程序员来说,可能看起来是使用继承的好地方。父类只需要调用自己的抽象 "foo()"就可以了,而这个子类就可以把这个值交给抽象的基类。

source: However, if you want to use the private variables, the case 3, then you may be in trouble. <strong>If you consider global variables unsafe, then you should consider using inheritance to get access to private variables also unsafe</strong>. Mind you, global variables are not all THAT bad - databases are essentially big set of global variables. But if you can handle it, then it's quite fine.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, si desea utilizar las variables privadas, el caso 3, entonces puede estar en problemas. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si considera que las variables globales no son seguras, entonces deber&iacute;a considerar usar la herencia para obtener acceso a variables privadas que tambi&eacute;n son inseguras</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Eso s&iacute;, las variables globales no son TAN malas: las bases de datos son esencialmente un gran conjunto de variables globales. Pero si puedes manejarlo, entonces est&aacute; bastante bien.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、プライベート変数（ケース3）を使用する場合は、問題が発生する可能性があります。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">グローバル変数を安全でないと考える場合は、継承を使用してプライベート変数へのアクセスも安全でないことを考慮する必要があります</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。大事なことは、グローバル変数はそれほど悪いことではありません-データベースは本質的に大きなグローバル変数のセットです。しかし、それを処理できる場合は、それで問題ありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 개인 변수, 사례 3을 사용하려면 문제가있을 수 있습니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전역 변수를 안전하지 않은 것으로 간주하면 상속을 사용하여 개인 변수에 대한 액세스도 안전하지 않은 것으로 고려해야</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다. </font><font style="vertical-align: inherit;">전역 변수가 모두 나쁜 것은 아닙니다. 데이터베이스는 본질적으로 큰 전역 변수 세트입니다. </font><font style="vertical-align: inherit;">그러나 당신이 그것을 처리 할 수 ​​있다면, 그것은 좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако, если вы хотите использовать закрытые переменные, случай 3, то у вас могут быть проблемы. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы считаете глобальные переменные небезопасными, то вам следует рассмотреть возможность использования наследования для получения доступа к закрытым переменным, также небезопасным</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Имейте в виду, что глобальные переменные - это еще не все, что Плохо - базы данных представляют собой большой набор глобальных переменных. Но если вы можете справиться с этим, то это вполне нормально.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，如果要使用私有变量（情况3），则可能会遇到麻烦。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您认为全局变量不安全，则应考虑使用继承来访问也不安全的私有变量</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。提醒您，全局变量并不全是坏事-数据库本质上是一大组全局变量。但是，如果您可以处理，那就很好。</font></font>

source: However, if your intention is purely that of code re-use, then composition most likely is a better design choice.
es: Sin embargo,si su intención es puramente la de reutilizar el código,entonces lo más probable es que la composición sea una mejor opción de diseño.
ja: しかし、あなたの意図が純粋にコードの再利用だけであるならば、構成は最も可能性が高く、より良いデザインの選択です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 의도가 코드 재사용의 의도라면 컴포지션이 더 나은 디자인 선택입니다.</font></font>
ru: Однако,если вы намерены использовать код исключительно повторно,то композиция,скорее всего,является лучшим выбором дизайна.
zh_cn: 但是,如果你的目的纯粹是为了代码的重用,那么构图很可能是一个更好的设计选择。
