Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I agree with @Pavel, when he says, there are places for composition and there are places for inheritance.
es: Estoy de acuerdo con @Pavel,cuando dice que hay lugares para la composición y hay lugares para la herencia.
ja: 私は、@Pavel氏が言うところの「構成する場所と継承する場所がある」に同意します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그가 @Pavel에 동의하면 작곡 장소와 상속 장소가 있다고 말합니다.</font></font>
ru: Я согласен с @Павелем,когда он говорит,что есть места для композиции и есть места для наследования.
zh_cn: 我同意@Pavel的说法,当他说的时候,我同意他说的,作文有地方,继承也有地方。

source: I can think of three real reasons for using inheritance:
es: Se me ocurren tres razones reales para usar la herencia:
ja: 相続を利用する本当の理由は3つ思いつきます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 사용하는 세 가지 실제 이유를 생각할 수 있습니다.</font></font>
ru: Я могу придумать три реальные причины для использования наследства:
zh_cn: 我能想到三个真正使用继承的理由。

source: I have three classes that all need some common functionality. So if I write a base class and have them all inherit from it, then they will all have that functionality and I'll only need to maintain it in once place.
es: Tengo tres clases que necesitan una funcionalidad común.Así que si escribo una clase base y las tengo todas heredadas de ella,entonces todas tendrán esa funcionalidad y sólo necesitaré mantenerla en un lugar.
ja: 私は3つのクラスを持っていますが、それらはすべて共通の機能を必要としています。ですから、もし基底クラスを書いてそれを継承させれば、それらのクラスはすべてその機能を持っていることになり、私はそれを一度にメンテナンスする必要があるだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공통적 인 기능이 필요한 세 가지 클래스가 있습니다. </font><font style="vertical-align: inherit;">따라서 기본 클래스를 작성하고 모든 클래스를 상속 받으면 모두 해당 기능을 갖게되므로 한 번만 유지하면됩니다.</font></font>
ru: У меня есть три класса,которые все нуждаются в общей функциональности.Так что если я напишу базовый класс и все они унаследуют от него,то все они будут иметь такую функциональность,и мне нужно будет поддерживать его только один раз.
zh_cn: 我有三个类,它们都需要一些共同的功能。所以,如果我写一个基类,让它们都继承到这个基类,那么它们都会有这个功能,而且我只需要在一个地方维护它。

source: I see no one mentioned the <a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong>diamond problem</strong></a>, which might arise with inheritance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Veo que nadie mencion&oacute; el </font></font><a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">problema</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del </font><strong><font style="vertical-align: inherit;">diamante</font></strong><font style="vertical-align: inherit;"> , que podr&iacute;a surgir con la herencia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承で発生する可能性の</font><font style="vertical-align: inherit;">ある</font></font><a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ダイヤモンドの問題</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">について誰も言及して</font><font style="vertical-align: inherit;">いません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속과 관련하여 발생할 수 </font><font style="vertical-align: inherit;">있는 </font></font><a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다이아몬드 문제에</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대해서는 아무도 언급하지 않았습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я вижу, что никто не упомянул </font></font><a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проблему алмазов</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , которая может возникнуть при наследовании.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我看不到有人提到</font></font><a href="http://en.wikipedia.org/wiki/Multiple_inheritance#The_diamond_problem"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">钻石问题</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这可能是继承带来的。</font></font>

source: I take no credit for this approach. I took it straight from the <a href="https://rads.stackoverflow.com/amzn/click/com/0735619670">Second Edition of Code Complete</a> by <a href="http://blogs.construx.com/blogs/stevemcc/default.aspx">Steve McConnell</a>, <em>Section 6.3</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No me atribuyo cr&eacute;dito por este enfoque. </font><font style="vertical-align: inherit;">Lo tom&eacute; directamente de la </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/0735619670"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Segunda Edici&oacute;n de Code Complete</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font></font><a href="http://blogs.construx.com/blogs/stevemcc/default.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Steve McConnell</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Secci&oacute;n 6.3</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私はこのアプローチを信用していません。</font><font style="vertical-align: inherit;">私は</font><font style="vertical-align: inherit;">、</font><a href="http://blogs.construx.com/blogs/stevemcc/default.aspx"><font style="vertical-align: inherit;">Steve McConnell</font></a><font style="vertical-align: inherit;">による</font></font><a href="https://rads.stackoverflow.com/amzn/click/com/0735619670"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードコンプリートの第2版</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font><em><font style="vertical-align: inherit;">セクション6.3</font></em><font style="vertical-align: inherit;">からそれを直接取り入れました</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는이 접근법에 대해 아무런 신용도받지 않는다. </font><font style="vertical-align: inherit;">나는에서 똑바로했다 </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/0735619670"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 코드의 두 번째 판</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 의해 </font></font><a href="http://blogs.construx.com/blogs/stevemcc/default.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스티브 맥코넬</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">6.3 절</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я не принимаю кредит на этот подход. </font><font style="vertical-align: inherit;">Я взял это прямо из </font></font><a href="https://rads.stackoverflow.com/amzn/click/com/0735619670"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">второго издания Code Complete,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выполненного </font></font><a href="http://blogs.construx.com/blogs/stevemcc/default.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Стивом Макконнеллом</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">раздел 6.3</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我不相信这种方法。</font><font style="vertical-align: inherit;">我把它直接从</font></font><a href="https://rads.stackoverflow.com/amzn/click/com/0735619670"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码的第二版完全</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由</font></font><a href="http://blogs.construx.com/blogs/stevemcc/default.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">史蒂夫&middot;麦康奈尔</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第6.3节</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: I think inheritance should be used if your answer is an affirmative to any of these questions.
es: Creo que la herencia debe usarse si su respuesta es afirmativa a cualquiera de estas preguntas.
ja: 相続は、どれか一つでも肯定的な回答であれば使うべきだと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 답변이 위의 질문 중 하나라도 긍정적이라면 상속을 사용해야한다고 생각합니다.</font></font>
ru: Я думаю,что наследство следует использовать,если ваш ответ утвердительный на любой из этих вопросов.
zh_cn: 我认为,如果你的答案是肯定的,就应该使用继承权。

source: I would suggest using composing as the default. It is more modular, and gives the benefit of late binding (you can change the component dynamically). Also it's easier to test the things separately. And if you need to use a method from a class, you are not forced to be of certain form (Liskov Substitution Principle).
es: Sugeriría que se utilice la composición como el valor predeterminado.Es más modular,y da el beneficio de la encuadernación tardía (se puede cambiar el componente dinámicamente).También es más fácil probar las cosas por separado.Y si necesitas usar un método de una clase,no estás obligado a ser de cierta forma (Principio de Sustitución de Liskov).
ja: 私はデフォルトで composing を使うことをお勧めします。これはよりモジュール化されており、レイトバインディングの利点があります (コンポーネントを動的に変更することができます)。また、個別にテストするのも簡単です。また、クラスからメソッドを使う必要がある場合、特定の形式を強制されることもありません(Liskov Substitution Principle)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">작성을 기본값으로 사용하는 것이 좋습니다. </font><font style="vertical-align: inherit;">더 모듈화되어 있으며 후기 바인딩의 이점을 제공합니다 (구성 요소를 동적으로 변경할 수 있음). </font><font style="vertical-align: inherit;">또한 사물을 별도로 테스트하는 것이 더 쉽습니다. </font><font style="vertical-align: inherit;">그리고 클래스의 메소드를 사용해야하는 경우 특정 형식 (Liskov 대체 원칙)이 아니어야합니다.</font></font>
ru: Я бы предложил использовать композицию по умолчанию.Она более модульная,и дает преимущество позднего связывания (можно изменять компонент динамически).Также проще тестировать вещи по отдельности.И если вам нужно использовать метод из класса,вы не обязаны быть в определенной форме (Liskov Substitution Principle).
zh_cn: 我建议使用composing作为默认设置。它更模块化,而且有后期绑定的好处(你可以动态改变组件)。另外,它更容易分别测试的东西。而且,如果你需要使用类中的方法,也不会被强制要求一定形式(Liskov Substitution Principle)。

source: If code reuse is the <em>sole</em> purpose, subclassing may give one more than what he needs, i.e. some public methods of the parent class don't make much sense for the child class. In this case, instead of favoring composition over inheritance, composition is <em>demanded</em>. This is also where the "is-a" vs. "has-a" notion comes from.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si la reutilizaci&oacute;n del c&oacute;digo es el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&uacute;nico</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> prop&oacute;sito, la subclase puede dar uno m&aacute;s de lo que necesita, es decir, algunos m&eacute;todos p&uacute;blicos de la clase principal no tienen mucho sentido para la clase secundaria. </font><font style="vertical-align: inherit;">En este caso, en lugar de favorecer la composici&oacute;n sobre la herencia, se </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">exige la</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> composici&oacute;n </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Aqu&iacute; tambi&eacute;n es de donde viene la noci&oacute;n "es-a" vs. "tiene-a".</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードの再利用が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">唯一の</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">目的である場合、サブクラス化によって必要なものよりも1つ多くなる可能性があります。つまり、親クラスのいくつかのパブリックメソッドは、子クラスにはあまり意味がありません。</font><font style="vertical-align: inherit;">この場合、継承よりも構成を優先する代わりに、構成が</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要求され</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これは「is-a」対「has-a」の概念の由来でもあります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드 재사용이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유일한</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 목적 </font><font style="vertical-align: inherit;">이라면 </font><font style="vertical-align: inherit;">, 서브 클래 싱은 필요한 것 이상을 제공 할 수 있습니다. 즉, 부모 클래스의 일부 공용 메소드는 자식 클래스에 대해 의미가 없습니다. </font><font style="vertical-align: inherit;">이 경우, 대신에 상속 위에 조성물을 선호에, 조성은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요구</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이것은 "is-a"대 "has-a"개념의 유래이기도합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если повторное использование кода является </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">единственной</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> целью, создание подклассов может дать больше, чем ему нужно, то есть некоторые открытые методы родительского класса не имеют особого смысла для дочернего класса. </font><font style="vertical-align: inherit;">В этом случае, вместо того, чтобы отдавать предпочтение композиции над наследованием, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">требуется</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> композиция </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Это также то, откуда приходит понятие &laquo;есть&raquo; против &laquo;имеет&raquo;.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果代码重用是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">唯一的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">目的，则子类提供的功能可能比他所需要的多，即子类的某些公共方法对子类没有多大意义。</font><font style="vertical-align: inherit;">在这种情况下，代替偏袒继承组合物，组合物被</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要求</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这也是&ldquo; is-a&rdquo;与&ldquo; has-a&rdquo;概念的来源。</font></font>

source: If relation type is "IS-A" relation then Inheritance is better approach. otherwise relation type is "HAS-A" relation then composition will better approach.
es: Si el tipo de relación es la relación "IS-A" entonces la herencia es un mejor enfoque.Si el tipo de relación es la relación "HAS-A" entonces la composición es un mejor enfoque.
ja: 関係の種類が "IS-A "の関係であれば継承、そうでなければ "HAS-A "の関係であれば構成の方が良いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">관계 유형이 "IS-A"관계이면 상속이 더 나은 방법입니다. </font><font style="vertical-align: inherit;">그렇지 않으면 관계 유형이 "HAS-A"관계이면 컴포지션이 더 잘 접근합니다.</font></font>
ru: Если тип отношения-отношение "IS-A",то наследование-лучший подход.В противном случае тип отношения-отношение "HAS-A",то состав будет лучше приближаться.
zh_cn: 如果关系类型是 "IS-A "关系,那么继承是比较好的方法。

source: If the object need to be of the same type, then use <strong>Inheritance</strong> or implement interfaces.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si el objeto necesita ser del mismo tipo, use </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Herencia</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o implemente interfaces.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトを同じ型にする必要がある場合は、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する</font><font style="vertical-align: inherit;">か、インターフェイスを実装します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체의 유형이 동일해야하는 경우 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 사용 </font><font style="vertical-align: inherit;">하거나 인터페이스를 구현하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если объект должен быть того же типа, тогда используйте </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наследование</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или реализуйте интерфейсы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果对象必须是同一类型，则使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或实现接口。</font></font>

source: If the reason is number 2 it gets a bit tricky. Do you really only need to use the same base class? In general, just using the same base class is not good enough, but it may be a requirement of your framework, a design consideration which can not be avoided.
es: Si la razón es la número 2 se pone un poco difícil.¿Realmente sólo necesitas usar la misma clase de base? En general,usar la misma clase base no es suficiente,pero puede ser un requisito de su marco,una consideración de diseño que no puede ser evitada.
ja: 理由が2番の場合は少し厄介なことになります。本当に同じ基底クラスだけを使う必要があるのでしょうか?一般的に、同じ基底クラスを使うだけでは十分ではありませんが、それはフレームワークの要件であり、設計上の考慮事項であり、避けることはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이유가 2 번이면 조금 까다 롭습니다. </font><font style="vertical-align: inherit;">실제로 동일한 기본 클래스 만 사용해야합니까? </font><font style="vertical-align: inherit;">일반적으로 동일한 기본 클래스를 사용하는 것만으로는 충분하지 않지만 프레임 워크의 요구 사항이 될 수 있으며 피할 수없는 디자인 고려 사항 일 수 있습니다.</font></font>
ru: Если причина-номер 2,то она становится немного хитрой.Вам действительно нужно использовать только тот же базовый класс? В общем,просто использовать один и тот же базовый класс не достаточно хорошо,но это может быть требованием вашего каркаса,проектным соображением,которого нельзя избежать.
zh_cn: 如果原因是2号,那就有点麻烦了。你真的只需要使用相同的基类吗?一般来说,仅仅使用相同的基类是不够好的,但这可能是你的框架的要求,这是一个设计上无法避免的考虑。

source: If these are true, then it is probably necessary to use inheritance.
es: Si esto es cierto,entonces probablemente sea necesario usar la herencia.
ja: これらが真であれば、継承を利用する必要があるのではないでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 사실이라면 상속을 사용해야 할 것입니다.</font></font>
ru: Если это правда,то,вероятно,необходимо использовать наследование.
zh_cn: 如果这些都是真的,那么可能就需要使用继承。

source: If you understand the difference, it's easier to explain.
es: Si entiendes la diferencia,es más fácil de explicar.
ja: 違いを理解していれば、説明しやすいと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차이점을 이해하면 설명하기가 더 쉽습니다.</font></font>
ru: Если ты понимаешь разницу,это легче объяснить.
zh_cn: 如果你能明白其中的区别,解释起来就比较容易了。

source: In Java or C#, an object cannot change its type once it has been instantiated.
es: En Java o C#,un objeto no puede cambiar de tipo una vez que ha sido instanciado.
ja: JavaやC#では、一度インスタンス化されたオブジェクトは型を変更することができません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 또는 C #에서 인스턴스화되면 객체의 유형을 변경할 수 없습니다.</font></font>
ru: В Java или C#объект не может изменить свой тип после его инстанцирования.
zh_cn: 在Java或C#中,对象一旦被实例化,就不能改变其类型。

source: In a glance, if classes B and C inherit A and both override method X, and a fourth class D, inherits from both B and C, and does not override X, which implementation of X D is supposed to use?
es: De un vistazo,si las clases B y C heredan A y ambas anulan el método X,y una cuarta clase D,hereda tanto de B como de C,y no anula X,¿qué implementación de X D se supone que utilice?
ja: 一見すると、クラスBとCがAを継承し、両方ともメソッドXをオーバーライドし、第4のクラスDがBとCの両方を継承し、Xをオーバーライドしない場合、X Dはどちらの実装を使用することになっているのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">B와 C 클래스가 A를 상속하고 메소드 X를 대체하고 네 번째 클래스 D를 B와 C에서 모두 상속하고 X를 대체하지 않으면 XD의 어떤 구현을 사용해야합니까?</font></font>
ru: С первого взгляда,если классы B и C наследуют A и оба переопределяют метод X,а четвертый класс D наследует и от B и от C,и не переопределяет X,какую реализацию X D предполагается использовать?
zh_cn: 一目了然,如果B类和C类继承了A类,并且都覆盖了方法X,而第四个类D,继承了B类和C类,并且不覆盖X,那么X D应该使用哪个实现?
