Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Inheritance provides straightforward <a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion">open recursion</a> via the internal polymorphic site <code>this</code>, i.e. invoking overriding method (or even <a href="http://www.scala-lang.org/old/node/1637.html#comment-5489">type</a>) in another member function, either public or private (though <a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one">discouraged</a>). Open recursion can be <a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java">simulated via composition</a>, but it requires extra effort and may not always viable(?). This <a href="https://stackoverflow.com/a/2238735/2073130">answer</a> to a duplicated question talks something similar.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La herencia proporciona </font></font><a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una recursi&oacute;n abierta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directa a </font><font style="vertical-align: inherit;">trav&eacute;s del sitio polim&oacute;rfico interno, </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es, invocando el m&eacute;todo de anulaci&oacute;n (o incluso el </font></font><a href="http://www.scala-lang.org/old/node/1637.html#comment-5489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tipo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) en otra funci&oacute;n miembro, ya sea p&uacute;blica o privada (aunque </font></font><a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">desaconsejada</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">La recursi&oacute;n abierta se puede </font></font><a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">simular a trav&eacute;s de la composici&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero requiere un esfuerzo adicional y no siempre es viable (?). </font><font style="vertical-align: inherit;">Esta </font></font><a href="https://stackoverflow.com/a/2238735/2073130"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a una pregunta duplicada habla algo similar.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承は</font><font style="vertical-align: inherit;">、内部のポリモーフィックサイト</font> <code>this</code> <font style="vertical-align: inherit;">を介して</font><font style="vertical-align: inherit;">単純な</font></font><a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オープン再帰</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">提供します</font><font style="vertical-align: inherit;">。つまり</font><font style="vertical-align: inherit;">、パブリックまたはプライベート（</font><a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one"><font style="vertical-align: inherit;">推奨されませんが</font></a><font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">別のメンバー関数で</font><font style="vertical-align: inherit;">オーバーライドメソッド（または</font><a href="http://www.scala-lang.org/old/node/1637.html#comment-5489"><font style="vertical-align: inherit;">type</font></a><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">を呼び出します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">オープンな再帰は</font><font style="vertical-align: inherit;">、</font><a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java"><font style="vertical-align: inherit;">compositionを介してシミュレート</font></a><font style="vertical-align: inherit;">できます</font><font style="vertical-align: inherit;">が、追加の作業が必要であり、常に実行できるとは限りません（？）</font><font style="vertical-align: inherit;">重複した質問</font><a href="https://stackoverflow.com/a/2238735/2073130"><font style="vertical-align: inherit;">に対する</font></a><font style="vertical-align: inherit;">この</font><font style="vertical-align: inherit;">回答</font><font style="vertical-align: inherit;">は、同様のことを話します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 간단 제공 </font></font><a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오픈 재귀</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내부 다형성 부위를 통해 </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 즉 재정 방법 (또는 호출 </font></font><a href="http://www.scala-lang.org/old/node/1637.html#comment-5489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유형</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 멤버 함수)를 하나 (비록 공개 또는 비공개 </font></font><a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">낙담</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">오픈 재귀는 </font></font><a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">composition을 통해 시뮬레이션</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 수 </font><font style="vertical-align: inherit;">있지만 추가 노력이 필요하며 항상 실행 가능한 것은 아닙니다 (?). </font><font style="vertical-align: inherit;">중복 질문에 대한 </font><font style="vertical-align: inherit;">이 </font></font><a href="https://stackoverflow.com/a/2238735/2073130"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">답변</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 비슷한 것을 말합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Наследование обеспечивает прямую </font></font><a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">открытую рекурсию</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> через внутренний полиморфный сайт </font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то есть вызов метода переопределения (или даже </font></font><a href="http://www.scala-lang.org/old/node/1637.html#comment-5489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">типа</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) в другой функции-члене, публичной или закрытой (хотя и не </font></font><a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">рекомендуется</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Открытая рекурсия может быть </font></font><a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">смоделирована с помощью композиции</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но она требует дополнительных усилий и не всегда жизнеспособна (?). </font><font style="vertical-align: inherit;">Этот </font></font><a href="https://stackoverflow.com/a/2238735/2073130"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на дублированный вопрос говорит о чем-то похожем.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">继承提供简单的</font></font><a href="https://en.wikipedia.org/wiki/This_%28computer_programming%29#Open_recursion"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">开递归</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">经由内部多态性位点</font></font> <code>this</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，即调用重写方法（或者甚至</font></font><a href="http://www.scala-lang.org/old/node/1637.html#comment-5489"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中另一个成员函数），可以是公共或私有的（虽然</font></font><a href="https://softwareengineering.stackexchange.com/questions/35946/is-it-bad-code-smell-if-private-method-calls-public-one"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">泄气</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">可以</font></font><a href="https://github.com/akottr/edu-pattern/blob/master/org.akottr.patterns.composition/src/org/akottr/patterns/composition/inheritance/Compositon.java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过composition</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来</font><font style="vertical-align: inherit;">模拟</font><font style="vertical-align: inherit;">开放递归</font><font style="vertical-align: inherit;">，但是这需要额外的精力，并且可能并不总是可行的（？）。</font><font style="vertical-align: inherit;">这个</font><font style="vertical-align: inherit;">重复问题的</font></font><a href="https://stackoverflow.com/a/2238735/2073130"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答案讲</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类似的话。</font></font>

source: Inheritance provides straightforward code reuse if not overridden, while composition has to re-code every API, even if it's just a simple job of delegation.
es: La herencia proporciona una sencilla reutilización del código si no se anula,mientras que la composición tiene que recodificar cada API,aunque sea un simple trabajo de delegación.
ja: 継承は、オーバーライドされなければストレートなコードの再利用を提供し、一方、コンポジションは、委任の単純な仕事であっても、すべてのAPIを再コード化しなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속은 재정의되지 않은 경우 간단한 코드 재사용을 제공하는 반면 컴포지션은 단순한 위임 작업 인 경우에도 모든 API를 다시 코딩해야합니다.</font></font>
ru: Наследование обеспечивает простое повторное использование кода,если его не переопределить,в то время как композиция должна перекодировать каждый API,даже если это простая работа по делегированию.
zh_cn: 继承提供了直截了当的代码重用,如果不被覆盖的话,而组成则需要对每一个API进行重新编码,哪怕只是简单的委托工作。

source: Inheritance vs. Aggregation
es: Herencia vs.Agregación
ja: 継承と集約
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속 vs. 집계</font></font>
ru: Наследство против агрегации
zh_cn: 继承与聚合的关系

source: Is your class part of a structure that benefits from polymorphism ? For example, if you had a Shape class, which declares a method called draw(), then we clearly need Circle and Square classes to be subclasses of Shape, so that their client classes would depend on Shape and not on specific subclasses.
es: ¿Su clase es parte de una estructura que se beneficia del polimorfismo? Por ejemplo,si tuvieras una clase Shape,que declara un método llamado draw(),entonces claramente necesitamos que las clases Círculo y Cuadrado sean subclases de Shape,para que sus clases clientes dependan de Shape y no de subclases específicas.
ja: あなたのクラスはポリモーフィズムの恩恵を受ける構造の一部ですか?例えば、draw()というメソッドを宣言しているShapeクラスがあったとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신의 클래스는 다형성으로부터 이익을 얻는 구조의 일부입니까? </font><font style="vertical-align: inherit;">예를 들어, draw ()라는 메서드를 선언하는 Shape 클래스가있는 경우 Circle 및 Square 클래스가 Shape의 하위 클래스가되어야 클라이언트 클래스가 특정 하위 클래스가 아닌 Shape에 종속 될 수 있습니다.</font></font>
ru: Является ли ваш класс частью структуры,которая выигрывает от полиморфизма? Например,если у вас был класс Shape,который объявляет метод,называемый draw(),то нам явно нужны классы Circle и Square,чтобы быть подклассами Shape,так чтобы их клиентские классы зависели от Shape,а не от конкретных подклассов.
zh_cn: 你的类是否属于多态性结构的一部分?例如,如果你有一个Shape类,它声明了一个叫做draw()的方法,那么我们显然需要Circle和Square类是Shape的子类,这样它们的客户端类就会依赖于Shape而不是特定的子类。

source: It establishes a logical "<strong>IS A"</strong> relation. If <em>Car</em> and <em>Truck</em> are two types of <em>Vehicle</em> ( base class), child class <strong>IS A</strong> base class.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Establece una relaci&oacute;n l&oacute;gica " </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES A"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">autom&oacute;vil</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cami&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son dos tipos de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">veh&iacute;culos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (clase base), la clase secundaria </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES una</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> clase base.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">論理的な「</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A」</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係を確立します。</font><font style="vertical-align: inherit;">場合は</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">車</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">トラックが</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の2種類があり</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">車両</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（基底クラス）、子クラスは、</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の基本クラス。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">논리적 " </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 관계를 설정합니다. </font><font style="vertical-align: inherit;">경우 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자동차</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">트럭</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 두 종류가 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">차량</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (기본 클래스), 하위 클래스 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기본 클래스.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он устанавливает логическое отношение &laquo;есть </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&raquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">автомобиль</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">грузовик</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> два типа </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">транспортного средства</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (базовый класс), дочерний класс </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ЯВЛЯЕТСЯ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> базовый класс.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它建立逻辑&ldquo; </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A&rdquo;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">关系。</font><font style="vertical-align: inherit;">如果&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">汽车&rdquo;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">卡车&rdquo;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">车辆的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">两种类型</font><font style="vertical-align: inherit;">（基本类），则子类为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IS A</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本类。</font></font>

source: It is often said that a class <code>Bar</code> can inherit a class <code>Foo</code> when the following sentence is true:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A menudo se dice que una </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> clase </font><font style="vertical-align: inherit;">puede heredar una clase </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cuando la siguiente oraci&oacute;n es verdadera:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次の文が真の場合、</font><font style="vertical-align: inherit;">クラス</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はクラス</font></font> <code>Foo</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承できる</font><font style="vertical-align: inherit;">とよく言われ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 문장이 참일 때 </font><font style="vertical-align: inherit;">클래스 </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 </font></font> <code>Foo</code> 를<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 상속받을 수 </font><font style="vertical-align: inherit;">있다고 종종 말합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Часто говорят, что класс </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может наследовать класс </font></font> <code>Foo</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> когда верно следующее предложение:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">人们常说，</font><font style="vertical-align: inherit;">当以下句子为真时，</font><font style="vertical-align: inherit;">类</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以继承类</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
