Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It looks like a nice idea, but in many cases it's better just give the class an object which implements the foo() (or even set the value provided the foo() manually) than to inherit the new class from some base class which requires the function foo() to be specified.
es: Parece una buena idea,pero en muchos casos es mejor dar a la clase un objeto que implemente el foo()(o incluso establecer el valor proporcionado por el foo()manualmente)que heredar la nueva clase de alguna clase base que requiera que se especifique la función foo().
ja: いいアイデアのように見えますが、多くの場合、関数 foo()を指定しなければならない基底クラスから新しいクラスを継承するよりも、 foo()を実装したオブジェクトをクラスに与えたほうがいいでしょう (あるいは、手動で foo()の値を設定したほうがいいかもしれません)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">좋은 생각처럼 보이지만 많은 경우에 필요한 클래스 클래스에서 새 클래스를 상속하는 것보다 foo ()를 구현하는 객체를 클래스에 제공하는 것이 좋습니다 (또는 foo ()를 수동으로 제공된 값으로 설정). 지정할 foo () 함수</font></font>
ru: Выглядит неплохой идеей,но во многих случаях лучше просто дать классу объект,который реализует foo()(или даже установить значение,предоставленное foo()вручную),чем унаследовать новый класс от какого-то базового класса,который требует указания функции foo().
zh_cn: 这看起来是个不错的想法,但在很多情况下,仅仅给类一个实现了foo()的对象(甚至可以手动设置提供的值foo())比从一些需要指定函数foo()的基类中继承新类要好。

source: It sounds great, but in practice it almost never, ever works, for one of several reasons:
es: Suena genial,pero en la práctica casi nunca,nunca funciona,por una de varias razones:
ja: それは素晴らしいことのように聞こえますが、実際には、いくつかの理由の1つで、ほとんど、これまでに動作することはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 훌륭하게 들리지만 실제로 여러 가지 이유 중 하나 때문에 거의 작동하지 않습니다.</font></font>
ru: Звучит здорово,но на практике это почти никогда,никогда не работает,по одной из нескольких причин:
zh_cn: 这听起来很好,但在实际操作中,它几乎从来没有,永远也不会起作用,原因有以下几个。

source: Its totally depend on entity relationship.
es: Depende totalmente de la relación con la entidad.
ja: それは完全に実体の関係に依存します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 엔티티 관계에 전적으로 의존합니다.</font></font>
ru: Это полностью зависит от отношений между организациями.
zh_cn: 其完全取决于实体关系。

source: Just so you know, another method used to determine whether inheritance is possible is called the <a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf">Liskov Substitution Principle</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para que lo sepas, otro m&eacute;todo utilizado para determinar si la herencia es posible se llama </font></font><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Principio de sustituci&oacute;n de Liskov</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ご存知のように、継承が可能かどうかを判断するために使用される別の方法は、</font></font><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リスコフ代入原則</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と呼ばれ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아시다시피 상속 가능 여부를 결정하는 데 사용되는 또 다른 방법을 </font></font><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Liskov 대체 원칙</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이라고합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как вы знаете, другой метод, используемый для определения возможности наследования, называется </font></font><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принципом подстановки Лискова</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">众所周知，另一种用于确定继承是否可能的方法称为</font></font><a href="http://web.archive.org/web/20110722014513/http://www.objectmentor.com/resources/articles/lsp.pdf"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Liskov替代原理</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Liskov Substitution Principle
es: Principio de sustitución de Liskov
ja: リスコフ置換原理
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">리스 코프 대체 원리</font></font>
ru: принцип замещения Лискова
zh_cn: 利斯科夫替代原理

source: Methods shall be either abstract or final
es: Los métodos serán abstractos o finales
ja: 方法は、抽象的または最終的なものとする。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">방법은 추상적이거나 최종적이어야한다</font></font>
ru: Методы должны быть абстрактными или окончательными
zh_cn: 方法应是抽象的或最终的

source: My acid test for the above is:
es: Mi prueba de fuego para lo anterior es:
ja: 私の酸のテストでは上記のようになっています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 내 산 테스트는 다음과 같습니다.</font></font>
ru: Мой тест на кислоту для вышеперечисленного:
zh_cn: 我对上述的酸度测试是:

source: My general rule of thumb: <em>Before using inheritance, consider if composition makes more sense.</em>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi regla general: </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">antes de usar la herencia, considere si la composici&oacute;n tiene m&aacute;s sentido.</font></font></em>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私の一般的な経験則：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">継承を使用する前に、構成がより意味があるかどうかを検討してください。</font></font></em>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나의 일반적인 경험 법칙 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 사용하기 전에 구성이 더 합리적인지 고려하십시오.</font></font></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мое общее правило: </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">перед использованием наследования подумайте, имеет ли смысл смысл композиции.</font></font></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我的一般经验法则：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在使用继承之前，请考虑组合是否更有意义。</font></font></em>

source: My take on what to do, if you do allow for inheritance, which you may take with a grain of salt is:
es: Mi opinión sobre lo que hay que hacer,si se permite la herencia,que se puede tomar con un grano de sal es:
ja: 私の考えでは、相続を認めるならば、塩の粒でも良いと思いますが、どうしたら良いのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속을 허용하면 소금 한 알을 가지고 할 수있는 일에 대한 나의 취지는 다음과 같습니다.</font></font>
ru: Мое мнение о том,что делать,если вы позволите наследство,которое вы можете взять с зерном соли:
zh_cn: 我的看法是,如果你真的允许继承,你可以带着一粒盐去继承,那该怎么做。

source: Now say you want to create a Manager type so you end up with:
es: Ahora di que quieres crear un tipo de Manager para que termines con:
ja: ここで、マネージャータイプを作成したいとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 관리자 유형을 만들고 싶다고 가정 해 봅시다.</font></font>
ru: Теперь скажите,что вы хотите создать тип Менеджера,и вы закончите:
zh_cn: 现在说你想创建一个经理类型,所以你最终会有。

source: Now your aircraft can start with having fixed wings
es: Ahora su avión puede comenzar con tener alas fijas
ja: これで、あなたの飛行機は固定翼を持つことから始めることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 항공기는 고정 날개로 시작할 수 있습니다</font></font>
ru: Теперь ваш самолет может начать с неподвижных крыльев.
zh_cn: 现在你的飞机可以开始拥有固定翼了

source: Now, I can replace my engine on the fly as well.
es: Ahora,puedo reemplazar mi motor sobre la marcha también.
ja: 今では、その場でエンジンの交換もできるようになりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 엔진을 즉시 교체 할 수 있습니다.</font></font>
ru: Теперь я могу заменить свой двигатель и на лету.
zh_cn: 现在,我也可以把发动机换成飞的了。

source: On the other hand <b>Object composition</b> is defined at runtime through objects acquiring references to other objects. In such a case these objects will never be able to reach each-other's protected data (no encapsulation break) and will be forced to respect each other's interface. And in this case also, implementation dependencies will be a lot less than in case of inheritance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por otro lado, la </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">composici&oacute;n de objetos</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se define en tiempo de ejecuci&oacute;n a trav&eacute;s de objetos que adquieren referencias a otros objetos. </font><font style="vertical-align: inherit;">En tal caso, estos objetos nunca podr&aacute;n alcanzar los datos protegidos de los dem&aacute;s (sin interrupci&oacute;n de encapsulaci&oacute;n) y se ver&aacute;n obligados a respetar la interfaz de los dem&aacute;s. </font><font style="vertical-align: inherit;">Y en este caso tambi&eacute;n, las dependencias de implementaci&oacute;n ser&aacute;n mucho menores que en caso de herencia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、</font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト構成</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、他のオブジェクトへの参照を取得するオブジェクトを通じて実行時に定義されます。</font><font style="vertical-align: inherit;">このような場合、これらのオブジェクトはお互いの保護されたデータに到達することができず（カプセル化の中断なし）、お互いのインターフェースを尊重することを強制されます。</font><font style="vertical-align: inherit;">この場合も、継承の場合よりも実装の依存関係が大幅に少なくなります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면에 </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 구성</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 런타임에 다른 객체에 대한 참조를 얻는 객체를 통해 정의됩니다. 이러한 경우 이러한 개체는 서로의 보호 된 데이터에 도달 할 수 없으며 (캡슐화 중단 없음) 서로의 인터페이스를 강제해야합니다. 이 경우에도 구현 종속성은 상속의 경우보다 훨씬 적습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С другой стороны, </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">композиция объектов</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> определяется во время выполнения посредством объектов, получающих ссылки на другие объекты. </font><font style="vertical-align: inherit;">В таком случае эти объекты никогда не смогут получить доступ к защищенным данным друг друга (без нарушения инкапсуляции) и будут вынуждены соблюдать интерфейс друг друга. </font><font style="vertical-align: inherit;">И в этом случае зависимости реализации также будут намного меньше, чем в случае наследования.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一方面，</font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象组成</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是在运行时通过对象获取对其他对象的引用来定义的。</font><font style="vertical-align: inherit;">在这种情况下，这些对象将永远无法访问彼此的受保护数据（没有封装中断），并且将被迫尊重彼此的接口。</font><font style="vertical-align: inherit;">而且，在这种情况下，实现依赖将比继承的情况少很多。</font></font>

source: On the other hand when you have <strong>has-a</strong> or some adjective relationship between two classes (student has courses) or (teacher studies courses), you chose composition.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por otro lado, cuando </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tiene una</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> relaci&oacute;n ad </font><strong><font style="vertical-align: inherit;">-</font></strong><font style="vertical-align: inherit;"> adjetiva o alguna adjetiva entre dos clases (el estudiante tiene cursos) o (cursos de estudios del profesor), elige la composici&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一方、あなたが持っている場合</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がある、</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">またはいくつかの2クラス間の形容詞の関係（学生がコースを持っている）、または（教員研究コース）、あなたは、組成物を選びました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면에 당신이 가지고있는 경우 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가-A</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 일부 두 클래스 사이의 형용사 관계 (학생이 교육 과정을 가지고) 또는 (교사 연구 과정), 당신은 구성을 선택했다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С другой стороны , </font><font style="vertical-align: inherit;">если у </font><font style="vertical-align: inherit;">вас есть </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">есть-а</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или какое - </font><font style="vertical-align: inherit;">то отношение прилагательного между двумя классами (студент курсов) или (исследования учителей курсы), вы выбрали композицию.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">另一方面，当您</font><font style="vertical-align: inherit;">在两个班级（学生开设课程）或（老师学习课程）之间</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有某种</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或某种形容词关系时，您选择了作文。</font></font>

source: One example of this: You want to create a Stack out of a List. Stack only has pop, push and peek. You shouldn't use inheritance given that you don't want push_back, push_front, removeAt, et al.-kind of functionality in a Stack.
es: Un ejemplo de esto:Quieres crear una pila de una lista.La pila sólo tiene pop,push y peek.No deberías usar la herencia ya que no quieres push_back,push_front,removeAt,et al.tipo de funcionalidad en un Stack.
ja: その一例です。リストからスタックを作成したいとします。Stackにはpop、push、peekしかありません。push_back,push_front,removeAtなどの機能は必要ないので、継承は使わない方がいいでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이에 대한 예 : 목록에서 스택을 생성하려고합니다. </font><font style="vertical-align: inherit;">스택에는 팝, 푸시 및 픽만 있습니다. </font><font style="vertical-align: inherit;">push_back, push_front, removeAt 등의 기능이 스택에 필요하지 않다면 상속을 사용해서는 안됩니다.</font></font>
ru: Один пример:Ты хочешь создать Стек из списка.В стеке есть только pop,push и peek.Вы не должны использовать наследование,если не хотите,чтобы в стеке была функциональность push_back,push_front,removeAt и др.
zh_cn: 这方面的一个例子。你想从List中创建一个Stack。Stack只有pop、push和peek功能。你不应该使用继承,因为你不希望在一个Stack里有push_back、push_front、removeAt等功能。

source: Our Set of integers class is a subclass of List of Integers, but is not a subtype, due to it is not satisfying all the features of the List class. The values, and the signature of the methods are satisfied but the properties are not. The behaviour of the add(Integer) method has been clearly changed, not preserving the properties of the parent type. Think from the point of view of the client of your classes. They might receive a Set of integers where a List of integers is expected. The client might want to add a value and get that value added to the List even if that value already exist in the List. But her wont get that behaviour if the value exists. A big suprise for her!
es: Nuestra clase Set of integers es una subclase de la lista de números enteros,pero no es un subtipo,debido a que no satisface todas las características de la clase List.Los valores y la firma de los métodos se satisfacen pero las propiedades no.El comportamiento del método add(Integer)se ha modificado claramente,no conservando las propiedades del tipo padre.Piensa desde el punto de vista del cliente de tus clases.Podrían recibir un conjunto de enteros donde se espera una lista de enteros.El cliente podría querer añadir un valor y obtener ese valor añadido a la Lista,incluso si ese valor ya existe en la Lista.Pero no obtendrá ese comportamiento si el valor existe.¡Una gran sorpresa para ella!
ja: 私たちのSet of integersクラスはList of Integersのサブクラスですが、Listクラスのすべての機能を満たしていないため、サブタイプではありません。メソッドの値とシグネチャは満たされていますが、プロパティは満たされていません。add(Integer)メソッドの振る舞いが明らかに変更されており、親型のプロパティを保持していません。あなたのクラスのクライアントの視点から考えてみてください。クライアントは整数のセットを受け取るかもしれませんが、そこには整数のリストが期待されています。クライアントは値を追加して、その値が既にリストに存在していてもリストに追加された値を取得したいと思うかもしれません。しかし、値が存在する場合には、その動作は得られません。これは彼女にとって大きな驚きです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정수 세트 클래스는 List of Integers의 서브 클래스이지만 List 클래스의 모든 기능을 만족하지 않기 때문에 서브 타입이 아닙니다. </font><font style="vertical-align: inherit;">메소드의 값 및 서명은 만족되지만 특성은 만족되지 않습니다. </font><font style="vertical-align: inherit;">add (Integer) 메소드의 동작은 상위 유형의 특성을 유지하지 않고 명확하게 변경되었습니다. </font><font style="vertical-align: inherit;">수업의 클라이언트의 관점에서 생각하십시오. </font><font style="vertical-align: inherit;">정수 목록이 필요한 정수 세트를 수신 할 수 있습니다. </font><font style="vertical-align: inherit;">클라이언트는 값이 목록에 이미있는 경우에도 값을 추가하고 해당 값을 목록에 추가 할 수 있습니다. </font><font style="vertical-align: inherit;">그러나 그녀는 그 가치가 존재한다면 그 행동을 얻지 못할 것입니다. </font><font style="vertical-align: inherit;">그녀를위한 큰 놀라움!</font></font>
ru: Наш класс Set of integers является подклассом List of Integers,но не является подтипом,в связи с тем,что не удовлетворяет всем возможностям класса List.Значения и сигнатуры методов удовлетворяют,а свойства-нет.Поведение метода add(Integer)явно изменилось,не сохранив свойств родительского типа.Подумайте с точки зрения клиента своих классов.Они могут получить набор целых чисел,где ожидается список целых чисел.Клиент может захотеть добавить значение и получить это значение,добавленное в Список,даже если это значение уже существует в Списке.Но она не получит такого поведения,если значение уже существует.Большой сюрприз для нее!
zh_cn: 我们的Set of integers类是List of Integers的一个子类,但不是一个子类型,由于它不满足List类的所有特征。值,以及方法的签名都满足,但属性却不满足。add(Integer)方法的行为已经明显改变了,没有保留父类型的属性。站在你的类的客户端的角度思考一下。他们可能会接收到一个Set of integers,而在这里期望的是一个List of integers。客户端可能希望添加一个值,并得到这个值被添加到List中,即使这个值已经存在于List中。但是,如果这个值存在,她就不会得到这个行为。这让她大吃一惊!

source: Personally I learned to always prefer composition over inheritance. There is no programmatic problem you can solve with inheritance which you cannot solve with composition; though you may have to use Interfaces(Java) or Protocols(Obj-C) in some cases. Since C++ doesn't know any such thing, you'll have to use abstract base classes, which means you cannot get entirely rid of inheritance in C++.
es: Personalmente aprendí a preferir siempre la composición a la herencia.No hay ningún problema programático que puedas resolver con la herencia que no puedas resolver con la composición;aunque puede que tengas que usar Interfaces(Java)o Protocolos(Obj-C)en algunos casos.Como C++no sabe nada de eso,tendrás que usar clases base abstractas,lo que significa que no puedes deshacerte completamente de la herencia en C++.
ja: 個人的には、継承よりも常にコンポジションを好むことを学んだ。継承で解決できるプログラム上の問題で、コンポジションで解決できないものはない。C++はそのようなことを知らないので、抽象的な基底クラスを使う必要があり、C++では継承を完全に排除することはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개인적으로 저는 항상 상속보다 구성을 선호하는 법을 배웠습니다. 컴포지션으로는 해결할 수없는 상속으로 해결할 수있는 프로그래밍 문제는 없습니다. 경우에 따라 Interfaces (Java) 또는 Protocols (Obj-C)를 사용해야 할 수도 있습니다. C ++은 그러한 것을 알지 못하므로 추상 기본 클래스를 사용해야하므로 C ++에서 상속을 완전히 제거 할 수 없습니다.</font></font>
ru: Лично я научился всегда отдавать предпочтение композиции,а не наследованию.Нет программной проблемы,которую вы можете решить с помощью наследования,которую вы не можете решить с помощью композиции;хотя в некоторых случаях вам может понадобиться использовать Interfaces(Java)или Protocols(Obj-C).Так как С++не знает ничего подобного,вам придется использовать абстрактные базовые классы,что означает,что вы не можете полностью избавиться от наследования на С++.
zh_cn: 就我个人而言,我学会了永远喜欢使用组成式而不是继承式。没有什么程序性的问题是你用继承可以解决的,而你不能用组成解决的;尽管在某些情况下你可能不得不使用Interfaces(Java)或Protocols(Obj-C)。因为C++不知道这些东西,所以你必须使用抽象基类,这意味着你不能在C++中完全摆脱继承。

source: Prefer composition over inheritance
es: Preferir la composición a la herencia
ja: 継承よりも構成を好む
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속보다 컴포지션 선호</font></font>
ru: Предпочитает состав,а не наследование
zh_cn: 继承权优先于继承权

source: Procedural Code
es: Código de procedimiento
ja: 手続きコード
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">절차 코드</font></font>
ru: процессуальный кодекс
zh_cn: 程序性法规

source: Reason: <em>Subclassing usually means more complexity and connectedness, i.e. harder to change, maintain, and scale without making mistakes.</em>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Motivo: La </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">subclasificaci&oacute;n generalmente significa m&aacute;s complejidad y conectividad, es decir, m&aacute;s dif&iacute;cil de cambiar, mantener y escalar sin cometer errores.</font></font></em>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">理由：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サブクラス化は、通常、より複雑で関連性があることを意味します。</font></font></em>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이유 : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서브 클래 싱은 일반적으로 더 복잡하고 연결성을 의미합니다. 즉 실수없이 변경, 유지 관리 및 확장하기가 어렵습니다.</font></font></em>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Причина: </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">подклассы обычно означают большую сложность и связанность, то есть сложнее изменять, поддерживать и масштабировать без ошибок.</font></font></em>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">原因：</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">子类化通常意味着更多的复杂性和联系性，即更容易更改，维护和扩展而不犯错误。</font></font></em>

source: See other answers.
es: Ver otras respuestas.
ja: 他の回答を見る
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 답변을 참조하십시오.</font></font>
ru: См.другие ответы.
zh_cn: 查看其他答案。
