Repository: rueisnom/feedback
Catalog: xlf/49/00/2/49002.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Another, very pragmatic reason, to prefer composition over inheritance has to do with your domain model, and mapping it to a relational database. It's really hard to map inheritance to the SQL model (you end up with all sorts of hacky workarounds, like creating columns that aren't always used, using views, etc). Some ORMLs try to deal with this, but it always gets complicated quickly. Composition can be easily modeled through a foreign-key relationship between two tables, but inheritance is much harder.
es: Otra razón,muy pragmática,para preferir la composición a la herencia tiene que ver con su modelo de dominio,y su mapeo a una base de datos relacional.Es realmente difícil mapear la herencia al modelo SQL (terminas con todo tipo de soluciones improvisadas,como crear columnas que no siempre se usan,usar vistas,etc.).Algunos ORML tratan de lidiar con esto,pero siempre se complica rápidamente.La composición se puede modelar fácilmente a través de una relación de clave externa entre dos tablas,pero la herencia es mucho más difícil.
ja: 継承よりもコンポジションを好むもう一つの非常に現実的な理由は、ドメインモデルとそれをリレーショナルデータベースにマッピングすることに関係しています。継承をSQLモデルにマッピングするのは本当に難しいです(常に使用されていないカラムを作成したり、ビューを使用したりと、様々な回避策が必要になります)。ORMLの中にはこれに対応しようとするものもありますが、すぐに複雑になってしまいます。組成は、2つのテーブル間の外部キーの関係で簡単にモデル化できますが、継承ははるかに難しいです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속보다 구성을 선호하는 또 다른 매우 실용적인 이유는 도메인 모델과 관련이 있으며 관계형 데이터베이스에 매핑해야합니다. 상속을 SQL 모델에 매핑하는 것은 실제로 어렵습니다 (항상 사용되지 않는 열 만들기, 뷰 사용 등)와 같은 모든 종류의 해킹 방법으로 끝납니다. 일부 ORML은이를 처리하려고하지만 항상 빠르게 복잡해집니다. 두 테이블 간의 외래 키 관계를 통해 컴포지션을 쉽게 모델링 할 수 있지만 상속은 훨씬 어렵습니다.</font></font>
ru: Другая,очень прагматичная причина,предпочитать композицию,а не наследование,связана с вашей моделью домена и сопоставлением ее с реляционной базой данных.Очень сложно сопоставить наследование с SQL моделью (в итоге вы получаете всевозможные хакерские обходные пути,например,создание колонок,которые не всегда используются,использование представлений и т.д.).Некоторые ORML пытаются справиться с этим,но это всегда быстро усложняется.Состав можно легко смоделировать с помощью внешних связей между двумя таблицами,но наследование намного сложнее.
zh_cn: 另一个非常实用的理由是,宁愿使用组合而不是继承,这与你的域模型,以及将其映射到关系型数据库有关。要把继承映射到SQL模型上真的很难(你最终会遇到各种黑客的变通方法,比如创建不经常使用的列,使用视图等)。一些ORML试图处理这个问题,但总是很快就变得复杂了。组成可以通过两个表之间的外键关系轻松建模,但继承就难多了。

source: As a rule of thumb, I tend to choose inheritance over composition when polymorphic use is expected to be very common, in which case the power of dynamic dispatch can lead to a much more readable and elegant API. For example, having a polymorphic class <code>Widget</code> in GUI frameworks, or a polymorphic class <code>Node</code> in XML libraries allows to have an API which is much more readable and intuitive to use than what you would have with a solution purely based on composition.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como regla general, tiendo a elegir la herencia sobre la composici&oacute;n cuando se espera que el uso polim&oacute;rfico sea muy com&uacute;n, en cuyo caso el poder del despacho din&aacute;mico puede conducir a una API mucho m&aacute;s legible y elegante. </font><font style="vertical-align: inherit;">Por ejemplo, tener un </font></font> <code>Widget</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> clase polim&oacute;rfica </font><font style="vertical-align: inherit;">en marcos de GUI, o un </font></font> <code>Node</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> clase polim&oacute;rfica </font><font style="vertical-align: inherit;">en bibliotecas XML permite tener una API que es mucho m&aacute;s legible e intuitiva de usar que lo que tendr&iacute;a con una soluci&oacute;n basada exclusivamente en la composici&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">経験則として、私は、多態的な使用が非常に一般的であると予想される場合、構成より継承を選択する傾向があります。</font><font style="vertical-align: inherit;">たとえば</font><font style="vertical-align: inherit;">、GUIフレームワークに</font><font style="vertical-align: inherit;">ポリモーフィッククラスの</font></font> <code>Widget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、または</font><font style="vertical-align: inherit;">XMLライブラリに</font><font style="vertical-align: inherit;">ポリモーフィッククラスの</font></font> <code>Node</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用すると、純粋に構成に基づくソリューションよりもはるかに読みやすく、直感的に使用できるAPIを使用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적으로 다형성 사용이 매우 일반적 일 것으로 예상되는 경우 컴포지션보다 상속을 선택하는 경향이 있습니다.이 경우 동적 디스패치의 힘이 훨씬 더 읽기 쉽고 우아한 API로 이어질 수 있습니다. </font><font style="vertical-align: inherit;">예를 들어 </font><font style="vertical-align: inherit;">GUI 프레임 워크에 </font><font style="vertical-align: inherit;">다형성 클래스 </font></font> <code>Widget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font><font style="vertical-align: inherit;">XML 라이브러리에 </font><font style="vertical-align: inherit;">다형성 클래스 </font></font> <code>Node</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하면 구성을 기반으로하는 솔루션을 사용하는 것보다 훨씬 읽기 쉽고 직관적 인 API를 사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как правило, я склонен выбирать наследование вместо композиции, когда ожидается, что полиморфное использование будет очень распространенным, и в этом случае мощь динамической диспетчеризации может привести к гораздо более читаемому и элегантному API. </font><font style="vertical-align: inherit;">Например, наличие полиморфного класса </font></font> <code>Widget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в платформах GUI или полиморфного класса </font></font> <code>Node</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в библиотеках XML позволяет иметь API, который гораздо более читабелен и интуитивно понятен, чем тот, который вы имели бы с решением, основанным исключительно на композиции.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据经验，当预期多态使用非常普遍时，我倾向于选择继承而不是合成，在这种情况下，动态分派的功能可以使API更具可读性和优雅性。</font><font style="vertical-align: inherit;">例如，</font><font style="vertical-align: inherit;">在GUI框架中</font><font style="vertical-align: inherit;">具有多态类</font></font> <code>Widget</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font><font style="vertical-align: inherit;">在XML库中</font><font style="vertical-align: inherit;">具有多态类</font></font> <code>Node</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可以使API具有比纯粹基于组成的解决方案更易读和直观的使用。</font></font>

source: As many people told, I will first start with the check - whether there exists an "is-a" relationship. If it exists I usually check the following:
es: Como mucha gente dijo,empezaré con la comprobación de si existe una relación "es-una-relación".Si existe,normalmente compruebo lo siguiente:
ja: 多くの方がおっしゃっているように、私はまず、「ある関係」が存在するかどうかをチェックすることから始めます。それが存在する場合、私は通常、次のようにチェックします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 사람들이 말했듯이, 나는 "is-a"관계가 존재하는지 여부를 먼저 검사로 시작할 것입니다. </font><font style="vertical-align: inherit;">존재하는 경우 일반적으로 다음을 확인하십시오.</font></font>
ru: Как многие говорили,я начну с проверки-существуют ли отношения "есть-а".Если они существуют,я обычно проверяю следующее:
zh_cn: 正如很多人说的那样,我先从检查开始--是否存在 "is-a "关系。如果存在,我通常会从以下几个方面进行检查。

source: As soon as someone explained "favor composition over inheritance" to me, I thought back over every time I tried to share functionality between classes using inheritance and realized that most of the time it didn't really work well.
es: Tan pronto como alguien me explicó "favorecer la composición sobre la herencia",me acordé cada vez que intenté compartir la funcionalidad entre clases usando la herencia y me di cuenta de que la mayoría de las veces no funcionaba realmente bien.
ja: 誰かが「継承よりも構成を優先する」と説明してくれたので、継承を使ってクラス間で機能を共有しようとするたびに思い返してみたのですが、ほとんどの場合はうまくいかないことに気がつきました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">누군가가 "상속보다 선호하는 구성"을 설명하자마자, 상속을 사용하여 클래스간에 기능을 공유하려고 할 때마다 다시 생각하고 대부분의 시간이 실제로 제대로 작동하지 않는다는 것을 깨달았습니다.</font></font>
ru: Как только кто-то объяснил мне "предпочтение композиции перед наследством",я вспоминал каждый раз,когда пытался поделиться функциональностью между классами,использующими наследование,и понимал,что в большинстве случаев это работало не очень хорошо.
zh_cn: 当有人向我解释 "偏向于继承 "的时候,我回想了一下每次尝试使用继承在类之间共享功能的时候,发现大多数时候并没有很好地实现。

source: Aside from is a/has a considerations, one must also consider the "depth" of inheritance your object has to go through. Anything beyond five or six levels of inheritance deep might cause unexpected casting and boxing/unboxing problems, and in those cases it might be wise to compose your object instead.
es: Aparte de las consideraciones de este ha,también hay que considerar la "profundidad" de la herencia que tiene que atravesar su objeto.Cualquier cosa que supere los cinco o seis niveles de profundidad de herencia puede causar problemas inesperados de casting y boxeo,y en esos casos sería prudente componer su objeto en su lugar.
ja: is ahas a の考慮事項とは別に、オブジェクトが通過しなければならない継承の "深さ "も考慮しなければなりません。継承の深さが 5、6 レベルを超えると、予期せぬキャスティングや箱詰めの問題が発生する可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고려해야 할 사항 외에도 고려해야 할 사항은 객체가 거쳐야하는 상속의 "깊이"도 고려해야합니다. </font><font style="vertical-align: inherit;">상속 수준이 5-6 단계를 초과하면 예상치 못한 캐스팅 및 박싱 / 언 박싱 문제가 발생할 수 있으며,이 경우 대신 객체를 작성하는 것이 좋습니다.</font></font>
ru: Помимо соображений,необходимо также учитывать "глубину" наследования,через которую должен пройти ваш объект.Все,что выходит за рамки пяти или шести уровней глубины наследования,может вызвать неожиданные проблемы с кастингом и боксом,и в этих случаях,возможно,было бы разумно составить свой объект вместо этого.
zh_cn: 除了是啊是的考虑,还必须考虑你的对象所要经历的继承的 "深度"。任何超过五、六级继承深度的东西都可能会引起意想不到的铸造和boxingunboxing的问题,在这种情况下,也许明智的做法是将你的对象改成编译对象。

source: At the risk of oversimplifying, that's composition - composing multiple classes to work together. And once we form that habit we find that it's much more flexible, maintainable, and testable than using inheritance.
es: A riesgo de simplificar demasiado,eso es composición-componer múltiples clases para trabajar juntas.Y una vez que formamos ese hábito encontramos que es mucho más flexible,mantenible y comprobable que usar la herencia.
ja: 単純化しすぎているかもしれませんが、これがコンポジション(複数のクラスを組み合わせて動作させること)です。一度この習慣を身につけてしまえば、継承を使うよりもはるかに柔軟性があり、保守性があり、テストが可能であることに気づくでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지나치게 단순화 할 위험이있는 경우, 여러 개의 클래스를 구성하여 함께 사용할 수 있습니다. </font><font style="vertical-align: inherit;">그리고 일단 습관을 형성하면 상속을 사용하는 것보다 훨씬 유연하고 유지 보수가 가능하며 테스트가 가능하다는 것을 알게됩니다.</font></font>
ru: Рискуя чрезмерно упростить,это и есть композиция-сочинять несколько классов для совместной работы.И как только мы формируем эту привычку,мы обнаруживаем,что она гораздо более гибкая,поддерживаемая и контролепригодная,чем использование наследования.
zh_cn: 冒着过度简化的风险,这就是组成--将多个类组成在一起工作。而一旦我们形成了这个习惯,我们会发现它比使用继承的方式更灵活、更可维护、更可测试。

source: Base class defines structure of the algorithm and sub-class will override a part of algorithm =&gt; <strong><em>You can implement <a href="https://en.wikipedia.org/wiki/Template_method_pattern">Template_method</a> without change in base class skeleton</em></strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La clase base define la estructura del algoritmo y la subclase anular&aacute; una parte del algoritmo =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede implementar </font></font><a href="https://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Template_method</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sin cambios en el esqueleto de la clase base</font></font></em></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本クラスはアルゴリズムの構造を定義し、サブクラスはアルゴリズムの一部をオーバーライドします=&gt; </font><strong><em><font style="vertical-align: inherit;">基本クラスのスケルトンを変更せずに</font></em></strong><strong><em><a href="https://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;">Template_method</font></a></em></strong><strong><em><font style="vertical-align: inherit;">を</font></em></strong></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装できます</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></em></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스는 알고리즘의 구조를 정의하고 하위 클래스는 알고리즘의 일부를 대체합니다. =&gt; </font><strong><em><font style="vertical-align: inherit;">기본 클래스 스켈레톤을 변경하지 않고 </font></em></strong><strong><em><a href="https://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;">Template_method</font></a></em></strong><strong><em><font style="vertical-align: inherit;"> 를 </font></em></strong></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현할 수 있습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font></em></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Базовый класс определяет структуру алгоритма, а подкласс переопределит часть алгоритма =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете реализовать </font></font><a href="https://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Template_method</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> без изменений в скелете базового класса</font></font></em></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基类定义算法的结构，子类将覆盖算法的一部分=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以</font><font style="vertical-align: inherit;">在不更改基类骨架的情况下</font><font style="vertical-align: inherit;">实现</font></font><a href="https://en.wikipedia.org/wiki/Template_method_pattern"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Template_method</font></font></a><font style="vertical-align: inherit;"></font></em></strong>

source: Base class provides default implementation and sub-class can change the behaviour =&gt; <strong><em>You can re-define contract</em></strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La clase base proporciona una implementaci&oacute;n predeterminada y la subclase puede cambiar el comportamiento =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede redefinir el contrato</font></font></em></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本クラスはデフォルトの実装を提供し、サブクラスは動作を変更できます=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">契約を再定義できます</font></font></em></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스는 기본 구현을 제공하고 하위 클래스는 동작을 변경할 </font><strong><em><font style="vertical-align: inherit;">수 있습니다</font></em></strong><font style="vertical-align: inherit;"> =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계약을 다시 정의 할 수 있습니다</font></font></em></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Базовый класс обеспечивает реализацию по умолчанию, а подкласс может изменить поведение =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете переопределить контракт</font></font></em></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基类提供默认实现，子类可以更改行为=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以重新定义合同</font></font></em></strong>

source: Base class provides no implementation and sub-class has to override complete method (abstract) =&gt; <strong><em>You can implement a contract</em></strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La clase base no proporciona implementaci&oacute;n y la subclase tiene que anular el m&eacute;todo completo (resumen) =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede implementar un contrato</font></font></em></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基本クラスは実装を提供せず、サブクラスは完全なメソッド（抽象）をオーバーライドする必要があります=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントラクトを実装できます</font></font></em></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본 클래스는 구현을 제공하지 않으며 하위 클래스는 전체 메소드를 대체해야합니다 (추상) =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">계약을 구현할 수 있습니다</font></font></em></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Базовый класс не обеспечивает реализацию, а подкласс должен переопределять полный метод (аннотация) =&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете реализовать контракт</font></font></em></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">基类不提供任何实现，子类必须重写complete方法（抽象）=&gt; </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以实现合同</font></font></em></strong>

source: Call no methods from the superclass constructor
es: No llames a los métodos del constructor de la superclase
ja: スーパークラスのコンストラクタからメソッドを呼び出さない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수퍼 클래스 생성자로부터 메소드를 호출하지 않습니다</font></font>
ru: Не вызывать методы из конструктора суперкласса
zh_cn: 从超级类构造函数中不调用任何方法

source: Common problems to the use of inheritance as I see it are:
es: Los problemas comunes al uso de la herencia como yo lo veo son:
ja: 私が見ているような継承の使用に対する共通の問題点は、以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 볼 때 상속 사용에 대한 일반적인 문제는 다음과 같습니다.</font></font>
ru: Общие проблемы с использованием наследства,как я вижу:
zh_cn: 在我看来,继承权的使用存在的共同问题是:

source: Composition has the befit of inversion of control, and its dependency can be injected dynamically, as is shown in <a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java">decorator pattern</a> and <a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java">proxy pattern</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La composici&oacute;n tiene el beneficio de la inversi&oacute;n de control, y su dependencia se puede inyectar din&aacute;micamente, como se muestra en el </font></font><a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">patr&oacute;n decorador</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el </font></font><a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">patr&oacute;n proxy</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンポジションには、制御の反転の利点があり、その依存関係は、</font></font><a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デコレーターパターン</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロキシパターンに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">示されているように、動的に注入できます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴포지션은 반전 제어에 적합하며 </font></font><a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데코레이터 패턴</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프록시 패턴</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 과 </font><font style="vertical-align: inherit;">같이 종속성을 동적으로 주입 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Композиция имеет Подходят инверсии управления, и его зависимость может быть введен динамически, как показано на </font></font><a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">декоратор</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">прокси - </font><font style="vertical-align: inherit;">шаблона</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">合成具有控制反转的功能，并且它的依赖项可以动态注入，如</font></font><a href="https://en.wikipedia.org/wiki/Decorator_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">装饰器模式</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://en.wikipedia.org/wiki/Proxy_pattern#Java"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代理模式所示</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
