Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Is it possible to upgrade all Python packages at one time with <strong><a href="https://pypi.python.org/pypi/pip"><code>pip</code></a></strong>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Es posible actualizar todos los paquetes de Python a la vez con </font></font><strong><a href="https://pypi.python.org/pypi/pip"> <code>pip</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべてのPythonパッケージを</font></font><strong><a href="https://pypi.python.org/pypi/pip"> <code>pip</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で一度にアップグレードすることは可能</font><font style="vertical-align: inherit;">ですか？</font></font>
ko: <font style="vertical-align: inherit;"></font><strong><a href="https://pypi.python.org/pypi/pip"> <code>pip</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 한 번에 모든 Python 패키지를 업그레이드 할 수 </font><font style="vertical-align: inherit;">있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Можно ли обновить все пакеты Python одновременно с помощью </font></font><strong><a href="https://pypi.python.org/pypi/pip"> <code>pip</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否可以通过</font></font><strong><a href="https://pypi.python.org/pypi/pip"> <code>pip</code> </a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一次升级所有Python软件包</font><font style="vertical-align: inherit;">？</font></font>

source: Isn't this more effective?
es: ¿No es esto más efectivo?
ja: こちらの方が効果的ではないでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 효과적이지 않습니까?</font></font>
ru: Разве это не более эффективно?
zh_cn: 这样不是更有效果吗?

source: It can do lots of things you'll probably find useful.
es: Puede hacer muchas cosas que probablemente encuentres útiles.
ja: きっと役に立つことがたくさんできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유용 할 수있는 많은 작업을 수행 할 수 있습니다.</font></font>
ru: Он может сделать много вещей,которые вы,вероятно,найдете полезными.
zh_cn: 它可以做很多事情,你可能会觉得有用。

source: My script:
es: Mi guión:
ja: 私の台本。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 스크립트 :</font></font>
ru: Мой сценарий:
zh_cn: 我的剧本。

source: NOTE: I'm the author of the tool.
es: NOTA:Soy el autor de la herramienta.
ja: 注意:ツールの作者です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : 나는 도구의 저자입니다.</font></font>
ru: ПРИМЕЧАНИЕ:Я автор инструмента.
zh_cn: 注:我是这个工具的作者。

source: Note: there are infinite potential variations for this. I'm trying to keep this answer short and simple, but please do suggest variations in the comments!
es: Nota:hay infinitas variaciones potenciales para esto.Estoy tratando de mantener esta respuesta corta y simple,pero por favor sugiera variaciones en los comentarios!
ja: 注:これには無限の可能性のあるバリエーションがあります。私はこの答えを簡潔でシンプルなものにしようとしていますが、コメントでバリエーションを提案してください!
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 : 이에 대한 무한한 변동이 있습니다. </font><font style="vertical-align: inherit;">이 답변을 짧고 간단하게 유지하려고 노력하고 있지만 의견에 변형을 제안하십시오!</font></font>
ru: Примечание:для этого существуют бесконечные потенциальные вариации.Я стараюсь,чтобы ответ был кратким и простым,но,пожалуйста,предлагайте варианты в комментариях!
zh_cn: 请注意:这个问题有无限种可能的变化。我尽量让这个答案简短而简单,但请大家在评论中提出变化的建议!

source: OSX, as of July 2017, ships with a very old version of sed (a dozen years old). To get extended regular expressions, use -E instead of -r in the solution above.
es: OSX,a partir de julio de 2017,navega con una versión muy antigua de sed (una docena de años de antigüedad).Para obtener expresiones regulares extendidas,use -E en lugar de -r en la solución anterior.
ja: 2017年7月現在のOSXは、sedの非常に古いバージョン(十数年前のバージョン)で出荷されています。拡張正規表現を取得するには、上記のソリューションでは-rの代わりに-eを使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2017 년 7 월 현재 OSX는 매우 오래된 버전의 sed (12 년 이전)와 함께 제공됩니다. </font><font style="vertical-align: inherit;">확장 정규 표현식을 얻으려면 위의 솔루션에서 -r 대신 -E를 사용하십시오.</font></font>
ru: OSX,по состоянию на июль 2017 года,корабли с очень старой версией sed (дюжина лет).Для получения расширенных регулярных выражений используйте -E вместо -r в решении,приведенном выше.
zh_cn: OSX,截至2017年7月,自带一个非常老的sed版本(十几年前的)。要获得扩展的正则表达式,请在上面的解决方案中使用-E代替-r。

source: Older Versions:
es: Versiones anteriores:
ja: 古いバージョン。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 버전 :</font></font>
ru: Старые версии:
zh_cn: 旧版本。

source: One-liner version of <a href="https://stackoverflow.com/a/5839291/3357935">@Ramana's answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Versi&oacute;n de una sola l&iacute;nea de </font></font><a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">@ Ramana</font><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ramanaの回答の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ワンライナーバージョン</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ Ramana 's answer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 한 줄짜리 버전 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однострочная версия </font></font><a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ответа @ Раманы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ramana的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的一线版</font><font style="vertical-align: inherit;">。</font></font>

source: Portability issues due to changing pip command line features
es: Problemas de portabilidad debido a los cambios en las características de la línea de mando de los pip
ja: pip コマンドラインの機能変更による移植性の問題
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip 명령 줄 기능 변경으로 인한 이식성 문제</font></font>
ru: Проблемы с переносом из-за изменения функций командной строки трубопровода
zh_cn: 由于pip命令行功能的改变而导致的可移植性问题

source: Relying on a Python-to-OS bridge while potentially upgrading it<sup>3</sup>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Confiar en un puente de Python a OS mientras se actualiza potencialmente </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">潜在的にそれをアップグレードしながら、Python-to-OSブリッジに依存</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잠재적으로 업그레이드하는 동안 Python-to-OS 브릿지에 의존 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Опираясь на мост Python-to-OS, потенциально обновляя его </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">依靠Python到OS的网桥，同时可能对其进行升级</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3</font></font></sup>

source: Sent through <a href="https://github.com/pypa/pip/pull/1506">a pull-request to the pip folk</a>; in the meantime use this pip library solution I wrote:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Enviado a trav&eacute;s de </font></font><a href="https://github.com/pypa/pip/pull/1506"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una solicitud de extracci&oacute;n a la gente pip</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Mientras tanto, use esta soluci&oacute;n de biblioteca de pip que escrib&iacute;:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/pypa/pip/pull/1506"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プルリクエストを</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">介し</font><font style="vertical-align: inherit;">てpipフォークに送信され</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">その間、私が書いたこのpipライブラリソリューションを使用します。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/pypa/pip/pull/1506"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">핍 사람들에게 풀 리퀘스트를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 통해 보냄 </font><font style="vertical-align: inherit;">; </font><font style="vertical-align: inherit;">그 동안 내가 쓴이 pip 라이브러리 솔루션을 사용하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Послано через </font></font><a href="https://github.com/pypa/pip/pull/1506"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">запрос на получение ответа народу пипа</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">тем временем используйте это решение для библиотеки пипсов, которое я написал:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过</font></font><a href="https://github.com/pypa/pip/pull/1506"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">拉动请求发送给小学生</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">同时使用此pip库解决方案，我写道：</font></font>

source: So the above lines becomes:
es: Así que las líneas de arriba se convierten:
ja: なので、上記のセリフになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 위의 줄은 다음과 같습니다.</font></font>
ru: Значит,вышеуказанные строки становятся:
zh_cn: 因此,上面这句话变成:

source: Source: <a href="https://github.com/pypa/pip/issues/3819">https://github.com/pypa/pip/issues/3819</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font><a href="https://github.com/pypa/pip/issues/3819"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/pypa/pip/issues/3819</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">出典：</font><a href="https://github.com/pypa/pip/issues/3819"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/pypa/pip/issues/3819</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">출처 : </font></font><a href="https://github.com/pypa/pip/issues/3819"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/pypa/pip/issues/3819</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="https://github.com/pypa/pip/issues/3819"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/pypa/pip/issues/3819</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来源：</font><a href="https://github.com/pypa/pip/issues/3819"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//github.com/pypa/pip/issues/3819</font></font>

source: Step 1:
es: Paso 1:
ja: ステップ1.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 단계:</font></font>
ru: Шаг 1:
zh_cn: 步骤一:

source: Step 2:
es: Paso 2:
ja: ステップ2.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 단계:</font></font>
ru: Шаг 2:
zh_cn: 第二步:

source: The <a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"><code>pip_upgrade_outdated</code></a> does the job. According to its <a href="https://pypi.org/project/pip-upgrade-outdated/">docs</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font><a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"> <code>pip_upgrade_outdated</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace el trabajo. </font><font style="vertical-align: inherit;">Seg&uacute;n sus </font></font><a href="https://pypi.org/project/pip-upgrade-outdated/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentos</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"> <code>pip_upgrade_outdated</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">その</font><font style="vertical-align: inherit;">役割を果たし</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">その</font></font><a href="https://pypi.org/project/pip-upgrade-outdated/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメントに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よると</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"> <code>pip_upgrade_outdated</code> 이</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 작업을 수행합니다. </font><font style="vertical-align: inherit;">그 </font></font><a href="https://pypi.org/project/pip-upgrade-outdated/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">문서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 따르면 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"></font><a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"> <code>pip_upgrade_outdated</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> делает работу. </font><font style="vertical-align: inherit;">Согласно его </font></font><a href="https://pypi.org/project/pip-upgrade-outdated/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">документам</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font><a href="https://gist.github.com/serafeimgr/b4ca5d0de63950cc5349d4802d22f3f0"> <code>pip_upgrade_outdated</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做这项工作。</font><font style="vertical-align: inherit;">根据其</font></font><a href="https://pypi.org/project/pip-upgrade-outdated/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: The <code>-n1</code> flag for <code>xargs</code> prevents stopping everything if updating one package fails (thanks <a href="https://stackoverflow.com/users/339505/andsens">@andsens</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font><font style="vertical-align: inherit;">indicador </font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> evita detener todo si falla la actualizaci&oacute;n de un paquete (gracias </font></font><a href="https://stackoverflow.com/users/339505/andsens"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@andsens</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"> <code>xargs</code> <font style="vertical-align: inherit;">の</font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグは、</font><font style="vertical-align: inherit;">1つのパッケージの更新が失敗した場合にすべてを停止することを防ぎます（</font><a href="https://stackoverflow.com/users/339505/andsens"><font style="vertical-align: inherit;">@andsensに</font></a><font style="vertical-align: inherit;">感謝し</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 대한 플래그 </font></font> <code>xargs</code> 를의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하나 개의 패키지를 업데이트하는 경우 모든 것을 중단 방지는 (감사 실패 </font></font><a href="https://stackoverflow.com/users/339505/andsens"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@andsens을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> флаг для </font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> предотвращает останавливая все , </font><font style="vertical-align: inherit;">если обновление одного пакета не удается (спасибо </font></font><a href="https://stackoverflow.com/users/339505/andsens"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@andsens</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果更新一个软件包失败（感谢</font><a href="https://stackoverflow.com/users/339505/andsens"><font style="vertical-align: inherit;">@andsens</font></a><font style="vertical-align: inherit;">）</font><font style="vertical-align: inherit;">，则</font> <code>xargs</code> <font style="vertical-align: inherit;">的</font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志可</font><font style="vertical-align: inherit;">阻止停止所有操作</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
