Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <code>xargs -n1</code> keeps going if an error occurs.
es: <code>xargs -n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contin&uacute;a si ocurre un error.</font></font>
ja: <code>xargs -n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、エラーが発生しても</font><font style="vertical-align: inherit;">続行し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <code>xargs -n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오류가 발생하면 </font><font style="vertical-align: inherit;">xargs -n1이</font><font style="vertical-align: inherit;"> 계속 진행됩니다.</font></font>
ru: <code>xargs -n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> продолжает </font><font style="vertical-align: inherit;">работать,</font><font style="vertical-align: inherit;"> если возникает ошибка.</font></font>
zh_cn: <code>xargs -n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果出现错误，</font><font style="vertical-align: inherit;">xargs -n1</font><font style="vertical-align: inherit;">继续运行。</font></font>

source: <strong>(pip &gt; 20.0)</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(pip&gt; 20.0)</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（pip&gt; 20.0）</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(핍&gt; 20.0)</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(пункт&gt; 20,0)</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（点&gt; 20.0）</font></font></strong>

source: <strong>Advanced usage</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uso avanzado</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高度な使用法</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고급 사용법</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Расширенное использование</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">高级用法</font></font></strong>

source: <strong>Another way:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De otra manera:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別の方法：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른 방법:</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другой путь:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">其它的办法：</font></font></strong>

source: <strong>For pip &gt;= 10.0.1</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para pip&gt; = 10.0.1</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip&gt; = 10.0.1の場合</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">핍&gt; = 10.0.1의 경우</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для пункта&gt; = 10.0.1</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于点&gt; = 10.0.1</font></font></strong>

source: <strong>More Robust Solution</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Soluci&oacute;n m&aacute;s robusta</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">より堅牢なソリューション</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 강력한 솔루션</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Более надежное решение</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更强大的解决方案</font></font></strong>

source: <strong>Note</strong>: that there is <a href="https://github.com/pypa/pip/issues/59">a feature request</a> for this on the official issue tracker.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : hay </font></font><a href="https://github.com/pypa/pip/issues/59"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una solicitud de funci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para esto en el rastreador oficial de problemas.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">公式の課題追跡にこれに対する</font></font><a href="https://github.com/pypa/pip/issues/59"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">機能リクエスト</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font><font style="vertical-align: inherit;">あります</font><font style="vertical-align: inherit;">。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">공식 이슈 트래커에 </font></font><a href="https://github.com/pypa/pip/issues/59"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기능 요청</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font><font style="vertical-align: inherit;">на официальном трекере проблем </font></font><a href="https://github.com/pypa/pip/issues/59"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">есть запрос</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для этого.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font><font style="vertical-align: inherit;">官方问题追踪器上对此</font></font><a href="https://github.com/pypa/pip/issues/59"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">功能有要求</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <strong>OSX Oddity</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rareza OSX</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OSXの奇数</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OSX 이상한</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OSX Oddity</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OSX奇数</font></font></strong>

source: <strong>Solving Issues with Popular Solutions</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Resolver problemas con soluciones populares</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一般的なソリューションで問題を解決する</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인기있는 솔루션으로 문제 해결</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Решение проблем с помощью популярных решений</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用流行的解决方案解决问题</font></font></strong>

source: <strong>pipupgrade</strong> helps you upgrade your system, local or packages from a <code>requirements.txt</code> file! It also selectively upgrades packages that don't break change. pipupgrade also ensures to upgrade packages present within multiple Python environments. Compatible with Python2.7+, Python3.4+ and pip9+, pip10+, pip18+, pip19+.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ayuda a actualizar el sistema, local o paquetes de una </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> archivo! </font><font style="vertical-align: inherit;">Tambi&eacute;n actualiza selectivamente paquetes que no rompen el cambio. </font><font style="vertical-align: inherit;">pipupgrade tambi&eacute;n asegura la actualizaci&oacute;n de paquetes presentes en m&uacute;ltiples entornos Python. </font><font style="vertical-align: inherit;">Compatible con Python2.7 +, Python3.4 + y pip9 +, pip10 +, pip18 +, pip19 +.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、システム、ローカル、またはパッケージを</font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ファイル</font><font style="vertical-align: inherit;">からアップグレードするのに役立ち</font><font style="vertical-align: inherit;">ます！</font><font style="vertical-align: inherit;">また、変更を壊さないパッケージを選択的にアップグレードします。</font><font style="vertical-align: inherit;">また、pipupgradeは、複数のPython環境内に存在するパッケージを確実にアップグレードします。</font><font style="vertical-align: inherit;">Python2.7 +、Python3.4 +およびpip9 +、pip10 +、pip18 +、pip19 +と互換性があります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade를 사용</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하면 </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 파일 </font><font style="vertical-align: inherit;">에서 시스템, 로컬 또는 패키지를 업그레이드 할 수 </font><font style="vertical-align: inherit;">있습니다! </font><font style="vertical-align: inherit;">또한 변경 사항을 위반하지 않는 패키지를 선택적으로 업그레이드합니다. </font><font style="vertical-align: inherit;">pipupgrade는 또한 여러 Python 환경에 존재하는 패키지를 업그레이드합니다. </font><font style="vertical-align: inherit;">Python2.7 +, Python3.4 + 및 pip9 +, pip10 +, pip18 +, pip19 +와 호환됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поможет вам обновить вашу систему, местные или пакеты из </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> файла! </font><font style="vertical-align: inherit;">Он также выборочно обновляет пакеты, которые не нарушают изменения. </font><font style="vertical-align: inherit;">pipupgrade также обеспечивает обновление пакетов, представленных в нескольких средах Python. </font><font style="vertical-align: inherit;">Совместим с Python2.7 +, Python3.4 + и pip9 +, pip10 +, pip18 +, pip19 +.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可帮助您从</font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文件</font><font style="vertical-align: inherit;">升级系统，本地或软件包</font><font style="vertical-align: inherit;">！</font><font style="vertical-align: inherit;">它还有选择地升级不会破坏更改的软件包。</font><font style="vertical-align: inherit;">pipupgrade还可以确保升级多个Python环境中存在的软件包。</font><font style="vertical-align: inherit;">与Python2.7 +，Python3.4 +和pip9 +，pip10 +，pip18 +，pip19 +兼容。</font></font>

source: @endolith: I was hoping for an easy <code>pip.install(dist.key, upgrade=True)</code>, too, but it doesn't look like pip was meant to be used by anything but the command line (the docs don't mention the internal API, and the pip developers didn't use docstrings).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@endolith: esperaba un </font></font> <code>pip.install(dist.key, upgrade=True)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> f&aacute;cil </font><font style="vertical-align: inherit;">(dist.key, upgrade = True)</font><font style="vertical-align: inherit;"> , pero no parece que pip est&eacute; destinado a ser usado por otra cosa que no sea la l&iacute;nea de comandos (los documentos no mencionan la API interna y los desarrolladores de pip no usaron docstrings).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@endolith：私も簡単な</font></font> <code>pip.install(dist.key, upgrade=True)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を望んでいました</font><font style="vertical-align: inherit;">が、pipがコマンドライン以外で使用されることを意図していたようには見えません（ドキュメントには言及されていません）内部API、pip開発者はdocstringsを使用しませんでした）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@endolith : 쉬운 </font></font> <code>pip.install(dist.key, upgrade=True)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도 기대하고 있었지만 pip가 명령 줄 이외의 용도로 사용 된 것처럼 보이지 않습니다 (문서는 언급하지 않았습니다) 내부 API 및 pip 개발자는 docstring을 사용하지 않았습니다).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@endolith: Я тоже надеялся на легкий </font></font> <code>pip.install(dist.key, upgrade=True)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но он не выглядит так, как будто pip предназначался для чего-либо, кроме командной строки (документы не упоминают внутренний API, и разработчики пипсов не использовали строки документации).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@endolith：我也希望有一个简单的</font></font> <code>pip.install(dist.key, upgrade=True)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但是看起来pip除了命令行以外没有其他用途（文档中没有提到内部API，并且pip开发人员未使用文档字符串）。</font></font>

source: Activate your virtualenv (important, because it will also install the new versions of upgraded packages in current virtualenv).
es: Activa tu virtualenv (importante,porque también instalará las nuevas versiones de los paquetes actualizados en el virtualenv actual).
ja: virtualenv を有効にします (現在の virtualenv にアップグレードされたパッケージの新しいバージョンもインストールされるので重要です)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">virtualenv를 활성화하십시오 (현재 virtualenv에 업그레이드 된 패키지의 새 버전도 설치하므로 중요).</font></font>
ru: Активируйте virtualenv (важно,потому что он также установит новые версии обновленных пакетов в текущем virtualenv).
zh_cn: 激活你的 virtualenv(很重要,因为它也会在当前 virtualenv 中安装新版本的升级包)。

source: And for Python 2:
es: Y para Python 2:
ja: そして、Python 2の場合。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 파이썬 2의 경우 :</font></font>
ru: И для Питона 2:
zh_cn: 而对于Python 2。

source: Because there was no easy way for upgrading package by package, and updating the requirements.txt file, i wrote this <a href="https://github.com/simion/pip-upgrader"><strong>pip-upgrader</strong></a> which <strong>also updates the versions in your <code>requirements.txt</code> file</strong> for the packages chosen (or all packages).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que no hab&iacute;a manera f&aacute;cil para el paquete de actualizaci&oacute;n de paquete, y actualizar el archivo requirements.txt, he escrito este </font></font><a href="https://github.com/simion/pip-upgrader"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip-mejorador de</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la que </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tambi&eacute;n actualiza las versiones en su </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de archivos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para los paquetes seleccionados (o todos los paquetes).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">パッケージ</font></font><a href="https://github.com/simion/pip-upgrader"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ごとにアップグレードし</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、requirements.txtファイルを更新する簡単な方法がなかったため、この</font><strong><font style="vertical-align: inherit;">pip-upgrader</font></strong><font style="vertical-align: inherit;">を</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">作成して</font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、選択したパッケージ（またはすべてのパッケージ）の</font><strong><font style="vertical-align: inherit;">requirements.txt</font></strong><strong><font style="vertical-align: inherit;">ファイルの</font></strong><strong><font style="vertical-align: inherit;">バージョンも更新しました</font></strong><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패키지별로 패키지를 업그레이드하고 requirements.txt 파일을 업데이트하는 쉬운 방법이 없었기 때문에이 </font></font><a href="https://github.com/simion/pip-upgrader"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip-upgrader</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성 </font><font style="vertical-align: inherit;">하여 선택한 패키지 (또는 모든 패키지) </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에 대한 </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 파일 </font><font style="vertical-align: inherit;">의 버전도 업데이트합니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Потому что не был простым способом для модернизации пакета по пакету, и обновления файла requirements.txt, я написал этот </font></font><a href="https://github.com/simion/pip-upgrader"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">пип-Upgrader</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">также обновляет версии в вашем </font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> файл</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для пакетов , </font><font style="vertical-align: inherit;">выбранных (или всех пакетов).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为没有简单的方法可以逐个软件包升级软件包和更新requirements.txt文件，所以我写了这个</font></font><a href="https://github.com/simion/pip-upgrader"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip-upgrader</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也为您</font></font> <code>requirements.txt</code> <font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择的软件包（或所有软件包）</font><strong><font style="vertical-align: inherit;">更新了</font></strong><strong><font style="vertical-align: inherit;">requirements.txt</font></strong><strong><font style="vertical-align: inherit;">文件中</font></strong><strong><font style="vertical-align: inherit;">的版本</font></strong><font style="vertical-align: inherit;">。</font></font>

source: Crashing of xargs because common pip or pip3 child process failures
es: Choque de xargs porque el proceso común de pip o pip3 child falla
ja: pip や pip3 の子プロセスの一般的な失敗による xargs のクラッシュ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반적인 pip 또는 pip3 자식 프로세스 오류로 인해 xargs 충돌</font></font>
ru: Сбои в работе ксарги из-за сбоев в работе обычного или дочернего процесса pip3.
zh_cn: 由于常见的pip或pip3子进程故障,导致xargs崩溃。

source: Crowded logging from the raw xargs output
es: La tala en masa de la producción de xargs en bruto
ja: 生のxargs出力からの混雑したロギング
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원시 xargs 출력에서 ​​붐비는 로깅</font></font>
ru: Переполненная каротаж с выхода необработанного ксарца
zh_cn: 从原始xargs输出的拥挤记录
