Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Windows version after consulting excellent <a href="http://www.robvanderwoude.com/ntfor.php#FOR_F">documentation</a> for <code>FOR</code> by Rob van der Woude
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Versi&oacute;n de Windows despu&eacute;s de consultar una excelente </font></font><a href="http://www.robvanderwoude.com/ntfor.php#FOR_F"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de Rob van der Woude</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rob van der Woudeによる</font> <code>FOR</code> の<font style="vertical-align: inherit;">優れた</font></font><a href="http://www.robvanderwoude.com/ntfor.php#FOR_F"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ドキュメント</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を参照した</font><font style="vertical-align: inherit;">後のWindowsバージョン</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rob van der Woude의 </font><font style="vertical-align: inherit;">훌륭한 </font> <code>FOR</code> </font><a href="http://www.robvanderwoude.com/ntfor.php#FOR_F"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명서</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">참조한 </font><font style="vertical-align: inherit;">후의 Windows 버전</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Версия для Windows после ознакомления с превосходной </font></font><a href="http://www.robvanderwoude.com/ntfor.php#FOR_F"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">документацией</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Роба ван дер Вуде</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">咨询优良的售后服务Windows版本</font></font><a href="http://www.robvanderwoude.com/ntfor.php#FOR_F"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文档</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>FOR</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">由罗布&middot;范德Woude</font></font>

source: Works on Windows. Should be good for others too. ($ is whatever directory you're in, in command prompt. eg. C:/Users/Username&gt;)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Funciona en Windows </font><font style="vertical-align: inherit;">Deber&iacute;a ser bueno para los dem&aacute;s tambi&eacute;n. </font><font style="vertical-align: inherit;">($ es el directorio en el que se encuentre, en el s&iacute;mbolo del sistema. Por ejemplo: C: / Users / Username&gt;)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windowsで動作します。</font><font style="vertical-align: inherit;">他の人にも良いはずです。</font><font style="vertical-align: inherit;">（$は、コマンドプロンプトで使用しているディレクトリです。例：C：/ Users / Username&gt;）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows에서 작동합니다. </font><font style="vertical-align: inherit;">다른 사람들에게도 좋을 것입니다. </font><font style="vertical-align: inherit;">($는 명령 프롬프트에있는 디렉토리입니다 (예 : C : / Users / Username&gt;)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Работает на Windows. </font><font style="vertical-align: inherit;">Должно быть хорошо и для других. </font><font style="vertical-align: inherit;">($ - это каталог, в котором вы находитесь, в командной строке. Например. C: / Users / Username&gt;)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">适用于Windows。</font><font style="vertical-align: inherit;">也应该对别人有好处。</font><font style="vertical-align: inherit;">（$是您在命令提示符下所在的目录，例如C：/ Users / Username&gt;）</font></font>

source: You can just print the packages that are outdated
es: Puedes imprimir los paquetes que están desactualizados
ja: 時代遅れのパッケージを印刷するだけでOK
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오래된 패키지 만 인쇄 할 수 있습니다</font></font>
ru: Вы можете просто распечатать пакеты,которые устарели.
zh_cn: 你可以直接打印出过期的包装就可以了

source: You can select 'a' to upgrade all packages; if one upgrade fails, run it again and it continues at the next one.
es: Puedes seleccionar 'a' para actualizar todos los paquetes;si una actualización falla,ejecútala de nuevo y continúa en la siguiente.
ja: a' を選択すると、すべてのパッケージをアップグレードできます。1 つのアップグレードが失敗した場合は、再度実行して、次のアップグレードで続行します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'a'를 선택하여 모든 패키지를 업그레이드 할 수 있습니다. </font><font style="vertical-align: inherit;">한 번의 업그레이드가 실패하면 다시 실행하고 다음 번에 계속하십시오.</font></font>
ru: Вы можете выбрать 'a' для обновления всех пакетов;если одно обновление не удается,запустите его снова,и оно продолжится на следующем.
zh_cn: 你可以选择'a'来升级所有的软件包;如果一个升级失败了,重新运行一次,在下一次升级时继续。

source: You can try this :
es: Puedes probar esto:
ja: あなたはこれを試すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 이것을 시도 할 수 있습니다 :</font></font>
ru: Вы можете попробовать это :
zh_cn: 你可以试试这个。

source: You can use the following Python code. Unlike <code>pip freeze</code>, this will not print warnings and FIXME errors. <strong>For pip &lt; 10.0.1</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar el siguiente c&oacute;digo de Python. </font><font style="vertical-align: inherit;">A diferencia del </font></font> <code>pip freeze</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , esto no imprimir&aacute; advertencias y errores de FIXME. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para pip &lt;10.0.1</font></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のPythonコードを使用できます。</font></font> <code>pip freeze</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とは異なり</font><font style="vertical-align: inherit;">、これは警告とFIXMEエラーを出力しません。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ピップ&lt;10.0.1の場合</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 Python 코드를 사용할 수 있습니다. </font></font> <code>pip freeze</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 달리 </font><font style="vertical-align: inherit;">경고 및 FIXME 오류는 인쇄하지 않습니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">핍 &lt;10.0.1의 경우</font></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать следующий код Python. </font><font style="vertical-align: inherit;">В отличие от </font></font> <code>pip freeze</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , это не будет печатать предупреждения и ошибки FIXME. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для пункта &lt;10.0.1</font></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以使用以下Python代码。</font><font style="vertical-align: inherit;">与</font></font> <code>pip freeze</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不同</font><font style="vertical-align: inherit;">，这不会打印警告和FIXME错误。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于点&lt;10.0.1</font></font></strong>

source: [1] Tested and regularly used in a Linux 4.8.16-200.fc24.x86_64 cluster and tested on five other Linux/Unix flavors. It also runs on Cygwin64 installed on Windows 10. Testing on iOS is needed.
es: 1]Probado y usado regularmente en un cluster de Linux 4.8.16-200.fc24.x86_64 y probado en otros cinco sabores de LinuxUnix.También funciona en Cygwin64 instalado en Windows 10.Es necesario probarlo en iOS.
ja: [1]Linux 4.8.16-200.fc24.x86_64クラスタでテスト済みで定期的に使用し、他の5つのLinuxUnixフレーバーでテストしました。また、Windows 10にインストールされたCygwin64でも動作します。iOSでのテストが必要です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[1] Linux 4.8.16-200.fc24.x86_64 클러스터에서 테스트 및 정기적으로 사용되며 5 개의 다른 Linux / Unix 플레이버에서 테스트되었습니다. </font><font style="vertical-align: inherit;">Windows 10에 설치된 Cygwin64에서도 실행됩니다. iOS에서 테스트해야합니다.</font></font>
ru: [1]Протестировано и регулярно используется в кластере Linux 4.8.16-200.fc24.x86_64 и протестировано на пяти других LinuxUnix-кластерах.Он также работает на Cygwin64,установленном на Windows 10.Необходимо тестирование на iOS.
zh_cn: 1]在Linux 4.8.16-200.fc24.x86_64集群中测试并经常使用,并在其他5个LinuxUnix版本上测试。它还运行在安装在Windows 10上的Cygwin64上。需要在iOS上进行测试。

source: [2] To see the anatomy of the command more clearly, this is the exact equivalent of the above pip3 command with comments:
es: 2]Para ver la anatomía del comando más claramente,este es el equivalente exacto del anterior comando pip3 con comentarios:
ja: [2]コマンドの構造をより明確に見るために、これは上記の pip3 コマンドとコメント付きで全く同じものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[2] 명령의 구조를보다 명확하게 보려면 위의 pip3 명령과 주석이 정확히 일치합니다.</font></font>
ru: [2]Чтобы увидеть анатомию команды более ясно,это точный эквивалент вышеприведенной команды пип3 с комментариями:
zh_cn: 2]为了更清楚地看到这条命令的解剖结构,这完全等同于上面的pip3命令,并加上注释。

source: [3] Upgrading a Python or PIP component that is also used in the upgrading of a Python or PIP component can be a potential cause of a deadlock or package database corruption.
es: 3]La actualización de un componente Python o PIP que también se utiliza en la actualización de un componente Python o PIP puede ser una causa potencial de un bloqueo o corrupción de la base de datos del paquete.
ja: 3]PythonやPIPコンポーネントのアップグレードでも使用されているPythonやPIPコンポーネントのアップグレードは、デッドロックやパッケージデータベースの破損の原因となる可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">[3] Python 또는 PIP 구성 요소 업그레이드에도 사용되는 Python 또는 PIP 구성 요소 업그레이드는 교착 상태 또는 패키지 데이터베이스 손상의 잠재적 원인이 될 수 있습니다.</font></font>
ru: [3]Обновление компонента Python или PIP,которое также используется при обновлении компонента Python или PIP,может стать потенциальной причиной тупика или повреждения базы данных пакетов.
zh_cn: 3]升级一个Python或PIP组件的升级也可能是导致死锁或包数据库损坏的潜在原因。

source: afterwards should make sure no dependencies are broken.
es: después debe asegurarse de que no se rompan las dependencias.
ja: の後で、依存関係が壊れていないことを確認する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 후에는 의존성이 깨지지 않도록해야합니다.</font></font>
ru: после этого убедитесь,что никакие зависимости не сломаны.
zh_cn: 事后应确保不破坏任何依赖关系。

source: however you need to get yolk first:
es: sin embargo,necesitas conseguir la yema primero:
ja: しかし、あなたは最初に黄身を取得する必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 먼저 노른자를 가져야합니다.</font></font>
ru: как бы тебе ни понадобилось сначала получить желток:
zh_cn: 但是,你需要先拿到蛋黄。

source: it works smoothly if there are no broken packages or special wheels in the list...
es: funciona sin problemas si no hay paquetes rotos o ruedas especiales en la lista...
ja: 壊れたパッケージや特殊なホイールが入っていなければスムーズに動作するのですが...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">목록에 깨진 패키지 또는 특수 휠이 없으면 원활하게 작동합니다 ...</font></font>
ru: он работает бесперебойно,если в списке нет сломанных пакетов или специальных колес...
zh_cn: 如果列表中没有破损的包裹或特殊的轮子,它可以顺利工作.....

source: one line in powershell 5.1 with adm rights, python 3.6.5 and pip ver 10.0.1:
es: una línea en el PowerShell 5.1 con derechos de admisión,pitón 3.6.5 y pip ver 10.0.1:
ja: powershell 5.1で1行、python 3.6.5とpip ver 10.0.1の権限を持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">adm 권한을 가진 powershell 5.1의 한 줄, python 3.6.5 및 pip ver 10.0.1 :</font></font>
ru: одна строка в раскладке 5.1 с правами адмирала,питон 3.6.5 и пипс 10.0.1:
zh_cn: 在powershell 5.1中的一行,带adm权限,python 3.6.5和pip版本10.0.1。

source: open the text file, replace the <code>==</code> with <code>&gt;=</code> , and execute
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">abra el archivo de texto, reemplace el </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>&gt;=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y ejecute</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">テキストファイルを開き、</font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>&gt;=</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">置き換えて</font><font style="vertical-align: inherit;">実行します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">텍스트 파일을 열고 </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font></font> <code>&gt;=</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 바꾸고 </font><font style="vertical-align: inherit;">실행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">откройте текстовый файл, замените </font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на </font></font> <code>&gt;=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и выполните</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">打开文本文件，替换</font></font> <code>==</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用</font></font> <code>&gt;=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并执行</font></font>

source: then pass them to <code>xargs</code> to run the command, <code>pip install -U</code>, with each line as appending arguments
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">luego </font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font><font style="vertical-align: inherit;">xargs</font><font style="vertical-align: inherit;"> para ejecutar el comando, </font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , con cada l&iacute;nea como argumentos anexos</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次に、それらを</font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">渡して</font><font style="vertical-align: inherit;">、コマンド</font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を実行し、</font><font style="vertical-align: inherit;">各行を引数として追加します</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 </font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">전달하여 </font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명령을 실행하여 </font><font style="vertical-align: inherit;">각 줄을 인수로 추가하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">затем передайте их </font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для запуска команды, </font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , с каждой строкой в ​​качестве добавляемых аргументов</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后将它们传递给</font></font> <code>xargs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以运行命令</font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，每行都作为附加参数</font></font>

source: use awk update packges: <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">use paquetes de actualizaci&oacute;n awk: </font></font> <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">awk更新パッケージを使用： </font></font> <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">awk 업데이트 패키지 사용 : </font></font> <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">используйте пакеты обновления awk: </font></font> <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用awk更新包：</font> <code> pip install -U $(pip freeze | awk -F'[=]' '{print $1}') </code> <font style="vertical-align: inherit;"> Frozen </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">| awk -F'[=]''{print $ 1}'） </font></font>

source: when using a virtualenv and if you just want to upgrade packages <strong>added</strong> to your virtualenv, you may want to do:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cuando use un virtualenv y si solo desea actualizar los paquetes </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">agregados</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a su virtualenv, puede hacer lo siguiente:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">virtualenvを使用していて、virtualenvに</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">追加さ</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">れた</font><font style="vertical-align: inherit;">パッケージをアップグレードするだけの場合は</font><font style="vertical-align: inherit;">、次のようにすることができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">virtualenv를 사용할 때 virtualenv에 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">추가 된</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 패키지 만 업그레이드 </font><font style="vertical-align: inherit;">하려면 다음을 수행하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">при использовании virtualenv и если вы просто хотите обновить пакеты, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">добавленные</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в virtualenv, вы можете сделать следующее:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用virtualenv时，如果您只想升级</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">添加</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">到virtualenv中的</font><font style="vertical-align: inherit;">软件包</font><font style="vertical-align: inherit;">，则可能需要执行以下操作：</font></font>

source: windows powershell update <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">actualizaci&oacute;n de Windows powershell </font></font> <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows PowerShellの更新 </font></font> <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 Windows PowerShell 업데이트 </font></font> <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обновление Windows PowerShell </font></font> <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows PowerShell更新 </font></font> <code> foreach($p in $(pip freeze)){ pip install -U $p.Split("=")[0]} </code>
