Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>grep</code> is to skip editable ("-e") package definitions, as suggested by @jawache. (Yes, you could replace <code>grep</code>+<code>cut</code> with <code>sed</code> or <code>awk</code> or <code>perl</code> or...).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es omitir las definiciones de paquete editables ("-e"), como lo sugiere @jawache. </font><font style="vertical-align: inherit;">(S&iacute;, puede reemplazar </font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con </font></font> <code>sed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o ...).</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>grep</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> @jawacheにより示唆されるように、編集可能（「-e」）のパッケージ定義をスキップすることです。</font><font style="vertical-align: inherit;">（はい、</font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font> <code>sed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または...に</font><font style="vertical-align: inherit;">置き換えることができ</font><font style="vertical-align: inherit;">ます）。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> @jawache에 의해 제안, 편집 ( "-e") 패키지 정의를 생략하는 것입니다. </font><font style="vertical-align: inherit;">(예, </font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font></font> <code>sed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 ...로 </font><font style="vertical-align: inherit;">바꿀 수 </font><font style="vertical-align: inherit;">있습니다.)</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> это пропустить редактируемые ( &laquo;-e&raquo;) определения пакета, как это было </font><font style="vertical-align: inherit;">предложено @jawache. </font><font style="vertical-align: inherit;">(Да, вы можете заменить </font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с </font></font> <code>sed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или ...).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所述</font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是跳过编辑（&ldquo;-e&rdquo;）包的定义，通过@jawache的建议。</font><font style="vertical-align: inherit;">（是的，您可以将</font></font> <code>grep</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> + </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">替换</font><font style="vertical-align: inherit;">为</font></font> <code>sed</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>perl</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或...）。</font></font>

source: The <code>site-packages</code> check excludes my development packages, because they are not located in the system site-packages directory. The try-except simply skips packages that have been removed from PyPI.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">comprobaci&oacute;n de </font></font> <code>site-packages</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> excluye mis paquetes de desarrollo, ya que no se encuentran en el directorio de paquetes de sitio del sistema. </font><font style="vertical-align: inherit;">El try-except simplemente omite los paquetes que se han eliminado de PyPI.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>site-packages</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それらは、システムのsite-packagesディレクトリに配置されていないので、除外私の開発パッケージを確認してください。</font><font style="vertical-align: inherit;">try-exceptは、PyPIから削除されたパッケージを単にスキップします。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>site-packages</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 들이 시스템 사이트 패키지 디렉토리에 있지 않기 때문에, 제외 내 개발 패키지를 확인합니다. </font><font style="vertical-align: inherit;">try-except는 단순히 PyPI에서 제거 된 패키지를 건너 뜁니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На </font></font> <code>site-packages</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> проверки Исключает мои пакеты разработки, потому что они не находятся в каталоге сайта-пакеты системы. </font><font style="vertical-align: inherit;">Try-кроме просто пропускает пакеты, которые были удалены из PyPI.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font> <code>site-packages</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">检查排除我的开发包，因为它们不是位于系统site-packages目录。</font><font style="vertical-align: inherit;">try-except仅跳过已从PyPI中删除的软件包。</font></font>

source: The above command uses the simplest and most portable pip syntax in combination with sed and sh to overcome these issues completely. Details of sed operation can be scrutinized with the commented version<sup>2</sup>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El comando anterior utiliza la sintaxis de pip m&aacute;s simple y port&aacute;til en combinaci&oacute;n con sed y sh para superar estos problemas por completo. </font><font style="vertical-align: inherit;">Los detalles de la operaci&oacute;n sed se pueden examinar con la versi&oacute;n comentada </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記のコマンドは、sedおよびshと組み合わせて最も単純で移植性の高いpip構文を使用して、これらの問題を完全に克服します。</font><font style="vertical-align: inherit;">sed操作の詳細は、コメント付きのバージョン</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2で</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">詳しく調べることができます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 명령은 sed 및 sh와 함께 가장 단순하고 이식성이 높은 pip 구문을 사용하여 이러한 문제를 완전히 극복합니다. </font><font style="vertical-align: inherit;">주석 처리 된 버전 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2를</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 sed 작업에 대한 세부 정보를 조사 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Приведенная выше команда использует простейший и наиболее переносимый синтаксис пипса в сочетании с sed и sh для полного преодоления этих проблем. </font><font style="vertical-align: inherit;">Детали операции sed можно изучить с помощью комментируемой версии </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上面的命令结合使用sed和sh来使用最简单，最可移植的pip语法来完全克服这些问题。</font><font style="vertical-align: inherit;">sed操作的详细信息可以通过注释的版本</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行审查</font><font style="vertical-align: inherit;">。</font></font>

source: The explanation is that <code>pip list --outdated</code> outputs a list of all the outdated packages in this format:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La explicaci&oacute;n es que </font></font> <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> genera una lista de todos los paquetes desactualizados en este formato:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">説明は、</font></font> <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がすべての古いパッケージのリストを次の形式で出力することです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설명은 인 </font></font> <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 형식의 모든 구형 패키지 목록을 출력한다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Объяснение состоит в том, что </font></font> <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font><font style="vertical-align: inherit;">outdated</font><font style="vertical-align: inherit;"> выводит список всех устаревших пакетов в этом формате:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解释是</font></font> <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以这种格式输出所有过时软件包的列表：</font></font>

source: The following one-liner might prove of help:
es: La siguiente frase podría ser de ayuda:
ja: 次の一文が参考になるかもしれません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음의 한 줄짜리 도움이 될 수 있습니다.</font></font>
ru: Следующий один лайнер может оказаться полезным:
zh_cn: 以下的单句也许会有帮助:

source: The rather amazing yolk makes this easy.
es: La asombrosa yema lo hace fácil.
ja: 驚くべき黄身のおかげで、これが簡単にできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다소 놀라운 노른자가 이것을 쉽게 만듭니다.</font></font>
ru: Довольно удивительный желток делает это легким.
zh_cn: 相当惊人的蛋黄让这一切变得简单。

source: The shortest and easiest on Windows.
es: El más corto y fácil de Windows.
ja: Windowsで一番短くて簡単。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows에서 가장 짧고 가장 쉽습니다.</font></font>
ru: Самый короткий и простой на Windows.
zh_cn: Windows上最短的,也是最容易的。

source: The simplest and fastest solution that I found in the <a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776">pip issue discussion</a> is:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La soluci&oacute;n m&aacute;s simple y r&aacute;pida que encontr&eacute; en la </font></font><a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">discusi&oacute;n del tema pip</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私が</font></font><a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ピップ問題の議論で</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つけた最も簡単で最速の解決策</font><font style="vertical-align: inherit;">は次のとおりです：</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip 문제 토론</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 찾은 가장 간단하고 빠른 솔루션 </font><font style="vertical-align: inherit;">은 다음과 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Самое простое и быстрое решение, которое я нашел в </font></font><a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обсуждении проблемы пипсов</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font><a href="https://github.com/pypa/pip/issues/3819#issuecomment-286696776"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">点子问题讨论中</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">找到的最简单，最快的解决方案</font><font style="vertical-align: inherit;">是：</font></font>

source: There isn't a built-in flag yet, but you can use
es: No hay una bandera incorporada todavía,pero puedes usar
ja: 組み込みのフラグはまだありませんが
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아직 내장 플래그가 없지만 사용할 수 있습니다</font></font>
ru: Встроенного флага пока нет,но вы можете использовать
zh_cn: 还没有一个内置的标志,但你可以使用

source: This is a PowerShell solution for Python 3:
es: Esta es una solución de PowerShell para Python 3:
ja: Python 3のPowerShellソリューションです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 Python 3 용 PowerShell 솔루션입니다.</font></font>
ru: Это решение PowerShell для Python 3:
zh_cn: 这是一个针对Python 3的PowerShell解决方案。

source: This option seems to me more straightforward and readable:
es: Esta opción me parece más directa y legible:
ja: このオプションは、私にはよりわかりやすく、読みやすいように思えます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 옵션은 더 간단하고 읽기 쉽습니다.</font></font>
ru: Этот вариант кажется мне более простым и читабельным:
zh_cn: 这个选项在我看来比较直接,可读性强。

source: This seemed to work for me...
es: Esto parecía funcionar para mí...
ja: これは私には効きそうだったんですが...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 나를 위해 작동하는 것 같았습니다 ...</font></font>
ru: Мне показалось,что это сработало...
zh_cn: 这似乎对我来说很有效.....

source: This seems more concise.
es: Esto parece más conciso.
ja: こちらの方が簡潔な気がします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 간결 해 보입니다.</font></font>
ru: Это кажется более лаконичным.
zh_cn: 这似乎更简明扼要。

source: This solution is well designed and tested<sup>1</sup>, whereas there are problems with even the most popular solutions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta soluci&oacute;n est&aacute; bien dise&ntilde;ada y probada </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , mientras que hay problemas incluso con las soluciones m&aacute;s populares.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このソリューションは適切に設計およびテストされています</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1が</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、最も一般的なソリューションでさえ問題があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 솔루션은 잘 설계되고 테스트 </font><font style="vertical-align: inherit;">되었지만 </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가장 인기있는 솔루션에도 문제가 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это решение хорошо спроектировано и протестировано </font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , в то время как есть проблемы даже с самыми популярными решениями.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该解决方案经过精心设计和测试</font></font><sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，而即使是最流行的解决方案也存在问题。</font></font>

source: This upgrades the packages one by one. So a
es: Esto mejora los paquetes uno por uno.Así que un
ja: これはパッケージを一つずつアップグレードしていきます。ということで
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패키지를 하나씩 업그레이드합니다. </font><font style="vertical-align: inherit;">그래서</font></font>
ru: При этом пакеты обновляются один за другим.Итак
zh_cn: 这样一来,就把套餐逐一升级了。所以,一个

source: To upgrade all local packages; you could use <a href="https://github.com/jgonggrijp/pip-review"><code>pip-review</code></a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para actualizar todos los paquetes locales; </font><font style="vertical-align: inherit;">podr&iacute;as usar </font></font><a href="https://github.com/jgonggrijp/pip-review"> <code>pip-review</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべてのローカルパッケージをアップグレードするには、</font><font style="vertical-align: inherit;">あなたは</font></font><a href="https://github.com/jgonggrijp/pip-review"> <code>pip-review</code> を</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使うことができ</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 로컬 패키지를 업그레이드하려면 </font></font><a href="https://github.com/jgonggrijp/pip-review"> <code>pip-review</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">:</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновить все локальные пакеты; </font><font style="vertical-align: inherit;">Вы можете использовать </font></font><a href="https://github.com/jgonggrijp/pip-review"> <code>pip-review</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">升级所有本地软件包；</font><font style="vertical-align: inherit;">您可以使用</font></font><a href="https://github.com/jgonggrijp/pip-review"> <code>pip-review</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Use <a href="https://github.com/achillesrasquinha/pipupgrade"><strong>pipupgrade</strong></a>!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font><a href="https://github.com/achillesrasquinha/pipupgrade"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/achillesrasquinha/pipupgrade"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgradeを</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用してください</font><font style="vertical-align: inherit;">！</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://github.com/achillesrasquinha/pipupgrade"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade를</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하십시오 </font><font style="vertical-align: inherit;">!</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font><a href="https://github.com/achillesrasquinha/pipupgrade"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font></font><a href="https://github.com/achillesrasquinha/pipupgrade"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pipupgrade</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">！</font></font>

source: Windows Powershell solution
es: La solución de Windows Powershell
ja: Windows Powershell ソリューション
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Windows Powershell 솔루션</font></font>
ru: решение Windows Powershell
zh_cn: Windows Powershell解决方案
