Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://stackoverflow.com/a/5839291/3357935">@Ramana's answer</a> worked the best for me, of those here, but I had to add a few catches:
es: <a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La respuesta de @ Ramana</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funcion&oacute; mejor para m&iacute;, de los que est&aacute;n aqu&iacute;, pero tuve que agregar algunas capturas:</font></font>
ja: <a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ramanaの答え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、私にとってここで最もうまくいきましたが、私はいくつかのキャッチを追加する必要がありました：</font></font>
ko: <a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ramana의 대답</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 여기에 저에게 가장 효과적이지만 몇 가지를 추가해야했습니다.</font></font>
ru: <a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ответ @ Раманы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работал лучше для меня, из тех, кто здесь, но мне пришлось добавить несколько уловов:</font></font>
zh_cn: <a href="https://stackoverflow.com/a/5839291/3357935"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@Ramana的答案</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对我来说最有效，但是我不得不添加一些注意事项：</font></font>

source: <code>-n1</code> limits the number of arguments passed to each command <code>pip install -U</code> to be 1
es: <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> limita el n&uacute;mero de argumentos pasados ​​a cada comando </font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ser 1</font></font>
ja: <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、各コマンド</font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">渡される引数の数を</font><font style="vertical-align: inherit;">1に</font><font style="vertical-align: inherit;">制限</font><font style="vertical-align: inherit;">します</font></font>
ko: <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 각 명령 </font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">전달되는 인수 </font><font style="vertical-align: inherit;">수를 1로 제한합니다.</font></font>
ru: <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ограничивает количество аргументов, передаваемых каждой команде </font></font> <code>pip install -U</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> равным 1</font></font>
zh_cn: <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将传递给每个命令</font></font> <code>pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的参数数量限制</font><font style="vertical-align: inherit;">为1</font></font>

source: <code>awk '{if(NR&gt;=3)print}'</code> skips header lines
es: <code>awk '{if(NR&gt;=3)print}'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> omite las l&iacute;neas del encabezado</font></font>
ja: <code>awk '{if(NR&gt;=3)print}'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はヘッダー行をスキップします</font></font>
ko: <code>awk '{if(NR&gt;=3)print}'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 헤더 행을 건너 뜁니다.</font></font>
ru: <code>awk '{if(NR&gt;=3)print}'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пропускает строки заголовка</font></font>
zh_cn: <code>awk '{if(NR&gt;=3)print}'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">跳过标题行</font></font>

source: <code>cd</code> into your project directory, then run:
es: <code>cd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el directorio de tu proyecto, luego ejecuta:</font></font>
ja: <code>cd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロジェクトディレクトリに</font><font style="vertical-align: inherit;">cd</font><font style="vertical-align: inherit;">し、次を実行：</font></font>
ko: <code>cd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로젝트 디렉토리로 </font><font style="vertical-align: inherit;">cd</font><font style="vertical-align: inherit;"> 한 후 다음을 실행하십시오.</font></font>
ru: <code>cd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в папку проекта, затем выполните команду:</font></font>
zh_cn: <code>cd</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进入您的项目目录，然后运行：</font></font>

source: <code>cut -d' ' -f1</code> fetches the first column
es: <code>cut -d' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la primera columna</font></font>
ja: <code>cut -d' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初の列をフェッチします</font></font>
ko: <code>cut -d' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 첫 번째 열을 가져옵니다.</font></font>
ru: <code>cut -d' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выбирает первый столбец</font></font>
zh_cn: <code>cut -d' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获取第一列</font></font>

source: <code>cut -f1 -d1' '</code> returns the first word - the name of the outdated package;
es: <code>cut -f1 -d1' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve la primera palabra: el nombre del paquete desactualizado;</font></font>
ja: <code>cut -f1 -d1' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初の単語-古いパッケージの名前を返します。</font></font>
ko: <code>cut -f1 -d1' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 첫 번째 단어-오래된 패키지의 이름을 리턴합니다.</font></font>
ru: <code>cut -f1 -d1' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> возвращает первое слово - имя устаревшего пакета;</font></font>
zh_cn: <code>cut -f1 -d1' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">返回第一个单词-过时软件包的名称；</font></font>

source: <code>grep -v -i warning</code> inverted match on <code>warning</code> to avoid errors when updating
es: <code>grep -v -i warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> coincidencia invertida en </font></font> <code>warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para evitar errores al actualizar</font></font>
ja: <code>grep -v -i warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新時のエラーを回避するために</font><font style="vertical-align: inherit;">、</font><font style="vertical-align: inherit;">grep -v -i warning</font><font style="vertical-align: inherit;">反転一致の</font></font> <code>warning</code> <font style="vertical-align: inherit;"></font>
ko: <code>grep -v -i warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 반전 일치를 </font></font> <code>warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 때 업데이트 오류를 방지하기 위해</font></font>
ru: <code>grep -v -i warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> инвертированное совпадение при </font></font> <code>warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы избежать ошибок при обновлении</font></font>
zh_cn: <code>grep -v -i warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对</font></font> <code>warning</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">进行</font><font style="vertical-align: inherit;">反向匹配，</font><font style="vertical-align: inherit;">以避免更新时出错</font></font>

source: <code>pip list --outdated</code> gets lines like these
es: <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> obtiene l&iacute;neas como estas</font></font>
ja: <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は次のような行を取得します</font></font>
ko: <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 다음과 같은 줄을 얻습니다.</font></font>
ru: <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> получает такие строки</font></font>
zh_cn: <code>pip list --outdated</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">获取这样的行</font></font>

source: <code>pip list -o</code> lists outdated packages;
es: <code>pip list -o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> enumera paquetes obsoletos;</font></font>
ja: <code>pip list -o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は古いパッケージをリストします。</font></font>
ko: <code>pip list -o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 오래된 패키지를 나열합니다.</font></font>
ru: <code>pip list -o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выводит список устаревших пакетов;</font></font>
zh_cn: <code>pip list -o</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列出过时的软件包；</font></font>

source: <code>pip-review</code> is a fork of <code>pip-tools</code>. See <a href="https://github.com/nvie/pip-tools/issues/185"><code>pip-tools</code> issue</a> mentioned by <a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635">@knedlsepp</a>. <code>pip-review</code> package works but <code>pip-tools</code> package no longer works.
es: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una bifurcaci&oacute;n de </font></font> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ver </font></font><a href="https://github.com/nvie/pip-tools/issues/185"> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tema</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mencionado por </font></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@knedlsepp</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> paquete </font><font style="vertical-align: inherit;">pip-review</font><font style="vertical-align: inherit;"> funciona pero el paquete </font></font> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ya no funciona.</font></font>
ja: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font> <code>pip-tools</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フォークです</font><font style="vertical-align: inherit;">。</font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635"><font style="vertical-align: inherit;">@knedlseppが</font></a><font style="vertical-align: inherit;">言及している</font></font><a href="https://github.com/nvie/pip-tools/issues/185"> <code>pip-tools</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">問題を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照してください</font><font style="vertical-align: inherit;">。</font> <code>pip-review</code> <font style="vertical-align: inherit;">パッケージは機能しますが、</font> <code>pip-tools</code> <font style="vertical-align: inherit;">パッケージは機能しなくなります。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 포크입니다 </font><font style="vertical-align: inherit;">. </font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635"><font style="vertical-align: inherit;">@knedlsepp에서</font></a><font style="vertical-align: inherit;"> 언급 한 </font></font><a href="https://github.com/nvie/pip-tools/issues/185"> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문제를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조하십시오 </font><font style="vertical-align: inherit;">. </font> <code>pip-review</code> <font style="vertical-align: inherit;"> 패키지는 작동하지만 </font> <code>pip-tools</code> <font style="vertical-align: inherit;"> 패키지는 더 이상 작동하지 않습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это форк </font></font> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Смотрите </font><a href="https://github.com/nvie/pip-tools/issues/185"><font style="vertical-align: inherit;">проблему </font></a></font> <code>pip-tools</code> ,<font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> упомянутую </font></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@knedlsepp</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Пакет </font></font> <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работает, но пакет </font></font> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> больше не работает.</font></font>
zh_cn: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是</font></font> <code>pip-tools</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一个分支</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">请参阅</font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment51585726_16269635"><font style="vertical-align: inherit;">@knedlsepp</font></a><font style="vertical-align: inherit;">提到的</font></font><a href="https://github.com/nvie/pip-tools/issues/185"> <code>pip-tools</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">问题</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font> <code>pip-review</code> <font style="vertical-align: inherit;">软件包有效，但</font> <code>pip-tools</code> <font style="vertical-align: inherit;">软件包不再有效。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <code>pip-review</code> works on Windows <a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635">since version 0.5</a>.
es: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funciona en Windows </font></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">desde la versi&oacute;n 0.5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <code>pip-review</code> は<font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、バージョン0.5以降の</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Windowsで動作します</font><font style="vertical-align: inherit;">。</font></font>
ko: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">버전 0.5 이후</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Windows에서 작동합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <code>pip-review</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работает на Windows </font></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">начиная с версии 0.5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <code>pip-review</code> <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/questions/2720014/upgrading-all-packages-with-pip/16269635#comment67179492_16269635"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从0.5版开始，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip-review</font><font style="vertical-align: inherit;">在Windows上运行</font><font style="vertical-align: inherit;">。</font></font>

source: <code>tr "\n|\r" " "</code> converts the multiline result from <code>cut</code> into a single-line, space-separated list;
es: <code>tr "\n|\r" " "</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> convierte el resultado de </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> l&iacute;neas </font><font style="vertical-align: inherit;">de </font><font style="vertical-align: inherit;">corte</font><font style="vertical-align: inherit;"> en una lista de una sola l&iacute;nea, separada por espacios;</font></font>
ja: <code>tr "\n|\r" " "</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、複数行の結果を</font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">単一行のスペース区切りリストに変換します。</font></font>
ko: <code>tr "\n|\r" " "</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 여러 </font><font style="vertical-align: inherit;">줄로 된 </font><font style="vertical-align: inherit;">결과를 </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 줄 간격으로 구분 된 목록으로 변환합니다.</font></font>
ru: <code>tr "\n|\r" " "</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> преобразует многострочный результат </font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в однострочный разделенный пробелами список;</font></font>
zh_cn: <code>tr "\n|\r" " "</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将</font></font> <code>cut</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的多行结果</font><font style="vertical-align: inherit;">转换为单行，以空格分隔的列表；</font></font>

source: <code>xargs -n1 pip install -U</code> takes 1 argument from the pipe left of it, and passes it to the command to upgrade the list of packages.
es: <code>xargs -n1 pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> toma 1 argumento de la tuber&iacute;a a la izquierda y lo pasa al comando para actualizar la lista de paquetes.</font></font>
ja: <code>xargs -n1 pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、その左側のパイプから引数を1つ取り、それをコマンドに渡してパッケージのリストをアップグレードします。</font></font>
ko: <code>xargs -n1 pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 왼쪽 파이프에서 1 개의 인수를 가져 와서 패키지 목록을 업그레이드하는 명령으로 전달합니다.</font></font>
ru: <code>xargs -n1 pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> берет 1 аргумент из левого канала и передает его команде для обновления списка пакетов.</font></font>
zh_cn: <code>xargs -n1 pip install -U</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从其左侧的管道中获取1个参数，并将其传递给命令以升级软件包列表。</font></font>
