Repository: rueisnom/feedback
Catalog: xlf/27/20/01/4/2720014.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: For more info on yolk: <a href="https://pypi.python.org/pypi/yolk/0.4.3">https://pypi.python.org/pypi/yolk/0.4.3</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para m&aacute;s informaci&oacute;n sobre la yema: </font></font><a href="https://pypi.python.org/pypi/yolk/0.4.3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://pypi.python.org/pypi/yolk/0.4.3</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヨークの詳細情報：</font><a href="https://pypi.python.org/pypi/yolk/0.4.3"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//pypi.python.org/pypi/yolk/0.4.3</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">노른자에 대한 자세한 내용 : </font></font><a href="https://pypi.python.org/pypi/yolk/0.4.3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://pypi.python.org/pypi/yolk/0.4.3</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для получения дополнительной информации о желтке: </font></font><a href="https://pypi.python.org/pypi/yolk/0.4.3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://pypi.python.org/pypi/yolk/0.4.3</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有关蛋黄的更多信息：</font><a href="https://pypi.python.org/pypi/yolk/0.4.3"><font style="vertical-align: inherit;">https</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//pypi.python.org/pypi/yolk/0.4.3</font></font>

source: For pip, just remove the 3s as such:
es: Para el pip,sólo hay que quitar los 3 como tal:
ja: ピップの場合は、このように3を外せばいいだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip의 경우 다음과 같이 3을 제거하십시오.</font></font>
ru: Для трубопровода,просто удалите 3s как таковые:
zh_cn: 对于pip来说,只要把3s去掉就可以了。

source: For pip3 use this:
es: Para pip3 usa esto:
ja: pip3の場合はこれを使います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip3의 경우 다음을 사용하십시오.</font></font>
ru: Для трубопровода 3 используйте это:
zh_cn: 对于pip3,使用这个。

source: From <a href="https://github.com/cakebread/yolk">https://github.com/cakebread/yolk</a> :
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde </font></font><a href="https://github.com/cakebread/yolk"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/cakebread/yolk</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://github.com/cakebread/yolk"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/cakebread/yolk</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">から</font><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font><a href="https://github.com/cakebread/yolk"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/cakebread/yolk</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С </font></font><a href="https://github.com/cakebread/yolk"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/cakebread/yolk</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从</font></font><a href="https://github.com/cakebread/yolk"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/cakebread/yolk</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Full disclosure: I wrote this package.
es: Revelación completa:Yo escribí este paquete.
ja: 完全開示:私はこのパッケージを書きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 공개 :이 패키지를 작성했습니다.</font></font>
ru: Полное раскрытие:я написал этот пакет.
zh_cn: 全面披露:我写了这套方案。

source: Here is a working example:
es: Aquí hay un ejemplo práctico:
ja: ここでは作業例を紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 실제 예입니다.</font></font>
ru: Вот рабочий пример:
zh_cn: 下面是一个工作实例。

source: How about:
es: ¿Qué tal si..:
ja: どうですか?
ko: 어때요?
ru: Как насчет:
zh_cn: 怎么样?

source: How to upgrade all Python packages with pip
es: Cómo actualizar todos los paquetes de Python con pip
ja: pipで全てのPythonパッケージをアップグレードする方法
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pip로 모든 Python 패키지를 업그레이드하는 방법</font></font>
ru: Как обновить все пакеты Python с помощью pip
zh_cn: 如何用pip升级所有Python包

source: I also like the pip-review method:
es: También me gusta el método de revisión de pip:
ja: ピップレビュー方式もいいですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 또한 pip-review 방법을 좋아합니다.</font></font>
ru: Мне также нравится метод обзора:
zh_cn: 我也很喜欢pip-review的方法。

source: I had the same problem with upgrading. Thing is, i never upgrade all packages. I upgrade only what i need, because project may break.
es: Tuve el mismo problema con la actualización.La cosa es que nunca actualizo todos los paquetes.Sólo actualizo lo que necesito,porque el proyecto puede romperse.
ja: 私もアップグレードで同じ問題を抱えていました。実は、私はすべてのパッケージをアップグレードすることはありません。プロジェクトが壊れるかもしれないので、必要なものだけをアップグレードしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업그레이드와 같은 문제가있었습니다. </font><font style="vertical-align: inherit;">모든 패키지를 업그레이드하지는 않습니다. </font><font style="vertical-align: inherit;">프로젝트가 중단 될 수 있기 때문에 필요한 것만 업그레이드합니다.</font></font>
ru: У меня была такая же проблема с модернизацией.Дело в том,что я никогда не обновляю все пакеты.Я обновляю только то,что мне нужно,потому что проект может сломаться.
zh_cn: 我在升级时也遇到了同样的问题。问题是,我从不升级所有的软件包。我只升级我需要的东西,因为项目可能会损坏。

source: I used <code>printf</code> with a space afterwards to properly separate the package names.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sol&iacute;a </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con un espacio despu&eacute;s de separar correctamente los nombres de los paquetes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その後、</font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をスペース付きで</font><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">して、パッケージ名を適切に区切りました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패키지 이름을 올바르게 분리하기 위해 공백으로 </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용했습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использовал </font></font> <code>printf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с пробелом для правильного разделения имен пакетов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">之后，我在</font></font> <code>printf</code> 后面<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">加上了一个空格，以正确分隔软件包名称。</font></font>

source: If the requirements are placed in a non-standard location, send them as arguments:
es: Si los requisitos se colocan en un lugar no estándar,envíelos como argumentos:
ja: 要件が標準以外の場所に置かれている場合は、引数として送信します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요구 사항이 비표준 위치에있는 경우 인수로 보내십시오.</font></font>
ru: Если требования размещены в нестандартном месте,отправьте их в качестве аргументов:
zh_cn: 如果要求放置在非标准位置,则以参数形式发送。

source: If you already know what package you want to upgrade, simply send them as arguments:
es: Si ya sabes qué paquete quieres actualizar,simplemente envíalos como argumentos:
ja: アップグレードしたいパッケージが決まっている場合は、それらを引数として送るだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업그레이드하려는 패키지를 이미 알고 있다면 인수로 보내십시오.</font></font>
ru: Если вы уже знаете,какой пакет вы хотите обновить,просто отправьте их в качестве аргументов:
zh_cn: 如果你已经知道你要升级什么包,只需将它们作为参数发送。

source: If you have a problem with a certain package stalling the upgrade (numpy sometimes), just go to the directory ($), comment out the name (add a # before it) and run the upgrade again. You can later uncomment that section back. This is also great for copying python global environments.
es: Si tienes un problema con un determinado paquete que retrasa la actualización (a veces es un poco insensible),sólo tienes que ir al directorio ($),comentar el nombre (añadir un#antes de él)y ejecutar la actualización de nuevo.Más tarde podrá volver a descomentar esa sección.Esto también es genial para copiar los entornos globales de Python.
ja: もし、あるパッケージがアップグレードをストールしてしまう問題がある場合 (numpy の場合もあります)、ディレクトリ ($)に行って、名前をコメントアウトして (その前に#を追加して)、再度アップグレードを実行してください。後でその部分のコメントを解除することができます。これは python のグローバル環境をコピーするのにも最適です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업그레이드를 중단시키는 특정 패키지에 문제가있는 경우 (때로는 숫자가 많음) 디렉토리 ($)로 이동하여 이름을 주석 처리하고 (# 앞에 추가) 업그레이드를 다시 실행하십시오. </font><font style="vertical-align: inherit;">나중에 해당 섹션의 주석을 해제 할 수 있습니다. </font><font style="vertical-align: inherit;">이것은 파이썬 글로벌 환경을 복사하는 데에도 좋습니다.</font></font>
ru: Если у вас возникли проблемы с определенным пакетом,тормозящим обновление (иногда numpy),просто перейдите в каталог ($),прокомментируйте имя (добавьте#перед ним)и запустите обновление снова.Позже вы можете снять комментарии с этого раздела.Это также отлично подходит для копирования глобальных окружений питона.
zh_cn: 如果你对某一个软件包的升级有问题(有时是numpy),只需到目录($),注释出该名称(在其前面加上一个#),然后再次运行升级。以后你可以把那部分内容取消注释回来。这对于复制python全局环境也是很好的。

source: If you need more "fine grained" control over what is omitted and what raises an error you should not add the <code>-n1</code> flag and explicitly define the errors to ignore, by "piping" the following line for each separate error:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si necesita un control m&aacute;s "preciso" sobre lo que se omite y lo que genera un error, no debe agregar el </font><font style="vertical-align: inherit;">indicador </font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y definir expl&iacute;citamente los errores a ignorar, "canalizando" la siguiente l&iacute;nea para cada error por separado:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">何が省略され、何がエラーを発生させるかについてより詳細な制御が必要な場合は、</font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フラグを</font><font style="vertical-align: inherit;">追加して、</font><font style="vertical-align: inherit;">無視するエラーを明示的に定義しないでください。個別のエラーごとに次の行を「パイプ」します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">생략 된 것과 오류를 발생시키는 것에 대해보다 "미세한"제어가 필요한 경우 </font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 플래그를 </font><font style="vertical-align: inherit;">추가하지 말고 </font><font style="vertical-align: inherit;">각각의 개별 오류에 대해 다음 줄을 "파이핑"하여 무시할 오류를 명시 적으로 정의해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам требуется более &laquo;мелкозернистый&raquo; контроль над тем, что пропущено и что вызывает ошибку, вы не должны добавлять </font><font style="vertical-align: inherit;">флаг </font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и явно определять ошибки, которые следует игнорировать, &laquo;обрезая&raquo; следующую строку для каждой отдельной ошибки:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您需要对遗漏的内容和引起错误的内容进行更多的&ldquo;细粒度&rdquo;控制，则不应添加</font></font> <code>-n1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标志并明确定义要忽略的错误，方法是为每个单独的错误&ldquo;插入&rdquo;以下行：</font></font>

source: If you need to upgrade to pre-release / post-release version, add <code>--prerelease</code> argument to your command.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si necesita actualizar a la versi&oacute;n previa al lanzamiento / posterior al lanzamiento, agregue el </font><font style="vertical-align: inherit;">argumento </font></font> <code>--prerelease</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a su comando.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プレリリース/ポストリリースバージョンにアップグレードする必要がある場合は</font><font style="vertical-align: inherit;">、コマンドに</font></font> <code>--prerelease</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引数を</font><font style="vertical-align: inherit;">追加</font><font style="vertical-align: inherit;">します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시험판 / 시험판 버전으로 업그레이드해야하는 경우 </font></font> <code>--prerelease</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인수를 명령에 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вам нужно перейти на версию до и после выпуска, добавьте </font><font style="vertical-align: inherit;">аргумент </font></font> <code>--prerelease</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в свою команду.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果需要升级到发行前/发行后版本，</font><font style="vertical-align: inherit;">请在命令中</font><font style="vertical-align: inherit;">添加</font></font> <code>--prerelease</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参数。</font></font>

source: In <code>cut -d ' ' -f1</code>, <code>-d ' '</code> sets "space" as the delimiter, <code>-f1</code> means to get the first column.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font> <code>cut -d ' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>-d ' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> establece "espacio" como delimitador, </font></font> <code>-f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> significa obtener la primera columna.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font> <code>cut -d ' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>-d ' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">区切り文字としてセット「空間」、</font></font> <code>-f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">手段は、第1の列を取得します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에서 </font></font> <code>cut -d ' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>-d ' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 구분 기호로 세트 "공간", </font></font> <code>-f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수단은 첫 번째 열을 얻을 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>cut -d ' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>-d ' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> устанавливает &laquo;пробел&raquo; в качестве разделителя, </font></font> <code>-f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> означает получить первый столбец.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font> <code>cut -d ' ' -f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>-d ' '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将&ldquo; space&rdquo;设置为定界符，</font></font> <code>-f1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">表示获取第一列。</font></font>

source: In older version of <code>pip</code>, you can use this instead:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En la versi&oacute;n anterior de </font></font> <code>pip</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede usar esto en su lugar:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">古いバージョンの</font></font> <code>pip</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">では、代わりにこれを使用できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이전 버전의 </font></font> <code>pip</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서는 다음을 대신 사용할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В более старой версии </font></font> <code>pip</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вы можете использовать это вместо:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在旧版本的</font></font> <code>pip</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，您可以改用以下命令：</font></font>

source: In the awk command, <code>NR&gt;2</code> skips the first two records (lines) and <code>{print $1}</code> selects the first word of each line (as suggested by SergioAraujo, I removed <code>tail -n +3</code> since <code>awk</code> can indeed handle skipping records).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el comando awk, </font></font> <code>NR&gt;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> omite los dos primeros registros (l&iacute;neas) y </font></font> <code>{print $1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> selecciona la primera palabra de cada l&iacute;nea (como lo sugiri&oacute; SergioAraujo, elimin&eacute; la </font></font> <code>tail -n +3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ya que </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede manejar saltos de registros).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">awkコマンドでは、</font></font> <code>NR&gt;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は最初の2つのレコード（行）をスキップし、</font></font> <code>{print $1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は各行の最初の単語を選択します（SergioAraujoによって提案されたように、</font> <code>awk</code> <font style="vertical-align: inherit;">は実際にレコードのスキップを処理できる</font><font style="vertical-align: inherit;">ため、</font></font> <code>tail -n +3</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を削除</font><font style="vertical-align: inherit;">しました）。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">awk 명령에서 </font></font> <code>NR&gt;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 처음 두 레코드 (행)를 건너 뛰고 </font></font> <code>{print $1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 각 행의 첫 번째 단어를 선택합니다 (SergioAraujo가 제안한 것처럼 </font> <code>awk</code> <font style="vertical-align: inherit;"> 는 실제로 레코드 건너 뛰기를 처리 할 수 </font><font style="vertical-align: inherit;">있으므로 </font></font> <code>tail -n +3</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 제거했습니다 </font><font style="vertical-align: inherit;">).</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В команде awk </font></font> <code>NR&gt;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пропускает первые две записи (строки), а </font></font> <code>{print $1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> выбирает первое слово каждой строки (как предложил SergioAraujo, я удалил </font></font> <code>tail -n +3</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поскольку </font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> действительно может обрабатывать пропуски записей).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在awk命令中，</font></font> <code>NR&gt;2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">跳过前两个记录（行），并且</font></font> <code>{print $1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">选择每行的第一个单词（如SergioAraujo所建议，我删除了</font></font> <code>tail -n +3</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为</font></font> <code>awk</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确实可以处理跳过的记录）。</font></font>
