Repository: rueisnom/feedback
Catalog: xlf/52/23/5223.*.001.xlf
Languages: es, ja, ko, ru

source: <code>Object.keys</code> or <code>Object.getOwnPropertyNames</code> does not work for symbolic properties. To return them you need to use <code>Object.getOwnPropertySymbols</code>.
es: <code>Object.keys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>Object.getOwnPropertyNames</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no funciona para propiedades simb&oacute;licas. </font><font style="vertical-align: inherit;">Para devolverlos, debe usar </font></font> <code>Object.getOwnPropertySymbols</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <code>Object.keys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>Object.getOwnPropertyNames</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、シンボリックプロパティに対しては機能しません。</font><font style="vertical-align: inherit;">それらを返すには、</font></font> <code>Object.getOwnPropertySymbols</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <code>Object.keys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>Object.getOwnPropertyNames</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 작동하지 않습니다. </font><font style="vertical-align: inherit;">그것들을 반환하려면 </font></font> <code>Object.getOwnPropertySymbols</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용해야 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <code>Object.keys</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>Object.getOwnPropertyNames</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не работают для символических свойств. </font><font style="vertical-align: inherit;">Чтобы вернуть их вам нужно использовать </font></font> <code>Object.getOwnPropertySymbols</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: <strong>Edit</strong>: Objects can have symbolic properties which can not be returned via Object.key method. So the answer would be incomplete without mentioning them.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Editar</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : los objetos pueden tener propiedades simb&oacute;licas que no se pueden devolver a trav&eacute;s del m&eacute;todo Object.key. </font><font style="vertical-align: inherit;">Entonces la respuesta ser&iacute;a incompleta sin mencionarlos.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：オブジェクトには、Object.keyメソッドを介して返すことができないシンボリックプロパティを含めることができます。</font><font style="vertical-align: inherit;">したがって、答えはそれらに言及せずに不完全になります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 객체에는 Object.key 메서드를 통해 반환 할 수없는 기호 속성이있을 수 있습니다. </font><font style="vertical-align: inherit;">따라서 대답은 언급하지 않고 불완전합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Редактировать</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : Объекты могут иметь символические свойства, которые не могут быть возвращены с помощью метода Object.key. </font><font style="vertical-align: inherit;">Так что ответ будет неполным без упоминания о них.</font></font>

source: <strong>Here's an update as of 2016 and <a href="http://kangax.github.io/compat-table/es5/">widespread deployment of ES5</a> and beyond.</strong> For IE9+ and all other modern ES5+ capable browsers, you can use <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><code>Object.keys()</code></a> so the above code just becomes:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay una actualizaci&oacute;n a partir de 2016 y </font></font><a href="http://kangax.github.io/compat-table/es5/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una implementaci&oacute;n generalizada de ES5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y m&aacute;s all&aacute;. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Para IE9 + y todos los dem&aacute;s navegadores modernos compatibles con ES5 +, puede usar </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"> <code>Object.keys()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para que el c&oacute;digo anterior se convierta en:</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2016年現在のアップデート</font></font><a href="http://kangax.github.io/compat-table/es5/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">とES5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以降の</font><font style="vertical-align: inherit;">広範な展開</font><font style="vertical-align: inherit;">を以下に示します。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> IE9 +およびその他すべての最新のES5 +対応ブラウザーでは、</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"> <code>Object.keys()</code> を</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用できる</font><font style="vertical-align: inherit;">ため、上記のコードは次のようになります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음은 2016 년 현재의 업데이트와 </font></font><a href="http://kangax.github.io/compat-table/es5/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이상의 </font><font style="vertical-align: inherit;">광범위한 배포입니다</font><font style="vertical-align: inherit;"> . </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> IE9 + 및 기타 모든 최신 ES5 + 가능 브라우저의 경우 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"> <code>Object.keys()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 </font><font style="vertical-align: inherit;">있으므로 위 코드는 다음과 같습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот обновление от 2016 года и </font></font><a href="http://kangax.github.io/compat-table/es5/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">повсеместное развертывание ES5</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и выше. </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Для IE9 + и всех других современных браузеров с поддержкой ES5 + вы можете использовать </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"> <code>Object.keys()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поэтому приведенный выше код просто становится:</font></font>

source: <strong>If not</strong>, and you don't want to mess around with Object properties for whatever reason, and are already using jQuery, a plugin is equally accessible:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si no es as&iacute;</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y no desea perder el tiempo con las propiedades de Object por cualquier raz&oacute;n, y ya est&aacute; utilizando jQuery, un complemento es igualmente accesible:</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そうでない場合</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、何らかの理由でObjectプロパティをいじりたくはなく、すでにjQueryを使用している場合は、プラグインにも同様にアクセスできます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그렇지 않고</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 어떤 이유로 든 Object 속성을 엉망으로 만들고 싶지 않고 이미 jQuery를 사용하고 있다면 플러그인에 액세스 할 수 있습니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если нет</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и вы не хотите возиться со свойствами объекта по какой-либо причине и уже используете jQuery, плагин одинаково доступен:</font></font>

source: <strong>Updated</strong>: If you're using <a href="http://underscorejs.org/#size">Underscore.js</a> (recommended, it's lightweight!), then you can just do
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizado</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : si est&aacute; utilizando </font></font><a href="http://underscorejs.org/#size"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (&iexcl;recomendado, es liviano!), Entonces simplemente puede hacer</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更新</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font><a href="http://underscorejs.org/#size"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用している場合</font><font style="vertical-align: inherit;">（推奨、軽量です！）</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">업데이트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><a href="http://underscorejs.org/#size"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하는 경우 </font><font style="vertical-align: inherit;">(권장, 경량입니다!)</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновлено</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : если вы используете </font></font><a href="http://underscorejs.org/#size"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Underscore.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (рекомендуется, он легкий!), То вы можете просто сделать</font></font>

source: @palmsey: In fairness to the OP, the JavaScript documentation actually explicitly refer to using variables of type Object in this manner as "associative arrays".
es: @palmsey:Para ser justos con el OP,la documentación de JavaScript en realidad se refiere explícitamente al uso de variables de tipo Objeto de esta manera como "matrices asociativas".
ja: @palmsey:公平に考えれば、JavaScript のドキュメントでは、Object 型の変数をこのような方法で使用することを "連想配列" と明示的に説明しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@palmsey : OP와 공평하게 JavaScript 문서는 실제로 이런 방식으로 Object 유형의 변수를 "연관 배열"이라고 명시 적으로 언급합니다.</font></font>
ru: @palmsey:Справедливости ради ОП,документация JavaScript фактически явно ссылается на использование переменных типа Object таким образом,как "ассоциативные массивы".

source: @palmsey: In fairness to the OP, the javascript docs actually explicitly refer to using variables of type Object in this manner as "associative arrays".
es: @palmsey:Para ser justos con el OP,los documentos de javascript en realidad se refieren explícitamente al uso de variables de tipo Objeto de esta manera como "matrices asociativas".
ja: @palmsey:公平に考えれば、javascriptのドキュメントではObject型の変数をこのような方法で使うことを「連想配列」として明示的に言及しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@palmsey : OP와 공평하게 자바 스크립트 문서는 실제로 이러한 방식으로 Object 유형의 변수를 "연관 배열"로 사용하는 것을 명시 적으로 참조합니다.</font></font>
ru: @palmsey:В соответствии с ОП,документация javascript фактически явно ссылается на использование переменных типа Object таким образом,как "ассоциативные массивы".

source: A bit late to the game, but a nice way to achieve this (IE9+ only) is to define a magic getter on the length property:
es: Un poco tarde para el juego,pero una buena manera de lograrlo (sólo para IE9+)es definir un receptor mágico en la propiedad de longitud:
ja: 少し遅れてしまいましたが、(IE9+のみ)これを実現する良い方法は、lengthプロパティにマジックゲッターを定義することです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">게임에 약간 늦었지만 이것을 달성하는 좋은 방법 (IE9 + 만 해당)은 length 속성에 매직 게터를 정의하는 것입니다.</font></font>
ru: Немного поздновато для игры,но хороший способ достичь этого (только IE9+)-определить волшебный геттер на свойстве длины:

source: A variation on some of the above is:
es: Una variación de algunas de las anteriores es:
ja: 上記のいくつかのバリエーションは
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 일부 변형은 다음과 같습니다.</font></font>
ru: Вариация на некоторые из вышеперечисленных вариантов:

source: And in fairness to @palmsey he was quite correct, they aren't associative arrays, they're definitely objects :) - doing the job of an associative array. But as regards the wider point you definitely seem to have the right of it according to this rather fine article I found:
es: Y para ser justos con @palmsey estaba en lo cierto,no son conjuntos asociativos,son definitivamente objetos :)-haciendo el trabajo de un conjunto asociativo.Pero en lo que respecta al punto más amplio,parece que tienes derecho a ello,según este buen artículo que encontré:
ja: 公平に見て @palmsey の言う通り、連想配列ではありません。)-が連想配列の仕事をしているのは間違いありません。しかし、より広い意味では、私が見つけたこの素晴らしい記事によると、あなたの言うことは間違いなく正しいようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 @palmsey에 공평하게 그는 꽤 정확했습니다. 연관 배열이 아니며 분명히 객체입니다 :)-연관 배열의 작업을 수행합니다. </font><font style="vertical-align: inherit;">그러나 더 넓은 점에 관해서는 내가 찾은이 훌륭한 기사에 따라 분명히 그 권리를 갖는 것처럼 보입니다.</font></font>
ru: И справедливости ради @palmsey он был вполне прав,это не ассоциативные массивы,это определенно объекты :)-выполняющий работу ассоциативного массива.Но что касается более широкой точки зрения,то,похоже,вы определенно имеете на нее право,согласно этой довольно хорошей статье,которую я нашел:

source: And you can just use it like so:
es: Y puedes usarlo así:
ja: って感じで使えばいいんだよ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 당신은 그렇게 사용할 수 있습니다 :</font></font>
ru: И ты можешь просто использовать его так:

source: Below is a version of James Coglan's answer in CoffeeScript for those who have abandoned straight JavaScript :)
es: Abajo hay una versión de la respuesta de James Coglan en CoffeeScript para los que han abandonado el Javascript recto :)
ja: 以下は、James Coglan氏の回答をCoffeeScriptにしたもので、ストレートJavaScriptを捨てた人のためのものです :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">아래는 JavaScript를 버린 사람들을위한 CoffeeScript의 James Coglan 답변입니다. :)</font></font>
ru: Ниже приведена версия ответа Джеймса Коглана в CoffeeScript для тех,кто отказался от прямого JavaScript :)

source: But according to all this, isn't the <a href="https://stackoverflow.com/questions/5223/length-of-javascript-associative-array#5234">accepted answer</a> itself bad practice?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero de acuerdo con todo esto, &iquest;no es la </font></font><a href="https://stackoverflow.com/questions/5223/length-of-javascript-associative-array#5234"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">respuesta aceptada</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una mala pr&aacute;ctica?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">しかし、これによると、</font></font><a href="https://stackoverflow.com/questions/5223/length-of-javascript-associative-array#5234"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">受け入れられた答え</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">自体は悪い習慣</font><font style="vertical-align: inherit;">ではない</font><font style="vertical-align: inherit;">でしょうか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나이 모든 것에 따르면, </font></font><a href="https://stackoverflow.com/questions/5223/length-of-javascript-associative-array#5234"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">받아 들인 대답</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 자체가 나쁜 습관이 아닌가?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Но в соответствии с этим, не является ли </font></font><a href="https://stackoverflow.com/questions/5223/length-of-javascript-associative-array#5234"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">принятый ответ</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> самой плохой практикой?</font></font>

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент

source: For some cases it is better to just store the size in a separate variable. Especially, if you're adding to the array by one element in one place and can easily increment the size. It would obviously work much faster if you need to check the size often.
es: En algunos casos es mejor guardar el tamaño en una variable separada.Especialmente,si estás añadiendo a la matriz un elemento en un lugar y puedes incrementar fácilmente el tamaño.Obviamente funcionaría mucho más rápido si necesitas comprobar el tamaño a menudo.
ja: 場合によっては、サイズを別の変数に格納するだけの方が良い場合もあります。特に、1つの要素を1箇所にまとめて配列に追加していて、サイズを簡単にインクリメントできるような場合です。頻繁にサイズを確認する必要がある場合は、その方が明らかに速く動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">경우에 따라 크기를 별도의 변수에 저장하는 것이 좋습니다. </font><font style="vertical-align: inherit;">특히 한 곳에서 한 요소 씩 배열에 추가하고 쉽게 크기를 늘릴 수있는 경우. </font><font style="vertical-align: inherit;">크기를 자주 확인 해야하는 경우 훨씬 빨리 작동합니다.</font></font>
ru: В некоторых случаях лучше просто хранить размер в отдельной переменной.Особенно,если вы добавляете в массив по одному элементу в одном месте и можете легко увеличить размер.Очевидно,что это будет работать намного быстрее,если нужно часто проверять размер.

source: Get the <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/length"><strong><code>.length</code></strong></a> property of that array.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Obtenga la </font><font style="vertical-align: inherit;">propiedad </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/length"><strong> <code>.length</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de esa matriz.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">その配列の</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/length"><strong> <code>.length</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティを</font><font style="vertical-align: inherit;">取得し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해당 배열 </font><font style="vertical-align: inherit;">의 </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/length"><strong> <code>.length</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 가져옵니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Получите </font><font style="vertical-align: inherit;">свойство </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/length"><strong> <code>.length</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> этого массива.</font></font>

source: Here is a completely different solution that will only work in more modern browsers (IE9+, Chrome, Firefox 4+, Opera 11.60+, Safari 5.1+)
es: He aquí una solución completamente diferente que sólo funcionará en los navegadores más modernos (IE9+,Chrome,Firefox 4+,Opera 11.60+,Safari 5.1+)
ja: ここでは、最新のブラウザ(IE9+,Chrome,Firefox 4+,Opera 11.60+,Safari 5.1+)でのみ動作する全く異なるソリューションをご紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">최신 브라우저 (IE9 +, Chrome, Firefox 4+, Opera 11.60+, Safari 5.1+)에서만 작동하는 완전히 다른 솔루션입니다.</font></font>
ru: Вот совершенно другое решение,которое будет работать только в более современных браузерах (IE9+,Chrome,Firefox 4+,Opera 11.60+,Safari 5.1+).

source: Here's a different version of James Cogan's answer. Instead of passing an argument, just prototype out the Object class and make the code cleaner.
es: Aquí hay una versión diferente de la respuesta de James Cogan.En lugar de pasar un argumento,sólo prototipo de la clase de objeto y hacer el código más limpio.
ja: ここに、James Cogan氏の回答の別バージョンがあります。引数を渡すのではなく、Objectクラスをプロトタイプ化してコードをすっきりさせましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">James Cogan의 답변에 대한 다른 버전이 있습니다. </font><font style="vertical-align: inherit;">인수를 전달하는 대신 Object 클래스를 프로토 타입 화하고 코드를 더 깨끗하게 만듭니다.</font></font>
ru: Вот другая версия ответа Джеймса Когана.Вместо того,чтобы передавать аргумент,просто прототипируйте класс Object и сделайте код чище.

source: Here's how and don't forget to check that the property is not on the prototype chain:
es: Aquí está cómo y no te olvides de comprobar que la propiedad no está en la cadena del prototipo:
ja: ここではその方法と、プロパティがプロトタイプチェーン上にないことを確認することを忘れないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성이 프로토 타입 체인에 없는지 확인하는 방법과 잊지 말아야합니다.</font></font>
ru: Вот как и не забудьте проверить,что это свойство не находится в цепочке прототипов:

source: Here's the most cross-browser solution.
es: Aquí está la solución más cruzada de los navegadores.
ja: 最もクロスブラウザ向けのソリューションはここにあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 다양한 브라우저 솔루션이 있습니다.</font></font>
ru: Вот самое кросс-браузерное решение.
