Repository: rueisnom/feedback
Catalog: xlf/52/23/5223.*.001.xlf
Languages: es, ja, ko, ru

source: How to use this particular function:
es: Cómo utilizar esta función en particular:
ja: この特定の機能をどのように使用するか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 특정 기능을 사용하는 방법 :</font></font>
ru: Как использовать эту конкретную функцию:

source: I don't think that answer should be the accepted one as it can't be trusted to work if you have any other code running in the same execution context. To do it in a robust fashion surely you would need to define the size method within myArray and check for the type of the members as you iterate through them.
es: No creo que esa respuesta deba ser la aceptada,ya que no se puede confiar en que funcione si tienes otro código ejecutándose en el mismo contexto de ejecución.Para hacerlo de una manera robusta seguramente necesitarías definir el método de tamaño dentro de myArray y comprobar el tipo de los miembros mientras iteras a través de ellos.
ja: 同じ実行コンテキストで他のコードが実行されている場合、動作を信頼できないので、その答えは受け入れられるべきものではないと思います。堅牢な方法でそれを行うためには、確かにあなたはmyArrayの中でsizeメソッドを定義し、それらを反復しながらメンバーの型をチェックする必要があるでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한 실행 컨텍스트에서 다른 코드를 실행하는 경우 작동하도록 신뢰할 수 없으므로 응답이 허용되는 것으로 생각하지 않습니다. </font><font style="vertical-align: inherit;">확실하게 견고하게하려면 myArray 내에서 size 메소드를 정의하고 반복 할 때 멤버의 유형을 확인해야합니다.</font></font>
ru: Я не думаю,что этот ответ должен быть принятым,так как нельзя доверять его работе,если у вас есть другой код,запущенный в том же контексте выполнения.Чтобы сделать это в надежном режиме,вам,несомненно,нужно будет определить метод размера в myArray и проверить тип членов при итерации через них.

source: I have a JavaScript object, is there a built-in or accepted best practice way to get the length of this object?
es: Tengo un objeto de JavaScript,¿hay una forma incorporada o aceptada de mejor práctica para obtener la longitud de este objeto?
ja: 私はJavaScriptのオブジェクトを持っていますが、このオブジェクトの長さを取得するための組み込みの方法、または受け入れられているベストプラクティスの方法はありますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript 객체가 있습니다.이 객체의 길이를 가져 오는 기본 제공 방법이 있습니까?</font></font>
ru: У меня есть объект JavaScript,есть ли встроенный или общепринятый лучший способ получить длину этого объекта?

source: I'm not a JavaScript expert, but it looks like you would have to loop through the elements and count them since Object doesn't have a length method:
es: No soy experto en JavaScript,pero parece que tendrías que hacer un bucle a través de los elementos y contarlos ya que el objeto no tiene un método de longitud:
ja: JavaScriptの専門家ではないのですが、Objectにはlengthメソッドがないので、要素をループさせて数える必要がありそうですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">저는 JavaScript 전문가는 아니지만 Object에는 길이 메서드가 없으므로 요소를 반복하고 계산 해야하는 것처럼 보입니다.</font></font>
ru: Я не JavaScript-эксперт,но похоже,что вам придется пройтись по элементам и посчитать их,так как у Object нет метода длины:

source: If anything else has been added to Object .prototype, then the suggested code will fail:
es: Si se ha añadido algo más al objeto .prototipo,entonces el código sugerido fallará:
ja: Object .prototypeに他の何かが追加されている場合、提案されたコードは失敗します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Object .prototype에 추가 된 것이 있으면 제안 된 코드가 실패합니다.</font></font>
ru: Если в Object .prototype было добавлено что-нибудь еще,то предложенный код будет неудачным:

source: If we have the hash
es: Si tenemos el hachís
ja: ハッシュがあれば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시가 있다면</font></font>
ru: Если у нас есть гашиш

source: If you always use the add method, the length property will be correct. If you're worried that you or others forget about using it, you could add the property counter which the others have posted to the length method, too.
es: Si siempre usas el método de sumar,la propiedad de la longitud será correcta.Si te preocupa que tú u otros se olviden de usarlo,podrías añadir el contador de la propiedad que los otros han puesto en el método de la longitud,también.
ja: いつもaddメソッドを使っていれば、lengthプロパティは正しい値になります。自分や他の人が使うのを忘れてしまうのが心配な場合は、他の人が投稿したプロパティカウンターもlengthメソッドに追加してみてはいかがでしょうか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상 add 메소드를 사용하면 length 특성이 올바른 것입니다. </font><font style="vertical-align: inherit;">본인이나 다른 사람이 사용을 잊어 버릴 염려가 있으면 다른 사람이 길이 방법에 게시 한 속성 카운터를 추가 할 수도 있습니다.</font></font>
ru: Если вы всегда используете метод добавления,свойство длины будет корректным.Если вы беспокоитесь,что вы или другие забыли о его использовании,вы можете добавить в метод length счетчик свойств,который другие добавили.

source: If you are using <a href="http://en.wikipedia.org/wiki/AngularJS">AngularJS</a> 1.x you can do things the AngularJS way by creating a filter and using the code from any of the other examples such as the following:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; utilizando </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1.x, puede hacer las cosas a la manera de AngularJS creando un filtro y utilizando el c&oacute;digo de cualquiera de los otros ejemplos, como los siguientes:</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1.xを</font><font style="vertical-align: inherit;">使用している場合は</font><font style="vertical-align: inherit;">、AngularJSの方法でフィルターを作成し、次のような他の例のコードを使用することができます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신이 사용하는 경우 </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS와를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 필터를 생성하며 다음과 같은 다른 예제의에서 코드를 사용하여 사물에게 AngularJS와 방법을 할 수 1.X :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы используете </font></font><a href="http://en.wikipedia.org/wiki/AngularJS"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">AngularJS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1.x, вы можете делать вещи AngularJS путем создания фильтра и использования кода из любого другого примера, такого как следующее:</font></font>

source: If you don't care about supporting Internet Explorer 8 or lower, you can easily get the number of properties in an object by applying the following two steps:
es: Si no te preocupa el soporte de Internet Explorer 8 o inferior,puedes obtener fácilmente el número de propiedades de un objeto aplicando los dos pasos siguientes:
ja: Internet Explorer 8以下のサポートを気にしないのであれば、以下の2つの手順を適用することで、オブジェクト内のプロパティの数を簡単に取得することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer 8 이하를 지원하지 않아도되는 경우 다음 두 단계를 적용하여 개체의 속성 수를 쉽게 얻을 수 있습니다.</font></font>
ru: Если вас не волнует поддержка Internet Explorer 8 или ниже,вы можете легко получить количество свойств в объекте,применив следующие два шага:

source: If you know you don't have to worry about <code>hasOwnProperty</code> checks, you can do this very simply:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si sabe que no tiene que preocuparse por </font></font> <code>hasOwnProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> comprobaciones de </font><font style="vertical-align: inherit;">hasOwnProperty</font><font style="vertical-align: inherit;"> , puede hacerlo de manera muy simple:</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>hasOwnProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">チェック</font><font style="vertical-align: inherit;">について心配する必要がないことがわかっている場合は</font><font style="vertical-align: inherit;">、これを非常に簡単に行うことができます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>hasOwnProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 검사 </font><font style="vertical-align: inherit;">에 대해 걱정할 필요가 없다는 것을 알고 있다면 </font><font style="vertical-align: inherit;">매우 간단하게 수행 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы знаете, что вам не нужно беспокоиться о </font><font style="vertical-align: inherit;">проверках </font></font> <code>hasOwnProperty</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , вы можете сделать это очень просто:</font></font>

source: If you need an associative data structure that exposes its size, better use a map instead of an object.
es: Si necesita una estructura de datos asociativa que exponga su tamaño,mejor use un mapa en lugar de un objeto.
ja: サイズを公開する連想データ構造が必要な場合は、オブジェクトではなくマップを使用した方が良いでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">크기를 표시하는 연관 데이터 구조가 필요한 경우 오브젝트 대신 맵을 사용하는 것이 좋습니다.</font></font>
ru: Если вам нужна ассоциативная структура данных,раскрывающая ее размер,лучше использовать карту вместо объекта.

source: If you need to do this more than once, you could wrap this logic in a function:
es: Si necesitas hacer esto más de una vez,podrías envolver esta lógica en una función:
ja: これを複数回行う必要がある場合は、このロジックを関数でラップすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 두 번 이상 수행해야하는 경우이 논리를 함수로 래핑 할 수 있습니다.</font></font>
ru: Если вам нужно сделать это несколько раз,вы можете обернуть эту логику в функцию:

source: In your controller:
es: En su controlador:
ja: あなたのコントローラーで
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컨트롤러에서 :</font></font>
ru: В вашем контроллере:

source: It is a bit more elegant way to integrate hasOwnProp.
es: Es una forma un poco más elegante de integrar a HasOwnProp.
ja: hasOwnPropを統合するのはもう少しエレガントな方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">hasOwnProp을 통합하는 조금 더 우아한 방법입니다.</font></font>
ru: Это немного более элегантный способ интеграции hasOwnProp.

source: JavaScript &ldquo;Associative Arrays&rdquo; Considered Harmful
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript "Matrices asociativas" considerado perjudicial</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有害と見なされるJavaScriptの「連想配列」</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">유해한 것으로 간주되는 JavaScript "연관 배열"</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript &laquo;Ассоциативные массивы&raquo; считается вредным</font></font>

source: Length of a JavaScript object
es: La longitud de un objeto de JavaScript
ja: JavaScript オブジェクトの長さ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트 객체의 길이</font></font>
ru: Длина объекта JavaScript

source: Now you can use this code as follows...
es: Ahora puedes usar este código de la siguiente manera...
ja: これで次のようなコードが使えるようになりました...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제이 코드를 다음과 같이 사용할 수 있습니다.</font></font>
ru: Теперь вы можете использовать этот код следующим образом...

source: Of course, you could always overwrite the methods. But even if you do, your code would probably fail noticeably, making it easy to debug. ;)
es: Por supuesto,siempre se pueden sobrescribir los métodos.Pero incluso si lo haces,tu código probablemente fallaría notablemente,facilitando la depuración.;)
ja: もちろん、いつでもメソッドを上書きすることができます。しかし、そうしたとしても、おそらくあなたのコードは目立って失敗するでしょうから、デバッグが簡単になります。)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">물론 항상 메서드를 덮어 쓸 수 있습니다. </font><font style="vertical-align: inherit;">그러나 그렇게해도 코드가 눈에 띄게 실패하여 쉽게 디버깅 할 수 있습니다. </font><font style="vertical-align: inherit;">;)</font></font>
ru: Конечно,ты всегда можешь переписать методы.Но даже если вы это сделаете,ваш код,скорее всего,заметно провалится,что облегчит его отладку;).

source: Or in your view:
es: O en tu opinión:
ja: あるいは、あなたの視界の中で。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 당신의 관점에서 :</font></font>
ru: Или на ваш взгляд:

source: Run either <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><strong><code>Object.keys()</code></strong></a> to get an array that contains the names of only those properties that are <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Enumerability_and_ownership_of_properties"><strong>enumerable</strong></a> or <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyNames"><strong><code>Object.getOwnPropertyNames()</code></strong></a> if you want to also include the names of properties that are not enumerable.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejecute </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><strong> <code>Object.keys()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener una matriz que contenga los nombres de solo aquellas propiedades </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Enumerability_and_ownership_of_properties"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">enumerables</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyNames"><strong> <code>Object.getOwnPropertyNames()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si desea incluir tambi&eacute;n los nombres de propiedades que no son enumerables.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><strong> <code>Object.keys()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">実行</font><font style="vertical-align: inherit;">して、</font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Enumerability_and_ownership_of_properties"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">列挙可能な</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プロパティのみの名前を含む配列を取得する</font><font style="vertical-align: inherit;">か</font><font style="vertical-align: inherit;">、列挙できないプロパティの名前も含める場合は</font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyNames"><strong> <code>Object.getOwnPropertyNames()</code> を</strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実行します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실행 중 </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><strong> <code>Object.keys()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 만 해당 속성의 이름을 포함하는 배열을 얻을 </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Enumerability_and_ownership_of_properties"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">열거</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 나 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyNames"><strong> <code>Object.getOwnPropertyNames()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 원하는 경우 열거 할 수 없습니다 속성의 이름도 포함 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Запустите </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Object/keys"><strong> <code>Object.keys()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить массив, содержащий имена только тех свойств, которые являются </font></font><a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Enumerability_and_ownership_of_properties"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">перечисляемыми,</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyNames"><strong> <code>Object.getOwnPropertyNames()</code> </strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы также хотите включить имена свойств, которые не перечислимы.</font></font>

source: See <a href="http://jsfiddle.net/QHDt7/">jsFiddle</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ver </font></font><a href="http://jsfiddle.net/QHDt7/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>
ja: <font style="vertical-align: inherit;"><a href="http://jsfiddle.net/QHDt7/"><font style="vertical-align: inherit;">jsFiddleを</font></a><font style="vertical-align: inherit;">参照してください</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><a href="http://jsfiddle.net/QHDt7/"><font style="vertical-align: inherit;">jsFiddle</font></a><font style="vertical-align: inherit;"> 참조</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите </font></font><a href="http://jsfiddle.net/QHDt7/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a>

source: See also <a href="https://jsfiddle.net/0x11tv73/5/"><strong>this Fiddle</strong></a> for a demo.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Vea tambi&eacute;n </font></font><a href="https://jsfiddle.net/0x11tv73/5/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este viol&iacute;n</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para una demostraci&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デモについては、</font></font><a href="https://jsfiddle.net/0x11tv73/5/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">このフィドル</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">も参照してください</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데모 </font><font style="vertical-align: inherit;">는 </font></font><a href="https://jsfiddle.net/0x11tv73/5/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 바이올린</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">참조하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите также </font></font><a href="https://jsfiddle.net/0x11tv73/5/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту скрипку</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для демонстрации.</font></font>

source: Setup your Associative Array class
es: Configure su clase de Array Asociativo...
ja: 連想配列クラスの設定
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">연관 배열 클래스 설정</font></font>
ru: Настройте класс ассоциативного массива

source: Simply use this to get the <code>length</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simplemente use esto para obtener la </font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを使用して</font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を取得する</font><font style="vertical-align: inherit;">だけ</font><font style="vertical-align: inherit;">です：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단히 이것을 사용하여 </font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 얻으십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто используйте это, чтобы получить </font></font> <code>length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Specify a prototype size() function for Object
es: Especificar una función de tamaño de prototipo()para el Objeto
ja: Object のプロトタイプ size()関数を指定します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Object에 대한 프로토 타입 크기 () 함수를 지정하십시오.</font></font>
ru: Укажите функцию prototype size()для Object

source: Symbol type was added to the language to create unique identifiers for object properties. Main benefit of Symbol type is prevention of overwrites.
es: El tipo de símbolo se añadió al lenguaje para crear identificadores únicos para las propiedades de los objetos.El principal beneficio de Symbol type es la prevención de sobrescritura.
ja: シンボル型は、オブジェクトのプロパティにユニークな識別子を作成するために言語に追加されました。シンボル型の主な利点は、上書きを防ぐことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 속성에 대한 고유 식별자를 만들기 위해 언어에 심볼 유형이 추가되었습니다. </font><font style="vertical-align: inherit;">Symbol 유형의 주요 이점은 덮어 쓰기 방지입니다.</font></font>
ru: В язык добавлен тип символа для создания уникальных идентификаторов свойств объектов.Основным преимуществом символьного типа является предотвращение перезаписей.

source: The most robust answer (i.e. that captures the intent of what you're trying to do while causing the fewest bugs) would be:
es: La respuesta más robusta (es decir,que capta la intención de lo que se intenta hacer mientras se causan menos bichos)sería:
ja: 最もロバストな答え(つまり、バグを最小限に抑えつつ、やろうとしていることの意図を汲み取ることができるもの)は、このような答えになるでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 강력한 답변 (즉, 버그를 최소화하면서 시도하려는 의도를 포착하는)은 다음과 같습니다.</font></font>
ru: Самым надежным ответом (т.е.улавливающим намерения того,что вы пытаетесь сделать,и в то же время вызывающим малейшие ошибки)был бы ответ:
