Repository: rueisnom/feedback
Catalog: xlf/52/23/5223.*.001.xlf
Languages: es, ja, ko, ru

source: The simplest way is like this
es: La forma más simple es así
ja: 一番シンプルな方法はこんな感じです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">가장 간단한 방법은 다음과 같습니다</font></font>
ru: Самый простой способ

source: There's a sort of convention in JavaScript that you <a href="https://stackoverflow.com/questions/10757455/object-prototype-is-verboten">don't add things to Object.prototype</a>, because it can break enumerations in various libraries. Adding methods to Object is usually safe, though.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay una especie de convenci&oacute;n en JavaScript que </font></font><a href="https://stackoverflow.com/questions/10757455/object-prototype-is-verboten"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no agrega cosas al Object.prototype</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , porque puede romper las enumeraciones en varias bibliotecas. </font><font style="vertical-align: inherit;">Sin embargo, agregar m&eacute;todos a Object generalmente es seguro.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScriptに</font><font style="vertical-align: inherit;">は、さまざまなライブラリの列挙を破壊する可能性があるため</font></font><a href="https://stackoverflow.com/questions/10757455/object-prototype-is-verboten"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、Object.prototypeに何も追加しない</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という規則があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">ただし、Objectにメソッドを追加することは、通常は安全です。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript </font></font><a href="https://stackoverflow.com/questions/10757455/object-prototype-is-verboten"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에는 Object.prototype에 항목을 추가하지 않는</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일종의 규칙 </font><font style="vertical-align: inherit;">이 있습니다. 다양한 라이브러리에서 열거를 깨뜨릴 수 있기 때문입니다. </font><font style="vertical-align: inherit;">그러나 Object에 메소드를 추가하는 것이 일반적으로 안전합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В JavaScript есть своего рода соглашение, что вы </font></font><a href="https://stackoverflow.com/questions/10757455/object-prototype-is-verboten"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не добавляете вещи в Object.prototype</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , потому что он может нарушать перечисления в различных библиотеках. </font><font style="vertical-align: inherit;">Однако добавление методов в Object обычно безопасно.</font></font>

source: This doesn't have to modify any existing prototype since <code>Object.keys()</code> is now built in.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto no tiene que modificar ning&uacute;n prototipo existente ya que </font></font> <code>Object.keys()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ahora est&aacute; integrado.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Object.keys()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が組み込まれ</font><font style="vertical-align: inherit;">ているため、既存のプロトタイプを変更する必要はありません</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Object.keys()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 내장되어 </font><font style="vertical-align: inherit;">있으므로 기존 프로토 타입을 수정할 필요가 없습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это не должно изменять любой существующий прототип, так как </font></font> <code>Object.keys()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> теперь встроен.</font></font>

source: This is better than the accepted answer because it uses native Object.keys if exists. Thus, it is the fastest for all modern browsers.
es: Esto es mejor que la respuesta aceptada porque usa claves de objetos nativos si existen.Por lo tanto,es la más rápida para todos los navegadores modernos.
ja: これは、もし存在すればネイティブのObject.keyを使用するので、受け入れられている答えよりも優れています。したがって、これはすべての最新のブラウザでは最速です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">존재하는 경우 기본 Object.keys를 사용하기 때문에 허용되는 답변보다 낫습니다. </font><font style="vertical-align: inherit;">따라서 모든 최신 브라우저에서 가장 빠릅니다.</font></font>
ru: Это лучше,чем принятый ответ,потому что в нем используются родные ключи Object.key,если они существуют.Таким образом,он является самым быстрым для всех современных браузеров.

source: This method gets all your object's property names in an array, so you can get the length of that array which is equal to your object's keys' length.
es: Este método obtiene todos los nombres de las propiedades de tu objeto en una matriz,por lo que puedes obtener la longitud de esa matriz que es igual a la longitud de las claves de tu objeto.
ja: このメソッドは、オブジェクトのプロパティ名をすべて配列で取得するので、オブジェクトのキーの長さと同じ長さの配列を取得できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 메소드는 객체의 모든 속성 이름을 배열로 가져 오므로 객체의 키 길이와 같은 해당 어레이의 길이를 얻을 수 있습니다.</font></font>
ru: Этот метод получает все имена свойств вашего объекта в массиве,поэтому вы можете получить длину этого массива,равную длине ключей вашего объекта.

source: This works for me:
es: Esto funciona para mí:
ja: これは私には効き目があります。
ko: 이것은 나를 위해 작동합니다 :
ru: Это работает на меня:

source: To not mess with the prototype or other code, you could build and extend your own object:
es: Para no meterse con el prototipo u otro código,podrías construir y ampliar tu propio objeto:
ja: プロトタイプや他のコードをいじらないためには、自分でオブジェクトを作って拡張すればいい。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로토 타입이나 다른 코드를 엉망으로 만들지 않기 위해 자신 만의 객체를 만들고 확장 할 수 있습니다.</font></font>
ru: Чтобы не путать с прототипом или другим кодом,можно создавать и расширять собственный объект:

source: Use <code>Object.keys(myObject).length</code> to get the length of object/array
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>Object.keys(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener la longitud del objeto / matriz</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Object.keys(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用して</font><font style="vertical-align: inherit;">オブジェクト/配列の長さを取得します</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Object.keys(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 객체 / 배열의 길이를 얻습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используйте </font></font> <code>Object.keys(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить длину объекта / массива</font></font>

source: We can find the length of Object by using :
es: Podemos encontrar la longitud del objeto usando..:
ja: Objectの長さを求めるには、.NET を使用します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음을 사용하여 Object의 길이를 찾을 수 있습니다.</font></font>
ru: Мы можем найти длину объекта с помощью :

source: What about something like this --
es: ¿Qué tal algo como esto...
ja: こんな感じでどうでしょうか...
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이건 어때?</font></font>
ru: А как насчет чего-то вроде этого...

source: Would give <code>1</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dar&iacute;a </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>1</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">与え</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>1</code> 을<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 줄 것 </font><font style="vertical-align: inherit;">입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Дал бы </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: You can always do <code>Object.getOwnPropertyNames(myObject).length</code> to get the same result as <code>[].length</code> would give for normal array.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Siempre puede hacer </font></font> <code>Object.getOwnPropertyNames(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener el mismo resultado que </font></font> <code>[].length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dar&iacute;a para una matriz normal.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>Object.getOwnPropertyNames(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">いつでも実行して</font><font style="vertical-align: inherit;">、</font></font> <code>[].length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が通常の配列に与えるの</font><font style="vertical-align: inherit;">と同じ結果を得る</font><font style="vertical-align: inherit;">ことができ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">항상 </font></font> <code>Object.getOwnPropertyNames(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 수행하여 </font></font> <code>[].length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 일반 배열에 제공 </font><font style="vertical-align: inherit;">하는 것과 동일한 결과를 얻을 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы всегда можете сделать </font></font> <code>Object.getOwnPropertyNames(myObject).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы получить тот же результат, что и </font></font> <code>[].length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для обычного массива.</font></font>

source: You can simply use <code>Object.keys(obj).length</code> on any object to get its length. Object.keys returns an array containing all of the object <em>keys</em> (properties) which can come in handy for finding the length of that object using the length of the corresponding array. You can even write a <em>function</em> for this. Let's get <em>creative</em> and write a <strong>method</strong> for it as well (along with a more convienient getter property):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Simplemente puede usar </font></font> <code>Object.keys(obj).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en cualquier objeto para obtener su longitud. </font><font style="vertical-align: inherit;">Object.keys devuelve una matriz que contiene todas las </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">claves de</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> objeto </font><font style="vertical-align: inherit;">(propiedades) que pueden ser &uacute;tiles para encontrar la longitud de ese objeto usando la longitud de la matriz correspondiente. </font><font style="vertical-align: inherit;">Incluso puedes escribir una </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">funci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para esto. </font><font style="vertical-align: inherit;">Vamos a ser </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">creativos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y escribir un </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&eacute;todo</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ello tambi&eacute;n (junto con una propiedad getter m&aacute;s conveniente):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意のオブジェクトで</font></font> <code>Object.keys(obj).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">使用するだけで</font><font style="vertical-align: inherit;">、その長さを取得できます。</font><font style="vertical-align: inherit;">Object.keysは</font><font style="vertical-align: inherit;">、対応する配列の長さを使用してそのオブジェクトの長さを見つけるのに便利な</font><font style="vertical-align: inherit;">すべてのオブジェクト</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">キー</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（プロパティ）を</font><font style="vertical-align: inherit;">含む配列を返します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">このための</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">書くこともでき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">さんが取得してみましょう</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">創造</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と書き込み</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法を</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（もっとconvienientゲッタープロパティと一緒に）だけでなく、それのために：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 객체에서 </font></font> <code>Object.keys(obj).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 길이를 얻을 수 있습니다. </font><font style="vertical-align: inherit;">Object.keys는 해당 배열 </font><font style="vertical-align: inherit;">의 길이를 사용하여 해당 오브젝트의 길이를 찾는 데 유용한 </font><font style="vertical-align: inherit;">모든 오브젝트 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">키</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (속성)를 </font><font style="vertical-align: inherit;">포함하는 배열을 리턴합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이를 위해 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">함수</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성할 수도 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">보다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">독창적 인</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> getter 속성과 함께 </font><em><font style="vertical-align: inherit;">창의력을 발휘</font></em><font style="vertical-align: inherit;"> 하고 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메서드</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성해 </font><font style="vertical-align: inherit;">보겠습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете просто использовать </font></font> <code>Object.keys(obj).length</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на любом объекте, чтобы получить его длину. </font><font style="vertical-align: inherit;">Object.keys возвращает массив, содержащий все </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ключи</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта </font><font style="vertical-align: inherit;">(свойства), которые могут пригодиться для определения длины этого объекта по длине соответствующего массива. </font><font style="vertical-align: inherit;">Вы даже можете написать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">функцию</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для этого. </font><font style="vertical-align: inherit;">Давайте проявим </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">творческий подход</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и напишем </font><font style="vertical-align: inherit;">для него </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">метод</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (вместе с более удобным свойством getter):</font></font>

source: hash = {"a" : "b", "c": "d"};
ja: ハッシュ={"a":"b","c"。"d"};
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">hash = { "a": "b", "c": "d"};</font></font>
ru: хэш={"a":"b","c":"d"};

source: jsfiddle example: <a href="http://jsfiddle.net/qar4j/1/">http://jsfiddle.net/qar4j/1/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo de jsfiddle: </font></font><a href="http://jsfiddle.net/qar4j/1/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/qar4j/1/</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsfiddleの例：</font><a href="http://jsfiddle.net/qar4j/1/"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> ://jsfiddle.net/qar4j/1/</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsfiddle 예 : </font></font><a href="http://jsfiddle.net/qar4j/1/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/qar4j/1/</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пример jsfiddle: </font></font><a href="http://jsfiddle.net/qar4j/1/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://jsfiddle.net/qar4j/1/</font></font></a>

source: we can get the length using the length of the keys which is the length of the hash:
es: podemos obtener la longitud usando la longitud de las teclas que es la longitud del hachís:
ja: ハッシュの長さであるキーの長さを使って長さを求めることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">해시의 길이 인 키의 길이를 사용하여 길이를 얻을 수 있습니다.</font></font>
ru: мы можем получить длину,используя длину ключей,которая является длиной хэша:

source: where myobject is the object of what you want the length
es: donde mi objeto es el objeto de lo que quieres la longitud
ja: ここで myobject は長さを求めるオブジェクトです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 myobject는 원하는 길이의 객체입니다.</font></font>
ru: где миобъект является объектом той длины,которую вы хотите.
