Repository: rueisnom/feedback
Catalog: xlf/80/51/07/805107.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: You <em>can</em> have multiline strings in pure JavaScript.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usted </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">puede</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tener l&iacute;neas m&uacute;ltiples en JavaScript puro.</font></font>
ja: 純粋なJavaScriptでは複数行の文字列を使用できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순수한 JavaScript로 여러 줄 문자열을 가질 </font><font style="vertical-align: inherit;">수 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있습니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">можете</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> иметь многострочные строки в чистом JavaScript.</font></font>
zh_cn: 您<em>可以</em>在纯JavaScript中使用多行字符串。

source: You can do this...
es: Puedes hacer esto...
ja: こんなことができるんですね...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당신은 이것을 할 수 있습니다 ...</font></font>
ru: Ты можешь сделать это...
zh_cn: 你可以这样做.....

source: You can have here-documents like this:
es: Puedes tener aquí documentos como este:
ja: このようなドキュメントを持つことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 문서를 가질 수 있습니다.</font></font>
ru: Ты можешь взять вот такие документы:
zh_cn: 你可以拥有像这样的文件。

source: You can try TypeScript at
es: Puedes probar con TypeScript en
ja: でTypeScriptを試すことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeScript를 사용해보십시오.</font></font>
ru: Вы можете попробовать TypeScript на
zh_cn: 你可以在以下网址尝试一下TypeScript

source: You can use <a href="http://www.typescriptlang.org/Playground">TypeScript</a> (JavaScript SuperSet), it supports multiline strings, and transpiles back down to pure JavaScript without overhead:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font><a href="http://www.typescriptlang.org/Playground"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (JavaScript SuperSet), admite cadenas multil&iacute;nea y transpila de nuevo a JavaScript puro sin sobrecarga:</font></font>
ja: <a href="http://www.typescriptlang.org/Playground">TypeScript</a> （JavaScript SuperSet）を使用でき、複数行の文字列をサポートし、オーバーヘッドなしで純粋なJavaScriptにトランスパイルします。
ko: <font style="vertical-align: inherit;"></font><a href="http://www.typescriptlang.org/Playground"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (JavaScript SuperSet)를 </font><font style="vertical-align: inherit;">사용할 수 있으며 </font><font style="vertical-align: inherit;">여러</font><font style="vertical-align: inherit;"> 줄 문자열을 지원하며 오버 헤드없이 순수한 JavaScript로 다시 변환합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font><a href="http://www.typescriptlang.org/Playground"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">TypeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (JavaScript SuperSet), он поддерживает многострочные строки и переносится обратно в чистый JavaScript без дополнительных затрат:</font></font>
zh_cn: 您可以使用<a href="http://www.typescriptlang.org/Playground">TypeScript</a> （JavaScript SuperSet），它支持多行字符串，并且可以将其转换回纯JavaScript，而不会产生开销：

source: You can use <code>+=</code> to concatenate your string, seems like no one answered that, which will be readable, and also neat... something like this
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para concatenar su cadena, parece que nadie respondi&oacute; eso, lo que ser&aacute; legible y tambi&eacute;n ordenado ... algo como esto</font></font>
ja: <code>+=</code> を使用して文字列を連結することができ、誰もそれを答えていないようです。これは読みやすく、またきちんと...このようなもの
ko: <code>+=</code> 를 사용하여 문자열을 연결할 수 있습니다. 아무도 대답하지 않은 것처럼 보이며 읽을 수 있고 깔끔합니다 ...
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font> <code>+=</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для объединения вашей строки, кажется, что никто не ответил на это, что будет читабельным, а также аккуратным ... как-то так</font></font>
zh_cn: 您可以使用 <code>+=</code> 来连接您的字符串，似乎没有人回答，这将是可读的，而且也很整洁。

source: You have to use the concatenation operator '+'.
es: Tienes que usar el operador de concatenación '+'.
ja: 連結演算子「+」を使用する必要があります。
ko: 연결 연산자 '+'를 사용해야합니다.
ru: Необходимо использовать оператор конкатенация '+'.
zh_cn: 你必须使用连接符'+'。

source: add a <code>&lt;script&gt;...&lt;/script&gt;</code> block containing your multiline text into <code>head</code> tag;
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a&ntilde;adir un </font></font> <code>&lt;script&gt;...&lt;/script&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bloque que contiene el texto de l&iacute;neas m&uacute;ltiples en </font></font> <code>head</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> etiqueta;</font></font>
ja: 複数行のテキストを含む <code>&lt;script&gt;...&lt;/script&gt;</code> ブロックを <code>head</code> タグに追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 </font><font style="vertical-align: inherit;">줄로 된 텍스트를 포함 </font><font style="vertical-align: inherit;">하는 </font></font> <code>&lt;script&gt;...&lt;/script&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 블록을 </font></font> <code>head</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 태그에 추가하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">добавьте блок </font></font> <code>&lt;script&gt;...&lt;/script&gt;</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> содержащий ваш многострочный текст, в </font><font style="vertical-align: inherit;">тег </font></font> <code>head</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ;</font></font>
zh_cn: 在 <code>head</code> 标签中添加包含多行文本的 <code>&lt;script&gt;...&lt;/script&gt;</code> 块；

source: and you can use the multiline-string object from the plain JavaScript variant, where you put the templates into another file (which you can merge in the bundle).
es: y se puede utilizar el objeto multilínea-cadena de la variante de JavaScript simple,donde se ponen las plantillas en otro archivo (que se puede fusionar en el paquete).
ja: そして、テンプレートを別のファイルに入れて(バンドルにマージすることができます)、プレーンなJavaScriptのバリアントからマルチライン文字列オブジェクトを使用することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿을 다른 파일 (번들에 병합 할 수 있음)에 넣는 일반 JavaScript 변형의 여러 줄 문자열 객체를 사용할 수 있습니다.</font></font>
ru: и вы можете использовать многострочный объект из простого варианта JavaScript,где вы помещаете шаблоны в другой файл (который вы можете объединить в связку).
zh_cn: 而你可以使用纯JavaScript变体中的multline-string对象,在这里你可以把模板放到另一个文件中(你可以把它合并到bundle中)。

source: can be also written as
es: también puede escribirse como
ja: は次のようにも書けます。
ko: 로 쓸 수도 있습니다
ru: также может быть написано как
zh_cn: 也可以写成

source: compatibility :
es: compatibilidad :
ja: 互換性
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">호환성 :</font></font>
ru: совместимость :
zh_cn: 兼容性

source: get your multiline text as is... (watch out for text encoding: UTF-8, ASCII)
es: obtener su texto multilínea tal como está...(cuidado con la codificación de texto:UTF-8,ASCII)
ja: 複数行のテキストをそのまま取得する...(テキストのエンコーディングに注意:UTF-8,ASCII)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 줄로 된 텍스트를 그대로 얻으십시오 ... (텍스트 인코딩을 조심하십시오 : UTF-8, ASCII)</font></font>
ru: получишь свой многострочный текст,как есть...(следите за кодировкой текста:UTF-8,ASCII)
zh_cn: 获取您的多行文本.....。(注意文本编码:UTF-8,ASCII)

source: or the pattern anonymous already showed (escape newline), which can be an ugly block in your code:
es: o el patrón anónimo ya mostrado (escape newline),que puede ser un feo bloqueo en su código:
ja: または、匿名さんがすでに示しているパターン (改行をエスケープ)は、あなたのコードの中で醜いブロックになる可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 익명으로 이미 표시된 패턴 (줄 바꿈 이스케이프)은 코드에서 못생긴 블록 일 수 있습니다.</font></font>
ru: или уже показанный анонимный шаблон (escape newline),который может быть уродливым блоком в вашем коде:
zh_cn: 或匿名已经显示的模式(转义换行),这可能是你的代码中一个很难看的块。

source: require.js: 'require text'.
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">require.js : '텍스트 필요'.</font></font>

source: the pattern <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> is not available in js (I remember using it much in my good old Perl days).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el </font></font> <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del patr&oacute;n </font><font style="vertical-align: inherit;">= &lt;&lt; "AQU&Iacute;" Esta es una cadena multil&iacute;nea AQU&Iacute;</font><font style="vertical-align: inherit;"> no est&aacute; disponible en js (recuerdo haberlo usado mucho en mis viejos tiempos de Perl).</font></font>
ja: パターン <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> はjsを使用できません（私は古き良きPerlの時代によく使用したことを覚えています）。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">패턴 </font></font> <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. js에서는 사용할 수 없습니다 (좋은 Perl 시절에는 많이 사용하는 것을 기억합니다).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">the pattern </font></font> <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> недоступна в js (я помню, как много использовал ее в старые добрые времена Perl).</font></font>
zh_cn: 模式 <code>text = &lt;&lt;"HERE" This Is A Multiline String HERE</code> 在js中不可用（我记得在Perl过去的美好时光中经常使用它）。

source: this one didn't work: <a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111">Creating multiline strings in JavaScript</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este no funcion&oacute;: </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">crear cadenas multil&iacute;nea en JavaScript</font></font></a>
ja: これは機能しませんでした： <a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111">JavaScriptで複数行の文字列を作成する</a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 작동하지 않습니다 : </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript로 여러 줄 문자열 만들기</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это не сработало: </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">создание многострочных строк в JavaScript</font></font></a>
zh_cn: 这个没有用： <a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/805111#805111">用JavaScript创建多行字符串</a>

source: this worked fairly well, I have also figured out how to make it look good in Notepad++ source view: <a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069">Creating multiline strings in JavaScript</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esto funcion&oacute; bastante bien, tambi&eacute;n he descubierto c&oacute;mo hacer que se vea bien en la vista de origen de Notepad ++: </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Crear cadenas multil&iacute;nea en JavaScript</font></font></a>
ja: これはかなりうまくいきました。Notepad++のソースビューで見栄えを良くする方法もわかりました。JavaScriptで<a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069">複数行の文字列を作成する</a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 상당히 잘 작동했습니다. 메모장 ++ 소스 뷰에서 잘 보이게 만드는 방법을 알아 냈습니다. </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript로 여러 줄 문자열 만들기</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">это работало довольно хорошо, я также выяснил, как сделать так, чтобы он хорошо выглядел в режиме просмотра исходного кода Notepad ++: </font></font><a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Создание многострочных строк в JavaScript</font></font></a>
zh_cn: 这工作得很好，我还想出了如何在Notepad ++源代码视图中使其看起来更好： <a href="https://stackoverflow.com/questions/805107/multiline-strings-in-javascript/5571069#5571069">在JavaScript中创建多行字符串</a>

source: to sum up, I have tried 2 approaches listed here in user javascript programming (Opera 11.01):
es: Para resumir,he intentado 2 enfoques listados aquí en la programación de javascript de usuario (Opera 11.01):
ja: 要約すると、私はここに記載されている2つのアプローチをユーザーのjavascriptプログラミング(Opera 11.01)で試してみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요약하면 사용자 자바 스크립트 프로그래밍 (Opera 11.01)에 나열된 두 가지 접근법을 시도했습니다.</font></font>
ru: Подводя итог,я попробовал 2 подхода,перечисленных здесь,в пользовательском программировании на javascript (Opera 11.01):
zh_cn: 总结一下,我在用户javascript编程(Opera 11.01)中尝试了2种方法,这里列出了2种方法。
