Repository: rueisnom/feedback
Catalog: xlf/80/51/07/805107.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Here's the <a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components">specification</a>. See browser support at the bottom of this <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings">page</a>. Here are some <a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings">examples</a> too.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; est&aacute; la </font></font><a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">especificaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Consulte el soporte del navegador al final de esta </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">p&aacute;gina</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Aqu&iacute; hay algunos </font></font><a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ejemplos</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n.</font></font>
ja: こちらが<a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components">仕様</a>です。 この<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings">ページ</a>の下部にあるブラウザのサポートをご覧ください 。 ここにもいくつかの<a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings">例があり</a>ます。
ko: <font style="vertical-align: inherit;"></font><a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">사양</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 다음과 같습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">페이지</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하단의 브라우저 지원을 </font><font style="vertical-align: inherit;">참조하십시오</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">다음은 몇 가지 </font></font><a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот </font></font><a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">спецификация</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Смотрите поддержку браузера внизу этой </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">страницы</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Вот также несколько </font></font><a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">примеров</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 这是<a href="http://www.ecma-international.org/ecma-262/6.0/#sec-template-literal-lexical-components">规格</a> 。 请参阅此<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings">页面</a>底部的浏览器支持。 这里也有一些<a href="https://developers.google.com/web/updates/2015/01/ES6-Template-Strings?hl=en#multiline-strings">例子</a> 。

source: Hope it helps !!
es: ¡¡Espero que ayude!!
ja: それは助けになることを願っています!
ko: 그것이 도움이되기를 바랍니다!
ru: Надеюсь,это поможет!!!
zh_cn: 希望对你有帮助!

source: I came up with this very jimmy rigged method of a multi lined string. Since converting a function into a string also returns any comments inside the function you can use the comments as your string using a multilined comment /**/. You just have to trim off the ends and you have your string.
es: Se me ocurrió este método de cuerdas de múltiples líneas.Como convertir una función en una cadena también devuelve cualquier comentario dentro de la función puedes usar los comentarios como tu cadena usando un comentario multilínea **.Sólo tienes que recortar los extremos y ya tienes tu cuerda.
ja: 私は、複数行の文字列の非常にジミーな方法を思いつきました。関数を文字列に変換すると、関数内のコメントも返されるので、コメントを文字列として使用するには、複数行のコメント**を使用します。端を切り落とせば、文字列ができあがります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 다중 줄 문자열의이 지 미식 리깅 방법을 생각해 냈습니다. </font><font style="vertical-align: inherit;">함수를 문자열로 변환하면 함수 내부의 주석도 반환되므로 여러 줄 주석 / ** /를 사용하여 주석을 문자열로 사용할 수 있습니다. </font><font style="vertical-align: inherit;">끝을 다듬어야하고 줄이 있습니다.</font></font>
ru: Я придумал этот самый Джимми сфальсифицированный метод многострунной струны.Так как преобразование функции в строку также возвращает любые комментарии внутри функции,вы можете использовать комментарии как вашу строку,используя многострочный комментарий **.Нужно просто обрезать концы и у вас есть строка.
zh_cn: 我想出了这样一个非常jimmy操纵的多行字符串的方法。由于将一个函数转换为字符串也会返回函数中的注释,所以你可以使用多行注释**作为你的字符串。你只需要把两端修剪掉,你就可以得到你的字符串了。

source: I get:
es: Lo entiendo:
ja: 分かったわ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 얻다:</font></font>
ru: Я понял:
zh_cn: 我明白了。

source: I have the following code in Ruby. I want to convert this code into JavaScript. what's the equivalent code in JS?
es: Tengo el siguiente código en Ruby.Quiero convertir este código en JavaScript.¿Cuál es el código equivalente en JS?
ja: 私はRubyで以下のコードを持っています。このコードをJavaScriptに変換したいのですが、JSではどのようなコードに相当するのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ruby에는 다음 코드가 있습니다. </font><font style="vertical-align: inherit;">이 코드를 JavaScript로 변환하고 싶습니다. </font><font style="vertical-align: inherit;">JS의 동등한 코드는 무엇입니까?</font></font>
ru: У меня есть следующий код на Руби.Я хочу преобразовать этот код в JavaScript.Какой эквивалент кода в JS?
zh_cn: 我有以下Ruby中的代码,我想把这段代码转换为JavaScript。我想把这段代码转换为JavaScript,请问JS中的代码是什么?

source: I like this syntax and indendation:
es: Me gusta esta sintaxis e indendación:
ja: この構文とインデンテーションが好きです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는이 구문과 indendation을 좋아한다 :</font></font>
ru: Мне нравится этот синтаксис и отступление:
zh_cn: 我喜欢这种语法和缩进法。

source: I solved this by outputting a div, making it hidden, and calling the div id by jQuery when I needed it.
es: Resolví esto sacando un div,haciéndolo oculto,y llamando al div id por jQuery cuando lo necesitaba.
ja: divを出力して非表示にして、必要な時にjQueryでdiv idを呼び出すことで解決しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">div를 출력하고 숨기고 필요할 때 jQuery로 div id를 호출 하여이 문제를 해결했습니다.</font></font>
ru: Я решил эту проблему,выпустив div,сделав его скрытым и вызвав div id с помощью jQuery,когда он был мне нужен.
zh_cn: 我通过输出一个div,使其隐藏,并在需要时通过jQuery调用div id来解决这个问题。

source: I think a <em>real</em> solution would be to use <a href="http://coffeescript.org/#strings">CoffeeScript</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Creo que una </font><font style="vertical-align: inherit;">soluci&oacute;n </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">real</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&iacute;a usar </font></font><a href="http://coffeescript.org/#strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CoffeeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <em>実際の</em>解決策は、 <a href="http://coffeescript.org/#strings">CoffeeScript</a>を使用することだと思います。
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 솔루션은 </font></font><a href="http://coffeescript.org/#strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CoffeeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하는 것이라고 </font><font style="vertical-align: inherit;">생각합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я думаю, что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">реальным</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> решением было бы использовать </font></font><a href="http://coffeescript.org/#strings"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CoffeeScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 我认为<em>真正的</em>解决方案是使用<a href="http://coffeescript.org/#strings">CoffeeScript</a> 。

source: I think this workaround should work in IE, Chrome, Firefox, Safari, Opera -
es: Creo que esta solución debería funcionar en IE,Chrome,Firefox,Safari,Opera...
ja: この回避策は、IE、Chrome、Firefox、Safari、Operaで動作すると思います。
ko: 이 해결 방법은 IE, Chrome, Firefox, Safari, Opera에서 작동해야한다고 생각합니다.
ru: Я думаю,что этот обходной приём должен работать в IE,Chrome,Firefox,Safari,Opera -
zh_cn: 我想这个方法应该可以在IE、Chrome、Firefox、Safari、Opera中使用。

source: I'm surprised I didn't see this, because it works everywhere I've tested it and is very useful for e.g. templates:
es: Me sorprende no haber visto esto,porque funciona en todos los lugares donde lo he probado y es muy útil para,por ejemplo,plantillas:
ja: 私がテストしたところではどこでも動作していて、テンプレートなどには非常に便利なので、これを見なかったことに驚いています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 그것을 보지 못했다는 것에 놀랐다. 왜냐하면 그것이 테스트 한 모든 곳에서 작동하기 때문에 템플릿과 같이 매우 유용하다.</font></font>
ru: Я удивлен,что не увидел этого,потому что он работает везде,где я его тестировал,и очень полезен,например,для шаблонов:
zh_cn: 我很惊讶自己没有看到这个,因为我测试过的地方都能用,而且对模板等非常有用。

source: IE 4 - 10
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">IE 4-10</font></font>

source: If you have a lot of legacy code, you can also use the plain JavaScript variant in TypeScript (for cleanup purposes):
es: Si tienes mucho código heredado,también puedes usar la variante de JavaScript simple en TypeScript (para propósitos de limpieza):
ja: レガシーコードが多い場合は、TypeScript のプレーン JavaScript バリアントを使用することもできます (クリーンアップのため)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 레거시 코드가있는 경우 정리를 위해 TypeScript에서 일반 JavaScript 변형을 사용할 수도 있습니다.</font></font>
ru: Если у вас много унаследованного кода,вы также можете использовать простой вариант JavaScript в TypeScript (для очистки):
zh_cn: 如果你有很多遗留的代码,你也可以在TypeScript中使用纯JavaScript变体(为了清理目的)。

source: If you'd want to accomplish the same with plain JavaScript:
es: Si quieres lograr lo mismo con un simple JavaScript:
ja: もしあなたがプレーンJavaScriptで同じことを達成したいのであれば。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일반 JavaScript로 동일한 작업을 수행하려는 경우 :</font></font>
ru: Если вы хотите сделать то же самое с простым JavaScript:
zh_cn: 如果你想用普通的JavaScript来完成同样的任务。

source: If you're willing to use the escaped newlines, they can be used <em>nicely</em>. <strong>It looks like a document with a page border</strong>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; dispuesto a usar las nuevas l&iacute;neas escapadas, se pueden usar </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">muy bien</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Parece un documento con un borde de p&aacute;gina</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: エスケープされた改行を使用する場合は、それらを<em>うまく</em>使用できます。 <strong>これは、ページ境界線があるドキュメントのように見えます</strong> 。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이스케이프 된 줄 바꿈을 기꺼이 사용하려는 경우 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">잘</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용할 수 있습니다 </font><font style="vertical-align: inherit;">. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">페이지 테두리가있는 문서처럼 보입니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите использовать экранированные символы новой строки, их можно использовать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">красиво</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это выглядит как документ с рамкой страницы</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 如果您愿意使用转义的换行符，可以<em>很好地</em>使用它们。 <strong>它看起来像带有页面边框的文档</strong> 。

source: Interpolating variables is a popular new feature that comes with back-tick delimited strings:
es: Interpolar variables es una nueva característica popular que viene con cadenas delimitadas de retroceso:
ja: 変数の補間は、バックティックで区切られた文字列が付属している人気の新機能です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">보간 변수는 백틱으로 구분 된 문자열과 함께 제공되는 인기있는 새로운 기능입니다.</font></font>
ru: Интерполяция переменных-это популярная новая функция,которая поставляется с разделенными строками с обратной связью:
zh_cn: 插值变量是一个流行的新功能,它自带反键分隔符串。

source: Is the .push() to add to the array taking up a lot of time? See this related answer:
es: ¿El .push()para agregar al arreglo está tomando mucho tiempo? Vea esta respuesta relacionada:
ja: 配列に追加する.push()に時間がかかっていませんか?こちらの関連する回答を参照してください。
ko: 배열에 추가하는 .push ()가 많은 시간을 소비합니까? 이 관련 답변을 참조하십시오.
ru: Затягивает ли .push()добавление в массив много времени? См.ответ на этот вопрос:
zh_cn: 添加到数组中的.push()是否占用了很多时间?请看这个相关的回答。

source: It DOES work in Opera 11. At least in user JS scripts. Too bad I can't comment on individual answers or upvote the answer, I'd do it immediately. If possible, someone with higher privileges please do it for me.
es: Funciona en Opera 11.Al menos en los scripts JS de los usuarios.Lástima que no pueda comentar las respuestas individuales o subir la respuesta,lo haría inmediatamente.Si es posible,alguien con mayores privilegios por favor hágalo por mí.
ja: Opera 11では動作します。少なくともユーザーJSスクリプトでは。残念ながら、私は個々の回答にコメントしたり、回答をupvoteすることができません、私はすぐにそれを行うだろう。できれば、より高い権限を持つ人がやってくれないかな。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Opera 11에서는 작동합니다. 최소한 사용자 JS 스크립트에서는 작동합니다. </font><font style="vertical-align: inherit;">안타깝게도 개별 답변에 댓글을 달거나 답변을 찬성 할 수 없습니다. 즉시 처리하겠습니다. </font><font style="vertical-align: inherit;">가능하다면, 더 높은 특권을 가진 사람이 저를 위해 그것을하십시오.</font></font>
ru: Он работает в 11-ой опере.По крайней мере,в пользовательских JS-скриптах.Очень жаль,что я не могу прокомментировать отдельные ответы или проголосовать против,я бы сделал это немедленно.Если возможно,кто-то с более высокими привилегиями,пожалуйста,сделайте это за меня.
zh_cn: 它在Opera 11中确实可以使用。至少在用户的JS脚本中是这样的。太糟糕了,我不能对单个答案发表评论或对答案进行投票,我想马上去做。如果可能的话,请有更高权限的人帮我做一下。

source: It doesn't work on firefox or opera; only on IE, chrome and safari.
es: No funciona en Firefox o en la ópera,sólo en IE,Chrome y Safari.
ja: firefoxやオペラでは動作せず、IE、クローム、サファリでのみ動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">파이어 폭스 나 오페라에서는 작동하지 않습니다. </font><font style="vertical-align: inherit;">IE, 크롬 및 사파리에서만 가능합니다.</font></font>
ru: Он не работает на Firefox или в опере;только на IE,хроме и сафари.
zh_cn: 它在firefox或 opera上不能使用,只能在IE、chrome和safari上使用。

source: It is now natively supported by all major browser vendors (except internet explorer)
es: Ahora está soportado nativamente por todos los principales proveedores de navegadores (excepto Internet Explorer)
ja: 現在、すべての主要なブラウザベンダー(インターネットエクスプローラーを除く)でネイティブにサポートされています。
ko: 이제 모든 주요 브라우저 공급 업체에서 기본적으로 지원합니다 (인터넷 탐색기 제외).
ru: В настоящее время он поддерживается всеми основными производителями браузеров (кроме Internet Explorer).
zh_cn: 它现在已被所有主要的浏览器厂商(除互联网浏览器外)原生支持。

source: It was introduces in <code>ES6</code>//<code>es2015</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fue introducido en </font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> // </font></font> <code>es2015</code>
ja: <code>ES6</code> // <code>es2015</code> で紹介されました
ko: <font style="vertical-align: inherit;"></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 소개되었습니다 </font><font style="vertical-align: inherit;">// </font></font> <code>es2015</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это было введено в </font></font> <code>ES6</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> // </font></font> <code>es2015</code>
zh_cn: 在 <code>ES6</code> 中引入// // <code>es2015</code>

source: Javascript doesn't have a here-document syntax. You can escape the literal newline, however, which comes close:
es: Javascript no tiene la sintaxis de un documento de aquí.Sin embargo,puede escapar de la línea literal de la nueva línea,que se acerca:
ja: Javascriptにはhe-documentの構文がありません。しかし、リテラルの改行をエスケープすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javascript에는 here-document 구문이 없습니다. </font><font style="vertical-align: inherit;">그러나 문자 그대로의 개행을 피할 수 있습니다.</font></font>
ru: У Javascript нет синтаксиса этого документа.Тем не менее,вы можете избежать буквально новой строки,которая приближается:
zh_cn: Javascript没有here-document语法。但是,你可以转义字面的换行,这一点很接近。

source: Just tried the Anonymous answer and found there's a little trick here, it doesn't work if there's a space after backslash <code>\</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Acabo de probar la respuesta an&oacute;nima y descubr&iacute; que hay un peque&ntilde;o truco aqu&iacute;, no funciona si hay un espacio despu&eacute;s de la barra invertida </font></font> <code>\</code>
ja: 匿名の答えを試してみて、ここに小さなトリックがあることがわかりました、バックスラッシュ <code>\</code> の後にスペースがある場合は機能しません
ko: 익명 답변을 시도했지만 여기에 약간의 트릭이 있음을 발견했습니다. 백 슬래시 뒤에 공백이 있으면 작동하지 않습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто попробовал анонимный ответ и обнаружил, что здесь есть небольшая хитрость, она не работает, если после обратной косой черты есть пробел </font></font> <code>\</code>
zh_cn: 刚刚尝试了匿名答案，发现这里有一个小窍门，如果反斜杠后有空格，它就不起作用了 <code>\</code>

source: More reference <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals">here</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&aacute;s referencia </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a>
ja: 詳細は<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals">こちら</a>
ko: <font style="vertical-align: inherit;"><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals"><font style="vertical-align: inherit;">여기에</font></a><font style="vertical-align: inherit;"> 더 많은 참조</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Больше ссылки </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a>
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals">在这里</a>更多参考
