Repository: rueisnom/feedback
Catalog: xlf/80/51/07/805107.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: My extension to <a href="https://stackoverflow.com/a/15558082/80404">https://stackoverflow.com/a/15558082/80404</a>. It expects comment in a form <code>/*! any multiline comment */</code> where symbol ! is used to prevent removing by minification (at least for YUI compressor)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mi extensi&oacute;n a </font></font><a href="https://stackoverflow.com/a/15558082/80404"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/15558082/80404</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Se espera un comentario en forma </font></font> <code>/*! any multiline comment */</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> donde s&iacute;mbolo! </font><font style="vertical-align: inherit;">se usa para evitar la extracci&oacute;n por minificaci&oacute;n (al menos para el compresor YUI)</font></font>
ja: <a href="https://stackoverflow.com/a/15558082/80404">https://stackoverflow.com/a/15558082/80404</a>への私の拡張。 <code>/*! any multiline comment */</code> 形式のコメントを期待しています！ 複数行コメント* / where記号！ 縮小による削除を防ぐために使用されます（少なくともYUIコンプレッサーの場合）
ko: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/a/15558082/80404"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/15558082/80404의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내 확장 </font><font style="vertical-align: inherit;">. </font></font> <code>/*! any multiline comment */</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 형식의 주석이 필요합니다 </font><font style="vertical-align: inherit;">! </font><font style="vertical-align: inherit;">여러 줄 주석 * /</font><font style="vertical-align: inherit;"> where symbol! </font><font style="vertical-align: inherit;">최소화로 제거를 방지하는 데 사용됩니다 (적어도 YUI 압축기의 경우).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Мое расширение на </font></font><a href="https://stackoverflow.com/a/15558082/80404"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://stackoverflow.com/a/15558082/80404</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ожидается комментарий в форме </font></font> <code>/*! any multiline comment */</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> где символ! </font><font style="vertical-align: inherit;">используется для предотвращения удаления с помощью минификации (по крайней мере, для компрессора YUI)</font></font>
zh_cn: 我对<a href="https://stackoverflow.com/a/15558082/80404">https://stackoverflow.com/a/15558082/80404的</a>扩展。 它期望以 <code>/*! any multiline comment */</code> 形式进行注释！ 任何多行注释* /其中的符号！ 用于防止缩小（至少对于YUI压缩机而言）

source: My version of array-based join for string concat:
es: Mi versión de la unión basada en arreglos para el concatenamiento de cadenas:
ja: 配列ベースの文字列結合の私のバージョン。
ko: 문자열 연결에 대한 내 배열 기반 조인 버전 :
ru: Моя версия массивного соединения для строкового конката:
zh_cn: 我的版本是基于数组的数组联接,用于string concat。

source: NPM/browserify: the 'brfs' module
es: NPMbrowserify:el módulo 'brfs'.
ja: NPMbrowserify:'brfs' モジュール
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NPM / browserify : 'brfs'모듈</font></font>
ru: NPMbrowserify:модуль 'brfs'.
zh_cn: NPMbrowserify:'brfs'模块

source: Note that the iPad/Safari does not support <code>'functionName.toString()'</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que el iPad / Safari no es compatible con </font></font> <code>'functionName.toString()'</code>
ja: iPad / Safariは <code>'functionName.toString()'</code> をサポートしないことに注意してください
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">iPad / Safari는 </font> <code>'functionName.toString()'</code> <font style="vertical-align: inherit;"> 지원하지 않습니다.</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что iPad / Safari не поддерживает </font></font> <code>'functionName.toString()'</code>
zh_cn: 请注意，iPad / Safari不支持 <code>'functionName.toString()'</code>

source: Opera 9.50 - 12 (not in 9-)
es: Ópera 9.50-12 (no en 9-)
ja: オペラ9.50~12(9-ではありません
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">오페라 9.50-12 (9가 아님)</font></font>
ru: Опера 9.50-12 (не в 9-)
zh_cn: Opera 9.50-12(不在9-)

source: Original ES5 answer:
es: Respuesta original ES5:
ja: オリジナルのES5の答え。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원래 ES5 답변 :</font></font>
ru: Оригинальный ответ ES5:
zh_cn: 原本ES5的答案。

source: Performance wise, <strong>Slash concatenation</strong> (first one) is the fastest.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En cuanto al rendimiento, la </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">concatenaci&oacute;n Slash</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (primera) es la m&aacute;s r&aacute;pida.</font></font>
ja: パフォーマンスに関しては、 <strong>スラッシュ連結</strong> （最初のもの）が最も高速です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">성능면에서 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">슬래시 연결</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (첫 번째)이 가장 빠릅니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С точки зрения производительности </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">конкатенация Slash</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (первая) - самая быстрая.</font></font>
zh_cn: 在性能方面， <strong>Slash串联</strong> （第一个）是最快的。

source: Please for the love of the internet use string concatenation and opt not to use ES6 solutions for this. ES6 is NOT supported all across the board, much like CSS3 and certain browsers being slow to adapt to the CSS3 movement. Use plain ol' JavaScript, your end users will thank you.
es: Por favor,por amor a Internet,use la concatenación de cadenas y opte por no usar soluciones ES6 para esto.ES6 no está soportado en todos los ámbitos,al igual que CSS3 y ciertos navegadores son lentos para adaptarse al movimiento CSS3.Usa el viejo JavaScript,tus usuarios finales te lo agradecerán.
ja: インターネットの愛のために、文字列連結を使用し、ES6ソリューションを使用しないようにしてください。CSS3や特定のブラウザがCSS3の動きに適応するのが遅れているように、ES6は全面的にはサポートされていません。あなたのエンドユーザーは、あなたのエンドユーザーに感謝するでしょう。
ko: 인터넷 사용 문자열 연결을 좋아하고 ES6 솔루션을 사용하지 않도록 선택하십시오. ES6는 CSS3 및 특정 브라우저가 CSS3 이동에 느리게 적응하는 것처럼 보드 전체에서 지원되지는 않습니다. 일반 ol 'JavaScript를 사용하면 최종 사용자가 감사합니다.
ru: Пожалуйста,из любви к конкатенации строк использования интернета и решите не использовать для этого решения ES6.ES6 НЕ поддерживается повсеместно,как и CSS3,и некоторые браузеры медленно адаптируются к движению CSS3.Используйте обычный старый JavaScript,ваши конечные пользователи будут благодарны вам.
zh_cn: 看在互联网的份上,请使用字符串连接,不要使用ES6解决方案。ES6并不是全面支持的,就像CSS3和某些浏览器迟迟不能适应CSS3运动一样。使用普通的JavaScript,你的终端用户会感谢你的。

source: Rekonq 0.7.0 - 0.8.0
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Rekonq 0.7.0-0.8.0</font></font>
ru: Реконка 0.7.0-0.8.0

source: Safari 4 - 6 (not in 3-)
es: Safari 4-6 (no en 3)
ja: サファリ4~6(3には入っていない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari 4-6 (3 아님)</font></font>
ru: Сафари 4-6 (не в 3-)
zh_cn: 野生动物园4-6(不在3级)

source: So I recommend the working approach for Opera user JS users. Unlike what the author was saying:
es: Así que recomiendo el enfoque de trabajo para los usuarios de Opera JS.A diferencia de lo que el autor estaba diciendo:
ja: ということで、OperaユーザーJSユーザーには作業的なアプローチをお勧めします。作者が言っていたこととは違い
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 Opera 사용자 JS 사용자에게는 작동 방식을 권장합니다. </font><font style="vertical-align: inherit;">저자의 말과 달리 :</font></font>
ru: Поэтому я рекомендую рабочий подход для пользователей Opera,использующих JS.В отличие от того,что говорил автор:
zh_cn: 所以笔者推荐的是Opera用户JS用户的工作方式。不像作者说的那样。

source: So the following solution doesn't work -
es: Así que la siguiente solución no funciona...
ja: そのため、以下の解決策はうまくいきません。
ko: 따라서 다음 솔루션이 작동하지 않습니다.
ru: Так что следующее решение не работает -
zh_cn: 所以,下面的解决方案是行不通的 --

source: That would be cool. Someone should write this .removeIndentation string method... ;)
es: Eso sería genial.Alguien debería escribir este método de cadena de caracteres .removeIndentation...;)
ja: かっこいいですね。誰かこの .removeIndentation 文字列メソッドを書いてくれないかな...;)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">멋지다. </font><font style="vertical-align: inherit;">누군가이 .removeIndentation 문자열 메소드를 작성해야합니다 ...;)</font></font>
ru: Это было бы круто.Кто-то должен написать этот метод .removeIndentation string...;)
zh_cn: 这将是很酷的。应该有人写出这个.deleteIndentation字符串方法....;)

source: The ES6 way of doing it would be by using template literals:
es: La forma en que el ES6 lo haría sería usando literales de plantilla:
ja: ES6の方法では、テンプレートリテラルを使用することになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 방식은 템플릿 리터럴을 사용하는 것입니다.</font></font>
ru: Способ ES6 заключается в использовании шаблонных литералов:
zh_cn: ES6的方法是使用模板字面意思。

source: The equivalent in javascript is:
es: El equivalente en javascript es:
ja: javascriptではこれに相当するものがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">자바 스크립트에서 동등한 것은 다음과 같습니다</font></font>
ru: Эквивалент в javascript:
zh_cn: javascript中的等价物是:

source: The method has successfully been tested in the following browsers (not mentioned = not tested):
es: El método ha sido probado con éxito en los siguientes navegadores (no mencionado=no probado):
ja: このメソッドは以下のブラウザで正常にテストされています(言及されていない=テストされていない)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법은 다음 브라우저에서 성공적으로 테스트되었습니다 (언급되지 않음 = 테스트되지 않음)</font></font>
ru: Метод был успешно протестирован в следующих браузерах (не указано=не протестировано):
zh_cn: 该方法已在以下浏览器中成功测试过(未提及=未测试)。

source: The whitespace at the beginning of each line can't be safely stripped at compile time; whitespace after the slash will result in tricky errors; and while most script engines support this, it is not part of ECMAScript.
es: El espacio en blanco al principio de cada línea no puede ser eliminado con seguridad en tiempo de compilación;el espacio en blanco después de la barra resultará en errores difíciles;y aunque la mayoría de los motores de script soportan esto,no es parte de ECMAScript.
ja: 各行の先頭の空白は、コンパイル時に安全に除去することができません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 줄의 시작 부분에있는 공백은 컴파일 타임에 안전하게 제거 할 수 없습니다. </font><font style="vertical-align: inherit;">슬래시 뒤에 공백이 있으면 까다로운 오류가 발생합니다. </font><font style="vertical-align: inherit;">대부분의 스크립트 엔진이이를 지원하지만 ECMAScript의 일부는 아닙니다.</font></font>
ru: Пробельные символы в начале каждой строки не могут быть безопасно удалены во время компиляции;пробельные символы после косой черты приведут к хитрым ошибкам;и хотя большинство скриптовых движков поддерживают это,это не является частью ECMAScript.
zh_cn: 在编译时,每行开头的空格不能被安全地去掉;斜线后的空格会导致棘手的错误;虽然大多数脚本引擎都支持这一点,但这不是ECMAScript的一部分。

source: Then when I need to get the string, I just use the following jQuery:
es: Entonces cuando necesito conseguir la cuerda,sólo uso el siguiente jQuery:
ja: そして、文字列を取得する必要があるときは、以下のjQueryを使用するだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그런 다음 문자열을 가져와야 할 때 다음 jQuery를 사용합니다.</font></font>
ru: Затем,когда мне нужно получить строку,я просто использую следующий jQuery:
zh_cn: 那么当我需要获取字符串时,我只需要使用下面的jQuery。

source: There are multiple ways to achieve this
es: Hay múltiples maneras de lograrlo
ja: これを実現するためには、複数の方法があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 달성하는 여러 가지 방법이 있습니다</font></font>
ru: Есть несколько способов достичь этого
zh_cn: 有多种方法可以实现这一目标

source: There's this library that makes it beautiful:
es: Hay una biblioteca que la hace hermosa:
ja: 綺麗になる図書館があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 라이브러리는 아름답게 만듭니다.</font></font>
ru: Есть одна библиотека,которая делает ее красивой:
zh_cn: 有这样一个图书馆,让它变得很美。

source: This has been tested in Fx 19 and Chrome 24 on Mac
es: Esto ha sido probado en Fx 19 y Chrome 24 en Mac
ja: これはMacのFx 19とChrome 24でテストしました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 Mac의 Fx 19 및 Chrome 24에서 테스트되었습니다.</font></font>
ru: Это было протестировано в Fx 19 и Chrome 24 на Mac.
zh_cn: 这已经在Mac上的Fx 19和Chrome 24中进行了测试。

source: This has worked well for me, especially as I often insert values into the html constructed this way. But it has lots of limitations. Indentation would be nice. Not having to deal with nested quotation marks would be really nice, and just the bulkyness of it bothers me.
es: Esto ha funcionado bien para mí,especialmente porque a menudo inserto valores en el html construido de esta manera.Pero tiene muchas limitaciones.La indentación estaría bien.No tener que lidiar con comillas anidadas estaría muy bien,y sólo el volumen de la misma me molesta.
ja: これは私にとってはうまく機能しています。特にこの方法で構築されたhtmlに値を挿入することが多いので。しかし、これには多くの制限があります。インデントはいいでしょう。ネストされた引用符を扱う必要がないのは本当にいいことです。
ko: 이것은 종종 이런 식으로 구성된 HTML에 값을 삽입 할 때 특히 효과적이었습니다. 그러나 많은 한계가 있습니다. 들여 쓰기가 좋을 것입니다. 중첩 된 따옴표를 다루지 않아도 정말 좋으며 부피가 커서 나를 귀찮게합니다.
ru: Для меня это сработало хорошо,тем более,что я часто вставляю значения в html,построенный таким образом.Но у него есть много ограничений.Было бы неплохо вставить отпечаток.Не иметь дело со вложенными кавычками было бы действительно хорошо,и просто громоздкость этого беспокоит меня.
zh_cn: 这个方法对我来说效果很好,尤其是我经常用这种方法将值插入到html中。但它有很多限制。缩进会很好。不需要处理嵌套的引号会很好,而且它的体积太大,让我很烦恼。

source: This just transpiles down to concatenation:
es: Esto se reduce a la concatenación:
ja: これは単に連結に転置しているだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 단지 연결로 변환됩니다.</font></font>
ru: Это просто перетекает в конкатеннацию:
zh_cn: 这只是换算成了串联。

source: This method is based on the serialization of functions, which is <a href="http://es5.github.io/#x15.3.4.2">defined to be implementation-dependent</a>. It does work in the most browsers (see below), but there's no guarantee that it will still work in the future, so do not rely on it.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Este m&eacute;todo se basa en la serializaci&oacute;n de funciones, que se </font></font><a href="http://es5.github.io/#x15.3.4.2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">define como dependiente de la implementaci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Funciona en la mayor&iacute;a de los navegadores (ver m&aacute;s abajo), pero no hay garant&iacute;a de que seguir&aacute; funcionando en el futuro, as&iacute; que no conf&iacute;es en &eacute;l.</font></font>
ja: このメソッドは、 <a href="http://es5.github.io/#x15.3.4.2">実装に依存するように定義されている</a>関数のシリアル化に基づいています。 ほとんどのブラウザで動作します（以下を参照）が、今後も動作するという保証はありません。したがって、それに依存しないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 방법은 </font></font><a href="http://es5.github.io/#x15.3.4.2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현에 따라 정의 된</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수의 직렬화를 기반으로합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">대부분의 브라우저에서 작동하지만 (아래 참조) 앞으로도 계속 작동 할 것이라는 보장이 없으므로 의존하지 마십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Этот метод основан на сериализации функций, которая </font></font><a href="http://es5.github.io/#x15.3.4.2"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">определяется как зависящая от реализации</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он работает в большинстве браузеров (см. Ниже), но нет гарантии, что он все еще будет работать в будущем, поэтому не полагайтесь на него.</font></font>
zh_cn: 此方法基于功能的序列化，该序列化被<a href="http://es5.github.io/#x15.3.4.2">定义为与实现相关</a> 。 它确实可以在大多数浏览器中运行（请参阅下文），但不能保证它将来仍会运行，因此请不要依赖它。

source: This works in IE, Safari, Chrome and Firefox:
es: Esto funciona en IE,Safari,Chrome y Firefox:
ja: IE、Safari、Chrome、Firefoxで動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것은 IE, Safari, Chrome 및 Firefox에서 작동합니다.</font></font>
ru: Это работает в IE,Safari,Chrome и Firefox:
zh_cn: 这可以在IE、Safari、Chrome和Firefox中使用。

source: To keep oversight with complex or long multiline strings I sometimes use an array pattern:
es: Para mantener la supervisión con cuerdas complejas o largas multilíneas,a veces utilizo un patrón de arreglo:
ja: 複雑な文字列や長い複数行の文字列に注意を払うために、私は時々配列パターンを使います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">복잡하거나 긴 여러 줄 문자열을 감독하기 위해 때때로 배열 패턴을 사용합니다.</font></font>
ru: Для сохранения контроля над сложными или длинными многострочными строками я иногда использую шаблон массива:
zh_cn: 为了对复杂或长的多行字符串进行监督,我有时会使用数组模式。

source: Using <a href="https://github.com/requirejs/text">require.js 'text' plugin</a>, with a multiline template in <strong>template.html</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uso del </font></font><a href="https://github.com/requirejs/text"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">complemento require.js 'text'</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , con una plantilla multil&iacute;nea en </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">template.html</font></font></strong>
ja: <a href="https://github.com/requirejs/text">require.js 'text'プラグイン</a>を使用し、template.htmlの複数行<strong>テンプレート</strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">template.html의 여러 줄 </font><strong><font style="vertical-align: inherit;">템플릿</font></strong><font style="vertical-align: inherit;"> 과 함께 </font></font><a href="https://github.com/requirejs/text"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">require.js 'text'플러그인</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용</font></font><strong><font style="vertical-align: inherit;"></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование </font></font><a href="https://github.com/requirejs/text"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'text' плагина require.js</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с многострочным шаблоном в </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">template.html</font></font></strong>
zh_cn: 使用<a href="https://github.com/requirejs/text">require.js'text'插件</a> ，并在<strong>template.html中</strong>使用多行<strong>模板</strong>

source: Using script tags:
es: Usando etiquetas de guión:
ja: スクリプトタグを使用しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스크립트 태그 사용하기 :</font></font>
ru: Используя теги сценариев:
zh_cn: 使用脚本标签。

source: Using the backtick works in NodeJS, and it's supported by Chrome, Firefox, Edge, Safari, and Opera.
es: El uso del backtick funciona en NodeJS,y está soportado por Chrome,Firefox,Edge,Safari y Opera.
ja: backtickの使用はNodeJSで動作し、Chrome、Firefox、Edge、Safari、Operaでサポートされています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">백틱 사용은 NodeJS에서 작동하며 Chrome, Firefox, Edge, Safari 및 Opera에서 지원됩니다.</font></font>
ru: Использование обратной связи работает в NodeJS и поддерживается Chrome,Firefox,Edge,Safari и Opera.
zh_cn: 在NodeJS中使用backtick,Chrome、Firefox、Edge、Safari和Opera都支持。

source: Using the following function:
es: Usando la siguiente función:
ja: 以下の機能を使って
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 기능 사용 :</font></font>
ru: Используя следующую функцию:
zh_cn: 使用以下功能:

source: Which returns my text on multiple lines. If I call
es: Lo que me devuelve mi texto en varias líneas.Si llamo a
ja: これは複数行のテキストを返します。もし
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 텍스트를 여러 줄로 반환합니다. </font><font style="vertical-align: inherit;">내가 전화하면</font></font>
ru: Что возвращает мой текст на несколько строк.Если я позвоню
zh_cn: 其中返回我在多行的文本。如果我调用

source: With the <strong>ES2015</strong>, we can take advantage of its Template strings feature. With it, we just need to use back-ticks for creating multi line strings
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con el </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES2015</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podemos aprovechar su caracter&iacute;stica de cadenas de plantilla. </font><font style="vertical-align: inherit;">Con &eacute;l, solo necesitamos usar ticks de retroceso para crear cadenas de varias l&iacute;neas</font></font>
ja: <strong>ES2015</strong>では、テンプレートの文字列機能を利用できます。 これで、複数行の文字列を作成するためにバックティックを使用するだけです
ko: <font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES2015를</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하면 </font><font style="vertical-align: inherit;">템플릿 문자열 기능을 활용할 수 있습니다. </font><font style="vertical-align: inherit;">그것으로, 우리는 멀티 라인 문자열을 만들기 위해 백 틱을 사용해야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES2015</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> мы можем воспользоваться его функцией &laquo;Шаблонные строки&raquo;. </font><font style="vertical-align: inherit;">С этим нам просто нужно использовать обратные галочки для создания многострочных строк</font></font>
zh_cn: 借助<strong>ES2015</strong> ，我们可以利用其模板字符串功能。 有了它，我们只需要使用反引号来创建多行字符串
