Repository: rueisnom/feedback
Catalog: xlf/80/51/07/805107.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Also do note that, when extending string over multiple lines using forward backslash at end of each line, any extra characters (mostly spaces, tabs and comments added by mistake) after forward backslash will cause unexpected character error, which i took an hour to find out
es: También tenga en cuenta que,al extender la cadena en múltiples líneas usando la barra invertida al final de cada línea,cualquier carácter extra (mayormente espacios,tabulaciones y comentarios añadidos por error)después de la barra invertida causará un error de carácter inesperado,que me llevó una hora averiguar
ja: また、文字列を複数行に渡って拡張する際に、各行の最後にフォワードバックスラッシュを使用すると、フォワードバックスラッシュの後に余分な文字(主にスペース、タブ、コメントなど)が追加されると、予期せぬ文字エラーが発生することに注意してください。
ko: 또한 각 줄의 끝에서 백 슬래시를 사용하여 문자열을 여러 줄로 확장하면 슬래시 뒤에 슬래시가 추가 된 추가 문자 (대부분 공백, 탭 및 주석)가 예기치 않은 문자 오류를 일으켜 발견하는 데 1 시간이 걸렸습니다. 밖
ru: Также обратите внимание,что при расширении строки на несколько строк с помощью прямого обратного слеша в конце каждой строки,любые лишние символы (в основном пробелы,табуляции и комментарии,добавленные по ошибке)после прямого обратного слеша вызовут неожиданную ошибку в символах,на выяснение которой я потратил час.
zh_cn: 另外要注意的是,当在每行末尾使用前向反斜线扩展字符串时,在前向反斜线后的任何多余的字符(主要是空格、制表符和注释的错误添加)都会导致意外的字符错误,我花了一个小时才发现

source: As the first answer mentions, with ES6/Babel, you can now create multi-line strings simply by using backticks:
es: Como menciona la primera respuesta,con ES6Babel,ahora puedes crear cadenas de varias líneas simplemente usando palillos:
ja: 最初の回答にもあるように、ES6Babelでは、バックスティックを使うだけで複数行の文字列を作成できるようになりました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">첫 번째 답변에서 언급했듯이 ES6 / Babel을 사용하면 백틱을 사용하여 여러 줄 문자열을 만들 수 있습니다.</font></font>
ru: Как упоминается в первом ответе,с помощью ES6Babel теперь можно создавать многострочные строки,просто используя обратные ссылки:
zh_cn: 正如第一个答案中提到的,有了ES6Babel,你现在可以简单地通过使用背投来创建多行字符串。

source: Be careful with your minifier, though. It tends to remove comments. For the <a href="http://www.julienlecomte.net/yuicompressor/README">YUI compressor</a>, a comment starting with <code>/*!</code> (like the one I used) will be preserved.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, ten cuidado con tu minificador. </font><font style="vertical-align: inherit;">Tiende a eliminar comentarios. </font><font style="vertical-align: inherit;">Para el </font></font><a href="http://www.julienlecomte.net/yuicompressor/README"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">compresor YUI</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , &iexcl;un comentario que comienza con </font></font> <code>/*!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(como el que us&eacute;) se conservar&aacute;.</font></font>
ja: ただし、ミニファイアには注意してください。 コメントを削除する傾向があります。 <a href="http://www.julienlecomte.net/yuicompressor/README">YUIコンプレッサーの</a>場合、 <code>/*!</code> 始まるコメント！ （私が使用したもののように）保存されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래도 축소기를 조심하십시오. </font><font style="vertical-align: inherit;">주석을 제거하는 경향이 있습니다. </font><font style="vertical-align: inherit;">를 들어 </font></font><a href="http://www.julienlecomte.net/yuicompressor/README"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">YUI 압축기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , 코멘트로 시작 </font></font> <code>/*!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(내가 사용한 것과 같이) 보존됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Будьте осторожны с вашим миниатором. </font><font style="vertical-align: inherit;">Это имеет тенденцию удалять комментарии. </font><font style="vertical-align: inherit;">Для </font></font><a href="http://www.julienlecomte.net/yuicompressor/README"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">компрессора YUI</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> комментарий начинается с </font></font> <code>/*!</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(как тот, который я использовал) будет сохранен.</font></font>
zh_cn: 但是，请小心您的缩小器。 它倾向于删除评论。 对于<a href="http://www.julienlecomte.net/yuicompressor/README">YUI压缩器</a> ，以 <code>/*!</code> 开头的注释！ （例如我使用过的那个）将被保留。

source: Browserify <a href="https://www.npmjs.com/package/brfs">uses a 'brfs' module</a> to load text files. This will actually build your template into your bundled HTML.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Browserify </font></font><a href="https://www.npmjs.com/package/brfs"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">utiliza un m&oacute;dulo 'brfs'</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cargar archivos de texto. </font><font style="vertical-align: inherit;">Esto realmente construir&aacute; su plantilla en su HTML incluido.</font></font>
ja: Browserify <a href="https://www.npmjs.com/package/brfs">は「brfs」モジュール</a>を使用してテキストファイルをロードします。 これにより、テンプレートがバンドルされたHTMLに実際に組み込まれます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Browserify </font></font><a href="https://www.npmjs.com/package/brfs"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">는 'brfs'모듈</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">사용하여</font><font style="vertical-align: inherit;"> 텍스트 파일을로드합니다. </font><font style="vertical-align: inherit;">실제로 템플릿을 번들 HTML로 빌드합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Browserify </font></font><a href="https://www.npmjs.com/package/brfs"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">использует модуль 'brfs'</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для загрузки текстовых файлов. </font><font style="vertical-align: inherit;">Это фактически встроит ваш шаблон в ваш связанный HTML.</font></font>
zh_cn: Browserify <a href="https://www.npmjs.com/package/brfs">使用&ldquo; brfs&rdquo;模块</a>加载文本文件。 这实际上会将您的模板构建到捆绑的HTML中。

source: But when space is removed it works -
es: Pero cuando el espacio es removido funciona...
ja: しかし、スペースを削除すると、それは動作します。
ko: 그러나 공간이 제거되면 작동합니다.
ru: Но когда пространство удаляется,оно работает -
zh_cn: 但是,当空间被移除后,它的作用是 --

source: By using <code>&lt;br&gt;</code> your browser output will look like -
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al usar </font></font> <code>&lt;br&gt;</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la salida de su navegador se ver&aacute; as&iacute;:</font></font>
ja: <code>&lt;br&gt;</code> を使用すると、ブラウザの出力は次のようになります-
ko: <code>&lt;br&gt;</code> 를 사용하면 브라우저 출력이 다음과 같습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При использовании </font></font> <code>&lt;br&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ваш браузер будет выглядеть как -</font></font>
zh_cn: 使用 <code>&lt;br&gt;</code> ,您的浏览器输出将类似于-

source: By using <code>\n</code> your source code will look like -
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al usar </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> su c&oacute;digo fuente se ver&aacute; as&iacute;:</font></font>
ja: <code>\n</code> を使用すると、ソースコードは次のようになります-
ko: <code>\n</code> 을 사용하면 소스 코드는 다음과 같습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя </font></font> <code>\n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ваш исходный код будет выглядеть так:</font></font>
zh_cn: 使用 <code>\n</code> 您的源代码将类似于-

source: Check exact compatibility in Mozilla docs here
es: Comprueba la compatibilidad exacta en los documentos de Mozilla aquí
ja: Mozilla ドキュメントで正確な互換性を確認するには、ここをクリックしてください。
ko: 여기에서 Mozilla 문서의 정확한 호환성 확인
ru: Проверьте точную совместимость в документах Mozilla здесь
zh_cn: 在这里查看Mozilla文档中的确切兼容性

source: Chrome 1 - 45
es: Cromo 1-45
ja: クロム1-45
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">크롬 1-45</font></font>
ru: хром 1-45

source: Creating multiline strings in JavaScript
es: Creación de cadenas de líneas múltiples en JavaScript
ja: JavaScriptで複数行の文字列を作成する
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript에서 여러 줄 문자열 만들기</font></font>
ru: Создание многострочных строк на JavaScript
zh_cn: 在JavaScript中创建多行字符串

source: Does anybody know of an environment where there is HTML but it doesn't work?
es: ¿Alguien conoce un entorno en el que haya HTML pero no funcione?
ja: HTMLがあっても動かない環境をご存知の方はいらっしゃいますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTML이 있지만 작동하지 않는 환경을 아는 사람이 있습니까?</font></font>
ru: Кто-нибудь знает об окружении,где есть HTML,но он не работает?
zh_cn: 有没有人知道有HTML的环境,但有HTML却不能用?

source: ECMAScript 6 (ES6) introduces a new type of literal, namely <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong>template literals</strong></a>. They have many features, variable interpolation among others, but most importantly for this question, they can be multiline.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 (ES6) introduce un nuevo tipo de literal, a saber, los </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">literales de plantilla</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Tienen muchas caracter&iacute;sticas, interpolaci&oacute;n variable entre otras, pero lo m&aacute;s importante para esta pregunta, pueden ser multil&iacute;neas.</font></font>
ja: ECMAScript 6（ES6）では、新しいタイプのリテラル、つまり<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong>テンプレートリテラル</strong></a>が導入されてい<strong>ます</strong> 。 彼らは多くの機能、とりわけ変数補間を持っていますが、この質問にとって最も重要なのは、複数行になる可能性があることです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 (ES6)에는 새로운 유형의 리터럴, 즉 </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 리터럴이</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 도입되었습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그것들은 많은 기능들과 변수 보간법을 가지고 있지만, 가장 중요한 것은이 질문에 대해 여러 줄이 될 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ECMAScript 6 (ES6) представляет новый тип литералов, а именно </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">литералы шаблонов</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">У них много функций, среди которых переменная интерполяция, но, что важнее всего, для этого вопроса они могут быть многострочными.</font></font>
zh_cn: ECMAScript 6（ES6）引入了一种新型的文字，即<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/template_strings"><strong>模板文字</strong></a> 。 它们具有许多功能，其中包括变量插值，但对于这个问题最重要的是，它们可以是多行的。

source: ES6 UPDATE: You could use backtick instead of creating a function with a comment and running toString on the comment. The regex would need to be updated to only strip spaces. You could also have a string prototype method for doing this:
es: ES6 ACTUALIZACIÓN:Podrías usar backtick en lugar de crear una función con un comentario y ejecutar toString en el comentario.El regex necesitaría ser actualizado sólo a los espacios de la tira.También podrías tener un método de prototipo de cadena para hacer esto:
ja: ES6 UPDATE:コメント付きの関数を作成し、コメントの toString を実行する代わりに backtick を使用することができます。正規表現はスペースのみを取り除くように更新する必要があります。これを行うための文字列プロトタイプメソッドを用意することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 업데이트 : 주석이있는 함수를 만들고 주석에서 toString을 실행하는 대신 backtick를 사용할 수 있습니다. </font><font style="vertical-align: inherit;">공간을 제거하기 위해 정규식을 업데이트해야합니다. </font><font style="vertical-align: inherit;">이를 위해 문자열 프로토 타입 방법을 사용할 수도 있습니다.</font></font>
ru: ES6 UPDATE:Вместо того,чтобы создавать функцию с комментарием и запускать toString на комментарии,можно использовать бэк-тек.Регекс должен быть обновлен только до пробелов в полосах.Для этого также можно использовать метод прототипа строки:
zh_cn: ES6 UPDATE:你可以使用backtick来代替创建一个带注释的函数并在注释上运行toString。regex需要更新为只去掉空格。你也可以有一个字符串原型方法来做这个事情。

source: ES6 Update:
es: Actualización del ES6:
ja: ES6更新。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6 업데이트 :</font></font>
ru: Обновление ES6:
zh_cn: ES6更新。

source: ES6 allows you to use a backtick to specify a string on multiple lines. It's called a Template Literal. Like this:
es: ES6 le permite usar un backtick para especificar una cadena en múltiples líneas.Se llama Plantilla Literal.Como esta:
ja: ES6では、バックティックを使って複数行で文字列を指定することができます。これはテンプレートリテラルと呼ばれています。このような感じで。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES6에서는 백틱을 사용하여 여러 줄에 문자열을 지정할 수 있습니다. </font><font style="vertical-align: inherit;">이것을 템플릿 리터럴이라고합니다. </font><font style="vertical-align: inherit;">이처럼 :</font></font>
ru: ES6 позволяет использовать обратную метку для указания строки на нескольких строках.Она называется "Буквальный шаблон".Вот так:
zh_cn: ES6允许你使用反键在多行中指定一个字符串。这就是所谓的 "模板字段"。就像这样。

source: Easiest way to make multiline strings in Javascrips is with the use of backticks ( `` ). This allows you to create multiline strings in which you can insert variables with <code>${variableName}</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La forma m&aacute;s f&aacute;cil de crear cadenas multil&iacute;nea en Javascrips es con el uso de backticks (``). </font><font style="vertical-align: inherit;">Esto le permite crear cadenas multil&iacute;nea en las que puede insertar variables con </font></font> <code>${variableName}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: Javascriptで複数行の文字列を作成する最も簡単な方法は、バックティック（ ``）を使用することです。 これにより、 <code>${variableName}</code> 変数を挿入できる複数行の文字列を作成できます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javascrips에서 여러 줄 문자열을 만드는 가장 쉬운 방법은 백틱 (``)을 사용하는 것입니다. </font><font style="vertical-align: inherit;">이를 통해 </font></font> <code>${variableName}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하여 변수를 삽입 할 수있는 여러 줄 문자열을 만들 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Самый простой способ создания многострочных строк в Javascrips - использование обратных галочек (``). </font><font style="vertical-align: inherit;">Это позволяет вам создавать многострочные строки, в которые вы можете вставлять переменные с помощью </font></font> <code>${variableName}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 在Javascrips中制作多行字符串的最简单方法是使用反引号（``）。 这使您可以创建多行字符串，在其中可以使用 <code>${variableName}</code> 插入变量。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: Firefox 17 - 21 (<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes">not in 16-</a>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firefox 17-21 ( </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no en 16-</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: Firefox <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes">17-21</a> （ 16-ではありません ）
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firefox </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">17-21</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font><font style="vertical-align: inherit;">16-</font><font style="vertical-align: inherit;"> 아님)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Firefox 17 - 21 ( </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не в 16-</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: Firefox <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/toString#Notes">17-21</a> （ 不在16-中 ）

source: Here's another weird but working 'trick'<sup><b>1</b></sup>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay otro 'truco' extra&ntilde;o pero que funciona </font></font><sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: ここに別の奇妙だが機能する「トリック」があります<sup><b>1</b></sup> ：
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또 다른 이상하지만 작동하는 '트릭' </font></font><sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1이 있습니다</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот еще один странный, но работающий трюк </font></font><sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: 这是另一个奇怪但有效的&ldquo;技巧&rdquo; <sup><b>1</b></sup> ：
