Repository: rueisnom/feedback
Catalog: xlf/80/51/07/805107.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push">Is there a reason JavaScript developers don't use Array.push()?</a>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Hay alguna raz&oacute;n por la que los desarrolladores de JavaScript no usen Array.push ()?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
ja: （ <a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push">JavaScript開発者がArray.push（）を使用しない理由はありますか？</a> ）
ko: ( <a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push">JavaScript 개발자가 Array.push ()를 사용하지 않는 이유가 있습니까?</a> )
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font><a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть ли причина, по которой разработчики JavaScript не используют Array.push ()?</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: （ <a href="https://stackoverflow.com/questions/15649899/is-there-a-reason-javascript-developers-dont-use-array-push">JavaScript开发人员不使用Array.push（）是否有原因？</a> ）

source: (Note: I'm not advocating to use HTML in strings)
es: (Nota:No abogo por el uso de HTML en las cadenas)
ja: (注:HTMLを文字列で使うことを提唱しているわけではありません)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(참고 : 문자열에서 HTML을 사용하는 것을 옹호하지 않습니다)</font></font>
ru: (Примечание:я не выступаю за использование HTML в строках).
zh_cn: (注:我不主张在字符串中使用HTML)

source: (but actually can't be considered as multiline string)
es: (pero en realidad no puede considerarse como una cadena de líneas múltiples)
ja: (実際には複数行の文字列とはみなされません)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(그러나 실제로 여러 줄 문자열로 간주 될 수는 없습니다)</font></font>
ru: (но на самом деле не может рассматриваться как многострочная).
zh_cn: (但实际上不能视为多行字符串)

source: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals">Google's JavaScript style guide</a> recommends to use string concatenation instead of escaping newlines:
es: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La gu&iacute;a de estilo JavaScript de Google</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> recomienda utilizar la concatenaci&oacute;n de cadenas en lugar de escapar de las nuevas l&iacute;neas:</font></font>
ja: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals">GoogleのJavaScriptスタイルガイドで</a>は、改行をエスケープする代わりに文字列連結を使用することを推奨しています。
ko: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Google의 JavaScript 스타일 가이드</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 줄 바꿈을 피하는 대신 문자열 연결을 사용하는 것이 좋습니다.</font></font>
ru: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Руководство по стилю Google для JavaScript</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> рекомендует использовать конкатенацию строк вместо экранирования:</font></font>
zh_cn: <a href="https://google.github.io/styleguide/javascriptguide.xml?showone=Multiline_string_literals#Multiline_string_literals">Google的JavaScript样式指南</a>建议使用字符串串联而不是换行符：

source: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals">Browser support is OK</a>, but you can use <a href="https://babeljs.io/">transpilers</a> to be more compatible.
es: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La compatibilidad con el navegador est&aacute; bien</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero puede usar </font></font><a href="https://babeljs.io/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">transpilers</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ser m&aacute;s compatible.</font></font>
ja: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals">ブラウザのサポートは問題</a>ありませんが、 <a href="https://babeljs.io/">トランスパイラ</a>を使用して互換性を高めることができます。
ko: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">브라우저 지원은 가능</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하지만 </font></font><a href="https://babeljs.io/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">트랜스 파일러</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하여 호환성을 </font><font style="vertical-align: inherit;">높일</font><font style="vertical-align: inherit;"> 수 있습니다.</font></font>
ru: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поддержка браузера в порядке</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , но вы можете использовать </font></font><a href="https://babeljs.io/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">транспортеры</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для большей совместимости.</font></font>
zh_cn: <a href="https://kangax.github.io/compat-table/es6/#test-template_literals">浏览器支持还可以</a> ，但是您可以使用<a href="https://babeljs.io/">编译器</a>来更好地兼容。

source: <em>Not supported in Konqueror 4.7.4</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No es compatible con Konqueror 4.7.4</font></font></em>
ja: <em>Konqueror 4.7.4ではサポートされていません</em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Konqueror 4.7.4에서 지원되지 않습니다</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Не поддерживается в Konqueror 4.7.4</font></font></em>
zh_cn: <em>Konqueror 4.7.4不支持</em>

source: <em>external edit: <a href="http://jsfiddle.net/orwellophile/hna15vLw/2/">jsfiddle</a></em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">edici&oacute;n externa: </font></font><a href="http://jsfiddle.net/orwellophile/hna15vLw/2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsfiddle</font></font></a></em>
ja: <em>外部編集： <a href="http://jsfiddle.net/orwellophile/hna15vLw/2/">jsfiddle</a></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부 편집 : </font></font><a href="http://jsfiddle.net/orwellophile/hna15vLw/2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsfiddle</font></font></a></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внешнее редактирование: </font></font><a href="http://jsfiddle.net/orwellophile/hna15vLw/2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsfiddle</font></font></a></em>
zh_cn: <em>外部编辑： <a href="http://jsfiddle.net/orwellophile/hna15vLw/2/">jsfiddle</a></em>

source: <strong>1. Slash concatenation</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. Concatenaci&oacute;n de barra</font></font></strong>
ja: <strong>1.スラッシュ連結</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. 슬래시 연결</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1. Конкатенация косой черты</font></font></strong>
zh_cn: <strong>1.斜线连接</strong>

source: <strong>2. regular concatenation</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. concatenaci&oacute;n regular</font></font></strong>
ja: <strong>2.通常の連結</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. 규칙적인 연결</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2. регулярная конкатенация</font></font></strong>
zh_cn: <strong>2.定期串联</strong>

source: <strong>3. Array Join concatenation</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. Array Unir concatenaci&oacute;n</font></font></strong>
ja: <strong>3.配列結合連結</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. 배열 결합 연결</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3. Массив Присоединение конкатенации</font></font></strong>
zh_cn: <strong>3.数组联接串联</strong>

source: <strong>Do not do this:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No hagas esto:</font></font></strong>
ja: <strong>こんなことしないで：</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 작업을 수행하지 마십시오 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Не делайте этого:</font></font></strong>
zh_cn: <strong>不要这样做：</strong>

source: <strong>Downvoters</strong>: This code is supplied for information only.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Votantes</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : este c&oacute;digo se proporciona solo con fines informativos.</font></font>
ja: <strong>Downvoters</strong> ：このコードは情報提供のみを目的としています。
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Downvoters</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :이 코드는 정보 용으로 만 제공됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Downvoters</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : этот код предоставляется только для информации.</font></font>
zh_cn: <strong>Downvoters</strong> ：此代码仅供参考。

source: <strong>ES20xx</strong> supports spanning strings over multiple lines using <a href="http://www.2ality.com/2011/09/quasi-literals.html">template strings</a>:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES20xx</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> admite cadenas de expansi&oacute;n sobre varias l&iacute;neas utilizando </font></font><a href="http://www.2ality.com/2011/09/quasi-literals.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cadenas de plantilla</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong>ES20xx</strong>は、 <a href="http://www.2ality.com/2011/09/quasi-literals.html">テンプレート文字列</a>を使用して、複数行にわたる文字列の<strong>スパンを</strong>サポートしています 。
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES20xx</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 </font></font><a href="http://www.2ality.com/2011/09/quasi-literals.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 문자열을</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용하여 여러 줄에 걸친 문자열을 지원합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ES20xx</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поддерживает строки с несколькими строками, используя </font></font><a href="http://www.2ality.com/2011/09/quasi-literals.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">строки шаблона</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong>ES20xx</strong>支持使用<a href="http://www.2ality.com/2011/09/quasi-literals.html">模板字符串</a>跨越多行字符串 ：

source: <strong>Refer</strong><a href="http://jsperf.com/zp-string-concatenation/6">this test case</a> for more details regarding the performance
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Consulte </font></font></strong><a href="http://jsperf.com/zp-string-concatenation/6"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este caso de prueba</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener m&aacute;s detalles sobre el rendimiento</font></font>
ja: パフォーマンスに関する詳細については、 <a href="http://jsperf.com/zp-string-concatenation/6">このテストケース</a>を<strong>参照してください</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">참고 </font></font></strong><a href="http://jsperf.com/zp-string-concatenation/6"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 테스트 케이스를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 성능에 대한 자세한 내용은</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратитесь к </font></font></strong><a href="http://jsperf.com/zp-string-concatenation/6"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этому тесту</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для получения более подробной информации о производительности</font></font>
zh_cn: 有关性能的更多详细信息， <strong>请参考</strong> <a href="http://jsperf.com/zp-string-concatenation/6">此测试用例</a>

source: <strong>Updated for 2015</strong>: it's six years later now: most people use a module loader, and the main module systems each have ways of loading templates. It's not inline, but the most common type of multiline string are templates, and <strong>templates should generally be kept out of JS anyway</strong>.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualizado para 2015</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : ahora es seis a&ntilde;os despu&eacute;s: la mayor&iacute;a de las personas usa un cargador de m&oacute;dulos, y los sistemas de m&oacute;dulos principales tienen formas de cargar plantillas. </font><font style="vertical-align: inherit;">No est&aacute; en l&iacute;nea, pero el tipo m&aacute;s com&uacute;n de cadena multil&iacute;nea son las plantillas, y las </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">plantillas generalmente deben mantenerse fuera de JS de todos modos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <strong>2015年に更新</strong> ：それは6年後です。ほとんどの人がモジュールローダーを使用し、メインモジュールシステムにはそれぞれテンプレートをロードする方法があります。 インラインではありませんが、複数行の文字列の最も一般的なタイプはテンプレートであり、 <strong>テンプレートは通常、JSから除外する必要があり</strong>ます。
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2015 년 업데이트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 6 년 후 : 대부분의 사람들은 모듈 로더를 사용하고 기본 모듈 시스템에는 각각 템플릿을로드하는 방법이 있습니다. </font><font style="vertical-align: inherit;">인라인은 아니지만 가장 일반적인 유형의 멀티 라인 문자열은 템플릿이며 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿은 일반적으로 JS 외부에 보관해야합니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обновлен в 2015 году</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : сейчас шесть лет спустя: большинство людей используют загрузчик модулей, и у каждой из основных систем модулей есть способы загрузки шаблонов. </font><font style="vertical-align: inherit;">Он не встроенный, но наиболее распространенным типом многострочных строк являются шаблоны, и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">шаблоны в любом случае должны вообще храниться вне JS</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <strong>2015年更新</strong> ：六年之后：大多数人使用模块加载器，并且每个主模块系统都有加载模板的方式。 它不是内联的，但最常见的多行字符串类型是模板，并且<strong>无论如何</strong> ， <strong>模板通常都应该放在JS之外</strong> 。

source: <strong>Use string concatenation instead:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice la concatenaci&oacute;n de cadenas en su lugar:</font></font></strong>
ja: <strong>代わりに文字列連結を使用してください：</strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신 문자열 연결을 사용하십시오.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вместо этого используйте конкатенацию строк:</font></font></strong>
zh_cn: <strong>请使用字符串串联：</strong>

source: <strong>Using Pure Javascript :</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando Javascript puro:</font></font></strong>
ja: <strong>純粋なJavascriptの使用：</strong>
ko: <strong>순수 자바 스크립트 사용 :</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя Чистый Javascript:</font></font></strong>
zh_cn: <strong>使用纯Javascript：</strong>

source: <strong>Using jQuery</strong> :
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando jQuery</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <strong>jQueryの使用</strong> ：
ko: <strong>jQuery 사용</strong> :
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя jQuery</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <strong>使用jQuery</strong> ：

source: <sup><b>1</b></sup> Note: this will be lost after minifying/obfuscating your code
es: <sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Nota: esto se perder&aacute; despu&eacute;s de minimizar / ofuscar su c&oacute;digo</font></font>
ja: <sup><b>1</b></sup>注：これは、コードを縮小/難読化すると失われます
ko: <sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참고 : 코드 축소 / 난독 화 후에는 손실됩니다</font></font>
ru: <sup><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1</font></font></b></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Примечание: это будет потеряно после минимизации / запутывания вашего кода</font></font>
zh_cn: <sup><b>1</b></sup>注意：缩小/混淆代码后，这将会丢失

source: A template literal is delimited by <em>backticks</em>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una plantilla literal est&aacute; delimitada por </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">comillas invertidas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: テンプレートリテラルは<em>バッククォート</em>で区切られてい<em>ます</em> ：
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">템플릿 리터럴은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">백틱</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 으로 구분됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Литерал шаблона отделяется </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">обратными чертами</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: 模板文字由<em>反引号</em>分隔：

source: After looking at these (opposing) test runs, it looks like .push() is fine for string arrays which will not likely grow over 100 items - I will avoid it in favor of indexed adds for larger arrays.
es: Después de ver estas pruebas (opuestas),parece que .push()está bien para los arreglos de cuerdas que probablemente no crecerán más de 100 artículos-lo evitaré a favor de las adiciones indexadas para arreglos más grandes.
ja: これらの(相反する)テストを見た後、.push()は100個以上のアイテムが増えない文字列配列には問題ないように見えます。
ko: 이러한 (반대되는) 테스트 실행을 살펴본 후 .push ()는 100 개가 넘지 않는 문자열 배열에 적합합니다. 더 큰 배열에 대해서는 인덱스 추가를 선호하지 않습니다.
ru: После просмотра этих (противоположных)тестов,похоже,что .push()подойдет для строковых массивов,которые вряд ли вырастут более чем на 100 элементов-я буду избегать этого в пользу индексированных прибавок для больших массивов.
zh_cn: 在看了这些(相反的)测试运行之后,看起来.push()对于字符串数组来说是没有问题的,因为字符串数组不会增长超过100个项目--我将避免使用它,而对较大的数组使用索引添加。
