Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The Servlet Specification <strong>JSR-315</strong> clearly defines the web container behavior in the service (and doGet, doPost, doPut etc.) methods (2.3.3.1 Multithreading Issues, Page 9):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La especificaci&oacute;n de servlet </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSR-315</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> define claramente el comportamiento del contenedor web en los m&eacute;todos de servicio (y doGet, doPost, doPut, etc.) (2.3.3.1 Problemas de subprocesamiento m&uacute;ltiple, p&aacute;gina 9):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレット仕様</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSR-315</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、サービス（およびdoGet、doPost、doPutなど）メソッドでのWebコンテナの動作を明確に定義しています（2.3.3.1マルチスレッドの問題、9ページ）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 사양 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSR-315</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 서비스 (및 doGet, doPost, doPut 등) 메소드 (2.3.3.1 멀티 스레딩 문제, 페이지 9)에서 웹 컨테이너 동작을 명확하게 정의합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Спецификация </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сервлета JSR-315</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> четко определяет поведение веб-контейнера в методах службы (и doGet, doPost, doPut и т. Д.) (2.3.3.1 Проблемы многопоточности, Страница 9):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Servlet规范</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSR-315</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明确定义了服务（以及doGet，doPost，doPut等）方法中的Web容器行为（2.3.3.1多线程问题，第9页）：</font></font>

source: The request object provides access to all of the information about the HTTP request, such as its URL, headers, query string and body. The response object provides the ability to control and send the HTTP response the way you want by, for instance, allowing you to set the headers and the body (usually with generated HTML content from a JSP file). When the HTTP response is committed and finished, both the request and response objects are recycled and made available for reuse.
es: El objeto de la petición proporciona acceso a toda la información sobre la petición HTTP,como su URL,encabezados,cadena de consulta y cuerpo.El objeto response proporciona la capacidad de controlar y enviar la respuesta HTTP de la forma que se desee,por ejemplo,permitiendo establecer los encabezados y el cuerpo (normalmente con contenido HTML generado desde un archivo JSP).Cuando la respuesta HTTP es confirmada y terminada,tanto el objeto de solicitud como el de respuesta se reciclan y se ponen a disposición para su reutilización.
ja: request オブジェクトは、URL、ヘッダ、クエリ文字列、ボディなどの HTTP リクエストに関するすべての情報へのアクセスを提供します。レスポンスオブジェクトは、例えばヘッダや本文を設定したり (通常は JSP ファイルから生成された HTML コンテンツを使用して)HTTP レスポンスを制御したり送信したりする機能を提供します。HTTP レスポンスがコミットされて終了すると、リクエストオブジェクトとレスポンスオブジェクトの両方がリサイクルされて再利用できるようになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">요청 객체는 URL, 헤더, 쿼리 문자열 및 본문과 같은 HTTP 요청에 대한 모든 정보에 대한 액세스를 제공합니다. </font><font style="vertical-align: inherit;">응답 객체는 원하는 방식으로 HTTP 응답을 제어하고 보낼 수있는 기능을 제공합니다. 예를 들어 헤더 및 본문 (일반적으로 JSP 파일에서 생성 된 HTML 내용으로)을 설정할 수 있습니다. </font><font style="vertical-align: inherit;">HTTP 응답이 커밋되고 완료되면 요청 및 응답 객체가 모두 재활용되고 재사용 할 수있게됩니다.</font></font>
ru: Объект запроса предоставляет доступ ко всей информации о HTTP-запросе,такой как его URL,заголовки,строка запроса и тело.Объект ответа предоставляет возможность управления и отправки ответа HTTP так,как вы хотите,например,позволяя вам установить заголовки и тело (обычно сгенерированный HTML-контент из файла JSP).Когда HTTP ответ зафиксирован и закончен,как запрос и ответ объекты перерабатываются и становятся доступными для повторного использования.
zh_cn: 请求对象提供了对HTTP请求的所有信息的访问,例如URL、头文件、查询字符串和body。响应对象提供了控制和发送HTTP响应的能力,例如,允许你设置标题和正文(通常是用JSP文件中生成的HTML内容)。当HTTP响应被提交并完成后,请求和响应对象都会被回收,并可重复使用。

source: The servlet container is attached to a web server that listens for HTTP requests on a certain port number (port 8080 is usually used during development and port 80 in production). When a client (e.g. user with a web browser, or <a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests">programmatically using <code>URLConnection</code></a>) sends an HTTP request, the servlet container creates new <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"><code>HttpServletRequest</code></a> and <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"><code>HttpServletResponse</code></a> objects and passes them through any defined <code>Filter</code> in the chain and, eventually, the <code>Servlet</code> instance.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El contenedor de servlet est&aacute; conectado a un servidor web que escucha las solicitudes HTTP en un determinado n&uacute;mero de puerto (el puerto 8080 generalmente se usa durante el desarrollo y el puerto 80 en producci&oacute;n). Cuando un cliente (por ejemplo, un usuario con un navegador web o </font></font><a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mediante </font></font> <code>URLConnection</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mediante programaci&oacute;n</font><font style="vertical-align: inherit;"> ) env&iacute;a una solicitud HTTP, el contenedor de servlet crea nuevos </font><font style="vertical-align: inherit;">objetos </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"> <code>HttpServletRequest</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"> <code>HttpServletResponse</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y los pasa a trav&eacute;s de cualquier </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> definido </font><font style="vertical-align: inherit;">en la cadena y, eventualmente, la </font><font style="vertical-align: inherit;">instancia de </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットコンテナは、特定のポート番号でHTTPリクエストをリッスンするWebサーバーに接続されます（通常、ポート8080は開発時に使用され、ポート80は本番環境で使用されます）。クライアント（例えば、ウェブブラウザを持つユーザー、または場合は</font></font><a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、プログラムで使用して</font></font> <code>URLConnection</code> のは</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）HTTPリクエストを送信し、サーブレットコンテナは、新規作成</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"> <code>HttpServletRequest</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">や</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"> <code>HttpServletResponse</code> の</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトを、任意の定義されて渡し</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、最終的には、鎖および</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンスを。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너는 특정 포트 번호에서 HTTP 요청을 수신하는 웹 서버에 연결됩니다 (포트 8080은 일반적으로 개발 중에 사용되고 포트 80은 프로덕션에 사용됨). 클라이언트 (예 : 웹 브라우저 사용자 또는 </font></font><a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그래밍 방식으로 </font></font> <code>URLConnection</code> 을</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 사용</font><font style="vertical-align: inherit;"> 하는 사용자 </font><font style="vertical-align: inherit;">)가 HTTP 요청을 보내면 서블릿 컨테이너는 새 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"> <code>HttpServletRequest</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"> <code>HttpServletResponse</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체를 </font><font style="vertical-align: inherit;">생성 </font><font style="vertical-align: inherit;">하여 체인의 </font><font style="vertical-align: inherit;">정의 된 </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 결국 </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스를 </font><font style="vertical-align: inherit;">통해 전달합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Контейнер сервлета подключен к веб-серверу, который прослушивает HTTP-запросы на определенный номер порта (порт 8080 обычно используется во время разработки, а порт 80 - в работе). Когда клиент (например , </font><font style="vertical-align: inherit;">пользователь с помощью веб - </font><font style="vertical-align: inherit;">браузера, или </font></font><a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">программно с </font><font style="vertical-align: inherit;">помощью </font></font> <code>URLConnection</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) посылает запрос HTTP, контейнер сервлета создает новые </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"> <code>HttpServletRequest</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"> <code>HttpServletResponse</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекты и передает их через какой - </font><font style="vertical-align: inherit;">либо определенный </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в цепи и, в </font><font style="vertical-align: inherit;">конечном счете, к </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> экземпляру.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Servlet容器连接到Web服务器，该Web服务器在某个端口号上侦听HTTP请求（端口8080通常在开发过程中使用，而端口80在生产中使用）。当客户端（例如，使用Web浏览器的用户，或以</font></font><a href="https://stackoverflow.com/questions/2793150/how-to-use-java-net-urlconnection-to-fire-and-handle-http-requests"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编程方式使用</font></font> <code>URLConnection</code> 的用户</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）发送HTTP请求时，Servlet容器将创建新的</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletRequest.html"> <code>HttpServletRequest</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpServletResponse.html"> <code>HttpServletResponse</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象，并将它们通过</font><font style="vertical-align: inherit;">链中</font><font style="vertical-align: inherit;">任何已定义的</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">传递</font><font style="vertical-align: inherit;">，并最终通过</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例。</font></font>

source: This is allows accessing more than one threads at a time
es: Esto permite acceder a más de un hilo a la vez
ja: これにより、一度に複数のスレッドにアクセスすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">한 번에 둘 이상의 스레드에 액세스 할 수 있습니다.</font></font>
ru: Это позволяет получить доступ к нескольким потокам одновременно.
zh_cn: 这是允许同时访问一个以上的线程。

source: Thread Safety
es: Seguridad de los hilos
ja: スレッドの安全性
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레드 안전</font></font>
ru: Безопасность резьбы
zh_cn: 螺纹安全

source: What is the difference between JSF, Servlet and JSP?
es: ¿Cuál es la diferencia entre JSF,Servlet y JSP?
ja: JSF、Servlet、JSPの違いは何ですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSF, Servlet 및 JSP의 차이점은 무엇입니까?</font></font>
ru: В чем разница между JSF,Серветом и JSP?
zh_cn: JSF、Servlet和JSP有什么区别?
