Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>Step 3</strong>: if ID available brand new session object is not created session ID is picked up from the request object search is made in the collection of sessions by using session ID as the key.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Paso 3</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : si no se crea la ID disponible, el nuevo objeto de sesi&oacute;n no se crea La ID de sesi&oacute;n se recoge de la solicitud de b&uacute;squeda de objetos que se realiza en la colecci&oacute;n de sesiones utilizando la ID de sesi&oacute;n como clave.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ3</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：IDが使用可能な新しいセッションオブジェクトが作成されていない場合、リクエストからセッションIDが取得されます。オブジェクトの検索は、セッションIDをキーとして使用して、セッションのコレクションで行われます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3 단계</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 사용 가능한 ID의 새 세션 오브젝트가 작성되지 않은 경우 세션 ID를 키로 사용하여 세션 콜렉션에서 요청 오브젝트 검색이 수행됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 3</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : если идентификатор доступен, новый объект сеанса не создан. Идентификатор сеанса выбирается из запроса. Поиск объекта производится в коллекции сеансов с использованием идентификатора сеанса в качестве ключа.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">步骤3</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：如果未创建ID可用的全新会话对象，则使用会话ID作为关键字，从请求对象中检索会话ID，以在会话集合中进行搜索。</font></font>

source: <strong>if u want to make it Servlet as Thread safe ., U can go for</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">si quieres que sea Servlet como Thread safe., U puedes elegir</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットをスレッドセーフにしたい場合、Uは</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">U를 스레드 안전으로 서블릿으로 만들고 싶다면 U는</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">если вы хотите сделать его Servlet как потокобезопасным., вы можете пойти на</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果您想使其Servlet作为线程安全。，您可以选择</font></font></strong>

source: A servlet container may send concurrent requests through the service method of the servlet. To handle the requests, the Servlet Developer must make adequate provisions for concurrent processing with multiple threads in the service method.
es: Un contenedor de servlets puede enviar solicitudes simultáneas a través del método de servicio del servlet.Para manejar las solicitudes,el desarrollador del servlet debe tomar las medidas adecuadas para el procesamiento simultáneo con múltiples hilos en el método de servicio.
ja: サーブレットコンテナは、サーブレットのサービスメソッドを通じて同時リクエストを送信することができます。リクエストを処理するために、サーブレット開発者は、サービスメソッドで複数のスレッドを使用した同時処理のための適切な規定を作らなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너는 서블릿의 서비스 메소드를 통해 동시 요청을 보낼 수 있습니다. </font><font style="vertical-align: inherit;">요청을 처리하려면 서블릿 개발자는 서비스 메소드에서 여러 스레드로 동시 처리를 위해 적절한 프로비저닝을해야합니다.</font></font>
ru: Контейнер сервлета может посылать одновременные запросы через сервисный метод сервлета.Для обработки запросов Разработчик сервлета должен создать соответствующие условия для одновременной обработки с несколькими потоками в методе обслуживания.
zh_cn: 一个servlet容器可以通过servlet的服务方法发送并发请求。为了处理这些请求,Servlet开发者必须为服务方法中的多线程并发处理做足够的规定。

source: A servlet is created when the application starts (it is deployed on the servlet container) or when it is first accessed (depending on the load-on-startup setting) when the servlet is instantiated, the init() method of the servlet is called then the servlet (its one and only instance) handles all requests (its service() method being called by multiple threads). That's why it is not advisable to have any synchronization in it, and you should avoid instance variables of the servlet when the application is undeployed (the servlet container stops), the destroy() method is called.
es: Un servlet se crea cuando la aplicación se inicia (se despliega en el contenedor de servlets)o cuando se accede a él por primera vez (dependiendo de la configuración de carga en el inicio)cuando el servlet se instancia,el método init()del servlet es llamado entonces el servlet (su única instancia)maneja todas las peticiones (su método service()es llamado por múltiples hilos).Por eso no es aconsejable tener ninguna sincronización en él,y debes evitar las variables de instancia del servlet cuando la aplicación no está desplegada (el contenedor del servlet se detiene),se llama al método destroy().
ja: サーブレットはアプリケーションの起動時(サーブレットコンテナ上にデプロイされます)または最初にアクセスされた時(ロードオンスタートアップの設定に依存します)に作成され、サーブレットがインスタンス化されると、サーブレットのinit()メソッドが呼び出され、サーブレット(その唯一のインスタンス)がすべてのリクエストを処理します(そのservice()メソッドは複数のスレッドから呼び出されます)。アプリケーションがアンデプロイされたとき(サーブレットコンテナが停止したとき)、destroy()メソッドが呼ばれたとき、サーブレットのインスタンス変数は避けるべきです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿은 애플리케이션이 시작될 때 (서블릿 컨테이너에 배치됨) 또는 서블릿이 인스턴스화 될 때 처음 시작 (로드시 설정에 따라) 액세스 될 때 작성됩니다. 서블릿의 init () 메소드가 호출됩니다. 그런 다음 서블릿 (하나의 유일한 인스턴스)은 모든 요청 (여러 스레드가 호출하는 service () 메소드)을 처리합니다. </font><font style="vertical-align: inherit;">그렇기 때문에 동기화가 바람직하지 않으며 애플리케이션이 배포 취소 될 때 (서블릿 컨테이너가 중지 된 경우) destroy () 메소드가 호출 될 때 서블릿의 인스턴스 변수를 피해야합니다.</font></font>
ru: Сервлет создаётся при запуске приложения (развертывается на контейнере сервлета)или при первом обращении к нему (в зависимости от настройки загрузки при запуске)при инициализации сервлета,при вызове метода init()сервлета,после чего сервлет (его единственный экземпляр)обрабатывает все запросы (его метод service()вызывается несколькими потоками).Поэтому не рекомендуется иметь в нём синхронизацию,и следует избегать переменных экземпляра сервлета,когда приложение неразвернуто (контейнер сервлета останавливается),вызывается метод destroy().
zh_cn: 一个servlet是在应用程序启动时创建的(它被部署在servlet容器上)或第一次访问时(取决于load-on-startup设置),当servlet被实例化时,servlet的init()方法被调用,然后servlet(它的唯一实例)处理所有请求(它的service()方法被多个线程调用)。这就是为什么不建议在里面有任何同步的原因,当应用程序未部署时(servlet容器停止),destroy()方法被调用时,你应该避免servlet的实例变量。

source: A)only once (for every client request a new thread is created) only one instance of the servlet serves any number of the client request ie, after serving one client request server does not die. It waits for other client requests ie what CGI (for every client request a new process is created) limitation is overcome with the servlet (internally servlet engine creates the thread).
es: A)sólo una vez (por cada solicitud de cliente se crea un nuevo hilo)sólo una instancia del servlet sirve cualquier número de la solicitud del cliente,es decir,después de servir un servidor de solicitudes de cliente no muere.Espera a otras peticiones del cliente,es decir,qué limitación de CGI (por cada petición del cliente se crea un nuevo proceso)se supera con el servlet (internamente el motor del servlet crea el hilo).
ja: A)一度だけ (クライアントのリクエストごとに新しいスレッドが作成されます)サーブレットの一つのインスタンスだけがクライアントのリクエストに何度でも対応することができます、つまり、一つのクライアントのリクエストに対応した後、サーバーが死ぬことはありません。それは他のクライアントのリクエストを待ちます。つまり、CGI (クライアントのリクエストごとに新しいプロセスが生成されます)の制限はサーブレットで克服されます (内部的にサーブレットエンジンがスレッドを生成します)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) 한 번만 (모든 클라이언트 요청에 대해 새 스레드가 작성 됨) 하나의 서블릿 인스턴스 만 클라이언트 요청을 처리합니다 (즉, 하나의 클라이언트 요청 서버를 제공 한 후에도 죽지 않음). </font><font style="vertical-align: inherit;">서블릿 (내부 서블릿 엔진이 스레드를 작성 함)을 사용하여 다른 클라이언트 요청, 즉 CGI (모든 클라이언트 요청에 대해 새 프로세스가 작성 됨) 한계를 극복합니다.</font></font>
ru: A)только один раз (для каждого запроса клиента создается новый поток)только один экземпляр сервлета обслуживает любое количество запросов клиента,т.е.после обслуживания одного запроса клиента сервер не умирает.Он ждет других клиентских запросов,т.е.то,какое ограничение CGI (для каждого запроса клиента создается новый процесс)преодолевается сервлетом (внутренний механизм сервлетов создает поток).
zh_cn: A)只有一次(每一个客户端请求创建一个新的线程),只有一个servlet实例服务于任意数量的客户端请求,即服务于一个客户端请求后,服务器不会死。它等待其他的客户端请求,也就是CGI(每一个客户端请求一个新的进程被创建一个新的线程)的限制是用servlet克服的(内部servlet引擎创建线程)。

source: A)whenever getSession() is called on HttpServletRequest object
es: A)cuando getSession()es llamado en el objeto HttpServletRequest
ja: A)HttpServletRequest オブジェクトで getSession()が呼び出されるたびに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A) getSession ()이 HttpServletRequest 객체에서 호출 될 때마다</font></font>
ru: A)при каждом вызове getSession()на объекте HttpServletRequest
zh_cn: A)每当在HttpServletRequest对象上调用getSession()时

source: All <code>Servlet</code>, <code>Filter</code> and <code>Listener</code> instances live as long as the web app lives. They are shared among <em>all</em> requests in <em>all</em> sessions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Todas las </font><font style="vertical-align: inherit;">instancias de </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> viven mientras dure la aplicaci&oacute;n web. </font><font style="vertical-align: inherit;">Se comparten entre </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solicitudes en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sesiones.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンスは、Webアプリが存続している限り存続します。</font><font style="vertical-align: inherit;">それらは</font><em><font style="vertical-align: inherit;">すべての</font></em><font style="vertical-align: inherit;">セッションの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リクエストで</font><font style="vertical-align: inherit;">共有され</font><font style="vertical-align: inherit;">ます。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든 </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스는 웹 앱이 존재하는 한 지속됩니다. </font><font style="vertical-align: inherit;">그들은 공유됩니다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모두</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 요청 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하는 모든</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 세션.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Все </font><font style="vertical-align: inherit;">экземпляры </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> живут до тех пор, пока работает веб-приложение. </font><font style="vertical-align: inherit;">Они распределяются между </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всеми</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> запросами во </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всех</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сеансах.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只要Web应用程序存在</font><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">所有</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例都存在。</font><font style="vertical-align: inherit;">它们</font><font style="vertical-align: inherit;">在</font><em><font style="vertical-align: inherit;">所有</font></em><font style="vertical-align: inherit;">会话的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请求</font><font style="vertical-align: inherit;">之间共享</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: Although it is not recommended, an alternative for the Developer is to implement the SingleThreadModel interface which requires the container to guarantee that there is only one request thread at a time in the service method. A servlet container may satisfy this requirement by serializing requests on a servlet, or by maintaining a pool of servlet instances. If the servlet is part of a Web application that has been marked as distributable, the container may maintain a pool of servlet instances in each JVM that the application is distributed across.
es: Aunque no es recomendable,una alternativa para el desarrollador es implementar la interfaz SingleThreadModel,que requiere que el contenedor garantice que sólo hay un hilo de solicitud a la vez en el método de servicio.Un contenedor de servlets puede satisfacer este requisito mediante la serialización de las solicitudes en un servlet,o mediante el mantenimiento de un conjunto de instancias de servlets.Si el servlet forma parte de una aplicación Web que ha sido marcada como distribuible,el contenedor puede mantener un pool de instancias de servlet en cada JVM en la que se distribuye la aplicación.
ja: 推奨されていませんが、開発者にとっての代替手段は SingleThreadModel インターフェイスを実装することです。サーブレットコンテナは、サーブレット上でリクエストをシリアライズするか、サーブレットインスタンスのプールを維持することで、この要件を満たすことができます。サーブレットが配布可能とマークされている Web アプリケーションの一部である場合、コンテナはアプリケーションが分散されている各 JVM 内でサーブレットインスタンスのプールを維持することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">권장되지는 않지만 개발자의 대안은 서비스 메소드에 한 번에 하나의 요청 스레드 만 있음을 보장하기 위해 컨테이너가 필요한 SingleThreadModel 인터페이스를 구현하는 것입니다. 서블릿 컨테이너는 서블릿에서 요청을 직렬화하거나 서블릿 인스턴스 풀을 유지함으로써이 요구 사항을 충족시킬 수 있습니다. 서블릿이 분배 가능으로 표시된 웹 애플리케이션의 일부인 경우 컨테이너는 애플리케이션이 분배되는 각 JVM에서 서블릿 인스턴스 풀을 유지할 수 있습니다.</font></font>
ru: Хотя это не рекомендуется,альтернативой для Разработчика является реализация SingleThreadModel интерфейс,который требует контейнера,чтобы гарантировать,что только один поток запросов за один раз в метод обслуживания.Контейнер сервлетов может удовлетворить это требование путем сериализации запросов на сервлет или путем поддержания пула экземпляров сервлетов.Если сервлет является частью веб-приложения,которое помечено как дистрибутивное,контейнер может поддерживать пул экземпляров сервлетов в каждом JVM,через который распространяется приложение.
zh_cn: 虽然不建议使用,但对于开发者来说,另一种方法是实现SingleThreadModel接口,该接口要求容器保证服务方法中每次只有一个请求线程。一个servlet容器可以通过在servlet上序列化请求,或者通过维护一个servlet实例池来满足这个要求。如果servlet是已被标记为可分发的Web应用程序的一部分,那么容器可以在每个JVM中维护一个servlet实例池,该应用程序被分发到每个JVM中。

source: Any <code>attribute</code> that is defined in <code>ServletContext</code>, <code>HttpServletRequest</code> and <code>HttpSession</code> will live as long as the object in question lives. The object itself represents the "scope" in bean management frameworks such as JSF, CDI, Spring, etc. Those frameworks store their scoped beans as an <code>attribute</code> of its closest matching scope.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cualquier </font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se define en </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> vivir&aacute; mientras viva el objeto en cuesti&oacute;n. El objeto en s&iacute; mismo representa el "alcance" en los marcos de gesti&oacute;n de beans como JSF, CDI, Spring, etc. Esos marcos almacenan sus beans de &aacute;mbito como un </font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de su &aacute;mbito de coincidencia m&aacute;s cercano.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">任意の</font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に定義されている</font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>HttpServletRequest</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">質問の生活の中で対象限り生き続けます。オブジェクト自体は、JSF、CDI、SpringなどのBean管理フレームワークの「スコープ」を表します。これらのフレームワークは、スコープが</font><font style="vertical-align: inherit;">一致する</font><font style="vertical-align: inherit;">Beanを、</font><font style="vertical-align: inherit;">最も近いスコープの</font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として格納し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"> <code>ServletContext</code> <font style="vertical-align: inherit;"> , </font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"> 및 </font> <code>HttpSession</code> 에<font style="vertical-align: inherit;"> 정의 된 </font><font style="vertical-align: inherit;">모든 </font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font><font style="vertical-align: inherit;">해당 오브젝트가 존재하는 한 지속됩니다. </font><font style="vertical-align: inherit;">오브젝트 자체는 JSF, CDI, Spring 등과 같은 Bean 관리 프레임 워크에서 "범위"를 나타냅니다. 이러한 프레임 워크는 범위가 지정된 Bean을 </font><font style="vertical-align: inherit;">가장 일치하는 범위 </font><font style="vertical-align: inherit;">의 </font> <code>attribute</code> <font style="vertical-align: inherit;"> 으로 저장합니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Любой </font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , определенный в </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>HttpSession</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет существовать до тех пор, пока действует рассматриваемый объект. Сам объект представляет &laquo;область действия&raquo; в инфраструктурах управления bean-компонентами, таких как JSF, CDI, Spring и т. Д. Эти структуры хранят свои bean-объекты области видимости как </font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> своей ближайшей соответствующей области.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">只要有问题的对象存在，</font><font style="vertical-align: inherit;">在</font> <code>ServletContext</code> <font style="vertical-align: inherit;">，</font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;">和</font> <code>HttpSession</code> 中<font style="vertical-align: inherit;">定义的</font><font style="vertical-align: inherit;">任何</font></font> <code>attribute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都</font><font style="vertical-align: inherit;">将存在。对象本身代表了诸如JSF，CDI，Spring等之类的bean管理框架中的&ldquo;作用域&rdquo;。那些框架将其范围内的bean存储</font><font style="vertical-align: inherit;">为其最匹配范围</font><font style="vertical-align: inherit;">的</font> <code>attribute</code> <font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
