Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: When a <code>Servlet</code> has a <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> or <code>@WebServlet(loadOnStartup)</code> value greater than <code>0</code>, then its <code>init()</code> method is also invoked during startup with a new <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"><code>ServletConfig</code></a>. Those servlets are initialized in the same order specified by that value (<code>1</code> is 1st, <code>2</code> is 2nd, etc). If the same value is specified for more than one servlet, then each of those servlets is loaded in the same order as they appear in the <code>web.xml</code>, <code>web-fragment.xml</code>, or <code>@WebServlet</code> classloading. In the event the "load-on-startup" value is absent, the <code>init()</code> method will be invoked whenever the HTTP request hits that servlet for the very first time.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando un </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene un valor </font></font> <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>@WebServlet(loadOnStartup)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mayor que </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , entonces su </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tambi&eacute;n se invoca durante el inicio con un nuevo </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"> <code>ServletConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Esos servlets se inicializan en el mismo orden especificado por ese valor ( </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el primero, </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el segundo, etc.). Si se especifica el mismo valor para m&aacute;s de un servlet, cada uno de esos servlets se carga en el mismo orden en que aparecen en </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> classloading. En el caso de que el valor "load-on-startup" est&eacute; ausente, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Se invocar&aacute; el m&eacute;todo cada vez que la solicitud HTTP llegue a ese servlet por primera vez.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有する</font></font> <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>@WebServlet(loadOnStartup)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よりも大きい値</font></font> <code>0</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、その</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドは、新しいとの起動時に呼び出される</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"> <code>ServletConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。それらのサーブレットは、その値で指定されたのと同じ順序で初期化されます（</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が1番目、</font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が2番目など）。複数のサーブレットに同じ値が指定されている場合、それらのサーブレットはそれぞれ、</font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、または</font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラス</font><font style="vertical-align: inherit;">ローディング</font><font style="vertical-align: inherit;">に表示されるのと同じ順序でロードされます</font><font style="vertical-align: inherit;">。 「load-on-startup」値が存在しない場合、</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> メソッドは、HTTPリクエストがそのサーブレットに初めて当たるたびに呼び出されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">때 </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 갖는 </font></font> <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>@WebServlet(loadOnStartup)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 보다 큰 값 </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다음의, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드와 같은 새로운 시작시 호출 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"> <code>ServletConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . 해당 서블릿은 해당 값으로 지정된 순서대로 초기화됩니다 ( </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 1, </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 2 등). 둘 이상의 서블릿에 대해 동일한 값이 지정되면 해당 서블릿 각각은 </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 클래스 </font><font style="vertical-align: inherit;">로딩과 동일한 순서로 </font><font style="vertical-align: inherit;">로드됩니다. "start-on-startup"값이 없으면 </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> HTTP 요청이 해당 서블릿에 처음으로 도달 할 때마다 메소드가 호출됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет </font></font> <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>@WebServlet(loadOnStartup)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> большее значение , </font><font style="vertical-align: inherit;">чем </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то его </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> метод также вызывается при запуске с новым </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"> <code>ServletConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Эти сервлеты инициализируются в том же порядке, который указан в этом значении ( </font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 1, </font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - 2 и т. Д.). Если одно и то же значение указано для нескольких сервлетов, то каждый из этих сервлетов загружается в том же порядке, в котором они отображаются в </font> <code>@WebServlet</code> <font style="vertical-align: inherit;"> классов </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@WebServlet</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Если значение &laquo;загрузка при запуске&raquo; отсутствует, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Метод будет вызываться всякий раз, когда HTTP-запрос попадает в этот сервлет в первый раз.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font> <code>&lt;servlet&gt;&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>@WebServlet(loadOnStartup)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值大于</font></font> <code>0</code> 时<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它的</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法也会在启动期间使用新的</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletConfig.html"> <code>ServletConfig</code> 进行</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用</font><font style="vertical-align: inherit;">。这些Servlet会以该值指定的相同顺序进行初始化（</font></font> <code>1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为1st，</font></font> <code>2</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为2nd，依此类推）。如果为多个servlet指定了相同的值，则将按与出现在</font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类</font><font style="vertical-align: inherit;">加载中的顺序相同的顺序加载每个servlet </font><font style="vertical-align: inherit;">。如果没有&ldquo;启动时加载&rdquo;值，则</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 每当HTTP请求首次点击该servlet时，就会调用方法。</font></font>

source: When a client visits the webapp for the first time and/or the <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"><code>HttpSession</code></a> is obtained for the first time via <code>request.getSession()</code>, the servlet container creates a new <code>HttpSession</code> object, generates a long and unique ID (which you can get by <code>session.getId()</code>), and stores it in the server's memory. The servlet container also sets a <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"><code>Cookie</code></a> in the <code>Set-Cookie</code> header of the HTTP response with <code>JSESSIONID</code> as its name and the unique session ID as its value.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando un cliente visita la aplicaci&oacute;n web por primera vez y / o </font><font style="vertical-align: inherit;">se obtiene </font><font style="vertical-align: inherit;">la </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"> <code>HttpSession</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> por primera vez a trav&eacute;s de </font></font> <code>request.getSession()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el contenedor de servlet crea un nuevo </font><font style="vertical-align: inherit;">objeto </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , genera un ID largo y &uacute;nico (que puede obtener por </font></font> <code>session.getId()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), y lo almacena en la memoria del servidor. El contenedor de servlet tambi&eacute;n establece una </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"> <code>Cookie</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el </font><font style="vertical-align: inherit;">encabezado </font></font> <code>Set-Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la respuesta HTTP con </font></font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como su nombre y la ID de sesi&oacute;n &uacute;nica como su valor.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クライアントが初めてwebappに</font><font style="vertical-align: inherit;">アクセスする</font><font style="vertical-align: inherit;">とき、および/または</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"> <code>HttpSession</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font></font> <code>request.getSession()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を介して初めて取得されるとき</font><font style="vertical-align: inherit;">、サーブレットコンテナは新しい</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトを作成し、長く一意のID（</font></font> <code>session.getId()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">取得できます）を生成します</font><font style="vertical-align: inherit;">.getId（）</font><font style="vertical-align: inherit;">）、サーバーのメモリに保存します。また、サーブレットコンテナ</font><font style="vertical-align: inherit;">は、HTTP応答</font><font style="vertical-align: inherit;">の</font> <code>Set-Cookie</code> <font style="vertical-align: inherit;">ヘッダーに</font> <code>JSESSIONID</code> <font style="vertical-align: inherit;">を名前として、一意のセッションIDを値として</font><font style="vertical-align: inherit;">、</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"> <code>Cookie</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設定</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트가 처음으로 webapp를 방문하거나 </font> <code>request.getSession()</code> <font style="vertical-align: inherit;"> 통해 처음으로 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"> <code>HttpSession</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 얻는 </font><font style="vertical-align: inherit;">경우, 서블릿 컨테이너는 새 </font> <code>HttpSession</code> <font style="vertical-align: inherit;"> 객체를 생성하고 길고 고유 한 ID를 생성합니다 ( </font> <code>session.getId()</code> <font style="vertical-align: inherit;"> 별로 얻을 수 있음) </font><font style="vertical-align: inherit;">.getId ()</font><font style="vertical-align: inherit;"> )를 서버의 메모리에 저장합니다. 서블릿 컨테이너는 또한 설정 </font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"> <code>Cookie</code> </a><font style="vertical-align: inherit;"> 에서 </font> <code>Set-Cookie</code> <font style="vertical-align: inherit;"> 와 HTTP 응답의 헤더 </font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"> 의 이름과 값으로 고유 한 세션 ID 등을.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда клиент посещает веб-приложение в первый раз и / или </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"> <code>HttpSession</code> впервые</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> получается с помощью </font></font> <code>request.getSession()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , контейнер сервлета создает новый </font><font style="vertical-align: inherit;">объект </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , генерирует длинный и уникальный идентификатор (который можно получить с помощью </font></font> <code>session.getId()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) и сохраняет его в памяти сервера. Контейнер сервлета также устанавливает </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"> <code>Cookie</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font><font style="vertical-align: inherit;">заголовке </font></font> <code>Set-Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ответа HTTP с </font></font> <code>JSESSIONID</code> в<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> качестве имени и уникальным идентификатором сеанса в качестве значения.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当客户端首次访问Web应用程序和/或</font><font style="vertical-align: inherit;">通过</font> <code>request.getSession()</code> <font style="vertical-align: inherit;">首次获取</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/HttpSession.html"> <code>HttpSession</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">时</font><font style="vertical-align: inherit;">，servlet容器将创建一个新的</font> <code>HttpSession</code> <font style="vertical-align: inherit;">对象，并生成一个长而唯一的ID（您可以通过</font> <code>session.getId()</code> <font style="vertical-align: inherit;">获取该ID）</font><font style="vertical-align: inherit;">.getId（）</font><font style="vertical-align: inherit;">），并将其存储在服务器的内存中。 servlet容器还设置</font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/http/Cookie.html"> <code>Cookie</code> </a><font style="vertical-align: inherit;">中</font> <code>Set-Cookie</code> <font style="vertical-align: inherit;">与HTTP响应的报头</font> <code>JSESSIONID</code> <font style="vertical-align: inherit;">正如它的名字和作为其值的唯一会话ID。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
