Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: 1) Serializing requests (queuing) to a single instance - this is similar to a servlet NOT implementing SingleThreadModel BUT synchronizing the service/ doXXX methods; OR
es: 1)Serializar las peticiones (hacer cola)a una sola instancia-esto es similar a un servlet que NO implementa SingleThreadModel SINO que sincroniza los métodos del servicio doXXX;O
ja: 1)リクエスト (キューイング)を単一のインスタンスにシリアライズする-これはサーブレットが SingleThreadModel を実装していないが、サービスの doXXX メソッドを同期させているのと似ています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) 단일 인스턴스로 요청을 직렬화 (큐잉)-이는 서비스 / doXXX 메소드를 동기화하는 SingleThreadModel BUT을 구현하지 않는 서블릿과 유사합니다. </font><font style="vertical-align: inherit;">또는</font></font>
ru: 1)Сериализация запросов (постановка в очередь)к одному экземпляру-это похоже на сервлет,НЕ реализующий SingleThreadModel,НО синхронизирующий методы службы doXXX;ИЛИ
zh_cn: 1)将请求(队列)序列化为一个实例--这类似于servlet不实现SingleThreadModel,但同步服务doXXX方法;或

source: 1)when control leaves from servlet code to client don't forget that session object is being held by servlet container ie, the servlet engine
es: 1)Cuando el control sale del código de servlet al cliente,no olvides que el objeto de la sesión está siendo retenido por el contenedor de servlet,es decir,el motor de servlet.
ja: 1)サーブレットコードからクライアントに制御が移るとき、セッションオブジェクトがサーブレットコンテナ、つまりサーブレットエンジンによって保持されていることを忘れないでください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) 제어가 서블릿 코드에서 클라이언트로 떠날 때 세션 오브젝트가 서블릿 컨테이너, 즉 서블릿 엔진에 의해 유지되고 있음을 잊지 않습니다</font></font>
ru: 1)когда управление уходит от кода сервлета к клиенту,не забывайте,что объект сеанса удерживается контейнером сервлета,т.е.сервлетным двигателем
zh_cn: 1)当控件从servlet代码离开到客户端时,不要忘记servlet容器,即servlet引擎所持有的session对象。

source: 1: context information
es: 1:información de contexto
ja: 1:コンテキスト情報
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 : 상황 정보</font></font>
ru: 1:контекстная информация
zh_cn: 1:背景信息

source: 2) Creating a pool of instances - which's a better option and a trade-off between the boot-up/initialization effort/time of the servlet as against the restrictive parameters (memory/ CPU time) of the environment hosting the servlet.
es: 2)Crear un pool de instancias-que es una mejor opción y un compromiso entre el tiempo de esfuerzo de arranque del servlet frente a los parámetros restrictivos (tiempo de CPU de la memoria)del entorno que alberga el servlet.
ja: 2)インスタンスのプールを作成する-サーブレットをホストしている環境の制限的なパラメータ(メモリCPU時間)に対して、サーブレットの起動初期化の効率との間で、どちらが良いオプションであり、トレードオフになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) 인스턴스 풀 생성-서블릿을 호스팅하는 환경의 제한 매개 변수 (메모리 / CPU 시간)와 비교하여 서블릿의 부팅 / 초기화 노력 / 시간 사이의 트레이드 오프와 더 나은 옵션입니다.</font></font>
ru: 2)Создание пула экземпляров-лучший вариант и компромисс между временем загрузки и инициализации сервлета и ограничительными параметрами (процессорным временем памяти)среды,в которой хостинг сервлета.
zh_cn: 2)创建一个实例池--这是一个比较好的选择,也是对servlet的启动初始化时间与承载servlet的环境的限制性参数(内存CPU时间)的权衡。

source: 2)multithreading is left to servlet developers people for implementing ie., handle the multiple requests of client nothing to bother about multithread code
es: 2)el multihilo se deja a la gente de los desarrolladores de servlets para implementar,es decir,manejar las múltiples solicitudes del cliente sin preocuparse por el código del multihilo
ja: 2)マルチスレッドはサーブレットの開発者に実装を任せる。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) 멀티 스레딩은 구현을 위해 서블릿 개발자들에게 맡겨져 있습니다. 즉, 멀티 스레드 코드에 대해 신경 쓰지 않아도 클라이언트의 여러 요청을 처리하지 않습니다.</font></font>
ru: 2)многопоточность остаётся на усмотрение сервлет-разработчиков для реализации,т.е.,обрабатывать многочисленные запросы клиента нечего беспокоиться о многопоточности кода
zh_cn: 2)多线程是留给servlet开发者们去实现的,即处理客户端的多个请求的多线程代码,无需理会多线程的代码

source: 2: initial configuration information
es: 2:información de configuración inicial
ja: 2:初期設定情報
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 : 초기 구성 정보</font></font>
ru: 2:информация о первоначальной конфигурации
zh_cn: 2:初始配置信息

source: <code>Implement SingleThreadInterface(i)</code> which is a blank Interface there is no
es: <code>Implement SingleThreadInterface(i)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que es una interfaz en blanco, no hay</font></font>
ja: <code>Implement SingleThreadInterface(i)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 空白のインターフェースである</font><font style="vertical-align: inherit;">SingleThreadInterface（i）</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">実装する</font></font>
ko: <code>Implement SingleThreadInterface(i)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 빈 인터페이스 인 </font><font style="vertical-align: inherit;">SingleThreadInterface (i) 구현</font></font>
ru: <code>Implement SingleThreadInterface(i)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> который является пустым интерфейсом там нет</font></font>
zh_cn: <code>Implement SingleThreadInterface(i)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 这是一个空白接口，没有</font></font>

source: <strong>Edit</strong> There is an excellent tutorial <a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html">here</a> on how to work with session inside of servlets. And <a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html">here</a> is a chapter from Sun about Java Servlets, what they are and how to use them. Between those two articles, you should be able to answer all of your questions.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Editar</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Hay un excelente tutorial </font></font><a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sobre c&oacute;mo trabajar con la sesi&oacute;n dentro de los servlets. </font><font style="vertical-align: inherit;">Y </font></font><a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hay un cap&iacute;tulo de Sun sobre Java Servlets, qu&eacute; son y c&oacute;mo usarlos. </font><font style="vertical-align: inherit;">Entre esos dos art&iacute;culos, deber&iacute;a poder responder a todas sus preguntas.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">編集</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">優れたチュートリアルがあり</font></font><a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、ここで</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットのセッション内部で作業する方法については。</font><font style="vertical-align: inherit;">そして、</font></font><a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここでの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Javaの彼らが何であるか、サーブレット、およびその使用方法に関する日から章があります。</font><font style="vertical-align: inherit;">これらの2つの記事の間に、すべての質問に答えられるはずです。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 </font></font></strong><font style="vertical-align: inherit;"></font><a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서블릿 내부에서 세션을 다루는 방법에 </font><font style="vertical-align: inherit;">대한 훌륭한 튜토리얼이 </font><font style="vertical-align: inherit;">있습니다</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">그리고 </font></font><a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그들이 및 사용 방법에 어떤 자바 서블릿에 대한 썬의 장이다. </font><font style="vertical-align: inherit;">이 두 기사 사이에서 모든 질문에 대답 할 수 있어야합니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Edit</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Существует отличный учебник </font></font><a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> о том , </font><font style="vertical-align: inherit;">как работать с сеансом внутри сервлет. </font><font style="vertical-align: inherit;">И </font></font><a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вот</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> глава от Sun о Java-сервлетах, что они из себя представляют и как их использовать. </font><font style="vertical-align: inherit;">Между этими двумя статьями вы должны быть в состоянии ответить на все ваши вопросы.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编辑</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里有一个很棒的教程</font></font><a href="http://www.apl.jhu.edu/~hall/java/Servlet-Tutorial/Servlet-Tutorial-Session-Tracking.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">介绍如何在servlet内部使用会话。</font><font style="vertical-align: inherit;">而</font></font><a href="http://docs.oracle.com/javaee/5/tutorial/doc/bnafd.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这里</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是来自Sun关于Java Servlet的，它们是什么，以及如何使用它们的一章。</font><font style="vertical-align: inherit;">在这两篇文章之间，您应该能够回答所有问题。</font></font>

source: <strong>Instantiation</strong> - a servlet is instantiated when the container receives the first request mapped to the servlet (unless the servlet is configured to load on startup with the <code>&lt;load-on-startup&gt;</code> element in <code>web.xml</code>). The same instance is used to serve subsequent requests.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Instanciaci&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : se </font><strong><font style="vertical-align: inherit;">crea</font></strong><font style="vertical-align: inherit;"> una </font><strong><font style="vertical-align: inherit;">instancia de</font></strong><font style="vertical-align: inherit;"> un servlet cuando el contenedor recibe la primera solicitud asignada al servlet (a menos que el servlet est&eacute; configurado para cargarse al inicio con el elemento </font></font> <code>&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">La misma instancia se utiliza para atender solicitudes posteriores.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンス化</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -サーブレットは、サーブレットが（サーブレットが</font> <code>web.xml</code> <font style="vertical-align: inherit;">の</font></font> <code>&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">要素で</font><font style="vertical-align: inherit;">起動時</font><font style="vertical-align: inherit;">にロードするように構成されていない限り）サーブレットにマップされた最初のリクエストを受信するとインスタンス化されます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">同じインスタンスを使用して、後続のリクエストを処理します。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인스턴스화</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -서블릿은 컨테이너가 서블릿에 맵핑 된 첫 번째 요청을 수신 할 때 인스턴스화됩니다 (서블릿이 </font></font> <code>&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font><font style="vertical-align: inherit;">&lt;load-on-startup&gt;</font><font style="vertical-align: inherit;"> 요소 </font><font style="vertical-align: inherit;">로로드되도록 구성되지 않은 경우 </font><font style="vertical-align: inherit;">). </font><font style="vertical-align: inherit;">후속 요청을 처리하는 데 동일한 인스턴스가 사용됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Instantiation</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - сервлет создается, когда контейнер получает первый запрос, сопоставленный с сервлетом (если сервлет не настроен для загрузки при запуске с </font><font style="vertical-align: inherit;">элементом </font></font> <code>&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Этот же экземпляр используется для обслуживания последующих запросов.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例化</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -当容器接收到映射到该servlet的第一个请求时，将实例化servlet（除非servlet被配置为使用</font> <code>web.xml</code> 中<font style="vertical-align: inherit;">的</font></font> <code>&lt;load-on-startup&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">元素在</font><font style="vertical-align: inherit;">启动时加载</font><font style="vertical-align: inherit;">）。</font><font style="vertical-align: inherit;">相同的实例用于处理后续请求。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: <strong>No.</strong> Servlets are <strong>not Thread safe</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No. Los</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> servlets </font><strong><font style="vertical-align: inherit;">no</font></strong><font style="vertical-align: inherit;"> son </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">seguros para los hilos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">いいえ。</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットは</font><strong><font style="vertical-align: inherit;">スレッドセーフで</font></strong><font style="vertical-align: inherit;">はあり</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ません</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">제</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서블릿은되어 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레드로부터 안전하지 않습니다</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нет.</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Сервлеты </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не безопасны</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">否</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。Servlet </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不是线程安全的</font></font></strong>

source: <strong>Sessions</strong> - what Chris Thompson said.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sesiones</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : lo que dijo Chris Thompson.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッション</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -クリス・トンプソンが言ったこと。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세션</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -크리스 톰슨의 말.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сессии</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - что сказал Крис Томпсон.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">会议</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> -克里斯&middot;汤普森说的。</font></font>

source: <strong>Step 1</strong>: request object is evaluated for incoming session ID.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Paso 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : el objeto de solicitud se eval&uacute;a para la ID de sesi&oacute;n entrante.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：リクエストオブジェクトが着信セッションIDに対して評価されます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1 단계</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : 요청 세션이 들어오는 세션 ID에 대해 평가됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : объект запроса оценивается для входящего идентификатора сеанса.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">步骤1</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：评估请求对象的传入会话ID。</font></font>

source: <strong>Step 2</strong>: if ID not available a brand new HttpSession object is created and its corresponding session ID is generated (ie of HashTable) session ID is stored into httpservlet response object and the reference of HttpSession object is returned to the servlet (doGet/doPost).
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Paso 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : si la ID no est&aacute; disponible, se crea un nuevo objeto HttpSession y se genera su ID de sesi&oacute;n correspondiente (es decir, de HashTable), la ID de sesi&oacute;n se almacena en el objeto de respuesta httpservlet y la referencia del objeto HttpSession se devuelve al servlet (doGet / doPost) .</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステップ2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：IDが使用できない場合、新しいHttpSessionオブジェクトが作成され、それに対応するセッションID（つまりHashTableの）が生成されます。セッションIDはhttpservlet応答オブジェクトに格納され、HttpSessionオブジェクトの参照がサーブレットに返されます（doGet / doPost） 。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2 단계</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : ID를 사용할 수없는 경우 새 HttpSession 오브젝트가 작성되고 해당 세션 ID가 생성되면 (예 : HashTable) 세션 ID가 httpservlet 응답 오브젝트에 저장되고 HttpSession 오브젝트의 참조가 서블릿 (doGet / doPost)으로 리턴됩니다. .</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаг 2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : если идентификатор недоступен, создается новый объект HttpSession и генерируется соответствующий ему идентификатор сеанса (т. Е. HashTable). Идентификатор сеанса сохраняется в объекте ответа httpservlet, а ссылка на объект HttpSession возвращается сервлету (doGet / doPost). ,</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">步骤2</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：如果ID不可用，则创建一个全新的HttpSession对象，并生成其相应的会话ID（即HashTable的会话ID），将会话ID存储到httpservlet响应对象中，并将HttpSession对象的引用返回给servlet（doGet / doPost） 。</font></font>
