Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: As is clear from above explanations, by implementing the <b>SingleThreadModel</b>, a servlet can be assured thread-safety by the servlet container. The container implementation can do this in 2 ways:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como queda claro en las explicaciones anteriores, al implementar </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModel</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el servlet puede garantizar la seguridad de la rosca mediante el contenedor de servlets. </font><font style="vertical-align: inherit;">La implementaci&oacute;n del contenedor puede hacer esto de 2 maneras:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の説明から明らかなように、</font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModelを</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装する</font><font style="vertical-align: inherit;">ことにより、サーブレットはサーブレットコンテナによってスレッドの安全性を確保できます。</font><font style="vertical-align: inherit;">コンテナー実装は、次の2つの方法でこれを実行できます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 설명에서 알 수 있듯이 </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModel</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 구현 </font><font style="vertical-align: inherit;">하면 서블릿 컨테이너가 서블릿을 스레드로부터 안전하게 보호 할 수 있습니다. </font><font style="vertical-align: inherit;">컨테이너 구현은 두 가지 방법으로이를 수행 할 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как ясно из приведенных выше объяснений, с помощью реализации </font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModel</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сервлет может гарантировать безопасность потока с помощью контейнера сервлета. </font><font style="vertical-align: inherit;">Реализация контейнера может сделать это двумя способами:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从上面的解释中可以清楚地看出，通过实现</font></font><b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModel</font></font></b><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，可以通过servlet容器确保servlet的线程安全性。</font><font style="vertical-align: inherit;">容器实现可以通过两种方式做到这一点：</font></font>

source: As per the <a href="http://www.faqs.org/rfcs/rfc2965.html">HTTP cookie specification</a> (a contract any decent web browser and web server must adhere to), the client (the web browser) is required to send this cookie back in subsequent requests in the <code>Cookie</code> header for as long as the cookie is valid (i.e. the unique ID must refer to an unexpired session and the domain and path are correct). Using your browser's built-in HTTP traffic monitor, you can verify that the cookie is valid (press F12 in Chrome / Firefox 23+ / IE9+, and check the <em>Net/Network</em> tab). The servlet container will check the <code>Cookie</code> header of every incoming HTTP request for the presence of the cookie with the name <code>JSESSIONID</code> and use its value (the session ID) to get the associated <code>HttpSession</code> from server's memory.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De acuerdo con la </font></font><a href="http://www.faqs.org/rfcs/rfc2965.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">especificaci&oacute;n de cookies HTTP</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (un contrato de cualquier navegador web decente y el servidor web debe adherirse a), se requiere que el cliente (el navegador web) para enviar esta vuelta galleta en las solicitudes posteriores de la </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cabecera durante el tiempo que la cookie es v&aacute;lida (es decir, la ID &uacute;nica debe referirse a una sesi&oacute;n no vencida y el dominio y la ruta son correctos). Usando el monitor de tr&aacute;fico HTTP incorporado en su navegador, puede verificar que la cookie sea v&aacute;lida (presione F12 en Chrome / Firefox 23+ / IE9 +, y verifique la </font><font style="vertical-align: inherit;">pesta&ntilde;a </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Red / Red</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). El contenedor del servlet verificar&aacute; el </font><font style="vertical-align: inherit;">encabezado de </font><font style="vertical-align: inherit;">la </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de cada solicitud HTTP entrante para </font><font style="vertical-align: inherit;">detectar la </font><font style="vertical-align: inherit;">presencia de la cookie con el nombre </font></font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y usar&aacute; su valor (el ID de sesi&oacute;n) para obtener el asociado</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la memoria del servidor.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あたりとして</font></font><a href="http://www.faqs.org/rfcs/rfc2965.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTTPクッキーの仕様</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（契約に準拠する必要がありますまともなWebブラウザとWebサーバ）、クライアント（Webブラウザ）がそれに続くのリクエストで、このクッキー送り返すために必要な</font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クッキーが有効である限りとしてのヘッダーを（つまり、一意のIDは、有効期限が切れていないセッションを参照している必要があり、ドメインとパスは正しいです）。ブラウザーの組み込みHTTPトラフィックモニターを使用して、Cookieが有効であることを確認できます（Chrome / Firefox 23以降/ IE9以降ではF12を押し、</font><font style="vertical-align: inherit;">[ </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ネット/ネットワーク</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ]タブ</font><font style="vertical-align: inherit;">を確認し</font><font style="vertical-align: inherit;">ます）。サーブレットコンテナは</font><font style="vertical-align: inherit;">、すべての着信HTTPリクエスト</font><font style="vertical-align: inherit;">の</font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヘッダーで</font></font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">という名前のCookieが存在</font><font style="vertical-align: inherit;">するかどうかを確認し、</font><font style="vertical-align: inherit;">その値（セッションID）を使用して関連する</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーバーのメモリからの</font><font style="vertical-align: inherit;">HttpSession</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">당으로 </font></font><a href="http://www.faqs.org/rfcs/rfc2965.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTTP 쿠키 사양</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (계약을 준수해야 어떤 점잖은 웹 브라우저와 웹 서버), 클라이언트 (웹 브라우저)는 후속 요청에서이 쿠키 다시 보낼 필요가있을 경우 </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 쿠키가 유효 길이만큼을위한 헤더 (예 : 고유 ID는 만료되지 않은 세션을 참조해야하며 도메인과 경로는 정확합니다). 브라우저의 내장 HTTP 트래픽 모니터를 사용하여 쿠키가 유효한지 확인할 수 있습니다 (Chrome / Firefox 23 + / IE9 +에서 F12를 누르고 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Net / Network</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 탭을 </font><font style="vertical-align: inherit;">확인 </font><font style="vertical-align: inherit;">하십시오). 서블릿 컨테이너는 </font><font style="vertical-align: inherit;">들어오는 모든 HTTP 요청 </font><font style="vertical-align: inherit;">의 </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 헤더에서 이름이 </font></font> <code>JSESSIONID</code> 인<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 쿠키 </font><font style="vertical-align: inherit;">가 있는지 확인하고 </font><font style="vertical-align: inherit;">해당 값 (세션 ID)을 사용하여 연관된 값을 가져옵니다.</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서버 메모리에서 </font><font style="vertical-align: inherit;">HttpSession</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно </font></font><a href="http://www.faqs.org/rfcs/rfc2965.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">спецификации HTTP куки</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (контракта любой приличный веб - </font><font style="vertical-align: inherit;">браузер и веб - </font><font style="vertical-align: inherit;">сервер должен придерживаться), клиент (веб - </font><font style="vertical-align: inherit;">браузер) необходимо отправить этот куки обратно в последующих запросах в </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заголовка, пока печенье действительна (т. е. уникальный идентификатор должен относиться к не истекшему сеансу, а домен и путь указаны правильно). Используя встроенный в ваш браузер монитор HTTP-трафика, вы можете убедиться, что файл cookie действителен (нажмите F12 в Chrome / Firefox 23+ / IE9 + и </font><font style="vertical-align: inherit;">откройте вкладку </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сеть / Сеть</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). Контейнер сервлета будет проверять </font><font style="vertical-align: inherit;">заголовок </font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> каждого входящего HTTP-запроса на наличие файла cookie с именем </font></font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и использовать его значение (идентификатор сеанса) для получения соответствующего</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из памяти сервера.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="http://www.faqs.org/rfcs/rfc2965.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTTP cookie规范</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（任何体面的Web浏览器和Web服务器都必须遵守的合同），</font><font style="vertical-align: inherit;">只要cookie有效</font><font style="vertical-align: inherit;">，客户端（Web浏览器）就需要在</font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标头</font><font style="vertical-align: inherit;">中的后续请求中将该cookie发送回去</font><font style="vertical-align: inherit;">（即，唯一ID必须引用未到期的会话，并且域和路径正确）。使用浏览器的内置HTTP流量监视器，您可以验证Cookie是否有效（在Chrome / Firefox 23+ / IE9 +中按F12，然后检查&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">网络/网络&rdquo;</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标签）。 Servlet容器将检查</font><font style="vertical-align: inherit;">每个传入HTTP请求</font><font style="vertical-align: inherit;">的</font></font> <code>Cookie</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">标头中是否存在名称为</font></font> <code>JSESSIONID</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的Cookie，</font><font style="vertical-align: inherit;">并使用其值（会话ID）获取关联的</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">服务器内存中的</font><font style="vertical-align: inherit;">HttpSession</font><font style="vertical-align: inherit;">。</font></font>

source: Best option for Session management in Java
es: La mejor opción para la gestión de sesiones en Java
ja: Javaでのセッション管理に最適なオプション
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 세션 관리를위한 최상의 옵션</font></font>
ru: Лучший вариант для управления сессиями на Java
zh_cn: Java中的Session管理的最佳选择

source: Difference between / and /* in servlet mapping url pattern
es: Diferencia entre y*en el patrón de url del mapeo de servlets
ja: サーブレットマッピングのURLパターンでの*との違い
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 매핑 URL 패턴에서 /와 / *의 차이점</font></font>
ru: Разница между и*в отображении сервлета на карте url pattern
zh_cn: servlet映射url模式中的和*的区别

source: During instantiation phase of the servlet, servlet instance is ready but it cannot serve the client request because it is missing with two pieces of information:
es: Durante la fase de instanciación del servlet,la instancia de servlet está lista pero no puede servir la petición del cliente porque le faltan dos piezas de información:
ja: サーブレットのインスタンス化フェーズでは、サーブレットのインスタンスは準備ができていますが、2つの情報が不足しているため、クライアントのリクエストに対応することができません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿의 인스턴스화 단계에서 서블릿 인스턴스는 준비되었지만 두 가지 정보로 누락되어 클라이언트 요청을 처리 할 수 ​​없습니다.</font></font>
ru: На этапе инстанцирования сервлета экземпляр сервлета готов,но не может обслуживать запрос клиента,так как не содержит двух частей информации:
zh_cn: 在servlet的实例化阶段,servlet实例已经准备好了,但是因为缺少了两个信息,所以无法为客户端请求服务。

source: For servlets not implementing the SingleThreadModel interface, if the service method (or methods such as doGet or doPost which are dispatched to the service method of the HttpServlet abstract class) has been defined with the synchronized keyword, the servlet container cannot use the instance pool approach, but must serialize requests through it. It is strongly recommended that Developers not synchronize the service method (or methods dispatched to it) in these circumstances because of detrimental effects on performance
es: En el caso de los servlets que no implementan la interfaz SingleThreadModel,si el método de servicio (o métodos como doGet o doPost que se envían al método de servicio de la clase abstracta HttpServlet)se ha definido con la palabra clave sincronizada,el contenedor de servlets no puede utilizar el enfoque de pool de instancias,sino que debe serializar las solicitudes a través de él.Se recomienda encarecidamente a los desarrolladores que no sincronicen el método de servicio (o los métodos enviados a él)en estas circunstancias debido a los efectos perjudiciales para el rendimiento
ja: SingleThreadModel インタフェースを実装していないサーブレットの場合、サービス・メソッド (または、HttpServlet 抽象クラスのサービス・メソッドにディスパッチされる doGet や doPost などのメソッド)が synchronized キーワードで定義されていると、サーブレット・コンテナはインスタンス・プール・アプローチを使用できませんが、それを介してリクエストをシリアライズする必要があります。このような状況では、パフォーマンスに悪影響を及ぼすため、サービス・メソッド (またはそれにディスパッチされたメソッド)を同期化しないことを強くお勧めします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SingleThreadModel 인터페이스를 구현하지 않는 서블릿의 경우 서비스 메소드 (또는 HttpServlet 추상 클래스의 서비스 메소드로 전달되는 doGet 또는 doPost와 같은 메소드)가 동기화 된 키워드로 정의 된 경우, 서블릿 컨테이너는 인스턴스 풀 접근을 사용할 수 없습니다. 요청을 직렬화해야합니다. </font><font style="vertical-align: inherit;">이러한 상황에서 개발자는 성능에 부정적인 영향을 미치므로 서비스 방법 (또는 전달 된 방법)을 동기화하지 않는 것이 좋습니다.</font></font>
ru: Для сервлетов,не реализующих интерфейс SingleThreadModel,если служебный метод (или такие методы,как doGet или doPost,которые отправляются в служебный метод абстрактного класса HttpServlet)был определен с синхронизированным ключевым словом,контейнер сервлета не может использовать подход с использованием пула экземпляров,а должен сериализовать запросы через него.Настоятельно рекомендуется,чтобы разработчики не синхронизировали метод обслуживания (или методы,отправляемые ему)в этих обстоятельствах из-за вредного влияния на производительность
zh_cn: 对于没有实现SingleThreadModel接口的servlet来说,如果服务方法(或者像doGet或doPost这样被调度到HttpServlet抽象类的服务方法的方法)已经定义了synchronized关键字,那么servlet容器就不能使用实例池的方法,而必须通过它来序列化请求。强烈建议开发者在这种情况下不要对服务方法(或向它调度的方法)进行同步,因为会对性能产生不利的影响

source: How do servlets work? Instantiation, sessions, shared variables and multithreading
es: ¿Cómo funcionan los servilletas? Instanciación,sesiones,variables compartidas y multihilo
ja: サーブレットはどのように動作するのか?インスタンス、セッション、共有変数、マルチスレッド
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿은 어떻게 작동합니까? </font><font style="vertical-align: inherit;">인스턴스화, 세션, 공유 변수 및 멀티 스레딩</font></font>
ru: Как работают сервлеты? Инстанции,сеансы,общие переменные и многопоточность
zh_cn: servlet是如何工作的?实例化、会话、共享变量和多线程

source: HttpServletRequest and HttpServletResponse
es: HttpServletRequest y HttpServletResponse
ja: HttpServletRequest および HttpServletResponse。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HttpServletRequest 및 HttpServletResponse</font></font>
ru: HttpServletRequest и HttpServletResponse
zh_cn: HttpServletRequest和HttpServletResponse

source: I feel that Synchronized block is better than making the whole method
es: Creo que el bloqueo sincronizado es mejor que hacer que todo el método
ja: 全体の方式を作るよりも、シンクロナイズドブロックの方が良いような気がします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전체 블록을 만드는 것보다 동기화 된 블록이 더 좋다고 생각합니다.</font></font>
ru: Я чувствую,что Синхронизированный блок лучше,чем сделать весь метод.
zh_cn: 我觉得同步块比起做整个方法要好一些

source: If <strong>load-on-startup</strong> is <strong>false</strong>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">load-on-startup</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">falso</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もし</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のload-on-startupが</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">偽</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">만약 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시작시로드가</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있습니다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">거짓</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">загрузка при запуске</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет значение </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">false</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">启动时加载</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">false</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: If <strong>load-on-startup</strong> is <strong>true</strong>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">load-on-startup</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">verdadero</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もし</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のload-on-startupが</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">真</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">만약 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시작시로드가</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">진실</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">загрузка при запуске</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">правда</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">启动时加载</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">true</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
