Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In a nutshell
es: En resumen...
ja: 一言で言えば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단히 말해서</font></font>
ru: В двух словах
zh_cn: 一言以蔽之

source: In short: the web server issues a unique identifier to <em>each visitor</em> on his <em>first</em> visit. The visitor must bring back that ID for him to be recognised next time around. This identifier also allows the server to properly segregate objects owned by one session against that of another.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En resumen: el servidor web emite un identificador &uacute;nico para </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cada visitante</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en su </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">primera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> visita. </font><font style="vertical-align: inherit;">El visitante debe traer esa identificaci&oacute;n para que sea reconocido la pr&oacute;xima vez. </font><font style="vertical-align: inherit;">Este identificador tambi&eacute;n permite al servidor segregar adecuadamente los objetos que posee una sesi&oacute;n contra la de otra.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">つまり、Webサーバー</font><font style="vertical-align: inherit;">は、</font><em><font style="vertical-align: inherit;">最初の</font></em><font style="vertical-align: inherit;">訪問時</font><font style="vertical-align: inherit;">に</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">各訪問者</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">一意の識別子を発行します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">訪問者は、次回に認識されるためにそのIDを返却する必要があります。</font><font style="vertical-align: inherit;">この識別子により、サーバーは、あるセッションが所有するオブジェクトを別のセッションのオブジェクトに対して適切に分離することもできます。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">한마디로 : 웹 서버 </font><font style="vertical-align: inherit;">는 </font><em><font style="vertical-align: inherit;">첫</font></em><font style="vertical-align: inherit;"> 방문시 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">각 방문자</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에게 고유 식별자를 발급합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">방문자는 다음 번에 자신을 인식 할 수 있도록 해당 ID를 가져와야합니다. </font><font style="vertical-align: inherit;">이 식별자를 사용하면 서버가 한 세션이 소유 한 개체를 다른 세션의 개체와 올바르게 분리 할 수 ​​있습니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вкратце: веб-сервер выдает уникальный идентификатор </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">каждому посетителю</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> при его </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">первом</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> посещении. </font><font style="vertical-align: inherit;">Посетитель должен вернуть это удостоверение личности, чтобы его можно было узнать в следующий раз. </font><font style="vertical-align: inherit;">Этот идентификатор также позволяет серверу правильно отделять объекты, принадлежащие одному сеансу, от сеанса другого.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">总之：Web服务器发出一个唯一的标识符，以</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">每位游客</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在他的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">第一次</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">访问。</font><font style="vertical-align: inherit;">访客必须带回该ID，以便下次被识别。</font><font style="vertical-align: inherit;">此标识符还允许服务器将一个会话拥有的对象与另一个会话正确隔离。</font></font>

source: In the case of <a href="https://stackoverflow.com/tags/servlet-filters/info">filters</a>, the <code>doFilter()</code> method is invoked. When the servlet container's code calls <code>chain.doFilter(request, response)</code>, the request and response continue on to the next filter, or hit the servlet if there are no remaining filters.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso de los </font></font><a href="https://stackoverflow.com/tags/servlet-filters/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">filtros</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font><font style="vertical-align: inherit;">se invoca el m&eacute;todo </font></font> <code>doFilter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Cuando el c&oacute;digo del contenedor de servlet llama a </font></font> <code>chain.doFilter(request, response)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la solicitud y la respuesta contin&uacute;an al siguiente filtro, o golpean el servlet si no quedan filtros restantes.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/tags/servlet-filters/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">filters</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の場合</font><font style="vertical-align: inherit;">、</font></font> <code>doFilter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドが呼び出されます。</font><font style="vertical-align: inherit;">サーブレットコンテナーのコードが</font></font> <code>chain.doFilter(request, response)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出す</font><font style="vertical-align: inherit;">と、要求と応答は次のフィルターに進みます。フィルターが残っていない場合は、サーブレットにヒットします。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 경우에는 </font></font><a href="https://stackoverflow.com/tags/servlet-filters/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">필터</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font></font> <code>doFilter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드가 호출된다. </font><font style="vertical-align: inherit;">서블릿 컨테이너의 코드가 </font></font> <code>chain.doFilter(request, response)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출 </font><font style="vertical-align: inherit;">하면 요청 및 응답이 다음 필터로 계속 진행되거나 남아있는 필터가없는 경우 서블릿을 누르십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В случае </font></font><a href="https://stackoverflow.com/tags/servlet-filters/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">фильтров</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то </font></font> <code>doFilter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> метод вызывается. </font><font style="vertical-align: inherit;">Когда код контейнера сервлета вызывает </font></font> <code>chain.doFilter(request, response)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , запрос и ответ </font><font style="vertical-align: inherit;">переходят</font><font style="vertical-align: inherit;"> к следующему фильтру или попадают в сервлет, если нет оставшихся фильтров.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于</font></font><a href="https://stackoverflow.com/tags/servlet-filters/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">filter</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，将</font><font style="vertical-align: inherit;">调用</font></font> <code>doFilter()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">当Servlet容器的代码调用</font></font> <code>chain.doFilter(request, response)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，请求和响应将继续到下一个过滤器，如果没有剩余的过滤器，则单击servlet。</font></font>

source: In the case of <a href="https://stackoverflow.com/tags/servlets/info">servlets</a>, the <code>service()</code> method is invoked. By default, this method determines which one of the <code>doXxx()</code> methods to invoke based off of <code>request.getMethod()</code>. If the determined method is absent from the servlet, then an HTTP 405 error is returned in the response.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso de los </font></font><a href="https://stackoverflow.com/tags/servlets/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">servlets</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font><font style="vertical-align: inherit;">se invoca el m&eacute;todo </font></font> <code>service()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">De forma predeterminada, este m&eacute;todo determina cu&aacute;l de los </font><font style="vertical-align: inherit;">m&eacute;todos </font></font> <code>doXxx()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> invocar en funci&oacute;n de </font></font> <code>request.getMethod()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si el m&eacute;todo determinado est&aacute; ausente del servlet, se devuelve un error HTTP 405 en la respuesta.</font></font>
ja: <font style="vertical-align: inherit;"></font><a href="https://stackoverflow.com/tags/servlets/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレット</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の場合</font><font style="vertical-align: inherit;">、</font></font> <code>service()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドが呼び出されます。</font><font style="vertical-align: inherit;">デフォルトでは、このメソッド</font><font style="vertical-align: inherit;">は</font> <code>request.getMethod()</code> に<font style="vertical-align: inherit;">基づいて</font><font style="vertical-align: inherit;">、</font></font> <code>doXxx()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを呼び出す </font><font style="vertical-align: inherit;">かを決定します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">決定されたメソッドがサーブレットにない場合、HTTP 405エラーが応答で返されます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 경우에는 </font></font><a href="https://stackoverflow.com/tags/servlets/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font></font> <code>service()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드가 호출된다. </font><font style="vertical-align: inherit;">기본적으로이 메소드 </font><font style="vertical-align: inherit;">는 </font> <code>request.getMethod()</code> <font style="vertical-align: inherit;"> 기반으로 호출 </font><font style="vertical-align: inherit;">할 </font></font> <code>doXxx()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드 </font><font style="vertical-align: inherit;">중 하나를 판별 </font><font style="vertical-align: inherit;">합니다. </font><font style="vertical-align: inherit;">결정된 메소드가 서블릿에없는 경우 응답에 HTTP 405 오류가 리턴됩니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В случае </font></font><a href="https://stackoverflow.com/tags/servlets/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сервлетах</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , то </font></font> <code>service()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> метод вызывается. </font><font style="vertical-align: inherit;">По умолчанию этот метод определяет, какой из </font><font style="vertical-align: inherit;">методов </font></font> <code>doXxx()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вызывать, основываясь на </font></font> <code>request.getMethod()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если определенный метод отсутствует в сервлете, то в ответе возвращается ошибка HTTP 405.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于</font></font><a href="https://stackoverflow.com/tags/servlets/info"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">servlet</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，将</font><font style="vertical-align: inherit;">调用</font></font> <code>service()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法。</font><font style="vertical-align: inherit;">默认情况下，此方法</font><font style="vertical-align: inherit;">根据</font> <code>request.getMethod()</code> <font style="vertical-align: inherit;">确定</font><font style="vertical-align: inherit;">要调用</font><font style="vertical-align: inherit;">哪个</font></font> <code>doXxx()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法 </font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">如果servlet中没有确定的方法，则在响应中返回HTTP 405错误。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Inshort form:
es: En forma corta:
ja: インショートフォーム。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">짧은 형태 :</font></font>
ru: Форма иншорта:
zh_cn: 短短的形式。

source: It comes with a small risk though. Remember: this single guy holds all the order information in his pocket: so if you're not cautious about <a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html">thread safety on servlets</a>, he may end up giving the wrong order to a certain client.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, conlleva un peque&ntilde;o riesgo. Recuerde: este chico solo tiene toda la informaci&oacute;n de la orden en su bolsillo: por lo tanto, si no tiene cuidado con la </font></font><a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">seguridad del hilo en los servlets</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede terminar dando la orden incorrecta a un determinado cliente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし、小さなリスクが伴います。覚えておいてください。この1人の男はすべての注文情報をポケットに入れています。そのため、</font></font><a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットのスレッドセーフティに</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">注意しない</font><font style="vertical-align: inherit;">と、特定のクライアントに間違った注文をしてしまう可能性があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 작은 위험이 따릅니다. </font><font style="vertical-align: inherit;">기억하십시오 :이 싱글 녀석은 주머니에 모든 주문 정보를 가지고 있습니다 </font></font><a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. 서블릿의 스레드 안전에</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대해주의하지 않으면 </font><font style="vertical-align: inherit;">특정 클라이언트에게 잘못된 주문을 줄 수 있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это идет с небольшим риском, хотя. Помните: этот парень хранит всю информацию о заказе в своем кармане: поэтому, если вы не будете осторожны с </font></font><a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">безопасностью потоков в сервлетах</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , он может в итоге отдать неправильный заказ определенному клиенту.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不过，它带来的风险很小。请记住：这个人将所有订单信息都放在口袋里：因此，如果您</font></font><a href="http://tutorials.jenkov.com/java-servlets/servlet-concurrency.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对servlet的线程安全性不谨慎</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，他可能最终会给某个客户错误的订单。</font></font>

source: Now, if 2 or more users send request to this server then what happens to the session variables? Will they all be common for all the users or they will be different for each user. If they are different, then how was the server able to differentiate between different users?
es: Ahora,si 2 o más usuarios envían una solicitud a este servidor,¿qué pasa con las variables de sesión? ¿Serán todas comunes para todos los usuarios o serán diferentes para cada usuario.Si son diferentes,entonces ¿cómo pudo el servidor diferenciar entre los diferentes usuarios?
ja: さて、2人以上のユーザがこのサーバにリクエストを送った場合、セッション変数はどうなるでしょうか?それらはすべてのユーザに共通のものでしょうか、それともユーザごとに異なるものでしょうか。異なる場合、サーバはどのようにして異なるユーザを区別することができたのでしょうか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 두 명 이상의 사용자가이 서버에 요청을 보내면 세션 변수는 어떻게됩니까? </font><font style="vertical-align: inherit;">모든 사용자에게 공통적이거나 각 사용자마다 다를 수 있습니다. </font><font style="vertical-align: inherit;">서로 다른 경우 서버는 어떻게 다른 사용자를 구별 할 수 있었습니까?</font></font>
ru: Теперь,если 2 или более пользователей посылают запрос на этот сервер,то что происходит с переменными сессии? Будут ли они все общие для всех пользователей или они будут разными для каждого пользователя.Если они разные,то как сервер мог различать разных пользователей?
zh_cn: 现在,如果2个或更多的用户向这个服务器发送请求,那么会话变量会发生什么变化?是所有的用户都是通用的,还是每个用户都不一样。如果它们是不同的,那么服务器是如何区分不同用户的呢?
