Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: That said, your major concern is possibly <em>thread safety</em>. You should now know that servlets and filters are shared among all requests. That's the nice thing about Java, it's multithreaded and different threads (read: HTTP requests) can make use of the same instance. It would otherwise be too expensive to recreate, <code>init()</code> and <code>destroy()</code> them for every single request.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dicho esto, su mayor preocupaci&oacute;n es posiblemente la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">seguridad del hilo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Ahora debe saber que los servlets y los filtros se comparten entre todas las solicitudes. </font><font style="vertical-align: inherit;">Eso es lo bueno de Java, es multiproceso y diferentes subprocesos (l&eacute;ase: solicitudes HTTP) pueden hacer uso de la misma instancia. </font><font style="vertical-align: inherit;">De lo contrario, ser&iacute;a demasiado costoso recrearlos, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cada solicitud.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そうは言っても、あなたの主要な懸念はおそらく</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スレッドの安全性</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">これで、サーブレットとフィルターがすべてのリクエスト間で共有されることがわかります。</font><font style="vertical-align: inherit;">これはJavaのいいところです。マルチスレッドであり、異なるスレッド（読み取り：HTTPリクエスト）が同じインスタンスを使用できます。</font><font style="vertical-align: inherit;">そうしないと、</font><font style="vertical-align: inherit;">リクエストを1回実行するたび</font><font style="vertical-align: inherit;">に再作成、</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">するのに</font><font style="vertical-align: inherit;">コストがかかりすぎ</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, 주요 관심사는 아마도 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">스레드 안전</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font><font style="vertical-align: inherit;">서블릿과 필터가 모든 요청에서 공유됨을 알아야합니다. </font><font style="vertical-align: inherit;">Java의 좋은 점은 멀티 스레드이며 다른 스레드 (읽기 : HTTP 요청)가 동일한 인스턴스를 사용할 수 있다는 것입니다. </font><font style="vertical-align: inherit;">그렇지 않으면 </font><font style="vertical-align: inherit;">모든 단일 요청에 대해 </font><font style="vertical-align: inherit;">다시 작성, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하기에는 너무 비쌉니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тем не менее, ваша главная проблема, возможно, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">безопасность потоков</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Теперь вы должны знать, что сервлеты и фильтры являются общими для всех запросов. </font><font style="vertical-align: inherit;">Это хорошая вещь в Java, она многопоточная, и разные потоки (читай: HTTP-запросы) могут использовать один и тот же экземпляр. </font><font style="vertical-align: inherit;">В противном случае было бы слишком дорого создавать их заново, </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для каждого отдельного запроса.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就是说，您最关心的可能是</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">线程安全</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">现在，您应该知道servlet和过滤器在所有请求之间共享。</font><font style="vertical-align: inherit;">这对Java来说是件好事，它是多线程的，不同的线程（阅读：HTTP请求）可以使用同一实例。</font><font style="vertical-align: inherit;">否则，</font><font style="vertical-align: inherit;">对于每个单个请求</font><font style="vertical-align: inherit;">重新创建，</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都</font><font style="vertical-align: inherit;">将太昂贵</font><font style="vertical-align: inherit;">。</font></font>

source: The <code>HttpServletRequest</code> and <code>HttpServletResponse</code> live from the time the servlet receives an HTTP request from the client, until the complete response (the web page) has arrived. It is <em>not</em> shared elsewhere.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>HttpServletResponse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en directo desde el momento en que el servlet recibe una petici&oacute;n HTTP desde el cliente, hasta que ha llegado la respuesta completa (la p&aacute;gina web). </font><font style="vertical-align: inherit;">Se </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> compartida en otro lugar.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>HttpServletResponse</code> のは、<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全な応答（Webページ）が到着するまで、サーブレットはクライアントからのHTTPリクエストを受信した時から住んでいます。</font><font style="vertical-align: inherit;">それはされ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ていない</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他の場所で共有しました。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>HttpServletRequest</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font> <code>HttpServletResponse</code> 를가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 전체 응답 (웹 페이지)에 도착 할 때까지, 서블릿이 클라이언트에서 HTTP 요청을 수신 할 때부터 살고 있습니다. </font><font style="vertical-align: inherit;">그것은되어 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">있지</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 다른 곳에서 공유했다.</font></font>
ru: <font style="vertical-align: inherit;"></font> <code>HttpServletRequest</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>HttpServletResponse</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> живут с момента сервлет получает запрос HTTP от клиента, пока полный ответ (веб - </font><font style="vertical-align: inherit;">страницы) не поступило. </font><font style="vertical-align: inherit;">Это </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> распространено в другом месте.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font> <code>HttpServletRequest</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>HttpServletResponse</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从servlet接收来自客户端的HTTP请求的时间住，直到完全缓解（网页）已经到来。</font><font style="vertical-align: inherit;">它</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在其他地方共享。</font></font>

source: The <code>HttpSession</code> lives for as long as the client is interacting with the web app with the same browser instance, and the session hasn't timed out at the server side. It is shared among <em>all</em> requests in the <em>same</em> session.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font></font> <code>HttpSession</code> dura el<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiempo que el cliente interact&uacute;a con la aplicaci&oacute;n web con la misma instancia del navegador, y la sesi&oacute;n no ha expirado en el lado del servidor. </font><font style="vertical-align: inherit;">Se comparte entre </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solicitudes en la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">misma</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sesi&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>HttpSession</code> のは、<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">長い間、クライアントが同じブラウザインスタンスを使用したWebアプリケーションと対話している、とのセッションはサーバー側でタイムアウトしていないようするために住んでいます。</font><em><font style="vertical-align: inherit;">同じ</font></em><font style="vertical-align: inherit;">セッションの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リクエストで</font><font style="vertical-align: inherit;">共有され</font><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 긴 클라이언트가 동일한 브라우저 인스턴스 웹 응용 프로그램과 상호 작용하고, 세션이 서버 측에서 제한 시간을 초과하지 않은만큼을위한 삶. </font><em><font style="vertical-align: inherit;">동일한</font></em><font style="vertical-align: inherit;"> 세션의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요청 </font><font style="vertical-align: inherit;">간에 공유 </font><font style="vertical-align: inherit;">됩니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> живет до тех пор , </font><font style="vertical-align: inherit;">пока клиент взаимодействует с веб - </font><font style="vertical-align: inherit;">приложение с тем же экземпляром браузера, и сеанс не истекло на стороне сервера. </font><font style="vertical-align: inherit;">Он распределяется между </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всеми</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> запросами в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">одном</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сеансе.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font> <code>HttpSession</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">生命，只要客户端与同一个浏览器实例中的Web应用程序进行交互，和会话未在服务器端超时。</font><font style="vertical-align: inherit;">它</font><font style="vertical-align: inherit;">在</font><em><font style="vertical-align: inherit;">同一</font></em><font style="vertical-align: inherit;">会话的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请求</font><font style="vertical-align: inherit;">之间共享</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>

source: The <code>HttpSession</code> stays alive until it has been idle (i.e. not used in a request) for more than the timeout value specified in <code>&lt;session-timeout&gt;</code>, a setting in <code>web.xml</code>. The timeout value defaults to 30 minutes. So, when the client doesn't visit the web app for longer than the time specified, the servlet container trashes the session. Every subsequent request, even with the cookie specified, will not have access to the same session anymore; the servlet container will create a new session.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permanece activa hasta que ha estado inactiva (es decir, no se utiliza en una solicitud) durante m&aacute;s tiempo que el valor de tiempo de espera especificado en </font></font> <code>&lt;session-timeout&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , una configuraci&oacute;n en </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">El valor de tiempo de espera predeterminado es 30 minutos. </font><font style="vertical-align: inherit;">Por lo tanto, cuando el cliente no visita la aplicaci&oacute;n web durante m&aacute;s tiempo que el especificado, el contenedor de servlets destruye la sesi&oacute;n. </font><font style="vertical-align: inherit;">Cada solicitud posterior, incluso con la cookie especificada, ya no tendr&aacute; acceso a la misma sesi&oacute;n; </font><font style="vertical-align: inherit;">el contenedor de servlet crear&aacute; una nueva sesi&oacute;n.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に指定されたタイムアウト値以上のための生きているとどまることがアイドル状態になっているまで（すなわち要求で使用されていない）</font></font> <code>&lt;session-timeout&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で、設定</font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">タイムアウト値のデフォルトは30分です。</font><font style="vertical-align: inherit;">そのため、クライアントが指定された時間よりも長い間Webアプリケーションにアクセスしない場合、サーブレットコンテナはセッションを破棄します。</font><font style="vertical-align: inherit;">Cookieが指定されていても、以降のすべてのリクエストは同じセッションにアクセスできなくなります。</font><font style="vertical-align: inherit;">サーブレットコンテナが新しいセッションを作成します。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 지정된 시간 초과 값보다 더 살아 숙박이 유휴 때까지 (즉, 요청에서 사용되지 않음) </font></font> <code>&lt;session-timeout&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에, 설정 </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">시간 종료 값은 기본적으로 30 분입니다. </font><font style="vertical-align: inherit;">따라서 클라이언트가 지정된 시간보다 오랫동안 웹 앱을 방문하지 않으면 서블릿 컨테이너가 세션을 휴지통에 버립니다. </font><font style="vertical-align: inherit;">쿠키가 지정된 경우에도 이후의 모든 요청은 더 이상 동일한 세션에 액세스 할 수 없습니다. </font><font style="vertical-align: inherit;">서블릿 컨테이너는 새 세션을 만듭니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> остается в </font><font style="vertical-align: inherit;">живых до тех пор, пока не простаивает (т.е. не используется в запросе) для более чем значение тайм - </font><font style="vertical-align: inherit;">аута , </font><font style="vertical-align: inherit;">указанного в </font></font> <code>&lt;session-timeout&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , настройки в </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Значение тайм-аута по умолчанию составляет 30 минут. </font><font style="vertical-align: inherit;">Таким образом, когда клиент не посещает веб-приложение дольше указанного времени, контейнер сервлета перехватывает сеанс. </font><font style="vertical-align: inherit;">Каждый последующий запрос, даже с указанным файлом cookie, больше не будет иметь доступа к тому же сеансу; </font><font style="vertical-align: inherit;">Контейнер сервлета создаст новый сеанс.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所述</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为比在指定的超时值以上的客人活着，直到它已经空闲（即，不是在请求中使用）</font></font> <code>&lt;session-timeout&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中，在设定</font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">超时值默认为30分钟。</font><font style="vertical-align: inherit;">因此，当客户端访问Web应用程序的时间不超过指定的时间时，Servlet容器将破坏会话。</font><font style="vertical-align: inherit;">每个后续请求，即使指定了cookie，也将无法再访问同一会话。</font><font style="vertical-align: inherit;">servlet容器将创建一个新会话。</font></font>

source: The <code>ServletContext</code> lives for as long as the web app lives. It is shared among <em>all</em> requests in <em>all</em> sessions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>ServletContext</code> dura<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tanto como la aplicaci&oacute;n web. </font><font style="vertical-align: inherit;">Se comparte entre </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> solicitudes en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sesiones.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>ServletContext</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">長いWebアプリケーションの命と同じくらいのために住んでいます。</font><em><font style="vertical-align: inherit;">すべての</font></em><font style="vertical-align: inherit;">セッションの</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">すべての</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">リクエストで</font><font style="vertical-align: inherit;">共有され</font><font style="vertical-align: inherit;">ます。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 웹 응용 프로그램의 삶 등을위한 삶. </font><em><font style="vertical-align: inherit;">모든</font></em><font style="vertical-align: inherit;"> 세션의 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">모든</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 요청 </font><font style="vertical-align: inherit;">간에 공유 </font><font style="vertical-align: inherit;">됩니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> живет так долго , </font><font style="vertical-align: inherit;">как веб - </font><font style="vertical-align: inherit;">приложение жизни. </font><font style="vertical-align: inherit;">Он распределяется между </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всеми</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> запросами во </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">всех</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сеансах.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该</font></font> <code>ServletContext</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">生活，只要Web应用程序的生命。</font><font style="vertical-align: inherit;">它</font><font style="vertical-align: inherit;">在</font><em><font style="vertical-align: inherit;">所有</font></em><font style="vertical-align: inherit;">会话的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所有</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">请求</font><font style="vertical-align: inherit;">之间共享</font><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
