Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: When the servlet container shuts down, it unloads all web applications, invokes the <code>destroy()</code> method of all its initialized servlets and filters, and all <code>ServletContext</code>, <code>Servlet</code>, <code>Filter</code> and <code>Listener</code> instances are trashed. Finally the <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"><code>ServletContextListener#contextDestroyed()</code></a> will be invoked.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando el contenedor de servlets se cierra, descarga todas las aplicaciones web, invoca el </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de todos sus servlets y filtros inicializados, y todas las </font><font style="vertical-align: inherit;">instancias de </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se eliminan. </font><font style="vertical-align: inherit;">Finalmente </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextDestroyed()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットコンテナがシャットダウンすると、すべてのWebアプリケーションがアンロードされ、</font><font style="vertical-align: inherit;">初期化されたすべてのサーブレットとフィルタ</font><font style="vertical-align: inherit;">の</font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドが</font><font style="vertical-align: inherit;">呼び出され、</font><font style="vertical-align: inherit;">すべての</font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンスが破棄されます。</font><font style="vertical-align: inherit;">最後に</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextDestroyed()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が呼び出されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너가 종료되면 모든 웹 애플리케이션을 언로드 </font><font style="vertical-align: inherit;">하고 초기화 된 모든 서블릿 및 필터 </font><font style="vertical-align: inherit;">의 </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 </font><font style="vertical-align: inherit;">호출 </font><font style="vertical-align: inherit;">하며 모든 </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 인스턴스가 휴지통으로 이동합니다. </font><font style="vertical-align: inherit;">마지막으로 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextDestroyed()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 호출됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда контейнер сервлета выключается, он выгружает все веб-приложения, вызывает метод </font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> всех своих инициализированных сервлетов и фильтров, и все </font><font style="vertical-align: inherit;">экземпляры </font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> удаляются. </font><font style="vertical-align: inherit;">Наконец, </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextDestroyed()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> будет вызван.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当Servlet容器关闭时，它将卸载所有Web应用程序，调用</font><font style="vertical-align: inherit;">所有初始化的Servlet和过滤器</font><font style="vertical-align: inherit;">的</font></font> <code>destroy()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法，并且所有</font></font> <code>ServletContext</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>Servlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>Filter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Listener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例都将被丢弃。</font><font style="vertical-align: inherit;">最后，</font><font style="vertical-align: inherit;">将调用</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextDestroyed-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextDestroyed()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: Why Servlets are not thread Safe?
es: ¿Por qué las servilletas no son seguras para el hilo?
ja: なぜサーブレットはスレッドセーフではないのか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿이 스레드로부터 안전하지 않은 이유는 무엇입니까?</font></font>
ru: Почему сервлеты не являются ниткой Безопасной?
zh_cn: 为什么Servlet不是线程安全的?

source: Why isn't it a good idea to have one instance per client? Think about this: Will you hire one pizza guy for every order that came? Do that and you'd be out of business in no time.
es: ¿Por qué no es una buena idea tener una instancia por cliente? Piensa en esto:¿Contratarás a un repartidor de pizza por cada pedido que llegue? Hazlo y estarás fuera del negocio en poco tiempo.
ja: なぜ、クライアントごとに1つのインスタンスを持つことは良いアイデアではないのでしょうか?これについて考えてみてください。来た注文ごとにピザ屋を一人雇うか?そうすれば、すぐに廃業してしまうでしょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트 당 하나의 인스턴스를 갖는 것이 좋지 않은 이유는 무엇입니까? </font><font style="vertical-align: inherit;">생각해보십시오 : 주문할 때마다 피자 한 명을 고용 하시겠습니까? </font><font style="vertical-align: inherit;">그렇게하면 곧 비즈니스가 중단 될 것입니다.</font></font>
ru: Почему не стоит иметь по одному экземпляру на клиента? Подумай об этом:Ты будешь нанимать по одному пиццу на каждый заказ,который приходит? Сделай это,и ты быстро выйдешь из бизнеса.
zh_cn: 为什么每个客户有一个实例不是很好?你想想看 你会为每一个来的订单雇佣一个披萨店员吗?这样做,你的生意马上就会被淘汰。

source: You should also realize that you should <strong>never</strong> assign any request or session scoped data as an <em>instance</em> variable of a servlet or filter. It will be shared among all other requests in other sessions. That's <strong>not</strong> thread-safe! The below example illustrates this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n debe darse cuenta de que </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">nunca</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe </font><font style="vertical-align: inherit;">asignar ninguna solicitud o datos con alcance de sesi&oacute;n como una </font><font style="vertical-align: inherit;">variable de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">instancia</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de un servlet o filtro. </font><font style="vertical-align: inherit;">Se compartir&aacute; entre todas las dem&aacute;s solicitudes en otras sesiones. </font><font style="vertical-align: inherit;">&iexcl;Eso </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es </font><font style="vertical-align: inherit;">seguro para subprocesos! </font><font style="vertical-align: inherit;">El siguiente ejemplo ilustra esto:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、あなたがすべきことを認識すべきである</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">決して</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">として任意の要求またはセッションスコープのデータを割り当てていない</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インスタンスの</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットまたはフィルタの変数。</font><font style="vertical-align: inherit;">他のセッションの他のすべてのリクエスト間で共有されます。</font><font style="vertical-align: inherit;">それ</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">スレッドセーフで</font><strong><font style="vertical-align: inherit;">はありません</font></strong><font style="vertical-align: inherit;">！</font><font style="vertical-align: inherit;">以下の例はこれを示しています：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 </font><font style="vertical-align: inherit;">요청 또는 세션 범위 데이터를 </font><font style="vertical-align: inherit;">서블릿 또는 필터 </font><font style="vertical-align: inherit;">의 </font><em><font style="vertical-align: inherit;">인스턴스</font></em><font style="vertical-align: inherit;"> 변수 </font><font style="vertical-align: inherit;">로 지정 </font><font style="vertical-align: inherit;">해서는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">안된다는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 것을 알아야합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">다른 세션의 다른 모든 요청과 공유됩니다. </font><font style="vertical-align: inherit;">그건 </font><strong><font style="vertical-align: inherit;">하지</font></strong><font style="vertical-align: inherit;"> 스레드 안전! </font><font style="vertical-align: inherit;">아래 예제는 이것을 보여줍니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также должны понимать, что вы </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">никогда не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должны </font><font style="vertical-align: inherit;">назначать какие-либо данные области запроса или сеанса в качестве </font><font style="vertical-align: inherit;">переменной </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">экземпляра</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сервлета или фильтра. </font><font style="vertical-align: inherit;">Он будет передан всем другим запросам в других сеансах. </font><font style="vertical-align: inherit;">Это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">не</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> потокобезопасно! </font><font style="vertical-align: inherit;">Пример ниже иллюстрирует это:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您还应该意识到，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">切勿</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">将任何请求或会话范围的数据分配为</font><font style="vertical-align: inherit;">Servlet或过滤器</font><font style="vertical-align: inherit;">的</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实例</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">变量。</font><font style="vertical-align: inherit;">它将在其他会话中的所有其他请求之间共享。</font><font style="vertical-align: inherit;">那</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不是</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">线程安全的！</font><font style="vertical-align: inherit;">下面的示例说明了这一点：</font></font>

source: doGet and doPost in Servlets
es: doGet y doPost en Servlets
ja: サーブレットのdoGetとdoPost
ko: 서블릿의 doGet 및 doPost
ru: доГет и доПост в сервлетах
zh_cn: Servlets中的doGet和doPost

source: keyword in front of method
es: palabra clave frente al método
ja: キーワード
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메소드 앞의 키워드</font></font>
ru: ключевое слово перед методом
zh_cn: 词条

source: or we can go for synchronize methods
es: o podemos ir por métodos de sincronización
ja: あるいは、同期化メソッドを使用することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 우리는 동기화 방법으로 갈 수 있습니다</font></font>
ru: или мы можем пойти на синхронизацию методов
zh_cn: 或者我们可以采用同步方法

source: or we can the put block of the code in the Synchronized block
es: o podemos poner el bloque del código en el bloque sincronizado
ja: または、同期ブロックにコードのブロックを置くことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또는 코드의 블록을 동기화 블록에 넣을 수 있습니다</font></font>
ru: или мы можем поместить блок кода в блок Синхронизированный
zh_cn: 或者我们可以把代码块放到同步块中的同步块中

source: we can make whole service method as synchronized by using synchronized
es: podemos hacer que todo el método de servicio esté sincronizado mediante el uso de la sincronización
ja: を使用することで、サービスメソッド全体を同期化することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동기화를 사용하여 전체 서비스 방법을 동기화 된 것으로 만들 수 있습니다</font></font>
ru: мы можем сделать весь метод обслуживания как синхронизированный с помощью синхронизированных
zh_cn: 我们可以通过使用synchronized
