Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: On the client side, the session cookie stays alive for as long as the browser instance is running. So, if the client closes the browser instance (all tabs/windows), then the session is trashed on the client's side. In a new browser instance, the cookie associated with the session wouldn't exist, so it would no longer be sent. This causes an entirely new <code>HttpSession</code> to be created, with an entirely new session cookie being used.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el lado del cliente, la cookie de sesi&oacute;n permanece activa mientras se ejecuta la instancia del navegador. </font><font style="vertical-align: inherit;">Por lo tanto, si el cliente cierra la instancia del navegador (todas las pesta&ntilde;as / ventanas), la sesi&oacute;n se descarta del lado del cliente. </font><font style="vertical-align: inherit;">En una nueva instancia del navegador, la cookie asociada con la sesi&oacute;n no existir&iacute;a, por lo que ya no se enviar&iacute;a. </font><font style="vertical-align: inherit;">Esto hace que se </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una </font><font style="vertical-align: inherit;">HttpSession</font><font style="vertical-align: inherit;"> completamente nueva </font><font style="vertical-align: inherit;">, con una cookie de sesi&oacute;n completamente nueva que se utiliza.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クライアント側では、ブラウザインスタンスが実行されている限り、セッションCookieは存続します。</font><font style="vertical-align: inherit;">そのため、クライアントがブラウザインスタンス（すべてのタブ/ウィンドウ）を閉じると、クライアント側でセッションが破棄されます。</font><font style="vertical-align: inherit;">新しいブラウザインスタンスでは、セッションに関連付けられたCookieは存在しないため、送信されなくなります。</font><font style="vertical-align: inherit;">これにより、まったく新しい</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が作成され、まったく新しいセッションCookieが使用されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트 측에서 세션 쿠키는 브라우저 인스턴스가 실행되는 동안 계속 유지됩니다. </font><font style="vertical-align: inherit;">따라서 클라이언트가 브라우저 인스턴스 (모든 탭 / 창)를 닫으면 세션이 클라이언트 쪽에서 휴지통으로 이동합니다. </font><font style="vertical-align: inherit;">새 브라우저 인스턴스에는 세션과 관련된 쿠키가 존재하지 않으므로 더 이상 쿠키가 전송되지 않습니다. </font><font style="vertical-align: inherit;">이로 인해 </font><font style="vertical-align: inherit;">완전히 새로운 세션 쿠키가 사용되는 </font><font style="vertical-align: inherit;">완전히 새로운 </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 생성됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На стороне клиента cookie сеанса остается активным до тех пор, пока работает экземпляр браузера. </font><font style="vertical-align: inherit;">Таким образом, если клиент закрывает экземпляр браузера (все вкладки / окна), то сеанс удаляется на стороне клиента. </font><font style="vertical-align: inherit;">В новом экземпляре браузера cookie, связанный с сеансом, не существует, поэтому он больше не будет отправляться. </font><font style="vertical-align: inherit;">Это приводит к созданию совершенно нового </font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с использованием совершенно нового сеансового cookie.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在客户端，只要浏览器实例正在运行，会话cookie就会保持活动状态。</font><font style="vertical-align: inherit;">因此，如果客户端关闭浏览器实例（所有选项卡/窗口），则会话将被丢弃在客户端侧。</font><font style="vertical-align: inherit;">在新的浏览器实例中，与会话关联的cookie将不存在，因此将不再发送。</font><font style="vertical-align: inherit;">这将导致</font><font style="vertical-align: inherit;">创建</font><font style="vertical-align: inherit;">一个全新的</font></font> <code>HttpSession</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并使用一个全新的会话cookie。</font></font>

source: Once he's on the service mode and on the groove, the <em>same</em> servlet will work on the requests from all other clients.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una vez que est&eacute; en el modo de servicio y en el ritmo, el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mismo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> servlet funcionar&aacute; en las solicitudes de todos los dem&aacute;s clientes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">彼がサービスモードとグルーブに入る</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font><em><font style="vertical-align: inherit;">同じ</font></em><font style="vertical-align: inherit;">サーブレットが他のすべてのクライアントからのリクエストで機能します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그가 서비스 모드와 그루브에 있으면 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">같은</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 서블릿이 다른 모든 클라이언트의 요청에 대해 작동합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как только он </font><font style="vertical-align: inherit;">перейдет </font><font style="vertical-align: inherit;">в сервисный режим и в паз, тот </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">же</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сервлет будет работать с запросами всех других клиентов.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">一旦他进入了服务模式并参与了</font><font style="vertical-align: inherit;">工作</font><font style="vertical-align: inherit;">，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同一个</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> servlet将处理来自所有其他客户端的请求。</font></font>

source: Once the search is successful session ID is stored into HttpServletResponse and the existing session object references are returned to the doGet() or doPost() of UserDefineservlet.
es: Una vez que la búsqueda se realiza con éxito,el ID de la sesión se almacena en HttpServletResponse y las referencias de objetos de sesión existentes se devuelven a doGet()o doPost()de UserDefineservlet.
ja: 検索が成功すると、セッションIDがHttpServletResponseに格納され、既存のセッションオブジェクトの参照がUserDefineservletのdoGet()またはdoPost()に返されます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">검색에 성공하면 세션 ID가 HttpServletResponse에 저장되고 기존 세션 오브젝트 참조가 UserDefineservlet의 doGet () 또는 doPost ()로 리턴됩니다.</font></font>
ru: После успешного поиска идентификатор сеанса сохраняется в HttpServletResponse,а существующие ссылки на объекты сеанса возвращаются в doGet()или doPost()UserDefineservlet.
zh_cn: 一旦搜索成功,Session ID被存储到HttpServletResponse中,并将现有的Session对象引用返回到UserDefineservlet的doGet()或doPost()。

source: One more similar question, if there are <code>n</code> users accessing a particular servlet, then this servlet gets instantiated only the first time the first user accessed it or does it get instantiated for all the users separately? In other words, what happens to the instance variables?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una pregunta similar m&aacute;s, si hay </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usuarios accediendo a un servlet particular, entonces este servlet se instancia solo la primera vez que el primer usuario accedi&oacute; o &iquest;se instancia para todos los usuarios por separado? En otras palabras, &iquest;qu&eacute; pasa con las variables de instancia?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ある場合は、1つの以上同様の質問は、</font></font> <code>n</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、特定のサーブレットにアクセスするユーザは、このサーブレットは、最初のユーザーがそれにアクセスしたか、それは別に、すべてのユーザーに対してインスタンスを取得ん初回のみをインスタンス化しますか？つまり、インスタンス変数はどうなりますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나 더 비슷한 질문, </font><font style="vertical-align: inherit;">특정 서블릿에 액세스하는 </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 명의 사용자가있는 경우이 서블릿은 처음 사용자가 처음 액세스 할 때만 인스턴스화되거나 모든 사용자에 대해 개별적으로 인스턴스화됩니까? </font><font style="vertical-align: inherit;">즉, 인스턴스 변수는 어떻게됩니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Еще один похожий вопрос: если </font></font> <code>n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пользователей имеют доступ к определенному сервлету, то этот сервлет создается только при первом обращении к нему первого пользователя, или он создается для всех пользователей отдельно? Другими словами, что происходит с переменными экземпляра?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">还有一个类似的问题，如果有</font></font> <code>n</code> 个<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用户正在访问特定的servlet，那么仅当第一个用户第一次访问该servlet时才实例化该servlet，还是单独为所有用户实例化该servlet？换句话说，实例变量将如何处理？</font></font>

source: Q) In the lifetime of servlet how many times instantiation and initialization happens ??
es: P)En la vida del servlet,¿cuántas veces ocurre la instanciación e inicialización?
ja: Q)サーブレットの寿命の間に、インスタンス化と初期化は何回行われますか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Q) 서블릿의 수명 동안 몇 번이나 인스턴스화 및 초기화가 발생합니까 ??</font></font>
ru: Q)За время жизни сервлета,сколько раз происходит инстанцирование и инициализация ???
zh_cn: Q)在servlet的生命周期中,实例化和初始化发生多少次?

source: Q)How session concept works?
es: P)¿Cómo funciona el concepto de sesión?
ja: Q)セッションのコンセプトは?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Q) 세션 개념은 어떻게 작동합니까?</font></font>
ru: Q)Как работает концепция сеанса?
zh_cn: Q)会话概念是如何运作的?

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: Servlet Instantiation
es: Instanciación de servilletas
ja: サーブレットのインスタンス化
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 인스턴스화</font></font>
ru: инстанцирование сервлета
zh_cn: Servlet实例化

source: Servlet engine creates servletConfig interface object encapsulating the above missing information into it servlet engine calls init() of the servlet by supplying servletConfig object references as an argument. Once init() is completely executed servlet is ready to serve the client request.
es: El motor de servlets crea un objeto de interfaz servletConfig encapsulando la información que falta en él El motor de servlets llama a init()del servlet suministrando como argumento las referencias del objeto servletConfig.Una vez que init()se ejecuta completamente,el servlet está listo para servir la solicitud del cliente.
ja: サーブレットエンジンは上記の足りない情報をカプセル化した servletConfig インターフェースオブジェクトを作成します。 サーブレットエンジンは引数として servletConfig オブジェクトの参照を与えてサーブレットの init()を呼び出します。init()が完全に実行されると、サーブレットはクライアントのリクエストに対応する準備が整います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 엔진은 위에 누락 된 정보를 캡슐화하는 servletConfig 인터페이스 오브젝트를 작성합니다. 서블릿 엔진은 servletConfig 오브젝트 참조를 인수로 제공하여 서블릿의 init ()를 호출합니다. </font><font style="vertical-align: inherit;">init ()가 완전히 실행되면 서블릿은 클라이언트 요청을 처리 할 준비가됩니다.</font></font>
ru: Сервлет-двигатель создает объект интерфейса servletConfig,инкапсулируя в него отсутствующую информацию,вызываемую сервлет-двигателем init()сервлета,предоставляя в качестве аргумента ссылки на объект servletConfig.После того,как init()полностью выполнен,сервлет готов обслуживать запрос клиента.
zh_cn: Servlet引擎通过提供servletConfig对象的引用作为参数,创建servletConfig接口对象,将上述缺失的信息封装在其中。一旦 init()被完全执行,servlet就可以服务于客户端请求。

source: Servlet seems to handle multiple concurrent browser requests synchronously
es: El Servlet parece manejar múltiples peticiones simultáneas del navegador de forma sincronizada
ja: サーブレットは複数の同時進行ブラウザリクエストを同期的に処理するようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿은 여러 동시 브라우저 요청을 동 기적으로 처리하는 것 같습니다</font></font>
ru: Сервлет,кажется,обрабатывает несколько одновременных запросов браузера синхронно.
zh_cn: Servlet似乎可以同步处理多个浏览器的并发请求。

source: Session in Java servlets is the same as session in other languages such as PHP. It is unique to the user. The server can keep track of it in different ways such as cookies, url rewriting etc. This <a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html">Java doc</a> article explains it in the context of Java servlets and indicates that exactly how session is maintained is an implementation detail left to the designers of the server. The specification only stipulates that it must be maintained as unique to a user across multiple connections to the server. Check out <a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm">this article from Oracle</a> for more information about both of your questions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La sesi&oacute;n en servlets de Java es lo mismo que la sesi&oacute;n en otros lenguajes como PHP. Es exclusivo del usuario. El servidor puede seguirlo de diferentes maneras, como cookies, reescritura de URL, etc. Este </font><font style="vertical-align: inherit;">art&iacute;culo de </font></font><a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentaci&oacute;n de Java lo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> explica en el contexto de los servlets de Java e indica que exactamente c&oacute;mo se mantiene la sesi&oacute;n es un detalle de implementaci&oacute;n que se deja a los dise&ntilde;adores del servidor. La especificaci&oacute;n solo estipula que debe mantenerse como &uacute;nico para un usuario a trav&eacute;s de m&uacute;ltiples conexiones al servidor. Consulte </font></font><a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">este art&iacute;culo de Oracle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener m&aacute;s informaci&oacute;n sobre ambas preguntas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaサーブレットのセッションは、PHPなどの他の言語のセッションと同じです。これはユーザーに固有です。サーバーは、Cookie、URL書き換えなどのさまざまな方法でそれを追跡できます。この</font></font><a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Javaドキュメントの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">記事では、Javaサーブレットのコンテキストでそれを説明し、セッションの維持方法は、サーバーの設計者が実装の詳細に委ねていることを示しています。この仕様では、サーバーへの複数の接続にわたってユーザーに対して一意である必要があることだけが規定されています。チェックアウト</font></font><a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">のOracleからこの記事を</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたの質問の両方の詳細については。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 서블릿의 세션은 PHP와 같은 다른 언어의 세션과 동일합니다. 사용자에게 고유합니다. 서버는 쿠키, URL 재 작성 등과 같은 다양한 방법으로 서버를 추적 할 수 있습니다.이 </font></font><a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java doc</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기사는 Java 서블릿의 컨텍스트에서이를 설명하고 세션을 유지 보수하는 방법이 서버 설계자에게 남겨진 구현 세부 사항임을 정확하게 나타냅니다. 이 사양은 서버에 대한 여러 연결을 통해 사용자에게 고유하게 유지되어야한다고 규정합니다. </font><font style="vertical-align: inherit;">두 가지 질문에 대한 자세한 내용은 </font></font><a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Oracle의이 기사를</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 확인하십시오 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сеанс в Java-сервлетах аналогичен сеансу в других языках, таких как PHP. Это уникально для пользователя. Сервер может отслеживать его различными способами, такими как файлы cookie, перезапись URL-адреса и т. Д. В этой </font><font style="vertical-align: inherit;">статье, посвященной </font></font><a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java,</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объясняется это в контексте сервлетов Java и указывается, что именно то, как поддерживается сеанс, является подробностью реализации, оставленной разработчикам сервера. Спецификация только предусматривает, что она должна поддерживаться как уникальная для пользователя при нескольких подключениях к серверу. Проверьте </font></font><a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту статью от Oracle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для получения дополнительной информации по обоим вашим вопросам.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java Servlet中的会话与其他语言（例如PHP）中的会话相同。它是用户唯一的。服务器可以通过cookie，URL重写等不同方式对其进行跟踪。此</font></font><a href="http://java.sun.com/products/servlet/2.2/javadoc/javax/servlet/http/HttpSession.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java文档</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文章在Java servlet的上下文中对其进行了说明，并指出会话的确切维护方式是服务器设计者的实现细节。该规范仅规定，必须在与服务器的多个连接上将其维护为对用户唯一。</font></font><a href="http://download.oracle.com/docs/cd/A97336_01/buslog.102/a83726/tecbkgn2.htm"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从Oracle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">查阅</font><font style="vertical-align: inherit;">本文，</font><font style="vertical-align: inherit;">以获取有关这两个问题的更多信息。</font></font>

source: Suppose, I have a webserver which holds numerous servlets. For information passing among those servlets I am setting session and instance variables.
es: Supongamos que tengo un servidor web que contiene numerosos servlets.Para la información que pasa entre esos servlets estoy estableciendo variables de sesión y de instancia.
ja: 例えば、多数のサーブレットを保持しているウェブサーバがあるとします。それらのサーブレットの間で情報を渡すために、私はセッション変数とインスタンス変数を設定しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수많은 서블릿을 보유하고있는 웹 서버가 있다고 가정 해보십시오. </font><font style="vertical-align: inherit;">해당 서블릿간에 정보를 전달하기 위해 세션 및 인스턴스 변수를 설정하고 있습니다.</font></font>
ru: Предположим,у меня есть веб-сервер,на котором хранятся многочисленные сервлеты.Для передачи информации между этими сервлетами я устанавливаю переменные сеанса и экземпляра.
zh_cn: 假设,我有一个web服务器,里面有许多servlets。为了在这些servlet之间传递信息,我正在设置会话和实例变量。
