Repository: rueisnom/feedback
Catalog: xlf/31/06/45/2/3106452.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: When the servlet container (like <a href="http://tomcat.apache.org">Apache Tomcat</a>) starts up, it will deploy and load all its web applications. When a web application is loaded, the servlet container creates the <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"><code>ServletContext</code></a> once and keeps it in the server's memory. The web app's <code>web.xml</code> and all of included <code>web-fragment.xml</code> files is parsed, and each <code>&lt;servlet&gt;</code>, <code>&lt;filter&gt;</code> and <code>&lt;listener&gt;</code> found (or each class annotated with <code>@WebServlet</code>, <code>@WebFilter</code> and <code>@WebListener</code> respectively) is instantiated once and kept in the server's memory as well. For each instantiated filter, its <code>init()</code> method is invoked with a new <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"><code>FilterConfig</code></a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando se </font><font style="vertical-align: inherit;">inicia </font><font style="vertical-align: inherit;">el contenedor de servlets (como </font></font><a href="http://tomcat.apache.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Tomcat</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), desplegar&aacute; y cargar&aacute; todas sus aplicaciones web. Cuando se carga una aplicaci&oacute;n web, el contenedor de servlet crea el </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"> <code>ServletContext</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una vez y lo mantiene en la memoria del servidor. Se </font><font style="vertical-align: inherit;">analiza el archivo </font></font> <code>web.xml</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> la aplicaci&oacute;n web </font><font style="vertical-align: inherit;">y todos </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> archivos </font><font style="vertical-align: inherit;">web-fragment.xml</font><font style="vertical-align: inherit;"> incluidos </font><font style="vertical-align: inherit;">, y cada </font></font> <code>&lt;servlet&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;filter&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>&lt;listener&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> encontrados (o cada clase anotada con </font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>@WebFilter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>@WebListener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> respectivamente) instanciado una vez y guardado en la memoria del servidor tambi&eacute;n. Para cada filtro instanciado, su </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El m&eacute;todo se invoca con un nuevo </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"> <code>FilterConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットコンテナ（</font></font><a href="http://tomcat.apache.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Tomcatなど</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）が起動すると、すべてのWebアプリケーションがデプロイおよびロードされます。 Webアプリケーションがロードされると、サーブレットコンテナは</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"> <code>ServletContext</code> を</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 1回</font><font style="vertical-align: inherit;">作成し、</font><font style="vertical-align: inherit;">それをサーバーのメモリに保持します。ウェブアプリケーションの</font></font> <code>web.xml</code> ファイル<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">および付属のすべて</font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ファイルが解析され、各</font></font> <code>&lt;servlet&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>&lt;filter&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>&lt;listener&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">見つかった（または各クラスがで注釈さ</font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>@WebFilter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font> <code>@WebListener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それぞれ）があります一度インスタンス化され、サーバーのメモリにも保持されます。インスタンス化された各フィルターについて、その</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドは、新しい</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"> <code>FilterConfig</code> で</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">呼び出されます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너 (예 : </font></font><a href="http://tomcat.apache.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Tomcat</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )가 시작되면 모든 웹 애플리케이션을 배치하고로드합니다. 웹 애플리케이션이로드되면 서블릿 컨테이너는 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"> <code>ServletContext</code> 를</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 한 번 </font><font style="vertical-align: inherit;">작성 </font><font style="vertical-align: inherit;">하여 서버의 메모리에 보관합니다. </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 </font><font style="vertical-align: inherit;">web.xml</font><font style="vertical-align: inherit;"> 및 포함 된 모든 </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 파일이 구문 분석되고 각 </font></font> <code>&lt;servlet&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;filter&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>&lt;listener&gt;</code> 가<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 발견되었습니다 (또는 각각 </font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>@WebFilter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>@WebListener</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 주석이 </font><font style="vertical-align: inherit;">지정된</font><font style="vertical-align: inherit;"> 각 클래스 </font><font style="vertical-align: inherit;">). 한 번 인스턴스화하고 서버의 메모리에도 보관합니다. 인스턴스화 된 각 필터에 대해 </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">메소드는 새로운 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"> <code>FilterConfig</code> 로</a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 호출됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда контейнер сервлета (например, </font></font><a href="http://tomcat.apache.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Tomcat</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) запускается, он развертывает и загружает все свои веб-приложения. Когда веб-приложение загружено, контейнер сервлета создает </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"> <code>ServletContext</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> один раз и сохраняет его в памяти сервера. </font></font> <code>web.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> веб-приложения </font><font style="vertical-align: inherit;">и все включенные </font><font style="vertical-align: inherit;">файлы </font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> XML, и каждый </font><font style="vertical-align: inherit;">найденный </font><font style="vertical-align: inherit;">файл </font></font> <code>&lt;servlet&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>&lt;filter&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>&lt;listener&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (или каждый класс, </font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>@WebFilter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>@WebListener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> соответственно) равен Создан один раз и хранится в памяти сервера. Для каждого экземпляра фильтра его </font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">метод вызывается с новым </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"> <code>FilterConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当servlet容器（例如</font></font><a href="http://tomcat.apache.org"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Tomcat</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）启动时，它将部署并加载其所有Web应用程序。加载Web应用程序时，Servlet容器会</font><font style="vertical-align: inherit;">一次</font><font style="vertical-align: inherit;">创建</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContext.html"> <code>ServletContext</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并将其保存在服务器的内存中。 web应用程序的</font></font> <code>web.xml</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和所有包含的</font></font> <code>web-fragment.xml</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文件被解析，并且每个</font></font> <code>&lt;servlet&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>&lt;filter&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>&lt;listener&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实测值（或带有加注解的每个类</font></font> <code>@WebServlet</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>@WebFilter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>@WebListener</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">分别）是实例化一次并保存在服务器的内存中。对于每个实例化的过滤器，其</font></font> <code>init()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">用新的</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/FilterConfig.html"> <code>FilterConfig</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">调用该</font><font style="vertical-align: inherit;">方法</font><font style="vertical-align: inherit;">。</font></font>

source: When the servlet container (like Apache Tomcat) starts up, it will read from the web.xml file (only one per application) if anything goes wrong or shows up an error at container side console, otherwise, it will deploy and load all web applications by using web.xml (so named it as deployment descriptor).
es: Cuando el contenedor del servlet (como Apache Tomcat)se inicia,leerá del archivo web.xml (sólo uno por aplicación)si algo sale mal o muestra un error en la consola del lado del contenedor,de lo contrario,desplegará y cargará todas las aplicaciones web utilizando web.xml (así llamado como descriptor de despliegue).
ja: サーブレットコンテナ(Apache Tomcatなど)が起動すると、何か問題が発生したり、コンテナ側のコンソールでエラーが表示された場合は、web.xmlファイル(アプリケーションごとに1つだけ)から読み込み、それ以外の場合はweb.xml(デプロイメント記述子と名付けられています)を使ってすべてのWebアプリケーションをデプロイしてロードします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너 (Apache Tomcat과 같은)가 시작될 때 컨테이너 측 콘솔에 문제가 발생하거나 오류가 표시되면 web.xml 파일 (애플리케이션 당 하나만)에서 읽습니다. 그렇지 않으면 모든 웹이 배포되고로드됩니다. web.xml을 사용하여 응용 프로그램 (배포 설명 자라고도 함)</font></font>
ru: Когда запускается контейнер сервлетов (например,Apache Tomcat),он будет читать из файла web.xml (только один на приложение),если что-то пойдет не так или появится ошибка в консоли контейнера,в противном случае,он развернет и загрузит все веб-приложения с помощью web.xml (так называемый дескриптор установки).
zh_cn: 当servlet容器(如Apache Tomcat)启动时,如果有什么问题或在容器端控制台显示错误,它将从web.xml文件中读取(每个应用程序只读取一个),否则,它将通过web.xml(所以命名为部署描述符)来部署和加载所有的web应用程序。

source: When the servlet container is finished with all of the above described initialization steps, then the <a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"><code>ServletContextListener#contextInitialized()</code></a> will be invoked.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando el contenedor de servlet finaliza con todos los pasos de inicializaci&oacute;n descritos anteriormente, se </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextInitialized()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">サーブレットコンテナが上記の初期化手順をすべて完了すると、</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextInitialized()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が呼び出されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">서블릿 컨테이너가 위에서 설명한 모든 초기화 단계로 완료되면 </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextInitialized()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 호출됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Когда контейнер сервлета завершит все описанные выше шаги инициализации, </font><font style="vertical-align: inherit;">будет вызван </font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextInitialized()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当Servlet容器完成上述所有初始化步骤后，</font><font style="vertical-align: inherit;">将调用</font></font><a href="https://javaee.github.io/javaee-spec/javadocs/javax/servlet/ServletContextListener.html#contextInitialized-javax.servlet.ServletContextEvent-"> <code>ServletContextListener#contextInitialized()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
