Repository: rueisnom/feedback
Catalog: xlf/15/54/09/9/1554099.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Update Eclipse: Make sure your Eclipse installation and the ADT plug-in are fully up-to-date.
es: Actualizar Eclipse:Asegúrate de que tu instalación de Eclipse y el plug-in ADT estén completamente actualizados.
ja: Eclipseをアップデートしてください。Eclipse のインストールと ADT プラグインが完全に最新であることを確認してください。
ko: Eclipse 업데이트 : Eclipse 설치 및 ADT 플러그인이 최신 상태인지 확인하십시오.
ru: Обновить Затмение:Убедитесь,что ваша установка Eclipse и плагин ADT полностью обновлены.
zh_cn: 更新Eclipse。确保你的Eclipse安装和ADT插件完全更新。

source: Update your Android Tools: After each Eclipse plug-in update, it is important to update your Android SDK Tools. To do this, launch the Android SDK Manager and update all the Android SDK components. To take advantage of HAXM, you must be on at least release version 17.
es: Actualiza tus herramientas de Android:Después de cada actualización del plug-in de Eclipse,es importante que actualices tus herramientas de Android SDK.Para ello,inicie el Administrador del SDK de Android y actualice todos los componentes del SDK de Android.Para aprovechar las ventajas de HAXM,debe estar al menos en la versión 17.
ja: Androidツールをアップデートしましょう。Eclipseのプラグインをアップデートするたびに、Android SDK Toolsをアップデートすることが重要です。これを行うには、Android SDK Managerを起動し、すべてのAndroid SDKコンポーネントを更新します。HAXMを利用するには、少なくともリリースバージョン17である必要があります。
ko: Android 도구 업데이트 : 각 Eclipse 플러그인 업데이트 후에 Android SDK 도구를 업데이트해야합니다. 이렇게하려면 Android SDK Manager를 시작하고 모든 Android SDK 구성 요소를 업데이트하십시오. HAXM을 이용하려면 최소한 릴리스 버전 17 이상이어야합니다.
ru: Обновите свои инструменты Android:После каждого обновления плагина Eclipse,важно обновить ваш Android SDK Tools.Для этого запустите Android SDK менеджер и обновите все компоненты Android SDK.Чтобы воспользоваться преимуществами HAXM,вы должны быть как минимум на версии 17.
zh_cn: 更新你的Android工具。每次Eclipse插件更新后,更新你的Android SDK工具是很重要的。要做到这一点,请启动Android SDK管理器,更新所有的Android SDK组件。要利用HAXM的优势,你必须至少在17版本上。

source: Use the <a href="http://bluestacks.com/">Bluestacks Player</a>. It runs Android 2.3.4 and is very fluid and fast. Sometimes it is even faster than a normal device. The only downside is, that you can just test apps on the API Level 10 and just on one screen size, but it's perfect just for testing if it's working or not. Just connect the Player with the <code>adb</code> by running
es: Usa el <a href="http://bluestacks.com/">Bluestacks Player</a> . Ejecuta Android 2.3.4 y es muy fluido y r&aacute;pido. A veces es incluso m&aacute;s r&aacute;pido que un dispositivo normal. El &uacute;nico inconveniente es que puedes probar aplicaciones en el nivel 10 de API y solo en un tama&ntilde;o de pantalla, pero es perfecto solo para probar si funciona o no. Simplemente conecte el reproductor con el <code>adb</code> ejecutando
ja: <a href="http://bluestacks.com/">Bluestacks Playerを</a>使用してください。 Android 2.3.4を実行し、非常に流動的で高速です。 時にはそれは通常のデバイスよりもさらに高速です。 唯一の欠点は、APIレベル10と1つの画面サイズでアプリをテストできることですが、機能しているかどうかをテストするのに最適です。 実行してプレーヤーを <code>adb</code> に接続するだけです
ko: <a href="http://bluestacks.com/">BlueStacks Player를</a> 사용하십시오. Android 2.3.4를 실행하며 매우 유동적이고 빠릅니다. 때로는 일반 장치보다 훨씬 빠릅니다. 유일한 단점은 API 레벨 10과 하나의 화면 크기에서만 앱을 테스트 할 수 있다는 것입니다.하지만 작동하는지 여부를 테스트하기에 완벽합니다. 다음을 실행하여 플레이어를 <code>adb</code> 와 연결하십시오.
ru: Используйте <a href="http://bluestacks.com/">проигрыватель Bluestacks</a> . Он работает под управлением Android 2.3.4 и очень плавный и быстрый. Иногда это даже быстрее, чем обычное устройство. Единственным недостатком является то, что вы можете просто тестировать приложения на уровне API уровня 10 и только на одном размере экрана, но это идеально подходит только для тестирования, работает ли он или нет. Просто подключите плеер с <code>adb</code> , запустив
zh_cn: 使用<a href="http://bluestacks.com/">Bluestacks Player</a> 。 它运行Android 2.3.4，非常流畅和快速。 有时它甚至比普通设备快。 唯一的缺点是，您可以仅在API级别10上且仅在一个屏幕尺寸上测试应用程序，但这非常适合于测试其是否正常工作。 只需通过运行将播放器与 <code>adb</code> 连接

source: Use the Intel x86 Emulator Accelerator
es: Usar el acelerador emulador Intel x86
ja: インテル x86 エミュレータ・アクセラレーターを使用する
ko: Intel x86 에뮬레이터 가속기 사용
ru: Используйте ускоритель Intel x86 Emulator Accelerator
zh_cn: 使用英特尔x86仿真器加速器

source: Visual Studio Emulator for Android
es: Emulador de Visual Studio para Android
ja: Android用Visual Studioエミュレータ
ko: Android 용 Visual Studio 에뮬레이터
ru: Эмулятор Visual Studio Emulator для Android

source: Well, since somebody suggested Android x86 as an alternative testing emulator, I'll also present my favorite. This might not be an alternative for everyone, but for me it's perfect!
es: Bueno,ya que alguien sugirió Android x86 como un emulador de pruebas alternativo,también presentaré mi favorito.Puede que no sea una alternativa para todos,pero para mí es perfecto.
ja: さて、誰かがAndroid x86をテスト用エミュレータとして提案してくれたので、私のお気に入りを紹介します。これはすべての人のための代替ではないかもしれませんが、私にとっては完璧です!
ko: 글쎄, 누군가가 대체 테스트 에뮬레이터로 Android x86을 제안했기 때문에 내가 좋아하는 것을 제시합니다. 이것은 모든 사람의 대안이 아닐 수도 있지만 나에게는 완벽합니다!
ru: Ну,так как кто-то предложил Android x86 в качестве альтернативного эмулятора тестирования,я также представлю свой любимый.Это может быть не альтернативой для всех,но для меня это идеально!
zh_cn: 好吧,既然有人推荐了Android x86作为替代测试模拟器,我也来介绍一下我的最爱。这可能不是每个人都可以选择的,但对我来说,它是完美的!

source: When the Android emulator is starting, open up the Task Manager, look under the Process tab, look for "emulator-arm.exe" or "emulator-arm.exe *32"... Right click on it, select Processor Affinity and assign as much processor as you like to the emulator.
es: Cuando el emulador de Android se esté iniciando,abre el Administrador de Tareas,busca en la pestaña de Proceso,busca "emulador-arm.exe" o "emulador-arm.exe *32"...Haz clic con el botón derecho del ratón,selecciona Processor Affinity y asigna al emulador todo el procesador que quieras.
ja: Androidエミュレータが起動したら、タスクマネージャを開き、プロセスタブを開き、"emulator-arm.exe "か "emulator-arm.exe *32 "を探してください。その上で右クリックし、Processor Affinityを選択し、エミュレータに好きなだけプロセッサを割り当てます。
ko: Android 에뮬레이터가 시작되면 작업 관리자를 열고 프로세스 탭에서 "emulator-arm.exe"또는 "emulator-arm.exe * 32"를 찾으십시오. 마우스 오른쪽 단추로 클릭하고 프로세서 선호도를 선택한 후 에뮬레이터에 원하는만큼 프로세서를 할당하십시오.
ru: Когда Android эмулятор запускается,откройте диспетчер задач,посмотрите на вкладке "Процесс",ищите "эмулятор-arm.exe" или "эмулятор-arm.exe *32"....Щелкните правой кнопкой мыши на нем,выберите Processor Affinity и назначить столько процессоров,сколько вы хотите,чтобы эмулятор.
zh_cn: 当安卓模拟器启动后,打开任务管理器,在 "进程 "选项卡下寻找 "emulator-arm.exe "或 "emulator-arm.exe *32".....右键点击它,选择 "Processor Affinity",然后根据自己的喜好给模拟器分配处理器。

source: Why is the Android emulator so slow? How can we speed up the Android emulator
es: ¿Por qué el emulador de Android es tan lento? ¿Cómo podemos acelerar el emulador de Android
ja: Androidエミュレータが遅いのはなぜですか?Androidエミュレータを高速化するには
ko: Android 에뮬레이터가 왜 그렇게 느린가요? Android 에뮬레이터의 속도를 높이는 방법
ru: Почему эмулятор Android работает так медленно? Как мы можем ускорить эмулятор Андроид.
zh_cn: 为什么安卓模拟器的运行速度这么慢?怎样才能加快安卓模拟器的运行速度?

source: Windows Android Emulator
es: Emulador de Windows Android
ja: WindowsのAndroidエミュレータ
ko: 윈도우 안드로이드 에뮬레이터
ru: эмулятор Windows Android
zh_cn: Windows Android 仿真器

source: With these settings the software keyboard no longer appears, nor do the on-screen back, menu, and recent keys. This appears to be a limitation of the current ICS Intel x86 system image. You will need to use <a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">the keyboard shortcuts</a>.
es: Con esta configuraci&oacute;n, el teclado del software ya no aparece, ni la parte posterior en pantalla, el men&uacute; y las teclas recientes. Esto parece ser una limitaci&oacute;n de la imagen actual del sistema ICS Intel x86. Deber&aacute; usar <a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">los atajos de teclado</a> .
ja: これらの設定では、ソフトウェアキーボードは表示されなくなり、画面上の戻る、メニュー、最近のキーも表示されなくなります。 これは、現在のICS Intel x86システムイメージの制限のようです。 <a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">キーボードショートカット</a>を使用する必要があります。
ko: 이 설정을 사용하면 소프트웨어 키보드가 더 이상 나타나지 않으며 화면 뒷면, 메뉴 및 최근 키도 표시되지 않습니다. 이것은 현재 ICS Intel x86 시스템 이미지의 제한으로 보입니다. <a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">바로 가기 키</a> 를 사용해야 합니다 .
ru: С этими настройками больше не появляется программная клавиатура, а также экранная клавиша &laquo;Назад&raquo;, меню и последние клавиши. Похоже, что это ограничение текущего образа системы ICS Intel x86. Вам нужно будет использовать <a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">сочетания клавиш</a> .
zh_cn: 通过这些设置，软件键盘将不再显示，屏幕上的后退，菜单和最新按键也将不再显示。 这似乎是当前ICS Intel x86系统映像的限制。 您将需要使用<a href="http://developer.android.com/guide/developing/tools/emulator.html#KeyMapping">键盘快捷键</a> 。

source: You can create emulator.bat with following command to start the emulator. It will start faster.
es: Puedes crear emulator.bat con el siguiente comando para iniciar el emulador.Se iniciará más rápido.
ja: 以下のコマンドでemulator.batを作成するとエミュレータが起動します。起動が早くなります。
ko: 다음 명령으로 emulator.bat를 만들어 에뮬레이터를 시작할 수 있습니다. 더 빨리 시작됩니다.
ru: Вы можете создать эмулятор.bat следующей командой для запуска эмулятора.Он запустится быстрее.
zh_cn: 你可以用以下命令创建emulator.bat来启动仿真器。它的启动速度会更快。

source: You can now enable the Quick Boot option for Android Emulator. That will save emulator state, and it will start the emulator quickly on the next boot.
es: Ahora puedes activar la opción de arranque rápido para el emulador de Android.Esto guardará el estado del emulador,y lo iniciará rápidamente en el siguiente arranque.
ja: これでAndroidエミュレータのクイックブートオプションが有効になりました。これでエミュレータの状態が保存され、次の起動時にエミュレータが素早く起動するようになります。
ko: 이제 Android 에뮬레이터에 빠른 부팅 옵션을 사용할 수 있습니다. 그러면 에뮬레이터 상태가 저장되고 다음 부팅시 에뮬레이터가 빠르게 시작됩니다.
ru: Теперь вы можете включить опцию Быстрой загрузки для Android Emulator.Это позволит сохранить состояние эмулятора,и он будет быстро запустить эмулятор при следующей загрузке.
zh_cn: 现在你可以开启安卓模拟器的快速启动选项。这将保存模拟器的状态,并在下次启动时快速启动模拟器。

source: You can review the emulator issues on the <a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I/O 2011: Android Development Tools</a> talk, starting a 0:40:20.
es: Puede revisar los problemas del emulador en <a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I / O 2011:</a> charla sobre herramientas de desarrollo de Android , comenzando a las 0:40:20.
ja: エミュレータの問題は、 <a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I / O 2011で</a>確認できます：Android開発ツールのトーク、 0： 40 ： 20から。
ko: 0:40:20부터 <a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I / O 2011 : Android 개발 도구</a> 토크에서 에뮬레이터 문제를 검토 할 수 있습니다.
ru: Вы можете ознакомиться с проблемами эмулятора в <a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I / O 2011:</a> доклад по инструментам разработки Android , начиная с 0:40:20.
zh_cn: 您可以在<a href="http://www.youtube.com/watch?v=Oq05KqjXTvs&amp;feature=player_embedded#!">Google I / O 2011：Android开发工具</a>讲座中（从0:40:20开始）查看模拟器问题。

source: for the
es: para el
ja: のために
ko: 를 위해
ru: за
zh_cn: 为

source: keys to work. Page up/down/left/right can be performed using control + arrow keys.
es: las llaves del trabajo.La página arriba y abajo se puede realizar con las teclas de control+flecha.
ja: キーを押してください。ページの更新は、control+矢印キーで行うことができます。
ko: 작동하는 키. Ctrl + 화살표 키를 사용하여 페이지 위 / 아래 / 왼쪽 / 오른쪽을 수행 할 수 있습니다.
ru: ключи от работы.Обновление страницы по левому краю может быть выполнено с помощью клавиш управления+стрелок.
zh_cn: 按键工作。可以使用控制键+方向键来进行页面的上下浮动。
