Repository: rueisnom/feedback
Catalog: xlf/15/54/09/9/1554099.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: I had intermittent slow emulator (SDK v8.0) load times, up to three minutes on Intel Core i7 920 2.67&nbsp;GHz CPU running on Xubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12 guest with Eclipse (3.6.1) loaded. I changed the VirtualBox guest memory from 1024&nbsp;MB to 2048&nbsp;MB and from that point on, I never experienced the slowness again (load times consistent at 33 seconds, CPU load consistent at 20%). Both Eclipse and the emulator are memory hogs.
es: Tuve tiempos de carga intermitentes de emulador lento (SDK v8.0), hasta tres minutos en la CPU Intel Core i7 920 2.67 GHz que se ejecuta en Xubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12 invitado con Eclipse (3.6.1) cargado. Cambi&eacute; la memoria de invitado de VirtualBox de 1024 MB a 2048 MB y desde ese momento, nunca volv&iacute; a experimentar la lentitud (tiempos de carga consistentes a 33 segundos, carga de CPU consistente al 20%). Tanto Eclipse como el emulador son cerdos de memoria.
ja: Eclipse（3.6.1）がロードされたXubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12ゲストで実行されているIntel Core i7 920 2.67 GHz CPUで、断続的に遅いエミュレーター（SDK v8.0）のロード時間が最大3分ありました。 VirtualBoxゲストメモリを1024 MBから2048 MBに変更しましたが、それ以降、速度が低下することはありません（ロード時間は33秒で一定、CPUロードは20％で一定）。 Eclipseとエミュレーターはどちらもメモリを大量に消費します。
ko: Eclipse (3.6.1)가로드 된 Xubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12 게스트에서 실행되는 Intel Core i7 920 2.67 GHz CPU에서 최대 3 분의 간헐적 인 느린 에뮬레이터 (SDK v8.0)로드 시간이있었습니다. VirtualBox 게스트 메모리를 1024MB에서 2048MB로 변경했으며 그 시점부터는 다시 느려진 경험이 없었습니다 (로드 시간은 33 초, CPU로드는 20 %로 유지). Eclipse와 에뮬레이터는 모두 메모리 호그입니다.
ru: У меня была периодическая медленная загрузка эмулятора (SDK v8.0), до трех минут на процессоре Intel Core i7 920 с частотой 2,67 ГГц, работающем на гостевой Xubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12 с загруженным Eclipse (3.6.1). Я изменил гостевую память VirtualBox с 1024 МБ до 2048 МБ, и с этого момента я никогда больше не испытывал медлительности (время загрузки соответствовало 33 секундам, загрузка процессора соответствовала 20%). И Eclipse, и эмулятор являются боровами памяти.
zh_cn: 我有间歇性的慢速模拟器（SDK v8.0）加载时间，在装有Xubuntu 10.04 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 3.2.12 guest 虚拟机 （已加载Eclipse（3.6.1））上运行的Intel Core i7 920 2.67 GHz CPU上，长达三分钟。 我将VirtualBox来宾内存从1024 MB更改为2048 MB，从那时起，我再也没有遇到这种速度慢（加载时间一致为33秒，CPU载荷一致为20％）。 Eclipse和仿真器都是内存猪。

source: I have got a <strong>2.67</strong>&nbsp; GHz Celeron processor, and <strong>1.21</strong>&nbsp; GB of RAM on a <strong>x86</strong> Windows <strong>XP</strong> Professional machine.
es: Tengo un procesador Celeron de <strong>2.67</strong> GHz y <strong>1.21</strong> GB de RAM en una m&aacute;quina <strong>x86</strong> Windows <strong>XP</strong> Professional.
ja: <strong>x86</strong> Windows <strong>XP</strong> Professionalマシンには<strong>2.67</strong> GHzのCeleronプロセッサと<strong>1.21</strong> GBのRAMを搭載しています。
ko: <strong>x86</strong> Windows <strong>XP</strong> Professional 컴퓨터에 <strong>2.67GHz</strong> Celeron 프로세서와 <strong>1.21GB</strong> 의 RAM이 있습니다.
ru: У меня процессор Celeron с частотой <strong>2,67</strong> ГГц и <strong>1,21</strong> ГБ оперативной памяти на <strong>компьютере с</strong> Windows <strong>XP</strong> Professional <strong>x86</strong> .
zh_cn: 我在<strong>x86</strong> Windows <strong>XP</strong> Professional计算机上安装了<strong>2.67</strong> GHz赛扬处理器和<strong>1.21</strong> GB RAM。

source: I have recently upgraded my Ubuntu installation to <a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu&nbsp;10.04</a> LTS (Lucid Lynx) which in turn updated my Java version to:
es: Recientemente actualic&eacute; mi instalaci&oacute;n de <a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu</a> a Ubuntu 10.04 LTS (Lucid Lynx), que a su vez actualiz&oacute; mi versi&oacute;n de Java a:
ja: 最近、Ubuntuインストールを<a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu 10.04</a> LTS（Lucid Lynx）にアップグレードしました。これにより、Javaバージョンが次のように更新されました。
ko: 최근 Ubuntu 설치를 <a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu 10.04</a> LTS (Lucid Lynx)로 업그레이드하여 Java 버전을 다음과 같이 업데이트했습니다.
ru: Я недавно обновил мою установку Ubuntu до <a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu 10.04</a> LTS (Lucid Lynx), которая, в свою очередь, обновила мою версию Java до:
zh_cn: 我最近将我的Ubuntu安装升级到<a href="https://en.wikipedia.org/wiki/List_of_Ubuntu_releases#Ubuntu_10.04_LTS_.28Lucid_Lynx.29">Ubuntu 10.04</a> LTS（Lucid Lynx），这反过来又将我的Java版本更新为：

source: I noticed that the my emulator (<a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a> plugin) was significantly slowed by my <a href="http://en.wikipedia.org/wiki/Nvidia">Nvidia</a> graphics card anti-aliasing settings. Removing 2x anti aliasing from the graphics menu and changing it to application controlled made it more responsive. It is still slow, but better than it used to be.
es: Me di cuenta de que mi emulador (complemento <a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a> ) se ralentiz&oacute; significativamente por la configuraci&oacute;n de suavizado de mi tarjeta gr&aacute;fica <a href="http://en.wikipedia.org/wiki/Nvidia">Nvidia</a> . Eliminar 2x anti aliasing del men&uacute; de gr&aacute;ficos y cambiarlo a controlado por la aplicaci&oacute;n lo hizo m&aacute;s receptivo. Todav&iacute;a es lento, pero mejor de lo que sol&iacute;a ser.
ja: 私のエミュレーター（ <a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a>プラグイン）が、 <a href="http://en.wikipedia.org/wiki/Nvidia">Nvidia</a>グラフィックカードのアンチエイリアス設定によって大幅に遅くなっていることに気付きました。 グラフィックスメニューから2xアンチエイリアスを削除し、アプリケーション制御に変更すると、応答性が向上しました。 それはまだ遅いですが、以前よりも優れています。
ko: <a href="http://en.wikipedia.org/wiki/Nvidia">Nvidia</a> 그래픽 카드 앤티 앨리어싱 설정으로 인해 에뮬레이터 ( <a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a> 플러그인)가 상당히 느려졌습니다. 그래픽 메뉴에서 2x 안티 앨리어싱을 제거하고 응용 프로그램 제어로 변경하면 반응이 빨라졌습니다. 여전히 느리지 만 예전보다 낫습니다.
ru: Я заметил, что мой эмулятор (плагин <a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a> ) был значительно замедлен настройками сглаживания моей <a href="http://en.wikipedia.org/wiki/Nvidia">видеокарты Nvidia</a> . Удаление 2x сглаживания из графического меню и изменение его на управляемое приложением сделало его более отзывчивым. Это все еще медленно, но лучше, чем раньше.
zh_cn: 我注意到<a href="http://en.wikipedia.org/wiki/Nvidia">Nvidia</a>显卡的抗锯齿设置大大降低了我的模拟器（ <a href="http://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse</a>插件）的速度。 从图形菜单中删除2倍抗锯齿并将其更改为应用程序控制，使其响应速度更快。 它仍然很慢，但是比以前更好。

source: I'm using Windows 7.
es: Estoy usando Windows 7.
ja: Windows7を使っています。
ko: Windows 7을 사용하고 있습니다.
ru: Я использую Windows 7.
zh_cn: 我使用的是Windows 7系统。

source: I've noticed that the emulator starts much faster if there's no Dalvik Debug Monitor Server (DDMS) connected. So if you start the emulator from Virtual Device Manager "SDK Setup.exe" and Eclipse is not started, the emulator works faster.
es: He notado que el emulador se inicia mucho más rápido si no hay un servidor de monitorización de depuración Dalvik (DDMS)conectado.Así que si inicias el emulador desde el Administrador de Dispositivos Virtuales "SDK Setup.exe" y no se inicia el Eclipse,el emulador funciona más rápido.
ja: Dalvik Debug Monitor Server(DDMS)が接続されていないとエミュレータの起動がかなり速くなることに気がつきました。なので、Virtual Device Managerの「SDK Setup.exe」からエミュレータを起動して、Eclipseを起動していない状態でエミュレータを起動すると、エミュレータの動作が速くなります。
ko: DDMS (Dalvik Debug Monitor Server)가 연결되어 있지 않으면 에뮬레이터가 훨씬 빨리 시작됩니다. 따라서 Virtual Device Manager "SDK Setup.exe"에서 에뮬레이터를 시작하고 Eclipse가 시작되지 않으면 에뮬레이터가 더 빨리 작동합니다.
ru: Я заметил,что эмулятор запускается намного быстрее,если не подключен Dalvik Debug Monitor Server (DDMS).Поэтому если запустить эмулятор из менеджера виртуальных устройств "SDK Setup.exe" и не запустить Eclipse,то эмулятор будет работать быстрее.
zh_cn: 我注意到,如果没有连接Dalvik调试监控服务器(DDMS),模拟器的启动速度会快很多。因此,如果你从虚拟设备管理器 "SDK Setup.exe "启动仿真器,而Eclipse没有启动,仿真器的工作速度会更快。

source: If HAXM is working properly, you may see this message when launching the emulator:
es: Si HAXM funciona correctamente,puede ver este mensaje al lanzar el emulador:
ja: HAXMが正常に動作している場合、エミュレータの起動時にこのメッセージが表示されることがあります。
ko: HAXM이 제대로 작동하면 에뮬레이터를 시작할 때 다음 메시지가 표시 될 수 있습니다.
ru: Если HAXM работает корректно,это сообщение можно увидеть при запуске эмулятора:
zh_cn: 如果HAXM工作正常,在启动模拟器时可能会看到此消息。

source: If in case you don't know, you do not need to close the emulator every-time you run/debug your app. If you click run/debug when it's already open, your APK file will get uploaded to the emulator and start pretty much immediately. Emulator takes annoyingly long time only when it started the first time.
es: Si en caso de que no lo sepas,no necesitas cerrar el emulador cada vez que hagas un rundebug en tu aplicación.Si haces clic en rundebug cuando ya está abierto,tu archivo APK se subirá al emulador y se iniciará casi inmediatamente.El emulador sólo tarda mucho tiempo cuando se inicia la primera vez.
ja: あなたが知らない場合には、あなたのアプリをrundebugするたびにエミュレータを閉じる必要はありません。あなたはそれがすでに開いているときにrundebugをクリックした場合、あなたのAPKファイルは、エミュレータにアップロードされ、かなりすぐに開始されます。エミュレータは最初に起動した時だけ迷惑なほど長い時間がかかります。
ko: 모르는 경우 앱을 실행 / 디버그 할 때마다 에뮬레이터를 닫을 필요가 없습니다. 이미 열려있을 때 실행 / 디버그를 클릭하면 APK 파일이 에뮬레이터에 업로드되고 거의 즉시 시작됩니다. 에뮬레이터는 처음 시작했을 때만 귀찮게 오랜 시간이 걸립니다.
ru: Если в случае,если вы не знаете,вам не нужно закрывать эмулятор каждый раз,когда вы рундебаг вашего приложения.Если вы щелкнете rundebug,когда оно уже открыто,ваш файл APK будет загружен в эмулятор и запущен довольно немедленно.Эмулятор занимает раздражающе долгое время только при первом запуске.
zh_cn: 如果你不知道的话,你不需要每次rundebug你的应用时都要关闭模拟器。如果你点击rundebug时,它已经打开了,你的APK文件将被上传到模拟器,并立即启动。仿真器在第一次启动的时候才会花很长时间,这让人讨厌。

source: If the installer fails with the message that Intel VT must be turned on, you need to enable this in the <a href="http://en.wikipedia.org/wiki/BIOS">BIOS</a>. See the description for how to do this in <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">Enabling Intel VT (Virtualization Technology) </a></em>.
es: Si el instalador falla con el mensaje de que Intel VT debe estar encendido, debe habilitarlo en el <a href="http://en.wikipedia.org/wiki/BIOS">BIOS</a> . Consulte la descripci&oacute;n de c&oacute;mo hacer esto en <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">Habilitar Intel VT (Tecnolog&iacute;a de virtualizaci&oacute;n)</a></em> .
ja: Intel VTをオンにする必要があるというメッセージが表示されてインストーラーが失敗する場合は、 <a href="http://en.wikipedia.org/wiki/BIOS">BIOSで</a>これを有効にする必要があります 。 これを行う方法については、「 <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">Intel VT（Virtualization Technology）を有効に</a></em>する」の説明を参照してください。
ko: Intel VT를 켜야한다는 메시지와 함께 설치 프로그램이 실패하면 <a href="http://en.wikipedia.org/wiki/BIOS">BIOS</a> 에서이를 활성화해야합니다. <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">Intel VT 활성화 (가상화 기술)</a></em> 에서이를 수행하는 방법에 대한 설명을 참조하십시오.
ru: Если установщик завершает работу с сообщением о том, что Intel VT должен быть включен, необходимо включить это в <a href="http://en.wikipedia.org/wiki/BIOS">BIOS</a> . Описание того, как это сделать, см. В <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">разделе &laquo;Включение Intel VT (технология виртуализации)&raquo;</a></em> .
zh_cn: 如果安装程序失败，并提示必须打开Intel VT，则需要在<a href="http://en.wikipedia.org/wiki/BIOS">BIOS中</a>启用它。 请参阅&ldquo; <em><a href="http://forums.lenovo.com/t5/T400-T500-and-newer-T-series/Enabling-Intel-VT-Virtualization-Technology/ta-p/388479">启用英特尔VT（虚拟化技术）&rdquo;中</a></em>有关如何执行此操作的说明。

source: If you start the emulator from Eclipse: DDMS is there, so sometimes the emulator is extremely slow, but sometimes it's faster.
es: Si inicias el emulador desde Eclipse:El DDMS está ahí,así que a veces el emulador es extremadamente lento,pero a veces es más rápido.
ja: Eclipseからエミュレータを起動すると DDMSがあるので、エミュレータが極端に遅い時もありますが、たまに速い時もあります。
ko: Eclipse에서 에뮬레이터를 시작하면 DDMS가 있으므로 때로는 에뮬레이터가 매우 느리지 만 때로는 더 빠릅니다.
ru: Если вы запустите эмулятор из Затмения:DDMS есть,поэтому иногда эмулятор работает очень медленно,но иногда и быстрее.
zh_cn: 如果你从Eclipse中启动仿真器。DDMS就在那里,所以有时候模拟器的速度极慢,但有时候会比较快。

source: In the version of Android Studio I used (0.8.9), Android SDK Manager downloads HAXM but doesn't actually run the installer (I assume this will be fixed in later releases). To run the installer I had to go to C:\Program Files (x86)\Android\android-studio\sdk\extras\intel\Hardware_Accelerated_Execution_Manager and manually launch intelhaxm.exe.
es: En la versión de Android Studio que utilicé (0.8.9),Android SDK Manager descarga HAXM pero en realidad no ejecuta el instalador (asumo que esto se arreglará en versiones posteriores).Para ejecutar el instalador tuve que ir a C:\N-Archivos de Programa (x86)\N-Android\Nandroid-studiosdk\Nextras intel_Hardware_Accelerated_Execution_Manager y lanzar manualmente intelhaxm.exe.
ja: 私が使っていたAndroid Studioのバージョン(0.8.9)では、Android SDK ManagerがHAXMをダウンロードしても、インストーラーを実行してくれませんでした(後のリリースで修正されると思います)。インストーラーを実行するには、C:Grogram Files (x86)に移動しなければならなかった。
ko: 내가 사용한 Android Studio 버전 (0.8.9)에서 Android SDK Manager는 HAXM을 다운로드하지만 실제로 설치 프로그램을 실행하지는 않습니다 (이는 이후 릴리스에서 수정 될 것이라고 가정합니다). 설치 프로그램을 실행하려면 C : \ Program Files (x86) \ Android \ android-studio \ sdk \ extras \ intel \ Hardware_Accelerated_Execution_Manager로 이동하여 intelhaxm.exe를 수동으로 시작해야했습니다.
ru: В версии Android Studio,которую я использовал (0.8.9),Android SDK Manager скачивает HAXM,но на самом деле не запускает установщик (я предполагаю,что это будет исправлено в более поздних релизах).Для запуска программы установки мне пришлось перейти на C:\Program Files (x86)\Android\android-studio\sdk\extras\intel\Hardware_Accelerated_Execution_Manager и вручную запустить intelhaxm.exe.
zh_cn: 在我使用的Android Studio版本(0.8.9)中,Android SDK管理器下载了HAXM,但实际上并没有运行安装程序(我想这将在以后的版本中得到修复)。为了运行安装程序,我不得不去C:\\程序文件(x86)\Android\android-studio\sk\extras\intel\Hardware_Accelerated_Execution_Manager,然后手动启动intelhaxm.exe。

source: Install <a href="http://www.virtualbox.org/">VirtualBox</a>.
es: Instala <a href="http://www.virtualbox.org/">VirtualBox</a> .
ja: <a href="http://www.virtualbox.org/">VirtualBox</a>をインストールします。
ko: <a href="http://www.virtualbox.org/">VirtualBox를</a> 설치하십시오.
ru: Установите <a href="http://www.virtualbox.org/">VirtualBox</a> .
zh_cn: 安装<a href="http://www.virtualbox.org/">VirtualBox</a> 。

source: Install Android x86 on the emulator, run it.
es: Instala Android x86 en el emulador,ejecútalo.
ja: エミュレータにAndroid x86をインストールして実行します。
ko: 에뮬레이터에 Android x86을 설치하고 실행하십시오.
ru: Установите Android x86 на эмулятор,запустите его.
zh_cn: 在模拟器上安装Android x86,运行它。

source: Install Intel Hardware Accelerated Execution Manager (HAXM)
es: Instalar el Intel Hardware Accelerated Execution Manager (HAXM)
ja: Intel Hardware Accelerated Execution Manager (HAXM)のインストール
ko: Intel HAXM (Hardware Accelerated Execution Manager) 설치
ru: Установите Intel HAXM (HAXM).
zh_cn: 安装英特尔硬件加速执行管理器 (HAXM)

source: Install the HAXM Driver by running "IntelHaxm.exe". It will be located in one of the following locations:
es: Instale el controlador HAXM ejecutando "IntelHaxm.exe".Se ubicará en uno de los siguientes lugares:
ja: IntelHaxm.exe」を実行して、HAXM ドライバをインストールします。以下のいずれかの場所にあります。
ko: "IntelHaxm.exe"를 실행하여 HAXM 드라이버를 설치하십시오. 다음 위치 중 하나에 있습니다.
ru: Установите драйвер HAXM,запустив "IntelHaxm.exe".Он будет расположен в одном из следующих мест:
zh_cn: 通过运行 "IntelHaxm.exe "安装HAXM驱动程序。它将位于以下位置之一。

source: Intel released <a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">recommended installation instructions for the ICS emulator</a> on May 15, 2012. This worked for me. The emulator is now fast and the UI is smooth.
es: Intel lanz&oacute; las <a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">instrucciones de instalaci&oacute;n recomendadas para el emulador ICS</a> el 15 de mayo de 2012. Esto funcion&oacute; para m&iacute;. El emulador ahora es r&aacute;pido y la interfaz de usuario es suave.
ja: インテルは、2012年5月15日に<a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">ICSエミュレーターの推奨インストール手順を</a>リリースしました。 エミュレータが高速になり、UIがスムーズになりました。
ko: 인텔은 2012 년 5 월 15 일에 <a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">ICS 에뮬레이터</a> 에 권장되는 설치 지침을 발표했습니다. 에뮬레이터가 빨라지고 UI가 매끄 럽습니다.
ru: Intel выпустила <a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">рекомендованные инструкции по установке эмулятора ICS</a> 15 мая 2012 года. Это сработало для меня. Эмулятор теперь быстрый, а интерфейс - плавный.
zh_cn: 英特尔于2012年5月15日发布了<a href="http://software.intel.com/en-us/articles/intel-atom-x86-image-for-android-ice-cream-sandwich-installation-instructions-recommended/">针对ICS仿真器的推荐安装说明</a> 。这对我有用。 现在，仿真器运行很快，UI变得流畅。

source: It might be worth people upgrading their JVM.
es: Podría valer la pena que la gente mejore su JVM.
ja: JVMをアップグレードする価値があるかもしれません。
ko: 사람들이 JVM을 업그레이드하는 것이 좋습니다.
ru: Возможно,это стоит того,чтобы люди модернизировали свой JVM.
zh_cn: 这或许值得人们升级他们的JVM。

source: Jar of Beans
es: Jarra de frijoles
ja: 豆の瓶
ko: 콩의 항아리
ru: банка с фасолью
zh_cn: 罐装豆子

source: Launching the emulator from the snapshot.
es: Lanzando el emulador desde la instantánea.
ja: スナップショットからエミュレータを起動します。
ko: 스냅 샷에서 에뮬레이터를 시작합니다.
ru: Запускаю эмулятор из снимка.
zh_cn: 从快照中启动仿真器。

source: My understanding is that the <strong>Android Emulator</strong> should start fairly quickly on such a machine, but for me, it does not. I have followed all the instructions in setting up the IDE, SDKs, JDKs and such and have had some success in starting the emulator quickly, but that is very rare. How can I, if possible, fix this problem?
es: Tengo entendido que el <strong>emulador de Android</strong> deber&iacute;a iniciarse bastante r&aacute;pido en una m&aacute;quina de este tipo, pero para m&iacute;, no lo hace. He seguido todas las instrucciones para configurar el IDE, SDK, JDK y dem&aacute;s, y he tenido &eacute;xito al iniciar el emulador r&aacute;pidamente, pero eso es muy raro. &iquest;C&oacute;mo puedo, si es posible, solucionar este problema?
ja: 私の理解では、 <strong>Androidエミュレータ</strong>はそのようなマシンでかなり迅速に起動するはずですが、私にとってはそうではありません。 私はIDE、SDK、JDKなどの設定に関するすべての指示に従い、エミュレータをすばやく起動することにある程度成功していますが、それは非常にまれです。 可能であれば、この問題をどのように修正できますか？
ko: 내 이해는 <strong>Android 에뮬레이터</strong> 가 그러한 컴퓨터에서 상당히 빨리 시작해야하지만 나에게는 그렇지 않다는 것입니다. IDE, SDK, JDK 등을 설정하는 데 필요한 모든 지침을 따르고 에뮬레이터를 빠르게 시작하는 데 성공했지만 매우 드 rare니다. 가능하면이 문제를 어떻게 해결할 수 있습니까?
ru: Насколько я понимаю, <strong>Android-эмулятор</strong> должен запускаться довольно быстро на такой машине, но для меня это не так. Я следовал всем инструкциям по настройке IDE, SDK, JDK и т. Д. И добился некоторого успеха в быстром запуске эмулятора, но это очень редко. Как я могу, если возможно, решить эту проблему?
zh_cn: 我的理解是， <strong>Android Emulator</strong>应该可以在这样的机器上快速启动，但对我而言，并不是这样。 我已经按照所有说明设置了IDE，SDK，JDK等，并且在快速启动仿真器方面取得了一些成功，但这很少见。 如果可能的话，我该如何解决？

source: Now to ensure that everything else is set up so you can enjoy a highly performing emulator:
es: Ahora para asegurarnos de que todo lo demás está preparado para que puedas disfrutar de un emulador de alto rendimiento:
ja: これで全ての設定が完了し、高性能なエミュレータを楽しむことができるようになりました。
ko: 이제 다른 모든 것이 설정되어 고성능 에뮬레이터를 즐길 수 있습니다.
ru: Теперь,чтобы убедиться,что все остальное настроено так,чтобы вы могли наслаждаться высокопроизводительным эмулятором:
zh_cn: 现在要确保其他一切都设置好了,这样你就可以享受到高性能的仿真器了。

source: On Mac OS you will need to hold
es: En Mac OS necesitarás mantener
ja: Mac OSでは
ko: Mac OS에서는
ru: На Mac OS вам нужно будет держать
zh_cn: 在Mac OS上,你需要按住

source: Or as for new SDK,
es: O en cuanto al nuevo SDK,
ja: または新しいSDKについて。
ko: 또는 새로운 SDK는
ru: Или что касается нового SDK,
zh_cn: 或者说,至于新的SDK。

source: Or on Unix (Mac or Linux flavors):
es: O en Unix (sabores de Mac o Linux):
ja: または、Unix (Mac または Linux のフレーバー)で。
ko: 또는 Unix (Mac 또는 Linux 버전)에서 :
ru: Или на Unix (Mac или Linux):
zh_cn: 或在Unix上(Mac或Linux版本)。

source: Otherwise, you may see this error:
es: De lo contrario,puede ver este error:
ja: そうでない場合は、このエラーが表示されることがあります。
ko: 그렇지 않으면이 오류가 표시 될 수 있습니다.
ru: В противном случае вы можете увидеть эту ошибку:
zh_cn: 否则,你可能会看到这个错误。

source: Personally, I use a real phone to do my tests. It is faster and tests are more realistic. But if you want to test your application on a lot of different Android versions and don't want to buy several phones, you will have to use the emulator from time to time.
es: Personalmente,uso un teléfono de verdad para hacer mis pruebas.Es más rápido y las pruebas son más realistas.Pero si quieres probar tu aplicación en muchas versiones diferentes de Android y no quieres comprar varios teléfonos,tendrás que usar el emulador de vez en cuando.
ja: 個人的には、私はテストを行うために本物の携帯電話を使用しています。それはより速く、テストはより現実的です。しかし、多くの異なるAndroidのバージョンでアプリをテストしたい場合や、複数の電話を購入したくない場合は、時々エミュレータを使用する必要があります。
ko: 개인적으로 실제 전화를 사용하여 테스트를 수행합니다. 더 빠르며 테스트가 더 현실적입니다. 그러나 다양한 Android 버전에서 응용 프로그램을 테스트하고 여러 대의 전화를 사고 싶지 않은 경우 때때로 에뮬레이터를 사용해야합니다.
ru: Лично я использую настоящий телефон,чтобы делать тесты.Он быстрее и тесты более реалистичны.Но если вы хотите протестировать свое приложение на множестве разных версий Android и не хотите покупать несколько телефонов,вам придется время от времени использовать эмулятор.
zh_cn: 就我个人而言,我用真手机做测试。它的速度比较快,测试也比较真实。但如果你想在很多不同的安卓版本上测试你的应用,又不想买几部手机,那就得时不时的用模拟器来测试。

source: Recent emulators are faster than they use to be in 2010. Update your SDK/IDE.
es: Los emuladores recientes son más rápidos de lo que solían ser en 2010.Actualice su SDKIDE.
ja: 最近のエミュレータは2010年のものよりも高速です。SDKIDEをアップデートしてください。
ko: 최근 에뮬레이터는 2010 년보다 더 빠릅니다. SDK / IDE를 업데이트하십시오.
ru: Недавние эмуляторы работают быстрее,чем в 2010 году.Обновите свой SDKIDE.
zh_cn: 最近的仿真器比2010年的时候要快。更新你的SDKIDE。

source: Refer to the given below screenshots for more information.
es: Consulte las siguientes capturas de pantalla para obtener más información.
ja: 詳細については、以下のスクリーンショットを参照してください。
ko: 자세한 내용은 아래 주어진 스크린 샷을 참조하십시오.
ru: Для получения дополнительной информации обратитесь к приведенным ниже скриншотам.
zh_cn: 更多信息请看下面的截图。

source: Run cmd on your Windows&nbsp;XP system, change the directory to your Android tools directory, type <code>adb connect &lt;virtual_machine_IP&gt;</code>.
es: Ejecute cmd en su sistema Windows XP, cambie el directorio a su directorio de herramientas de Android, escriba <code>adb connect &lt;virtual_machine_IP&gt;</code> .
ja: Windows XPシステムでcmdを実行し、ディレクトリをAndroid toolsディレクトリに変更して、 <code>adb connect &lt;virtual_machine_IP&gt;</code> と入力します。
ko: Windows XP 시스템에서 cmd를 실행하고 디렉토리를 Android 도구 디렉토리로 변경하고 <code>adb connect &lt;virtual_machine_IP&gt;</code> 를 입력하십시오 .
ru: Запустите cmd в своей системе Windows XP, измените каталог на каталог инструментов Android, введите <code>adb connect &lt;virtual_machine_IP&gt;</code> .
zh_cn: 在Windows XP系统上运行cmd，将目录更改为Android工具目录，键入 <code>adb connect &lt;virtual_machine_IP&gt;</code> 。
