Repository: rueisnom/feedback
Catalog: xlf/15/54/09/9/1554099.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: See the following section in the Android emulator documentation for more details: <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">Configuring Virtual Machine Acceleration</a>
es: Consulte la siguiente secci&oacute;n en la documentaci&oacute;n del emulador de Android para obtener m&aacute;s detalles: <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">Configuraci&oacute;n de la aceleraci&oacute;n de m&aacute;quina virtual</a>
ja: 詳細については、Androidエミュレーターのドキュメントの次のセクションを参照してください。 <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">仮想マシンアクセラレーションの構成</a>
ko: 자세한 내용은 Android 에뮬레이터 설명서에서 다음 섹션을 참조하십시오. <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">가상 머신 가속 구성</a>
ru: Подробнее см. В следующем разделе документации по эмулятору Android: <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">Настройка ускорения виртуальной машины.</a>
zh_cn: 有关更多详细信息，请参见Android模拟器文档中的以下部分： <a href="http://developer.android.com/guide/developing/devices/emulator.html#accel-vm">配置虚拟机加速</a>

source: Show Advanced Setting
es: Mostrar configuración avanzada
ja: 高度な設定を表示
ko: 고급 설정 표시
ru: Показать дополнительные настройки
zh_cn: 显示高级设置

source: Start Eclipse, open the ADT plugin, find the device, and enjoy!
es: Inicie Eclipse,abra el plugin ADT,encuentre el dispositivo y ¡disfrute!
ja: Eclipseを起動して、ADTプラグインを開き、デバイスを見つけて、お楽しみください。
ko: Eclipse를 시작하고 ADT 플러그인을 열고 장치를 찾고 즐기십시오!
ru: Запустите Eclipse,откройте плагин ADT,найдите устройство и наслаждайтесь!
zh_cn: 启动Eclipse,打开ADT插件,找到设备,享受一下吧!

source: Steps for Configuring Your Android Development Environment for HAXM
es: Pasos para configurar el entorno de desarrollo de Android para HAXM
ja: HAXM用のAndroid開発環境を設定する手順
ko: HAXM을위한 Android 개발 환경 구성 단계
ru: Шаги по настройке среды разработки Android для HAXM
zh_cn: 为HAXM配置Android开发环境的步骤

source: Target: Intel Atom x86 System Image - API Level 10
es: Objetivo:Imagen del sistema Intel Atom x86-Nivel 10 de la API
ja: 対象:Intel Atom x86 システムイメージ-API レベル 10
ko: 대상 : Intel Atom x86 시스템 이미지-API 레벨 10
ru: Цель:Intel Atom x86 System Image-API уровень 10
zh_cn: 目标:Intel Atom x86系统镜像-API Level 10

source: The Android emulator is based on <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a>. The interface between QEMU and the HAXM driver on the host system is designed to be vendor-agnostic.
es: El emulador de Android est&aacute; basado en <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> . La interfaz entre QEMU y el controlador HAXM en el sistema host est&aacute; dise&ntilde;ada para ser independiente del proveedor.
ja: Androidエミュレーターは<a href="http://en.wikipedia.org/wiki/QEMU">QEMUに</a>基づいています。 QEMUとホストシステム上のHAXMドライバー間のインターフェイスは、ベンダーに依存しないように設計されています。
ko: Android 에뮬레이터는 <a href="http://en.wikipedia.org/wiki/QEMU">QEMU를</a> 기반으로합니다. 호스트 시스템에서 QEMU와 HAXM 드라이버 간의 인터페이스는 공급 업체에 구애받지 않도록 설계되었습니다.
ru: Эмулятор Android основан на <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> . Интерфейс между QEMU и драйвером HAXM в хост-системе разработан независимо от производителя.
zh_cn: Android仿真器基于<a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> 。 QEMU和主机系统上的HAXM驱动程序之间的接口被设计为与供应商无关。

source: The current (May 2011) version of the emulator is slow particularly with <a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0 (Honeycomb)</a> primarily because the emulator does not support hardware GL -- this means that the GL code gets translated into software (ARM software, in fact) which then gets emulated in software in <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a>. This is crazy-slow. They're working on this problem and have it partially solved, but not with any sort of release quality.
es: La versi&oacute;n actual (mayo de 2011) del emulador es lenta, particularmente con <a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0 (Honeycomb)</a> principalmente porque el emulador no es compatible con el hardware GL; esto significa que el c&oacute;digo GL se traduce en software (software ARM, de hecho) que luego obtiene emulado en software en <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> . Esto es muy lento. Est&aacute;n trabajando en este problema y lo han resuelto parcialmente, pero no con ning&uacute;n tipo de calidad de lanzamiento.
ja: エミュレーターの現在の（2011年5月）バージョンは、特に<a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0（Honeycomb）では</a>遅くなります。これは、主にエミュレーターがハードウェアGLをサポートしていないためです。これは、GLコードがソフトウェア（実際にはARMソフトウェア）に変換され、その後、 <a href="http://en.wikipedia.org/wiki/QEMU">QEMUの</a>ソフトウェアでエミュレートされます。 これはすごく遅いです。 彼らはこの問題に取り組んでおり、部分的に解決していますが、リリースの品質についてはそうではありません。
ko: 에뮬레이터의 현재 (2011 년 5 월) 버전은 특히 <a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0 (Honeycomb)에서</a> 느립니다. 에뮬레이터는 하드웨어 GL을 지원하지 않기 때문에 주로 GL 코드가 소프트웨어 (사실 ARM 소프트웨어)로 변환되어 소프트웨어를 가져옵니다. <a href="http://en.wikipedia.org/wiki/QEMU">QEMU의</a> 소프트웨어에서 에뮬레이트됩니다. 이건 정말 느려. 그들은이 문제에 대해 연구하고 있으며 부분적으로 해결되었지만 어떤 종류의 릴리스 품질로는 해결하지 못했습니다.
ru: Текущая (май 2011 г.) версия эмулятора работает медленно, особенно с <a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0 (Honeycomb),</a> главным образом потому, что эмулятор не поддерживает аппаратный GL - это означает, что код GL переводится в программное обеспечение (фактически, программное обеспечение ARM), которое затем получает эмулируется в программном обеспечении в <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> . Это безумно медленно. Они работают над этой проблемой и частично ее решают, но не с каким-либо качеством выпуска.
zh_cn: 当前（2011年5月）的仿真器版本特别慢，尤其是在<a href="http://en.wikipedia.org/wiki/Android_version_history#v3.x_Honeycomb">Android 3.0（Honeycomb）上，这</a>是因为仿真器不支持硬件GL-这意味着GL代码已转换为软件（实际上是ARM软件），然后该软件在<a href="http://en.wikipedia.org/wiki/QEMU">QEMU的</a>软件中仿真。 这太慢了。 他们正在解决此问题，并已部分解决，但没有任何发布质量。

source: The emulator included in your (old) version of Eclipse is very slow.
es: El emulador incluido en su (antigua)versión de Eclipse es muy lento.
ja: あなたの(古い)バージョンのEclipseに含まれているエミュレータは非常に遅いです。
ko: (이전) 버전의 Eclipse에 포함 된 에뮬레이터는 매우 느립니다.
ru: Эмулятор,входящий в вашу (старую)версию Eclipse,работает очень медленно.
zh_cn: 你的(旧)Eclipse版本中包含的仿真器非常慢。

source: The emulator runs slowly because the complete Android environment is running on emulated hardware and the instructions are executed on an emulated ARM processor as well.
es: El emulador funciona lentamente porque todo el entorno de Android se ejecuta en hardware emulado y las instrucciones también se ejecutan en un procesador ARM emulado.
ja: 完全なAndroid環境がエミュレートされたハードウェア上で実行されており、エミュレートされたARMプロセッサ上でも命令が実行されるため、エミュレータの動作が遅くなります。
ko: 전체 Android 환경이 에뮬레이트 된 하드웨어에서 실행 중이고 에뮬레이션 된 ARM 프로세서에서도 명령이 실행되므로 에뮬레이터가 느리게 실행됩니다.
ru: Эмулятор работает медленно,потому что полная среда Android работает на эмулируемом оборудовании,а также инструкции выполняются на эмулированном ARM-процессоре.
zh_cn: 仿真器运行缓慢,因为整个Android环境是在仿真硬件上运行,指令也是在仿真的ARM处理器上执行。

source: The emulator seems to slow itself down when idle. This is made apparent by rapidly mousing over the keys on the side and observing the light-up responses. As a workaround, I pass <code>-icount auto</code> to <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> when starting the emulator. You can make a batch file called <code>my_avd.bat</code> to do it for you:
es: El emulador parece ralentizarse cuando est&aacute; inactivo. Esto se hace evidente al pasar r&aacute;pidamente el mouse sobre las teclas laterales y observar las respuestas de iluminaci&oacute;n. Como soluci&oacute;n alternativa, paso <code>-icount auto</code> a <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> al iniciar el emulador. Puede hacer un archivo por lotes llamado <code>my_avd.bat</code> para que lo haga por usted:
ja: エミュレーターはアイドル状態のときに速度が低下するようです。 これは、側面のキーにすばやくマウスを合わせて、ライトアップ応答を観察することで明らかになります。 回避策として、エミュレータを起動するときに <code>-icount auto</code> を<a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a>に渡します。 <code>my_avd.bat</code> という名前のバッチファイルを作成して、次のことを実行できます。
ko: 유휴 상태 일 때 에뮬레이터가 느려집니다. 이것은 측면의 건반을 빠르게 마우스로 움직이고 점등 반응을 관찰함으로써 분명해집니다. 해결 방법으로 에뮬레이터를 시작할 때 <code>-icount auto</code> 를 <a href="http://en.wikipedia.org/wiki/QEMU">QEMU에</a> 전달합니다. <code>my_avd.bat</code> 라는 배치 파일을 만들어서 이를 수행 할 수 있습니다.
ru: Эмулятор, кажется, замедляется при простое. Это становится очевидным благодаря быстрому наведению курсора на боковые клавиши и наблюдению за реакцией на свет. В качестве обходного пути я <code>-icount auto</code> в <a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> при запуске эмулятора. Вы можете сделать пакетный файл с именем <code>my_avd.bat</code> , чтобы сделать это для вас:
zh_cn: 模拟器在空闲时似乎会降低自身速度。 通过快速将鼠标悬停在侧面的按键上并观察点亮响应，可以明显看出这一点。 解决方法是，在启动模拟器时，将 <code>-icount auto</code> 传递给<a href="http://en.wikipedia.org/wiki/QEMU">QEMU</a> 。 您可以制作一个名为 <code>my_avd.bat</code> 的批处理文件来为您做：

source: The first half of the instructions are detailed enough, so I will assume you were able to install the Intel x86 Atom System Image(s) using the Android SDK manager, as well as Intel HAXM.
es: La primera mitad de las instrucciones son bastante detalladas,así que asumo que fuiste capaz de instalar las imágenes del sistema Intel x86 Atom usando el administrador del SDK de Android,así como el Intel HAXM.
ja: 説明書の前半で十分詳細に説明されているので、Intel HAXMだけでなく、Android SDKマネージャを使ってIntel x86 Atom System Image(s)をインストールできたと仮定して説明します。
ko: 지침의 전반부는 충분히 자세하므로 Intel HAXM뿐만 아니라 Android SDK 관리자를 사용하여 Intel x86 Atom 시스템 이미지를 설치할 수 있다고 가정합니다.
ru: Первая половина инструкций достаточно подробна,поэтому я предполагаю,что вы смогли установить Intel x86 Atom System Image(s)с помощью менеджера Android SDK,а также Intel HAXM.
zh_cn: 前半部分的说明已经很详细了,所以我将假设你能够使用Android SDK管理器以及Intel HAXM安装Intel x86 Atom系统镜像。

source: The installation of the plugin can be done by launching Eclipse and going to "Help / Install New Software" menu, then just add a new Update Site with the following URL: <a href="http://plugins.genymotion.com/eclipse">http://plugins.genymotion.com/eclipse</a>. Follow the steps indicated by Eclipse.
es: La instalaci&oacute;n del complemento se puede realizar iniciando Eclipse y yendo al men&uacute; "Ayuda / Instalar nuevo software", luego simplemente agregue un nuevo sitio de actualizaci&oacute;n con la siguiente URL: <a href="http://plugins.genymotion.com/eclipse">http://plugins.genymotion.com/eclipse</a> . Siga los pasos indicados por Eclipse.
ja: プラグインのインストールは、Eclipseを起動して[ヘルプ/新しいソフトウェアをインストール]メニューに移動し、次のURLを使用して新しい更新サイトを追加するだけで実行できます： <a href="http://plugins.genymotion.com/eclipse">http</a> : //plugins.genymotion.com/eclipse 。 Eclipseによって示されるステップに従います。
ko: 플러그인 설치는 Eclipse를 시작하고 "도움말 / 새 소프트웨어 설치"메뉴로 이동 한 다음 <a href="http://plugins.genymotion.com/eclipse">http://plugins.genymotion.com/eclipse</a> URL을 사용하여 새 업데이트 사이트를 추가하면됩니다. Eclipse로 표시된 단계를 수행하십시오.
ru: Установка плагина может быть выполнена путем запуска Eclipse и перехода в меню &laquo;Справка / Установка нового программного обеспечения&raquo;, а затем просто добавьте новый сайт обновлений со следующим URL-адресом: <a href="http://plugins.genymotion.com/eclipse">http://plugins.genymotion.com/eclipse</a> . Следуйте инструкциям Eclipse.
zh_cn: 可以通过启动Eclipse并转到&ldquo;帮助/安装新软件&rdquo;菜单，然后添加具有以下URL的新更新站点来完成插件的安装： <a href="http://plugins.genymotion.com/eclipse">http</a> : //plugins.genymotion.com/eclipse 。 请遵循Eclipse指示的步骤。

source: The main choking point is rendering since it's not running on any dedicated hardware but it's actually being performed through software rendering. Lowering the screen size will drastically improve emulator performance. Getting more/faster memory isn't going to help.
es: El principal punto de ahogo es la renderización,ya que no se ejecuta en ningún hardware dedicado,sino que se realiza a través de la renderización por software.Bajar el tamaño de la pantalla mejorará drásticamente el rendimiento del emulador.Conseguir más memoria rápida no va a ayudar.
ja: 専用のハードウェアで動いているわけではなく、実際にはソフトウェアでレンダリングを行っているので、一番のネックはレンダリングです。画面サイズを小さくすれば、エミュレータのパフォーマンスは劇的に向上します。メモリをもっと速くしても意味がありません。
ko: 주요 초킹 포인트는 전용 하드웨어에서 실행되지 않지만 실제로 소프트웨어 렌더링을 통해 수행되므로 렌더링입니다. 화면 크기를 줄이면 에뮬레이터 성능이 크게 향상됩니다. 더 빠른 메모리를 얻는 것은 도움이되지 않습니다.
ru: Основным моментом удушения является рендеринг,так как он не работает на каком-либо специальном оборудовании,но на самом деле выполняется через программный рендеринг.Уменьшение размера экрана значительно улучшит производительность эмулятора.Получение более быстрой памяти не поможет.
zh_cn: 主要的窒息点是渲染,因为它没有在任何专用硬件上运行,但实际上是通过软件渲染来完成的。降低屏幕尺寸会大幅提高模拟器的性能。获得更多的内存也无济于事。

source: The option <code>-cpu-delay &lt;delay&gt;</code> described in <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">Emulator Startup Options</a></em> can help.
es: La opci&oacute;n <code>-cpu-delay &lt;delay&gt;</code> descrita en las <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">Opciones de inicio del emulador</a></em> puede ayudar.
ja: <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">エミュレータの起動オプションで</a></em>説明されているオプション <code>-cpu-delay &lt;delay&gt;</code> が役立ちます。
ko: <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">에뮬레이터 시작 옵션에</a></em> 설명 된 <code>-cpu-delay &lt;delay&gt;</code> <em>옵션</em> 이 도움이 될 수 있습니다.
ru: Опция <code>-cpu-delay &lt;delay&gt;</code> , описанная в <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">параметрах запуска эмулятора,</a></em> может помочь.
zh_cn: <em><a href="http://developer.android.com/guide/developing/tools/emulator.html">仿真器启动选项中</a></em>描述的选项 <code>-cpu-delay &lt;delay&gt;</code> 可以提供帮助。

source: The startup of the emulator is very slow. The good thing is that you only need to start the emulator once. If the emulator is already running and you run your app again, the emulator reinstalls the app relatively quickly. Of course, if you want to know how fast it will run on a phone, it is best to test it on a real phone.
es: El arranque del emulador es muy lento.Lo bueno es que sólo necesitas arrancar el emulador una vez.Si el emulador ya está funcionando y vuelves a ejecutar tu aplicación,el emulador reinstala la aplicación relativamente rápido.Por supuesto,si quieres saber a qué velocidad se ejecutará en un teléfono,lo mejor es probarlo en un teléfono real.
ja: エミュレータの起動が非常に遅いです。良い点は、エミュレータの起動が一度で済むことです。エミュレータがすでに起動していて、再度アプリを実行すると、エミュレータは比較的早くアプリを再インストールしてくれます。もちろん、あなたはそれが電話で実行される速度を知りたい場合は、実際の携帯電話でそれをテストするのが最善です。
ko: 에뮬레이터의 시작이 매우 느립니다. 좋은 점은 에뮬레이터를 한 번만 시작하면된다는 것입니다. 에뮬레이터가 이미 실행 중이고 앱을 다시 실행하면 에뮬레이터가 앱을 비교적 빠르게 다시 설치합니다. 물론 휴대 전화에서 얼마나 빨리 실행되는지 알고 싶다면 실제 휴대 전화에서 테스트하는 것이 가장 좋습니다.
ru: Запуск эмулятора очень медленный.Хорошо,что эмулятор нужно запускать только один раз.Если эмулятор уже запущен,а вы снова запускаете приложение,эмулятор переустанавливает его относительно быстро.Конечно,если вы хотите знать,как быстро оно будет работать на телефоне,лучше всего протестировать его на реальном телефоне.
zh_cn: 仿真器的启动速度非常慢。好在你只需要启动一次模拟器就可以了。如果模拟器已经运行了,你再运行你的APP,模拟器会相对快速地重新安装APP。当然,如果你想知道它在手机上的运行速度有多快,最好是在真正的手机上测试一下。

source: They've mentioned, at the time, that they're developing an interface that would allow the emulator to pipe certain instructions through the host hardware, so eventually, you'll be able to leverage emulator performances with the raw power of desktop hardware.
es: En su momento,mencionaron que estaban desarrollando una interfaz que permitiría al emulador canalizar ciertas instrucciones a través del hardware anfitrión,por lo que,con el tiempo,podrá aprovechar las prestaciones del emulador con la potencia bruta del hardware de escritorio.
ja: 当時、エミュレータが特定の命令をホストハードウェアにパイプするインターフェースを開発していると言っていましたので、最終的にはデスクトップハードウェアの生のパワーでエミュレータの性能を活用できるようになるでしょう。
ko: 그들은 에뮬레이터가 호스트 하드웨어를 통해 특정 명령을 파이프 할 수있는 인터페이스를 개발 중이라고 말하면서 결국 데스크톱 하드웨어의 강력한 성능으로 에뮬레이터 성능을 활용할 수 있습니다.
ru: В то время они упоминали,что разрабатывают интерфейс,который позволит эмулятору пропускать определенные инструкции через аппаратное обеспечение хоста,так что в конечном итоге вы сможете использовать производительность эмулятора на необработанном настольном оборудовании.
zh_cn: 当时,他们曾提到,他们正在开发一个接口,允许仿真器通过主机硬件来管道某些指令,所以最终,你将能够利用桌面硬件的原始动力来利用仿真器的性能。

source: This emulator is fast and responsive.
es: Este emulador es rápido y sensible.
ja: このエミュレータは高速で反応が良いです。
ko: 이 에뮬레이터는 빠르고 반응이 빠릅니다.
ru: Этот эмулятор быстрый и отзывчивый.
zh_cn: 这个模拟器速度快,反应灵敏。

source: This feature can improve the emulator performance a lot!
es: ¡Esta característica puede mejorar mucho el rendimiento del emulador!
ja: この機能は、エミュレータのパフォーマンスを大幅に向上させることができます
ko: 이 기능은 에뮬레이터 성능을 크게 향상시킬 수 있습니다!
ru: Эта функция может значительно улучшить производительность эмулятора!
zh_cn: 这个功能可以让仿真器的性能提高很多!

source: This improved things considerably, but the emulator was still feeling a bit sluggish. The final step was selecting Use Host GPU in Android Virtual Device Manager (AVD).
es: Esto mejoró las cosas considerablemente,pero el emulador todavía se sentía un poco lento.El último paso fue seleccionar Usar la GPU del host en el Administrador de Dispositivos Virtuales de Android (AVD).
ja: これでかなり改善されましたが、エミュレータの動作はまだ少し重く感じました。最後にAndroid Virtual Device Manager (AVD)でUse Host GPUを選択しました。
ko: 이것은 상당히 개선되었지만 에뮬레이터는 여전히 약간 느려졌습니다. 마지막 단계는 Android 가상 장치 관리자 (AVD)에서 호스트 GPU 사용을 선택하는 것이 었습니다.
ru: Это значительно улучшило ситуацию,но эмулятор все еще чувствовал себя немного вялым.Последним шагом был выбор опции Use Host GPU в Android Virtual Device Manager (AVD).
zh_cn: 这样一来,事情就有了很大的改善,但模拟器还是感觉有点迟钝。最后一步是在Android虚拟设备管理器(AVD)中选择使用主机GPU。

source: This made animations buttery smooth and sped up <code>adb install</code> tenfold.
es: Esto hizo que las animaciones fuesen suaves y aceleraron la <code>adb install</code> diez veces.
ja: これによりアニメーションがスムーズになり、 <code>adb install</code> 10倍高速になりました。
ko: 이로 인해 애니메이션이 부드럽고 매끄럽고 <code>adb install</code> 속도가 10 배 빨라졌습니다.
ru: Это сделало анимацию маслянистой, плавной и ускорила <code>adb install</code> десять раз.
zh_cn: 这使动画效果更加流畅，并加快了 <code>adb install</code> 速度。

source: To add further information to this.
es: Para añadir más información a esto.
ja: これにさらに情報を追加するために
ko: 이에 대한 추가 정보를 제공합니다.
ru: Чтобы добавить к этому дополнительную информацию.
zh_cn: 为了进一步补充这方面的信息。

source: To make your emulator faster, you can host a GPU and use a lighter Android version (<a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android 2.3</a> (Gingerbread)). Developing on a Mac would be better. Why use an emulator, BTW? Using a real phone makes more sense.
es: Para acelerar su emulador, puede alojar una GPU y usar una versi&oacute;n de Android m&aacute;s ligera ( <a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android 2.3</a> (Gingerbread)). Desarrollar en una Mac ser&iacute;a mejor. &iquest;Por qu&eacute; usar un emulador, por cierto? Usar un tel&eacute;fono real tiene m&aacute;s sentido.
ja: エミュレーターをより高速にするために、GPUをホストし、より軽量のAndroidバージョン（ <a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android 2.3</a> （Gingerbread））を使用できます。 Macで開発した方がいいでしょう。 BTWエミュレータを使用する理由 実際の電話を使用する方が理にかなっています。
ko: 에뮬레이터를 더 빠르게 만들기 위해 GPU를 호스팅하고 더 가벼운 Android 버전 ( <a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android 2.3</a> (Gingerbread))을 사용할 수 있습니다. Mac에서 개발하는 것이 좋습니다. 에뮬레이터, BTW를 사용하는 이유는 무엇입니까? 실제 전화를 사용하는 것이 더 합리적입니다.
ru: Чтобы сделать ваш эмулятор быстрее, вы можете разместить графический процессор и использовать более легкую версию <a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android</a> ( Android 2.3 (Gingerbread)). Разработка на Mac была бы лучше. Зачем использовать эмулятор, кстати? Использование реального телефона имеет больше смысла.
zh_cn: 为了使模拟器更快，您可以托管GPU并使用更轻便的Android版本（ <a href="https://en.wikipedia.org/wiki/Android_version_history#Android_2.3.E2.80.932.3.2_Gingerbread_.28API_level_9.29">Android 2.3</a> （姜饼））。 在Mac上进行开发会更好。 为什么要使用模拟器BTW？ 使用真实的电话更有意义。

source: To reduce your emulator start-up time you need to check the "Disable Boot Animation" before starting the emulator. Refer to <a href="http://developer.android.com/tools/help/emulator.html">the Android documentation</a>.
es: Para reducir el tiempo de inicio del emulador, debe marcar "Desactivar la animaci&oacute;n de arranque" antes de iniciar el emulador. Consulte <a href="http://developer.android.com/tools/help/emulator.html">la documentaci&oacute;n de Android</a> .
ja: エミュレータの起動時間を短縮するには、エミュレータを起動する前に「Disable Boot Animation」を確認する必要があります。 <a href="http://developer.android.com/tools/help/emulator.html">Androidのドキュメントを</a>参照してください。
ko: 에뮬레이터 시작 시간을 줄이려면 에뮬레이터를 시작하기 전에 "부팅 애니메이션 비활성화"를 확인해야합니다. <a href="http://developer.android.com/tools/help/emulator.html">안드로이드 문서를</a> 참조하십시오.
ru: Чтобы сократить время запуска эмулятора, вам нужно проверить &laquo;Отключить загрузочную анимацию&raquo; перед запуском эмулятора. Обратитесь к <a href="http://developer.android.com/tools/help/emulator.html">документации Android</a> .
zh_cn: 为了减少仿真器的启动时间，您需要在启动仿真器之前检查&ldquo;禁用启动动画&rdquo;。 请参阅<a href="http://developer.android.com/tools/help/emulator.html">Android文档</a> 。

source: Try <a href="http://www.android-x86.org/">Android x86</a>. It's much faster than the Google Android emulator. Follow these steps:
es: Prueba <a href="http://www.android-x86.org/">Android x86</a> . Es mucho m&aacute;s r&aacute;pido que el emulador de Google Android. Sigue estos pasos:
ja: <a href="http://www.android-x86.org/">Android x86をお</a>試しください。 Google Androidエミュレータよりもはるかに高速です。 次の手順を実行します：
ko: <a href="http://www.android-x86.org/">Android x86</a> 사용해보십시오. Google Android 에뮬레이터보다 훨씬 빠릅니다. 이 단계를 따르세요:
ru: Попробуйте <a href="http://www.android-x86.org/">Android x86</a> . Это намного быстрее, чем эмулятор Google Android. Следуй этим шагам:
zh_cn: 试试<a href="http://www.android-x86.org/">Android x86</a> 。 它比Google Android模拟器快得多。 跟着这些步骤：

source: Try <a href="https://www.genymotion.com/">Genymotion</a> for Android Studio. Blazing fast! Just needs one time installation. No more AVD pain.
es: Prueba <a href="https://www.genymotion.com/">Genymotion</a> para Android Studio. &iexcl;R&aacute;pido! Solo necesita una sola instalaci&oacute;n. No m&aacute;s dolor AVD.
ja: Android Studioの<a href="https://www.genymotion.com/">Genymotion</a>をお試しください。 速く燃える！ 一度だけのインストールが必要です。 AVDの痛みはもうありません。
ko: Android Studio 용 <a href="https://www.genymotion.com/">Genymotion</a> 을 사용해보십시오. 타오르는 것! 한 번만 설치하면됩니다. 더 이상 AVD 통증이 없습니다.
ru: Попробуйте <a href="https://www.genymotion.com/">Genymotion</a> для Android Studio. Пылающий быстро! Просто нужно один раз установить. Нет больше боли AVD.
zh_cn: 尝试针对Android Studio的<a href="https://www.genymotion.com/">Genymotion</a> 。 快速燃烧！ 只需要一次安装。 没有更多的AVD痛苦。

source: Try to disable your antivirus. Maybe it will make emulator a little bit faster.
es: Intenta deshabilitar tu antivirus.Tal vez haga que el emulador sea un poco más rápido.
ja: アンチウイルスを無効にしてみてください。そうすることでエミュレータの動作が少しは速くなるかもしれません。
ko: 안티 바이러스를 비활성화하십시오. 어쩌면 에뮬레이터를 조금 더 빠르게 만들 수 있습니다.
ru: Попробуй отключить свой антивирус.Может быть,это сделает эмулятор немного быстрее.
zh_cn: 试着禁用杀毒软件。也许这将使模拟器的速度更快一点。
