Repository: rueisnom/feedback
Catalog: xlf/15/54/09/9/1554099.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: CPU/ABI: Intel Atom (x86)
ko: CPU / ABI : 인텔 아톰 (x86)

source: Check out the video <em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I/O 2011: Android Development Tools</a></em> to see it in action -- jump to about 44 minutes.
es: Mira el video <em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I / O 2011: Herramientas de desarrollo de Android</a></em> para verlo en acci&oacute;n: salta a unos 44 minutos.
ja: 動画「 <em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I / O 2011：Android開発ツール」</a></em>で実際の動作を確認してください。約44分です。
ko: <em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I / O 2011 : Android 개발 도구</a></em> 비디오를 확인하여 작동 상태를 확인하십시오. 약 44 분으로 이동하십시오.
ru: Посмотрите видео &laquo; <em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I / O 2011: инструменты разработки Android&raquo;,</a></em> чтобы увидеть его в действии - перейдите к 44 минутам.
zh_cn: 观看视频<em><a href="http://www.youtube.com/watch?v=Oq05KqjXTvs">Google I / O 2011：Android开发工具</a></em>观看实际操作-跳到大约44分钟。

source: Click on Emulator edit button, then click
es: Haga clic en el botón de edición del emulador,luego haga clic en
ja: エミュレータ編集ボタンをクリックして
ko: 에뮬레이터 편집 버튼을 클릭 한 다음
ru: Нажмите кнопку Эмулятор редактировать,затем нажмите кнопку
zh_cn: 点击仿真器编辑按钮,然后点击

source: Configuring VM Acceleration on Linux
es: Configurando la aceleración de la VM en Linux
ja: LinuxでのVMアクセラレーションの設定
ko: Linux에서 VM 가속 구성
ru: Настройка ускорения ВМ под Linux
zh_cn: 在 Linux 上配置 VM 加速

source: Configuring VM Acceleration on Mac
es: Configuración de la aceleración de VM en Mac
ja: MacでVMアクセラレーションを設定する
ko: Mac에서 VM 가속 구성
ru: Настройка ускорения VM на Mac
zh_cn: 在 Mac 上配置 VM 加速

source: Configuring VM Acceleration on Windows
es: Configuración de la aceleración de la VM en Windows
ja: WindowsでのVMアクセラレーションの設定
ko: Windows에서 VM 가속 구성
ru: Настройка ускорения ВМ на Windows
zh_cn: 在 Windows 上配置 VM 加速

source: Create a <em>new</em> x86 AVD: Follow the image below:
es: Cree un <em>nuevo</em> AVD x86: siga la imagen a continuaci&oacute;n:
ja: <em>新しい</em> x86 AVDを作成します。以下の画像に従ってください：
ko: <em>새로운</em> x86 AVD 만들기 : 아래 이미지를 따르십시오.
ru: Создайте <em>новый</em> x86 AVD: следуйте изображению ниже:
zh_cn: 创建一个<em>新的</em> x86 AVD：如下图所示：

source: Create a new AVD using Intel Atom x86
es: Crear un nuevo AVD usando Intel Atom x86
ja: Intel Atom x86を使用して新しいAVDを作成する
ko: Intel Atom x86을 사용하여 새로운 AVD 생성
ru: Создание нового AVD с помощью Intel Atom x86
zh_cn: 使用Intel Atom x86创建一个新的AVD

source: Create a virtual machine as Linux 2.6/Other Linux, 512&nbsp;MB RAM, HD 2&nbsp;GB. Network: PCnet-Fast III, attached to <a href="http://en.wikipedia.org/wiki/Network_address_translation">NAT</a>. You can also use a bridged adapter, but you need a <a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP</a> server in your environment.
es: Cree una m&aacute;quina virtual como Linux 2.6 / Otro Linux, 512 MB de RAM, HD 2 GB. Red: PCnet-Fast III, conectada a <a href="http://en.wikipedia.org/wiki/Network_address_translation">NAT</a> . Tambi&eacute;n puede usar un adaptador en puente, pero necesita un servidor <a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP</a> en su entorno.
ja: Linux 2.6 /その他のLinux、512 MB RAM、HD 2 GBとして仮想マシンを作成します。 ネットワーク：PCnet-Fast III、 <a href="http://en.wikipedia.org/wiki/Network_address_translation">NATに接続</a> 。 ブリッジアダプタを使用することもできますが、環境には<a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP</a>サーバーが必要です。
ko: Linux 2.6 / 기타 Linux, 512MB RAM, HD 2GB로 가상 머신을 작성하십시오. 네트워크 : PCnet-Fast III, <a href="http://en.wikipedia.org/wiki/Network_address_translation">NAT에</a> 연결됨 브리지 된 어댑터를 사용할 수도 있지만 환경에 <a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP</a> 서버가 필요합니다.
ru: Создайте виртуальную машину под Linux 2.6 / Other Linux, 512 МБ ОЗУ, HD 2 ГБ. Сеть: PCnet-Fast III, подключенная к <a href="http://en.wikipedia.org/wiki/Network_address_translation">NAT</a> . Вы также можете использовать мостовой адаптер, но вам нужен <a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP-</a> сервер в вашей среде.
zh_cn: 创建一个虚拟机，如Linux 2.6 / Other Linux，512 MB RAM，HD 2 GB。 网络：连接到<a href="http://en.wikipedia.org/wiki/Network_address_translation">NAT的</a> PCnet-Fast III。 您也可以使用桥接适配器，但是您的环境中需要<a href="http://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol">DHCP</a>服务器。

source: Creating a new AVD with the save snapshot feature.
es: Creando un nuevo AVD con la función de guardar instantáneas.
ja: スナップショットの保存機能を使って新しいAVDを作成します。
ko: 스냅 샷 저장 기능을 사용하여 새 AVD를 만듭니다.
ru: Создание нового AVD с функцией сохранения снимков.
zh_cn: 使用保存快照功能创建一个新的AVD。

source: Currently, it supports only Intel&reg; VT (Intel Virtualization Technology).
es: Actualmente, solo admite Intel&reg; VT (Tecnolog&iacute;a de virtualizaci&oacute;n Intel).
ja: 現在、Intel&reg;VT（Intel Virtualization Technology）のみをサポートしています。
ko: 현재는 인텔 &reg; VT (Intel Virtualization Technology) 만 지원합니다.
ru: В настоящее время он поддерживает только Intel&reg; VT (технология виртуализации Intel).
zh_cn: 当前，它仅支持英特尔&reg;VT（英特尔虚拟化技术）。

source: Don't forget to install the appropriate driver for your operating system:
es: No olvides instalar el controlador apropiado para tu sistema operativo:
ja: お使いのオペレーティングシステムに適切なドライバをインストールすることを忘れないでください。
ko: 운영 체제에 적합한 드라이버를 설치하는 것을 잊지 마십시오 :
ru: Не забудьте установить соответствующий драйвер для вашей операционной системы:
zh_cn: 不要忘记安装适合你的操作系统的驱动程序。

source: Download the <a href="http://www.android-x86.org/download">ISO file</a> that you need.
es: Descargue el <a href="http://www.android-x86.org/download">archivo ISO</a> que necesita.
ja: 必要な<a href="http://www.android-x86.org/download">ISOファイル</a>をダウンロードします。
ko: 필요한 <a href="http://www.android-x86.org/download">ISO 파일</a> 을 다운로드하십시오.
ru: Загрузите <a href="http://www.android-x86.org/download">нужный</a> вам файл ISO .
zh_cn: 下载所需的<a href="http://www.android-x86.org/download">ISO文件</a> 。

source: Download the <strong>x86 Atom System Images</strong> and the <strong>Intel Hardware Accelerated Execution Manager Driver</strong>. Follow the image below:
es: Descargue las <strong>im&aacute;genes del sistema x86 Atom</strong> y el <strong>controlador Intel Hardware Accelerated Execution Manager Driver</strong> . Sigue la imagen a continuaci&oacute;n:
ja: <strong>x86 Atomシステムイメージ</strong>と<strong>Intel Hardware Accelerated Execution Manager Driverを</strong>ダウンロードします。 以下の画像に従ってください：
ko: <strong>x86 Atom 시스템 이미지</strong> 및 <strong>Intel Hardware Accelerated Execution Manager 드라이버를</strong> 다운로드하십시오. 아래 이미지를 따르십시오 :
ru: Загрузите <strong>образы системы x86 Atom</strong> и <strong>драйвер Intel Hardware Accelerated Execution Manager</strong> . Следуйте изображению ниже:
zh_cn: 下载<strong>x86 Atom系统映像</strong>和<strong>Intel硬件加速执行管理器驱动程序</strong> 。 跟随下图：

source: EDIT: Try <a href="https://www.visualstudio.com/vs/msft-android-emulator/">https://www.visualstudio.com/vs/msft-android-emulator/</a>
es: EDITAR: Pruebe <a href="https://www.visualstudio.com/vs/msft-android-emulator/">https://www.visualstudio.com/vs/msft-android-emulator/</a>
ja: 編集： <a href="https://www.visualstudio.com/vs/msft-android-emulator/">https</a> ://www.visualstudio.com/vs/msft-android-emulator/を試してください
ko: 편집 : 시도 <a href="https://www.visualstudio.com/vs/msft-android-emulator/">https://www.visualstudio.com/vs/msft-android-emulator/</a>
ru: РЕДАКТИРОВАТЬ: попробуйте <a href="https://www.visualstudio.com/vs/msft-android-emulator/">https://www.visualstudio.com/vs/msft-android-emulator/</a>
zh_cn: 编辑：尝试<a href="https://www.visualstudio.com/vs/msft-android-emulator/">https://www.visualstudio.com/vs/msft-android-emulator/</a>

source: Emulators are slow. There's really nothing you can do about it, but there are alternatives to the emulator.
es: Los emuladores son lentos.No se puede hacer nada al respecto,pero hay alternativas al emulador.
ja: エミュレータは遅いです。本当にどうすることもできませんが、エミュレータの代わりになるものがあります。
ko: 에뮬레이터가 느립니다. 실제로 할 수있는 일은 없지만 에뮬레이터에 대한 대안이 있습니다.
ru: Эмуляторы медленные.С этим действительно ничего не поделаешь,но есть альтернативы эмулятору.
zh_cn: 仿真器的速度很慢。你真的没有办法,但是仿真器也有替代品。

source: Even if it starts and loads the home screen, it is very sluggish. I have tried the <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse IDE</a> in <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">version 3.5</a> (Galileo) and <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4</a> (Ganymede).
es: Incluso si se inicia y carga la pantalla de inicio, es muy lenta. He probado el <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">IDE de Eclipse</a> en la <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">versi&oacute;n 3.5</a> (Galileo) y <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4</a> (Gan&iacute;medes).
ja: 起動してホーム画面を読み込んでも、非常に遅い。 <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">バージョン3.5</a> （Galileo）および<a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4</a> （Ganymede）で<a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse IDE</a>を試しました。
ko: 홈 화면이 시작되고로드 되더라도 매우 느립니다. <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">버전 3.5</a> (Galileo) 및 <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4</a> (Ganymede)의 <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse IDE</a> 를 사용해 보았습니다.
ru: Даже если он запускается и загружает домашний экран, он очень вялый. Я пробовал <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse IDE</a> в <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">версии 3.5</a> (Galileo) и <a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4</a> (Ganymede).
zh_cn: 即使启动并加载主屏幕，它也非常缓慢。 我已经尝试了<a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.5版</a> （Galileo）和<a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29#Releases">3.4版</a> （Ganymede）的<a href="https://en.wikipedia.org/wiki/Eclipse_%28software%29">Eclipse IDE</a> 。

source: Failed to open the hax module
es: No se abrió el módulo hax
ja: hax モジュールのオープンに失敗しました。
ko: hax 모듈을 열지 못했습니다
ru: Не удалось открыть шестигранный модуль
zh_cn: 无法打开hax模块

source: First, install the Intel x86 Emulator Accelerator (HAXM). This can be downloaded directly from Intel or using Android SDK Manager. In the SDK Manager, it's located under Extras.
es: Primero,instale el Acelerador de Emulador Intel x86 (HAXM).Este puede ser descargado directamente desde Intel o usando el Android SDK Manager.En el SDK Manager,se encuentra en Extras.
ja: まず、Intel x86 Emulator Accelerator(HAXM)をインストールします。これはIntelから直接ダウンロードするか、Android SDK Managerを使ってインストールします。SDK Managerでは、Extrasの下にあります。
ko: 먼저 Intel x86 Emulator Accelerator (HAXM)를 설치하십시오. 이것은 Intel에서 직접 다운로드하거나 Android SDK Manager를 사용하여 다운로드 할 수 있습니다. SDK 관리자에서 Extras 아래에 있습니다.
ru: Сначала установите Intel x86 Emulator Accelerator (HAXM).Его можно скачать непосредственно с сайта Intel или с помощью Android SDK Manager.В SDK Manager,он находится под Extras.
zh_cn: 首先,安装英特尔x86模拟器加速器(HAXM)。这可以直接从Intel下载,也可以使用Android SDK Manager。在SDK管理器中,它位于Extras下面。

source: For enabling <a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">GPU</a> aceleration, run the emulator from the command line or add "-gpu on" to the additional emulator command line options in the AVD configuration.
es: Para habilitar la aceleraci&oacute;n de <a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">GPU</a> , ejecute el emulador desde la l&iacute;nea de comandos o agregue "-gpu on" a las opciones adicionales de la l&iacute;nea de comandos del emulador en la configuraci&oacute;n AVD.
ja: <a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">GPU</a>アクセラレーションを有効にするには、コマンドラインからエミュレーターを実行するか、AVD構成の追加のエミュレーターコマンドラインオプションに「-gpu on」を追加します。
ko: <a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">GPU</a> 가속을 활성화하려면 명령 줄에서 에뮬레이터를 실행하거나 AVD 구성의 추가 에뮬레이터 명령 줄 옵션에 "-gpu on"을 추가하십시오.
ru: Для включения ускорения <a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">графического</a> процессора запустите эмулятор из командной строки или добавьте &laquo;-gpu on&raquo; к дополнительным параметрам командной строки эмулятора в конфигурации AVD.
zh_cn: 要启用<a href="https://en.wikipedia.org/wiki/Graphics_processing_unit">GPU</a>加速，请从命令行运行仿真器，或者在AVD配置中的其他仿真器命令行选项中添加&ldquo; -gpu on&rdquo;。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For those still interested: Try using <a href="http://www.genymotion.com/">Genymotion</a>. You can download a version for Windows/Mac OS X/Linux after registering. A plugin for Eclipse is also available:
es: Para aquellos que todav&iacute;a est&aacute;n interesados: intente usar <a href="http://www.genymotion.com/">Genymotion</a> . Puede descargar una versi&oacute;n para Windows / Mac OS X / Linux despu&eacute;s de registrarse. Un complemento para Eclipse tambi&eacute;n est&aacute; disponible:
ja: まだ興味がある方は、 <a href="http://www.genymotion.com/">Genymotion</a>をお試しください。 登録後、Windows / Mac OS X / Linuxのバージョンをダウンロードできます。 Eclipseのプラグインも利用できます。
ko: 여전히 관심있는 사람들을 위해 : <a href="http://www.genymotion.com/">Genymotion을</a> 사용해보십시오. 등록 후 Windows / Mac OS X / Linux 버전을 다운로드 할 수 있습니다. Eclipse 용 플러그인도 제공됩니다.
ru: Для тех, кто еще заинтересован: попробуйте использовать <a href="http://www.genymotion.com/">Genymotion</a> . Вы можете скачать версию для Windows / Mac OS X / Linux после регистрации. Плагин для Eclipse также доступен:
zh_cn: 对于仍然感兴趣的人：尝试使用<a href="http://www.genymotion.com/">Genymotion</a> 。 注册后，您可以下载Windows / Mac OS X / Linux的版本。 Eclipse的插件也可用：

source: For using the CPU machine extensions, you have to install the driver (caution because it can conflict with existing <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> or <a href="http://en.wikipedia.org/wiki/VMware">VMware</a> drivers). Once it's installed it will be used automatically whenever you use an x86-based AVD.
es: Para usar las extensiones de m&aacute;quina de la CPU, debe instalar el controlador (precauci&oacute;n porque puede entrar en conflicto con los controladores existentes de <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> o <a href="http://en.wikipedia.org/wiki/VMware">VMware</a> ). Una vez que est&eacute; instalado, se usar&aacute; autom&aacute;ticamente cada vez que use un AVD basado en x86.
ja: CPUマシン拡張機能を使用するには、ドライバーをインストールする必要があります（既存の<a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a>または<a href="http://en.wikipedia.org/wiki/VMware">VMware</a>ドライバーと競合する可能性があるので注意してください）。 インストールすると、x86ベースのAVDを使用するときに自動的に使用されます。
ko: CPU 시스템 확장을 사용하려면 드라이버를 설치해야합니다 (기존 <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> 또는 <a href="http://en.wikipedia.org/wiki/VMware">VMware</a> 드라이버와 충돌 할 수 있으므로주의). 설치되면 x86 기반 AVD를 사용할 때마다 자동으로 사용됩니다.
ru: Для использования расширений ЦП необходимо установить драйвер (будьте осторожны, поскольку он может конфликтовать с существующими драйверами <a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a> или <a href="http://en.wikipedia.org/wiki/VMware">VMware</a> ). После установки он будет использоваться автоматически всякий раз, когда вы используете AVD на базе x86.
zh_cn: 要使用CPU机器扩展，必须安装驱动程序（警告，因为它可能与现有的<a href="http://en.wikipedia.org/wiki/VirtualBox">VirtualBox</a>或<a href="http://en.wikipedia.org/wiki/VMware">VMware</a>驱动程序冲突）。 一旦安装，只要您使用基于x86的AVD，它就会自动使用。

source: GenyMotion allows you to control various sensors of your device including the battery level, signal strength, and GPS. The latest version now also contains camera tools.
es: GenyMotion le permite controlar varios sensores de su dispositivo,incluyendo el nivel de la batería,la potencia de la señal y el GPS.La última versión ahora también contiene herramientas para la cámara.
ja: GenyMotionでは、バッテリー残量、信号強度、GPSなど、お使いのデバイスの様々なセンサーをコントロールすることができます。最新バージョンではカメラツールも搭載されました。
ko: GenyMotion을 사용하면 배터리 수준, 신호 강도 및 GPS를 포함하여 장치의 다양한 센서를 제어 할 수 있습니다. 최신 버전에는 카메라 도구도 포함되어 있습니다.
ru: GenyMotion позволяет управлять различными датчиками устройства,включая уровень заряда батареи,уровень сигнала и GPS.Последняя версия также содержит инструменты для работы с камерами.
zh_cn: GenyMotion允许你控制设备的各种传感器,包括电池电量、信号强度和GPS。最新版本还包含了摄像头工具。

source: Good way to speed up Android Emulator and app testing is Install or Upgrade your Android Studio to <a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0</a> version and then go to app open Settings/Preferences, the go to Build, Execution, Deployment &rarr; Instant Run. Click on Enable Instant Run. And After That This will ensure you have the correct gradle plugin for your project to work with Instant Run.
es: Una buena forma de acelerar el emulador de Android y las pruebas de aplicaciones es instalar o actualizar su Android Studio a la versi&oacute;n <a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0</a> y luego vaya a Configuraci&oacute;n / Preferencias de la aplicaci&oacute;n abierta, vaya a Compilaci&oacute;n, Ejecuci&oacute;n, Implementaci&oacute;n &rarr; Ejecuci&oacute;n instant&aacute;nea. Haga clic en Habilitar ejecuci&oacute;n instant&aacute;nea. Y despu&eacute;s de eso, esto garantizar&aacute; que tenga el complemento gradle correcto para que su proyecto funcione con Instant Run.
ja: Android Emulatorとアプリのテストをスピードアップする良い方法は、Android Studioを<a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0</a>バージョンにインストールまたはアップグレードしてから、アプリを開いて[設定] / [設定]を開き、[ビルド、実行、デプロイ]&rarr;[インスタントラン]に移動します。 [インスタントランを有効にする]をクリックします。 その後、これにより、プロジェクトがInstant Runで動作するための正しいGradleプラグインが確実に得られます。
ko: Android 에뮬레이터 및 앱 테스트 속도를 높이는 좋은 방법은 Android Studio를 <a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0</a> 버전으로 설치 또는 업그레이드 한 다음 앱 열기 설정 / 환경 설정으로 이동하여 빌드, 실행, 배포 &rarr; 즉시 실행으로 이동하십시오. 인스턴트 실행 사용을 클릭하십시오. 그리고 그 후에는 프로젝트가 Instant Run과 작동하도록 올바른 gradle 플러그인이 있는지 확인합니다.
ru: Хороший способ ускорить тестирование эмулятора Android и приложений - это установить или обновить Android Studio до версии <a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0,</a> а затем перейти в приложение, открыть &laquo;Настройки / Настройки&raquo;, перейти к &laquo;Сборка&raquo;, &laquo;Выполнение&raquo;, &laquo;Развертывание&raquo; &rarr; &laquo;Мгновенный запуск&raquo;. Нажмите Включить мгновенный запуск. И после этого это гарантирует, что у вас есть правильный плагин Gradle для вашего проекта для работы с Instant Run.
zh_cn: 加快Android Emulator和应用程序测试速度的好方法是将Android Studio安装或升级到<a href="http://tools.android.com/download/studio/builds/2-0-preview">Android Studio 2.0</a>版本，然后转到应用程序打开的设置/首选项，依次转到构建，执行，部署&rarr;即时运行。 单击启用即时运行。 之后，这将确保您具有正确的gradle插件，以便项目可以与Instant Run一起使用。

source: HAX is not working and the emulator runs in emulation mode emulator:
es: HAX no funciona y el emulador funciona en modo de emulación:
ja: HAXが動かず、エミュレータはエミュレーションモードのエミュレータで動作します。
ko: HAX가 작동하지 않고 에뮬레이터가 에뮬레이션 모드 에뮬레이터에서 실행됩니다.
ru: HAX не работает и эмулятор работает в режиме эмуляции:
zh_cn: HAX无法工作,仿真器在仿真模式下运行仿真器。

source: HAX is working and emulator runs in fast virtual mode
es: HAX está funcionando y el emulador se ejecuta en modo virtual rápido
ja: HAXは動作しており、エミュレータは高速仮想モードで動作します。
ko: HAX가 작동하고 에뮬레이터가 빠른 가상 모드에서 실행됩니다.
ru: HAX работает,а эмулятор работает в быстром виртуальном режиме.
zh_cn: HAX可以工作,模拟器在快速虚拟模式下运行。

source: HAXM Speeds Up the Slow Android Emulator
es: HAXM acelera el lento emulador de androides
ja: HAXMは遅いAndroidエミュレータを高速化する
ko: HAXM, 느린 안드로이드 에뮬레이터 속도 향상
ru: HAXM ускоряет медленный эмулятор Android
zh_cn: HAXM加快了慢速安卓模拟器的速度

source: HAXM works with Intel devices, so created a new Emulator with Intel CPU.
es: HAXM trabaja con dispositivos de Intel,así que creó un nuevo emulador con CPU de Intel.
ja: HAXMはIntelデバイスで動作するので、Intel CPUを搭載したエミュレータを新たに作成しました。
ko: HAXM은 Intel 장치와 함께 작동하므로 Intel CPU로 새 에뮬레이터를 만들었습니다.
ru: HAXM работает с устройствами Intel,поэтому создал новый эмулятор с процессором Intel.
zh_cn: HAXM可以与英特尔设备一起工作,所以创建了一个新的英特尔CPU模拟器。

source: Here are some tips to speed up the Android emulator: <em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">How to speed up the Android Emulator by up to 400%</a></em>.
es: Aqu&iacute; hay algunos consejos para acelerar el emulador de Android: <em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">C&oacute;mo acelerar el emulador de Android hasta en un 400%</a></em> .
ja: Androidエミュレータを高速化するためのヒントをいくつか紹介します<em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">。Androidエミュレータを最大400％高速化する方法</a></em> 。
ko: Android 에뮬레이터의 속도를 높이는 방법은 다음과 같습니다. Android 에뮬레이터의 <em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">속도를 최대 400 % 향상시키는 방법</a></em>
ru: Вот несколько советов по ускорению эмулятора Android: <em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">Как ускорить эмулятор Android до 400%</a></em> .
zh_cn: 以下是一些加快Android模拟器速度的技巧： <em><a href="http://www.nuxeo.com/blog/speeding-up-the-android-emulator/">如何</a></em>将Android模拟器<em>速度提高400％</em> 。

source: Here's what I noticed nobody mentioned it at all.
es: Esto es lo que noté que nadie lo mencionó en absoluto.
ja: ここで気付いたのですが、誰も全く触れていませんでした。
ko: 여기 아무도 언급하지 않은 것을 보았습니다.
ru: Вот что я заметила,никто не упоминал об этом вообще.
zh_cn: 这是我注意到的,根本就没人提过。

source: Here's what you can try. It does speed up the emulator for me, especially during loading time. I noticed the emulator is only using a single core of the available CPU. I set it to use all available processors.
es: Esto es lo que puedes intentar.Acelera el emulador para mí,especialmente durante el tiempo de carga.Me di cuenta de que el emulador sólo utiliza un único núcleo de la CPU disponible.Lo configuré para usar todos los procesadores disponibles.
ja: これを試してみてください。エミュレータを高速化してくれます。エミュレータは利用可能なCPUのシングルコアしか使っていないことに気づきました。利用可能なすべてのプロセッサを使うように設定しました。
ko: 시도해 볼 수있는 것이 있습니다. 특히 로딩 시간 동안 에뮬레이터의 속도를 높입니다. 에뮬레이터가 사용 가능한 CPU의 단일 코어 만 사용하고 있음을 알았습니다. 사용 가능한 모든 프로세서를 사용하도록 설정했습니다.
ru: Вот что ты можешь попробовать.Он действительно ускоряет эмулятор для меня,особенно во время загрузки.Я заметил,что эмулятор использует только одно ядро доступного процессора.Я настроил его на использование всех доступных процессоров.
zh_cn: 这是你可以试试的。它确实为我提高了模拟器的速度,尤其是在加载时间内。我注意到模拟器只使用了一个可用CPU的单核。我把它设置为使用所有可用的处理器。

source: However Android Studio is right now in Preview you can try it now.
es: Sin embargo,Android Studio está ahora mismo en la vista previa,puedes probarlo ahora.
ja: しかし、Android Studioは現在プレビュー中で、今すぐ試すことができます。
ko: 그러나 Android Studio는 현재 미리보기에 있으며 지금 시도해 볼 수 있습니다.
ru: Однако Android Studio находится прямо сейчас в Предварительном просмотре вы можете попробовать его сейчас.
zh_cn: 不过Android Studio现在正在预览中,你现在就可以试试了。
