Repository: rueisnom/feedback
Catalog: xlf/15/54/09/9/1554099.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: , type <code>netcfg</code>, remember the IP address, press
es: , escriba <code>netcfg</code> , recuerde la direcci&oacute;n IP, presione
ja: 、 <code>netcfg</code> と入力し、IPアドレスを覚えて、
ko: <code>netcfg</code> 를 입력하고 IP 주소를 기억 한 다음
ru: введите <code>netcfg</code> , запомните IP-адрес, нажмите
zh_cn: ，键入 <code>netcfg</code> ，记住IP地址，按

source: . Then enable <code>Quick Boot</code> like below screenshot.
es: . Luego habilite <code>Quick Boot</code> como se muestra a continuaci&oacute;n.
ja: 。 次に、スクリーンショットのように <code>Quick Boot</code> 有効にします。
ko: . 그런 다음 아래 스크린 샷과 같이 <code>Quick Boot</code> 활성화하십시오.
ru: , Затем включите <code>Quick Boot</code> , как показано на скриншоте ниже.
zh_cn: 。 然后启用 <code>Quick Boot</code> 如下图所示。

source: <a href="http://developer.android.com/sdk/eclipse-adt.html">Android Development Tools (ADT) 9.0.0</a> (or later) has a feature that allows you to save state of the AVD (emulator), and you can start your emulator instantly. You have to enable this feature while creating a new AVD or you can just create it later by editing the AVD.
es: <a href="http://developer.android.com/sdk/eclipse-adt.html">Las Herramientas de desarrollo de Android (ADT) 9.0.0</a> (o posterior) tienen una funci&oacute;n que le permite guardar el estado del AVD (emulador) y puede iniciar su emulador al instante. Debe habilitar esta funci&oacute;n mientras crea un nuevo AVD o puede crearlo m&aacute;s tarde editando el AVD.
ja: <a href="http://developer.android.com/sdk/eclipse-adt.html">Android Development Tools（ADT）9.0.0</a> （またはそれ以降）には、AVD（エミュレーター）の状態を保存できる機能があり、エミュレーターを即座に起動できます。 新しいAVDを作成するときにこの機能を有効にする必要があります。または、AVDを編集して後で作成することもできます。
ko: <a href="http://developer.android.com/sdk/eclipse-adt.html">ADT (Android Development Tools) 9.0.0</a> 이상에는 AVD (에뮬레이터) 상태를 저장하고 에뮬레이터를 즉시 시작할 수있는 기능이 있습니다. 새 AVD를 만드는 동안이 기능을 활성화해야하거나 나중에 AVD를 편집하여 만들 수 있습니다.
ru: <a href="http://developer.android.com/sdk/eclipse-adt.html">Android Development Tools (ADT) 9.0.0</a> (или более поздняя версия ) имеет функцию, которая позволяет вам сохранять состояние AVD (эмулятора), и вы можете сразу же запустить свой эмулятор. Вы должны включить эту функцию при создании нового AVD или вы можете просто создать его позже, отредактировав AVD.
zh_cn: <a href="http://developer.android.com/sdk/eclipse-adt.html">Android开发工具（ADT）9.0.0</a> （或更高版本）具有一项功能，可让您保存AVD（仿真器）的状态，并且可以立即启动仿真器。 您必须在创建新的AVD时启用此功能，也可以稍后通过编辑AVD来创建它。

source: <code>-icount [N|auto]</code> -- enable virtual instruction counter with 2^N clock ticks per instruction
es: <code>-icount [N|auto]</code> : habilita el contador de instrucciones virtual con 2 ^ N ticks de reloj por instrucci&oacute;n
ja: <code>-icount [N|auto]</code> -命令ごとに2 ^ Nクロックティックの仮想命令カウンターを有効にします
ko: <code>-icount [N|auto]</code> -명령 당 2 ^ N 클럭 틱으로 가상 명령 카운터를 활성화합니다.
ru: <code>-icount [N|auto]</code> - включить виртуальный счетчик команд с 2 ^ N тактами на инструкцию
zh_cn: <code>-icount [N|auto]</code> -启用虚拟指令计数器，每条指令具有2 ^ N个时钟滴答

source: <code>-no-boot-anim</code> -- disable animation for faster boot
es: <code>-no-boot-anim</code> - deshabilita la animaci&oacute;n para un arranque m&aacute;s r&aacute;pido
ja: <code>-no-boot-anim</code> -アニメーションを無効にしてブートを高速化
ko: <code>-no-boot-anim</code> - 더 빠른 부팅을 위해 애니메이션 비활성화
ru: <code>-no-boot-anim</code> - отключить анимацию для более быстрой загрузки
zh_cn: <code>-no-boot-anim</code> -禁用动画以加快启动速度

source: <code>-qemu args...</code> -- pass arguments to qemu
es: <code>-qemu args...</code> - pasa argumentos a qemu
ja: <code>-qemu args...</code> 引数をqemuに渡します
ko: <code>-qemu args...</code> 인수를 qemu에 전달
ru: <code>-qemu args...</code> - передать аргументы qemu
zh_cn: <code>-qemu args...</code> 将参数传递给qemu

source: <code>@my_avd</code> -- launch a virtual device named 'my_avd'
es: <code>@my_avd</code> : inicia un dispositivo virtual llamado 'my_avd'
ja: <code>@my_avd</code> - 「my_avd」という名前の仮想デバイスを起動します
ko: <code>@my_avd</code> - 'my_avd'라는 가상 장치를 시작합니다
ru: <code>@my_avd</code> - запустить виртуальное устройство с именем &laquo;my_avd&raquo;
zh_cn: <code>@my_avd</code> -启动名为'my_avd'的虚拟设备

source: <strong><em>Genymotion - Preferred</em></strong>
es: <strong><em>Genymotion - Preferido</em></strong>
ja: <strong><em>Genymotion-優先</em></strong>
ko: <strong><em>Genymotion-선호</em></strong>
ru: <strong><em>Genymotion - Предпочтительный</em></strong>
zh_cn: <strong><em>Genymotion-首选</em></strong>

source: <strong>Always double-check the settings after saving!</strong> The emulator is very picky about what it allows you to set, and it will revert configurations without telling you.
es: <strong>&iexcl;Siempre verifique dos veces la configuraci&oacute;n despu&eacute;s de guardar!</strong> El emulador es muy exigente con lo que le permite configurar, y revertir&aacute; las configuraciones sin avisarle.
ja: <strong>保存後は必ず設定を再確認してください！</strong> エミュレータは、何を設定できるかについて非常にうるさいので、ユーザーに通知せずに構成を元に戻します。
ko: <strong>저장 후 항상 설정을 다시 확인하십시오!</strong> 에뮬레이터는 사용자가 설정할 수있는 것에 매우 까다 롭고 사용자에게 알리지 않고 구성을 되돌립니다.
ru: <strong>Всегда перепроверяйте настройки после сохранения!</strong> Эмулятор очень требователен к тому, что он позволяет вам установить, и он вернет конфигурации, не сообщая вам.
zh_cn: <strong>保存后请务必仔细检查设置！</strong> 该仿真器对允许您设置的内容非常挑剔，它将在不通知您的情况下还原配置。

source: <strong>Assign all available processors to the emulator</strong>
es: <strong>Asigne todos los procesadores disponibles al emulador.</strong>
ja: <strong>利用可能なすべてのプロセッサをエミュレータに割り当てます</strong>
ko: <strong>사용 가능한 모든 프로세서를 에뮬레이터에 할당</strong>
ru: <strong>Назначьте все доступные процессоры на эмулятор</strong>
zh_cn: <strong>将所有可用处理器分配给仿真器</strong>

source: <strong>HAXM</strong> stands for - <strong>"Intel Hardware Accelerated Execution Manager"</strong>
es: <strong>HAXM</strong> significa <strong>"Intel Hardware Accelerated Execution Manager"</strong>
ja: <strong>HAXM</strong>は<strong>「Intel Hardware Accelerated Execution Manager」の</strong>略です<strong>。</strong>
ko: <strong>HAXM</strong> 은 <strong>"Intel Hardware Accelerated Execution Manager"의</strong> 약자입니다.
ru: <strong>HAXM</strong> расшифровывается как <strong>&laquo;Intel Hardware Acceleted Execution Manager&raquo;</strong>
zh_cn: <strong>HAXM</strong>代表- <strong>&ldquo;英特尔硬件加速执行管理器&rdquo;</strong>

source: <strong>IMPORTANT NOTE</strong>: Please <strong>first</strong> refer to <a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">the Intel list about VT</a> to make sure your CPU supports Intel VT.
es: <strong>NOTA IMPORTANTE</strong> : Consulte <strong>primero</strong> <a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">la lista de Intel sobre VT</a> para asegurarse de que su CPU sea compatible con Intel VT.
ja: <strong>重要な注意</strong> ：CPUがIntel VTをサポートしていることを確認するに<a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">は、</a> <strong>まず</strong> VTに関するIntelリストを参照してください。
ko: <strong>중요 참고</strong> : CPU가 Intel VT를 지원하는지 확인하려면 먼저 <a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">VT</a> 에 대한 Intel 목록을 참조하십시오.
ru: <strong>ВАЖНОЕ ПРИМЕЧАНИЕ</strong> : Пожалуйста, <strong>сначала</strong> обратитесь к <a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">списку Intel о VT,</a> чтобы убедиться, что ваш процессор поддерживает Intel VT.
zh_cn: <strong>重要说明</strong> ：请<strong>首先</strong>参考<a href="http://web.archive.org/web/20160102075218/http://ark.intel.com/Products/VirtualizationTechnology">有关VT的Intel列表</a> ，以确保您的CPU支持Intel VT。

source: <strong>Set the device memory to 1024&nbsp; MB or more</strong>, but not more than the Intel HAXM setting. I use 1024&nbsp; MB per device and 2048 for HAXM.
es: <strong>Configure la memoria del dispositivo a 1024 MB o m&aacute;s</strong> , pero no m&aacute;s que la configuraci&oacute;n Intel HAXM. Yo uso 1024 MB por dispositivo y 2048 para HAXM.
ja: <strong>デバイスのメモリを1024 MB以上</strong> 、Intel HAXM設定以下に設定します。 デバイスごとに1024 MBを使用し、HAXM​​には2048を使用します。
ko: <strong>장치 메모리를 1024MB</strong> 이상으로 설정하고 Intel HAXM 설정을 초과하지 마십시오. 장치 당 1024MB, HAXM에는 2048을 사용합니다.
ru: <strong>Установите для памяти устройства значение 1024 МБ или более</strong> , но не более, чем параметр Intel HAXM. Я использую 1024 МБ на устройство и 2048 для HAXM.
zh_cn: <strong>将设备内存设置为1024 MB或更大</strong> ，但不要超过Intel HAXM设置。 我为每个设备使用1024 MB，为HAXM使用2048。

source: <strong>UPDATE:</strong> The latest version of Android studio (2.x) made major improvements to the bundled emulator. It's responsive and has a whole bunch of features.
es: <strong>ACTUALIZACI&Oacute;N:</strong> La &uacute;ltima versi&oacute;n de Android Studio (2.x) realiz&oacute; importantes mejoras en el emulador incluido. Es sensible y tiene un mont&oacute;n de caracter&iacute;sticas.
ja: <strong>更新：</strong> Android Studio（2.x）の最新バージョンは、バンドルされたエミュレーターに大きな改良を加えました。 応答性が高く、多くの機能を備えています。
ko: <strong>업데이트 :</strong> 최신 버전의 Android 스튜디오 (2.x)는 번들 에뮬레이터를 크게 개선했습니다. 반응 형이며 다양한 기능이 있습니다.
ru: <strong>ОБНОВЛЕНИЕ:</strong> Последняя версия Android Studio (2.x) внесла значительные улучшения в комплектный эмулятор. Это отзывчивый и имеет целый ряд функций.
zh_cn: <strong>更新：</strong>最新版本的Android Studio（2.x）对捆绑的模拟器进行了重大改进。 它反应灵敏，并具有很多功能。

source: <strong>Use GPU emulation.</strong> You cannot use the Snapshot option when using GPU emulation as of this writing. Ensure that GPU emulation is set to "yes".
es: <strong>Use la emulaci&oacute;n de GPU.</strong> No puede usar la opci&oacute;n Instant&aacute;nea al usar la emulaci&oacute;n de GPU a partir de este escrito. Aseg&uacute;rese de que la emulaci&oacute;n de GPU est&eacute; configurada en "s&iacute;".
ja: <strong>GPUエミュレーションを使用します。</strong> この記事の執筆時点では、GPUエミュレーションを使用している場合は、スナップショットオプションを使用できません。 GPUエミュレーションが「はい」に設定されていることを確認します。
ko: <strong>GPU 에뮬레이션을 사용하십시오.</strong> 이 글을 쓰는 시점에서 GPU 에뮬레이션을 사용할 때는 스냅 샷 옵션을 사용할 수 없습니다. GPU 에뮬레이션이 "yes"로 설정되어 있는지 확인하십시오.
ru: <strong>Используйте эмуляцию GPU.</strong> На момент написания этой статьи нельзя использовать параметр &laquo;Снимок&raquo; при использовании эмуляции графического процессора. Убедитесь, что для эмуляции графического процессора установлено значение &laquo;да&raquo;.
zh_cn: <strong>使用GPU仿真。</strong> 在撰写本文时，使用GPU仿真时，不能使用Snapshot选项。 确保将GPU仿真设置为&ldquo;是&rdquo;。

source: A new option is the <a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">Visual Studio Emulator for Android</a>--it's fast, <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a>, x86, and <a href="http://aka.ms/vsemu">free to download even without VS</a>.
es: Una nueva opci&oacute;n es el <a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">Visual Studio Emulator para Android:</a> es r&aacute;pido, <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a> , x86 y se <a href="http://aka.ms/vsemu">puede descargar gratis incluso sin VS.</a>
ja: 新しいオプションは、 <a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">Android用のVisual Studio Emulatorです。これ</a>は、高速、 <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a> 、x86で、 <a href="http://aka.ms/vsemu">VSがなくても無料でダウンロードできます</a> 。
ko: 새로운 옵션은 <a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">Android 용 Visual Studio Emulator입니다.</a> 빠르고, <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a> , x86이며 <a href="http://aka.ms/vsemu">VS 없이도 무료로 다운로드 할 수</a> 있습니다.
ru: Новый параметр - <a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">эмулятор Visual Studio для Android</a> - он быстрый, <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a> , x86 и <a href="http://aka.ms/vsemu">может быть загружен даже без VS.</a>
zh_cn: 一个新选项是<a href="http://blogs.msdn.com/b/visualstudioalm/archive/2014/11/12/introducing-visual-studio-s-emulator-for-android.aspx">适用于Android</a>的Visual Studio模拟器 -快速， <a href="http://en.wikipedia.org/wiki/Hyper-V">Hyper-V</a> ，x86， <a href="http://aka.ms/vsemu">即使没有VS</a>也可以免费下载 。

source: After compiling, it installs instantly. It is very impressive, considering I have rather an average computer hardware (dual core with 4&nbsp; GB of RAM).
es: Despu&eacute;s de compilar, se instala instant&aacute;neamente. Es muy impresionante, teniendo en cuenta que tengo un hardware de computadora bastante promedio (doble n&uacute;cleo con 4 GB de RAM).
ja: コンパイル後、すぐにインストールされます。 かなり平均的なコンピューターハードウェア（4 GBのRAMを搭載したデュアルコア）を持っていることを考えると、それは非常に印象的です。
ko: 컴파일 후 즉시 설치됩니다. 나는 평균적인 컴퓨터 하드웨어 (4 GB RAM의 듀얼 코어)를 가지고 있다는 것을 고려할 때 매우 인상적입니다.
ru: После компиляции он устанавливается мгновенно. Это очень впечатляет, учитывая, что у меня довольно среднее компьютерное оборудование (двухъядерный с 4 ГБ оперативной памяти).
zh_cn: 编译后，它将立即安装。 考虑到我拥有相当普通的计算机硬件（具有4 GB RAM的双核），这非常令人印象深刻。

source: After developing for a while, my emulator became brutally slow. I chose <strong>wipe user data</strong>, and it was much much better. I am guessing that it takes time to load up each <a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK</a> file you've deployed.
es: Despu&eacute;s de desarrollarse por un tiempo, mi emulador se volvi&oacute; brutalmente lento. Eleg&iacute; <strong>borrar datos de usuario</strong> , y fue mucho mejor. Supongo que lleva tiempo cargar cada archivo <a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK</a> que ha implementado.
ja: しばらく開発した後、私のエミュレータは残酷に遅くなりました。 <strong>ユーザーデータのワイプ</strong>を選択しましたが、はるかに優れていました。 デプロイした各<a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK</a>ファイルの読み込みには時間がかかると思います。
ko: 잠시 동안 개발 한 후 에뮬레이터가 잔인하게 느려졌습니다. 나는 <strong>사용자 데이터 지우기를</strong> 선택했으며 훨씬 나아졌습니다. 배포 한 각 <a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK</a> 파일을로드하는 데 시간이 걸리는 것 같습니다.
ru: После некоторой разработки мой эмулятор стал очень медленным. Я выбрал <strong>стирание пользовательских данных</strong> , и это было намного лучше. Я предполагаю, что для загрузки каждого развернутого вами <a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK-</a> файла требуется время.
zh_cn: 经过一段时间的开发，我的模拟器变得非常缓慢。 我选择了<strong>擦除用户数据</strong> ，这要好得多。 我猜想加载您部署的每个<a href="http://en.wikipedia.org/wiki/APK_%28file_format%29">APK</a>文件都需要时间。

source: After these changes, Android Emulator was launching in 5-10 seconds and running without any noticeable lag. Be aware that these features are hardware dependent (CPU/GPU) and may not work on some systems.
es: Después de estos cambios,el Emulador de Androides se lanzó en 5-10 segundos y funcionó sin ningún retraso notable.Tengan en cuenta que estas características dependen del hardware (CPUGPU)y pueden no funcionar en algunos sistemas.
ja: これらの変更後、Androidエミュレータは5~10秒で起動し、目立ったラグもなく動作していました。なお、これらの機能はハードウェア(CPUGPU)に依存しているため、システムによっては動作しない場合があります。
ko: 이러한 변경 후 Android Emulator가 5-10 초 안에 시작되어 눈에 띄는 지연없이 실행되었습니다. 이러한 기능은 하드웨어 종속적 (CPU / GPU)이며 일부 시스템에서는 작동하지 않을 수 있습니다.
ru: После этих изменений эмулятор Android запускался через 5-10 секунд и работал без заметного запаздывания.Имейте в виду,что эти функции зависят от аппаратного обеспечения (CPUGPU)и могут не работать на некоторых системах.
zh_cn: 经过这些改动后,安卓模拟器在5-10秒内启动并运行,没有任何明显的延迟。请注意,这些功能对硬件有一定的依赖性(CPUGPU),可能在某些系统上无法工作。

source: After you have installed the drivers and downloaded an Android X86 system image (as described in the documentation) you should be able to create a new AVD using the x86 image:
es: Después de haber instalado los controladores y descargado una imagen del sistema Android X86 (como se describe en la documentación)debería poder crear un nuevo AVD utilizando la imagen x86:
ja: ドライバをインストールし、Android X86システムイメージをダウンロードしたら(ドキュメントに記載されているように)、x86イメージを使って新しいAVDを作成することができるはずです。
ko: 드라이버를 설치하고 문서에 설명 된대로 Android X86 시스템 이미지를 다운로드 한 후 x86 이미지를 사용하여 새 AVD를 작성할 수 있습니다.
ru: После установки драйверов и загрузки образа системы Android X86 (как описано в документации)вы сможете создать новый AVD,используя образ x86:
zh_cn: 在你安装了驱动程序并下载了Android X86系统映像(如文档中描述的那样)后,你应该可以使用x86映像创建一个新的AVD。

source: Also I have increased the <code>Device RAM Size</code> to <code>1024</code> which results in a very fast emulator.
es: Tambi&eacute;n he aumentado el <code>Device RAM Size</code> del dispositivo a <code>1024</code> ,lo que resulta en un emulador muy r&aacute;pido.
ja: また、 <code>Device RAM Size</code> を <code>1024</code> に増やしました。これにより、エミュレータが非常に高速になります。
ko: 또한 <code>Device RAM Size</code> 를 <code>1024</code> 로 늘려서 에뮬레이터가 매우 빠릅니다.
ru: Также я увеличил <code>Device RAM Size</code> до <code>1024</code> , что привело к очень быстрому эмулятору.
zh_cn: 另外，我将 <code>Device RAM Size</code> 增加到 <code>1024</code> ，这导致了非常快速的仿真器。

source: And Instant run will look like this
es: Y Instant run se verá así
ja: そして、Instant runは以下のようになります。
ko: 그리고 인스턴트 런은 다음과 같습니다
ru: И мгновенный пробег будет выглядеть так.
zh_cn: 瞬间运行会是这样的

source: And for speeding up your emulator you can refer to <em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">Speed up your Android Emulator!</a></em>:
es: Y para acelerar su emulador, puede consultar <em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">&iexcl;Acelere su emulador de Android!</a></em> :
ja: エミュレータを高速化するには<em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">、Androidエミュレータの高速</a></em>化を参照し<em>てください。</em> ：
ko: 에뮬레이터 <em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">속도를 높이려면 Android 에뮬레이터 속도 향상을</a></em> 참조하십시오 <em>!</em> :
ru: А для ускорения эмулятора вы можете обратиться к <em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">разделу &laquo;Ускорить эмулятор Android&raquo;!</a></em> :
zh_cn: 有关加速模拟器的信息，请参阅<em><a href="http://jolicode.com/blog/speed-up-your-android-emulator">加速Android模拟器！</a></em> ：

source: And now the emulator (although takes a while to start) seems to be running faster than previously.
es: Y ahora el emulador (aunque tarda un poco en arrancar)parece estar funcionando más rápido que antes.
ja: そして、今では(起動に時間はかかりますが)エミュレータが以前よりも速く動くようになったようです。
ko: 그리고 이제 에뮬레이터 (시작하는 데 시간이 걸리지 만)가 이전보다 빠르게 실행되는 것으로 보입니다.
ru: И теперь эмулятор (хотя на его запуск требуется некоторое время),кажется,работает быстрее,чем раньше.
zh_cn: 而现在模拟器(虽然启动需要一段时间)似乎比以前运行得更快。

source: And start it:
es: Y empezarlo:
ja: そして、それを開始します。
ko: 그리고 그것을 시작하십시오 :
ru: И начинай:
zh_cn: 并启动它。

source: Android SDK rev. 17 supports Virtual Machine Acceleration using AMD and Intel virtualization technologies.
es: Android SDK rev.17 soporta la aceleración de máquinas virtuales usando tecnologías de virtualización AMD e Intel.
ja: Android SDK rev.17は、AMDとIntelの仮想化技術を使用したVirtual Machine Accelerationをサポートしています。
ko: 안드로이드 SDK rev. 17은 AMD 및 Intel 가상화 기술을 사용한 Virtual Machine Acceleration을 지원합니다.
ru: Android SDK rev.17 поддерживает ускорение виртуальной машины с помощью технологий виртуализации AMD и Intel.
zh_cn: Android SDK rev.17支持使用AMD和英特尔虚拟化技术的虚拟机加速。

source: Android emulator is dead slow. It takes 800MB memory while running. If you are on Windows, You can use Microsoft Android Emulator. It is superb, provides you functionalities more than Android Studio Emulator. And most important it is fast ( consumes 13MB only). It comes with Visual Studio 2015 Technical Preview. I am using it and happy with it. I downloaded and installed entire VS pack, I need to look how we can install VS Emulator only.
es: El emulador de androides es muy lento.Requiere 800 MB de memoria mientras funciona.Si estás en Windows,puedes usar el emulador de Android de Microsoft.Es magnífico,le proporciona más funcionalidades que el emulador de estudios de Android.Y lo más importante es que es rápido (sólo consume 13MB).Viene con la vista previa técnica de Visual Studio 2015.Lo estoy usando y estoy feliz con él.Descargué e instalé el paquete completo de VS,necesito ver cómo podemos instalar sólo el emulador de VS.
ja: Androidエミュレータは致命的に遅い。実行中に800MBのメモリを消費します。Windowsの場合は、MicrosoftのAndroidエミュレータを使うことができます。Android Studio Emulator以上の機能を提供してくれます。そして、最も重要なのは、それが高速であることです(13MBのみを消費します)。それはVisual Studio 2015 Technical Previewが付属しています。私はそれを使用しており、それに満足しています。私は全体のVSパックをダウンロードしてインストールし、私は我々が唯一のVSエミュレータをインストールすることができますどのように見る必要があります。
ko: 안드로이드 에뮬레이터가 느리게 죽었습니다. 실행하는 동안 800MB의 메모리가 필요합니다. Windows를 사용하는 경우 Microsoft Android 에뮬레이터를 사용할 수 있습니다. Android Studio Emulator 이상의 기능을 제공합니다. 가장 중요한 것은 빠릅니다 (13MB 만 사용). Visual Studio 2015 Technical Preview와 함께 제공됩니다. 나는 그것을 사용하고 행복합니다. 전체 VS 팩을 다운로드하여 설치했습니다. VS Emulator 만 설치하는 방법을 찾아야합니다.
ru: Эмулятор Андроидов работает очень медленно.Во время работы он занимает 800 Мб памяти.Если вы работаете под Windows,вы можете использовать Microsoft Android эмулятор.Это превосходно,предоставляет вам функциональность больше,чем Android Studio Emulator.И самое главное,он быстрый (потребляет только 13MB).Он поставляется с Visual Studio 2015 Технический Просмотр.Я использую его и счастлив с ним.Скачал и установил весь VS пакет,нужно посмотреть,как можно установить только VS эмулятор.
zh_cn: 安卓模拟器的运行速度很慢。运行时需要800MB内存。如果你是在Windows上,你可以使用Microsoft Android模拟器。它是一流的,提供给你的功能比Android Studio模拟器更多。最重要的是,它的速度很快(只需13MB)。它自带Visual Studio 2015技术预览版。我正在使用它并对它感到满意。我下载并安装了整个VS包,我需要看一下如何才能安装VS模拟器。

source: Android emulator release 9 has a new "snapshot" feature. You can <a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">save the state of the emulator</a> (make an image of the emulator) and avoid booting when you start the emulator.
es: La versi&oacute;n 9 del emulador de Android tiene una nueva funci&oacute;n de "instant&aacute;nea". Puede <a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">guardar el estado del emulador</a> (hacer una imagen del emulador) y evitar arrancar cuando lo inicia.
ja: Androidエミュレータリリース9には、新しい「スナップショット」機能があります。 <a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">エミュレーターの状態を保存</a> （ エミュレーターのイメージを作成）して、エミュレーターの開始時にブートを回避できます。
ko: Android 에뮬레이터 릴리스 9에는 새로운 "스냅 샷"기능이 있습니다. <a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">에뮬레이터의 상태를 저장하고</a> ( 에뮬레이터 이미지 만들기) 에뮬레이터를 시작할 때 부팅을 피할 수 있습니다.
ru: Эмулятор Android версии 9 имеет новую функцию &laquo;снимка&raquo;. Вы можете <a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">сохранить состояние эмулятора</a> (создать образ эмулятора) и избежать загрузки при запуске эмулятора.
zh_cn: Android仿真器版本9具有新的&ldquo;快照&rdquo;功能。 您可以<a href="http://good-android-dev.blogspot.com/2011/02/slow-android-emulator-speed-up-it.html">保存仿真器的状态</a> （制作仿真器映像），并避免在启动仿真器时启动。

source: As of Revision 17 of Android SDK Tools, the emulator can use graphic acceleration and CPU-provided extensions for better efficiency. The prerequisites and full configuration and user notes are at:
es: A partir de la revisión 17 de las herramientas del SDK de Android,el emulador puede utilizar la aceleración gráfica y las extensiones proporcionadas por la CPU para una mejor eficiencia.Los prerrequisitos y la configuración completa y las notas de usuario están en:
ja: Android SDK ToolsのRevision 17では、エミュレータはグラフィックアクセラレーションとCPUが提供する拡張機能を使用して効率を向上させることができます。前提条件と完全な設定とユーザーノートはこちらです。
ko: Android SDK 도구 개정 17부터 에뮬레이터는 그래픽 가속 및 CPU 제공 확장을 사용하여 효율성을 높일 수 있습니다. 전제 조건 및 전체 구성 및 사용자 참고 사항은 다음과 같습니다.
ru: Начиная с 17-й версии Android SDK Tools,эмулятор может использовать графическое ускорение и расширения,предоставляемые процессором,для большей эффективности.Предпосылки и полная конфигурация и примечания пользователей находятся на:
zh_cn: 从Android SDK工具的第17版开始,模拟器可以使用图形加速和CPU提供的扩展来提高效率。前提条件和完整的配置和用户说明在。
