Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Rule Description A violation of this rule occurs when a using directive or a using-alias directive is placed outside of a namespace element, unless the file does not contain any namespace elements.
es: Descripción de la regla La violación de esta regla se produce cuando se coloca una directiva de uso o una directiva de alias de uso fuera de un elemento del espacio de nombres,a menos que el archivo no contenga ningún elemento del espacio de nombres.
ja: ルール説明 このルールの違反は、ファイルに名前空間要素が含まれていない場合を除き、using指示文やusing-alias指示文が名前空間要素の外側に置かれた場合に発生します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">규칙 설명이 규칙의 위반은 파일에 네임 스페이스 요소가 포함되지 않은 경우 using 지시문 또는 using-alias 지시문이 네임 스페이스 요소 외부에 배치 될 때 발생합니다.</font></font>
ru: Описание правила Нарушение этого правила происходит,когда директива use или директива using-alias размещается вне элемента пространства имен,если только файл не содержит элементов пространства имен.
zh_cn: 规则说明 当使用指令或使用-alias指令被放置在命名空间元素之外时,除非文件中不包含任何命名空间元素,否则会发生违反本规则的情况。

source: SA1200: UsingDirectivesMustBePlacedWithinNamespace
es: SA1200:UsandoDirectivosDebe ser colocado en el espacio de nombres
ja: SA1200.UsingDirectivesは名前空間内に配置されなければならない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SA1200 : 네임 스페이스에서 지시문 사용</font></font>
ru: SA1200:ИспользованиеДирективМужноБитьПлацданСайтNamespace .

source: Should 'using' directives be inside or outside the namespace
es: ¿Deberían las directivas de "uso" estar dentro o fuera del espacio de nombres
ja: using' ディレクティブは名前空間の中にあるべきか外にあるべきか
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">'사용'지시문은 네임 스페이스 내부 또는 외부에 있어야합니다.</font></font>
ru: Должны ли директивы 'use' находиться внутри или вне пространства имен
zh_cn: 使用 "使用 "指令应该在命名空间内部还是外部?

source: Some would argue that <code>Math</code> might be a bad name for a user-defined class, since there's already one in <code>System</code>; the point here is just that there <em>is</em> a difference, and it affects the maintainability of your code.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Algunos argumentar&iacute;an que </font></font> <code>Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> podr&iacute;a ser un mal nombre para una clase definida por el usuario, ya que ya hay una en el </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">El punto aqu&iacute; es que no </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> una diferencia, y que afecta a la capacidad de mantenimiento de su c&oacute;digo.</font></font>
ja: <font style="vertical-align: inherit;"> <code>System</code> には<font style="vertical-align: inherit;">すでにクラスが存在するので、</font></font> <code>Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">はユーザー定義クラスの悪い名前かもしれない</font><font style="vertical-align: inherit;">と主張する</font><font style="vertical-align: inherit;">人もい</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">ここでのポイント</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、違い</font><em><font style="vertical-align: inherit;">が</font></em><font style="vertical-align: inherit;">ある</font><font style="vertical-align: inherit;">ということだけであり</font><font style="vertical-align: inherit;">、コードの保守性に影響します。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부는 </font> <code>System</code> <font style="vertical-align: inherit;"> 이미 </font></font> <code>Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 있기 </font><font style="vertical-align: inherit;">때문에 </font><font style="vertical-align: inherit;">Math</font><font style="vertical-align: inherit;"> 가 사용자 정의 클래스에 나쁜 이름 일 수 </font><font style="vertical-align: inherit;">있다고 주장합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">여기서 요점은 </font><font style="vertical-align: inherit;">차이점 </font><em><font style="vertical-align: inherit;">이</font></em><font style="vertical-align: inherit;"> 있으며 코드 유지 관리에 영향을 미친다는 것입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Некоторые утверждают, что </font></font> <code>Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> может быть плохим именем для пользовательского класса, поскольку в </font></font> <code>System</code> он уже есть<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font><font style="vertical-align: inherit;">Дело здесь только в том, что </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">есть</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> разница, и это влияет на удобство сопровождения вашего кода.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有人会认为</font></font> <code>Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对于用户定义的类来说可能是个坏名字，因为</font></font> <code>System</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">已经有一个了</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这里要说的就是这样存在</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">差异，并且它会影响您的代码的可维护性。</font></font>

source: Suppose you have these namespaces:
es: Supongamos que tienes estos espacios para nombres:
ja: 以下のような名前空間があるとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 네임 스페이스가 있다고 가정하십시오.</font></font>
ru: Предположим,у вас есть эти пространства имен:
zh_cn: 假设你有这些命名空间。

source: That may omit the outer namespace in the <code>using</code> directive, for short:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso puede omitir el espacio de nombres externo en la </font><font style="vertical-align: inherit;">directiva </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , para abreviar:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これ</font><font style="vertical-align: inherit;">により、</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクティブの</font><font style="vertical-align: inherit;">外側の名前空間が省略される場合があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지시문 </font><font style="vertical-align: inherit;">에서 외부 네임 스페이스를 생략 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это может опустить внешнее пространство имен в </font><font style="vertical-align: inherit;">директиве </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , для краткости:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">简而言之，</font><font style="vertical-align: inherit;">这可能会省略</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令中</font><font style="vertical-align: inherit;">的外部名称空间</font><font style="vertical-align: inherit;">：</font></font>

source: The code creates an alias to the System.Guid type called Guid, and also creates its own type called Guid with a matching constructor interface. Later, the code creates an instance of the type Guid. To create this instance, the compiler must choose between the two different definitions of Guid. When the using-alias directive is placed outside of the namespace element, the compiler will choose the local definition of Guid defined within the local namespace, and completely ignore the using-alias directive defined outside of the namespace. This, unfortunately, is not obvious when reading the code.
es: El código crea un alias del tipo System.Guid llamado Guid,y también crea su propio tipo llamado Guid con una interfaz de constructor que coincide.Más tarde,el código crea una instancia del tipo Guid.Para crear esta instancia,el compilador debe elegir entre las dos diferentes definiciones de Guid.Cuando la directiva using-alias se coloca fuera del elemento del espacio de nombres,el compilador elegirá la definición local de Guid definida dentro del espacio de nombres local,e ignorará completamente la directiva using-alias definida fuera del espacio de nombres.Esto,desafortunadamente,no es obvio cuando se lee el código.
ja: このコードでは、Guid という System.Guid 型のエイリアスを作成し、一致するコンストラクタ・インタフェースを持つ Guid という独自の型を作成します。その後、コードは Guid 型のインスタンスを作成します。このインスタンスを作成するには、コンパイラは Guid の 2 つの異なる定義から選択する必要があります。using-alias ディレクティブが名前空間要素の外側に配置されている場合、コンパイラはローカルの名前空間内で定義された Guid のローカル定義を選択し、名前空間外で定義された using-alias ディレクティブを完全に無視します。これは、残念ながら、コードを読んでも明らかではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 코드는 Guid라는 System.Guid 형식에 대한 별칭을 만들고 일치하는 생성자 인터페이스를 사용하여 Guid라는 자체 형식을 만듭니다. 나중에이 코드는 Guid 유형의 인스턴스를 만듭니다. 이 인스턴스를 만들려면 컴파일러가 Guid의 두 가지 다른 정의 중에서 선택해야합니다. using-alias 지시문이 namespace 요소 외부에 배치되면 컴파일러는 로컬 네임 스페이스 내에 정의 된 Guid의 로컬 정의를 선택하고 네임 스페이스 외부에 정의 된 using-alias 지시문을 완전히 무시합니다. 불행히도 이것은 코드를 읽을 때 분명하지 않습니다.</font></font>
ru: Код создает псевдоним для типа System.Guid,который называется Guid,а также создает свой собственный тип Guid с соответствующим интерфейсом конструктора.Позже код создает экземпляр типа Guid.Для создания этого экземпляра компилятор должен выбрать одно из двух различных определений типа Guid.Когда директива using-alias находится вне элемента пространства имен,компилятор выберет локальное определение Guid,определенное внутри локального пространства имен,и полностью проигнорирует директиву using-alias,определенную вне пространства имен.Это,к сожалению,не очевидно при чтении кода.
zh_cn: 这段代码创建了一个System.Guid类型的别名,叫做Guid,同时也创建了自己的类型Guid,并有一个匹配的构造函数接口。之后,代码创建了一个 Guid 类型的实例。为了创建这个实例,编译器必须在Guid的两个不同定义中选择。当使用-alias指令放在命名空间元素之外时,编译器会选择在本地命名空间内定义的Guid的本地定义,而完全忽略在命名空间之外定义的使用-alias指令。不幸的是,这一点在阅读代码时并不明显。

source: The code fails on the following compiler error, found on the line containing <code>Guid g = new Guid("hello");</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El c&oacute;digo falla en el siguiente error del compilador, que se encuentra en la l&iacute;nea que contiene </font></font> <code>Guid g = new Guid("hello");</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードは、</font> <code>Guid g = new Guid("hello");</code> <font style="vertical-align: inherit;">を含む行にある次のコンパイラエラーで失敗し</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"> <code>Guid g = new Guid("hello");</code> <font style="vertical-align: inherit;"> 포함하는 줄에있는 다음 컴파일러 오류로 인해 코드가 실패합니다 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сбой кода при следующей ошибке компилятора, найденной в строке, содержащей </font></font> <code>Guid g = new Guid("hello");</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码在包含</font> <code>Guid g = new Guid("hello");</code> <font style="vertical-align: inherit;">的行中发现以下编译器错误时失败</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The compiler searches <code>Outer</code> before looking at those <code>using</code> directives outside the namespace, so it finds <code>Outer.Math</code> instead of <code>System.Math</code>. Unfortunately (or perhaps fortunately?), <code>Outer.Math</code> has no <code>PI</code> member, so File1 is now broken.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El compilador busca </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> antes de mirar a aquellos que </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directivas fuera del espacio de nombres, por lo que encuentra </font></font> <code>Outer.Math</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>System.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Desafortunadamente (&iquest;o quiz&aacute;s afortunadamente?), </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no tiene un </font><font style="vertical-align: inherit;">miembro </font></font> <code>PI</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , por lo que File1 ahora est&aacute; roto.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コンパイラーは</font><font style="vertical-align: inherit;">、名前空間外のディレクティブ</font> <code>using</code> <font style="vertical-align: inherit;">するもの</font><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">調べる前に</font></font> <code>Outer</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">検索する</font><font style="vertical-align: inherit;">ため</font><font style="vertical-align: inherit;">、</font> <code>System.Math</code> <font style="vertical-align: inherit;">ではなく</font> <code>Outer.Math</code> <font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">見つけ</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">残念ながら（または幸運なことに？）、</font> <code>Outer.Math</code> <font style="vertical-align: inherit;">には</font> <code>PI</code> <font style="vertical-align: inherit;">メンバー</font><font style="vertical-align: inherit;">がない</font><font style="vertical-align: inherit;">ため、File1は壊れています。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">컴파일러 </font><font style="vertical-align: inherit;">는 네임 스페이스 외부에서 지시문을 </font> <code>using</code> <font style="vertical-align: inherit;"> 명령을 </font><font style="vertical-align: inherit;">보기 전에 </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">검색 </font><font style="vertical-align: inherit;">하므로 </font> <code>System.Math</code> <font style="vertical-align: inherit;"> 대신 </font> <code>Outer.Math</code> <font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">찾습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">불행하게도 (또는 아마도 운 좋게도) </font> <code>Outer.Math</code> <font style="vertical-align: inherit;"> 에는 </font> <code>PI</code> <font style="vertical-align: inherit;"> 멤버가 없으므로 File1이 손상되었습니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Компилятор ищет </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> перед тем, как смотреть на тех, кто </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> директивы вне пространства имен, поэтому он находит </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>System.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">К сожалению (или, возможно, к счастью?), </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не имеет </font><font style="vertical-align: inherit;">члена </font></font> <code>PI</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому File1 теперь не работает.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">编译器先搜索</font></font> <code>Outer</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后再</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命名空间之外的指令</font><font style="vertical-align: inherit;">查看它们</font><font style="vertical-align: inherit;">，因此它将找到</font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>System.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">不幸的是（或者幸运的是？），</font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有</font></font> <code>PI</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">成员，因此</font><font style="vertical-align: inherit;">File1</font><font style="vertical-align: inherit;">现在已损坏。</font></font>

source: The following code, however, would not result in any violations of this rule:
es: Sin embargo,el siguiente código no resultaría en ninguna violación de esta regla:
ja: ただし、以下のコードを使用しても、このルールに違反することはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 다음 코드는이 규칙을 위반하지 않습니다.</font></font>
ru: Однако приводимый ниже код не приведет к каким-либо нарушениям этого правила:
zh_cn: 然而,下列守则不会导致任何违反本条规则的行为:

source: The following example works because the types <code>Foo</code> and <code>Bar</code> are both in the same global namespace, <code>Outer</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El siguiente ejemplo funciona porque los tipos </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute;n ambos en el mismo espacio de nombres global, </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次の例は、</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">型</font><font style="vertical-align: inherit;">と</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">型の</font><font style="vertical-align: inherit;">両方が同じグローバル名前空間</font></font> <code>Outer</code> にあるため機能し<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음 예제는 </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유형 </font><font style="vertical-align: inherit;">이 모두 동일한 글로벌 네임 스페이스 </font></font> <code>Outer</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 있기 때문에 작동합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Следующий пример работает, потому что типы </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> находятся в одном глобальном пространстве имен </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">下面的示例起作用，因为类型</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>Bar</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">都在同一个全局名称空间</font></font> <code>Outer</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: The other convention:
es: La otra convención:
ja: 他の大会。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 컨벤션 :</font></font>
ru: Другая конвенция:
zh_cn: 另一个惯例。
