Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you wanted to, you could put <code>using</code> directives on all of these levels. (Of course, we want to have <code>using</code>s in only one place, but it would be legal according to the language.)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si quisieras, puedes </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directivas en todos estos niveles. </font><font style="vertical-align: inherit;">(Por supuesto, queremos </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s en un solo lugar, pero ser&iacute;a legal seg&uacute;n el idioma).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">必要に</font><font style="vertical-align: inherit;">応じて、これらすべてのレベル</font><font style="vertical-align: inherit;">に</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクティブを</font><font style="vertical-align: inherit;">配置でき</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">（もちろん、</font><font style="vertical-align: inherit;">1か所だけでs </font><font style="vertical-align: inherit;">を</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">する必要</font><font style="vertical-align: inherit;">がありますが、言語によっては合法です。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원하는 경우 </font><font style="vertical-align: inherit;">이러한 모든 수준에서 지시문을 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 수 </font><font style="vertical-align: inherit;">있습니다. </font><font style="vertical-align: inherit;">(물론, 우리는 </font><font style="vertical-align: inherit;">한 곳에서만 s를 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하고 싶지만 </font><font style="vertical-align: inherit;">언어에 따라 합법적입니다.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы хотите, вы можете </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> директивы на всех этих уровнях. </font><font style="vertical-align: inherit;">(Конечно, мы хотим </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s только в одном месте, но это будет законно в зависимости от языка.)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果愿意，可以</font><font style="vertical-align: inherit;">在所有这些级别上</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令。</font><font style="vertical-align: inherit;">（当然，我们只想</font><font style="vertical-align: inherit;">在一个地方</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> s，但是根据语言，这是合法的。）</font></font>

source: In the above case, to find out what type <code>Ambiguous</code> is, the search goes in this order:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso anterior, para averiguar qu&eacute; tipo de </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es, la b&uacute;squeda va en este orden:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">上記の場合、</font></font> <code>Ambiguous</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプを見つけるため</font><font style="vertical-align: inherit;">に、検索は次の順序で行われます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위의 경우 </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font><font style="vertical-align: inherit;">어떤 유형인지 확인 </font><font style="vertical-align: inherit;">하려면 다음 순서로 검색하십시오.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В приведенном выше случае, чтобы выяснить, что такое тип </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поиск выполняется в следующем порядке:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在上述情况下，要找出</font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">类型</font><font style="vertical-align: inherit;">是</font><font style="vertical-align: inherit;">什么</font><font style="vertical-align: inherit;">，搜索按以下顺序进行：</font></font>

source: Is there a technical reason for putting the <code>using</code> directives inside instead of outside the namespace?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Hay alguna raz&oacute;n t&eacute;cnica para poner las </font><font style="vertical-align: inherit;">directivas de </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro en lugar de fuera del espacio de nombres?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前空間の外部ではなく内部に</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクティブ</font><font style="vertical-align: inherit;">を配置する技術的な理由はあり</font><font style="vertical-align: inherit;">ますか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 외부가 아닌 내부에 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지시문 </font><font style="vertical-align: inherit;">을 넣는 기술적 이유가 </font><font style="vertical-align: inherit;">있습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть ли техническая причина для размещения </font><font style="vertical-align: inherit;">директив </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри, а не вне пространства имен?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是否有技术上的理由将</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令放在名称空间的内部而不是外部？</font></font>

source: It is a better practice if those <strong>default</strong> using i.e. "<em>references</em>" used in your source solution should be outside the namespaces and those that are <strong>"new added reference"</strong> is a good practice is you should put it inside the namespace. This is to distinguish what references are being added.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es una mejor pr&aacute;ctica si los que </font><font style="vertical-align: inherit;">usan por </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">defecto,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es decir, las " </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">referencias</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> " utilizadas en su soluci&oacute;n de origen deben estar fuera de los espacios de nombres y aquellos que son </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"nueva referencia agregada"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es una buena pr&aacute;ctica si debe ponerla dentro del espacio de nombres. </font><font style="vertical-align: inherit;">Esto es para distinguir qu&eacute; referencias se est&aacute;n agregando.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソースソリューションで使用される</font><font style="vertical-align: inherit;">「</font><em><font style="vertical-align: inherit;">参照</font></em><font style="vertical-align: inherit;">」を使用</font><font style="vertical-align: inherit;">する</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デフォルト</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が名前空間の外にあり、</font><strong><font style="vertical-align: inherit;">「新しく追加された参照」</font></strong><font style="vertical-align: inherit;">であるものを名前空間内に置くことをお勧めします。</font><font style="vertical-align: inherit;">これは、追加されている参照を区別するためです。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소스 솔루션에 사용 된 </font><font style="vertical-align: inherit;">" </font><em><font style="vertical-align: inherit;">reference</font></em><font style="vertical-align: inherit;"> "를 사용 </font><font style="vertical-align: inherit;">하는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기본값</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이 네임 스페이스 외부에 있어야하고 </font><strong><font style="vertical-align: inherit;">"새로 추가 된 참조"인</font></strong><font style="vertical-align: inherit;"> 것이 네임 스페이스 안에 넣어야하는 것이 좋습니다. </font><font style="vertical-align: inherit;">이것은 어떤 참조가 추가되고 있는지 구별하기위한 것입니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><strong><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Лучше всего, если те, которые по </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">умолчанию</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используют, например, &laquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ссылки</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;, используемые в исходном решении, должны находиться за пределами пространств имен, а те, которые являются </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&laquo;новой добавленной ссылкой&raquo;,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это хорошая практика, если вы должны поместить его в пространство имен. </font><font style="vertical-align: inherit;">Это должно отличить, какие ссылки добавляются.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果</font><font style="vertical-align: inherit;">在源解决方案中使用</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">默认值（</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">即&ldquo; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;）的</font><strong><font style="vertical-align: inherit;">默认值</font></strong><font style="vertical-align: inherit;">应该在命名空间之外，而那些</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&ldquo;新添加引用&rdquo;的</font></font></strong><font style="vertical-align: inherit;"><strong><font style="vertical-align: inherit;">默认值</font></strong><font style="vertical-align: inherit;">应该</font><font style="vertical-align: inherit;">是一个好习惯，则应将其放在命名空间中。</font><font style="vertical-align: inherit;">这是为了区分正在添加哪些引用。</font></font>

source: It is always dangerous to move the usings from one location to another because the search hierarchy changes, and another type may be found. Therefore, choose one convention and stick to it, so that you won't have to ever move usings.
es: Siempre es peligroso mover los usos de un lugar a otro porque la jerarquía de búsqueda cambia,y se puede encontrar otro tipo.Por lo tanto,elija una convención y aténgase a ella,para no tener que mover nunca los usos.
ja: 検索階層が変わり、別のタイプが見つかる可能性があるため、ある場所から別の場所へと用途を移動させるのは常に危険です。そのため、一つの規約を選択し、それに固執することで、使用場所を移動する必要がなくなります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">검색 계층 구조가 변경되고 다른 유형이있을 수 있으므로 사용을 한 위치에서 다른 위치로 이동하는 것은 항상 위험합니다. </font><font style="vertical-align: inherit;">따라서 하나의 규칙을 선택하고 준수하여 사용을 이동할 필요가 없습니다.</font></font>
ru: Всегда опасно перемещать использование из одного места в другое,потому что иерархия поиска меняется,и может быть найден другой тип.Поэтому выбирайте одно соглашение и придерживайтесь его,чтобы вам никогда не приходилось перемещать использования.
zh_cn: 从一个地方转移到另一个地方,总是很危险的,因为搜索的层次会发生变化,可能会发现另一种类型。因此,选择一个惯例,并坚持下去,这样你就不会再去搬动usings了。

source: It is important to note that when code has been written with using directives placed outside of the namespace, care should be taken when moving these directives within the namespace, to ensure that this is not changing the semantics of the code. As explained above, placing using-alias directives within the namespace element allows the compiler to choose between conflicting types in ways that will not happen when the directives are placed outside of the namespace.
es: Es importante señalar que cuando se ha escrito código con directivas de uso colocadas fuera del espacio de nombres,se debe tener cuidado al trasladar esas directivas dentro del espacio de nombres,para asegurarse de que esto no cambie la semántica del código.Como se ha explicado anteriormente,la colocación de directivas de uso dentro del elemento del espacio de nombres permite al compilador elegir entre tipos conflictivos de manera que no se produzca cuando las directivas se coloquen fuera del espacio de nombres.
ja: ネームスペースの外側に配置された using-alias ディレクティブを使用してコードが書かれている場合、コードのセマンティクスを変更しないように、これらのディレクティブをネームスペース内に移動させる際には注意が必要であることに注意してください。上で説明したように、using-alias ディレクティブをネームスペース要素内に配置することで、 コンパイラは競合するタイプを選択することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 외부에있는 지시문을 사용하여 코드를 작성한 경우 네임 스페이스 내에서 이러한 지시문을 이동할 때 코드의 의미가 변경되지 않도록주의해야합니다. </font><font style="vertical-align: inherit;">위에서 설명한 바와 같이, 네임 스페이스 요소 내에 using-alias 지시문을 배치하면 컴파일러가 지시문이 네임 스페이스 외부에 배치 될 때 발생하지 않는 방식으로 충돌하는 유형 중에서 선택할 수 있습니다.</font></font>
ru: Важно отметить,что при написании кода с использованием директив,размещенных за пределами пространства имен,следует проявлять осторожность при перемещении этих директив внутри пространства имен,чтобы это не меняло семантику кода.Как объяснялось выше,размещение директив using-alias внутри элемента пространства имен позволяет компилятору выбирать между конфликтующими типами так,как это не произойдет при размещении директив вне пространства имен.
zh_cn: 需要注意的是,当编写的代码中使用了放置在命名空间之外的使用指令时,在将这些指令移动到命名空间内时要注意,以确保不会改变代码的语义。如上文所述,将使用-alias指令放在命名空间元素中,可以让编译器在冲突类型之间进行选择,而当指令放在命名空间之外时,就不会出现这种情况。

source: It's also interesting to note what happens if <code>Foo</code> is in namespace <code>Outer</code>, rather than <code>Outer.Inner</code>. In that case, adding <code>Outer.Math</code> in File2 breaks File1 regardless of where the <code>using</code> goes. This implies that the compiler searches the innermost enclosing namespace before it looks at any <code>using</code> directive.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n es interesante observar lo que sucede si </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; en el espacio de nombres </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , en lugar de </font></font> <code>Outer.Inner</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En ese caso, al agregar </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en File2 se rompe File1 independientemente de d&oacute;nde </font><font style="vertical-align: inherit;">vaya </font><font style="vertical-align: inherit;">el </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Esto implica que el compilador busca en el espacio de nombres que encierra el interior antes de ver cualquier </font><font style="vertical-align: inherit;">directiva de </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が</font> <code>Outer.Inner</code> <font style="vertical-align: inherit;">ではなく</font><font style="vertical-align: inherit;">、名前空間</font></font> <code>Outer</code> にある<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">場合に何が起こるかを知ることも興味深い</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">その場合、</font><font style="vertical-align: inherit;">File2に</font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">追加すると</font><font style="vertical-align: inherit;">、</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関係なくFile1が壊れます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">これは、コンパイラが</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクティブを</font><font style="vertical-align: inherit;">調べる前に、最も内側にある名前空間を検索することを意味します</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font> <code>Outer.Inner</code> 가<font style="vertical-align: inherit;"> 아닌 </font><font style="vertical-align: inherit;">네임 스페이스 </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 </font><font style="vertical-align: inherit;">있으면 어떻게되는지 주목하는 것도 흥미 </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">롭습니다</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">이 경우 </font><font style="vertical-align: inherit;">File2에 </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">하면 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 위치에 관계없이 File1이 중단 </font><font style="vertical-align: inherit;">됩니다. </font><font style="vertical-align: inherit;">이는 컴파일러가 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지시문을 </font><font style="vertical-align: inherit;">보기 전에 가장 안쪽의 네임 스페이스를 검색 함을 의미합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также интересно отметить, что происходит, если </font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> находится в пространстве имен </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , а не </font></font> <code>Outer.Inner</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В этом случае добавление </font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в File2 нарушает File1 независимо от того, куда </font><font style="vertical-align: inherit;">идет </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это подразумевает, что компилятор ищет самое внутреннее пространство имен, прежде чем он смотрит на любую </font><font style="vertical-align: inherit;">директиву </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有趣的</font><font style="vertical-align: inherit;">是，</font><font style="vertical-align: inherit;">如果</font></font> <code>Foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在命名空间</font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>Outer.Inner</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font><font style="vertical-align: inherit;">会发生什么</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在这种情况下，</font><font style="vertical-align: inherit;">无论</font> <code>using</code> <font style="vertical-align: inherit;">在</font><font style="vertical-align: inherit;">哪里，在</font></font> <code>Outer.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">中</font><font style="vertical-align: inherit;">添加</font><font style="vertical-align: inherit;">Outer.Math都会</font><font style="vertical-align: inherit;">破坏</font><font style="vertical-align: inherit;">File1</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">这意味着编译器在查看任何</font> <code>using</code> <font style="vertical-align: inherit;">指令</font><font style="vertical-align: inherit;">之前先搜索最内层的命名空间</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Multiple Namespaces
es: Múltiples espacios de nombres
ja: 複数の名前空間
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 네임 스페이스</font></font>
ru: Множественные пространства имен
zh_cn: 多名称空间

source: My preference is to put them outside of namespaces.
es: Mi preferencia es ponerlos fuera de los espacios para nombres.
ja: 私の好みは、名前空間の外に置くことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">선호하는 것은 네임 스페이스 외부에 배치하는 것입니다.</font></font>
ru: Я предпочитаю выставлять их за пределами именных пространств.
zh_cn: 我的偏好是把它们放在命名空间之外。
