Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Note that <code>MyCorp.TheProduct</code> was a part of "3." and was therefore not needed between "4." and "5.".)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Tenga en cuenta que </font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> era parte de "3." y, por lo tanto, no era necesario entre "4." y "5.").</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（</font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は「3.」の一部であったため、「4。」と「5.」の間に必要ではなかった</font><font style="vertical-align: inherit;">ことに注意してください</font><font style="vertical-align: inherit;">。）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(참고 것을 </font></font> <code>MyCorp.TheProduct</code> 는<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "3"의 일부이고, 따라서 "4"및 "5"사이에 필요하지 않았다.)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(Обратите внимание, что </font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> был частью &laquo;3&raquo; и поэтому не был необходим между &laquo;4&raquo; и &laquo;5&raquo;.)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（请注意，</font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是&ldquo; 3.&rdquo;的一部分，因此在&ldquo; 4.&rdquo;和&ldquo; 5.&rdquo;之间不需要。）</font></font>

source: <code>using</code> directives specified inside namespaces can make for shorter code since they don't need to be fully qualified as when they're specified on the outside.
es: <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directivas especificadas dentro de los espacios de nombres puede hacer que el c&oacute;digo sea m&aacute;s corto ya que no necesitan estar completamente calificados como cuando se especifican en el exterior.</font></font>
ja: <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前空間の内部で指定されたディレクティブ</font><font style="vertical-align: inherit;">を使用</font><font style="vertical-align: inherit;">すると、外部で指定されている場合のように完全修飾する必要がないため、コードを短くすることができます。</font></font>
ko: <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 내에 지정된 지시문을 </font><font style="vertical-align: inherit;">사용하면</font><font style="vertical-align: inherit;"> 코드가 외부에 지정된 것처럼 정규화 될 필요가 없으므로 코드가 더 짧아 질 수 있습니다.</font></font>
ru: <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> директив, указанных внутри пространств имен, может привести к сокращению кода, поскольку они не должны быть полностью квалифицированными, как если бы они были указаны снаружи.</font></font>
zh_cn: <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在名称空间中指定的指令可以缩短代码长度，因为它们不需要像在外部指定时一样完全合格。</font></font>

source: <strong>(1) With usings outside:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1) Con usos fuera:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（1）外部での使用：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1) 외부 사용시 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(1) с использованием снаружи:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（1）外部使用：</font></font></strong>

source: <strong>(2) With usings inside:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2) Con usos dentro:</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2）内部での使用：</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2) 내부 사용시 :</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(2) с использованием внутри:</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">（2）内部使用：</font></font></strong>

source: <strong>Concluding remarks</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Observaciones finales</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">おわりに</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">끝 맺는 말</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Заключительные замечания</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">结束语</font></font></strong>

source: According the to StyleCop Documentation:
es: Según la documentación de StyleCop:
ja: StyleCopのドキュメントによると
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop 설명서에 따르면 :</font></font>
ru: Согласно документации StyleCop:
zh_cn: 根据StyleCop文档的规定。

source: According to <a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx">Hanselman - Using Directive and Assembly Loading...</a> and other such articles there is technically no difference.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De acuerdo con </font></font><a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hanselman - Uso de la directiva y carga de ensamblajes ...</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y otros art&iacute;culos similares t&eacute;cnicamente no hay diferencia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">よると</font></font><a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hanselman氏-指令および集合体Loading ...使用</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">し、他のこのような製品は、技術的に違いはありません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">에 따르면 </font></font><a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hanselman은 - 지침 및 조립로드 ... 사용</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 기타 제품은 기술적으로 차이가 없다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Согласно </font></font><a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hanselman - Использование директивы и сборки Загрузка ...</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и другие подобные статьи, технически нет никакой разницы.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">根据</font></font><a href="http://www.hanselman.com/blog/BackToBasicsDoNamespaceUsingDirectivesAffectAssemblyLoading.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hanselman-使用指令和程序集加载...</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以及其他此类文章，技术上没有区别。</font></font>

source: Also, if a nested namespace has the same name as a type, it can cause problems.
es: Además,si un espacio de nombres anidado tiene el mismo nombre que un tipo,puede causar problemas.
ja: また、入れ子になっている名前空間が型と同じ名前の場合、問題が発生することがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 중첩 네임 스페이스가 유형과 이름이 같은 경우 문제가 발생할 수 있습니다.</font></font>
ru: Кроме того,если вложенное пространство имен имеет то же имя,что и тип,это может вызвать проблемы.
zh_cn: 另外,如果一个嵌套的命名空间和一个类型有相同的名字,也会引起问题。

source: And <em>Bar.cs</em>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bar.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そして</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bar.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bar.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bar.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bar.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Another subtlety that I don't believe has been covered by the other answers is for when you have a class and namespace with the same name.
es: Otra sutileza que no creo que haya sido cubierta por las otras respuestas es para cuando tienes una clase y un espacio de nombre con el mismo nombre.
ja: 他の回答ではカバーされていないと思われるもう一つの微妙な点は、クラスと名前空間が同じ名前の場合です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 믿지 않는 또 다른 미묘한 점은 같은 이름의 클래스와 네임 스페이스가있을 때입니다.</font></font>
ru: Еще одна тонкость,которая,как мне кажется,не была охвачена другими ответами,это для тех случаев,когда у вас есть класс и пространство имён с тем же именем.
zh_cn: 另一个微妙的地方,我不相信其他答案已经涉及到了,那就是当你有一个同名的类和命名空间时。

source: As Jeppe Stig Nielsen <a href="https://stackoverflow.com/a/16092975/2707705">said</a>, this thread already has great answers, but I thought this rather obvious subtlety was worth mentioning too.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como </font></font><a href="https://stackoverflow.com/a/16092975/2707705"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dijo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Jeppe Stig Nielsen </font><font style="vertical-align: inherit;">, este hilo ya tiene excelentes respuestas, pero tambi&eacute;n pens&eacute; que val&iacute;a la pena mencionar esta sutileza bastante obvia.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jeppe Stig Nielsenが</font></font><a href="https://stackoverflow.com/a/16092975/2707705"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">言ったように</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、このスレッドにはすでにすばらしい答えがありますが、このかなり明白な微妙さについても言及する価値があると思いました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Jeppe Stig Nielsen이 </font></font><a href="https://stackoverflow.com/a/16092975/2707705"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">말했듯</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이이 스레드에는 이미 큰 대답이 있지만이 명백한 미묘함도 언급 할 가치가 있다고 생각했습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как </font></font><a href="https://stackoverflow.com/a/16092975/2707705"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сказал</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Джепп Стиг Нильсен </font><font style="vertical-align: inherit;">, в этой теме уже есть отличные ответы, но я подумал, что эту довольно очевидную тонкость тоже стоит упомянуть.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正如Jeppe Stig Nielsen </font></font><a href="https://stackoverflow.com/a/16092975/2707705"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">所说</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，该线程已经有了不错的答案，但是我认为这种明显的微妙之处也值得一提。</font></font>

source: CS0576: Namespace 'Microsoft.Sample' contains a definition conflicting with alias 'Guid'
es: CS0576:El espacio de nombres 'Microsoft.Sample' contiene una definición que entra en conflicto con el alias 'Guid'.
ja: CS0576.名前空間 'Microsoft.Sample' にエイリアス 'Guid' と矛盾する定義が含まれている
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CS0576 : 네임 스페이스 'Microsoft.Sample'에 별칭 'Guid'와 충돌하는 정의가 포함되어 있습니다.</font></font>
ru: CS0576:Пространство имен 'Microsoft.Sample' содержит определение,противоречащее псевдониму 'Guid'.
zh_cn: CS0576:命名空间'Microsoft.Sample'包含一个与别名'Guid'冲突的定义

source: Cause A C# using directive is placed outside of a namespace element.
es: Porque una directiva que usa C#se coloca fuera de un elemento del espacio de nombres.
ja: 原因 C#のusingディレクティブが名前空間要素の外側に配置されている。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">원인 AC # using 지시문이 네임 스페이스 요소 외부에 배치되었습니다.</font></font>
ru: Причина,по которой директива использования C#размещается вне элемента пространства имен.
zh_cn: 原因 一个C#使用指令被放置在命名空间元素之外。

source: First, remember that a namespace declaration with periods, like:
es: Primero,recuerde que una declaración de espacio de nombre con puntos,como:
ja: まず、ピリオド付きの名前空間宣言は、ピリオドのようなものだと覚えておきましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 마침표가있는 네임 스페이스 선언은 다음과 같습니다.</font></font>
ru: Во-первых,помните,что объявление пространства имён с периодами,например:
zh_cn: 首先,记住,命名空间声明中的句号,如。

source: For example, the following code would result in two violations of this rule.
es: Por ejemplo,el siguiente código resultaría en dos violaciones de esta regla.
ja: 例えば、以下のコードの場合、このルールに2回違反することになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어 다음 코드는이 규칙을 두 번 위반합니다.</font></font>
ru: Например,следующий код приведет к двум нарушениям этого правила.
zh_cn: 例如,以下代码将导致两次违反本规则:

source: How to Fix Violations To fix a violation of this rule, move all using directives and using-alias directives within the namespace element.
es: Cómo arreglar las violaciones Para arreglar una violación de esta regla,mueva todas las directivas de uso y las directivas de uso dentro del elemento del espacio de nombres.
ja: 違反を修正する方法 このルールの違反を修正するには、すべての using ディレクティブと using-alias ディレクティブを名前空間要素内に移動します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">위반을 수정하는 방법이 규칙의 위반을 수정하려면 네임 스페이스 요소 내에서 using using 지시문과 using-alias 지시문을 모두 이동하십시오.</font></font>
ru: Как исправить нарушения Чтобы исправить нарушение этого правила,переместите все директивы использования и директивы использования в элемент пространства имен.
zh_cn: 如何修复违反规则 要修复违反此规则,请将所有使用指令和使用-alias指令移动到命名空间元素中。

source: However if you use it <em>inside</em> of that namespace declaration, it refers to the second one (Parent.Something.Other)!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, si lo usa </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dentro</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de esa declaraci&oacute;n de espacio de nombres, &iexcl;se refiere a la segunda (Parent.Something.Other)!</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ただし</font><font style="vertical-align: inherit;">、その名前空間宣言</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font><font style="vertical-align: inherit;">使用すると</font><font style="vertical-align: inherit;">、2番目の名前（Parent.Something.Other）が参照されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 </font><font style="vertical-align: inherit;">네임 스페이스 선언 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 </font><font style="vertical-align: inherit;">사용 </font><font style="vertical-align: inherit;">하면 두 번째 네임 스페이스 선언 (Parent.Something.Other)을 나타냅니다!</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Однако, если вы используете его </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">внутри</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> этого объявления пространства имен, оно ссылается на второе (Parent.Something.Other)!</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">但是，如果</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">该名称空间声明中</font><font style="vertical-align: inherit;">使用它</font><font style="vertical-align: inherit;">，它将引用第二个（Parent.Something.Other）！</font></font>

source: I have been running <a href="http://en.wikipedia.org/wiki/StyleCop">StyleCop</a> over some C# code, and it keeps reporting that my <code>using</code> directives should be inside the namespace.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He estado ejecutando </font></font><a href="http://en.wikipedia.org/wiki/StyleCop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> sobre alg&uacute;n c&oacute;digo C #, y sigue informando que mis </font><font style="vertical-align: inherit;">directivas de </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> deben estar dentro del espacio de nombres.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">私は</font><font style="vertical-align: inherit;">いくつかのC＃コードで</font></font><a href="http://en.wikipedia.org/wiki/StyleCop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">実行してい</font><font style="vertical-align: inherit;">て、</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ディレクティブは名前空間内にあるべきだと</font><font style="vertical-align: inherit;">報告し続け</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C # 코드를 통해 </font></font><a href="http://en.wikipedia.org/wiki/StyleCop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><font style="vertical-align: inherit;">실행 </font><font style="vertical-align: inherit;">하고 있으며 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 지시문이 네임 스페이스 안에 있어야한다고 </font><font style="vertical-align: inherit;">보고합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я запускал </font></font><a href="http://en.wikipedia.org/wiki/StyleCop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> над некоторым кодом C #, и он продолжает сообщать, что мои </font><font style="vertical-align: inherit;">директивы </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должны находиться внутри пространства имен.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我一直在</font><font style="vertical-align: inherit;">通过某些C＃代码</font><font style="vertical-align: inherit;">运行</font></font><a href="http://en.wikipedia.org/wiki/StyleCop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">StyleCop</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并且一直在报告我的</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令应该在名称空间内。</font></font>
