Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Types in <code>System</code>, <code>System.Collections.Generic</code>, <code>System.Linq</code>, <code>MyCorp.TheProduct.OtherModule</code>, <code>MyCorp.TheProduct.OtherModule.Integration</code>, and <code>ThirdParty</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>ThirdParty</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内の型</font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>System.Linq</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>ThirdParty</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 종류 </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>ThirdParty</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ThirdParty</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在类型</font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>System.Linq</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ThirdParty</code>

source: Types in <code>System</code>, <code>System.Collections.Generic</code>, <code>System.Linq</code>, <code>MyCorp.TheProduct</code>, <code>MyCorp.TheProduct.OtherModule</code>, <code>MyCorp.TheProduct.OtherModule.Integration</code>, and <code>ThirdParty</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>ThirdParty</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内の型</font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>System.Linq</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、および</font></font> <code>ThirdParty</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 종류 </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>ThirdParty</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>System.Linq</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>ThirdParty</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在类型</font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>System.Collections.Generic</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>System.Linq</code> 的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>MyCorp.TheProduct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>MyCorp.TheProduct.OtherModule</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>MyCorp.TheProduct.OtherModule.Integration</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>ThirdParty</code>

source: Types in namespace <code>MyCorp.TheProduct.SomeModule</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en el espacio de nombres </font></font> <code>MyCorp.TheProduct.SomeModule</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前空間のタイプ</font></font> <code>MyCorp.TheProduct.SomeModule</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 </font> <code>MyCorp.TheProduct.SomeModule</code> 의<font style="vertical-align: inherit;"> 유형</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в пространстве имен </font></font> <code>MyCorp.TheProduct.SomeModule</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命名空间</font> <code>MyCorp.TheProduct.SomeModule</code> 中的<font style="vertical-align: inherit;">类型</font></font><font style="vertical-align: inherit;"></font>

source: Types in the <em>null</em> namespace (the global namespace)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en el </font><font style="vertical-align: inherit;">espacio de nombres </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">nulo</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (el espacio de nombres global)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">でタイプ</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ヌル</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前空間（グローバル名前空間）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">의 유형 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">널</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 네임 스페이스 (전역 네임 스페이스)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">пустом</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пространстве имен (глобальное пространство имен)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">输入</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">空</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名称空间（全局名称空间）</font></font>

source: Types in the current namespace <code>MyCorp.TheProduct.SomeModule.Utilities</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en el espacio de nombres actual </font></font> <code>MyCorp.TheProduct.SomeModule.Utilities</code>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">現在の名前空間のタイプ</font></font> <code>MyCorp.TheProduct.SomeModule.Utilities</code>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 네임 스페이스 </font> <code>MyCorp.TheProduct.SomeModule.Utilities</code> 의<font style="vertical-align: inherit;"> 유형</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в текущем пространстве имен </font></font> <code>MyCorp.TheProduct.SomeModule.Utilities</code>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在当前名称空间</font></font> <code>MyCorp.TheProduct.SomeModule.Utilities</code> 中键入

source: Visual Studio's templates, by default, put the usings <em>outside</em> of the namespace (for example if you make VS generate a new class in a new file).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las plantillas de Visual Studio, de forma predeterminada, colocan los usos </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fuera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del espacio de nombres (por ejemplo, si hace que VS genere una nueva clase en un nuevo archivo).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual Studioのテンプレートは、デフォルト</font><font style="vertical-align: inherit;">で、名前空間の</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に</font><font style="vertical-align: inherit;">使用</font><em><font style="vertical-align: inherit;">法</font></em><font style="vertical-align: inherit;">を配置します（たとえば、VSに新しいファイルで新しいクラスを生成させる場合）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Visual Studio의 템플릿은 기본적으로 용도를 </font><font style="vertical-align: inherit;">네임 스페이스 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에 배치합니다 (예 : VS가 새 파일에서 새 클래스를 생성하도록하는 경우).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Шаблоны Visual Studio по умолчанию помещают значения </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">за</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> пределы пространства имен (например, если вы заставляете VS генерировать новый класс в новом файле).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">默认情况下，Visual Studio的模板将使用方法</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">放在</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命名空间</font><em><font style="vertical-align: inherit;">之外</font></em><font style="vertical-align: inherit;">（例如，如果让VS在新文件中生成新类）。</font></font>

source: When the using-alias directive is positioned within the namespace, however, the compiler has to choose between two different, conflicting Guid types both defined within the same namespace. Both of these types provide a matching constructor. The compiler is unable to make a decision, so it flags the compiler error.
es: Sin embargo,cuando la directiva de uso se coloca dentro del espacio de nombres,el compilador tiene que elegir entre dos tipos de guía diferentes y conflictivos,ambos definidos dentro del mismo espacio de nombres.Ambos tipos proporcionan un constructor coincidente.El compilador no puede tomar una decisión,así que marca el error del compilador.
ja: しかし、using-alias ディレクティブが名前空間内に配置されている場合、コンパイラは同じ名前空間内に定義されている 2 つの異なる、相反する Guid 型のどちらかを選択しなければなりません。これらの型はどちらも一致するコンストラクタを提供します。コンパイラは判断できないので、コンパイラ・エラーを通知します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 using-alias 지시문이 네임 스페이스 내에 있으면 컴파일러는 동일한 네임 스페이스 내에 정의 된 서로 상충되는 두 가지 Guid 유형 중에서 선택해야합니다. </font><font style="vertical-align: inherit;">이 두 유형 모두 일치하는 생성자를 제공합니다. </font><font style="vertical-align: inherit;">컴파일러가 결정을 내릴 수 없으므로 컴파일러 오류를 표시합니다.</font></font>
ru: Однако,когда директива using-alias находится в пространстве имен,компилятор должен выбрать между двумя различными,конфликтующими типами Guid,оба из которых определены в одном и том же пространстве имен.Оба этих типа предоставляют подходящий конструктор.Компилятор не может принять решение,поэтому помечает ошибку компилятора.
zh_cn: 然而,当使用-alias指令被定位在命名空间中时,编译器必须在两个不同的、相互冲突的 Guid 类型中进行选择,这两个类型都定义在同一个命名空间中。这两种类型都提供了一个匹配的构造函数。编译器无法做出决定,所以会标记出编译器错误。

source: When you have the import inside the namespace then it will find the class. If the import is outside the namespace then the import will be ignored and the class and namespace have to be fully qualified.
es: Cuando tengas la importación dentro del espacio de nombres,entonces encontrará la clase.Si la importación está fuera del espacio de nombres entonces la importación será ignorada y la clase y el espacio de nombres tienen que estar completamente calificados.
ja: インポートがネームスペース内にある場合は、クラスを見つけます。インポートがネームスペースの外にある場合、インポートは無視され、クラスとネームスペースは完全に修飾されている必要があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 안에 가져 오기가 있으면 클래스를 찾습니다. </font><font style="vertical-align: inherit;">가져 오기가 네임 스페이스 외부에 있으면 가져 오기가 무시되고 클래스와 네임 스페이스가 정규화되어야합니다.</font></font>
ru: Когда у вас есть импорт внутри пространства имен,тогда он найдет класс.Если импорт находится за пределами пространства имен,то импорт будет проигнорирован и класс и пространство имен должны быть полностью квалифицированы.
zh_cn: 当你的导入在命名空间内,那么它将找到类。如果导入在命名空间之外,那么导入将被忽略,类和命名空间必须完全合格。

source: When you use <code>using Something.Other</code><em>outside</em> of a <code>namespace Parent</code>, it refers to the first one (Something.Other).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando usa el </font></font> <code>using Something.Other</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">fuera</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de un </font></font> <code>namespace Parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">nombres Parent</font><font style="vertical-align: inherit;"> , se refiere al primero (Something.Other).</font></font>
ja: <font style="vertical-align: inherit;"> <code>namespace Parent</code> <em><font style="vertical-align: inherit;">外</font></em><font style="vertical-align: inherit;">で</font></font> <code>using Something.Other</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用する場合</font><font style="vertical-align: inherit;">、最初のもの（Something.Other）を参照します。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>namespace Parent</code> <em><font style="vertical-align: inherit;">외부</font></em><font style="vertical-align: inherit;"> 에서 </font></font> <code>using Something.Other</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용 </font><font style="vertical-align: inherit;">하는</font><font style="vertical-align: inherit;"> 경우 첫 번째 </font><font style="vertical-align: inherit;">네임 스페이스</font><font style="vertical-align: inherit;"> (Something.Other)를 참조합니다.</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">При использовании с </font></font> <code>using Something.Other</code> <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">снаружи</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из в </font></font> <code>namespace Parent</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , это относится к первому (Something.Other).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当您</font><font style="vertical-align: inherit;">在</font> <code>namespace Parent</code> <em><font style="vertical-align: inherit;">之外</font></em></font> <code>using Something.Other</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，它指的是第一个（Something.Other）。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: With <code>using</code> statements inside the namespace, it suddenly becomes:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> declaraciones dentro del espacio de nombres, de repente se convierte en:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名前空間内の文を、それが突然、次のようになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 네임 스페이스 내에서 문을 갑자기된다 :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> заявления в пространстве имен, он вдруг становится:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在</font><font style="vertical-align: inherit;">名称空间中</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句时，它突然变成：</font></font>

source: You can create this config file in solution level and add it to your projects as 'Existing Link File' to share the config across all of your projects too.
es: Puedes crear este archivo de configuración en el nivel de solución y añadirlo a tus proyectos como 'Archivo de enlace existente' para compartir la configuración en todos tus proyectos también.
ja: このコンフィグファイルをソリューションレベルで作成し、「既存のリンクファイル」としてプロジェクトに追加することで、すべてのプロジェクトでコンフィグを共有することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 구성 파일을 솔루션 레벨에서 작성하고 프로젝트에 '기존 링크 파일'로 추가하여 모든 프로젝트에서 구성을 공유 할 수 있습니다.</font></font>
ru: Вы можете создать этот конфигурационный файл на уровне решения и добавить его в свои проекты как 'Existing Link File' (Существующий файл ссылки),чтобы разделить конфигурацию и на все ваши проекты.
zh_cn: 您可以在解决方案级别中创建此配置文件,并将其添加到您的项目中,作为 "现有链接文件 "来共享您所有项目的配置。

source: is entirely equivalent to:
es: es totalmente equivalente a:
ja: と完全に等価です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">완전히 다음과 같습니다.</font></font>
ru: полностью эквивалентна:
zh_cn: 完全等同于:
