Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The rule for resolving which type is implied, can be loosely stated like this: <strong>First search the inner-most "scope" for a match, if nothing is found there go out one level to the next scope and search there, and so on</strong>, until a match is found. If at some level more than one match is found, if one of the types are from the current assembly, pick that one and issue a compiler warning. Otherwise, give up (compile-time error).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La regla para resolver qu&eacute; tipo est&aacute; impl&iacute;cito, se puede expresar de manera holgada de esta manera: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Primero busque una "coincidencia" m&aacute;s interna para una coincidencia, si no se encuentra nada, salga un nivel al siguiente alcance y busque all&iacute;, y as&iacute; sucesivamente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , hasta que se encuentre una coincidencia. </font><font style="vertical-align: inherit;">Si en alg&uacute;n nivel se encuentra m&aacute;s de una coincidencia, si uno de los tipos es del ensamblaje actual, el&iacute;jalo y emita una advertencia de compilaci&oacute;n. </font><font style="vertical-align: inherit;">De lo contrario, renunciar (error en tiempo de compilaci&oacute;n).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">暗黙のタイプを解決するためのルールは、次のように大まかに述べることができます。</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">最初に一致の最も内側の「スコープ」を検索し、そこに何も見つからない場合は、1つのレベルから次のスコープに進み、そこで検索します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。一致が見つかるまで。</font><font style="vertical-align: inherit;">あるレベルで複数の一致が見つかった場合、タイプの1つが現在のアセンブリのものである場合は、そのタイプを選択してコンパイラ警告を発行します。</font><font style="vertical-align: inherit;">それ以外の場合は、あきらめてください（コンパイル時エラー）。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">어떤 유형이 암시되는지 확인하는 규칙은 다음과 같이 느슨하게 설명 할 수 있습니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">먼저 일치하는 가장 안쪽의 "범위"를 검색합니다. 아무것도 발견되지 않으면 다음 범위로 한 레벨 이동하여 검색합니다</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . 일치하는 것을 찾을 때까지. </font><font style="vertical-align: inherit;">어떤 수준에서 두 개 이상의 일치하는 항목이 발견되면 유형 중 하나가 현재 어셈블리에서 온 경우 해당 유형을 선택하고 컴파일러 경고를 발행하십시오. </font><font style="vertical-align: inherit;">그렇지 않으면 포기합니다 (컴파일 타임 오류).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Правило для определения того, какой тип подразумевается, можно условно сформулировать следующим образом: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сначала ищите самую внутреннюю &laquo;область&raquo; для соответствия, если там ничего не найдено, переходите на один уровень к следующей области и ищите там, и так далее</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , пока совпадение не найдено. </font><font style="vertical-align: inherit;">Если на каком-то уровне найдено более одного совпадения, если один из типов относится к текущей сборке, выберите его и выдайте предупреждение компилятора. </font><font style="vertical-align: inherit;">В противном случае сдавайтесь (ошибка времени компиляции).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">解决隐含类型的规则可以大致这样表示：</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">首先在最内层的&ldquo;范围&rdquo;中查找匹配项，如果没有找到匹配项，则进入下一个范围并在那里搜索，依此类推</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，直到找到匹配项。</font><font style="vertical-align: inherit;">如果在某种程度上找到多个匹配项，并且其中一种类型来自当前程序集，则选择该一种并发出编译器警告。</font><font style="vertical-align: inherit;">否则，放弃（编译时错误）。</font></font>

source: The technical reasons are discussed in the answers and I think that it comes to the personal preferences in the end since the difference is not that <em>big</em> and there are tradeoffs for both of them. Visual Studio's default template for creating <code>.cs</code> files use <code>using</code> directives outside of namespaces e.g.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las razones t&eacute;cnicas se discuten en las respuestas y creo que al final se trata de las preferencias personales, ya que la diferencia no es tan </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">grande</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y hay compensaciones para ambos. </font><font style="vertical-align: inherit;">La plantilla predeterminada de Visual Studio para crear </font><font style="vertical-align: inherit;">archivos </font></font> <code>.cs</code> <font style="vertical-align: inherit;"></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directivas fuera de los espacios de nombres, por ejemplo</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">技術的な理由は回答で議論されており、違いはそれほど</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大きく</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なく</font><font style="vertical-align: inherit;">、両方のトレードオフがあるため</font><font style="vertical-align: inherit;">、結局のところ個人的な好みになると思い</font><font style="vertical-align: inherit;">ます。</font></font> <code>.cs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ファイル</font><font style="vertical-align: inherit;">を作成するためのVisual Studioのデフォルトテンプレートは</font><font style="vertical-align: inherit;">、名前空間外のディレクティブを</font><font style="vertical-align: inherit;">使用</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用</font><font style="vertical-align: inherit;">し</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">기술적 인 이유는 답변에서 설명하고 나는 차이가 아니기 때문에 그것은 결국 개인 취향에 달려있는 것 같아요 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">큰</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그들 중 모두 장단점이 있습니다. </font></font> <code>.cs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 파일 </font><font style="vertical-align: inherit;">을 만들기위한 Visual Studio의 기본 템플릿 </font><font style="vertical-align: inherit;">은 네임 스페이스 외부에서 지시문을 </font><font style="vertical-align: inherit;">사용 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Технические причины обсуждаются в ответах , </font><font style="vertical-align: inherit;">и я думаю , </font><font style="vertical-align: inherit;">что речь идет о личных предпочтениях в конце концов , </font><font style="vertical-align: inherit;">так как разница не так уж </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">большая</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и есть компромиссы для обоих из них. </font><font style="vertical-align: inherit;">Шаблон Visual Studio по умолчанию для создания </font><font style="vertical-align: inherit;">файлов </font></font> <code>.cs</code> <font style="vertical-align: inherit;"></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> директивы вне пространств имен, например</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">答案中讨论了技术原因，我认为最终涉及的是个人喜好，因为两者之间的差异并不</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">大，</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而且两者都需要权衡取舍。</font><font style="vertical-align: inherit;">创建Visual Studio的默认模板</font></font> <code>.cs</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">文件使用</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指令的命名空间如外</font></font>

source: There is a simple solution: add the "<code>global::</code>" prefix: <a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias">docs</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay una soluci&oacute;n simple: agregue el </font><font style="vertical-align: inherit;">prefijo </font><font style="vertical-align: inherit;">" </font></font> <code>global::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ": </font></font><a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docs</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">簡単な解決策があります： " </font></font> <code>global::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "プレフィックスを</font><font style="vertical-align: inherit;">追加し</font><font style="vertical-align: inherit;">ます：</font></font><a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docs</font></font></a>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단한 해결책이 있습니다 : " </font></font> <code>global::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "접두사 </font><font style="vertical-align: inherit;">추가 </font><font style="vertical-align: inherit;">: </font></font><a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docs</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть простое решение: добавить </font><font style="vertical-align: inherit;">префикс </font><font style="vertical-align: inherit;">&laquo; </font></font> <code>global::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &raquo;: </font></font><a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docs</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有一个简单的解决方案：添加&ldquo; </font></font> <code>global::</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> &rdquo;前缀：</font></font><a href="https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/namespaces/how-to-use-the-global-namespace-alias"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docs</font></font></a>

source: There is actually a (subtle) difference between the two. Imagine you have the following code in File1.cs:
es: En realidad hay una (sutil)diferencia entre los dos.Imagina que tienes el siguiente código en el archivo 1.cs:
ja: 実はこの2つの間には(微妙な)違いがあります。File1.csに以下のようなコードがあると想像してみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로 둘 사이에는 (미묘한) 차이가 있습니다. </font><font style="vertical-align: inherit;">File1.cs에 다음 코드가 있다고 가정하십시오.</font></font>
ru: На самом деле есть (тонкая)разница между ними.Представьте,что у вас есть следующий код в File1.cs:
zh_cn: 实际上,这两者之间有一个(微妙的)区别。想象一下,你在File1.cs里有以下代码。

source: There is an issue with placing using statements inside the namespace when you wish to use aliases. The alias doesn't benefit from the earlier <code>using</code> statements and has to be fully qualified.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Existe un problema con la colocaci&oacute;n de declaraciones de uso dentro del espacio de nombres cuando desea utilizar alias. </font><font style="vertical-align: inherit;">El alias no se beneficia de las </font><font style="vertical-align: inherit;">declaraciones de </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> anteriores </font><font style="vertical-align: inherit;">y debe estar completamente calificado.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エイリアスを使用する場合、ネームスペース内にusingステートメントを配置すると問題が発生します。</font><font style="vertical-align: inherit;">エイリアスは、以前の</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ステートメントの</font><font style="vertical-align: inherit;">恩恵を受けておらず、</font><font style="vertical-align: inherit;">完全修飾する必要があります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">별칭을 사용하려는 경우 네임 스페이스 내에 using 문을 배치하는 데 문제가 있습니다. </font><font style="vertical-align: inherit;">별명은 이전의 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 문 </font><font style="vertical-align: inherit;">에서 이점을 얻지 못하며 </font><font style="vertical-align: inherit;">정규화되어야합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует проблема с размещением операторов using в пространстве имен, когда вы хотите использовать псевдонимы. </font><font style="vertical-align: inherit;">Псевдоним не извлекает выгоду из ранее </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> операторов и должен быть полностью квалифицирован.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">当您希望使用别名时，在名称空间中放置using语句会出现问题。</font><font style="vertical-align: inherit;">别名不能从较早的</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句中</font><font style="vertical-align: inherit;">受益</font><font style="vertical-align: inherit;">，必须完全限定。</font></font>

source: This can be particularly pronounced if you have a long-winded alias such as the following (which is how I found the problem):
es: Esto puede ser particularmente pronunciado si se tiene un alias largo como el siguiente (que es como encontré el problema):
ja: これは、以下のような長文のエイリアスを使用している場合に特に顕著になります(私が問題を発見した方法です)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 긴 별칭이있는 경우 특히 그렇습니다 (문제를 발견 한 방법).</font></font>
ru: Это может быть особенно выражено,если у вас есть длинноволновой псевдоним,например,следующий (именно так я нашел проблему):
zh_cn: 如果你有一个冗长的别名,比如下面这样的别名(我就是这样发现问题的),这种情况会特别明显。

source: This changes if you put the <code>using</code> inside your namespace declaration, as follows:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto cambia si coloca el </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dentro de su declaraci&oacute;n de espacio de nombres, de la siguiente manera:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これ</font><font style="vertical-align: inherit;">は、次のように、名前空間宣言内</font><font style="vertical-align: inherit;">に</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を置くと変わり</font><font style="vertical-align: inherit;">ます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 네임 스페이스 선언 안에를 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하면 변경됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это изменится, если вы поместите </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в объявлении пространства имен следующим образом:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果将</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">放在名称空间声明中，</font><font style="vertical-align: inherit;">则情况会发生变化</font><font style="vertical-align: inherit;">，如下所示：</font></font>

source: This code will compile cleanly, without any compiler errors. However, it is unclear which version of the Guid type is being allocated. If the using directive is moved inside of the namespace, as shown below, a compiler error will occur:
es: Este código se compilará limpiamente,sin errores de compilación.Sin embargo,no está claro qué versión del tipo Guid está siendo asignada.Si la directiva using se mueve dentro del espacio de nombres,como se muestra a continuación,se producirá un error de compilación:
ja: このコードは、コンパイラエラーもなくきれいにコンパイルされます。しかし、Guid型のどのバージョンが割り当てられているかは不明です。以下のようにusingディレクティブを名前空間内に移動させると、コンパイラエラーが発生します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 코드는 컴파일러 오류없이 깨끗하게 컴파일됩니다. </font><font style="vertical-align: inherit;">그러나 어떤 버전의 Guid 유형이 할당되고 있는지 확실하지 않습니다. </font><font style="vertical-align: inherit;">아래와 같이 using 지시문을 네임 스페이스 내부로 이동하면 컴파일러 오류가 발생합니다.</font></font>
ru: Этот код скомпилируется чисто,без ошибок компилятора.Однако непонятно,какая версия типа Guid выделяется.Если директива use будет перемещена внутри пространства имен,как показано ниже,то возникнет ошибка компилятора:
zh_cn: 这段代码将被编译得很干净,没有任何编译器错误。但是,不清楚是哪个版本的 Guid 类型被分配了。如果使用指令被移动到命名空间内,如下图所示,就会出现编译器错误。

source: This thread already has some great answers, but I feel I can bring a little more detail with this additional answer.
es: Este hilo ya tiene algunas grandes respuestas,pero creo que puedo aportar un poco más de detalle con esta respuesta adicional.
ja: このスレッドにはすでにいくつかの素晴らしい回答がありますが、私はこの追加の回答でもう少し詳細を持ってくることができると感じています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 스레드에는 이미 훌륭한 답변이 있지만이 추가 답변으로 조금 더 자세하게 가져올 수 있다고 생각합니다.</font></font>
ru: В этой теме уже есть несколько отличных ответов,но я чувствую,что могу привнести немного больше деталей с этим дополнительным ответом.
zh_cn: 这条线程已经有了一些很好的答案,但我觉得我可以通过这个补充的答案,带来更多的细节。

source: Types in <code>MyCorp.TheProduct</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en </font></font> <code>MyCorp.TheProduct</code>
ja: <font style="vertical-align: inherit;"> <code>MyCorp.TheProduct</code> の<font style="vertical-align: inherit;">タイプ</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>MyCorp.TheProduct</code> 의<font style="vertical-align: inherit;"> 유형</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в </font></font> <code>MyCorp.TheProduct</code>
zh_cn: <font style="vertical-align: inherit;"> <code>MyCorp.TheProduct</code> 中的<font style="vertical-align: inherit;">类型</font></font><font style="vertical-align: inherit;"></font>

source: Types in <code>MyCorp</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos en </font></font> <code>MyCorp</code>
ja: <font style="vertical-align: inherit;"> <code>MyCorp</code> の<font style="vertical-align: inherit;">タイプ</font></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>MyCorp</code> 의<font style="vertical-align: inherit;"> 유형</font></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Типы в </font></font> <code>MyCorp</code>
zh_cn: <font style="vertical-align: inherit;"> <code>MyCorp</code> 中的<font style="vertical-align: inherit;">类型</font></font><font style="vertical-align: inherit;"></font>
