Repository: rueisnom/feedback
Catalog: xlf/12/53/19/125319.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Nested types inside <code>C</code> (including inherited nested types)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tipos anidados dentro de </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (incluidos los tipos anidados heredados)</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">内のネストされた型</font><font style="vertical-align: inherit;">（継承されたネストされた型を含む）</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내부의 중첩 유형 </font><font style="vertical-align: inherit;">(상속 중첩 유형 포함)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вложенные типы внутри </font></font> <code>C</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (включая унаследованные вложенные типы)</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>C</code> 中的<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">嵌套类型</font><font style="vertical-align: inherit;">（包括继承的嵌套类型）</font></font>

source: No matter if you put the usings inside or outside the namespace declaration, there's always the possibility that someone later adds a new type with identical name to one of the namespaces which have higher priority.
es: No importa si se ponen los usos dentro o fuera de la declaración del espacio de nombres,siempre existe la posibilidad de que alguien añada más tarde un nuevo tipo con nombre idéntico a uno de los espacios de nombres que tienen mayor prioridad.
ja: 名前空間宣言の内側でも外側でも、後から誰かが同じ名前の新しい型を追加して、より優先度の高い名前空間の一つに追加する可能性は常にあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 선언 내부 또는 외부에 용도를 사용하더라도 나중에 우선 순위가 높은 네임 스페이스 중 하나에 동일한 이름의 새 유형을 추가 할 가능성이 항상 있습니다.</font></font>
ru: Независимо от того,помещаете ли вы использование внутри или вне объявления пространства имен,всегда есть вероятность того,что кто-то позже добавит новый тип с идентичным именем в одно из пространств имен,которое имеет более высокий приоритет.
zh_cn: 无论你把usings放在命名空间声明的内部或外部,总是有可能后来有人在其中一个具有更高的优先级的命名空间中添加了一个新的同名类型。

source: Not pretty.
es: No es bonito.
ja: 可愛くない
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예쁘지 않은.</font></font>
ru: Некрасиво.
zh_cn: 不漂亮。

source: Now imagine that someone adds another file (File2.cs) to the project that looks like this:
es: Ahora imagina que alguien añade otro archivo (File2.cs)al proyecto que se ve así:
ja: さて、誰かが別のファイル (File2.cs)をプロジェクトに追加して、次のようになったとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 누군가 다음과 같은 다른 파일 (File2.cs)을 프로젝트에 추가한다고 상상해보십시오.</font></font>
ru: Теперь представьте,что кто-то добавляет другой файл (File2.cs)в проект,который выглядит так:
zh_cn: 现在想象一下,有人在项目中添加了另一个文件(File2.cs),看起来是这样的。

source: Now the compiler searches <code>System</code> before searching <code>Outer</code>, finds <code>System.Math</code>, and all is well.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora el compilador busca </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> antes de buscar </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , encuentra </font></font> <code>System.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , y todo est&aacute; bien.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これで、コンパイラは</font> <code>Outer</code> を<font style="vertical-align: inherit;">検索する</font><font style="vertical-align: inherit;">前に</font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を検索し</font><font style="vertical-align: inherit;">、</font> <code>System.Math</code> を<font style="vertical-align: inherit;">見つけ</font><font style="vertical-align: inherit;">、すべて順調です。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 컴파일러 </font><font style="vertical-align: inherit;">는 </font> <code>Outer</code> 를<font style="vertical-align: inherit;"> 검색 </font><font style="vertical-align: inherit;">하기 전에 </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 검색 </font><font style="vertical-align: inherit;">하고 </font> <code>System.Math</code> 를<font style="vertical-align: inherit;"> 찾으면 </font><font style="vertical-align: inherit;">모두 </font><font style="vertical-align: inherit;">정상</font><font style="vertical-align: inherit;"> 입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь компилятор ищет </font></font> <code>System</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> перед поиском </font></font> <code>Outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , находит </font></font> <code>System.Math</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , и все хорошо.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，编译器</font><font style="vertical-align: inherit;">在搜索</font> <code>Outer</code> <font style="vertical-align: inherit;">之前先</font><font style="vertical-align: inherit;">搜索</font></font> <code>System</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">然后</font><font style="vertical-align: inherit;">找到</font> <code>System.Math</code> <font style="vertical-align: inherit;">，一切都很好。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Now, let's be explicit about what this means in a concrete example with the two major conventions.
es: Ahora,seamos explícitos sobre lo que esto significa en un ejemplo concreto con las dos principales convenciones.
ja: では、具体的な例ではどのようなことを意味するのか、大きく分けて2つの規約を使って明示してみましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 두 가지 주요 규칙이있는 구체적인 예에서 이것이 무엇을 의미하는지 명시 해 봅시다.</font></font>
ru: А теперь давайте на конкретном примере двух основных конвенций прямо скажем,что это значит.
zh_cn: 现在,我们用两个主要的约定俗成的具体例子来明确一下这意味着什么。

source: Now, search for the type <code>Ambiguous</code> goes in this order:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora, busque el tipo </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> va en este orden:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここで、</font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">タイプの検索は</font><font style="vertical-align: inherit;">次の順序で行われます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 유형을 검색하면 </font><font style="vertical-align: inherit;">다음 순서로 진행됩니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Теперь поиск типа </font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> идет в следующем порядке:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">现在，搜索类型</font></font> <code>Ambiguous</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">依次进行：</font></font>

source: One (tiny) advantage of having usings <em>outside</em> is that you can then utilize the using directives for a global attribute, for example <code>[assembly: ComVisible(false)]</code> instead of <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una (peque&ntilde;a) ventaja de tener usos </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">externos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es que puede utilizar las directivas de uso para un atributo global, por ejemplo </font></font> <code>[assembly: ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">外部</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">で使用することの</font><font style="vertical-align: inherit;">（小さな）利点の1つ</font><font style="vertical-align: inherit;">は</font><font style="vertical-align: inherit;">、</font> <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code> <font style="vertical-align: inherit;">ではなく、</font><font style="vertical-align: inherit;">たとえば</font></font> <code>[assembly: ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などのグローバル属性のusingディレクティブを利用できることです</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">외부</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 에서 사용하는 </font><font style="vertical-align: inherit;">것의 가장 작은 장점은 </font><font style="vertical-align: inherit;">전역 속성에 대해 using 지시문을 사용할 수 있다는 것입니다 (예 </font></font> <code>[assembly: ComVisible(false)]</code> <font style="vertical-align: inherit;"></font> <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대신 </font><font style="vertical-align: inherit;">[assembly : ComVisible (false)] </font><font style="vertical-align: inherit;">)</font><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Одним (крошечным) преимуществом использования </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">извне</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является то, что вы можете затем использовать директивы using для глобального атрибута, например </font></font> <code>[assembly: ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在外部</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用的</font><font style="vertical-align: inherit;">一个（微小）优点</font><font style="vertical-align: inherit;">是，您可以然后对全局属性使用using指令，例如，使用</font></font> <code>[assembly: ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替</font></font> <code>[assembly: System.Runtime.InteropServices.ComVisible(false)]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: One can adjust stylecop to check <code>using</code> directives outside of namespaces through adding <code>stylecop.json</code> file in the root of the project file with the following:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se puede ajustar stylecop para verificar el </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> directivas fuera de los espacios de nombres agregando el </font><font style="vertical-align: inherit;">archivo </font></font> <code>stylecop.json</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la ra&iacute;z del archivo del proyecto con lo siguiente:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">次のようにプロジェクトファイルのルートに</font> <code>stylecop.json</code> <font style="vertical-align: inherit;">ファイル</font><font style="vertical-align: inherit;">を追加することで、名前空間外のディレクティブ</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">してチェック</font><font style="vertical-align: inherit;">する</font><font style="vertical-align: inherit;">ように</font><font style="vertical-align: inherit;">スタイルコップを調整でき</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같이 프로젝트 파일의 루트에 </font> <code>stylecop.json</code> <font style="vertical-align: inherit;"> 파일 </font><font style="vertical-align: inherit;">을 추가하여 네임 스페이스 외부의 지시문을 </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> stylecop를 확인하도록 조정할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Можно настроить stylecop для проверки </font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> директив вне пространств имен, добавив </font><font style="vertical-align: inherit;">файл </font></font> <code>stylecop.json</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в корень файла проекта с помощью следующего:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">通过</font><font style="vertical-align: inherit;">在项目文件的根目录中</font><font style="vertical-align: inherit;">添加</font> <code>stylecop.json</code> <font style="vertical-align: inherit;">文件，</font><font style="vertical-align: inherit;">可以通过以下方式调整stylecop以</font></font> <code>using</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">命名空间之外的指令</font><font style="vertical-align: inherit;">进行检查</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: One wrinkle I ran into (that isn't covered in other answers):
es: Una arruga con la que me topé (que no está cubierta en otras respuestas):
ja: 私が遭遇した一つのシワ(他の回答ではカバーされていないもの)。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">하나의 주름이 발생했습니다 (다른 답변에서는 다루지 않음).</font></font>
ru: Одна морщинка,на которую я наткнулся (она не покрыта другими ответами):
zh_cn: 我遇到的一个皱纹(其他答案中没有涉及)。

source: Placing multiple namespace elements within a single file is generally a bad idea, but if and when this is done, it is a good idea to place all using directives within each of the namespace elements, rather than globally at the top of the file. This will scope the namespaces tightly, and will also help to avoid the kind of behavior described above.
es: Colocar varios elementos del espacio de nombres dentro de un solo archivo suele ser una mala idea,pero si y cuando se hace,es una buena idea colocar todos los elementos del espacio de nombres que utilizan directivas dentro de cada uno de los elementos del espacio de nombres,en lugar de colocarlos globalmente en la parte superior del archivo.Esto hará que los espacios de nombres estén bien delimitados,y también ayudará a evitar el tipo de comportamiento descrito anteriormente.
ja: 複数の名前空間要素を一つのファイル内に配置するのは一般的には良くない考えですが、もしこれを行う場合は、ファイルの先頭にグローバルに配置するのではなく、それぞれの名前空間要素内にすべての使用ディレクティブを配置するのが良い考えです。これにより、名前空間を厳密にスコープすることができ、上述のような動作を回避するのにも役立ちます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단일 파일 내에 여러 네임 스페이스 요소를 배치하는 것은 일반적으로 좋지 않은 방법이지만,이 작업이 완료되면 전역 적으로 파일 맨 위가 아닌 각 네임 스페이스 요소 내에 모든 사용 지시문을 배치하는 것이 좋습니다. </font><font style="vertical-align: inherit;">이렇게하면 네임 스페이스의 범위가 좁아지고 위에서 설명한 종류의 동작을 피하는 데 도움이됩니다.</font></font>
ru: Размещение нескольких элементов пространства имен в одном файле обычно плохая идея,но если и когда это будет сделано,то хорошей идеей будет разместить все использующие директивы внутри каждого элемента пространства имен,а не глобально в верхней части файла.Это позволит плотно охватить пространства имен,а также поможет избежать такого поведения,которое было описано выше.
zh_cn: 在一个文件中放置多个命名空间元素通常是个坏主意,但如果这样做的话,最好是将所有使用指令放置在每个命名空间元素中,而不是全局放置在文件的顶部。这样做会使命名空间的范围更紧密,同时也有助于避免出现上面描述的那种行为。

source: Placing the using-alias directive outside of the namespace is a bad practice because it can lead to confusion in situations such as this, where it is not obvious which version of the type is actually being used. This can potentially lead to a bug which might be difficult to diagnose.
es: La colocación de la directiva de uso fuera del espacio de nombres es una mala práctica porque puede dar lugar a confusión en situaciones como ésta,en las que no es obvio qué versión del tipo se está utilizando realmente.Esto puede conducir potencialmente a un error que podría ser difícil de diagnosticar.
ja: using-alias ディレクティブを名前空間の外に配置するのは、 このような状況では、どのバージョンの型が実際に使われているのかが明らかではなく、 混乱を招く可能性があるので、悪い習慣です。これは、診断が困難なバグを引き起こす可能性があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">using-alias 지시문을 네임 스페이스 외부에 배치하는 것은 실제로 사용중인 유형의 버전이 확실하지 않은 상황에서 혼동을 일으킬 수 있기 때문에 나쁜 습관입니다. </font><font style="vertical-align: inherit;">이로 인해 잠재적으로 진단하기 어려운 버그가 발생할 수 있습니다.</font></font>
ru: Размещение директивы using-alias вне пространства имен-это плохая практика,потому что она может привести к путанице в таких ситуациях,когда не очевидно,какая версия типа на самом деле используется.Это потенциально может привести к ошибке,которую будет трудно диагностировать.
zh_cn: 将使用-alias指令放在命名空间之外是一个不好的做法,因为在这种情况下,可能会导致混淆,因为在这种情况下,不知道实际使用的是哪个版本的类型。这可能会导致一个可能难以诊断的错误。

source: Placing using-alias directives within the namespace element eliminates this as a source of bugs.
es: Colocar directivas de uso dentro del elemento del espacio de nombres elimina esto como fuente de errores.
ja: using-aliasディレクティブを名前空間要素内に配置することで、バグの原因となるこれを排除することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스 요소 내에 using-alias 지시문을 배치하면이를 버그의 원인으로 제거 할 수 있습니다.</font></font>
ru: Размещение директив using-alias в элементе пространства имен устраняет это как источник ошибок.
zh_cn: 将使用-alias指令放置在命名空间元素中,可以消除这个bug。

source: Presume the code file <em>Foo.cs</em>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Presume el archivo de c&oacute;digo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Foo.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードファイル</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Foo.csを想定し</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드 파일 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Foo.cs를 가정하십시오</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предположим, файл кода </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Foo.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假定代码文件</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Foo.cs</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：</font></font>

source: Putting it inside the namespaces makes the declarations local to that namespace for the file (in case you have multiple namespaces in the file) but if you only have one namespace per file then it doesn't make much of a difference whether they go outside or inside the namespace.
es: Ponerlo dentro de los espacios de nombres hace que las declaraciones sean locales a ese espacio de nombres para el archivo (en caso de tener varios espacios de nombres en el archivo)pero si sólo se tiene un espacio de nombres por archivo entonces no hay mucha diferencia si salen o entran en el espacio de nombres.
ja: 名前空間の内側に置くと、宣言はそのファイルの名前空間に対してローカルになりますが(ファイル内に複数の名前空間がある場合)、1つのファイルに1つの名前空間しかない場合は、名前空間の外側に行っても内側に行ってもあまり違いはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">네임 스페이스에 넣으면 파일에 대한 네임 스페이스에 대한 선언이 파일에 대해 로컬로 만들어 지지만 (파일에 여러 네임 스페이스가있는 경우) 파일 당 하나의 네임 스페이스 만있는 경우 외부 또는 외부에 상관없이 큰 차이가 없습니다. 네임 스페이스 내부</font></font>
ru: Помещение его в пространства имен делает объявления локальными для этого пространства имен для файла (в случае,если у вас несколько пространств имен в файле),но если у вас только одно пространство имен на файл,то не имеет большого значения,выходят ли они наружу или внутри пространства имен.
zh_cn: 把它放在命名空间里,可以使文件的声明本地化到该文件的命名空间(如果你在文件里有多个命名空间的话),但如果每个文件只有一个命名空间,那么它们在命名空间外还是在命名空间里,并没有什么区别。
