Repository: rueisnom/feedback
Catalog: xlf/11/01/75/0/1101750.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Change this line:
es: Cambie esta línea:
ja: この行を変更します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 줄을 바꾸십시오 :</font></font>
ru: Поменяйте эту строку:
zh_cn: 改成这一行。

source: I get the UI up and running. When I click on the <code>Grab</code> button, I get the following error on the console:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tengo la interfaz de usuario en funcionamiento. </font><font style="vertical-align: inherit;">Cuando hago clic en el </font><font style="vertical-align: inherit;">bot&oacute;n </font></font> <code>Grab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , aparece el siguiente error en la consola:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UIを起動して実行しています。</font><font style="vertical-align: inherit;">「</font></font> <code>Grab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ボタン</font><font style="vertical-align: inherit;">をクリックすると</font><font style="vertical-align: inherit;">、コンソールに次のエラーが表示されます。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">UI를 시작했습니다. </font></font> <code>Grab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 버튼을 </font><font style="vertical-align: inherit;">클릭 </font><font style="vertical-align: inherit;">하면 콘솔에 다음과 같은 오류가 발생합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я получил интерфейс и работает. </font><font style="vertical-align: inherit;">Когда я нажимаю кнопку &laquo; </font></font> <code>Grab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , на консоли появляется следующая ошибка:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我启动并运行了UI。</font><font style="vertical-align: inherit;">当单击</font></font> <code>Grab</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">按钮时，在控制台上出现以下错误：</font></font>

source: I've created this simple GUI:
es: He creado este simple GUI:
ja: こんなシンプルなGUIを作ってみました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 간단한 GUI를 만들었습니다.</font></font>
ru: Я создал этот простой графический интерфейс:
zh_cn: 我创建了这个简单的GUI。

source: Just as you already correctly do for <code>grabBtn</code>!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Como ya lo has hecho correctamente para </font></font> <code>grabBtn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>grabBtn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に対してすでに正しく行っているように</font><font style="vertical-align: inherit;">！</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이미 </font></font> <code>grabBtn</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대해 올바르게 수행하는 </font><font style="vertical-align: inherit;">것처럼</font><font style="vertical-align: inherit;"> !</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Точно так же, как вы уже правильно сделали для </font></font> <code>grabBtn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">就像您已经正确地为</font></font> <code>grabBtn</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">做</font><font style="vertical-align: inherit;">！</font></font>

source: That way you get your <code>Entry</code> reference stored in <code>entryBox</code> and it's laid out like you expect. This has a bonus side effect of making your layout easier to understand and maintain if you collect all of your <code>grid</code> and/or <code>pack</code> statements in blocks.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De esa manera, obtienes tu </font><font style="vertical-align: inherit;">referencia de </font></font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> almacenada en </font></font> <code>entryBox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y se presenta como esperas. </font><font style="vertical-align: inherit;">Esto tiene un efecto secundario adicional de hacer que su dise&ntilde;o sea m&aacute;s f&aacute;cil de entender y mantener si re&uacute;ne todas sus </font><font style="vertical-align: inherit;">declaraciones de </font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y / o </font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en bloques.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これにより</font><font style="vertical-align: inherit;">、</font> <code>entryBox</code> に<font style="vertical-align: inherit;">格納された</font></font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">参照</font><font style="vertical-align: inherit;">が取得</font><font style="vertical-align: inherit;">され、</font><font style="vertical-align: inherit;">期待どおりにレイアウトされます。</font><font style="vertical-align: inherit;">これには、すべての</font> <code>grid</code> <font style="vertical-align: inherit;">および/または</font> <code>pack</code> <font style="vertical-align: inherit;">ステートメントをブロックで</font><font style="vertical-align: inherit;">収集すると、レイアウトの理解と保守が容易になるという副次的な効果があります</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이렇게하면 </font> <code>entryBox</code> </font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 참조가 저장되고 </font><font style="vertical-align: inherit;">예상대로 배치됩니다. </font><font style="vertical-align: inherit;">이는 </font> <code>grid</code> <font style="vertical-align: inherit;"> 및 / 또는 </font> <code>pack</code> <font style="vertical-align: inherit;"> 명세서를 모두 블록으로 </font><font style="vertical-align: inherit;">수집 할 경우 레이아웃을 이해하고 유지하기 쉽도록하는 부작용 </font><font style="vertical-align: inherit;">입니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Таким образом, вы получите </font><font style="vertical-align: inherit;">ссылку на </font></font> <code>Entry</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> сохраненную в </font></font> <code>entryBox</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и она выложена так, как вы ожидаете. </font><font style="vertical-align: inherit;">Это имеет побочный побочный эффект, облегчая понимание и поддержание вашего макета, если вы собираете все свои </font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и / или </font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> операторы в блоки.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这样，您就可以将</font></font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">引用存储在</font></font> <code>entryBox</code> 中<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，并且布局与您期望的一样。</font><font style="vertical-align: inherit;">如果您</font><font style="vertical-align: inherit;">以块的形式</font><font style="vertical-align: inherit;">收集所有</font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和/或</font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">语句，</font><font style="vertical-align: inherit;">这将带来额外的副作用，使您的布局更易于理解和维护</font><font style="vertical-align: inherit;">。</font></font>

source: The <code>grid</code>, <code>pack</code> and <code>place</code> functions of the <code>Entry</code> object and of all other widgets returns <code>None</code>. In python when you do <code>a().b()</code>, the result of the expression is whatever <code>b()</code> returns, therefore <code>Entry(...).grid(...)</code> will return <code>None</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las </font><font style="vertical-align: inherit;">funciones de </font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>place</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> del </font><font style="vertical-align: inherit;">objeto </font></font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y de todos los dem&aacute;s widgets devuelve </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En python cuando haces </font></font> <code>a().b()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el resultado de la expresi&oacute;n es lo que </font></font> <code>b()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devuelve, por lo tanto </font></font> <code>Entry(...).grid(...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> devolver&aacute; </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"> <code>Entry</code> <font style="vertical-align: inherit;">オブジェクトと他のすべてのウィジェット</font><font style="vertical-align: inherit;">の</font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>place</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">関数</font><font style="vertical-align: inherit;">は</font> <code>None</code> を<font style="vertical-align: inherit;">返します</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">Python </font><font style="vertical-align: inherit;">では、</font> <code>a().b()</code> <font style="vertical-align: inherit;">を実行</font><font style="vertical-align: inherit;">する</font><font style="vertical-align: inherit;">と、式の結果は</font> <code>b()</code> <font style="vertical-align: inherit;">が返す</font><font style="vertical-align: inherit;">ものな</font><font style="vertical-align: inherit;">ので、</font> <code>Entry(...).grid(...)</code> <font style="vertical-align: inherit;">は</font> <code>None</code> <font style="vertical-align: inherit;">を返し</font><font style="vertical-align: inherit;">ます。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"> <code>Entry</code> <font style="vertical-align: inherit;"> 객체와 다른 모든 위젯 </font><font style="vertical-align: inherit;">의 </font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>place</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 함수 </font><font style="vertical-align: inherit;">는 </font> <code>None</code> 을<font style="vertical-align: inherit;"> 반환합니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">파이썬에서 </font> <code>a().b()</code> <font style="vertical-align: inherit;"> 를 수행하면 표현식의 결과는 </font> <code>b()</code> <font style="vertical-align: inherit;"> 반환하는 것이므로 </font> <code>Entry(...).grid(...)</code> <font style="vertical-align: inherit;"> 는 </font> <code>None</code> <font style="vertical-align: inherit;"> 을 반환 </font><font style="vertical-align: inherit;">합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В </font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>place</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> функции </font></font> <code>Entry</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> объекта и всех других виджетов возвращает </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">В python, когда вы делаете </font></font> <code>a().b()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , результатом выражения является то, что </font><font style="vertical-align: inherit;">возвращает </font></font> <code>b()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , поэтому </font></font> <code>Entry(...).grid(...)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вернет </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"> <code>Entry</code> <font style="vertical-align: inherit;">对象以及所有其他小部件</font><font style="vertical-align: inherit;">的</font></font> <code>grid</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>pack</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>place</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">函数</font><font style="vertical-align: inherit;">返回</font> <code>None</code> <font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">在python中，当您执行</font> <code>a().b()</code> <font style="vertical-align: inherit;">，表达式的结果就是</font> <code>b()</code> <font style="vertical-align: inherit;">返回的值，因此</font> <code>Entry(...).grid(...)</code> <font style="vertical-align: inherit;">将返回</font> <code>None</code> <font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Tkinter: AttributeError: NoneType object has no attribute <attribute name>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tkinter: AttributeError: NoneType objeto no tiene atributo </font></font><attribute name=""></attribute>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tkinter：AttributeError：NoneTypeオブジェクトに属性がありません </font></font><attribute name=""></attribute>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tkinter : AttributeError : NoneType 객체에 속성이 없습니다 </font></font><attribute name=""></attribute>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tkinter: AttributeError: объект NoneType не имеет атрибута </font></font><attribute name=""></attribute>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tkinter：AttributeError：NoneType对象没有属性 </font></font><attribute name=""></attribute>

source: Why is <code>entryBox</code> set to <code>None</code>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Por qu&eacute; </font></font> <code>entryBox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> est&aacute; </font><font style="vertical-align: inherit;">configurado en </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">なぜされ</font></font> <code>entryBox</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に設定</font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>entryBox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>None</code> 으로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정된 </font><font style="vertical-align: inherit;">이유는 무엇 </font><font style="vertical-align: inherit;">입니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Почему для </font></font> <code>entryBox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> установлено значение </font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为什么</font></font> <code>entryBox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设置为</font></font> <code>None</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">？</font></font>

source: You should split that on to two lines like this:
es: Deberías dividir eso en dos líneas como esta:
ja: こんな感じで2行に分けるといいですよ。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것을 다음과 같이 두 줄로 나누어야합니다.</font></font>
ru: Ты должен разделить это на две строчки вот так:
zh_cn: 你应该把它分成两行,就像这样。

source: into these two lines:
es: en estas dos líneas:
ja: この2つの行に
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 두 줄로</font></font>
ru: в эти две линии:
zh_cn: 成这两条线。
