Repository: rueisnom/feedback
Catalog: xlf/68/41/33/3/6841333.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The code above produces no output on my Windows machine. So any time zone which has any offset other than its standard one at the start of 1900 will count that as a transition. TZDB itself has some data going back earlier than that, and doesn't rely on any idea of a "fixed" standard time (which is what <code>getRawOffset</code> assumes to be a valid concept) so other libraries needn't introduce this artificial transition.
es: El c&oacute;digo anterior no produce resultados en mi m&aacute;quina Windows. Por lo tanto, cualquier zona horaria que tenga un desplazamiento diferente al est&aacute;ndar a principios de 1900 contar&aacute; eso como una transici&oacute;n. TZDB en s&iacute; tiene algunos datos que se remontan antes de eso, y no se basa en ninguna idea de un tiempo est&aacute;ndar "fijo" (que es lo que <code>getRawOffset</code> supone que es un concepto v&aacute;lido), por lo que otras bibliotecas no necesitan introducir esta transici&oacute;n artificial.
ja: 上記のコードでは、Windowsマシンで出力が生成されません。 したがって、1900年の初めに標準以外のオフセットがあるタイムゾーンは、それを遷移としてカウントします。 TZDB自体にはそれより前に遡るデータがいくつかあり、「固定」標準時間（これは <code>getRawOffset</code> が有効な概念であると想定している時間）の概念に依存しないため、他のライブラリではこの人工的な遷移を導入する必要はありません。
ko: 위의 코드는 Windows 컴퓨터에서 출력을 생성하지 않습니다. 따라서 1900 년 시작시 표준 시간대 이외의 오프셋이있는 시간대는 전환으로 간주합니다. TZDB 자체는 이전보다 약간의 데이터를 가지고 있으며 "고정 된"표준 시간 ( <code>getRawOffset</code> 이 유효한 개념이라고 가정)에 대한 아이디어에 의존하지 않기 때문에 다른 라이브러리는이 인공적인 전환을 도입 할 필요가 없습니다.
ru: Приведенный выше код не производит вывод на мой компьютер с Windows. Таким образом, любой часовой пояс с любым смещением, отличным от стандартного в начале 1900 года, будет считаться переходным. Сам TZDB имеет некоторые данные, возвращающиеся раньше, и не полагается на идею &laquo;фиксированного&raquo; стандартного времени (которое <code>getRawOffset</code> предполагает допустимым понятием), поэтому другие библиотеки не должны вводить этот искусственный переход.
zh_cn: 上面的代码在Windows计算机上不产生任何输出。 因此，任何在1900年初具有除标准偏移量之外的偏移量的时区都将被视为过渡。 TZDB本身早有一些数据，并且不依赖任何&ldquo;固定&rdquo;标准时间的想法（ <code>getRawOffset</code> 假定这是一个有效的概念），因此其他库不需要引入这种人为的转换。

source: The moral of this strangeness is:
es: La moraleja de esta extrañeza es:
ja: この奇妙さの教訓は
ko: 이 이상의 도덕은 다음과 같습니다.
ru: Мораль этой странности в том:
zh_cn: 这种陌生感的寓意是:

source: The new <code>java.time</code> package on Java 8 let use see this more clearly, and provide tools to handle it. Given:
es: El nuevo paquete <code>java.time</code> en Java 8 permite ver esto m&aacute;s claramente y proporciona herramientas para manejarlo. Dado:
ja: Java 8の新しい <code>java.time</code> パッケージは、これをより明確に見て、それを処理するためのツールを提供します。 与えられた：
ko: Java 8의 새로운 <code>java.time</code> 패키지는이를보다 명확하게 사용하고 처리 할 수있는 도구를 제공합니다. 주어진:
ru: Новый пакет <code>java.time</code> в Java 8 позволяет использовать это более наглядно и предоставляет инструменты для его обработки. Дано:
zh_cn: Java 8上新的 <code>java.time</code> 包使使用过程更加清晰，并提供了处理它的工具。 鉴于：

source: The original question would no longer demonstrate quite the same behaviour, if rebuilt with version 2013a of <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">TZDB</a>. In 2013a, the result would be 358 seconds, with a transition time of 23:54:03 instead of 23:54:08.
es: La pregunta original ya no demostrar&iacute;a el mismo comportamiento, si se reconstruye con la versi&oacute;n 2013a de <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">TZDB</a> . En 2013a, el resultado ser&iacute;a 358 segundos, con un tiempo de transici&oacute;n de 23:54:03 en lugar de 23:54:08.
ja: <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">TZDBの</a>バージョン2013aで再構築した場合、元の質問はまったく同じ動作を示しません。 2013aでは、結果は358秒になり、遷移時間は23:54:08ではなく23:54:03になります。
ko: <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">TZDB</a> 버전 2013a로 다시 빌드하면 원래 질문은 더 이상 똑같은 동작을 나타내지 않습니다. 2013a에서 결과는 358 초이며 전환 시간은 23:54:08 대신 23:54:03입니다.
ru: Исходный вопрос больше не будет демонстрировать совершенно такое же поведение, если его перестроить с версией <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">TZDB</a> 2013a. В 2013a результат будет 358 секунд с временем перехода 23:54:03 вместо 23:54:08.
zh_cn: 如果使用TZDB的<a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">2013a</a>版本进行重建，原始问题将不再表现出完全相同的行为。 在2013a中，结果为358秒，转换时间为23:54:03，而不是23:54:08。

source: The time can also mess up in other places like the US. The US has Daylight Saving Time. When the Daylight Saving Time starts the time goes forward 1 hour. But after a while the Daylight Saving Time ends, and it goes backward 1 hour back to the standard time zone. So sometimes when comparing times in the US the difference is about <code>3600</code> seconds not 1 second.
es: El tiempo tambi&eacute;n puede estropearse en otros lugares como los Estados Unidos. Estados Unidos tiene horario de verano. Cuando comienza el horario de verano, el tiempo avanza 1 hora. Pero despu&eacute;s de un tiempo, el horario de verano termina y retrocede 1 hora a la zona horaria est&aacute;ndar. A veces, cuando se comparan los tiempos en los EE. UU., La diferencia es de aproximadamente <code>3600</code> segundos, no de 1 segundo.
ja: 時間は、米国などの他の場所でも混乱する可能性があります。 米国には夏時間があります。 夏時間が始まると、時刻は1時間進みます。 しかし、しばらくすると夏時間が終了し、標準時間帯に1時間戻ります。 したがって、米国の時間を比較すると、違いは1秒ではなく約 <code>3600</code> 秒になることがあります。
ko: 미국과 같은 다른 곳에서도 시간이 엉망이 될 수 있습니다. 미국에는 일광 절약 시간 제가 있습니다. 일광 절약 시간 제가 시작되면 시간이 1 시간 앞으로 이동합니다. 그러나 잠시 후 일광 절약 시간 제가 종료되고 표준 시간대로 1 시간 뒤로 이동합니다. 따라서 미국에서 시간을 비교할 때 차이는 1 초가 아닌 약 <code>3600</code> 초입니다.
ru: Время также может испортить в других местах, таких как США. В США есть летнее время. Когда начинается летнее время, время идет вперед на 1 час. Но через некоторое время летнее время заканчивается, и оно возвращается назад на 1 час назад к стандартному часовому поясу. Так что иногда при сравнении времени в США разница составляет около <code>3600</code> секунд, а не 1 секунда.
zh_cn: 在美国等其他地方，时间也会混乱。 美国有夏令时。 夏令时开始时，时间向前1小时。 但是过了一会儿，夏令时结束，并且倒退了1小时回到标准时区。 因此有时在美国比较时间时，差异约为 <code>3600</code> 秒而不是1秒。

source: Then <code>durationAtEarlierOffset</code> will be one second, while <code>durationAtLaterOffset</code> will be five minutes and 53 seconds.
es: Luego, la <code>durationAtEarlierOffset</code> inicio de la duraci&oacute;n ser&aacute; de un segundo, mientras que la <code>durationAtLaterOffset</code> retraso ser&aacute; de cinco minutos y 53 segundos.
ja: その後、 <code>durationAtEarlierOffset</code> は1秒、 <code>durationAtLaterOffset</code> は5分53秒になります。
ko: 그러면 <code>durationAtEarlierOffset</code> 은 1 초가되고 <code>durationAtLaterOffset</code> 은 5 분 53 초가됩니다.
ru: Тогда <code>durationAtEarlierOffset</code> будет одна секунда, тогда как <code>durationAtLaterOffset</code> будет пять минут и 53 секунды.
zh_cn: 然后， <code>durationAtEarlierOffset</code> 将为一秒钟，而 <code>durationAtLaterOffset</code> 将为五分钟53秒。

source: Then <code>ld4-ld3</code> will be <code>1</code>.
es: Entonces <code>ld4-ld3</code> ser&aacute; <code>1</code> .
ja: その場合、 <code>ld4-ld3</code> は <code>1</code> になります。
ko: 그러면 <code>ld4-ld3</code> 은 <code>1</code> 이 됩니다.
ru: Тогда <code>ld4-ld3</code> будет <code>1</code> .
zh_cn: 然后 <code>ld4-ld3</code> 将为 <code>1</code> 。

source: This is not particularly strange and has happened pretty much everywhere at one time or another as timezones were switched or changed due to political or administrative actions.
es: Esto no es particularmente extraño y ha sucedido prácticamente en todas partes en un momento u otro,ya que las zonas horarias fueron cambiadas o modificadas debido a acciones políticas o administrativas.
ja: これは特に不思議なことではなく、政治的または行政的な行動のためにタイムゾーンが入れ替わったり、変更されたりしたために、ある時期または別の時期に、かなりどこでも起こっています。
ko: 이것은 특히 이상하지 않으며 정치 또는 행정적 조치로 시간대가 바뀌거나 바뀌면서 한 번에 거의 모든 곳에서 발생했습니다.
ru: Это не особенно странно и происходило практически везде в то или иное время,так как часовые пояса менялись или менялись в связи с политическими или административными действиями.
zh_cn: 这种情况并不是特别奇怪,而且由于政治或行政行为而被调换或改变的时间段,几乎到处都在发生。

source: This slight shift of offsets, instead of the usual one-hour daylight savings (summer time) we are used to, obscures the problem a bit.
es: Este ligero desplazamiento de las compensaciones,en lugar de la habitual hora de verano a la que estamos acostumbrados,oscurece un poco el problema.
ja: 私たちが慣れ親しんでいる通常の1時間のサマータイム(夏時間)ではなく、このわずかなオフセットのシフトが問題を少し曖昧にしています。
ko: 우리가 익숙한 일반적인 1 시간 일광 절약 시간 (서머 타임) 대신이 약간의 오프셋 이동은 문제를 조금 모호하게합니다.
ru: Этот небольшой сдвиг смещений,вместо привычного для нас одночасового дневного (летнего)времени,немного затушевывает проблему.
zh_cn: 这种轻微的偏移,而不是我们惯常的一小时白昼储蓄(夏季时间),稍微掩盖了问题。

source: This way you will be able to walk through any periods where hours or minutes happen twice.
es: De esta manera podrás caminar a través de cualquier periodo en el que las horas o los minutos pasen dos veces.
ja: このようにして、何時間、何分が二度起こるかわからない期間を歩くことができるようになります。
ko: 이렇게하면 몇 시간 또는 몇 분이 두 번 발생하는 기간을 걸을 수 있습니다.
ru: Таким образом,вы сможете пройти через любые периоды,где часы или минуты случаются дважды.
zh_cn: 这样一来,你就能在任何时间段里走过两次的时间段。

source: To the <a href="https://www.jcp.org/">Java Community Process</a> members I recommend:
es: A los miembros de <a href="https://www.jcp.org/">Java Community Process</a> les recomiendo:
ja: <a href="https://www.jcp.org/">Java Community Processの</a>メンバーには、次のことをお勧めします。
ko: <a href="https://www.jcp.org/">Java Community Process</a> 회원에게 다음을 권장합니다.
ru: Участникам <a href="https://www.jcp.org/">процесса сообщества Java</a> я рекомендую:
zh_cn: 我向<a href="https://www.jcp.org/">Java Community Process</a>成员推荐：

source: Use dates and times in UTC wherever possible.
es: Utilice fechas y horas en UTC siempre que sea posible.
ja: 日付と時間は可能な限りUTCで使用してください。
ko: 가능하면 UTC로 날짜와 시간을 사용하십시오.
ru: Используйте даты и время по UTC везде,где это возможно.
zh_cn: 尽可能使用UTC的日期和时间。

source: When incrementing time you should convert back to UTC and then add or subtract. Use the local time only for display.
es: Al incrementar el tiempo debes convertir de nuevo a UTC y luego sumar o restar.Utilice la hora local sólo para la visualización.
ja: 時間をインクリメントする場合は、UTCに変換してから加算または減算する必要があります。表示にはローカルタイムのみを使用します。
ko: 시간이 증가하면 UTC로 다시 변환 한 다음 더하거나 빼야합니다. 현지 시간 만 표시하십시오.
ru: При инкрементировании времени вы должны преобразовать обратно в UTC,а затем добавить или вычесть.Используйте местное время только для отображения.
zh_cn: 在递增时间时,您应该把时间换算成UTC,然后再加减。仅使用当地时间显示。

source: When it was <code>23:54:07</code> in Shanghai, the local standard time, but after 5 minutes and 52 seconds, it turned to the next day at <code>00:00:00</code>, and then local standard time changed back to <code>23:54:08</code>. So, that's why the difference between the two times is 343 seconds not 1 second, as you would have expected.
es: Cuando eran las <code>23:54:07</code> en Shanghai, la hora est&aacute;ndar local, pero despu&eacute;s de 5 minutos y 52 segundos, pas&oacute; al d&iacute;a siguiente a las <code>00:00:00</code> , y luego la hora est&aacute;ndar local volvi&oacute; a las <code>23:54:08</code> . Por eso, la diferencia entre los dos tiempos es 343 segundos, no 1 segundo, como era de esperar.
ja: 上海 <code>23:54:07</code> たが、5分52秒後に翌日 <code>00:00:00</code> になり、現地標準時は <code>23:54:08</code> に戻りました。 。 そのため、2つの時間の差は、予想どおり1秒ではなく343秒になります。
ko: 현지 <code>23:54:07</code> 인 상하이에서 23:54:07 이었지만 5 분 52 초 후 다음 날 <code>00:00:00</code> 으로 돌아간 후 현지 표준시가 <code>23:54:08</code> 로 다시 변경되었습니다. . 그래서 두 시간 사이의 차이가 예상했던 것처럼 1 초가 아닌 343 초입니다.
ru: Когда в Шанхае было <code>23:54:07</code> по местному стандартному времени, но через 5 минут и 52 секунды оно перешло на следующий день в <code>00:00:00</code> , а затем местное стандартное время изменилось на <code>23:54:08</code> . , Вот почему разница между двумя значениями составляет 343 секунды, а не 1 секунду, как вы и ожидали.
zh_cn: 在上海，当地时间是当地标准时间 <code>23:54:07</code> ，但经过5分52秒后，它转到第二天的 <code>00:00:00</code> ，然后本地标准时间改回了 <code>23:54:08</code> 。 因此，这就是为什么两次之间的差是343秒而不是1秒，这正是您所期望的。

source: When local standard time was about to reach Sunday, 1. January 1928, 00:00:00 clocks were turned backward 0:05:52 hours to Saturday, 31. December 1927, 23:54:08 local standard time instead
es: Cuando la hora local estaba a punto de llegar al domingo 1 de enero de 1928,los relojes de las 00:00:00 se retrasaron 0:05:52 horas hasta el sábado 31.Diciembre de 1927,23:54:08 hora local en su lugar
ja: 現地標準時が1928年1月1日(日)になろうとしていた時、0時00分00秒の時計が0時05分52秒に逆戻りして31日(土)になりました。1927年12月、23:54:08現地標準時の代わりに
ko: 현지 표준시가 1 월 1 일 일요일에 도달하려고했을 때 1928 년 1 월 1 일 00:00:00 시계가 0:05:52 시간에서 0:05:52 시간으로 되돌아갔습니다.
ru: Когда местное стандартное время приближалось к воскресенью,1 января 1928 года,00:00:00 часы были повернуты назад с 0:05:52 часов до субботы,31.Декабрь 1927 года,23:54:08 по местному стандартному времени.
zh_cn: 1928年1月1日,00:00:00:00时,当地标准时间即将到达周日,1。1927年12月31日,当地标准时间23时54分08分

source: Why is <code>ld4-ld3</code> not <code>1</code> (as I would expect from the one-second difference in the times), but <code>353</code>?
es: &iquest;Por qu&eacute; <code>ld4-ld3</code> no es <code>1</code> (como esperar&iacute;a de la diferencia de un segundo en los tiempos), sino <code>353</code> ?
ja: なぜ <code>ld4-ld3</code> は <code>1</code> ではなく（時間の1秒の差から予想されるように）、 <code>353</code> ですか？
ko: 왜 <code>ld4-ld3</code> 이 <code>1</code> 이 아닌 (시간의 1 초 차이에서 예상되는 것처럼) <code>353</code> 입니까?
ru: Почему <code>ld4-ld3</code> не <code>1</code> (как я и ожидал бы из-за разницы во времени в одну секунду), а <code>353</code> ?
zh_cn: 为什么 <code>ld4-ld3</code> 不是 <code>1</code> （就像我从一秒的时间差中期望的那样），而是 <code>353</code> ？

source: Why is subtracting these two times (in 1927) giving a strange result
es: ¿Por qué restar estas dos veces (en 1927)da un resultado extraño
ja: なぜこの2回(1927年)を引くと変な結果になるのか?
ko: 왜 1927 년에이 두 번 빼는 것이 이상한 결과를 낳는가?
ru: Почему вычитание этих двух раз (в 1927 году)дает странный результат.
zh_cn: 为什么减去这两次(1927年)会得到一个奇怪的结果?

source: You can check whether the transition is an overlap where there's more than one valid offset for that date/time or a gap where that date/time is not valid for that zone id - by using the <code>isOverlap()</code> and <code>isGap()</code> methods on <code>zot4</code>.
es: Puede verificar si la transici&oacute;n es una superposici&oacute;n donde hay m&aacute;s de un desplazamiento v&aacute;lido para esa fecha / hora o una brecha donde esa fecha / hora no es v&aacute;lida para esa identificaci&oacute;n de zona, utilizando los <code>isOverlap()</code> e <code>isGap()</code> en <code>zot4</code> .
ja: <code>isGap()</code> メソッドとisGap（）メソッドを使用することにより、その日付/時刻に有効なオフセットが複数あるオーバーラップ、またはそのゾーンIDにその日付/時刻が無効であるギャップが遷移であるかどうかを確認できます。
ko: <code>isOverlap()</code> 에서 isOverlap () 및 <code>isGap()</code> 메소드를 사용하여 전환이 해당 날짜 / 시간에 대해 둘 이상의 유효한 오프셋이있는 겹침인지 또는 해당 영역 ID에 대해 해당 날짜 / 시간이 유효하지 않은 갭 <code>zot4</code> .
ru: Вы можете проверить, является ли переход перекрытием, где существует более одного действительного смещения для этой даты / времени, или промежутком, когда эта дата / время недопустима для идентификатора этой зоны - с помощью <code>isOverlap()</code> и <code>isGap()</code> на <code>zot4</code> ,
zh_cn: 您可以通过在 <code>isOverlap()</code> 使用isOverlap（）和 <code>isGap()</code> 方法来检查过渡是否是重叠的（对于该日期/时间有多个有效偏移量）还是空白（对于该区域ID而言该日期/时间无效） 。

source: You can see the same problem comparing <code>1927-12-31 23:59:59</code> with <code>1928-01-01 00:00:00</code>, though, in this case, it is the earlier offset that produces the longer divergence, and it is the earlier date that has two possible offsets.
es: Puede ver el mismo problema al comparar <code>1927-12-31 23:59:59</code> con <code>1928-01-01 00:00:00</code> , aunque, en este caso, es el desplazamiento anterior que produce la divergencia m&aacute;s larga, y es el fecha anterior que tiene dos posibles compensaciones.
ja: <code>1927-12-31 23:59:59</code> と <code>1928-01-01 00:00:00</code> を比較すると同じ問題が見られますが、この場合、より長い発散を生成するのはより早いオフセットであり、それは2つの可能なオフセットがある以前の日付。
ko: <code>1927-12-31 23:59:59</code> 와 <code>1928-01-01 00:00:00</code> 과 비교할 때 동일한 문제가 발생할 수 있지만이 경우 더 긴 분기를 생성하는 초기 오프셋이며 두 개의 가능한 오프셋이있는 이전 날짜.
ru: Вы можете увидеть ту же проблему, сравнивая <code>1927-12-31 23:59:59</code> с <code>1928-01-01 00:00:00</code> , хотя, в данном случае, более раннее смещение приводит к большей дивергенции, и это более ранняя дата, которая имеет два возможных смещения.
zh_cn: 您可以看到将 <code>1927-12-31 23:59:59</code> 与 <code>1928-01-01 00:00:00</code> 进行比较的相同问题，但是，在这种情况下，是较早的偏移量导致了更长的发散度，而正是有两个可能的偏移量的较早日期。

source: You've encountered a <a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">local time discontinuity</a>:
es: Ha encontrado una <a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">discontinuidad de hora local</a> :
ja: <a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">現地時間の不連続</a>が発生しました：
ko: <a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">현지 시간 불연속</a> 이 발생했습니다.
ru: Вы столкнулись с <a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">разрывом местного времени</a> :
zh_cn: 您遇到了<a href="http://timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">当地时间不连续性</a> ：

source: export LC_ALL=C TZ=UTC
es: exportación LC_ALL=C TZ=UTC
ja: エクスポート LC_ALL=C TZ=UTC
ko: 수출 LC_ALL = C TZ = UTC
ru: экспорт LC_ALL=C TZ=UTC

source: make localized methods not the default, but require the user to explicitly request localization.
es: hacen que los métodos de localización no sean los predeterminados,sino que requieren que el usuario solicite explícitamente la localización.
ja: ローカライズされたメソッドをデフォルトではなく、ユーザーが明示的にローカリゼーションを要求するようにします。
ko: 현지화 된 메소드를 기본값으로 설정하지 말고 사용자에게 명시 적으로 현지화를 요청해야합니다.
ru: делать локализованные методы не по умолчанию,а требовать от пользователя явного запроса локализации.
zh_cn: 使本地化方法不是默认的,而是要求用户明确要求本地化。

source: never use localized implementations unless absolutely necessary (ie for display only)
es: nunca utilice implementaciones localizadas a menos que sea absolutamente necesario (es decir,sólo para la visualización)
ja: どうしても必要な場合を除き、ローカライズされた実装を使用しないでください。
ko: 반드시 필요한 경우가 아니면 현지화 된 구현을 사용하지 마십시오 (예 : 디스플레이 전용).
ru: никогда не используйте локализованные реализации,если в этом нет абсолютной необходимости (т.е.только для отображения).
zh_cn: 绝不使用本地化的实现,除非万不得已(即仅用于显示)。

source: set your system clock to UTC
es: ajustar el reloj de su sistema a UTC
ja: システムクロックをUTCに設定します。
ko: 시스템 시계를 UTC로 설정
ru: установи свои системные часы на UTC
zh_cn: 将系统时钟设置为UTC

source: use UTF-8/UTC as the <em>FIXED</em> default instead because that's simply the default today. There is no reason to do something else, except if you want to produce threads like this.
es: use UTF-8 / UTC como el valor predeterminado <em>FIJO en su</em> lugar porque ese es simplemente el valor predeterminado hoy. No hay ninguna raz&oacute;n para hacer otra cosa, excepto si desea producir hilos como este.
ja: 代わりに、UTF-8 / UTCを<em>FIXEDの</em>デフォルトとして使用してください。 このようなスレッドを作成する場合を除いて、他に何かをする理由はありません。
ko: UTF-8 / UTC를 <em>FIXED</em> 기본값으로 대신 사용하십시오. 이것이 오늘날의 기본값이기 때문입니다. 이와 같은 스레드를 생성하려는 경우를 제외하고는 다른 작업을 수행 할 이유가 없습니다.
ru: вместо этого используйте UTF-8 / UTC в качестве <em>ИСПРАВЛЕННОГО</em> значения по умолчанию, потому что сегодня это просто значение по умолчанию. Нет причин делать что-то еще, кроме случаев, когда вы хотите создавать такие потоки.
zh_cn: 请改用UTF-8 / UTC作为<em>FIXED</em>默认值，因为这只是今天的默认值。 除了要生成这样的线程外，没有其他理由。
