Repository: rueisnom/feedback
Catalog: xlf/68/41/33/3/6841333.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6</a> two years ago, and in <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> just recently in <a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">update 25</a>.
es: <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6 hace</a> dos a&ntilde;os, y en <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> recientemente en la <a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">actualizaci&oacute;n 25</a> .
ja: 2年前の<a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6</a> 、および最近の<a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">アップデート25の</a> <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> 。
ko: <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6</a> 2 년 전, <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> 에서 최근 <a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">업데이트 25</a> .
ru: <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6</a> два года назад, а в <a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> совсем недавно в <a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">обновлении 25</a> .
zh_cn: 两年前的<a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_6_.28December_11.2C_2006.29">JDK 6</a> ，以及最近在<a href="https://en.wikipedia.org/wiki/Java_version_history#cite_note-131">更新25</a>中的<a href="https://en.wikipedia.org/wiki/Java_version_history#Java_SE_7_.28July_28.2C_2011.29">JDK 7</a> 。

source: <strong>EDIT:</strong> History has changed again...
es: <strong>EDITAR: la</strong> historia ha cambiado de nuevo ...
ja: <strong>編集：</strong>歴史は再び変わりました...
ko: <strong>편집 :</strong> 역사가 다시 변경되었습니다 ...
ru: <strong>РЕДАКТИРОВАТЬ:</strong> История снова изменилась ...
zh_cn: <strong>编辑：</strong>历史再次改变了...

source: <strong>EDIT:</strong> Stop press! History changes...
es: <strong>EDITAR: &iexcl;</strong> Deja de presionar! La historia cambia ...
ja: <strong>編集：</strong>プレスを止めて！ 歴史の変化...
ko: <strong>편집 :</strong> 보도 중지! 역사 변경 ...
ru: <strong>РЕДАКТИРОВАТЬ:</strong> Стоп нажмите! История меняется ...
zh_cn: <strong>编辑：</strong>停止按！ 历史发生变化...

source: <strong>EDIT:</strong> To answer a question around a transition at 1900... it looks like the Java timezone implementation treats <em>all</em> time zones as simply being in their standard time for any instant before the start of 1900 UTC:
es: <strong>EDITAR:</strong> Para responder una pregunta sobre una transici&oacute;n en 1900 ... parece que la implementaci&oacute;n de la zona horaria de Java trata <em>todas las</em> zonas horarias como si estuvieran simplemente en su hora est&aacute;ndar durante cualquier instante antes del comienzo de las 1900 UTC:
ja: <strong>編集：</strong> 1900年の移行に関する質問に答えるために... Javaタイムゾーン実装は<em>すべての</em>タイムゾーンを1900 UTCの開始前の任意の瞬間の標準時間にあるものとして扱うように見えます：
ko: <strong>편집 :</strong> 1900에서 전환에 관한 질문에 대답하기 위해 ... Java 시간대 구현은 <em>모든</em> 시간대를 단순히 1900 UTC가 시작되기 전에 모든 표준 시간대로 처리하는 것처럼 보입니다.
ru: <strong>РЕДАКТИРОВАТЬ:</strong> Чтобы ответить на вопрос о переходе в 1900 году ... похоже, что реализация часового пояса Java обрабатывает <em>все</em> часовые пояса как просто в их стандартное время в любой момент до начала 1900 UTC:
zh_cn: <strong>编辑：</strong>要回答有关1900年过渡的问题...似乎Java时区实现将<em>所有</em>时区都视为在1900 UTC开始之前的任何时刻都处于其标准时间内：

source: <strong>It's better to use UTC where time doesn't change unless if needed to use non-UTC time like in display.</strong>
es: <strong>Es mejor usar UTC donde el tiempo no cambia a menos que sea necesario usar un tiempo que no sea UTC como en la pantalla.</strong>
ja: <strong>表示のように非UTC時間を使用する必要がない限り、時間が変更されない場所でUTCを使用することをお勧めします。</strong>
ko: <strong>UTC가 아닌 시간을 디스플레이와 같이 사용해야하는 경우가 아니라면 시간이 변경되지 않는 UTC를 사용하는 것이 좋습니다.</strong>
ru: <strong>Лучше использовать UTC, где время не меняется, если только не нужно использовать время не UTC, как на дисплее.</strong>
zh_cn: <strong>最好在不改变时间的情况下使用UTC，除非需要使用非UTC时间（如在显示中）。</strong>

source: <strong>Java version:</strong>
es: <strong>Versi&oacute;n de Java:</strong>
ja: <strong>Javaバージョン：</strong>
ko: <strong>자바 버전 :</strong>
ru: <strong>Версия Java:</strong>
zh_cn: <strong>Java版本：</strong>

source: <strong>The output is:</strong>
es: <strong>El resultado es:</strong>
ja: <strong>出力は次のとおりです。</strong>
ko: <strong>출력은 다음과 같습니다.</strong>
ru: <strong>Выход:</strong>
zh_cn: <strong>输出为：</strong>

source: Also, these two offsets are the same:
es: Además,estas dos compensaciones son las mismas:
ja: また、この2つのオフセットも同じです。
ko: 또한이 두 오프셋은 동일합니다.
ru: Кроме того,эти два смещения одинаковы:
zh_cn: 另外,这两个偏移量是一样的。

source: And then see that the result is:
es: Y luego ver que el resultado es:
ja: そして、その結果を見てください。
ko: 그리고 결과는 다음과 같습니다.
ru: А потом посмотрим,что получится:
zh_cn: 然后看到的结果是。

source: Another way to approach this is to check whether there's a transition going on. We can do this like this:
es: Otra forma de enfocar esto es comprobar si hay una transición en curso.Podemos hacer esto así:
ja: もう一つのアプローチ方法は、移行が行われているかどうかを確認することです。このようにすることができます
ko: 이에 접근하는 또 다른 방법은 전환이 진행 중인지 확인하는 것입니다. 우리는 이렇게 할 수 있습니다 :
ru: Другой способ подойти к этому-проверить,происходит ли переход.Мы можем сделать это вот так:
zh_cn: 另一种方法是检查是否有过渡的情况发生。我们可以这样做。

source: As explained by others, there's a time discontinuity there. There are two possible timezone offsets for <code>1927-12-31 23:54:08</code> at <code>Asia/Shanghai</code>, but only one offset for <code>1927-12-31 23:54:07</code>. So, depending on which offset is used, there's either a one second difference or a 5 minutes and 53 seconds difference.
es: Como explicaron otros, hay una discontinuidad de tiempo all&iacute;. Hay dos posibles compensaciones de zona horaria para <code>1927-12-31 23:54:08</code> en <code>Asia/Shanghai</code> , pero solo una compensaci&oacute;n para <code>1927-12-31 23:54:07</code> . Entonces, dependiendo de qu&eacute; desplazamiento se use, hay una diferencia de un segundo o una diferencia de 5 minutos y 53 segundos.
ja: 他の人が説明したように、そこには時間の不連続があります。 <code>1927-12-31 23:54:08</code> の <code>Asia/Shanghai</code> では2つのタイムゾーンオフセットがありますが、 <code>1927-12-31 23:54:07</code> のオフセットは1つだけです。 したがって、使用されるオフセットに応じて、1秒の差または5分53秒の差があります。
ko: 다른 사람들이 설명했듯이 시간 불연속이 있습니다. <code>Asia/Shanghai</code> 에서는 <code>1927-12-31 23:54:08</code> 에 대해 두 개의 가능한 시간대 오프셋이 있지만 <code>1927-12-31 23:54:07</code> 에 대해서는 하나의 오프셋 만 있습니다. 따라서 어떤 오프셋이 사용되는지에 따라 1 초 차이 또는 5 분 53 초 차이가 있습니다.
ru: Как объяснили другие, там есть временной разрыв. Существует два возможных смещения <code>1927-12-31 23:54:08</code> для 1927-12-31 23:54:08 в <code>Asia/Shanghai</code> , но только одно смещение для <code>1927-12-31 23:54:07</code> . Таким образом, в зависимости от того, какое смещение используется, разница составляет либо одну секунду, либо разницу 5 и 53 секунды.
zh_cn: 正如其他人解释的那样，那里存在时间不连续性。 <code>Asia/Shanghai</code> 对于 <code>1927-12-31 23:54:08</code> 有两种可能的时区偏移，但是对于 <code>1927-12-31 23:54:07</code> 只有一种偏移。 因此，根据使用的偏移量，可能会有一秒的差异或5分53秒的差异。

source: As others said, it's a time change in 1927 in Shanghai.
es: Como otros dijeron,es un cambio de tiempo en 1927 en Shanghai.
ja: 他の方もおっしゃっていますが、上海では1927年のタイムチェンジです。
ko: 다른 사람들이 말했듯이 1927 년 상하이에서 시간이 바뀌 었습니다.
ru: Как говорили другие,в 1927 году в Шанхае время изменилось.
zh_cn: 正如别人所说,1927年的上海,是一个时代的变化。

source: But there is something different about these two time changes. The latter changes continuously and the former was just a change. It didn't change back or change again by the same amount.
es: Pero hay algo diferente en estos dos cambios de tiempo.El último cambia continuamente y el primero fue sólo un cambio.No volvió a cambiar ni volvió a cambiar en la misma cantidad.
ja: しかし、この二つの時間の変化には何か違うものがあります。後者は連続的に変化し、前者は変化しただけ。同じ量だけ戻ったり、また変わったりするわけではなかった。
ko: 그러나이 두 시간 변화에는 다른 점이 있습니다. 후자는 지속적으로 변화하고 전자는 단지 변화 일뿐입니다. 같은 양만큼 변경되거나 다시 변경되지 않았습니다.
ru: Но есть кое-что другое в этих двух временных изменениях.Последнее меняется постоянно,и первое было просто изменением.Оно не меняется обратно и не меняется снова на ту же самую величину.
zh_cn: 但这两个时间的变化,却又有不同的地方。后者是不断的变化,而前者只是一个变化。没有变回来,也没有变回去,也没有变回来,也没有再变回来。

source: But these two are different:
es: Pero estos dos son diferentes:
ja: しかし、この二つは違う。
ko: 그러나이 두 가지는 다릅니다.
ru: Но эти двое разные:
zh_cn: 但是,这两个是不一样的。

source: I hope this helps people handle this sort of issue once Java 8 becomes widely available, or to those using Java 7 who adopt the JSR 310 backport.
es: Espero que esto ayude a la gente a manejar este tipo de problemas una vez que Java 8 esté ampliamente disponible,o para aquellos que usan Java 7 que adopten el backport JSR 310.
ja: Java 8が広く利用できるようになってから、あるいはJava 7を使っている人でJSR 310のバックポートを採用している人たちが、このような問題に対処できるようになることを願っています。
ko: Java 8이 널리 사용 가능해 지거나 JSR 310 백 포트를 채택한 Java 7을 사용하는 사람들이 이런 종류의 문제를 처리하는 데 도움이되기를 바랍니다.
ru: Надеюсь,это поможет людям справиться с подобной проблемой после того,как Java 8 станет широко доступной,или тем,кто использует Java 7,кто принимает бэкпорт JSR 310.
zh_cn: 我希望在Java 8普及之后,或者是对那些采用JSR 310后端的Java 7的人来说,希望这能帮助人们处理这类问题。

source: I mean, come on, aren't global static variables an anti-OO pattern? Nothing else is those pervasive defaults given by some rudimentary environment variables.......
es: Quiero decir,vamos,¿no son las variables estáticas globales un patrón anti-OO? Nada más son esos valores por defecto generalizados dados por algunas variables de entorno rudimentarias......
ja: つまり、グローバルな静的変数は反OOパターンではないのでしょうか?いくつかの初歩的な環境変数によって与えられるそれらの広汎なデフォルト以外の何ものでもない......。
ko: 전역 정적 변수가 anti-OO 패턴이 아닙니까? 다른 기본 환경 변수에 의해 제공되는 광범위한 기본값은 없습니다.
ru: Да ладно,разве глобальные статические переменные не являются анти-OO шаблоном? Ничто другое не является теми повсеместными значениями по умолчанию,которые даны некоторыми рудиментарными переменными окружения.............
zh_cn: 我是说,拜托,全局静态变量不就是反OO的模式吗?别的不说,就是那些无孔不入的默认值由一些简陋的环境变量给出的...........。

source: I only noticed this because I'm collecting questions like this in Noda Time, in the form of <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">unit tests</a>... The test has now been changed, but it just goes to show - not even historical data is safe.
es: Solo me di cuenta de esto porque estoy recopilando preguntas como esta en Noda Time, en forma de <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">pruebas unitarias</a> ... La prueba ahora se ha cambiado, pero solo demuestra que ni siquiera los datos hist&oacute;ricos son seguros.
ja: 野田タイムで<a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">ユニットテスト</a>の形でこのような質問を収集しているので、私はこれに気づきました...テストは変更されましたが、表示されるだけです-履歴データでさえ安全ではありません。
ko: <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">단위 테스트</a> 형태로 Noda Time에서 이와 같은 질문을 수집하기 때문에이 사실을 알았습니다 ... 테스트가 이제 변경되었지만 표시됩니다. 이력 데이터조차도 안전하지 않습니다.
ru: Я заметил это только потому, что собираю подобные вопросы в Noda Time в форме <a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">модульных тестов</a> ... Тест теперь изменен, но он просто показывает, что даже исторические данные не являются безопасными.
zh_cn: 我之所以注意到这一点，是因为我在Noda Time以<a href="https://github.com/nodatime/nodatime/blob/master/src/NodaTime.Demo/StackOverflowExamples.cs#L68">单元测试</a>的形式收集了类似的问题&hellip;&hellip;测试现已更改，但这只是显示出来-甚至历史数据也不是安全的。

source: I'm sorry to say, but the time discontinuity has moved a bit in
es: Siento decirlo,pero la discontinuidad temporal se ha movido un poco en
ja: で時間の不連続性が少し動いてしまいました。
ko: 죄송 합니다만 시간 불연속이 약간 바뀌 었습니다.
ru: Мне жаль говорить,но перерыв во времени немного сдвинулся с мертвой точки.
zh_cn: 很抱歉,时间的不连续性有点移动了。

source: IMHO the pervasive, <em>implicit</em> localization in Java is its single largest design flaw. It may be intended for user interfaces, but frankly, who really uses Java for user interfaces today except for some IDEs where you can basically ignore localization because programmers aren't exactly the target audience for it. You can fix it (especially on Linux servers) by:
es: En mi humilde opini&oacute;n, la localizaci&oacute;n generalizada e <em>impl&iacute;cita</em> en Java es su defecto de dise&ntilde;o m&aacute;s grande. Puede estar destinado a interfaces de usuario, pero, francamente, qui&eacute;n realmente usa Java para interfaces de usuario hoy en d&iacute;a, excepto algunos IDE donde b&aacute;sicamente puede ignorar la localizaci&oacute;n porque los programadores no son exactamente el p&uacute;blico objetivo para ella. Puede solucionarlo (especialmente en servidores Linux):
ja: 私見Javaでの広く<em>暗黙的な</em>ローカリゼーションは、その単一の最大の設計上の欠陥です。 それはユーザーインターフェースを対象としている可能性がありますが、率直に言って、プログラマーが正確に対象ユーザーではないため、ローカリゼーションを基本的に無視できる一部のIDEを除き、ユーザーインターフェースにJavaを実際に使用します。 あなたはそれを（特にLinuxサーバーで）修正することができます：
ko: Java에서 널리 사용되는 <em>암시 적</em> 현지화는 단일 설계상의 가장 큰 결함입니다. 사용자 인터페이스를위한 것일 수도 있지만, 솔직히 말해서 프로그래머가 타겟 대상이 아니기 때문에 기본적으로 현지화를 무시할 수있는 일부 IDE를 제외하고 오늘날 사용자 인터페이스에 Java를 실제로 사용하는 사용자는 있습니다. 다음과 같은 방법으로 (특히 Linux 서버에서) 수정할 수 있습니다.
ru: ИМХО, повсеместная, <em>неявная</em> локализация в Java - это ее самый большой недостаток дизайна. Это может быть предназначено для пользовательских интерфейсов, но, честно говоря, кто действительно использует Java для пользовательских интерфейсов сегодня, за исключением некоторых IDE, где вы можете в основном игнорировать локализацию, потому что программисты не являются целевой аудиторией для нее. Вы можете исправить это (особенно на серверах Linux):
zh_cn: 恕我直言，Java中普遍存在的<em>隐式</em>本地化是其最大的设计缺陷。 它可能是为用户界面设计的，但是坦率地说，今天的人真正将Java用于用户界面，除了一些IDE之外，您基本上可以忽略本地化，因为程序员并不完全是本地化的。 您可以通过以下方式修复（尤其是在Linux服务器上）：

source: If I change the dates to times 1 second later:
es: Si cambio las fechas a veces 1 segundo después:
ja: 日付を1秒後の時間帯に変更すると
ko: 1 초 후에 날짜를 시간으로 변경하면 :
ru: Если я изменю даты на 1 секунду позже:
zh_cn: 如果我把日期改成了1秒后的时间。

source: If I run the following program, which parses two date strings referencing times 1 second apart and compares them:
es: Si ejecuto el siguiente programa,que analiza dos cadenas de fechas referidas a tiempos de 1 segundo de diferencia y las compara:
ja: 以下のプログラムを実行すると、1秒間隔で時刻を参照している2つの日付文字列を解析して比較します。
ko: 다음 프로그램을 실행하면 시간을 1 초 간격으로 참조하는 두 개의 날짜 문자열을 구문 분석하고 비교합니다.
ru: Если я запущу следующую программу,которая разбирает две строки даты с интервалом в 1 секунду и сравнивает их:
zh_cn: 如果我运行以下程序,解析两个相隔1秒的日期字符串,并对它们进行比较。

source: If you can not display a date or time in UTC, always indicate the time-zone.
es: Si no puede mostrar la fecha o la hora en UTC,indique siempre la zona horaria.
ja: 日付や時間をUTCで表示できない場合は、常にタイムゾーンを表示してください。
ko: 날짜 나 시간을 UTC로 표시 할 수없는 경우 항상 시간대를 표시하십시오.
ru: Если вы не можете отобразить дату или время в UTC,всегда указывайте часовой пояс.
zh_cn: 如果不能以UTC显示日期或时间,请务必注明时区。

source: If you can not require an input date/time in UTC, require an explicitly indicated time-zone.
es: Si no puede requerir una fecha y hora de entrada en UTC,requiera una zona horaria explícitamente indicada.
ja: UTCでの入力を要求できない場合は、タイムゾーンを明示的に指定する必要があります。
ko: UTC로 입력 날짜 / 시간을 요구할 수없는 경우 명시 적으로 표시된 시간대를 요구하십시오.
ru: Если вы не можете потребовать ввода даты в UTC,потребовать явно указанный часовой пояс.
zh_cn: 如果你不能要求输入的日期时间是UTC,那就要求明确指定一个时区。

source: If you converted to UTC, add each second, and convert to local time for display. You would go through 11:54:08 p.m. <a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT</a> - 11:59:59 p.m. LMT and then 11:54:08 p.m. <a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CST</a> - 11:59:59 p.m. CST.
es: Si se convirti&oacute; a UTC, agregue cada segundo y convi&eacute;rtalo a la hora local para mostrarlo. Debes pasar por las 11:54:08 pm <a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT</a> - 11:59:59 pm LMT y luego 11:54:08 pm <a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CST</a> - 11:59:59 pm CST.
ja: UTCに変換した場合は、1秒ごとに追加し、現地時間に変換して表示します。 午後11:54:08午後LMT-午後11:59:59午後<a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT</a>を通過し、午後11:54:08午後CST-午後11:59:59午後<a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CSTを</a>通過します。
ko: UTC로 변환 한 경우 1 초마다 추가하고 표시 할 현지 시간으로 변환하십시오. <a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT</a> 오후 11:54:08 (오후 LMT -11:59:59), LST 오후 11:54:08 ( <a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CST</a> -11:59:59) CST 를 거칩니다.
ru: Если вы конвертировали в UTC, добавляйте каждую секунду и переводите в местное время для отображения. Вы должны пройти до 23:54:08 вечера <a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT</a> - 11:59:59 вечера LMT, а затем 11:54:08 вечера <a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CST</a> - 11:59:59 вечера CST.
zh_cn: 如果您转换为UTC，则每秒添加一次，然后转换为本地时间进行显示。 您将经历<a href="http://en.wikipedia.org/wiki/Local_mean_time">LMT的</a> 11:54:08 pm-LMT的11:59:59 pm，然后经历<a href="http://en.wikipedia.org/wiki/Central_Time_Zone_%28North_America%29">CST的</a> 11:54:08 pm- CST的 11:59:59 pm。

source: In TZDB 2014f, the time of the change has moved to 1900-12-31, and it's now a mere 343 second change (so the time between <code>t</code> and <code>t+1</code> is 344 seconds, if you see what I mean).
es: En TZDB 2014f, el tiempo del cambio se ha movido a 1900-12-31, y ahora es solo un cambio de 343 segundos (por lo que el tiempo entre <code>t</code> y <code>t+1</code> es 344 segundos, si entiendes lo que quiero decir).
ja: TZDB 2014fでは、変更の時間は1900-12-31に移動し、現在は343秒の変更にすぎません（つまり、 <code>t</code> と <code>t+1</code> の間の時間は344秒です。
ko: TZDB 2014f에서 변경 시간은 1900-12-31로 이동했으며 이제는 343 초에 불과합니다 (따라서 <code>t</code> 와 <code>t+1</code> 사이의 시간은 344 초입니다.
ru: В TZDB 2014f время изменения сместилось на 1900-12-31, и теперь это всего лишь 343 секунды (так что время между <code>t</code> и <code>t+1</code> составляет 344 секунды, если вы понимаете, что я имею в виду).
zh_cn: 在TZDB 2014f中，更改时间已移至1900-12-31，现在仅更改了343秒（因此，如果您明白我的意思，那么 <code>t</code> 和 <code>t+1</code> 之间的时间为344秒）。

source: Instead of converting each date, you can use the following code:
es: En lugar de convertir cada fecha,puedes usar el siguiente código:
ja: それぞれの日付を変換するのではなく、以下のコードを使用します。
ko: 각 날짜를 변환하는 대신 다음 코드를 사용할 수 있습니다.
ru: Вместо того,чтобы преобразовывать каждую дату,можно использовать следующий код:
zh_cn: 可以用下面的代码来代替每个日期的转换。

source: It's a time zone change on December 31st in Shanghai.
es: Es un cambio de zona horaria el 31 de diciembre en Shanghai.
ja: 12月31日の上海での時間帯変更です。
ko: 12 월 31 일 상하이에서 시간대가 변경되었습니다.
ru: Смена часового пояса 31 декабря в Шанхае.
zh_cn: 这是12月31日上海的时区变化。

source: Just another episode in the often weird and wonderful world of time zones.
es: Sólo otro episodio en el a menudo extraño y maravilloso mundo de los husos horarios.
ja: 奇妙で素晴らしい時間帯の世界での別のエピソードです。
ko: 종종 이상하고 멋진 시간대의 세계에서 또 다른 에피소드.
ru: Просто еще один эпизод в часто странном и удивительном мире часовых поясов.
zh_cn: 只是在这个时区的世界里又发生了一幕。

source: Lesson to learn: avoid non-UTC times at all costs, except maybe for display.
es: Lección a aprender:evitar los horarios no comerciales a toda costa,excepto tal vez para la exhibición.
ja: 学ぶべき教訓:表示のために多分を除いて、何としてもUTC以外の時間を避けること。
ko: 배우는 교훈 : 디스플레이를 제외하고 모든 비용으로 비 UTC 시간을 피하십시오.
ru: Урок,который нужно усвоить:любой ценой избегайте нестандартного времени,за исключением,возможно,показа.
zh_cn: 教训:不惜一切代价避免非UTC时间,除非可能是为了展示,否则不惜一切代价。

source: Note that the 2013a update of the timezone database moved this discontinuity a few seconds earlier, but the effect would still be observable.
es: Obsérvese que la actualización de 2013a de la base de datos de zonas horarias movió esta discontinuidad unos segundos antes,pero el efecto seguiría siendo observable.
ja: タイムゾーンデータベースの2013aアップデートでは、この不連続性が数秒前に移動していますが、その効果はまだ観測可能です。
ko: 시간대 데이터베이스의 2013a 업데이트는이 불연속을 몇 초 전에 옮겼지만 그 효과는 여전히 관찰 가능합니다.
ru: Обратите внимание,что обновление базы данных часовых поясов 2013a перенесло это прерывание на несколько секунд раньше,но эффект все равно будет заметен.
zh_cn: 请注意,2013年a时区数据库的更新将这一不连续性提前了几秒,但仍然可以观察到效果。

source: See <a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">this page</a> for details of 1927 in Shanghai. Basically at midnight at the end of 1927, the clocks went back 5 minutes and 52 seconds. So "1927-12-31 23:54:08" actually happened twice, and it looks like Java is parsing it as the <em>later</em> possible instant for that local date/time - hence the difference.
es: Vea <a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">esta p&aacute;gina</a> para detalles de 1927 en Shanghai. B&aacute;sicamente, a medianoche a fines de 1927, los relojes retrocedieron 5 minutos y 52 segundos. Entonces "1927-12-31 23:54:08" en realidad sucedi&oacute; dos veces, y parece que Java lo analiza como el <em>&uacute;ltimo</em> instante posible para esa fecha / hora local, de ah&iacute; la diferencia.
ja: 1927年の上海の詳細については、 <a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">このページ</a>を参照してください 。 基本的に1927年の終わりの真夜中に、時計は5分52秒戻りました。 したがって、「1927-12-31 23:54:08」は実際には2回発生し、Javaはそれをローカル日付/時刻の可能な最も<em>遅い</em>瞬間として解析しているように見えます-したがって、違いです。
ko: 1927 년 상하이에 대한 자세한 내용은 <a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">이 페이지</a> 를 참조하십시오. 기본적으로 1927 년 말 자정에 시계는 5 분 52 초로 되돌아갔습니다. 따라서 "1927-12-31 23:54:08"은 실제로 두 번 발생했으며 Java가 현지 날짜 / 시간에 대해 <em>나중에</em> 가능한 순간으로 구문 분석하는 것처럼 보이므로 차이가 있습니다.
ru: Смотрите <a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">эту страницу</a> для деталей 1927 года в Шанхае. В основном в полночь в конце 1927 года часы вернулись на 5 минут и 52 секунды. Таким образом, &laquo;1927-12-31 23:54:08&raquo; действительно происходило дважды, и похоже, что Java анализирует его как более <em>поздний</em> возможный момент для этой локальной даты / времени - отсюда и разница.
zh_cn: 有关1927年上海的详细信息，请参<a href="http://www.timeanddate.com/worldclock/clockchange.html?n=237&amp;year=1927">见此页</a> 。 基本上在1927年底的午夜，时钟回到了5分52秒。 因此，&ldquo; 1927-12-31 23:54:08&rdquo;实际上发生了两次，看起来Java正在将其解析为该本地日期/时间的<em>稍后</em>可能时刻，因此有所不同。
