Repository: rueisnom/feedback
Catalog: xlf/14/18/79/63/14187963.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This blog (by another writer) provides an alternate, but similar, <a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">example</a>.
es: Este blog (de otro escritor) proporciona un <a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">ejemplo</a> alternativo, pero similar.
ja: このブログ（別のライターによる）は、代替の類似した<a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">例を</a>提供しています。
ko: 이 블로그 (다른 작가의)는 대안이지만 유사한 <a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">예제를 제공</a> 합니다.
ru: Этот блог (другого автора) предоставляет альтернативный, но похожий <a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">пример</a> .
zh_cn: 该博客（由另一位作者撰写）提供了一个替代<a href="https://web.archive.org/web/20160612045146/http://ed4becky.net/homepage/javafx-from-the-trenches-singleton-controllers/">示例</a> ，但类似。

source: This is a very simple demonstration and could surely stand for some improvement, but should make the concept very clear.
es: Esta es una demostración muy simple y seguramente podría significar alguna mejora,pero debería dejar el concepto muy claro.
ja: これは非常にシンプルなデモンストレーションであり、確かに何らかの改善のために立つことができますが、コンセプトを非常に明確にする必要があります。
ko: 이것은 매우 간단한 시연이며 일부 개선의 여지가 있지만 개념을 매우 명확하게 만들어야합니다.
ru: Это очень простая демонстрация и,безусловно,может означать некоторое улучшение,но она должна сделать концепцию очень четкой.
zh_cn: 这是一个非常简单的演示,肯定可以站在一些改进,但应该让概念非常清晰。

source: This method is exemplified by Sergey's answer to <a href="https://stackoverflow.com/a/10136403/1155209">Javafx 2.0 How-to Application.getParameters() in a Controller.java file</a>.
es: Este m&eacute;todo se ejemplifica con la respuesta de Sergey a <a href="https://stackoverflow.com/a/10136403/1155209">Javafx 2.0 How-to Application.getParameters () en un archivo Controller.java</a> .
ja: このメソッドは<a href="https://stackoverflow.com/a/10136403/1155209">、Controller.javaファイルのJavafx 2.0 How-to Application.getParameters（）</a>に対するSergeyの回答に例示されています 。
ko: 이 메소드는 <a href="https://stackoverflow.com/a/10136403/1155209">Controller.java 파일의 Javafx 2.0 How-to Application.getParameters ()에 대한</a> Sergey의 답변으로 예시됩니다.
ru: Этот метод иллюстрируется ответом Сергея на <a href="https://stackoverflow.com/a/10136403/1155209">Javafx 2.0 How-to Application.getParameters () в файле Controller.java</a> .
zh_cn: 该方法以Sergey对<a href="https://stackoverflow.com/a/10136403/1155209">Controller.java文件中的Javafx 2.0 How-to Application.getParameters（）</a>的回答为例 。

source: Upon entering text in the second scene's <code>TextField</code> and clicking its <code>Button</code>, the first scene's <code>Label</code> is updated to show the entered text.
es: Al ingresar texto en el <code>TextField</code> de la segunda escena y hacer clic en su <code>Button</code> , la <code>Label</code> la primera escena se actualiza para mostrar el texto ingresado.
ja: 2番目のシーンの <code>TextField</code> にテキストを入力してその <code>Button</code> をクリックすると、最初のシーンの <code>Label</code> が更新され、入力したテキストが表示されます。
ko: 두 번째 장면의 <code>TextField</code> 에 텍스트를 입력하고 <code>Button</code> 을 클릭하면 첫 번째 장면의 <code>Label</code> 이 업데이트되어 입력 한 텍스트가 표시됩니다.
ru: После ввода текста в поле <code>TextField</code> второй сцены и нажатия его <code>Button</code> <code>Label</code> первой сцены обновляется для отображения введенного текста.
zh_cn: 在第二个场景的 <code>TextField</code> 中输入文本并单击其 <code>Button</code> 后 ，第一个场景的 <code>Label</code> 将更新以显示输入的文本。

source: We said three because we will navigate between three (window, form or page) and use the concept of static variables to pass data around the (window, form or page)
es: Dijimos tres porque navegaremos entre tres (ventana,formulario o página)y usaremos el concepto de variables estáticas para pasar datos alrededor de la (ventana,formulario o página)
ja: 3つと言ったのは、3つの(ウィンドウ、フォーム、ページ)の間を移動し、静的変数の概念を使用してデータを渡すからです。
ko: 우리는 3 개 (윈도우, 폼 또는 페이지) 사이를 탐색하고 정적 변수 개념을 사용하여 (윈도우, 폼 또는 페이지) 주위에 데이터를 전달하기 때문에 3이라고 말했습니다.
ru: Мы сказали три,потому что мы будем перемещаться между тремя (окно,форма или страница)и использовать концепцию статических переменных для передачи данных вокруг (окно,форма или страница)
zh_cn: 我们说三个,是因为我们将在三个(窗口、表单或页面)之间进行导航,并使用静态变量的概念,在(窗口、表单或页面)周围传递数据。

source: We will also include some decision making code while we navigate
es: También incluiremos algún código de toma de decisiones mientras navegamos
ja: また、ナビゲートしながら意思決定コードをいくつか入れていきます。
ko: 탐색하는 동안 의사 결정 코드도 포함시킬 것입니다
ru: Мы также включим код для принятия решений во время навигации.
zh_cn: 我们在导航的同时,还将包括一些决策代码,我们也将包括一些决策代码。

source: Which you could use to add your info to the Node.
es: Que podrías usar para añadir tu información al Nodo.
ja: これは、あなたの情報をノードに追加するために使用することができます。
ko: 노드에 정보를 추가하는 데 사용할 수 있습니다.
ru: Который вы можете использовать для добавления вашей информации в Узел.
zh_cn: 你可以用它将你的信息添加到Node中。

source: While most of the answers here provide good to excellent examples how to accomplish this we thought we would kick it up a notch or two or three
es: Mientras que la mayoría de las respuestas aquí proporcionan buenos o excelentes ejemplos de cómo lograr esto,pensamos que podríamos subir un nivel o dos o tres...
ja: ここにある回答のほとんどは、これを達成するための良い例から優れた例を提供していますが、私たちはそれを1つ、2つ、または3つ蹴り上げようと考えました。
ko: 여기에있는 대부분의 답변은이를 달성하는 방법에 대한 훌륭한 예를 제공하지만 우리는 그것을 한두 가지로 삼을 것이라고 생각했습니다.
ru: В то время как большинство ответов здесь дают хорошие и отличные примеры того,как это сделать,мы думали,что поднимем его на ступеньку,на два или три.
zh_cn: 虽然这里的大多数答案都提供了很好的或优秀的例子,但我们认为我们要把它提高一个或两个或三个档次。

source: Why answer a 6 year old question ?
es: ¿Por qué responder a una pregunta de hace 6 años?
ja: なぜ6歳の質問に答えるのか?
ko: 왜 6 살짜리 질문에 대답합니까?
ru: Зачем отвечать на вопрос 6-летней давности?
zh_cn: 为什么回答一个6岁的问题?

source: Within the second scene, there is also a <code>TextField</code>, a <code>Button</code>, and a <code>Label</code>. The <code>Label</code> will display the text entered in the <code>TextField</code> on the first scene.
es: Dentro de la segunda escena, tambi&eacute;n hay un <code>TextField</code> , un <code>Button</code> y una <code>Label</code> . La <code>Label</code> mostrar&aacute; el texto ingresado en el <code>TextField</code> en la primera escena.
ja: 2番目のシーン内には、 <code>TextField</code> 、 <code>Button</code> 、および <code>Label</code> もあります。 <code>Label</code> は、最初のシーンの <code>TextField</code> に入力されたテキストを表示します。
ko: 두 번째 장면에는 <code>TextField</code> , <code>Button</code> 및 <code>Label</code> 도 있습니다. <code>Label</code> 은 첫 번째 장면에서 <code>TextField</code> 에 입력 한 텍스트를 표시합니다.
ru: Во второй сцене также есть <code>TextField</code> , <code>Button</code> и <code>Label</code> . <code>Label</code> будет отображать текст, введенный в <code>TextField</code> на первой сцене.
zh_cn: 在第二个场景内，还有一个 <code>TextField</code> ，一个 <code>Button</code> 和一个 <code>Label</code> 。 <code>Label</code> 将在第一个场景中显示在 <code>TextField</code> 中输入的文本。

source: Yes you can.
es: Sí que puedes.
ja: そうだな
ko: 그래 넌 할수있어.
ru: Да,можешь.
zh_cn: 是的,你可以的

source: You can construct a new controller in code, passing any parameters you want from your caller into the controller constructor. Once you have constructed a controller, you can set it on an FXMLLoader instance <em>before</em> you invoke the <code>load()</code><em>instance</em> method.
es: Puede construir un nuevo controlador en c&oacute;digo, pasando los par&aacute;metros que desee de su llamador al constructor del controlador. Una vez que haya construido un controlador, puede configurarlo en una instancia de FXMLLoader <em>antes de</em> invocar el m&eacute;todo de <em>instancia</em> <code>load()</code> .
ja: コードで新しいコントローラーを作成し、必要なパラメーターを呼び出し元からコントローラーコンストラクターに渡すことができます。 コントローラを作成したら、 <code>load()</code> <em>インスタンス</em>メソッドを呼び出す<em>前</em>に、FXMLLoaderインスタンス<em>に</em>コントローラを設定でき<em>ます</em> 。
ko: 호출자에서 원하는 매개 변수를 컨트롤러 생성자로 전달하여 코드로 새 컨트롤러를 구성 할 수 있습니다. 컨트롤러를 구성한 후에는 <code>load()</code> <em>인스턴스</em> 메서드를 호출 <em>하기 전에</em> FXMLLoader 인스턴스에서 컨트롤러를 설정할 수 있습니다.
ru: Вы можете создать новый контроллер в коде, передавая любые параметры из вызывающей программы в конструктор контроллера. Создав контроллер, вы можете установить его на экземпляр FXMLLoader, <em>прежде</em> чем вызывать метод <em>экземпляра</em> <code>load()</code> .
zh_cn: 您可以用代码构造一个新的控制器，将您想要的任何参数从调用者传递到控制器构造函数中。 构造控制器后，可以<em>在</em>调用 <code>load()</code> <em>实例</em>方法<em>之前</em>在FXMLLoader实例上对其进行设置。

source: You can decide to use a public observable list to store public data, or just create a public setter method to store data and retrieve from the corresponding controller
es: Puede decidir utilizar una lista pública observable para almacenar los datos públicos,o simplemente crear un método de configuración pública para almacenar los datos y recuperarlos del controlador correspondiente
ja: パブリックデータを格納するためにパブリックオブザーバブルリストを使用するか、単にパブリックセッターメソッドを作成してデータを格納し、対応するコントローラから取得するかを決めることができます。
ko: 공개 관찰 가능 목록을 사용하여 공개 데이터를 저장하거나 공개 설정 기 메소드를 작성하여 데이터를 저장하고 해당 제어기에서 검색 할 수 있습니다.
ru: Вы можете принять решение использовать общедоступный наблюдаемый список для хранения общедоступных данных или просто создать общедоступный метод сеттера для хранения данных и получения их от соответствующего контроллера.
zh_cn: 你可以决定使用一个公共可观察列表来存储公共数据,或者直接创建一个公共设置器方法来存储数据,并从相应的控制器中检索

source: You have to create one Context Class.
es: Tienes que crear una clase de contexto.
ja: コンテキストクラスを1つ作成する必要があります。
ko: 하나의 컨텍스트 클래스를 작성해야합니다.
ru: Нужно создать один Контекстный класс.
zh_cn: 你必须创建一个上下文类。

source: You have to just set instance of controller in initialization using
es: Sólo tienes que poner la instancia del controlador en la inicialización usando
ja: を使用して初期化時にコントローラのインスタンスを設定する必要があります。
ko: 초기화를 사용하여 컨트롤러 인스턴스를 설정해야합니다.
ru: Вы должны просто установить экземпляр контроллера при инициализации,используя
zh_cn: 你只需要在初始化时用

source: You need to add in the first controller:
es: Necesitas añadir el primer controlador:
ja: 最初のコントローラーで追加する必要があります。
ko: 첫 번째 컨트롤러를 추가해야합니다.
ru: Нужно добавить первый контроллер:
zh_cn: 你需要在第一个控制器中加入。

source: and you can use it from your whole application just using
es: y puedes usarlo desde tu aplicación completa sólo usando
ja: を使用するだけで、アプリケーション全体から使用することができます。
ko: 그리고 당신은 그것을 사용하여 전체 응용 프로그램에서 사용할 수 있습니다
ru: и ты можешь использовать его из всего своего приложения,просто используя
zh_cn: 而你可以从你的整个应用程序中使用它,只需使用

source: javafx.scene.Node class has a pair of methods setUserData(Object) and Object getUserData()
es: La clase javafx.scene.Node tiene un par de métodos setUserData(Object)y Object getUserData()
ja: javafx.scene.Nodeクラスには、setUserData(Object)とObject getUserData()のペアのメソッドがあります。
ko: javafx.scene.Node 클래스에는 setUserData (Object) 및 Object getUserData () 메소드 쌍이 있습니다.
ru: javafx.scene.Node класс имеет пару методов setUserData(Object)и Object getUserData().
zh_cn: javafx.sene.Node类有一对方法setUserData(Object)和Object getUserData()

source: on first method, why do you return Stage? The method can be void as well because you already giving the command show(); just before return stage;. How do you plan usage by returning the Stage
es: en el primer método,¿por qué regresas a Stage? El método también puede ser nulo porque ya has dado el comando show();justo antes de retornar a Stage;.¿Cómo planeas el uso devolviendo a Stage
ja: 最初のメソッドでは、なぜStageを返すのでしょうか?return stage;の直前に既に show();コマンドを与えているので、このメソッドも同様に void にすることができます。を返すことで、どのように利用を計画しているのでしょうか?
ko: 첫 번째 방법에서는 왜 Stage를 반환합니까? show () 명령을 이미 제공했기 때문에이 메소드도 무효가 될 수 있습니다. 귀국 바로 전에;. 스테이지를 반환하여 사용을 계획하는 방법
ru: по первому методу,зачем ты возвращаешь Сцену? Метод также может быть пустым,так как вы уже даете команду show();непосредственно перед возвращением стадии;.Как вы планируете использовать метод,возвращая Stage
zh_cn: 在第一个方法中,为什么要返回Stage?这个方法也可以是空的,因为你在返回Stage;之前已经给了show();命令。你如何通过返回Stage
