Repository: rueisnom/feedback
Catalog: xlf/14/18/79/63/14187963.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Get a controller from the FXMLLoader instance.
es: Consigue un controlador de la instancia FXMLLoader.
ja: FXMLLoader インスタンスからコントローラを取得します。
ko: FXMLLoader 인스턴스에서 컨트롤러를 가져옵니다.
ru: Получите контроллер из экземпляра FXMLLoader.
zh_cn: 从FXMLLoader实例中获取一个控制器。

source: Greg Brown, the original FXML specification creator and implementor, often suggests considering use of an event bus, such as the Guava <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus</a>, for communication between FXML instantiated controllers and other application logic.
es: Greg Brown, el creador e implementador de la especificaci&oacute;n FXML original, a menudo sugiere considerar el uso de un bus de eventos, como el <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus de</a> Guava, para la comunicaci&oacute;n entre controladores instanciados FXML y otra l&oacute;gica de aplicaci&oacute;n.
ja: 元のFXML仕様の作成者および実装者であるGreg Brownは、FXMLのインスタンス化されたコントローラーと他のアプリケーションロジック間の通信に、Guava <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus</a>などのイベントバスの使用を検討することを提案しています。
ko: 원래 FXML 사양 작성자이자 구현자인 Greg Brown은 FXML 인스턴스화 된 컨트롤러와 다른 응용 프로그램 논리 간의 통신을 위해 Guava <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus</a> 와 같은 이벤트 버스 사용을 고려할 것을 제안합니다.
ru: Грег Браун (Greg Brown), создатель и разработчик оригинальной спецификации FXML, часто предлагает рассмотреть возможность использования шины событий, такой как Guava <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus</a> , для связи между экземплярами контроллера FXML и другой логикой приложения.
zh_cn: 最初的FXML规范创建者和实现者Greg Brown通常建议考虑使用事件总线（例如Guava <a href="https://github.com/google/guava/wiki/EventBusExplained">EventBus）</a>在FXML实例化控制器和其他应用程序逻辑之间进行通信。

source: Here is a concrete implementation of the loader:
es: Aquí hay una implementación concreta del cargador:
ja: ローダの具体的な実装をご紹介します。
ko: 로더의 구체적인 구현은 다음과 같습니다.
ru: Вот конкретная реализация погрузчика:
zh_cn: 以下是装载机的具体实现方法。

source: Here is an example for passing parameters to a fxml document through namespace.
es: Aquí hay un ejemplo para pasar parámetros a un documento fxml a través de un espacio de nombres.
ja: ここに、名前空間を介してfxmlドキュメントにパラメータを渡す例があります。
ko: 다음은 네임 스페이스를 통해 매개 변수를 fxml 문서에 전달하는 예제입니다.
ru: Приведем пример для передачи параметров в fxml документ через пространство имён.
zh_cn: 下面是一个通过命名空间向fxml文档传递参数的例子。

source: Here is an example for using a controller injected by Guice.
es: Aquí hay un ejemplo para usar un controlador inyectado por Guice.
ja: Guiceが注入したコントローラを使用した例を紹介します。
ko: 다음은 Guice가 주입 한 컨트롤러를 사용하는 예입니다.
ru: Вот пример использования контроллера,инжектируемого Guice.
zh_cn: 下面是一个使用Guice注入的控制器的例子。

source: How can I pass parameters to a secondary window in javafx? Is there a way to communicate with the corresponding controller?
es: ¿Cómo puedo pasar los parámetros a una ventana secundaria en javafx? ¿Hay alguna forma de comunicarse con el controlador correspondiente?
ja: javafxでセカンダリウィンドウにパラメータを渡すには?対応するコントローラと通信する方法はありますか?
ko: javafx에서 보조 창에 매개 변수를 전달하려면 어떻게해야합니까? 해당 컨트롤러와 통신하는 방법이 있습니까?
ru: Как передать параметры во вторичное окно в javafx? Есть ли способ связи с соответствующим контроллером?
zh_cn: 如何在javafx中将参数传递给辅助窗口?是否有办法与相应的控制器进行通信?

source: I have a much simpler method creating an instance of the class using the initialize method. I searched the Internet multiple days until finding this really simple method.
es: Tengo un método mucho más simple para crear una instancia de la clase usando el método de inicialización.Busqué en Internet varios días hasta encontrar este método realmente simple.
ja: initializeメソッドを使ってクラスのインスタンスを作成する、もっとシンプルな方法があります。私はこの本当にシンプルなメソッドを見つけるまで何日もインターネットを検索しました。
ko: initialize 메소드를 사용하여 클래스의 인스턴스를 작성하는 훨씬 간단한 메소드가 있습니다. 이 간단한 방법을 찾을 때까지 며칠 동안 인터넷을 검색했습니다.
ru: У меня есть гораздо более простой метод,создающий экземпляр класса с помощью метода инициализации.Я искал в Интернете несколько дней,пока не нашел этот действительно простой метод.
zh_cn: 我有一个更简单的方法,就是用初始化方法创建一个类的实例。我在网上搜索了好几天,直到发现这个方法真的很简单。

source: I realize this is a very old post and has some great answers already, but I wanted to make a simple MCVE to demonstrate one such approach and allow new coders a way to quickly see the concept in action.
es: Me doy cuenta de que este es un post muy antiguo y que ya tiene algunas grandes respuestas,pero quería hacer un simple MCVE para demostrar un enfoque de este tipo y permitir a los nuevos codificadores una forma de ver rápidamente el concepto en acción.
ja: 私はこれが非常に古いポストであり、すでにいくつかの素晴らしい答えを持っていることを認識していますが、私はそのようなアプローチの1つを実証するためにシンプルなMCVEを作成し、新しいコーダーがすぐにアクションで概念を見るための方法を可能にしたいと思いました。
ko: 나는 이것이 매우 오래된 게시물이라는 것을 알고 있으며 이미 훌륭한 답변을 얻었지만 그러한 접근법 중 하나를 보여주기 위해 간단한 MCVE를 만들고 새로운 코더가 개념을 실제로 볼 수있는 방법을 원했습니다.
ru: Я понимаю,что это очень старый пост и у него уже есть отличные ответы,но я хотел сделать простой MCVE,чтобы продемонстрировать один такой подход и дать возможность новым программистам быстро увидеть концепцию в действии.
zh_cn: 我知道这是一个很老的帖子,已经有了一些很好的答案,但我想做一个简单的MCVE来演示一个这样的方法,让新的编纂人员能够快速看到这个概念的实际操作。

source: In this example, we will use 5 files:
es: En este ejemplo,usaremos 5 archivos:
ja: この例では、5つのファイルを使用します。
ko: 이 예에서는 5 개의 파일을 사용합니다.
ru: В данном примере мы будем использовать 5 файлов:
zh_cn: 在这个例子中,我们将使用5个文件。

source: Invoke methods on the retrieved controller to provide the controller with references to the domain objects.
es: Invocar métodos en el controlador recuperado para proporcionar al controlador referencias a los objetos del dominio.
ja: 取得したコントローラのメソッドを呼び出して、ドメインオブジェクトへの参照をコントローラに提供します。
ko: 검색된 컨트롤러에서 메소드를 호출하여 컨트롤러에 도메인 오브젝트에 대한 참조를 제공하십시오.
ru: Вызовите методы на получаемом контроллере для предоставления контроллеру ссылок на объекты домена.
zh_cn: 在检索到的控制器上调用方法,为控制器提供域对象的引用。

source: It is a functional solution to a problem. A stage is returned from the <code>showCustomerDialog</code> function so that a reference to it can be stored by an external class which may wish to do something, such as hide the stage based on a button click in the main window, at a later time. An alternate, object-oriented solution could encapsulate the functionality and stage reference inside a CustomerDialog object or have a CustomerDialog extend Stage. A full example for an object-oriented interface to a custom dialog encapsulating FXML, controller and model data is beyond the scope of this answer, but may make a worthwhile blog post for anybody inclined to create one.
es: Es una soluci&oacute;n funcional a un problema. Se devuelve un escenario desde la funci&oacute;n <code>showCustomerDialog</code> para que una clase externa pueda almacenar una referencia al mismo que desee hacer algo, como ocultar el escenario con un clic en la ventana principal, m&aacute;s adelante. Una soluci&oacute;n alternativa orientada a objetos podr&iacute;a encapsular la funcionalidad y la referencia de etapa dentro de un objeto CustomerDialog o hacer que CustomerDialog extienda Stage. Un ejemplo completo de una interfaz orientada a objetos para un di&aacute;logo personalizado que encapsula FXML, el controlador y los datos del modelo est&aacute; m&aacute;s all&aacute; del alcance de esta respuesta, pero puede ser una publicaci&oacute;n de blog que valga la pena para cualquiera que est&eacute; dispuesto a crear una.
ja: 問題に対する機能的な解決策です。 ステージは <code>showCustomerDialog</code> 関数から返されるので、後でメインウィンドウのボタンクリックに基づいてステージを非表示にするなど、何かを実行したい外部クラスによってステージへの参照を格納できます。 別のオブジェクト指向ソリューションでは、機能とステージ参照をCustomerDialogオブジェクト内にカプセル化したり、CustomerDialogでステージを拡張したりできます。 FXML、コントローラー、モデルデータをカプセル化するカスタムダイアログへのオブジェクト指向インターフェースの完全な例は、この回答の範囲を超えていますが、作成を志向する人にとって価値のあるブログ投稿になるかもしれません。
ko: 문제에 대한 기능적 솔루션입니다. <code>showCustomerDialog</code> 함수에서 스테이지가 반환되어 나중에 기본 창에서 버튼 클릭을 기반으로 스테이지를 숨기는 등의 작업을 수행하려는 외부 클래스에서 참조를 저장할 수 있습니다. 대체 객체 지향 솔루션은 CustomerDialog 객체 내부의 기능 및 단계 참조를 캡슐화하거나 CustomerDialog extend Stage를 가질 수 있습니다. FXML, 컨트롤러 및 모델 데이터를 캡슐화하는 사용자 정의 대화 상자에 대한 객체 지향 인터페이스의 전체 예는이 답변의 범위를 벗어 났지만 누구나 블로그 게시물을 작성하려는 경향이 있습니다.
ru: Это функциональное решение проблемы. Этап возвращается из функции <code>showCustomerDialog</code> , так что ссылка на него может быть сохранена внешним классом, который может захотеть что-то сделать, например, скрыть этап на основе нажатия кнопки в главном окне в более позднее время. Альтернативное объектно-ориентированное решение может инкапсулировать функциональность и ссылку на стадию в объекте CustomerDialog или иметь расширенную стадию CustomerDialog. Полный пример объектно-ориентированного интерфейса с настраиваемым диалоговым окном, инкапсулирующим данные FXML, контроллера и модели, выходит за рамки этого ответа, но может стать достойной записью в блоге для любого, кто хочет его создать.
zh_cn: 这是一个解决问题的功能。 从 <code>showCustomerDialog</code> 函数返回一个阶段，以便以后可能希望做一些事情的外部类可以存储对它的引用，例如，根据在主窗口中单击按钮隐藏该阶段。 另一种面向对象的解决方案可以将功能和阶段引用封装在CustomerDialog对象中，或者具有CustomerDialog扩展阶段。 一个自定义对话框的面向对象的界面的完整示例，该示例对话框封装了FXML，控制器和模型数据，超出了此答案的范围，但对于那些愿意创建一个的人来说，可能是一个有价值的博客文章。

source: JavaFX FXML Parameter passing from Controller A to B and back
es: Parámetro JavaFX FXML que pasa del controlador A al B y viceversa
ja: JavaFX FXMLパラメータのコントローラAからBへの受け渡しとその前後の処理
ko: 컨트롤러 A에서 B로 전달되는 JavaFX FXML 매개 변수
ru: JavaFX FXML Параметр передачи от контроллера A к B и обратно
zh_cn: JavaFXFXML参数从控制器A传到B,再传回来

source: Note this example loads the view into the center of a BoarderPane that is the root of the Scene in the Stage. This is irrelevant to the example (implementation detail of my specific use case) but decided to leave it in as some may find it useful.
es: Note que este ejemplo carga la vista en el centro de un BoarderPane que es la raíz de la escena en el escenario.Esto es irrelevante para el ejemplo (detalle de implementación de mi caso de uso específico)pero decidí dejarlo como algunos pueden encontrarlo útil.
ja: この例では、StageのSceneのルートであるBoarderPaneの中心にビューをロードしています。これは例とは無関係ですが(私の特定のユースケースの実装の詳細)、便利だと思う人もいるかもしれないので残しておくことにしました。
ko: 이 예제는 스테이지에서 장면의 루트 인 BoarderPane의 중심으로 뷰를로드합니다. 이것은 예제 (내 특정 사용 사례의 구현 세부 사항)와 관련이 없지만 일부는 유용 할 수 있으므로 그대로두기로 결정했습니다.
ru: Обратите внимание,что этот пример загружает представление в центр панели BoarderPane,которая является корнем сцены на сцене.Это не имеет значения для примера (подробности реализации моего конкретного случая использования),но решил оставить его,так как некоторые могут посчитать его полезным.
zh_cn: 注意这个例子将视图加载到BoarderPane的中心,BoarderPane是舞台中场景的根部。这与本例无关(我的具体用例的实现细节),但由于有些人可能会觉得有用,所以决定留下它。

source: Now you can pass parameter to any controller from whole application.
es: Ahora puedes pasarle parámetros a cualquier controlador de toda la aplicación.
ja: これで、アプリケーション全体から任意のコントローラにパラメータを渡すことができるようになりました。
ko: 이제 전체 애플리케이션에서 모든 컨트롤러에 매개 변수를 전달할 수 있습니다.
ru: Теперь вы можете передать параметр любому контроллеру из целого приложения.
zh_cn: 现在你可以从整个应用程序中传递参数给任何控制器。

source: Observe a documentation here: <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html</a> Before the phrase "In the first version, the handleButtonAction() is tagged with @FXML to allow markup defined in the controller's document to invoke it. In the second example, the button field is annotated to allow the loader to set its value. The initialize() method is similarly annotated."
es: Observe una documentaci&oacute;n aqu&iacute;: <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html</a> Antes de la frase "En la primera versi&oacute;n, handleButtonAction () est&aacute; etiquetado con @FXML para permitir el marcado definido en el documento del controlador para invocarlo. En el segundo ejemplo, el campo del bot&oacute;n se anota para permitir que el cargador establezca su valor. El m&eacute;todo initialize () se anota de manera similar ".
ja: ここでドキュメントを確認してください： <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">http</a> ://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html「最初のバージョンでは、handleButtonAction（）は@FXMLコントローラのドキュメントで定義されたマークアップが呼び出せるようにします。2番目の例では、ローダーが値を設定できるようにボタンフィールドに注釈が付けられています。initialize（）メソッドにも同様に注釈が付けられています。
ko: 다음 문서를 <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">참조</a> 하십시오. http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html "첫 번째 버전에서 handleButtonAction ()은 @FXML로 태그 지정됩니다. 컨트롤러의 문서에 정의 된 마크 업이이를 호출 할 수 있도록합니다. 두 번째 예에서는 버튼 필드에 주석을 달아 로더가 값을 설정할 수 있도록합니다. initialize () 메소드도 비슷하게 주석이 달립니다. "
ru: Ознакомьтесь с документацией здесь: <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html</a> Перед фразой &laquo;В первой версии handleButtonAction () помечен как @FXML чтобы позволить разметке, определенной в документе контроллера, вызывать ее. Во втором примере поле кнопки аннотировано, чтобы позволить загрузчику установить его значение. Метод initialize () также аннотирован. "
zh_cn: 在此处查看文档： <a href="http://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html">http</a> ://docs.oracle.com/javafx/2/api/javafx/fxml/doc-files/introduction_to_fxml.html在短语&ldquo;在第一个版本中，handleButtonAction（）标记有@FXML允许在控制器文档中定义的标记调用它。在第二个示例中，对button字段进行了注释，以允许加载程序设置其值。对initialize（）方法也进行了注释。

source: One the most fundamental concepts working with any programming language is how to navigate from one (window, form or page) to another. Also while doing this navigation the developer often wants to pass data from one (window, form or page) and display or use the data passed
es: Uno de los conceptos fundamentales que funcionan con cualquier lenguaje de programación es cómo navegar de una (ventana,formulario o página)a otra.Además,al hacer esta navegación el desarrollador a menudo quiere pasar datos de una (ventana,formulario o página)y mostrar o utilizar los datos pasados
ja: どのようなプログラミング言語でも最も基本的な概念の一つは、あるウィンドウ、フォーム、ページから別のウィンドウへの移動方法です。また、このナビゲーションを行っている間、開発者はしばしばあるウィンドウ、フォーム、ページからデータを渡して、渡されたデータを表示したり、使用したりしたいと考えます。
ko: 프로그래밍 언어와 함께 작동하는 가장 기본적인 개념 중 하나는 하나의 창 (창, 양식 또는 페이지)에서 다른 창으로 이동하는 방법입니다. 또한이 탐색을 수행하는 동안 개발자는 종종 하나의 데이터 (창, 양식 또는 페이지)를 전달하고 전달 된 데이터를 표시하거나 사용하려고합니다.
ru: Одна из самых фундаментальных концепций работы с любым языком программирования-это навигация от одного (окна,формы или страницы)к другому.Также при такой навигации разработчик часто хочет передать данные из одного (окна,формы или страницы)и отобразить или использовать переданные данные.
zh_cn: 在任何编程语言中工作的最基本的概念之一就是如何从一个(窗口、表单或页面)导航到另一个(窗口、表单或页面)。同时,在做这个导航的时候,开发者往往希望从一个(窗口、表单或页面)中传递数据,并显示或使用传递的数据。

source: Page One Controller
es: Controlador de la página uno
ja: ページワンコントローラ
ko: 1 페이지 컨트롤러
ru: Страница один контроллер
zh_cn: 第1页控制器

source: Page Two Controller
es: Página dos Controlador
ja: 2 ページ コントローラー
ko: 2 페이지 컨트롤러
ru: Страница два контроллер
zh_cn: 第2页 控制器

source: Pass custom data to an FXML controller by retrieving the controller from the FXML loader instance and calling a method on the controller to initialize it with the required data values.
es: Pasar los datos personalizados a un controlador FXML recuperando el controlador de la instancia del cargador FXML y llamando a un método en el controlador para inicializarlo con los valores de datos requeridos.
ja: FXML ローダのインスタンスからコントローラを取得し、そのコントローラ上でメソッドを呼び出して、必要なデータ値で初期化することで、カスタムデータをFXMLコントローラに渡すことができます。
ko: FXML 로더 인스턴스에서 컨트롤러를 검색하고 컨트롤러에서 메서드를 호출하여 필요한 데이터 값으로 초기화하여 사용자 지정 데이터를 FXML 컨트롤러로 전달합니다.
ru: Передача пользовательских данных на FXML-контроллер путем извлечения контроллера из экземпляра загрузчика FXML и вызова метода на контроллере для инициализации его с требуемыми значениями данных.
zh_cn: 通过从FXML加载器实例中检索控制器,并调用控制器上的方法将自定义数据传递给FXML控制器,用所需的数据值对其进行初始化。

source: Passing Parameters JavaFX FXML
es: Pasando los parámetros JavaFX FXML
ja: パラメータの渡し方 JavaFX FXML
ko: 전달 매개 변수 JavaFX FXML
ru: Параметры передачи JavaFX FXML
zh_cn: 传递参数JavaFXFXML

source: Set up a method in your class as follows:
es: Establezca un método en su clase de la siguiente manera:
ja: 以下のようにクラスにメソッドを設定します。
ko: 다음과 같이 클래스에서 메소드를 설정하십시오.
ru: Настройте метод в классе следующим образом:
zh_cn: 在你的类中设置一个方法,如下图所示。

source: So, you can call page.setUserData(info);
es: Así que puedes llamar a page.setUserData(info);
ja: そのため、page.setUserData(info)を呼び出すことができます。
ko: 따라서 page.setUserData (info);를 호출 할 수 있습니다.
ru: Итак,вы можете вызвать page.setUserData(info);
zh_cn: 所以,你可以调用page.setUserData(info)。

source: So, you need to associate a controller with a node, and set a user data to the node.
es: Por lo tanto,necesitas asociar un controlador con un nodo,y establecer los datos de un usuario en el nodo.
ja: そこで、ノードにコントローラを関連付けて、ノードにユーザデータを設定する必要があります。
ko: 따라서 제어기를 노드와 연관시키고 사용자 데이터를 노드로 설정해야합니다.
ru: Итак,вам нужно связать контроллер с узлом,и установить пользовательские данные на узел.
zh_cn: 所以,你需要将一个控制器与一个节点关联,并将用户数据设置为节点。

source: Something like the following code:
es: Algo como el siguiente código:
ja: 以下のコードのようなもの。
ko: 다음 코드와 같은 것 :
ru: Что-то вроде следующего кода:
zh_cn: 类似以下代码的东西。

source: Sometimes, you might want to pass results back to the caller, in which case you can check out the answer to the related question:
es: A veces,puede que quieras pasar los resultados a la persona que llama,en cuyo caso puedes comprobar la respuesta a la pregunta relacionada:
ja: 時には、結果を発信者に伝えたい場合もありますが、その場合は関連する質問の回答を確認することができます。
ko: 때로는 결과를 발신자에게 다시 전달할 수도 있습니다.이 경우 관련 질문에 대한 답변을 확인할 수 있습니다.
ru: Иногда вам может понадобиться передать результаты обратно вызывающему абоненту,и в этом случае вы можете проверить ответ на соответствующий вопрос:
zh_cn: 有时,你可能想把结果传回给来电者,这种情况下,你可以查看相关问题的答案。

source: Start Controller
es: Controlador de arranque
ja: スタートコントローラ
ko: 컨트롤러 시작
ru: Пусковой контроллер
zh_cn: 启动控制器

source: The EventBus is a simple but powerful publish/subscribe API with annotations that allows POJOs to communicate with each other anywhere in a JVM without having to refer to each other.
es: El EventBus es una simple pero poderosa API de suscripción de público con anotaciones que permite a los POJOs comunicarse entre sí en cualquier lugar de una JVM sin tener que referirse unos a otros.
ja: EventBusはアノテーションを備えたシンプルながらも強力なパブリッシュサブスクライブAPIで、POJOはお互いを参照することなく、JVM内のどこにいても通信を行うことができます。
ko: EventBus는 POJO가 서로 참조하지 않고도 JVM의 어느 곳에서나 서로 통신 할 수 있도록하는 주석이있는 단순하지만 강력한 발행 / 구독 API입니다.
ru: EventBus-это простой,но мощный API для подписки издателей с аннотациями,который позволяет POJO общаться друг с другом в любом месте JVM без необходимости ссылаться друг на друга.
zh_cn: EventBus是一个简单但功能强大的发布订阅API,它允许POJOs在JVM中的任何地方相互通信,而不需要相互引用。

source: The code itself is also commented with some details of what is happening and how.
es: El código en sí mismo también se comenta con algunos detalles de lo que está sucediendo y cómo.
ja: コード自体にも、何がどうなっているのか、どのようになっているのかを詳細にコメントしています。
ko: 또한 코드 자체에는 무슨 일이 일어나고 있는지에 대한 몇 가지 세부 사항이 설명되어 있습니다.
ru: Сам код также комментируется с некоторыми подробностями о том,что и как происходит.
zh_cn: 代码本身也注释了一些细节的内容和方法。

source: The first scene contains a <code>TextField</code>, a <code>Button</code>, and a <code>Label</code>. When the <code>Button</code> is clicked, the second window is loaded and displayed, including the text entered in the <code>TextField</code>.
es: La primera escena contiene un <code>TextField</code> , un <code>Button</code> y una <code>Label</code> . Cuando se hace clic en el <code>Button</code> , se carga y se muestra la segunda ventana, incluido el texto ingresado en el <code>TextField</code> .
ja: 最初のシーンには、 <code>TextField</code> 、 <code>Button</code> 、および <code>Label</code> が含まれています 。 <code>Button</code> がクリックされると、 <code>TextField</code> に入力されたテキストを含む2番目のウィンドウがロードされて表示されます 。
ko: 첫 번째 장면에는 <code>TextField</code> , <code>Button</code> 및 <code>Label</code> 이 있습니다. <code>Button</code> 을 클릭하면 <code>TextField</code> 에 입력 한 텍스트를 포함하여 두 번째 창이로드되어 표시됩니다.
ru: Первая сцена содержит <code>TextField</code> , <code>Button</code> и <code>Label</code> . При нажатии на <code>Button</code> загружается и отображается второе окно, включая текст, введенный в <code>TextField</code> .
zh_cn: 第一个场景包含一个 <code>TextField</code> ，一个 <code>Button</code> 和一个 <code>Label</code> 。 单击&ldquo; <code>Button</code> ，将加载并显示第二个窗口，包括在 <code>TextField</code> 中输入的文本。

source: The question of how to do it "The Spring Boot Way", there was a discussion about JavaFX 2, which I anserwered in the attached permalink. The approach is still valid and tested in March 2016, on Spring Boot v1.3.3.RELEASE: <a href="https://stackoverflow.com/a/36310391/1281217">https://stackoverflow.com/a/36310391/1281217</a>
es: La cuesti&oacute;n de c&oacute;mo hacerlo "The Spring Boot Way", hubo una discusi&oacute;n sobre JavaFX 2, que respond&iacute; en el enlace permanente adjunto. El enfoque a&uacute;n es v&aacute;lido y se prob&oacute; en marzo de 2016, en Spring Boot v1.3.3. PUBLICACI&Oacute;N: <a href="https://stackoverflow.com/a/36310391/1281217">https://stackoverflow.com/a/36310391/1281217</a>
ja: それをどのように行うかという質問「The Spring Boot Way」では、添付のパーマリンクで私が答えたJavaFX 2についての議論がありました。 このアプローチはまだ有効であり、2016年3月にSpring Boot v1.3.3.RELEASEでテストされてい<a href="https://stackoverflow.com/a/36310391/1281217">ます</a> ： https ://stackoverflow.com/a/36310391/1281217
ko: "The Spring Boot Way"를 수행하는 방법에 대한 질문에 JavaFX 2에 대한 토론이있었습니다. 이 접근 방식은 2016 년 3 월 Spring Boot v1.3.3에서 여전히 유효하고 테스트되었습니다 .RELEASE : <a href="https://stackoverflow.com/a/36310391/1281217">https://stackoverflow.com/a/36310391/1281217</a>
ru: На вопрос, как это сделать &laquo;The Spring Boot Way&raquo;, шла дискуссия о JavaFX 2, на которую я ответил в прикрепленной постоянной ссылке. Этот подход все еще действителен и протестирован в марте 2016 года на Spring Boot v1.3.3.RELEASE: <a href="https://stackoverflow.com/a/36310391/1281217">https://stackoverflow.com/a/36310391/1281217</a>
zh_cn: 关于如何做的问题&ldquo; Spring Boot Way&rdquo;，有一个关于JavaFX 2的讨论，我在所附的永久链接中对此进行了解答。 该方法仍然有效并已在2016年3月的Spring Boot v1.3.3。上进行了测试。发布： <a href="https://stackoverflow.com/a/36310391/1281217">https</a> ://stackoverflow.com/a/36310391/1281217

source: Then call the method in the initialize method:
es: Entonces llama al método en el método de inicialización:
ja: そして、initializeメソッドの中のメソッドを呼び出します。
ko: 그런 다음 initialize 메소드에서 메소드를 호출하십시오.
ru: Затем вызовите метод в методе инициализации:
zh_cn: 然后在初始化方法中调用该方法。

source: Then in the second one declare a client, then at the bottom of your controller:
es: Luego en la segunda declaran un cliente,luego en la parte inferior de su controlador:
ja: 次に、2番目のものでは、あなたのコントローラの下部に、クライアントを宣言します。
ko: 그런 다음 두 번째 클라이언트에서 클라이언트를 선언 한 다음 컨트롤러 하단에서 선언하십시오.
ru: Затем во втором объявите клиента,затем в нижней части вашего контроллера:
zh_cn: 然后在第二种申报一个客户端,然后在你的控制器的底部。

source: This answer enumerates different mechanisms for passing parameters to FXML controllers.
es: Esta respuesta enumera diferentes mecanismos para pasar parámetros a los controladores FXML.
ja: この回答では、FXMLコントローラにパラメータを渡すための様々なメカニズムを列挙しています。
ko: 이 답변은 FXML 컨트롤러에 매개 변수를 전달하기위한 다양한 메커니즘을 열거합니다.
ru: В этом ответе перечисляются различные механизмы передачи параметров FXML-контроллерам.
zh_cn: 本回答列举了向FXML控制器传递参数的不同机制。
