Repository: rueisnom/feedback
Catalog: xlf/14/18/79/63/14187963.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: // set up the variable used for the instance of the main class
es: /establecer la variable utilizada para el ejemplo de la clase principal
ja: /メインクラスのインスタンスに使用される変数を設定する
ko: // 메인 클래스의 인스턴스에 사용되는 변수를 설정
ru: /установить переменную,используемую для экземпляра основного класса.
zh_cn: /设置主类实例的变量,用于主类的实例

source: <code>newStage</code> would be the new window. The problem is, I can't find a way to tell the controller where to look for the customer's info (by passing the id as parameter).
es: <code>newStage</code> ser&iacute;a la nueva ventana. El problema es que no puedo encontrar una manera de decirle al controlador d&oacute;nde buscar la informaci&oacute;n del cliente (pasando el id como par&aacute;metro).
ja: <code>newStage</code> が新しいウィンドウになります。 問題は、（IDをパラメーターとして渡すことによって）顧客の情報を探す場所をコントローラーに指示する方法が見つからないことです。
ko: <code>newStage</code> 는 새 창입니다. 문제는 컨트롤러에 고객 정보를 어디에서 찾을 것인지 알려주는 방법을 찾을 수 없다는 것입니다 (id를 매개 변수로 전달하여).
ru: <code>newStage</code> будет новым окном. Проблема в том, что я не могу найти способ сообщить контроллеру, где искать информацию о клиенте (передавая id в качестве параметра).
zh_cn: <code>newStage</code> 将是新窗口。 问题是，我找不到告诉控制器在哪里寻找客户信息的方法（通过将id作为参数传递）。

source: <em>All files are listed in their entirety at the bottom of this post.</em>
es: <em>Todos los archivos se enumeran en su totalidad al final de esta publicaci&oacute;n.</em>
ja: <em>すべてのファイルは、この投稿の下部に全体がリストされています。</em>
ko: <em>모든 파일은이 게시물의 맨 아래에 전체적으로 나열됩니다.</em>
ru: <em>Все файлы перечислены полностью в нижней части этого поста.</em>
zh_cn: <em>所有文件均在此文章底部完整列出。</em>

source: <em>Be careful NOT to use a static load function on the FXMLLoader, or you will not be able to get your controller from your loader instance.</em>
es: <em>Tenga cuidado de NO utilizar una funci&oacute;n de carga est&aacute;tica en el FXMLLoader, o no podr&aacute; obtener su controlador desde la instancia del cargador.</em>
ja: <em>FXMLLoaderで静的ロード関数を使用しないように注意してください。そうしないと、ローダーインスタンスからコントローラーを取得できなくなります。</em>
ko: <em>FXMLLoader에서 정적로드 기능을 사용하지 않도록주의하십시오. 그렇지 않으면 로더 인스턴스에서 컨트롤러를 가져올 수 없습니다.</em>
ru: <em>Будьте осторожны, НЕ используйте функцию статической загрузки на FXMLLoader, иначе вы не сможете получить свой контроллер от экземпляра загрузчика.</em>
zh_cn: <em>注意不要在FXMLLoader上使用静态加载函数，否则您将无法从加载程序实例中获取控制器。</em>

source: <em>Example for Spring Boot Dependency Injection</em>
es: <em>Ejemplo de inyecci&oacute;n de dependencia de arranque de resorte</em>
ja: <em>Spring Boot Dependency Injectionの例</em>
ko: <em>스프링 부트 의존성 주입 예제</em>
ru: <em>Пример для инъекции зависимостей весенней загрузки</em>
zh_cn: <em>Spring Boot依赖注入示例</em>

source: <em>To set a controller on a loader (in JavaFX 2.x) you CANNOT also define a <code>fx:controller</code> attribute in your fxml file.</em>
es: <em>Para configurar un controlador en un cargador (en JavaFX 2.x) NO PUEDE definir un atributo <code>fx:controller</code> en su archivo fxml.</em>
ja: <em>ローダー（JavaFX 2.x）でコントローラーを設定するには、fxmlファイルで <code>fx:controller</code> 属性を定義することもできません。</em>
ko: <em>로더 (JavaFX 2.x)에서 제어기를 설정하기 위해 fxml 파일에서 <code>fx:controller</code> 속성을 정의 할 수도 없습니다.</em>
ru: <em>Чтобы установить контроллер в загрузчике (в JavaFX 2.x), вы НЕ МОЖЕТЕ также определить атрибут <code>fx:controller</code> в вашем файле fxml.</em>
zh_cn: <em>要在加载程序（在JavaFX 2.x中）上设置控制器，您也不能在fxml文件中定义 <code>fx:controller</code> 属性。</em>

source: <strong>Additional information supplied by StackOverflow user named <a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a></strong>
es: <strong>Informaci&oacute;n adicional proporcionada por el usuario de StackOverflow llamado <a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a></strong>
ja: <strong>StackOverflowユーザーが<a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a>という名前で提供する追加情報</strong>
ko: <strong><a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a> 이라는 StackOverflow 사용자가 제공 한 추가 정보</strong>
ru: <strong>Дополнительная информация предоставлена ​​пользователем StackOverflow с именем <a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a></strong>
zh_cn: <strong>由StackOverflow用户<a href="https://stackoverflow.com/users/1281217/bgmf">@dzim</a>提供的其他信息</strong>

source: <strong>Controller1.java</strong> - The controller for the first FXML layout.
es: <strong>Controller1.java</strong> : el controlador para el primer dise&ntilde;o FXML.
ja: <strong>Controller1.java-</strong>最初のFXMLレイアウトのコントローラー。
ko: <strong>Controller1.java-</strong> 첫 번째 FXML 레이아웃의 컨트롤러입니다.
ru: <strong>Controller1.java</strong> - Контроллер для первого макета FXML.
zh_cn: <strong>Controller1.java-</strong>第一个FXML布局的控制器。

source: <strong>Controller2.java</strong> - The controller for the second FXML layout.
es: <strong>Controller2.java</strong> : el controlador para el segundo dise&ntilde;o FXML.
ja: <strong>Controller2.java</strong> -2番目のFXMLレイアウトのコントローラー。
ko: <strong>Controller2.java-</strong> 두 번째 FXML 레이아웃의 컨트롤러입니다.
ru: <strong>Controller2.java</strong> - Контроллер для второго макета FXML.
zh_cn: <strong>Controller2.java-</strong>第二个FXML布局的控制器。

source: <strong>Follow-up Q&amp;A</strong>
es: <strong>Preguntas y respuestas de seguimiento</strong>
ja: <strong>フォローアップQ＆A</strong>
ko: <strong>후속 Q &amp; A</strong>
ru: <strong>Последующие вопросы и ответы</strong>
zh_cn: <strong>后续问答</strong>

source: <strong>Having the Controller Retrieve Parameters from an External Static Method</strong>
es: <strong>Hacer que el controlador recupere los par&aacute;metros de un m&eacute;todo est&aacute;tico externo</strong>
ja: <strong>コントローラーに外部静的メソッドからパラメーターを取得させる</strong>
ko: <strong>컨트롤러가 외부 정적 메소드에서 매개 변수를 검색하도록하기</strong>
ru: <strong>Наличие контроллера, получающего параметры из внешнего статического метода</strong>
zh_cn: <strong>让控制器从外部静态方法检索参数</strong>

source: <strong>Layout1.fxml</strong> - The FXML layout for the first scene.
es: <strong>Layout1.fxml</strong> : el dise&ntilde;o FXML para la primera escena.
ja: <strong>Layout1.fxml-</strong>最初のシーンのFXMLレイアウト。
ko: <strong>Layout1.fxml-</strong> 첫 번째 장면의 FXML 레이아웃
ru: <strong>Layout1.fxml</strong> - макет FXML для первой сцены.
zh_cn: <strong>Layout1.fxml-</strong>第一个场景的FXML布局。

source: <strong>Layout2.fxml</strong> - The FXML layout for the second scene.
es: <strong>Layout2.fxml</strong> : el dise&ntilde;o FXML para la segunda escena.
ja: <strong>Layout2.fxml</strong> -2番目のシーンのFXMLレイアウト。
ko: <strong>Layout2.fxml-</strong> 두 번째 장면의 FXML 레이아웃입니다.
ru: <strong>Layout2.fxml</strong> - макет FXML для второй сцены.
zh_cn: <strong>Layout2.fxml-</strong>第二个场景的FXML布局。

source: <strong>Main.java</strong> - Simply used to start the application and call the first controller.
es: <strong>Main.java</strong> : simplemente se usa para iniciar la aplicaci&oacute;n y llamar al primer controlador.
ja: <strong>Main.java-</strong>アプリケーションを起動し、最初のコントローラーを呼び出すためだけに使用されます。
ko: <strong>Main.java-</strong> 응용 프로그램을 시작하고 첫 번째 컨트롤러를 호출하는 데 사용됩니다.
ru: <strong>Main.java</strong> - просто используется для запуска приложения и вызова первого контроллера.
zh_cn: <strong>Main.java-仅</strong>用于启动应用程序并调用第一个控制器。

source: <strong>Passing Parameters Directly From the Caller to the Controller</strong>
es: <strong>Pasando par&aacute;metros directamente de la persona que llama al controlador</strong>
ja: <strong>呼び出し元からコントローラーに直接パラメーターを渡す</strong>
ko: <strong>발신자에서 컨트롤러로 직접 매개 변수 전달</strong>
ru: <strong>Передача параметров напрямую от вызывающего к контроллеру</strong>
zh_cn: <strong>直接从调用者向控制器传递参数</strong>

source: <strong>Recommended Approach</strong>
es: <strong>Enfoque recomendado</strong>
ja: <strong>推奨されるアプローチ</strong>
ko: <strong>권장 접근법</strong>
ru: <strong>Рекомендуемый подход</strong>
zh_cn: <strong>推荐方法</strong>

source: <strong>Remember first time you print the passing value you will get null, You can use it after your windows loaded , same for everything you want to code for any other component.</strong>
es: <strong>Recuerde que la primera vez que imprima el valor de aprobaci&oacute;n obtendr&aacute; un valor nulo. Puede usarlo despu&eacute;s de cargar sus ventanas, lo mismo para todo lo que desee codificar para cualquier otro componente.</strong>
ja: <strong>渡した値を初めて印刷するときは、nullになることを忘れないでください。これは、ウィンドウがロードされた後に使用できます。これは、他のコンポーネントに対してコーディングしたいすべてのものに同じです。</strong>
ko: <strong>전달하는 값을 처음 인쇄 할 때 null이된다는 것을 기억하십시오. 창을로드 한 후에는 다른 구성 요소에 대해 코딩하려는 모든 항목에 대해이 값을 사용할 수 있습니다.</strong>
ru: <strong>Помните, что в первый раз, когда вы печатаете передаваемое значение, вы получите нулевое значение. Вы можете использовать его после загрузки окон, то же самое для всего, что вы хотите закодировать для любого другого компонента.</strong>
zh_cn: <strong>请记住，第一次打印传递的值时，您将获得null，您可以在Windows加载后使用它，对于要为任何其他组件编码的所有内容都可以使用它。</strong>

source: <strong>Setting a Controller on the FXMLLoader</strong>
es: <strong>Configuraci&oacute;n de un controlador en el FXMLLoader</strong>
ja: <strong>FXMLLoaderでのコントローラーの設定</strong>
ko: <strong>FXMLLoader에서 컨트롤러 설정</strong>
ru: <strong>Настройка контроллера на FXMLLoader</strong>
zh_cn: <strong>在FXMLLoader上设置控制器</strong>

source: <strong>THE CODE</strong>
es: <strong>EL C&Oacute;DIGO</strong>
ja: <strong>コード</strong>
ko: <strong>코드</strong>
ru: <strong>КОД</strong>
zh_cn: <strong>代码</strong>

source: <strong>The Goal:</strong> To demonstrate passing values from <code>Controller1</code> to <code>Controller2</code> and vice versa.
es: <strong>El objetivo:</strong> demostrar los valores de paso del <code>Controller1</code> al <code>Controller2</code> y viceversa.
ja: <strong>目標：</strong> <code>Controller1</code> からController2へ、およびその逆に値を渡すことを示す。
ko: <strong>목표 :</strong> <code>Controller1</code> 에서 <code>Controller2</code> 로 또는 그 반대로 값을 전달하는 것을 보여줍니다.
ru: <strong>Цель:</strong> продемонстрировать передачу значений от <code>Controller1</code> к <code>Controller2</code> и наоборот.
zh_cn: <strong>目标：</strong>演示将值从 <code>Controller1</code> 传递到 <code>Controller2</code> ，反之亦然。

source: <strong>The Program Flow:</strong>
es: <strong>El flujo del programa:</strong>
ja: <strong>プログラムの流れ：</strong>
ko: <strong>프로그램 흐름 :</strong>
ru: <strong>Ход программы:</strong>
zh_cn: <strong>程序流程：</strong>

source: <strong>This WORKS ..</strong>
es: <strong>Esto funciona ..</strong>
ja: <strong>この作品..</strong>
ko: <strong>이 작동합니다 ..</strong>
ru: <strong>Это работает ..</strong>
zh_cn: <strong>这个工作..</strong>

source: <strong>Use Dependency Injection</strong>
es: <strong>Usar inyecci&oacute;n de dependencia</strong>
ja: <strong>依存性注入を使用する</strong>
ko: <strong>의존성 주입 사용</strong>
ru: <strong>Использовать инъекцию зависимостей</strong>
zh_cn: <strong>使用依赖注入</strong>

source: <strong>Use an Event Bus</strong>
es: <strong>Use un bus de eventos</strong>
ja: <strong>イベントバスを使用する</strong>
ko: <strong>이벤트 버스 이용</strong>
ru: <strong>Используйте шину событий</strong>
zh_cn: <strong>使用事件总线</strong>

source: A new FXMLLoader is constructed as shown in the sample code i.e. <code>new FXMLLoader(location)</code>. The location is a URL and you can generate such a URL from an FXML resource by:
es: Se construye un nuevo FXMLLoader como se muestra en el c&oacute;digo de muestra, es decir, un <code>new FXMLLoader(location)</code> . La ubicaci&oacute;n es una URL y puede generar dicha URL a partir de un recurso FXML al:
ja: サンプルコードに示すように、 <code>new FXMLLoader(location)</code> の新しいFXMLLoaderが作成されます。 場所はURLであり、次の方法でFXMLリソースからそのようなURLを生成できます。
ko: 새 FXMLLoader는 샘플 코드 (예 : <code>new FXMLLoader(location)</code> 표시된대로 구성됩니다. 위치는 URL이며 다음을 통해 FXML 리소스에서 이러한 URL을 생성 할 수 있습니다.
ru: Новый FXMLLoader создается, как показано в примере кода, т.е. <code>new FXMLLoader(location)</code> . Расположение является URL-адресом, и вы можете создать такой URL-адрес из ресурса FXML:
zh_cn: 如示例代码所示，构造一个新的FXMLLoader，即 <code>new FXMLLoader(location)</code> 。 该位置是一个URL，您可以通过以下方式从FXML资源生成这样的URL：

source: A really nice, clean dependency injection approach is exemplified by the <a href="https://github.com/AdamBien/afterburner.fx">afterburner.fx framework</a> with a sample <a href="https://github.com/AdamBien/airhacks-control">air-hacks application</a> that uses it. afterburner.fx relies on JEE6 <a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">javax.inject</a> to perform the dependency injection.
es: Un <a href="https://github.com/AdamBien/afterburner.fx">marco de</a> inyecci&oacute;n de dependencia realmente agradable y limpio se ejemplifica en el marco afterburner.fx con una aplicaci&oacute;n de muestra de <a href="https://github.com/AdamBien/airhacks-control">ataques de aire</a> que lo utiliza. afterburner.fx se basa en JEE6 <a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">javax.inject</a> para realizar la inyecci&oacute;n de dependencia.
ja: 本当に素敵でクリーンな依存性注入アプローチは、それを使用するサンプルの<a href="https://github.com/AdamBien/airhacks-control">エアハックアプリケーション</a>を備えた<a href="https://github.com/AdamBien/afterburner.fx">afterburner.fxフレームワーク</a>によって例示されます 。 afterburner.fxは、依存性注入を実行するためにJEE6 javax.injectに依存してい<a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">ます</a> 。
ko: <a href="https://github.com/AdamBien/afterburner.fx">afterburner.fx 프레임 워크</a> 에는이를 사용하는 샘플 <a href="https://github.com/AdamBien/airhacks-control">에어 핵 응용 프로그램</a> 이 포함되어 있습니다. afterburner.fx는 JEE6 <a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">javax.inject</a> 를 사용하여 종속성 주입을 수행합니다.
ru: Действительно хороший, чистый подход к внедрению зависимостей иллюстрируется <a href="https://github.com/AdamBien/afterburner.fx">фреймворком afterburner.fx</a> с примером приложения <a href="https://github.com/AdamBien/airhacks-control">air-hacks,</a> которое его использует. afterburner.fx использует Jav6 <a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">javax.inject</a> для выполнения внедрения зависимостей.
zh_cn: <a href="https://github.com/AdamBien/afterburner.fx">afterburner.fx框架</a>示例了一个很好的干净的依赖项注入方法，并使用了一个示例<a href="https://github.com/AdamBien/airhacks-control">空袭应用程序</a> 。 afterburner.fx依靠JEE6 <a href="http://docs.oracle.com/javaee/6/api/javax/inject/package-summary.html">javax.inject</a>来执行依赖项注入。

source: Adding Spring Dependency Injection in JavaFX (JPA Repo, Service)
es: Añadiendo la Inyección de Dependencia de Primavera en JavaFX (JPA Repo,Servicio)
ja: JavaFXでのSpring依存性インジェクションの追加 (JPAレポ、サービス)
ko: JavaFX에서 스프링 종속성 주입 추가 (JPA Repo, Service)
ru: Добавление Spring Dependency Injection в JavaFX (JPA Repo,сервис)
zh_cn: 在JavaFX中添加Spring依赖注入 (JPA Repo,服务)

source: An example of JavaFX application and controller dependency injection with Spring is provided in the answer to:
es: Un ejemplo de la aplicación JavaFX y la inyección de dependencia del controlador con Spring se proporciona en la respuesta a:
ja: Springを使ったJavaFXアプリケーションとコントローラの依存性注入の例は、回答の中にあります。
ko: Spring을 사용한 JavaFX 애플리케이션 및 컨트롤러 종속성 주입의 예는 다음에 대한 답변으로 제공됩니다.
ru: В ответе приведен пример внедрения JavaFX-приложений и контроллерных зависимостей с помощью Spring:
zh_cn: JavaFX应用程序和控制器依赖注入与Spring的一个例子,在答案中提供了一个JavaFX应用程序和控制器依赖注入的例子。

source: And controller can check, if info is set. Also, you could use ObjectProperty for back-forward data transfering, if needed.
es: Y el controlador puede comprobar,si la información está configurada.Además,puede usar ObjectProperty para la transferencia de datos hacia atrás,si es necesario.
ja: また、情報が設定されているかどうかをコントローラがチェックすることができます。また、必要に応じて、ObjectPropertyを使ってバックフォワードでデータを転送することもできます。
ko: 정보가 설정되어 있으면 컨트롤러가 확인할 수 있습니다. 또한 필요한 경우 뒤로 전달 데이터 전송에 ObjectProperty를 사용할 수 있습니다.
ru: А контроллер может проверить,установлена ли информация.Также,при необходимости,можно использовать ObjectProperty для обратной передачи данных.
zh_cn: 而且控制器可以检查,如果信息被设置了,就可以检查。另外,如果需要的话,你可以使用ObjectProperty进行数据的后向传输。

source: Another Controller
es: Otro controlador
ja: 別のコントローラ
ko: 다른 컨트롤러
ru: Другой контроллер
zh_cn: 另一个主计长

source: Any ideas?
es: ¿Alguna idea?
ja: 何かアイデアは?
ko: 어떤 아이디어?
ru: Есть идеи?
zh_cn: 有什么想法吗?

source: Below are all the FXML files
es: A continuación están todos los archivos FXML
ja: 以下はすべてのFXMLファイルです。
ko: 아래는 모든 FXML 파일입니다
ru: Ниже представлены все файлы FXML
zh_cn: 以下是所有的FXML文件

source: Construct an FXMLLoader based upon fxml markup at a specified location
es: Construye un FXMLLoader basado en el marcado fxml en un lugar específico
ja: 指定された場所でfxmlマークアップに基づいてFXMLLoaderを構築します。
ko: 지정된 위치에서 fxml 마크 업을 기반으로 FXMLLoader 생성
ru: Построить FXMLLoader на основе fxml разметки в указанном месте
zh_cn: 在指定的位置构建一个基于fxml标记的FXMLLoader。

source: Declare an instance of your class:
es: Declare una instancia de su clase:
ja: クラスのインスタンスを宣言します。
ko: 클래스의 인스턴스를 선언하십시오.
ru: Объявите пример вашего класса:
zh_cn: 申报一个类的实例。

source: Declare your class as follows:
es: Declare su clase de la siguiente manera:
ja: 以下のようにクラスを宣言します。
ko: 다음과 같이 수업을 선언하십시오.
ru: Объявите ваш класс следующим образом:
zh_cn: 申报你的类如下:

source: Define value <code>External Text</code> for namespace variable <code>labelText</code>:
es: Definir valor <code>External Text</code> para la variable de espacio de nombres <code>labelText</code> :
ja: 名前空間変数 <code>labelText</code> の <code>External Text</code> 値を定義します。
ko: 네임 스페이스 변수 <code>labelText</code> 에 대한 <code>External Text</code> 값을 정의하십시오.
ru: Определите значение <code>External Text</code> для переменной пространства имен <code>labelText</code> :
zh_cn: 为名称空间变量 <code>labelText</code> 定义值 <code>External Text</code> ：

source: Due to the limitation on the <code>fx:controller</code> definition in FXML, I personally prefer getting the controller from the FXMLLoader rather than setting the controller into the FXMLLoader.
es: Debido a la limitaci&oacute;n de la definici&oacute;n del <code>fx:controller</code> en FXML, personalmente prefiero obtener el controlador del FXMLLoader en lugar de configurar el controlador en el FXMLLoader.
ja: FXMLでの <code>fx:controller</code> 定義の制限により、コントローラーをFXMLLoaderに設定するのではなく、FXMLLoaderからコントローラーを取得することを個人的に好みます。
ko: FXML의 <code>fx:controller</code> 정의에 대한 제한으로 인해 개인적으로 컨트롤러를 FXMLLoader로 설정하는 대신 FXMLLoader에서 컨트롤러를 얻는 것을 선호합니다.
ru: В связи с ограничением определения <code>fx:controller</code> в FXML, я лично предпочитаю получать контроллер из FXMLLoader, а не устанавливать контроллер в FXMLLoader.
zh_cn: 由于FXML中 <code>fx:controller</code> 定义的限制，我个人更喜欢从FXMLLoader获取控制器，而不是将控制器设置为FXMLLoader。

source: Expand snippet
es: Ampliar fragmento
ja: スニペットを展開
ko: 스 니펫 확장
ru: Расширить фрагмент
zh_cn: 扩展片段

source: FXMLLoader instances themselves never know anything about domain objects. You do not directly pass application specific domain objects into the FXMLLoader constructor, instead you:
es: Las instancias de FXMLLoader por sí mismas nunca saben nada sobre los objetos del dominio.No pasas directamente los objetos de dominio específicos de la aplicación al constructor del FXMLLoader,sino a ti:
ja: FXMLLoader インスタンス自身は、ドメインオブジェクトについて何も知りません。FXMLLoader のコンストラクタにアプリケーション固有のドメインオブジェクトを直接渡すことはありません。
ko: FXMLLoader 인스턴스 자체는 도메인 개체에 대해 전혀 알지 못합니다. 대신 응용 프로그램 특정 도메인 개체를 FXMLLoader 생성자로 직접 전달하지 않습니다.
ru: Сами экземпляры FXMLLoader никогда ничего не знают об объектах домена.Вы не передаете напрямую в конструктор FXMLLoader специфические для приложений доменные объекты,а передаете их непосредственно вам:
zh_cn: FXMLLoader实例本身从来不知道域对象。你不能直接将特定于应用程序的域对象传递到FXMLLoader构造函数中,相反,你可以将域对象直接传递给FXMLLoader。

source: FXMLLoader supports dependency injection systems like Guice, Spring or Java EE CDI by allowing you to set a custom controller factory on the FXMLLoader. This provides a callback that you can use to create the controller instance with dependent values injected by the respective dependency injection system.
es: FXMLLoader soporta sistemas de inyección de dependencia como Guice,Spring o Java EE CDI,permitiéndole establecer una fábrica de controladores personalizados en el FXMLLoader.Esto proporciona una llamada de retorno que puede utilizar para crear la instancia del controlador con los valores de dependencia inyectados por el sistema de inyección de dependencia respectivo.
ja: FXMLLoader は、FXMLLoader 上にカスタムコントローラファクトリを設定することで、Guice や Spring、Java EE CDI のような依存性注入システムをサポートしています。これは、それぞれの依存性注入システムによって注入された依存値を持つコントローラのインスタンスを作成するために使用できるコールバックを提供します。
ko: FXMLLoader는 Guice, Spring 또는 Java EE CDI와 같은 종속성 주입 시스템을 지원하여 FXMLLoader에서 사용자 정의 컨트롤러 팩토리를 설정할 수 있습니다. 이는 각각의 의존성 주입 시스템에 의해 주입 된 의존성 값으로 컨트롤러 인스턴스를 생성하는 데 사용할 수있는 콜백을 제공합니다.
ru: FXMLLoader поддерживает системы впрыска зависимостей,такие как Guice,Spring или Java EE CDI,позволяя установить заводской контроллер на FXMLLoader.Это обеспечивает обратный вызов,который можно использовать для создания экземпляра контроллера с зависимыми значениями,инжектируемыми соответствующей системой инжекции зависимостей.
zh_cn: FXMLLoader支持像Guice、Spring或Java EE CDI这样的依赖注入系统,允许你在FXMLLoader上设置一个自定义控制器工厂。这提供了一个回调,你可以用相应的依赖注入系统注入的依赖值来创建控制器实例。

source: First Controller
es: Primer controlador
ja: ファーストコントローラー
ko: 첫 컨트롤러
ru: Первый контроллер
zh_cn: 首任主计长

source: For example: The user chooses a customer from a <code>TableView</code> and a new window is opened, showing the customer's info.
es: Por ejemplo: el usuario elige un cliente de <code>TableView</code> y se abre una nueva ventana que muestra la informaci&oacute;n del cliente.
ja: 例：ユーザーが <code>TableView</code> から顧客を選択すると、新しいウィンドウが開き、顧客の情報が表示されます。
ko: 예를 들어 : 사용자가 <code>TableView</code> 에서 고객을 선택하면 고객 정보를 보여주는 새 창이 열립니다.
ru: Например: пользователь выбирает клиента из <code>TableView</code> , и открывается новое окно с информацией о клиенте.
zh_cn: 例如：用户从 <code>TableView</code> 中选择一个客户，并打开一个新窗口，显示该客户的信息。

source: For larger, more complicated applications, it would be worthwhile investigating if you want to use <a href="http://www.martinfowler.com/articles/injection.html">Dependency Injection</a> or <a href="https://github.com/google/guava/wiki/EventBusExplained">Event Bus</a> mechanisms within your application.
es: Para aplicaciones m&aacute;s grandes y complicadas, valdr&iacute;a la pena investigar si desea utilizar mecanismos de <a href="http://www.martinfowler.com/articles/injection.html">inyecci&oacute;n de dependencia</a> o <a href="https://github.com/google/guava/wiki/EventBusExplained">bus de eventos</a> dentro de su aplicaci&oacute;n.
ja: 大規模で複雑なアプリケーションの場合、アプリケーション内で<a href="http://www.martinfowler.com/articles/injection.html">依存性注入</a>または<a href="https://github.com/google/guava/wiki/EventBusExplained">イベントバス</a>メカニズムを使用するかどうかを調べることは価値があります。
ko: 더 크고 복잡한 응용 프로그램의 경우 응용 프로그램 내에서 <a href="http://www.martinfowler.com/articles/injection.html">Dependency Injection</a> 또는 <a href="https://github.com/google/guava/wiki/EventBusExplained">Event Bus</a> 메커니즘을 사용하려는 경우 조사하는 것이 좋습니다.
ru: Для более крупных и сложных приложений было бы целесообразно выяснить, хотите ли вы использовать в своем приложении механизмы <a href="http://www.martinfowler.com/articles/injection.html">Dependency Injection</a> или <a href="https://github.com/google/guava/wiki/EventBusExplained">Event Bus</a> .
zh_cn: 对于更大，更复杂的应用程序，如果您想在应用程序中使用<a href="http://www.martinfowler.com/articles/injection.html">依赖注入</a>或<a href="https://github.com/google/guava/wiki/EventBusExplained">事件总线</a>机制，则值得研究。

source: For small applications I highly recommend passing parameters directly from the caller to the controller - it's simple, straightforward and requires no extra frameworks.
es: Para aplicaciones pequeñas recomiendo pasar los parámetros directamente de la persona que llama al controlador-es simple,directo y no requiere de marcos adicionales.
ja: 小規模なアプリケーションには、呼び出し元から直接コントローラにパラメータを渡すことを強くお勧めします。
ko: 작은 응용 프로그램의 경우 호출자에서 컨트롤러로 직접 매개 변수를 전달하는 것이 좋습니다. 간단하고 간단하며 추가 프레임 워크가 필요하지 않습니다.
ru: Для небольших приложений я настоятельно рекомендую передавать параметры непосредственно от вызывающего абонента к контроллеру-это просто,просто и не требует дополнительных каркасов.
zh_cn: 对于小型应用,我强烈推荐从调用者直接将参数传递给控制器--简单、直接,不需要额外的框架。
