Repository: rueisnom/feedback
Catalog: xlf/13/84/04/29/13840429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To determine why <em>PHP</em> code doesn't work in <em>JavaScript</em> code we need to understand what <strong>client side</strong> and <strong>server side</strong> languages are, and how they work.
es: Para determinar por qu&eacute; el c&oacute;digo <em>PHP</em> no funciona en el c&oacute;digo <em>JavaScript</em> , necesitamos comprender qu&eacute; son los idiomas del <strong>lado del</strong> <strong>cliente</strong> y del <strong>servidor</strong> , y c&oacute;mo funcionan.
ja: <em>PHP</em>コードが<em>JavaScript</em>コードで機能しない理由を判別するには、 <strong>クライアント側</strong>および<strong>サーバー側の</strong>言語とは何か、およびそれらがどのように機能するかを理解する必要があり<strong>ます</strong> 。
ko: <em>PHP</em> 코드가 <em>JavaScript</em> 코드에서 작동하지 않는 이유를 확인하려면 <strong>클라이언트 측</strong> 및 <strong>서버 측</strong> 언어가 무엇이며 어떻게 작동하는지 이해해야합니다.
ru: Чтобы определить, почему <em>PHP-</em> код не работает в <em>JavaScript-</em> коде, нам нужно понять, что такое <strong>клиентская</strong> и <strong>серверная части</strong> и как они работают.
zh_cn: 为了确定<em>PHP</em>代码为什么不能在<em>JavaScript</em>代码中运行，我们需要了解什么是<strong>客户端</strong>和<strong>服务器端</strong>语言，以及它们如何工作。

source: What is the difference between client-side and server-side programming
es: ¿Cuál es la diferencia entre la programación del lado del cliente y del lado del servidor
ja: クライアントサイドとサーバーサイドのプログラミングの違いは?
ko: 클라이언트 측과 서버 측 프로그래밍의 차이점은 무엇입니까
ru: В чем разница между клиентским и серверным программированием?
zh_cn: 客户端和服务器端编程有什么区别?

source: Why does this not write "bar" into my text file, but alerts "42"?
es: ¿Por qué esto no escribe "barra" en mi archivo de texto,sino que alerta "42"?
ja: なぜこれは私のテキストファイルに「バー」を書き込まず、「42」を警告するのですか?
ko: 왜 이것이 "bar"를 텍스트 파일에 쓰지 않고 "42"라고 경고합니까?
ru: Почему это не записывает "bar" в мой текстовый файл,а предупреждает "42"?
zh_cn: 为什么我的文本文件中不写 "bar",而是提示 "42"?

source: Wikipedia : Client-side scripting
es: Wikipedia:Guiones del lado del cliente
ja: ウィキペディア:クライアント側スクリプト
ko: Wikipedia : 클라이언트 측 스크립팅
ru: Википедия:Скриптинг на стороне клиента
zh_cn: 维基百科:客户端脚本

source: Wikipedia : Server-side scripting
es: Wikipedia:Guiones del lado del servidor
ja: ウィキペディア.サーバーサイドスクリプト
ko: Wikipedia : 서버 측 스크립팅
ru: Википедия:Серверный скриптинг
zh_cn: 维基百科。服务器端脚本

source: You can also use JavaScript to make the browser open a new page using <code>window.location</code> or submit a form, emulating possibilities 1. and 2.
es: Tambi&eacute;n puede usar JavaScript para hacer que el navegador abra una nueva p&aacute;gina usando <code>window.location</code> o env&iacute;e un formulario, emulando las posibilidades 1. y 2.
ja: JavaScriptを使用して、 <code>window.location</code> を使用してブラウザーに新しいページを開くか、フォームを送信して、可能性1および2をエミュレートすることもできます。
ko: JavaScript를 사용하여 <code>window.location</code> 을 사용하여 브라우저가 새 페이지를 열거 나 양식 1과 2를 에뮬레이트하여 양식을 제출할 수도 있습니다.
ru: Вы также можете использовать JavaScript, чтобы браузер открывал новую страницу с помощью <code>window.location</code> или отправлял форму, эмулируя возможности 1. и 2.
zh_cn: 您还可以使用JavaScript使浏览器使用 <code>window.location</code> 打开新页面或提交表单，以模拟可能性1.和2。

source: You can do so by reloading the page and sending a <em>HTTP</em> request
es: Puede hacerlo volviendo a cargar la p&aacute;gina y enviando una solicitud <em>HTTP</em>
ja: これを行うには、ページをリロードして<em>HTTP</em>リクエストを送信し<em>ます</em>
ko: 페이지를 새로 고침하고 <em>HTTP</em> 요청을 보내면됩니다.
ru: Вы можете сделать это, перезагрузив страницу и отправив запрос <em>HTTP</em>
zh_cn: 您可以通过重新加载页面并发送<em>HTTP</em>请求来实现

source: You can make an AJAX call with JavaScript - this does not require reloading page
es: Puedes hacer una llamada AJAX con JavaScript-esto no requiere recargar la página
ja: JavaScriptでAJAX呼び出しを行うことができます-これはページをリロードする必要はありません。
ko: JavaScript로 AJAX 호출을 할 수 있습니다. 페이지를 다시로드 할 필요가 없습니다.
ru: Вы можете совершить AJAX-звонок с помощью JavaScript-для этого не требуется перезагрузка страницы
zh_cn: 您可以使用JavaScript进行AJAX调用-这不需要重新加载页面。

source: Your Javascript will execute on the client, not on the server. This means that <code>foo</code> is not evaluated on the server side and therefore its value can't be written to a file on the server.
es: Su Javascript se ejecutar&aacute; en el cliente, no en el servidor. Esto significa que <code>foo</code> no se eval&uacute;a en el lado del servidor y, por lo tanto, su valor no se puede escribir en un archivo en el servidor.
ja: JavaScriptはサーバーではなくクライアントで実行されます。 これは、 <code>foo</code> がサーバー側で評価されないため、その値をサーバー上のファイルに書き込むことができないことを意味します。
ko: 자바 스크립트는 서버가 아닌 클라이언트에서 실행됩니다. 이는 <code>foo</code> 가 서버 측에서 평가되지 않으므로 서버의 파일에 해당 값을 쓸 수 없음을 의미합니다.
ru: Ваш Javascript будет выполняться на клиенте, а не на сервере. Это означает, что <code>foo</code> не оценивается на стороне сервера, и поэтому его значение не может быть записано в файл на сервере.
zh_cn: 您的Javascript将在客户端而不是服务器上执行。 这意味着 <code>foo</code> 不会在服务器端进行评估，因此无法将其值写入服务器上的文件。

source: Your code is split into two entirely separate parts, the <em>server side</em> and the <em>client side</em>.
es: Su c&oacute;digo se divide en dos partes completamente separadas, el <em>lado</em> del <em>servidor</em> y el <em>lado del cliente</em> .
ja: コードは、 <em>サーバー側</em>と<em>クライアント側の</em> 2つの完全に異なる部分に分割され<em>ます</em> 。
ko: 코드는 <em>서버 측</em> 과 <em>클라이언트 측으로</em> 완전히 분리 된 두 부분으로 나뉩니다.
ru: Ваш код разделен на две совершенно отдельные части: на <em>стороне сервера</em> и на <em>стороне клиента</em> .
zh_cn: 您的代码分为两个完全独立的部分， <em>服务器端</em>和<em>客户端</em> 。
