Repository: rueisnom/feedback
Catalog: xlf/13/84/04/29/13840429.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <em>Server-side languages (PHP etc.)</em>: They retrieve records from databases, maintain state over the <a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless">stateless <em>HTTP</em> connection</a>, and do a lot of things that require security. They reside on the server, these programs never have their source code exposed to the user.
es: <em>Lenguajes del lado del servidor (PHP, etc.)</em> : recuperan registros de bases de datos, mantienen el estado a trav&eacute;s de la <a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless">conexi&oacute;n <em>HTTP</em> sin estado</a> y hacen muchas cosas que requieren seguridad. Residen en el servidor, estos programas nunca tienen su c&oacute;digo fuente expuesto al usuario.
ja: <em>サーバーサイド言語（PHPなど）</em> ：データベースからレコードを取得し、 <a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless">ステートレス<em>HTTP</em>接続を</a>介して状態を維持し、セキュリティを必要とする多くのことを行います。 これらはサーバーに常駐し、これらのプログラムはソースコードをユーザーに公開しません。
ko: <em>서버 측 언어 (PHP 등)</em> : 데이터베이스에서 레코드를 검색하고 상태 <a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless">비 저장 <em>HTTP</em> 연결을</a> 통해 상태를 유지하며 보안이 필요한 많은 작업을 수행합니다. 그것들은 서버에 상주하며,이 프로그램들은 소스 코드를 사용자에게 노출시키지 않습니다.
ru: <em>Языки на стороне сервера (PHP и т. Д.)</em> : Они извлекают записи из баз данных, поддерживают состояние через <a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless"><em>HTTP-</em> соединение без</a> сохранения состояния и делают много вещей, которые требуют безопасности. Они находятся на сервере, эти программы никогда не открывают пользователю свой исходный код.
zh_cn: <em>服务器端语言（PHP等）</em> ：它们从数据库检索记录，通过<a href="https://stackoverflow.com/questions/4913763/what-does-it-mean-when-they-say-http-is-stateless">无状态<em>HTTP</em>连接</a>维护状态，并执行许多需要安全性的操作。 它们驻留在服务器上，这些程序永远不会向用户公开其源代码。

source: <strong>All PHP code is executed on the server before the client even starts executing any of the JavaScript. There's no PHP code left in the response that JavaScript could interact with.</strong>
es: <strong>Todo el c&oacute;digo PHP se ejecuta en el servidor antes de que el cliente incluso comience a ejecutar JavaScript.</strong> <strong>No queda ning&uacute;n c&oacute;digo PHP en la respuesta con la que JavaScript pueda interactuar.</strong>
ja: <strong>すべてのPHPコードは、クライアントがJavaScriptの実行を開始する前にサーバーで実行されます。</strong> <strong>JavaScriptがやり取りできる応答にPHPコードが残っていません。</strong>
ko: <strong>클라이언트가 JavaScript를 실행하기 전에 모든 PHP 코드가 서버에서 실행됩니다.</strong> <strong>JavaScript가 상호 작용할 수있는 응답에 PHP 코드가 남아 있지 않습니다.</strong>
ru: <strong>Весь код PHP выполняется на сервере еще до того, как клиент начнет выполнять любой из JavaScript.</strong> <strong>В ответе не осталось PHP-кода, с которым мог бы взаимодействовать JavaScript.</strong>
zh_cn: <strong>在客户端甚至开始执行任何JavaScript之前，所有PHP代码都在服务器上执行。</strong> <strong>JavaScript可以与之交互的响应中没有剩下PHP代码。</strong>

source: <strong>Good Read:</strong>
es: <strong>Buena lectura:</strong>
ja: <strong>良い読み：</strong>
ko: <strong>잘 읽음 :</strong>
ru: <strong>Хорошо для чтения:</strong>
zh_cn: <strong>读得好：</strong>

source: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">image attr</a></sub>
es: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">imagen attr</a></sub>
ja: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">画像属性</a></sub>
ko: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">이미지 속성</a></sub>
ru: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">изображение</a></sub>
zh_cn: <sub><a href="http://en.wikipedia.org/wiki/File:Scheme_dynamic_page_en.svg">图像属性</a></sub>

source: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">Image source </a></sub>
es: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">Fuente de imagen</a></sub>
ja: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">画像ソース</a></sub>
ko: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">이미지 소스</a></sub>
ru: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">Источник изображения</a></sub>
zh_cn: <sub><a href="http://www.html.net/tutorials/php/lesson1.php">图片来源</a></sub>

source: A form submission, which submits data to the server and loads a new page.
es: Un formulario que envía datos al servidor y carga una nueva página.
ja: サーバーにデータを送信し、新しいページを読み込むフォーム送信。
ko: 서버에 데이터를 제출하고 새 페이지를로드하는 양식 제출.
ru: Отправка формы,которая отправляет данные на сервер и загружает новую страницу.
zh_cn: 表格提交,将数据提交到服务器,并加载一个新页面。

source: A link, which causes the browser to load a new page.
es: Un enlace,que hace que el navegador cargue una nueva página.
ja: ブラウザに新しいページを読み込ませるリンクです。
ko: 브라우저가 새 페이지를로드하게하는 링크입니다.
ru: Ссылка,по которой браузер загружает новую страницу.
zh_cn: 一个链接,导致浏览器加载一个新页面。

source: An <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX</a> request, which is a Javascript technique to make a regular HTTP request to the server (like 1. and 2. will), but without leaving the current page.
es: Una solicitud <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX</a> , que es una t&eacute;cnica de Javascript para realizar una solicitud HTTP regular al servidor (como 1. y 2. lo har&aacute;), pero sin salir de la p&aacute;gina actual.
ja: <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX</a>要求。これは、現在のページを離れることなく、サーバーに通常のHTTP要求（1や2.のように）を行うJavascript手法です。
ko: <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX</a> 요청. 현재 페이지를 떠나지 않고 서버에 정기적 인 HTTP 요청을하는 (1과 2와 같은) 자바 스크립트 기술인 AJAX 요청.
ru: <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX-</a> запрос, который представляет собой технику Javascript для выполнения регулярного HTTP-запроса к серверу (например, 1. и 2. будет), но не покидая текущей страницы.
zh_cn: <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAX</a>请求，这是一种向服务器发出常规HTTP请求的Javascript技术（如1.和2.将），但不离开当前页面。

source: By the way, making a habit of embedding random pieces of PHP logic in HTML or Javascript can lead to seriously convoluted code. I speak from painful experience.
es: Por cierto,el hábito de incrustar piezas aleatorias de lógica PHP en HTML o Javascript puede llevar a un código muy enrevesado.Hablo desde una experiencia dolorosa.
ja: ところで、HTMLやJavascriptにPHPのロジックのランダムな部分を埋め込むことを習慣にすると、非常に複雑なコードになってしまうことがあります。私は苦しい経験から話しています。
ko: 그건 그렇고, 임의의 PHP 로직 조각을 HTML 또는 Javascript에 포함시키는 습관을 들이면 코드가 크게 복잡해질 수 있습니다. 나는 고통스러운 경험에서 말합니다.
ru: Кстати,привычка встраивать случайные кусочки PHP-логики в HTML или Javascript может привести к серьезной запутанности кода.Я говорю на основании болезненного опыта.
zh_cn: 顺便说一下,习惯于在HTML或Javascript中嵌入随机的PHP逻辑,会导致代码严重混乱。我说的是痛苦的经验。

source: Client side programming is with html code with Java script and its frameworks, libraries executes in the internet explorer, Mozilla, chrome browsers. In the java scenario server side programming servlets executes in the Tomcat, web-logic , j boss, WebSphere severs
es: La programación del lado del cliente es con código html con Java script y sus marcos,las bibliotecas se ejecutan en el explorador de Internet,Mozilla,navegadores cromados.En el escenario java,la programación del lado del servidor se ejecuta en el Tomcat,web-logic,j boss,WebSphere severs.
ja: クライアント側のプログラミングは、JavaスクリプトとそのフレームワークとHTMLコードであり、ライブラリは、インターネットエクスプローラ、Mozilla、クロームブラウザで実行されます。Javaのシナリオではサーバー側のプログラミングサーブレットは、Tomcat、web-logic、jボス、WebSphereのセバースで実行されます。
ko: 클라이언트 측 프로그래밍은 Java 스크립트 및 해당 프레임 워크가 포함 된 HTML 코드를 사용하며 라이브러리는 인터넷 탐색기, Mozilla, 크롬 브라우저에서 실행됩니다. 자바 시나리오에서 서버 측 프로그래밍 서블릿은 Tomcat, web-logic, j boss, WebSphere 서버에서 실행됩니다.
ru: Программирование на стороне клиента осуществляется с помощью html-кода с Java-скриптом и его фреймворками,библиотеки выполняются в браузерах Internet Explorer,Mozilla,chrome.В java-скрипте сервлеты серверной стороны программирования выполняется в Tomcat,веб-логика,j босс,WebSphere severs.
zh_cn: 客户端编程是用html代码与Java脚本及其框架、库在互联网浏览器、Mozilla、chrome浏览器中执行。在java场景下,服务器端编程servlets在Tomcat、web-logic、j boss、WebSphere severs中执行。

source: Here's a question outlining these method in greater detail
es: Aquí hay una pregunta que describe este método con mayor detalle
ja: これらの方法をより詳しく説明するための質問です。
ko: 이 방법을보다 자세하게 설명하는 질문이 있습니다.
ru: Вот вопрос,описывающий этот метод более подробно.
zh_cn: 下面是一个问题,详细介绍一下这些方法。

source: I have this code:
es: Tengo este código:
ja: 私はこのコードを持っています。
ko: 이 코드가 있습니다 :
ru: У меня есть этот код:
zh_cn: 我有这个代码。

source: In web application every task execute in a manner of request and response.
es: En la aplicación web cada tarea se ejecuta en forma de solicitud y respuesta.
ja: Webアプリケーションでは、すべてのタスクがリクエストとレスポンスの形で実行されます。
ko: 웹 애플리케이션에서 모든 작업은 요청 및 응답 방식으로 실행됩니다.
ru: В веб-приложении каждая задача выполняется в виде запроса и ответа.
zh_cn: 在Web应用中,每个任务都是以请求和响应的方式执行。

source: JavaScript is visible to the user and can be easily modified, so for security stuff we must not rely on JavaScript.
es: El Javascript es visible para el usuario y puede ser fácilmente modificado,por lo que para cuestiones de seguridad no debemos confiar en el Javascript.
ja: JavaScriptはユーザーから見えていて、簡単に変更できるので、セキュリティのためにはJavaScriptに頼ってはいけません。
ko: JavaScript는 사용자가 볼 수 있으며 쉽게 수정할 수 있으므로 보안을 위해 JavaScript에 의존해서는 안됩니다.
ru: JavaScript виден пользователю и может быть легко модифицирован,поэтому для обеспечения безопасности мы не должны полагаться на JavaScript.
zh_cn: JavaScript对用户来说是可见的,可以很容易被修改,所以对于安全的东西,我们一定不能依赖JavaScript。

source: Madara Uchiha : Difference between client side and server side programming
es: Madara Uchiha:Diferencia entre la programación del lado del cliente y del lado del servidor
ja: 内葉まだら:クライアントサイドとサーバーサイドのプログラミングの違い
ko: Madara Uchiha : 클라이언트 측과 서버 측 프로그래밍의 차이점
ru: Мадара Учиха:Разница между программированием на стороне клиента и программированием на стороне сервера
zh_cn: Madara Uchiha:客户端和服务器端编程的区别

source: NB: Earlier revisions of this question were explicitly about PHP on the server and JavaScript on the client. The essential nature of the problem and solutions is the same for <em>any</em> pair of languages when one is running on the client and the other on the server (even if they are the same language). Please take this in to account when you see answers talking about specific languages.
es: NB: Las revisiones anteriores de esta pregunta fueron expl&iacute;citamente sobre PHP en el servidor y JavaScript en el cliente. La naturaleza esencial del problema y las soluciones es la misma para <em>cualquier</em> par de idiomas cuando uno se ejecuta en el cliente y el otro en el servidor (incluso si son del mismo idioma). Tenga esto en cuenta cuando vea respuestas que hablan sobre idiomas espec&iacute;ficos.
ja: 注意：この質問の以前の改訂は、サーバー上のPHPとクライアント上のJavaScriptについて明示的に行われていました。 問題と解決策の本質的な性質は、一方がクライアントで実行され、もう一方がサーバーで実行されている場合、同じ言語であっても、 <em>どの</em>言語ペアでも同じです。 特定の言語について話している回答が表示された場合は、このことを考慮に入れてください。
ko: 주의 :이 질문의 이전 개정은 서버의 PHP와 클라이언트의 JavaScript에 관한 것입니다. 문제와 솔루션의 본질적 특성은 클라이언트와 서버에서 서로 같은 언어를 사용하는 경우 언어 쌍에 <em>관계없이</em> 동일합니다. 특정 언어에 대한 답변이 표시 될 때이를 고려하십시오.
ru: NB: более ранние версии этого вопроса были явно о PHP на сервере и JavaScript на клиенте. Основная сущность проблемы и решения одинаковы для <em>любой</em> пары языков, когда один работает на клиенте, а другой на сервере (даже если это один и тот же язык). Пожалуйста, примите это во внимание, когда увидите ответы, говорящие на конкретных языках.
zh_cn: 注意：此问题的早期修订版本明确涉及服务器上的PHP和客户端上的JavaScript。 当一种语言在客户端上运行而另一种语言在服务器上运行时，问题和解决方案的本质对于<em>任何</em>一对语言都是相同的（即使它们是相同的语言）。 当您看到有关特定语言的答案时，请考虑到这一点。

source: On the other hand, <em>Client Side Languages (like JavaScript)</em> reside in browser and run in the browser. <em>Client-side scripting</em> generally refers to the class of computer programs on the web that are executed client-side, by the user's web browser, instead of <em>server-side</em>.
es: Por otro lado, los <em>idiomas del lado del cliente (como JavaScript)</em> residen en el navegador y se ejecutan en el navegador. <em>Las secuencias de comandos del lado del cliente</em> generalmente se refieren a la clase de programas de computadora en la web que se ejecutan del lado del cliente, por el navegador web del usuario, en lugar del <em>lado</em> del <em>servidor</em> .
ja: 一方、 <em>クライアント側言語（JavaScriptなど）</em>はブラウザーに常駐し、ブラウザーで実行されます。 <em>クライアントサイドスクリプティング</em>とは、通常、 <em>サーバーサイド</em>ではなく、ユーザーのウェブブラウザによってクライアントサイドで実行されるウェブ上のコンピュータープログラムのクラスを指し<em>ます</em> 。
ko: 반면에 <em>JavaScript와 같은 클라이언트 측 언어</em> 는 브라우저에 상주하고 브라우저에서 실행됩니다. <em>클라이언트 쪽 스크립팅은</em> 일반적으로 <em>서버 쪽</em> 대신 사용자의 웹 브라우저에 의해 클라이언트 쪽에서 실행되는 웹상의 컴퓨터 프로그램 클래스를 말합니다.
ru: С другой стороны, <em>клиентские языки (например, JavaScript)</em> находятся в браузере и запускаются в браузере. <em>Сценарии на стороне клиента</em> обычно относятся к классу компьютерных программ в сети, которые выполняются на стороне клиента, веб-браузером пользователя, а не на <em>стороне сервера</em> .
zh_cn: 另一方面， <em>客户端语言（如JavaScript）</em>驻留在浏览器中并在浏览器中运行。 <em>客户端脚本</em>通常是指网络上由用户的Web浏览器而不是<em>服务器</em>端在客户端执行的计算机程序的类。

source: So now what can I do if I need to call PHP? It depends how you need to do it: either by reloading the page or by using an AJAX call.
es: ¿Y ahora qué puedo hacer si necesito llamar a PHP? Depende de cómo lo necesites:o recargando la página o usando una llamada AJAX.
ja: では、PHPを呼び出す必要がある場合はどうすればいいのでしょうか?ページをリロードするかAJAXコールを使用するかのどちらかです。
ko: PHP를 호출해야한다면 어떻게해야합니까? 페이지를 다시로드하거나 AJAX 호출을 사용하여 수행 방법에 따라 다릅니다.
ru: Итак,что я могу сделать,если мне нужно позвонить на PHP? Это зависит от того,как это нужно сделать:либо перезагрузив страницу,либо используя вызов AJAX.
zh_cn: 那么现在,如果我需要调用PHP,该怎么做呢?这要看你需要怎么做了:通过重载页面或者使用AJAX调用。

source: So when you make a <em>HTTP</em> request on server, the server first reads the PHP file carefully to see if there are any tasks that need to be executed, and sends a response to the client side. Again, as @deceze said, *Once PHP has finished outputting the response, the script ends and nothing will happen on the server until a new <em>HTTP</em> request comes in.*
es: Entonces, cuando realiza una solicitud <em>HTTP</em> en el servidor, el servidor primero lee el archivo PHP cuidadosamente para ver si hay alguna tarea que deba ejecutarse, y env&iacute;a una respuesta al lado del cliente. Nuevamente, como dijo @deceze, * Una vez que PHP haya terminado de enviar la respuesta, el script finaliza y no pasar&aacute; nada en el servidor hasta que llegue una nueva solicitud <em>HTTP</em> . *
ja: したがって、サーバーで<em>HTTP</em>要求を行うと、サーバーはまずPHPファイルを注意深く読み取り、実行する必要のあるタスクがあるかどうかを確認し、クライアント側に応答を送信します。 繰り返しますが、@ decezeが言ったように、* PHPが応答の出力を完了すると、スクリプトは終了し、新しい<em>HTTP</em>リクエストが着信するまでサーバー上で何も起こりません。*
ko: 따라서 서버에서 <em>HTTP</em> 요청을 할 때 서버는 먼저 PHP 파일을주의해서 읽고 실행해야 할 작업이 있는지 확인한 후 클라이언트쪽에 응답을 보냅니다. @deceze가 말했듯이 PHP가 응답 출력을 마치면 스크립트가 종료되고 새로운 <em>HTTP</em> 요청이 올 때까지 서버에서 아무 일도 일어나지 않습니다. *
ru: Поэтому, когда вы делаете <em>HTTP-</em> запрос на сервере, сервер сначала внимательно читает файл PHP, чтобы посмотреть, есть ли какие-либо задачи, которые необходимо выполнить, и отправляет ответ клиентской стороне. Опять же, как сказал @deceze, * Как только PHP закончит вывод ответа, сценарий завершится, и на сервере ничего не произойдет, пока не поступит новый <em>HTTP-</em> запрос. *
zh_cn: 因此，当您在服务器上发出<em>HTTP</em>请求时，服务器首先会仔细读取PHP文件，以查看是否需要执行任何任务，然后将响应发送到客户端。 再次，如@deceze所说，*一旦PHP完成输出响应，脚本便会结束，并且在服务器上什么也不会发生，直到有一个新的<em>HTTP</em>请求进入为止。

source: So you can easily see that server side languages handle HTTP requests and process them, and, as @deceze said, <em>PHP is executed on the server and outputs some HTML, and maybe JavaScript code, which is sent as a response to the client, where the HTML is interpreted and JavaScript is executed.</em>
es: Por lo tanto, puede ver f&aacute;cilmente que los lenguajes del lado del servidor manejan las solicitudes HTTP y las procesan, y, como dijo @deceze, <em>PHP se ejecuta en el servidor y genera un c&oacute;digo HTML, y tal vez JavaScript, que se env&iacute;a como respuesta al cliente, donde se interpreta el HTML y se ejecuta JavaScript.</em>
ja: したがって、サーバー側の言語がHTTPリクエストを処理して処理することを簡単に確認できます。@ decezeが言ったように、 <em>PHPはサーバー上で実行され、クライアントに応答として送信されるHTMLとJavaScriptコードを出力します。 HTMLが解釈され、JavaScriptが実行されます。</em>
ko: 따라서 서버 측 언어가 HTTP 요청을 처리하고 처리한다는 것을 쉽게 알 수 있으며, @deceze가 말했듯이 <em>PHP는 서버에서 실행되어 일부 HTML 및 JavaScript 코드를 출력합니다.이 코드는 클라이언트에 대한 응답으로 전송됩니다. HTML이 해석되고 JavaScript가 실행됩니다.</em>
ru: Таким образом, вы можете легко увидеть, что серверные языки обрабатывают HTTP-запросы и обрабатывают их, и, как сказал @deceze, <em>PHP выполняется на сервере и выводит некоторый HTML, а возможно и код JavaScript, который отправляется в ответ клиенту, где HTML интерпретируется и JavaScript выполняется.</em>
zh_cn: 因此，您可以轻松地看到服务器端语言处理HTTP请求并处理它们，正如@deceze所说， <em>PHP在服务器上执行，并输出一些HTML（也许是JavaScript代码），并作为响应发送给客户端。 HTML被解释并执行JavaScript。</em>

source: Step 1, PHP executes all code between <code>&lt;?php ?&gt;</code> tags. The result is this:
es: Paso 1, PHP ejecuta todo el c&oacute;digo entre las etiquetas <code>&lt;?php ?&gt;</code> . El resultado es este:
ja: ステップ1、PHPは <code>&lt;?php ?&gt;</code> タグの間のすべてのコードを実行します。 結果はこれです：
ko: 1 단계, PHP는 <code>&lt;?php ?&gt;</code> 태그 사이의 모든 코드를 실행합니다. 결과는 다음과 같습니다.
ru: Шаг 1, PHP выполняет весь код между тегами <code>&lt;?php ?&gt;</code> . Результат таков:
zh_cn: 步骤1，PHP执行 <code>&lt;?php ?&gt;</code> 标记之间的所有代码。 结果是这样的：

source: The <code>file_put_contents</code> call did not result in anything, it just wrote " + foo + " into a file. The <code>&lt;?php echo 42; ?&gt;</code> call resulted in the output "42", which is now in the spot where that code used to be.
es: La llamada <code>file_put_contents</code> no result&oacute; en nada, simplemente escribi&oacute; "+ foo +" en un archivo. El <code>&lt;?php echo 42; ?&gt;</code> ?&gt; call result&oacute; en la salida "42", que ahora est&aacute; en el lugar donde sol&iacute;a estar ese c&oacute;digo.
ja: <code>file_put_contents</code> の呼び出しでは何も発生せず、「+ foo +」がファイルに書き込まれただけです。 <code>&lt;?php echo 42; ?&gt;</code> ？&gt;呼び出しの結果、出力 "42"が返されました。これは、そのコードが以前あった場所にあります。
ko: <code>file_put_contents</code> 호출은 아무것도 발생하지 않았으며 파일에 "+ foo +"를 썼습니다. <code>&lt;?php echo 42; ?&gt;</code> ?&gt; 호출은 출력 "42"를 가져 왔으며, 이제 해당 코드가 있던 위치에 있습니다.
ru: <code>file_put_contents</code> ни к чему не привел , он просто записал "+ foo +" в файл. <code>&lt;?php echo 42; ?&gt;</code> ?&gt; вызов привел к выводу &laquo;42&raquo;, который сейчас находится в том месте, где был этот код.
zh_cn: <code>file_put_contents</code> 调用没有任何结果，它只是在文件中写入了&ldquo; + foo +&rdquo;。 <code>&lt;?php echo 42; ?&gt;</code> ？&gt;调用导致输出&ldquo; 42&rdquo;，该输出现在位于该代码以前所在的位置。

source: The best way to think about this process is as if you're generating a text file dynamically. The text you're generating only becomes executable code once the browser interprets it. Only what you place between <code>&lt;?php</code> tags is evaluated on the server.
es: La mejor manera de pensar en este proceso es como si estuviera generando un archivo de texto din&aacute;micamente. El texto que est&aacute; generando solo se convierte en c&oacute;digo ejecutable una vez que el navegador lo interpreta. Solo lo que coloca entre las etiquetas <code>&lt;?php</code> se eval&uacute;a en el servidor.
ja: このプロセスについて考える最良の方法は、テキストファイルを動的に生成する場合と同じです。 生成するテキストは、ブラウザーが解釈した後にのみ実行可能コードになります。 <code>&lt;?php</code> タグの間に配置したものだけがサーバーで評価されます。
ko: 이 프로세스를 생각하는 가장 좋은 방법은 마치 텍스트 파일을 동적으로 생성하는 것입니다. 생성하는 텍스트는 브라우저가 해석 한 후에 만 ​​실행 가능한 코드가됩니다. <code>&lt;?php</code> 태그 사이에 배치 한 것만 서버에서 평가됩니다.
ru: Лучший способ подумать об этом процессе - создать динамический текстовый файл. Текст, который вы генерируете, становится исполняемым кодом только после того, как браузер его интерпретирует. Только то, что вы помещаете между тегами <code>&lt;?php</code> оценивается на сервере.
zh_cn: 考虑此过程的最佳方法是好像正在动态生成文本文件。 您生成的文本仅在浏览器解释后成为可执行代码。 服务器上仅评估您在 <code>&lt;?php</code> 标记之间放置的内容。

source: The example code executes like this:
es: El código de ejemplo se ejecuta así:
ja: 例のコードは次のように実行されます。
ko: 예제 코드는 다음과 같이 실행됩니다.
ru: Пример кода выполняется вот так:
zh_cn: 示例代码的执行方式是这样的。

source: The two sides communicate via HTTP requests and responses. PHP is executed on the server and outputs some HTML and maybe JavaScript code which is sent as response to the client where the HTML is interpreted and the JavaScript is executed. Once PHP has finished outputting the response, the script ends and nothing will happen on the server until a new HTTP request comes in.
es: Las dos partes se comunican a través de solicitudes y respuestas HTTP.PHP se ejecuta en el servidor y produce un poco de código HTML y tal vez Javascript que se envía como respuesta al cliente donde se interpreta el HTML y se ejecuta el Javascript.Una vez que PHP ha terminado de producir la respuesta,el script termina y no pasará nada en el servidor hasta que una nueva solicitud HTTP llegue.
ja: 両者はHTTPリクエストとレスポンスを介して通信します。PHPはサーバー上で実行され、HTMLとJavaScriptのコードを出力します。PHPがレスポンスの出力を終えると、スクリプトは終了し、新しいHTTPリクエストが来るまでサーバー上では何も起こりません。
ko: 양측은 HTTP 요청 및 응답을 통해 통신합니다. PHP는 서버에서 실행되며 HTML이 해석되고 JavaScript가 실행되는 클라이언트에 대한 응답으로 전송되는 일부 HTML 및 JavaScript 코드를 출력합니다. PHP가 응답 출력을 마치면 스크립트가 종료되고 새로운 HTTP 요청이 올 때까지 서버에서 아무 일도 일어나지 않습니다.
ru: Обе стороны общаются через HTTP-запросы и ответы.PHP выполняется на сервере и выводит некоторый HTML и,возможно,JavaScript-код,который посылается как ответ клиенту,где HTML интерпретируется и JavaScript выполняется.Как только PHP закончит вывод ответа,скрипт заканчивается и ничего не произойдет на сервере,пока не поступит новый HTTP-запрос.
zh_cn: 双方通过HTTP请求和响应进行通信。PHP在服务器上执行,并输出一些HTML和JavaScript代码,作为响应发送给客户端,HTML被解释,JavaScript被执行。一旦PHP完成输出响应后,脚本就结束了,在新的HTTP请求进来之前,服务器上不会发生任何事情。

source: This resulting HTML/JavaScript code is now sent to the client, where it gets evaluated. The <code>alert</code> call works, while the <code>foo</code> variable is not used anywhere.
es: Este c&oacute;digo HTML / JavaScript resultante ahora se env&iacute;a al cliente, donde se eval&uacute;a. La llamada de <code>alert</code> a funciona, mientras que la variable <code>foo</code> no se usa en ning&uacute;n lado.
ja: この結果のHTML / JavaScriptコードはクライアントに送信され、そこで評価されます。 <code>alert</code> 呼び出しは機能しますが、 <code>foo</code> 変数はどこでも使用されません。
ko: 이 결과 HTML / JavaScript 코드가 이제 클라이언트로 전송되어 평가됩니다. <code>alert</code> 호출은 작동하지만 <code>foo</code> 변수는 어디에도 사용되지 않습니다.
ru: Этот результирующий код HTML / JavaScript теперь отправляется клиенту, где он оценивается. Вызов <code>alert</code> работает, а переменная <code>foo</code> нигде не используется.
zh_cn: 现在，此生成的HTML / JavaScript代码将发送到客户端，并在客户端进行评估。 <code>alert</code> 调用有效，而 <code>foo</code> 变量未在任何地方使用。

source: To call some PHP code, the client will have to send a new HTTP request to the server. This can happen using one of three possible methods:
es: Para llamar a algún código PHP,el cliente tendrá que enviar una nueva petición HTTP al servidor.Esto puede suceder usando uno de los tres métodos posibles:
ja: PHP のコードを呼び出すには、クライアントはサーバーに新しい HTTP リクエストを送信しなければなりません。これには、3 つのメソッドのうちの 1 つを使用します。
ko: 일부 PHP 코드를 호출하려면 클라이언트가 서버에 새로운 HTTP 요청을 보내야합니다. 가능한 세 가지 방법 중 하나를 사용하여 발생할 수 있습니다.
ru: Чтобы вызвать PHP-код,клиент должен будет отправить новый HTTP-запрос на сервер.Это может произойти одним из трех возможных способов:
zh_cn: 要调用一些PHP代码,客户端必须向服务器发送一个新的HTTP请求。这可以通过三种可能的方法之一来实现。
