Repository: rueisnom/feedback
Catalog: xlf/71/72/78/4/7172784.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (<code>-H</code> is short for <code>--header</code>, <code>-d</code> for <code>--data</code>)
es: ( <code>-H</code> es la abreviatura de <code>--header</code> , <code>-d</code> para <code>--data</code> )
ja: （ <code>-H</code> は <code>--header</code> の略で 、 <code>-d</code> は <code>--data</code> の略です ）
ko: ( <code>-H</code> 는 <code>--header</code> 의 약어 , <code>-d</code> 는 <code>--data</code> 의 약어 )
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">( </font></font> <code>-H</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> это сокращение от </font></font> <code>--header</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>--data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>
zh_cn: （ <code>-H</code> 代表 <code>--header</code> ， <code>-d</code> 代表 <code>--data</code> ）

source: <a href="https://httpie.org/">HTTPie</a> is a recommended alternative to <code>curl</code> because you can do just
es: <a href="https://httpie.org/">HTTPie</a> es una alternativa recomendada para <code>curl</code> porque puedes hacer solo
ja: <a href="https://httpie.org/">HTTPie</a>は <code>curl</code> に代わる推奨手段です。
ko: <a href="https://httpie.org/">HTTPie</a> 는 <code>curl</code> 권장하는 대안입니다.
ru: <a href="https://httpie.org/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">HTTPie</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является рекомендуемой альтернативой </font></font> <code>curl</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> потому что вы можете просто</font></font>
zh_cn: 建议使用<a href="https://httpie.org/">HTTPie</a>替代 <code>curl</code> ,因为您可以

source: <code>--data</code> Means the data you want to send.
es: <code>--data</code> Significa los datos que desea enviar.
ja: <code>--data</code> 送信するデータを意味します。
ko: <code>--data</code> 보내려는 데이터를 의미합니다.
ru: <code>--data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Означает данные, которые вы хотите отправить.</font></font>
zh_cn: <code>--data</code> 表示要发送的数据。

source: <code>-X</code> Means the http verb.
es: <code>-X</code> Significa el verbo http.
ja: <code>-X</code> http動詞を意味します。
ko: <code>-X</code> http 동사를 의미합니다.
ru: <code>-X</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Означает глагол http.</font></font>
zh_cn: <code>-X</code> 表示http动词。

source: <code>IdOnly</code> is a simple <a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object">POJO</a> with an id property.
es: <code>IdOnly</code> es un <a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object">POJO</a> simple con una propiedad de identificaci&oacute;n.
ja: <code>IdOnly</code> は、idプロパティを持つ単純な<a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object">POJO</a>です。
ko: <code>IdOnly</code> 는 id 속성을 가진 간단한 <a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object">POJO</a> 입니다.
ru: <code>IdOnly</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - это простой </font></font><a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">POJO</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> со свойством id.</font></font>
zh_cn: <code>IdOnly</code> 是一个具有id属性的简单<a href="http://en.wikipedia.org/wiki/Plain_Old_Java_Object">POJO</a> 。

source: <em>Note: There are several options for automated request generation in the drop-down list, which is why I thought my post was neccessary in the first place.</em>
es: <em>Nota: Hay varias opciones para la generaci&oacute;n autom&aacute;tica de solicitudes en la lista desplegable, por lo que pens&eacute; que mi publicaci&oacute;n era necesaria en primer lugar.</em>
ja: <em>注：ドロップダウンリストには自動リクエスト生成のオプションがいくつかあります。そのため、そもそも投稿が必要だと思いました。</em>
ko: <em>참고 : 드롭 다운 목록에 자동 요청 생성을위한 몇 가지 옵션이 있으므로 처음에 게시물이 필요하다고 생각한 것입니다.</em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Примечание: в раскрывающемся списке есть несколько вариантов автоматической генерации запросов, поэтому я решил, что мой пост был необходим в первую очередь.</font></font></em>
zh_cn: <em>注意：下拉列表中有多个自动生成请求的选项，这就是为什么我认为我的帖子首先是必需的。</em>

source: <em>The server refused this request because the request entity is in a format not supported by the requested resource for the requested method ().</em>
es: <em>El servidor rechaz&oacute; esta solicitud porque la entidad de solicitud est&aacute; en un formato no admitido por el recurso solicitado para el m&eacute;todo solicitado ().</em>
ja: <em>要求エンティティが要求されたメソッド（）の要求されたリソースでサポートされていない形式であるため、サーバーはこの要求を拒否しました。</em>
ko: <em>요청 엔티티가 요청 된 메소드 ()에 대해 요청 된 자원이 지원하지 않는 형식이므로 서버가이 요청을 거부했습니다.</em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сервер отклонил этот запрос, потому что объект запроса находится в формате, который не поддерживается запрошенным ресурсом для запрошенного метода ().</font></font></em>
zh_cn: <em>服务器拒绝了此请求，因为请求实体的格式不受请求的方法所请求的资源支持。</em>

source: Also, it's often still necessary to add the Content Type headers. You can do this once, though, to set a default, of add config files per-method per-site: <a href="https://github.com/micha/resty#setting-the-default-curl-options">Setting default RESTY options</a>
es: Adem&aacute;s, a menudo todav&iacute;a es necesario agregar los encabezados de Tipo de contenido. Sin embargo, puede hacer esto una vez para establecer un valor predeterminado de agregar archivos de configuraci&oacute;n por m&eacute;todo por sitio: <a href="https://github.com/micha/resty#setting-the-default-curl-options">Configuraci&oacute;n de las opciones de RESTY predeterminadas</a>
ja: また、コンテンツタイプヘッダーを追加する必要がある場合もあります。 ただし、デフォルトを設定するために、メソッドごと、サイトごとに構成ファイルを追加することで、これを一度行うことができ<a href="https://github.com/micha/resty#setting-the-default-curl-options">ます。デフォルトのRESTYオプションの設定</a>
ko: 또한 여전히 콘텐츠 유형 헤더를 추가해야합니다. 그러나 사이트 당 메소드 당 구성 파일 추가의 기본값을 설정하기 위해이 작업을 한 번 수행 할 수 있습니다. <a href="https://github.com/micha/resty#setting-the-default-curl-options">기본 RESTY 옵션 설정</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, часто все еще необходимо добавлять заголовки типа контента. </font><font style="vertical-align: inherit;">Вы можете сделать это один раз, чтобы установить по умолчанию добавление файлов конфигурации для каждого метода для каждого сайта: </font></font><a href="https://github.com/micha/resty#setting-the-default-curl-options"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Настройка параметров RESTY по умолчанию</font></font></a>
zh_cn: 另外，通常仍然需要添加Content Type标头。 但是，您可以执行一次此操作，以设置默认值，即每个站点的每个方法添加配置文件： <a href="https://github.com/micha/resty#setting-the-default-curl-options">设置默认的RESTY选项</a>

source: As an example, create a JSON file, params.json, and add this content to it:
es: Por ejemplo,crear un archivo JSON,params.json,y agregarle este contenido:
ja: 例としては、params.jsonというJSONファイルを作成し、そこにこの内容を追加します。
ko: 예를 들어, JSON 파일 params.json을 작성하고이 컨텐츠를 여기에 추가하십시오.
ru: В качестве примера,создайте JSON файл,params.json,и добавьте в него это содержимое:
zh_cn: 作为一个例子,创建一个JSON文件params.json,并在其中添加这样的内容。

source: But the following worked:
es: Pero lo siguiente funcionó:
ja: しかし、以下のような効果がありました。
ko: 그러나 다음은 효과가있었습니다.
ru: Но следующее сработало:
zh_cn: 但是,下面的做法却起到了作用。

source: Click on <code>Code</code>
es: Haga clic en el <code>Code</code>
ja: <code>Code</code> クリックします
ko: <code>Code</code> 클릭하십시오
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Нажмите на </font></font> <code>Code</code>
zh_cn: 点击 <code>Code</code>

source: For Windows, having a single quote for the <code>-d</code> value did not work for me, but it did work after changing to double quote. Also I needed to escape double quotes inside curly brackets.
es: Para Windows, tener una comilla simple para el valor <code>-d</code> no funcion&oacute; para m&iacute;, pero funcion&oacute; despu&eacute;s de cambiar a comillas dobles. Tambi&eacute;n necesitaba escapar de las comillas dobles entre llaves.
ja: Windowsの場合、 <code>-d</code> 値に単一引用符を付けることは私にとってはうまくいきませんでしたが、二重引用符に変更した後はうまくいきました。 また、中括弧内の二重引用符をエスケープする必要がありました。
ko: Windows의 경우 <code>-d</code> 값에 작은 따옴표를 사용하면 작동하지 않지만 큰 따옴표로 변경하면 작동합니다. 또한 중괄호 안에 큰 따옴표를 이스케이프 처리해야했습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для Windows наличие одинарной кавычки для </font><font style="vertical-align: inherit;">значения </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не сработало, но сработало после перехода на двойную кавычку. </font><font style="vertical-align: inherit;">Также мне нужно было избегать двойных кавычек внутри фигурных скобок.</font></font>
zh_cn: 对于Windows，对 <code>-d</code> 值使用单引号对我来说不起作用，但在更改为双引号后它确实起作用。 另外，我需要在花括号中转义双引号。

source: Full example
es: Ejemplo completo
ja: 完全な例
ko: 전체 예
ru: Полный пример
zh_cn: 全例

source: Full example:
es: Un ejemplo completo:
ja: 完全な例です。
ko: 전체 예 :
ru: Полный пример:
zh_cn: 完整的例子。

source: Here is another way to do it, if you have dynamic data to be included.
es: Aquí hay otra forma de hacerlo,si tienes datos dinámicos que incluir.
ja: 動的データが含まれる場合は、別の方法を紹介します。
ko: 동적 데이터가 포함 된 경우이를 수행하는 다른 방법이 있습니다.
ru: Вот еще один способ сделать это,если у вас есть динамические данные для включения.
zh_cn: 下面是另一种方法,如果你有动态数据要收录的话。

source: How do I POST JSON data with cURL
es: ¿Cómo puedo publicar los datos de JSON con cURL
ja: cURLでJSONデータをPOSTするには?
ko: cURL을 사용하여 JSON 데이터를 게시하는 방법
ru: Как мне ПОСТАВИТЬ данные с помощью cURL
zh_cn: 如何用cURL发布JSON数据?

source: I am using the below format to test with a web server.
es: Estoy usando el siguiente formato para probar con un servidor web.
ja: 私は以下のような形式でWebサーバーを使ってテストしています。
ko: 웹 서버로 테스트하기 위해 아래 형식을 사용하고 있습니다.
ru: Я использую приведенный ниже формат для тестирования с веб-сервером.
zh_cn: 我是用下面的格式来测试一个Web服务器。

source: I just run into the same problem. I could solve it by specifying
es: Me encuentro con el mismo problema.Podría resolverlo especificando
ja: ちょうど同じ問題に遭遇しました。を指定することで解決できました。
ko: 방금 같은 문제가 발생했습니다. 나는 그것을 지정하여 해결할 수 있었다
ru: Я просто столкнулся с той же проблемой.Я могу решить ее,уточнив
zh_cn: 我只是遇到了同样的问题。我可以通过指定

source: I ran into this again today, using Cygwin's cURL 7.49.1 for Windows... And when using <code>--data</code> or <code>--data-binary</code> with a JSON argument, cURL got confused and would interpret the <code>{}</code> in the JSON as a URL template. Adding a <code>-g</code> argument to turn off cURL globbing fixed that.
es: Me encontr&eacute; con esto nuevamente hoy, usando cURL 7.49.1 de Cygwin para Windows ... Y cuando uso <code>--data</code> o <code>--data-binary</code> con un argumento JSON, cURL se confundi&oacute; e interpretar&iacute;a el <code>{}</code> en el JSON como una URL modelo. Agregar un argumento <code>-g</code> para desactivar cURL globbing solucion&oacute; eso.
ja: 私は今日、CygwinのcURL 7.49.1 for Windowsを使用してこれに再び遭遇しました...そして、JSON引数で <code>--data</code> または <code>--data-binary</code> を使用すると、cURLは混乱し、JSONの <code>{}</code> をURLとして解釈しますテンプレート。 <code>-g</code> 引数を追加してcURLグロビングをオフにすることで修正されました。
ko: 오늘 Cygwin의 cURL 7.49.1 for Windows를 사용 하여이 문제에 다시 부딪 쳤습니다 .JSON 인수와 함께 <code>--data</code> 또는 <code>--data-binary</code> 를 사용할 때 cURL이 혼란스럽고 JSON의 <code>{}</code> 을 URL로 해석합니다. 주형. cURL globbing을 끄는 <code>-g</code> 인수를 추가하면 문제가 해결되었습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Сегодня я столкнулся с этим снова, используя Cygwin cURL 7.49.1 для Windows ... И при использовании </font></font> <code>--data</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>--data-binary</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с аргументом JSON cURL запутался и интерпретировал </font></font> <code>{}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в JSON как URL шаблон. </font><font style="vertical-align: inherit;">Исправлена ​​ошибка с </font><font style="vertical-align: inherit;">добавлением </font><font style="vertical-align: inherit;">аргумента </font></font> <code>-g</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для отключения сглаживания cURL.</font></font>
zh_cn: 今天，我再次使用Windows的Cygwin的cURL 7.49.1再次遇到了这个问题...当将 <code>--data</code> 或 <code>--data-binary</code> 与JSON参数一起使用时，cURL会感到困惑，并且会将JSON中的 <code>{}</code> 解释为URL模板。 添加 <code>-g</code> 参数以关闭cURL固定功能。

source: I think this is the easy way of generating the requests through the CURL.
es: Creo que esta es la forma fácil de generar las solicitudes a través de la CURL.
ja: CURL経由でリクエストを生成する方法は、これが簡単だと思います。
ko: 이것이 CURL을 통해 요청을 생성하는 쉬운 방법이라고 생각합니다.
ru: Я думаю,что это простой способ генерации запросов через CURL.
zh_cn: 我想这是通过CURL生成请求的简单方法。

source: I use Ubuntu and installed <a href="https://en.wikipedia.org/wiki/CURL">cURL</a> on it. I want to test my Spring REST application with cURL. I wrote my POST code at the Java side. However, I want to test it with cURL. I am trying to post a JSON data. Example data is like this:
es: Yo uso Ubuntu e instal&eacute; <a href="https://en.wikipedia.org/wiki/CURL">cURL</a> en &eacute;l. Quiero probar mi aplicaci&oacute;n Spring REST con cURL. Escrib&iacute; mi c&oacute;digo POST en el lado de Java. Sin embargo, quiero probarlo con cURL. Estoy tratando de publicar datos JSON. Los datos de ejemplo son as&iacute;:
ja: Ubuntuを使用して<a href="https://en.wikipedia.org/wiki/CURL">cURL</a>をインストールしました。 Spring RESTアプリケーションをcURLでテストしたい。 私はPOSTコードをJava側で記述しました。 ただし、cURLでテストしたいと思います。 JSONデータを投稿しようとしています。 データの例は次のとおりです。
ko: 우분투를 사용하고 그 위에 <a href="https://en.wikipedia.org/wiki/CURL">cURL</a> 을 설치했습니다. cURL을 사용하여 Spring REST 애플리케이션을 테스트하고 싶습니다. Java 측에서 POST 코드를 작성했습니다. 그러나 cURL로 테스트하고 싶습니다. JSON 데이터를 게시하려고합니다. 예제 데이터는 다음과 같습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я использую Ubuntu и установил </font></font><a href="https://en.wikipedia.org/wiki/CURL"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cURL</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на нем. </font><font style="vertical-align: inherit;">Я хочу протестировать приложение Spring REST с помощью cURL. </font><font style="vertical-align: inherit;">Я написал свой POST-код на стороне Java. </font><font style="vertical-align: inherit;">Тем не менее, я хочу проверить это с помощью cURL. </font><font style="vertical-align: inherit;">Я пытаюсь опубликовать данные в формате JSON. </font><font style="vertical-align: inherit;">Пример данных выглядит так:</font></font>
zh_cn: 我使用Ubuntu并在其上安装了<a href="https://en.wikipedia.org/wiki/CURL">cURL</a> 。 我想用cURL测试我的Spring REST应用程序。 我在Java端编写了POST代码。 但是，我想用cURL对其进行测试。 我正在尝试发布JSON数据。 示例数据如下：

source: I use this command:
es: Yo uso este comando:
ja: 私はこのコマンドを使っています。
ko: 이 명령을 사용합니다.
ru: Я использую эту команду:
zh_cn: 我用的是这个命令。

source: If you configure the SWAGGER to your spring boot application, and invoke any API from your application there you can see that CURL Request as well.
es: Si configuras el SWAGGER a tu aplicación de arranque de primavera,e invocas cualquier API de tu aplicación allí puedes ver esa solicitud de CURL también.
ja: SWAGGER を spring ブートアプリケーションに設定し、そこからアプリケーションの API を呼び出すと、その CURL リクエストも見ることができます。
ko: SWAGGER를 스프링 부트 애플리케이션으로 구성하고 애플리케이션에서 API를 호출하면 해당 CURL 요청도 볼 수 있습니다.
ru: Если вы сконфигурируете SWAGGER для вашего приложения пружинной загрузки,и вызовите любой API из вашего приложения,то вы также увидите CURL Request.
zh_cn: 如果你把SWAGGER配置到你的spring boot应用程序中,并从你的应用程序中调用任何API,你也可以看到那个CURL请求。

source: If you're testing a lot of JSON send/responses against a RESTful interface, you may want to check out the <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en">Postman</a> plug-in for Chrome (which allows you to manually define web service tests) and its Node.js-based <a href="https://www.getpostman.com/docs/newman_intro">Newman</a> command-line companion (which allows you to automate tests against "collections" of Postman tests.) Both free and open!
es: Si est&aacute; probando una gran cantidad de env&iacute;os / respuestas JSON en una interfaz RESTful, puede consultar el complemento <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en">Postman</a> para Chrome (que le permite definir manualmente las pruebas de servicio web) y su comando <a href="https://www.getpostman.com/docs/newman_intro">Newman</a> basado en Node.js. en l&iacute;nea (que le permite automatizar las pruebas contra "colecciones" de pruebas de Postman). &iexcl;Gratis y abierto!
ja: RESTfulインターフェースに対して多くのJSON送信/応答をテストしている場合は、Chromeの<a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en">Postman</a>プラグイン（Webサービステストを手動で定義できるようにする）とそのNode.jsベースの<a href="https://www.getpostman.com/docs/newman_intro">Newman</a>コマンドを確認することをお勧めします。 -lineコンパニオン（Postmanテストの「コレクション」に対するテストを自動化できるようにします。）無料とオープンの両方！
ko: RESTful 인터페이스에 대해 많은 JSON 보내기 / 응답을 테스트하는 경우 Chrome 용 <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en">Postman</a> 플러그인 (웹 서비스 테스트를 수동으로 정의 할 수 있음) 및 Node.js 기반 <a href="https://www.getpostman.com/docs/newman_intro">Newman</a> 명령을 확인할 수 있습니다. 온라인 동반자 (Postman 테스트의 "컬렉션"에 대한 테스트를 자동화 할 수 있습니다.) 무료 및 공개!
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если вы тестируете много JSON-сообщений / ответов на интерфейс RESTful, вы можете </font></font><a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">попробовать</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> подключаемый модуль </font><font style="vertical-align: inherit;">Postman</font><font style="vertical-align: inherit;"> для Chrome (который позволяет вручную определять тесты веб-служб) и его </font><font style="vertical-align: inherit;">команду </font></font><a href="https://www.getpostman.com/docs/newman_intro"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Newman на</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> основе Node.js. </font><font style="vertical-align: inherit;">-линейный компаньон (который позволяет автоматизировать тесты по &laquo;коллекциям&raquo; тестов Почтальона.) И бесплатно, и открыто!</font></font>
zh_cn: 如果您正在针对RESTful接口测试大量JSON发送/响应，则可能需要查看Chrome的<a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop?hl=en">Postman</a>插件（可让您手动定义Web服务测试）及其基于Node.js的<a href="https://www.getpostman.com/docs/newman_intro">Newman</a>命令在线伴侣（允许您针对邮递员测试的&ldquo;集合&rdquo;自动执行测试。）免费和开放！

source: In addition:
es: Además:
ja: おまけに
ko: 게다가:
ru: Кроме того:
zh_cn: 此外:

source: Install and Start <strong>Postman</strong>
es: Instalar e iniciar <strong>cartero</strong>
ja: <strong>Postman</strong>をインストールして起動する
ko: <strong>Postman</strong> 설치 및 시작
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Установить и запустить </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">почтальон</font></font></strong>
zh_cn: 安装并启动<strong>邮递员</strong>

source: It returns this error:
es: Devuelve este error:
ja: このエラーを返します。
ko: 이 오류를 반환합니다.
ru: Он возвращает эту ошибку:
zh_cn: 它返回了这个错误。

source: It speaks JSON by default and will handle both setting the necessary header for you as well encoding data as valid JSON. There is also:
es: Habla JSON por defecto y se encargará de configurar el encabezado necesario para usted,así como de codificar los datos como JSON válido.También hay:
ja: デフォルトではJSONを話すことができ、必要なヘッダを設定したり、データを有効なJSONとしてエンコードしたりします。また、以下のような機能もあります。
ko: 기본적으로 JSON을 사용하며 필요한 헤더를 설정하고 데이터를 유효한 JSON으로 인코딩합니다. 도 있습니다:
ru: Он говорит на JSON по умолчанию и будет обрабатывать как установку необходимого вам заголовка,так и кодировку данных как действительного JSON.Также есть:
zh_cn: 它默认说的是JSON,并会为你设置必要的头,同时将数据编码为有效的JSON。此外,还有

source: It was happily mapped to the Spring controller:
es: Fue felizmente mapeado al controlador de Spring:
ja: それは喜んでスプリングコントローラにマッピングされていました。
ko: Spring 컨트롤러에 행복하게 매핑되었습니다.
ru: Он был счастливо отображен на контроллере Spring:
zh_cn: 它很高兴地映射到弹簧控制器上。

source: It worked for me using:
es: Funcionó para mí usando:
ja: 使っていて効果がありました。
ko: 그것은 다음을 사용하여 나를 위해 일했습니다 :
ru: Мне это помогло:
zh_cn: 对我来说,它的作用是用。

source: It's a wrapper round CURL which simplifies command line REST requests. You point it to your API endpoint, and it gives you PUT and POST commands. (Examples adapted from the homepage)
es: Es un CURL envolvente que simplifica las solicitudes de reposo de la línea de comando.Lo apuntas a tu punto final de la API,y te da los comandos PUT y POST.(Ejemplos adaptados de la página principal)
ja: これは、コマンドラインのRESTリクエストを簡素化するCURLのラッパーです。これを API エンドポイントに指定すると、PUT と POST コマンドを提供します。(例はホームページからの抜粋)
ko: 명령 행 REST 요청을 단순화하는 래퍼 라운드 CURL입니다. API 엔드 포인트를 가리키면 PUT 및 POST 명령이 제공됩니다. (홈페이지에서 수정 된 예)
ru: Это обёртка вокруг CURL,которая упрощает запросы REST командной строки.Вы направляете ее на конечную точку API,и она дает вам PUT и POST команды.(Примеры адаптированы с главной страницы)
zh_cn: 它是一个CURL的包装器,可以简化命令行REST请求。你把它指向你的API端点,它就会给你提供PUT和POST命令。(示例改编自主页)

source: Let's assume this JSON dict format:
es: Asumamos este formato de JSON dict:
ja: このJSONのdict形式を想定してみましょう。
ko: 이 JSON dict 형식을 가정 해 봅시다.
ru: Предположим,что это формат JSON dict:
zh_cn: 让我们假设这种JSON dict格式。

source: Looking at the <a href="https://curl.haxx.se/docs/manpage.html">curl man page</a>, I think you can use <a href="https://curl.haxx.se/docs/manpage.html#-H"><code>-H</code></a>:
es: Mirando la <a href="https://curl.haxx.se/docs/manpage.html">p&aacute;gina del manual de curl</a> , creo que puedes usar <a href="https://curl.haxx.se/docs/manpage.html#-H"> <code>-H</code> </a> :
ja: <a href="https://curl.haxx.se/docs/manpage.html">curlのmanページを</a>見ると、 <a href="https://curl.haxx.se/docs/manpage.html#-H"> <code>-H</code> </a>を使用できると思います。
ko: <a href="https://curl.haxx.se/docs/manpage.html">curl 맨 페이지를</a> 보면 <a href="https://curl.haxx.se/docs/manpage.html#-H"> <code>-H</code> </a> 를 사용할 수 있다고 생각합니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Глядя на </font></font><a href="https://curl.haxx.se/docs/manpage.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">справочную страницу curl</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , я думаю, что вы можете использовать </font></font><a href="https://curl.haxx.se/docs/manpage.html#-H"> <code>-H</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>
zh_cn: 查看<a href="https://curl.haxx.se/docs/manpage.html">curl手册页</a> ，我认为您可以使用<a href="https://curl.haxx.se/docs/manpage.html#-H"> <code>-H</code> </a> ：
