Repository: rueisnom/feedback
Catalog: xlf/71/72/78/4/7172784.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Note that <code>-request POST</code> is <em>optional</em> if you use <code>-d</code>, as the <code>-d</code> flag implies a POST request.
es: Tenga en cuenta que <code>-request POST</code> es <em>opcional</em> si utiliza <code>-d</code> , ya que el <code>-d</code> implica una solicitud POST.
ja: <code>-d</code> フラグはPOST要求を意味するため、 -dを使用する場合、 <code>-request POST</code> は<em>オプションです</em> 。
ko: <code>-d</code> 플래그가 POST 요청을 암시하므로 -d 를 사용하는 경우 <code>-request POST</code> 는 <em>선택 사항</em> 입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Обратите внимание, что </font></font> <code>-request POST</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">необязательным,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> если вы используете </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , так как </font><font style="vertical-align: inherit;">флаг </font></font> <code>-d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> подразумевает запрос POST.</font></font>
zh_cn: 请注意，如果使用 <code>-d</code> ，则 <code>-request POST</code> 是<em>可选的</em> ，因为 <code>-d</code> 标志表示POST请求。

source: Note: you need to add jackson and jaxb maven dependencies in your pom.
es: Nota:necesitas añadir las dependencias de Jackson y Jaxb Maven en tu pom.
ja: 注意:jackson と jaxb の maven 依存関係を pom に追加する必要があります。
ko: 참고 : pom에 jackson 및 jaxb maven 종속성을 추가해야합니다.
ru: Примечание:вам нужно добавить зависимости Джексона и Джексба Мэйвена в вашем помпе.
zh_cn: 注意:你需要在你的pom中添加jackson和jaxb maven依赖项。

source: Of course, you should never use BASIC authentication without SSL and a checked certificate.
es: Por supuesto,nunca debes usar la autenticación BÁSICA sin SSL y un certificado comprobado.
ja: もちろん、SSLとチェック済みの証明書がないBASIC認証は絶対に使ってはいけません。
ko: 물론 SSL 및 확인 된 인증서가 없으면 BASIC 인증을 사용해서는 안됩니다.
ru: Конечно,никогда не следует использовать BASIC-аутентификацию без SSL и проверенного сертификата.
zh_cn: 当然,在没有SSL和检查过的证书的情况下,千万不要使用BASIC认证。

source: On Windows, things are slightly different. See the comment thread.
es: En Windows,las cosas son ligeramente diferentes.Vea el hilo de comentarios.
ja: Windowsでは、少し事情が違います。コメントスレッドを参照してください。
ko: Windows에서는 상황이 약간 다릅니다. 주석 스레드를 참조하십시오.
ru: В Windows все немного по-другому.См.тему комментариев.
zh_cn: 在Windows上,情况略有不同。请看评论线程。

source: Please check this <a href="https://pranayrauthu.github.io/fetcher/#/curl">tool</a>. It helps you to easily create curl snippets.
es: Por favor revise esta <a href="https://pranayrauthu.github.io/fetcher/#/curl">herramienta</a> . Le ayuda a crear f&aacute;cilmente fragmentos de rizo.
ja: この<a href="https://pranayrauthu.github.io/fetcher/#/curl">ツールを</a>確認してください。 カールスニペットを簡単に作成するのに役立ちます。
ko: 이 <a href="https://pranayrauthu.github.io/fetcher/#/curl">도구를</a> 확인하십시오. 컬 스 니펫을 쉽게 만들 수 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Пожалуйста, проверьте этот </font></font><a href="https://pranayrauthu.github.io/fetcher/#/curl"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">инструмент</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это поможет вам легко создавать фрагменты скручивания.</font></font>
zh_cn: 请检查此<a href="https://pranayrauthu.github.io/fetcher/#/curl">工具</a> 。 它可以帮助您轻松创建卷发片段。

source: See also <em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl">Passing a URL with brackets to curl</a></em>.
es: Consulte tambi&eacute;n <em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl">Pasar una URL con corchetes para rizar</a></em> .
ja: <em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl">括弧付きのURLをcurlに渡す</a></em>も参照してください。
ko: <em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl">괄호와 함께 URL 전달을</a></em> 참조하십시오.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите также </font></font><em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Передача URL в квадратных скобках для скручивания</font></font></a></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 另请参阅<em><a href="https://stackoverflow.com/questions/8333920/passing-a-url-with-brackets-to-curl">传递带有方括号的URL以进行curl</a></em> 。

source: Select <code>cURL</code> from the drop-down list
es: Seleccione <code>cURL</code> de la lista desplegable
ja: ドロップダウンリストから <code>cURL</code> を選択します
ko: 드롭 다운 목록에서 <code>cURL</code> 을 선택하십시오.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Выберите </font></font> <code>cURL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> из выпадающего списка</font></font>
zh_cn: 从下拉列表中选择 <code>cURL</code>

source: That is, the following did not work:
es: Es decir,lo siguiente no funcionó:
ja: つまり、以下のことがうまくいかなかったのです。
ko: 즉, 다음이 작동하지 않았습니다.
ru: То есть,следующее не сработало:
zh_cn: 也就是说,下面的做法并不奏效。

source: The error description is this:
es: La descripción del error es la siguiente:
ja: エラーの説明はこのようになっています。
ko: 오류 설명은 다음과 같습니다.
ru: Описание ошибки следующее:
zh_cn: 错误描述是这样的。

source: Then you run this command:
es: Entonces tú diriges este comando:
ja: そして、このコマンドを実行します。
ko: 그런 다음이 명령을 실행하십시오.
ru: Тогда ты выполняешь эту команду:
zh_cn: 然后你运行这个命令。

source: This is my Java side <code>PUT</code> code (I have tested GET and DELETE and they work):
es: Este es mi c&oacute;digo <code>PUT</code> del lado Java (he probado GET y DELETE y funcionan):
ja: これは私のJava側の <code>PUT</code> コードです（GETとDELETEをテストしましたが、動作します）。
ko: 이것은 Java 측 <code>PUT</code> 코드입니다 (GET 및 DELETE를 테스트했으며 작동합니다).
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это мой </font><font style="vertical-align: inherit;">код </font></font> <code>PUT</code> на<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> стороне Java </font><font style="vertical-align: inherit;">(я проверил GET и DELETE, и они работают):</font></font>
zh_cn: 这是我的Java端 <code>PUT</code> 代码（我已经测试过GET和DELETE，它们可以工作）：

source: This worked for me for on Windows10
es: Esto funcionó para mí en Windows10
ja: これは、Windows10で動作しました。
ko: 이것은 Windows10에서 나를 위해 일했습니다.
ru: Для меня это сработало на Windows10
zh_cn: 这对我来说,在Windows10上的效果很好

source: This worked for me:
es: Esto funcionó para mí:
ja: これは私には効果がありました。
ko: 이것은 나를 위해 일했다 :
ru: Это сработало на меня:
zh_cn: 这对我来说很有效。

source: This worked well for me, additionally using BASIC authentication:
es: Esto funcionó bien para mí,además de usar la autenticación BÁSICA:
ja: これはBASIC認証を使用して、私にはうまくいきました。
ko: 이것은 또한 기본 인증을 사용하여 저에게 효과적이었습니다.
ru: Для меня это сработало хорошо,дополнительно используя BASIC-аутентификацию:
zh_cn: 这对我来说效果很好,另外使用BASIC认证。

source: This worked well for me.
es: Esto funcionó bien para mí.
ja: これは私には効果がありました。
ko: 이것은 나를 위해 잘 작동했습니다.
ru: Это хорошо сработало для меня.
zh_cn: 这对我来说很有效果。

source: Tomcat log: "POST /ui/webapp/conf/clear HTTP/1.1" 415 1051
es: Bitácora de Tomcat:"POST uiwebappconfclear HTTP1.1" 415 1051
ko: Tomcat 로그 : "POST / ui / webapp / conf / clear HTTP / 1.1"415 1051
ru: Журнал Tomcat:"POST uiwebappconfclear HTTP1.1" 415 1051
zh_cn: Tomcat日志:"POST uiwebappconfclear HTTP1.1" 415 1051

source: Try to put your data in a file, say <code>body.json</code> and then use
es: Intente poner sus datos en un archivo, diga <code>body.json</code> y luego use
ja: データをファイル、たとえば <code>body.json</code> に入れてから、
ko: <code>body.json</code> 과 같은 파일에 데이터를 넣고 다음을 사용하십시오.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Попытайтесь поместить свои данные в файл, скажем </font></font> <code>body.json</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем используйте</font></font>
zh_cn: 尝试将数据放入文件中，例如 <code>body.json</code> ，然后使用

source: Type in your URL, Post Body, Request Headers etc. pp.
es: Escriba su URL,cuerpo del mensaje,encabezado de la solicitud,etc.pp.
ja: URL、投稿本文、リクエストヘッダーなどを入力してください。
ko: URL, 게시물 본문, 요청 헤더 등을 입력하십시오. pp.
ru: Введите URL-адрес,тело сообщения,заголовки запроса и т.д.стр.
zh_cn: 输入你的URL、帖子正文、请求标题等。

source: Use -d option to add payload
es: Utilice la opción -d para añadir la carga útil
ja: d オプションを使用してペイロードを追加する
ko: 페이로드를 추가하려면 -d 옵션을 사용하십시오.
ru: Использовать -d для добавления полезной нагрузки
zh_cn: 使用 -d 选项来添加有效载荷

source: Using CURL Windows, try this:
es: Usando CURL Windows,prueba esto:
ja: CURL Windowsを使って、こんな感じで試してみてください。
ko: CURL Windows를 사용하여 다음을 시도하십시오.
ru: Используя CURL Windows,попробуйте это:
zh_cn: 使用CURL Windows,可以试试这个。

source: What is the right format of the cURL command?
es: ¿Cuál es el formato correcto del comando cURL?
ja: cURLコマンドの正しい形式は?
ko: cURL 명령의 올바른 형식은 무엇입니까?
ru: Какой правильный формат команды cURL?
zh_cn: cURL命令的正确格式是什么?

source: You can pass the extension of the format you want as the end of the url. like <a href="http://localhost:8080/xx/xxx/xxxx">http://localhost:8080/xx/xxx/xxxx</a><strong>.json</strong>
es: Puede pasar la extensi&oacute;n del formato que desee como el final de la url. como <a href="http://localhost:8080/xx/xxx/xxxx">http: // localhost: 8080 / xx / xxx / xxxx</a> <strong>.json</strong>
ja: 希望するフォーマットの拡張子をURLの末尾として渡すことができます。 <a href="http://localhost:8080/xx/xxx/xxxx">http：// localhost：8080 / xx / xxx / xxxx</a> <strong>.jsonなど</strong>
ko: URL의 끝으로 원하는 형식의 확장자를 전달할 수 있습니다. <a href="http://localhost:8080/xx/xxx/xxxx">http : // localhost : 8080 / xx / xxx / xxxx와 같은</a> <strong>.json</strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете передать расширение нужного формата в качестве конца URL. </font><font style="vertical-align: inherit;">например </font></font><a href="http://localhost:8080/xx/xxx/xxxx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http: // localhost: 8080 / xx / xxx / xxxx </font></font></a><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">.json</font></font></strong>
zh_cn: 您可以将所需格式的扩展名作为url的末尾传递。 像<a href="http://localhost:8080/xx/xxx/xxxx">http：// localhost：8080 / xx / xxx / xxxx</a> <strong>.json</strong>

source: You can use <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop">Postman</a> with its intuitive GUI to assemble your <code>cURL</code> command.
es: Puede usar <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop">Postman</a> con su GUI intuitiva para ensamblar su comando <code>cURL</code> .
ja: <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop">Postman</a>とその直感的なGUIを使用して、 <code>cURL</code> コマンドを組み立てることができます。
ko: 직관적 인 GUI와 함께 <a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop">Postman</a> 을 사용하여 <code>cURL</code> 명령을 어셈블 할 수 있습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете использовать </font></font><a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Postman</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> с его интуитивно понятным графическим интерфейсом для сборки вашей </font><font style="vertical-align: inherit;">команды </font></font> <code>cURL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: 您可以使用<a href="https://chrome.google.com/webstore/detail/postman/fhbjgbiflinjbdggehcddcbncdddomop">Postman</a>及其直观的GUI来组合 <code>cURL</code> 命令。

source: You can use postman to convert to CURL
es: Puedes usar el cartero para convertir a CURL
ja: postmanを使ってCURLに変換することができます。
ko: 우편 배달부를 사용하여 CURL로 변환 할 수 있습니다
ru: Вы можете использовать почтальона для конвертации в CURL
zh_cn: 你可以用postman转换为CURL。

source: You could also put your JSON content in a file and pass it to curl using the <code>--file-upload</code> option via standard input, like this:
es: Tambi&eacute;n puede poner su contenido JSON en un archivo y pasarlo a curl usando la opci&oacute;n <code>--file-upload</code> a trav&eacute;s de una entrada est&aacute;ndar, como esta:
ja: 次のように、JSONコンテンツをファイルに入れ、標準入力を介して <code>--file-upload</code> オプションを使用してcurlに渡すこともできます。
ko: JSON 내용을 파일에 넣고 다음과 같이 표준 입력을 통해 <code>--file-upload</code> 옵션을 사용하여 curl에 전달할 수도 있습니다 .
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы также можете поместить содержимое JSON в файл и передать его в curl, используя </font><font style="vertical-align: inherit;">опцию </font></font> <code>--file-upload</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> через стандартный ввод, например:</font></font>
zh_cn: 您还可以将JSON内容放入文件中，并通过标准输入使用 <code>--file-upload</code> 选项将其传递为curl，如下所示：

source: You might find resty useful: <a href="https://github.com/micha/resty">https://github.com/micha/resty</a>
es: Puede encontrar &uacute;til resty: <a href="https://github.com/micha/resty">https://github.com/micha/resty</a>
ja: あなたはrestyが便利だと思うかもしれません： <a href="https://github.com/micha/resty">https</a> ： //github.com/micha/resty
ko: <a href="https://github.com/micha/resty">https://github.com/micha/resty가</a> 도움이 될 것입니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам может пригодиться отдых: </font></font><a href="https://github.com/micha/resty"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/micha/resty</font></font></a>
zh_cn: 您可能会发现resty有用： <a href="https://github.com/micha/resty">https</a> ： //github.com/micha/resty

source: You need to set your content-type to application/json. But <a href="https://curl.haxx.se/docs/manpage.html#-d"><code>-d</code></a> sends the Content-Type <code>application/x-www-form-urlencoded</code>, which is not accepted on Spring's side.
es: Debe configurar su tipo de contenido en application / json. Pero <a href="https://curl.haxx.se/docs/manpage.html#-d"> <code>-d</code> </a> env&iacute;a la <code>application/x-www-form-urlencoded</code> Content-Type / x-www-form-urlencoded , que no se acepta por parte de Spring.
ja: content-typeをapplication / jsonに設定する必要があります。 しかし、 <a href="https://curl.haxx.se/docs/manpage.html#-d"> <code>-d</code> </a>はContent-Type <code>application/x-www-form-urlencoded</code> を送信しますが、これはSpring側では受け入れられません。
ko: 컨텐츠 유형을 application / json으로 설정해야합니다. 그러나 <a href="https://curl.haxx.se/docs/manpage.html#-d"> <code>-d</code> </a> 는 Content-Type <code>application/x-www-form-urlencoded</code> 를 전송하지만 Spring 측에서는 허용되지 않습니다.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вам необходимо установить тип контента на application / json. </font><font style="vertical-align: inherit;">Но </font></font><a href="https://curl.haxx.se/docs/manpage.html#-d"> <code>-d</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отправляет </font></font> <code>application/x-www-form-urlencoded</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Content-Type </font><font style="vertical-align: inherit;">/ x-www-form-urlencoded</font><font style="vertical-align: inherit;"> , которое не принимается со стороны Spring.</font></font>
zh_cn: 您需要将内容类型设置为application / json。 但是<a href="https://curl.haxx.se/docs/manpage.html#-d"> <code>-d</code> </a>发送Content-Type <code>application/x-www-form-urlencoded</code> ，在Spring方面不接受。

source: copy &amp; paste your <code>cURL</code> command
es: copia y pega tu comando <code>cURL</code>
ja: <code>cURL</code> コマンドをコピーして貼り付けます
ko: <code>cURL</code> 명령을 복사하여 붙여 넣기
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">скопируйте и вставьте </font><font style="vertical-align: inherit;">команду </font></font> <code>cURL</code> <font style="vertical-align: inherit;"></font>
zh_cn: 复制并粘贴您的 <code>cURL</code> 命令

source: for headers, and
es: para los encabezados,y
ja: ヘッダには
ko: 헤더의 경우
ru: для заголовков,и
zh_cn: 用于页眉,以及

source: for query string parameters. If you have a large chunk of data, you can also read it from a file have it be JSON encoded:
es: para los parámetros de la cadena de consulta.Si tienes un gran trozo de datos,también puedes leerlo desde un archivo que esté codificado en JSON:
ja: クエリ文字列のパラメータを指定します。大きなデータの塊がある場合は、ファイルから読み込んでJSONエンコードすることもできます。
ko: 쿼리 문자열 매개 변수 데이터 청크가 많은 경우 파일을 JSON 인코딩으로 파일에서 읽을 수도 있습니다.
ru: для параметров строки запроса.Если у вас большой кусок данных,вы также можете прочитать его из файла с кодировкой JSON:
zh_cn: 用于查询字符串参数。如果你有大块的数据,你也可以从文件中读取,并对其进行JSON编码。

source: use -H 'Accept: application/json' to add accept type header
es: use -H 'Accept:applicationjson' para añadir el encabezado de tipo accept
ja: use -H 'Accept:applicationjson' で Accept 型のヘッダを追加します。
ko: 수락 유형 헤더를 추가하려면 -H 'Accept : application / json'을 사용하십시오.
ru: использовать -H 'Accept:applicationjson' для добавления заголовка типа accept
zh_cn: 使用 -H 'Accept:applicationjson' 添加接受类型的头。

source: use -H 'Content-Type: application/json' to add content type header
es: use -H 'Content-Type:applicationjson' para añadir el encabezado de tipo de contenido
ja: コンテンツタイプのヘッダを追加するために -H 'Content-Type:applicationjson' を使用します。
ko: -H 'Content-Type : application / json'을 사용하여 컨텐츠 유형 헤더를 추가하십시오.
ru: использовать -H 'Content-Type:applicationjson' для добавления заголовка типа контента
zh_cn: 使用 -H 'Content-Type:applicationjson'来添加内容类型的头。

source: use -X POST to use POST method
es: usar -X POST para usar el método POST
ja: POSTメソッドを使用するには、-X POSTを使用します。
ko: POST 방법을 사용하려면 -X POST를 사용하십시오.
ru: использовать -X POST для использования метода POST
zh_cn: 使用-X POST来使用POST方法
