Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Since <code>operator&lt;&lt;</code> is overloaded as a member function of <code>Foo</code>, the LHS of the operator must be a <code>Foo</code> object. Which means, you will be required to use:
es: Como el <code>operator&lt;&lt;</code> est&aacute; sobrecargado como una funci&oacute;n miembro de <code>Foo</code> , el LHS del operador debe ser un objeto <code>Foo</code> . Lo que significa que se le pedir&aacute; que use:
ja: <code>operator&lt;&lt;</code> は <code>Foo</code> のメンバー関数としてオーバーロードされるため、演算子のLHSは <code>Foo</code> オブジェクトでなければなりません。 つまり、以下を使用する必要があります。
ko: <code>operator&lt;&lt;</code> 는 <code>Foo</code> 의 멤버 함수로 오버로드되므로 연산자 의 LHS는 <code>Foo</code> 객체 여야합니다. 즉, 다음을 사용해야합니다.
ru: Так как <code>operator&lt;&lt;</code> перегружен как функция-член <code>Foo</code> , LHS оператора должен быть объектом <code>Foo</code> . Это означает, что вы должны будете использовать:
zh_cn: 由于 <code>operator&lt;&lt;</code> 作为 <code>Foo</code> 的成员函数被重载，因此该operator的LHS必须是 <code>Foo</code> 对象。 这意味着，您将需要使用：

source: So-called placement new allows you to create an object at a certain address which is passed to:
es: La llamada colocación nueva permite crear un objeto en una cierta dirección a la que se pasa:
ja: いわゆるプレースメントニューでは、特定のアドレスにオブジェクトを作成し、そのアドレスに渡されたオブジェクトを作成することができます。
ko: 소위 게재 위치 신규를 사용하면 다음 주소로 전달되는 특정 주소에서 객체를 만들 수 있습니다.
ru: Так называемое размещение new позволяет создать объект по определенному адресу,который передается:
zh_cn: 所谓的置换新允许你在某个地址创建一个对象,这个对象会被传给。

source: The C++ standard library comes with a set of predefined <code>new</code> and <code>delete</code> operators. The most important ones are these:
es: La biblioteca est&aacute;ndar de C ++ viene con un conjunto de operadores predefinidos <code>new</code> y de <code>delete</code> . Los m&aacute;s importantes son estos:
ja: C ++標準ライブラリには、事前定義された <code>new</code> および <code>delete</code> 演算子のセットが付属しています。 最も重要なものは次のとおりです。
ko: C ++ 표준 라이브러리에는 사전 정의 된 <code>new</code> 및 <code>delete</code> 연산자 세트가 제공됩니다. 가장 중요한 것은 다음과 같습니다.
ru: Стандартная библиотека C ++ поставляется с набором предопределенных операторов <code>new</code> и <code>delete</code> . Самые важные из них:
zh_cn: C ++标准库附带了一组预定义的 <code>new</code> 和 <code>delete</code> 运算符。 最重要的是：

source: The Decision between Member and Non-member
es: La decisión entre los miembros y los no miembros
ja: 会員と非会員の判断
ko: 회원과 비회원의 결정
ru: Решение между членом и не членом
zh_cn: 成员和非成员之间的决定

source: The General Syntax of operator overloading in C++
es: La sintaxis general de la sobrecarga del operador en C++
ja: C++における演算子オーバーロードの一般的な構文
ko: C ++에서 연산자 오버로드의 일반적인 구문
ru: Общий синтаксис перегрузки операторов в C++
zh_cn: C++中算子重载的通用语法

source: The Three Basic Rules of Operator Overloading in C++
es: Las tres reglas básicas de la sobrecarga del operador en C++
ja: C++における演算子オーバーロードの3つの基本ルール
ko: C ++에서 연산자 오버로드의 3 가지 기본 규칙
ru: Три основных правила перегрузки оператора на C++
zh_cn: C++中操作者超载的三大基本规则

source: The array subscript operator is a binary operator which must be implemented as a class member. It is used for container-like types that allow access to their data elements by a key. The canonical form of providing these is this:
es: El operador de subíndice de la matriz es un operador binario que debe implementarse como un miembro de la clase.Se utiliza para tipos tipo contenedores que permiten el acceso a sus elementos de datos mediante una clave.La forma canónica de proporcionarlos es ésta:
ja: 配列の添え字演算子は、クラスのメンバとして実装する必要があるバイナリ演算子です。これは、キーによるデータ要素へのアクセスを可能にするコンテナのような型に使用されます。これらを提供する定型的な形式はこれです。
ko: 배열 첨자 연산자는 이진 연산자이며 클래스 멤버로 구현되어야합니다. 키로 데이터 요소에 액세스 할 수있는 컨테이너와 같은 유형에 사용됩니다. 이를 제공하는 정식 형태는 다음과 같습니다.
ru: Оператор subscript массива-двоичный оператор,который должен быть реализован в виде члена класса.Он используется для контейнероподобных типов,которые обеспечивают доступ к своим элементам данных по ключу.Каноническая форма их предоставления такова:
zh_cn: 数组下标操作符是一个二进制操作符,必须作为类成员来实现。它用于类似于容器的类型,允许通过一个键来访问它们的数据元素。提供这些类型的典型形式是这样的。

source: The binary infix comparison operators should, according to the rules of thumb, be implemented as non-member functions<sup>1</sup>. The unary prefix negation <code>!</code> should (according to the same rules) be implemented as a member function. (but it is usually not a good idea to overload it.)
es: Los operadores de comparaci&oacute;n de infijo binario deben, de acuerdo con las reglas generales, implementarse como funciones no miembros <sup>1</sup> . &iexcl;La negaci&oacute;n del prefijo unario <code>!</code> deber&iacute;a (de acuerdo con las mismas reglas) implementarse como una funci&oacute;n miembro. (pero generalmente no es una buena idea sobrecargarlo).
ja: バイナリのインフィックス比較演算子は、経験則に従って、非メンバー関数として実装する必要があります<sup>1</sup> 。 単項接頭辞否定 <code>!</code> （同じルールに従って）メンバー関数として実装する必要があります。 （ただし、通常、オーバーロードすることはお勧めしません。）
ko: 이진 접두사 비교 연산자는 경험 법칙에 따라 비 멤버 함수 <sup>1</sup> 로 구현해야합니다. 단항 접두사 부정 <code>!</code> (같은 규칙에 따라) 멤버 함수로 구현해야합니다. (그러나 일반적으로 과부하는 좋지 않습니다.)
ru: Операторы сравнения двоичного инфикса должны, согласно практическим правилам, быть реализованы как функции, не являющиеся членами <sup>1</sup> . Одинарный префикс отрицания <code>!</code> должен (согласно тем же правилам) быть реализован как функция-член. (но обычно не стоит перегружать его.)
zh_cn: 根据经验法则，二进制中缀比较运算符应实现为非成员函数<sup>1</sup> 。 一元前缀否定 <code>!</code> 应该（按照相同的规则）实现为成员函数。 （但通常不建议重载它。）

source: The binary operators <code>=</code> (assignment), <code>[]</code> (array subscription), <code>-&gt;</code> (member access), as well as the n-ary <code>()</code> (function call) operator, must always be implemented as <strong><em>member functions</em></strong>, because the syntax of the language requires them to.
es: Los operadores binarios <code>=</code> (asignaci&oacute;n), <code>[]</code> (suscripci&oacute;n de matriz), <code>-&gt;</code> (acceso de miembro), as&iacute; como el operador n-ary <code>()</code> (llamada a funci&oacute;n), siempre deben implementarse como <strong><em>funciones miembro</em></strong> , porque la sintaxis de el lenguaje lo requiere.
ja: 二項演算子 <code>=</code> （代入）、 <code>[]</code> （配列サブスクリプション）、 <code>-&gt;</code> （メンバーアクセス）、およびn-ary <code>()</code> （関数呼び出し）演算子は、常に<strong><em>メンバー関数</em></strong>として実装する必要があります。言語はそれらをする必要があります。
ko: 이진 연산자 <code>=</code> (할당), <code>[]</code> (배열 구독), <code>-&gt;</code> (회원 액세스) 및 n-ary <code>()</code> (함수 호출) 연산자는 항상 <strong><em>멤버 함수</em></strong> 로 구현되어야합니다. 언어는 그들에게 요구합니다.
ru: Бинарные операторы <code>=</code> (присваивание), <code>[]</code> (подписка на массив), <code>-&gt;</code> (доступ к элементу), а также оператор n-ary <code>()</code> (вызов функции) всегда должны быть реализованы как <strong><em>функции-члены</em></strong> , поскольку синтаксис язык требует от них
zh_cn: 二进制运算符 <code>=</code> （赋值）， <code>[]</code> （数组订阅）， <code>-&gt;</code> （成员访问）以及n-ary <code>()</code> （函数调用）运算符必须始终作为<strong><em>成员函数</em></strong>实现，因为语言要求他们这样做。

source: The bit manipulation operators <code>~</code><code>&amp;</code><code>|</code><code>^</code><code>&lt;&lt;</code><code>&gt;&gt;</code> should be implemented in the same way as the arithmetic operators. However, (except for overloading <code>&lt;&lt;</code> and <code>&gt;&gt;</code> for output and input) there are very few reasonable use cases for overloading these.
es: Los operadores de manipulaci&oacute;n de bits <code>~</code> <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> debe implementarse de la misma manera que los operadores aritm&eacute;ticos. Sin embargo, (a excepci&oacute;n de la sobrecarga <code>&lt;&lt;</code> y <code>&gt;&gt;</code> para salida y entrada) hay muy pocos casos de uso razonables para sobrecargarlos.
ja: ビット操作演算子 <code>~</code> <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> は、算術演算子と同じ方法で実装する必要があります。 ただし、（出力と入力の <code>&lt;&lt;</code> および <code>&gt;&gt;</code> のオーバーロードを除いて）これらをオーバーロードするための合理的なユースケースはほとんどありません。
ko: 비트 조작 연산자 <code>~</code> <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> 는 산술 연산자와 같은 방식으로 구현되어야합니다. 그러나 (출력 및 입력에 대한 <code>&lt;&lt;</code> 및 <code>&gt;&gt;</code> 의 오버로드를 제외하고) 이들을 오버로드하기위한 합리적인 사용 사례는 거의 없습니다.
ru: Операторы битовых манипуляций <code>~</code> <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> должно быть реализовано так же, как арифметические операторы. Однако (за исключением перегрузки <code>&lt;&lt;</code> и <code>&gt;&gt;</code> для вывода и ввода) существует очень мало разумных вариантов их использования.
zh_cn: 位操作运算符 <code>~</code> <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> 应该以与算术运算符相同的方式实现。 但是，（除了重载 <code>&lt;&lt;</code> 和 <code>&gt;&gt;</code> 用于输出和输入），很少有合理的用例来重载它们。

source: The bitshift operators <code>&lt;&lt;</code> and <code>&gt;&gt;</code>, although still used in hardware interfacing for the bit-manipulation functions they inherit from C, have become more prevalent as overloaded stream input and output operators in most applications. For guidance overloading as bit-manipulation operators, see the section below on Binary Arithmetic Operators. For implementing your own custom format and parsing logic when your object is used with iostreams, continue.
es: Los operadores de desplazamiento de bits <code>&lt;&lt;</code> y <code>&gt;&gt;</code> , aunque todav&iacute;a se usan en la interfaz de hardware para las funciones de manipulaci&oacute;n de bits que heredan de C, se han vuelto m&aacute;s frecuentes como operadores de entrada y salida de flujo sobrecargados en la mayor&iacute;a de las aplicaciones. Para la sobrecarga de orientaci&oacute;n como operadores de manipulaci&oacute;n de bits, consulte la siguiente secci&oacute;n sobre Operadores aritm&eacute;ticos binarios. Para implementar su propio formato personalizado y l&oacute;gica de an&aacute;lisis cuando su objeto se usa con iostreams, contin&uacute;e.
ja: ビットシフト演算子 <code>&lt;&lt;</code> および <code>&gt;&gt;</code> は 、Cから継承するビット操作関数のハードウェアインターフェイスで引き続き使用されますが、ほとんどのアプリケーションでオーバーロードされたストリーム入力および出力演算子として普及しています。 ビット操作演算子としてのオーバーロードのガイダンスについては、以下の2項算術演算子のセクションを参照してください。 オブジェクトがiostreamで使用されているときに独自のカスタム形式と解析ロジックを実装する場合は、続行します。
ko: 비트 시프트 연산자 <code>&lt;&lt;</code> 및 <code>&gt;&gt;</code> 는 C에서 상속 한 비트 조작 함수를위한 하드웨어 인터페이스에서 여전히 사용되지만 대부분의 응용 프로그램에서 오버로드 된 스트림 입력 및 출력 연산자로 널리 퍼져 있습니다. 비트 조작 연산자로서 오버로드에 대한 지침은 이진 산술 연산자에 대한 아래 섹션을 참조하십시오. 객체가 iostream과 함께 사용될 때 사용자 지정 형식 및 구문 분석 논리를 구현하려면 계속하십시오.
ru: Операторы битового сдвига <code>&lt;&lt;</code> и <code>&gt;&gt;</code> , хотя они все еще используются в аппаратном интерфейсе для функций управления битами, которые они наследуют от C, стали более распространенными в качестве перегруженных операторов ввода и вывода потока в большинстве приложений. Для перегрузки руководства в качестве операторов управления битами см. Раздел ниже о двоичных арифметических операторах. Для реализации собственного формата и логики разбора, когда ваш объект используется с iostreams, продолжайте.
zh_cn: 尽管移位移位运算符 <code>&lt;&lt;</code> 和 <code>&gt;&gt;</code> 仍用于它们从C继承的位处理函数的硬件接口中，但在大多数应用程序中，它们已作为重载流输入和输出运算符而变得越来越普遍。 有关作为位操作运算符的指导重载，请参见下面有关二进制算术运算符的部分。 当对象与iostream一起使用时，要实现自己的自定义格式和解析逻辑，请继续。

source: The first of the basic rules of operator overloading &ndash; <em>don&rsquo;t do it</em> &ndash; applies especially to overloading <code>new</code> and <code>delete</code>. Almost the only reasons to overload these operators are <strong><em>performance problems</em></strong> and <strong><em>memory constraints</em></strong>, and in many cases, other actions, like <em>changes to the algorithms</em> used, will provide a much <strong><em>higher cost/gain ratio</em></strong> than attempting to tweak memory management.
es: La primera de las reglas b&aacute;sicas de sobrecarga del operador, <em>no lo haga, se</em> aplica especialmente a la sobrecarga de <code>new</code> y <code>delete</code> . Casi las &uacute;nicas razones para sobrecargar estos operadores son los <strong><em>problemas de rendimiento</em></strong> y las <strong><em>limitaciones de memoria</em></strong> , y en muchos casos, otras acciones, como los <em>cambios en los algoritmos</em> utilizados, proporcionar&aacute;n una <strong><em>relaci&oacute;n costo / ganancia</em></strong> mucho <strong><em>mayor</em></strong> que intentar modificar la administraci&oacute;n de memoria.
ja: 演算子のオーバーロードの最初の基本ルール&ndash; <em>しないでください</em> &ndash;は、特に <code>new</code> および <code>delete</code> のオーバーロードに適用されます。 これらの演算子をオーバーロードするほとんど唯一の理由は、 <strong><em>パフォーマンスの問題</em></strong>と<strong><em>メモリの制約</em></strong>であり、多くの場合、使用される<em>アルゴリズムの変更</em>などの他のアクションは、メモリ管理を微調整するよりもはるかに<strong><em>高いコスト/ゲイン比</em></strong>を提供します。
ko: 연산자 오버로딩의 첫 번째 기본 규칙 ( <em>그렇지 않음)은</em> 특히 <code>new</code> 및 <code>delete</code> 오버로드에 적용됩니다. 이러한 연산자에 과부하를 발생시키는 거의 유일한 이유는 <strong><em>성능 문제</em></strong> 및 <strong><em>메모리 제약</em></strong> 이며, 많은 경우에 사용되는 <em>알고리즘 변경</em> 과 같은 다른 작업은 메모리 관리를 조정하는 것 <strong><em>보다</em></strong> 훨씬 <strong><em>높은 비용 / 이득 비율을</em></strong> 제공합니다.
ru: Первое из основных правил перегрузки операторов - <em>не делайте этого</em> - особенно относится к перегрузке <code>new</code> и <code>delete</code> . Почти единственными причинами перегрузки этих операторов являются <strong><em>проблемы с производительностью</em></strong> и <strong><em>нехватка памяти</em></strong> , и во многих случаях другие действия, такие как <em>изменение используемых алгоритмов</em> , обеспечат гораздо <strong><em>более высокое соотношение цена / выигрыш,</em></strong> чем попытка настроить управление памятью.
zh_cn: 运算符重载的第一条基本规则（ <em>不要这样做）</em>尤其适用于重载 <code>new</code> 和 <code>delete</code> 。 使这些运算符过载的几乎唯一原因是<strong><em>性能问题</em></strong>和<strong><em>内存限制</em></strong> ，并且在许多情况下，其他操作（如<em>更改所</em>使用<em>的算法</em> ）将提供比尝试调整内存管理<strong><em>更高的成本/收益比</em></strong> 。

source: The first two allocate/deallocate memory for an object, the latter two for an array of objects. If you provide your own versions of these, they will <strong><em>not overload, but replace</em></strong> the ones from the standard library.
es: Los dos primeros asignan / desasignan memoria para un objeto, los dos &uacute;ltimos para una matriz de objetos. Si proporciona sus propias versiones de estas, no se <strong><em>sobrecargar&aacute;n, sino que reemplazar&aacute;n</em></strong> las de la biblioteca est&aacute;ndar.
ja: 最初の2つはオブジェクトにメモリを割り当て/割り当て解除し、後の2つはオブジェクトの配列に割り当てます。 これらの独自のバージョンを提供する場合、それらは<strong><em>過負荷</em></strong>になることはあり<strong><em>ませんが</em></strong> 、標準ライブラリからのものを<strong><em>置き換え</em></strong>ます。
ko: 처음 2 개는 객체에 대한 메모리를 할당 / 할당 해제하고, 2 개는 객체의 배열에 할당합니다. 이러한 버전을 제공하면 <strong><em>과부하되지 않지만</em></strong> 표준 라이브러리의 버전을 <strong><em>대체</em></strong> 합니다.
ru: Первые два выделяют / освобождают память для объекта, последние два - для массива объектов. Если вы предоставите свои собственные версии, они <strong><em>не</em></strong> будут <strong><em>перегружены, а заменят</em></strong> версии из стандартной библиотеки.
zh_cn: 前两个为对象分配/释放内存，后两个为对象数组分配/释放内存。 如果您提供自己的版本，则它们<strong><em>不会过载，但会替换</em></strong>标准库中的版本。

source: The following is a simple class with an implicit conversion operator:
es: La siguiente es una clase simple con un operador de conversión implícito:
ja: 以下は、暗黙の変換演算子を持つシンプルなクラスです。
ko: 다음은 암시 적 변환 연산자가있는 간단한 클래스입니다.
ru: Ниже приведен простой класс с неявным оператором преобразования:
zh_cn: 下面是一个简单的类,里面有一个隐式转换算子。

source: The function call operator, used to create function objects, also known as functors, must be defined as a <strong><em>member</em></strong> function, so it always has the implicit <code>this</code> argument of member functions. Other than this, it can be overloaded to take any number of additional arguments, including zero.
es: El operador de llamada a funci&oacute;n, usado para crear objetos de funci&oacute;n, tambi&eacute;n conocidos como functores, debe definirse como una funci&oacute;n <strong><em>miembro</em></strong> , por lo que siempre tiene impl&iacute;cito <code>this</code> argumento de funciones miembro. Aparte de esto, se puede sobrecargar para tomar cualquier n&uacute;mero de argumentos adicionales, incluido cero.
ja: 関数オブジェクト（ファンクターとも呼ばれる）の作成に使用される関数呼び出し演算子は、 <strong><em>メンバー</em></strong>関数として定義する必要があるため、 <strong><em>メンバー</em></strong>関数の暗黙の <code>this</code> 引数が常に含まれます。 これ以外に、オーバーロードしてゼロを含む任意の数の追加の引数を取ることができます。
ko: 함수 함수라고도하는 함수 객체를 만드는 데 사용되는 함수 호출 연산자는 <strong><em>멤버</em></strong> 함수로 정의되어야하므로 항상 <strong><em>멤버</em></strong> 함수의 암시 적 인수를 갖습니다. 이 외에는 0을 포함하여 여러 개의 추가 인수를 사용하도록 오버로드 될 수 있습니다.
ru: Оператор вызова функции, используемый для создания объектов функций, также известных как функторы, должен быть определен как функция- <strong><em>член</em></strong> , поэтому он всегда имеет неявный аргумент функции-члена. Кроме этого, он может быть перегружен, чтобы принимать любое количество дополнительных аргументов, включая ноль.
zh_cn: 必须将用于创建函数对象（也称为函子）的函数调用运算符定义为<strong><em>成员</em></strong>函数，因此它始终具有成员函数的隐式 <code>this</code> 参数。 除此之外，可以重载任何数量的附加参数，包括零。

source: The important thing to note here is that only two of these operators actually do anything, the others are just forwarding their arguments to either of these two to do the actual work.
es: Lo importante es que sólo dos de estos operadores hacen algo,los otros sólo transmiten sus argumentos a cualquiera de estos dos para hacer el trabajo.
ja: ここで注意すべき重要なことは、これらの演算子のうち2つだけが実際に何かをしているということで、他の演算子は、実際の作業を行うために、この2つのどちらかに引数を転送しているだけです。
ko: 여기서 주목해야 할 중요한 것은이 연산자 중 두 개만 실제로 어떤 작업을 수행하고 다른 작업자는 실제 작업을 수행하기 위해이 두 가지 중 하나에 인수를 전달하는 것입니다.
ru: Здесь важно отметить,что только два из этих операторов на самом деле что-то делают,остальные просто передают свои аргументы любому из этих двух,чтобы сделать реальную работу.
zh_cn: 这里需要注意的是,这些操作者中只有两个人实际做了什么,其他的人只是把他们的论点转给这两个人中的任何一个来做实际工作。

source: The standard library comes with the appropriate overloads of the new and delete operators for this:
es: La biblioteca estándar viene con las sobrecargas apropiadas de los operadores nuevos y de los borradores para esto:
ja: 標準ライブラリには、このためのnew演算子とdelete演算子の適切なオーバーロードが付属しています。
ko: 표준 라이브러리는이를 위해 new 및 delete 연산자의 적절한 과부하가 제공됩니다.
ru: Стандартная библиотека поставляется с соответствующими перегрузками операторов new и delete для этого:
zh_cn: 标准库自带了相应的new和delete操作符的重载。

source: The standard library&rsquo;s algorithms (e.g. <code>std::sort()</code>) and types (e.g. <code>std::map</code>) will always only expect <code>operator&lt;</code> to be present. However, the <em>users of your type will expect all the other operators to be present</em>, too, so if you define <code>operator&lt;</code>, be sure to follow the third fundamental rule of operator overloading and also define all the other boolean comparison operators. The canonical way to implement them is this:
es: Los algoritmos de la biblioteca est&aacute;ndar (p. Ej., <code>std::sort()</code> ) y los tipos (p. Ej., <code>std::map</code> ) siempre esperar&aacute;n que el <code>operator&lt;</code> est&eacute; presente. Sin embargo, los <em>usuarios de su tipo esperar&aacute;n que todos los dem&aacute;s operadores tambi&eacute;n est&eacute;n presentes</em> , por lo que si define el <code>operator&lt;</code> , aseg&uacute;rese de seguir la tercera regla fundamental de sobrecarga del operador y tambi&eacute;n definir todos los dem&aacute;s operadores de comparaci&oacute;n booleanos. La forma can&oacute;nica de implementarlos es esta:
ja: 標準ライブラリのアルゴリズム（例： <code>std::sort()</code> ）とタイプ（例： <code>std::map</code> ）は、常に <code>operator&lt;</code> が存在することだけを期待します。 ただし、 <em>同じタイプ</em>の<em>ユーザーは、他のすべての演算子も存在することを期待している</em>ため、 <code>operator&lt;</code> を定義する場合は、演算子のオーバーロードの3番目の基本ルールに従い、他のすべてのブール比較演算子も定義してください。 それらを実装する正規の方法はこれです：
ko: 표준 라이브러리의 알고리즘 (예 : <code>std::sort()</code> ) 및 유형 (예 : <code>std::map</code> )은 항상 <code>operator&lt;</code> 만있을 것으로 예상합니다. 그러나 <em>유형</em> 의 <em>사용자는 다른 모든 연산자도 존재할 것으로 예상</em> 하므로 <code>operator&lt;</code> 를 정의하면 연산자 오버로드의 세 번째 기본 규칙을 따르고 다른 모든 부울 비교 연산자도 정의해야합니다. 그것들을 구현하는 정식 방법은 다음과 같습니다.
ru: Алгоритмы стандартной библиотеки (например, <code>std::sort()</code> ) и типы (например, <code>std::map</code> ) всегда будут ожидать только наличия <code>operator&lt;</code> . Однако <em>пользователи вашего типа будут ожидать, что будут присутствовать все другие операторы</em> , поэтому, если вы определите <code>operator&lt;</code> , обязательно следуйте третьему фундаментальному правилу перегрузки операторов, а также определите все другие логические операторы сравнения. Канонический способ их реализации заключается в следующем:
zh_cn: 标准库的算法（例如 <code>std::sort()</code> ）和类型（例如 <code>std::map</code> ）将始终仅期望 <code>operator&lt;</code> 存在。 但是， <em>您的类型</em>的<em>用户也希望所有其他运算符也都出现</em> ，因此，如果您定义 <code>operator&lt;</code> ，请确保遵循运算符重载的第三条基本规则，并且还要定义所有其他布尔比较运算符。 实施它们的规范方法是：
