Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Continue to <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">The Three Basic Rules of Operator Overloading in C++</a>.
es: Contin&uacute;e con <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">Las tres reglas b&aacute;sicas de sobrecarga del operador en C ++</a> .
ja: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">C ++での演算子のオーバーロードの3つの基本ルールに</a>進みます 。
ko: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">C ++에서 연산자 오버로드의 3 가지 기본 규칙을</a> 계속하십시오.
ru: Перейдите к <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">трем основным правилам перегрузки операторов в C ++</a> .
zh_cn: 继续<a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421708#4421708">遵循C ++中运算符重载的三个基本规则</a> 。

source: Continue to <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">Common operators to overload</a>.
es: Continuar a <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">operadores comunes para sobrecargar</a> .
ja: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">一般的な演算子に</a>進み、 オーバーロードします。
ko: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">오버로드</a> 하려면 일반 연산자를 계속하십시오.
ru: Перейдите к <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">общим операторам для перегрузки</a> .
zh_cn: 继续让<a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421719#4421719">Common运算符超载</a> 。

source: Continue to <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">The Decision between Member and Non-member</a>.
es: Contin&uacute;e con <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">la Decisi&oacute;n entre miembro y no miembro</a> .
ja: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">会員と非会員の決定に</a>進みます。
ko: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">멤버와 비 멤버 사이의 결정으로</a> 계속하십시오.
ru: Перейдите к <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">решению между членом и не членом</a> .
zh_cn: 继续进行<a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421729#4421729">成员与非成员之间的决定</a> 。

source: Continue to <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791">Overloading <code>new</code> and <code>delete</code></a>.
es: Continuar a <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791">Sobrecargando <code>new</code> y <code>delete</code> </a> .
ja: <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791"> <code>new</code> および <code>delete</code> オーバーロードに</a>進みます。
ko: 계속 <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791"> <code>new</code> </a> 을 로드하고 <code>delete</code> 합니다.
ru: Продолжить <a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791">перегрузку <code>new</code> и <code>delete</code> </a> .
zh_cn: 继续<a href="https://stackoverflow.com/questions/4421706/operator-overloading-in-c/4421791#4421791">重载 <code>new</code> 和 <code>delete</code> </a> 。

source: Continue to <a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">Conversion Operators</a>
es: Continuar a los <a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">operadores de conversi&oacute;n</a>
ja: <a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">変換演算子に進む</a>
ko: <a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">전환 연산자</a> 계속
ru: Перейти к <a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">операторам преобразования</a>
zh_cn: 继续向<a href="https://stackoverflow.com/questions/4421706/operator-overloading/16615725#16615725">转换运算符</a>

source: Conversion Operators
es: Operadores de conversión
ja: 変換演算子
ko: 변환 연산자
ru: Операторы преобразования
zh_cn: 转换操作人员

source: Conversion Operators (also known as User Defined Conversions)
es: Operadores de conversión (también conocidos como conversiones definidas por el usuario)
ja: 変換演算子(ユーザー定義変換とも呼ばれる
ko: 전환 연산자 (사용자 정의 전환이라고도 함)
ru: Операторы преобразования (также известные как пользовательские преобразования)
zh_cn: 转换操作器(也称为用户定义的转换操作器

source: Explicit Conversion Operators (C++11)
es: Operadores de conversión explícita (C++11)
ja: 明示的な変換演算子(C++11
ko: 명시 적 변환 연산자 (C ++ 11)
ru: Операторы явного преобразования (C++11)
zh_cn: 显式转换运算符(C++11)

source: For <code>operator-&gt;*()</code> see <a href="https://stackoverflow.com/q/8777845/140719">this question</a>. It's rarely used and thus rarely ever overloaded. In fact, even iterators do not overload it.
es: Para el <code>operator-&gt;*()</code> vea <a href="https://stackoverflow.com/q/8777845/140719">esta pregunta</a> . Raramente se usa y, por lo tanto, rara vez se sobrecarga. De hecho, incluso los iteradores no lo sobrecargan.
ja: <code>operator-&gt;*()</code> については、 <a href="https://stackoverflow.com/q/8777845/140719">この質問を</a>参照してください。 これはめったに使用されないため、めったにオーバーロードされません。 実際、イテレータでさえそれをオーバーロードしません。
ko: <code>operator-&gt;*()</code> <a href="https://stackoverflow.com/q/8777845/140719">이 질문을</a> 참조하십시오. 거의 사용되지 않으므로 과부하가 걸리지 않습니다. 실제로 반복자조차도 과부하되지 않습니다.
ru: Для <code>operator-&gt;*()</code> см. <a href="https://stackoverflow.com/q/8777845/140719">Этот вопрос</a> . Он редко используется и, следовательно, редко перегружается. На самом деле, даже итераторы не перегружают его.
zh_cn: 对于 <code>operator-&gt;*()</code> ,请参阅<a href="https://stackoverflow.com/q/8777845/140719">此问题</a> 。 它很少使用，因此也很少过载。 实际上，即使迭代器也不会使它过载。

source: For all operators where you have to choose to either implement them as a member function or a non-member function, <strong><em>use the following rules of thumb</em></strong> to decide:
es: Para todos los operadores en los que tiene que elegir implementarlos como una funci&oacute;n miembro o una funci&oacute;n no miembro, <strong><em>use las siguientes reglas generales</em></strong> para decidir:
ja: メンバー関数として実装するか、非メンバー関数として実装するかを選択する必要があるすべての演算子について<strong><em>、次の経験則</em></strong>を<strong><em>使用し</em></strong>て決定します。
ko: 멤버 함수 또는 비 멤버 함수로 구현하도록 선택해야하는 모든 연산자에 <strong><em>대해 다음 경험 규칙을 사용하여</em></strong> 결정하십시오.
ru: Для всех операторов, для которых вам необходимо выбрать их реализацию в качестве функции-члена или функции, не являющейся членом, <strong><em>используйте следующие практические правила,</em></strong> чтобы принять решение:
zh_cn: 对于必须选择将其实现为成员函数或非成员函数的所有运算符，请<strong><em>使用以下经验法则</em></strong>来确定：

source: For defining your own iterators or smart pointers, you have to overload the unary prefix dereference operator <code>*</code> and the binary infix pointer member access operator <code>-&gt;</code>:
es: Para definir sus propios iteradores o punteros inteligentes, debe sobrecargar el operador de desreferencia de prefijo unario <code>*</code> y el operador de acceso de miembro de puntero infijo binario <code>-&gt;</code> :
ja: 独自のイテレータまたはスマートポインタを定義するには、単項プレフィックス逆参照演算子 <code>*</code> とバイナリ中置ポインタメンバアクセス演算子 <code>-&gt;</code> をオーバーロードする必要があります。
ko: 자체 반복자 또는 스마트 포인터를 정의하려면 단항 접두사 역 참조 연산자 <code>*</code> 및 이진 접두사 포인터 멤버 액세스 연산자 <code>-&gt;</code> 를 오버로드해야합니다.
ru: Для определения ваших собственных итераторов или умных указателей вы должны перегрузить оператор разыменования унарного префикса <code>*</code> и оператор доступа к двоичному инфиксному указателю <code>-&gt;</code> :
zh_cn: 要定义自己的迭代器或智能指针，您必须重载一元前缀取消引用运算符 <code>*</code> 和二进制中缀指针成员访问运算符 <code>-&gt;</code> ：

source: For the binary arithmetic operators, do not forget to obey the third basic rule operator overloading: If you provide <code>+</code>, also provide <code>+=</code>, if you provide <code>-</code>, do not omit <code>-=</code>, etc. Andrew Koenig is said to have been the first to observe that the compound assignment operators can be used as a base for their non-compound counterparts. That is, operator <code>+</code> is implemented in terms of <code>+=</code>, <code>-</code> is implemented in terms of <code>-=</code> etc.
es: Para los operadores aritm&eacute;ticos binarios, no olvide obedecer la tercera sobrecarga del operador de la regla b&aacute;sica: si proporciona <code>+</code> , tambi&eacute;n proporciona <code>+=</code> , si proporciona <code>-</code> , no omita <code>-=</code> , etc. Se dice que Andrew Koenig fue el primero para observar que los operadores de asignaci&oacute;n compuesta pueden usarse como base para sus contrapartes no compuestas. Es decir, el operador <code>+</code> se implementa en t&eacute;rminos de <code>+=</code> , <code>-</code> se implementa en t&eacute;rminos de <code>-=</code> etc.
ja: 2項算術演算子の場合、3番目の基本ルール演算子のオーバーロードに従うことを忘れないでください。 <code>+</code> を指定する場合は、 <code>+=</code> も指定し 、 <code>-</code> を指定する場合は、 <code>-=</code> を省略しないでください。アンドリューケーニッヒが最初の複合代入演算子が非複合対応のベースとして使用できることを確認します。 つまり、演算子 <code>+</code> は <code>+=</code> の観点から実装され、 <code>-</code> は <code>-=</code> の観点から実装されます。
ko: 이진 산술 연산자의 경우 세 번째 기본 규칙 연산자 오버로드를 준수하는 것을 잊지 마십시오. <code>+</code> 를 제공하는 경우 <code>+=</code> 를 제공하고 <code>-</code> 를 제공하면 <code>-=</code> 등을 생략하지 마십시오. Andrew Koenig는 처음으로 알려져 있습니다 화합물 할당 연산자를 비화합물 대응의 기반으로 사용할 수 있습니다. 즉, 연산자 <code>+</code> 는 <code>+=</code> 의 관점에서 구현되고, <code>-</code> 는 <code>-=</code> 등의 관점에서 구현됩니다.
ru: Для бинарных арифметических операторов не забывайте подчиняться перегрузке третьего оператора основного правила: если вы предоставляете <code>+</code> , также предоставляете <code>+=</code> , если вы предоставляете <code>-</code> , не опускайте <code>-=</code> и т. Д. Эндрю Кениг, как говорят, был первым заметить, что составные операторы присваивания могут использоваться в качестве основы для их несоставных аналогов. То есть оператор <code>+</code> реализован в терминах <code>+=</code> , <code>-</code> реализован в терминах <code>-=</code> и т. Д.
zh_cn: 对于二进制算术运算符，请不要忘记遵守第三个基本规则运算符重载：如果提供 <code>+</code> ，还提供 <code>+=</code> ，如果提供 <code>-</code> ，请不要省略 <code>-=</code> ，等等。据说安德鲁&middot;科尼希（Andrew Koenig）是第一个观察到化合物赋值运算符可以用作其非化合物对应物的基础。 也就是说，运算符 <code>+</code> 是根据 <code>+=</code> 实现的， <code>-</code> 是依据 <code>-=</code> 实现的等。

source: Function call operator
es: Función llamar al operador
ja: 関数呼び出しオペレータ
ko: 함수 호출 연산자
ru: Оператор вызова функций
zh_cn: 函数调用操作员

source: Given that, you cannot use:
es: Dado eso,no puedes usar:
ja: それを考えると、使えません。
ko: 주어진 경우 다음을 사용할 수 없습니다.
ru: Учитывая это,ты не можешь использовать:
zh_cn: 鉴于此,你不能使用。

source: Global new and delete
es: Global nuevo y eliminar
ja: グローバル新規・削除
ko: 글로벌 신규 및 삭제
ru: Глобальные новые и удалить
zh_cn: 全局新增和删除

source: Here's an example of the syntax:
es: Aquí hay un ejemplo de la sintaxis:
ja: 構文の例です。
ko: 구문의 예는 다음과 같습니다.
ru: Вот пример синтаксиса:
zh_cn: 下面是一个语法的例子。

source: However, the fact that you <em>can</em> overload all of these does not mean you <em>should</em> do so. See the basic rules of operator overloading.
es: Sin embargo, el hecho de que <em>pueda</em> sobrecargar todo esto no significa que <em>deba</em> hacerlo. Consulte las reglas b&aacute;sicas de sobrecarga del operador.
ja: ただし、これらすべてをオーバーロード<em>できる</em>という事実は、そうする<em>必要</em>があるという意味では<em>あり</em>ません。 演算子のオーバーロードの基本的なルールをご覧ください。
ko: 그러나 이러한 모든 항목을 오버로드 할 <em>수</em> 있다고해서 그렇게 <em>해야하는</em> 것은 아닙니다. 운영자 과부하의 기본 규칙을 참조하십시오.
ru: Однако тот факт, что вы <em>можете</em> перегружать все это, не означает, что вы <em>должны</em> это делать. Смотрите основные правила перегрузки операторов.
zh_cn: 但是，您<em>可以</em>重载所有这些事实并不意味着您<em>应该</em>这样做。 请参阅运算符重载的基本规则。

source: However, there is one exception to this: The compiler is allowed to implicitly convert to <code>bool</code>. In addition, the compiler is not allowed to do another implicit conversion after it converts to <code>bool</code> (a compiler is allowed to do 2 implicit conversions at a time, but only 1 user-defined conversion at max).
es: Sin embargo, hay una excepci&oacute;n a esto: el compilador puede convertir impl&iacute;citamente a <code>bool</code> . Adem&aacute;s, el compilador no puede realizar otra conversi&oacute;n impl&iacute;cita despu&eacute;s de convertir a <code>bool</code> (un compilador puede realizar 2 conversiones impl&iacute;citas a la vez, pero solo 1 conversi&oacute;n definida por el usuario como m&aacute;ximo).
ja: ただし、これには1つの例外があります。コンパイラは暗黙的に <code>bool</code> に変換できます。 さらに、コンパイラーは <code>bool</code> に変換された後、別の暗黙的な変換を行うことはできません（コンパイラーは、一度に2つの暗黙的な変換を行うことができますが、最大でユーザー定義の変換は1つだけです）。
ko: 그러나 이에 대한 한 가지 예외가 있습니다. 컴파일러는 암시 적으로 <code>bool</code> 로 변환 할 수 있습니다. 또한 컴파일러는 <code>bool</code> 로 변환 한 후 다른 암시 적 변환을 수행 할 수 없습니다 (컴파일러는 한 번에 2 개의 암시 적 변환을 수행 할 수 있지만 최대 1 개의 사용자 정의 변환 만 수행 할 수 있음).
ru: Однако есть одно исключение: компилятору разрешено неявно преобразовывать в <code>bool</code> . Кроме того, компилятору не разрешается делать другое неявное преобразование после его преобразования в <code>bool</code> (компилятору разрешено делать 2 неявных преобразования за раз, но только 1 пользовательское преобразование при максимуме).
zh_cn: 但是，有一个例外：允许编译器隐式转换为 <code>bool</code> 。 另外，编译器在转换为 <code>bool</code> 后，不允许进行其他隐式转换（编译器一次只能进行2次隐式转换，但最多只能进行1个用户定义的转换）。

source: If a binary operator does <strong><em>not</em></strong> treat both of its operands <strong><em>equally</em></strong> (usually it will change its left operand), it might be useful to make it a <strong><em>member</em></strong> function of its left operand&rsquo;s type, if it has to access the operand's private parts.
es: Si un operador binario <strong><em>no</em></strong> trata ambos operandos por <strong><em>igual</em></strong> (por lo general, cambiar&aacute; su operando izquierdo), podr&iacute;a ser &uacute;til convertirlo en una funci&oacute;n <strong><em>miembro</em></strong> del tipo de su operando izquierdo, si tiene que acceder a las partes privadas del operando.
ja: 二項演算子が両方のオペランドを<strong><em>同等に</em></strong>扱わ<strong><em>ない</em></strong>場合（通常は、左側のオペランドを変更します）、オペランドのプライベート部分にアクセスする必要がある場合は、それを左側のオペランドの型の<strong><em>メンバー</em></strong>関数にすると便利です。
ko: 이항 연산자가 두 피연산자 모두를 <strong><em>동일하게</em></strong> 취급하지 <strong><em>않으면</em></strong> (보통 왼쪽 피연산자가 변경됨) 피연산자의 개인 부분에 액세스해야하는 경우 왼쪽 피연산자 유형의 <strong><em>멤버</em></strong> 함수로 만드는 것이 유용 할 수 있습니다.
ru: Если бинарный оператор <strong><em>не</em></strong> обрабатывает оба своих операнда <strong><em>одинаково</em></strong> (обычно он меняет свой левый операнд), может быть полезно сделать его функцией- <strong><em>членом</em></strong> типа своего левого операнда, если он должен получить доступ к закрытым частям операнда.
zh_cn: 如果二进制运算符<strong><em>不能</em></strong> <strong><em>平等地</em></strong>对待其两个操作数（通常会更改其左操作数），则在必须访问该操作数的私有部分的情况下，使其成为其左操作数类型的<strong><em>成员</em></strong>函数可能会很有用。

source: If a binary operator treats <strong><em>both operands equally</em></strong> (it leaves them unchanged), implement this operator as a <strong><em>non-member</em></strong> function.
es: Si un operador binario trata <strong><em>ambos operandos por igual</em></strong> (los deja sin cambios), implemente este operador como una funci&oacute;n <strong><em>no miembro</em></strong> .
ja: 2項演算子が<strong><em>両方のオペランドを同等に</em></strong>処理<strong><em>する</em></strong> （変更しないままにする）場合は、この演算子を<strong><em>非メンバー</em></strong>関数として実装します。
ko: 이항 연산자가 <strong><em>두 피연산자를 모두 동일하게</em></strong> 취급하는 경우 (이를 변경하지 않은 채로 두는 경우)이 연산자를 <strong><em>멤버</em></strong> 가 <strong><em>아닌</em></strong> 함수로 구현하십시오.
ru: Если бинарный оператор обрабатывает <strong><em>оба операнда одинаково</em></strong> (он оставляет их без изменений), реализуйте этот оператор как функцию, <strong><em>не являющуюся членом</em></strong> .
zh_cn: 如果二进制运算符将<strong><em>两个操作数均等地</em></strong>对待（使它们不变），则将该运算符实现<strong><em>为非成员</em></strong>函数。

source: If it is a <strong><em>unary operator</em></strong>, implement it as a <strong><em>member</em></strong> function.
es: Si es un <strong><em>operador unario</em></strong> , implem&eacute;ntelo como una funci&oacute;n <strong><em>miembro</em></strong> .
ja: <strong><em>単項演算子の</em></strong>場合は、 <strong><em>メンバー</em></strong>関数として実装します。
ko: <strong><em>단항 연산자</em></strong> 인 경우이를 <strong><em>멤버</em></strong> 함수로 구현하십시오.
ru: Если это <strong><em>унарный оператор</em></strong> , реализуйте его как функцию- <strong><em>член</em></strong> .
zh_cn: 如果它是一<strong><em>元运算符</em></strong> ，则将其实现为<strong><em>成员</em></strong>函数。

source: If value_type is known to refer to a built-in type, the const variant of the operator should better return a copy instead of a const reference:
es: Si se sabe que value_type se refiere a un tipo incorporado,la variante const del operador debería devolver mejor una copia en lugar de una referencia const:
ja: value_typeが組み込み型を参照していることがわかっている場合、演算子のconst variantはconst参照ではなくコピーを返すのがよいでしょう。
ko: value_type이 내장 유형을 참조하는 것으로 알려진 경우 연산자의 const 변형은 const 참조 대신 복사본을 반환하는 것이 좋습니다.
ru: Если известно,что тип value_относится к встроенному типу,то вариант const оператора лучше возвращать копию,а не const ссылку:
zh_cn: 如果已知value_type是指一个内置类型,那么操作符的const变体最好返回一个副本而不是const引用。

source: If you define it as a non-member function,
es: Si se define como una función no miembro,
ja: 非メンバー関数として定義した場合。
ko: 비 멤버 함수로 정의하면
ru: Если вы определите ее как функцию,не являющуюся членом,
zh_cn: 如果你把它定义为非会员功能。

source: If you overload <code>new</code> and <code>delete</code>, you should consider overloading the array variants, too.
es: Si sobrecarga <code>new</code> y <code>delete</code> , tambi&eacute;n debe considerar sobrecargar las variantes de matriz.
ja: <code>new</code> と <code>delete</code> をオーバーロードする場合は、配列バリアントのオーバーロードも検討する必要があります。
ko: <code>new</code> 및 <code>delete</code> 를 오버로드하면 배열 변형도 오버로드하는 것을 고려해야합니다.
ru: Если вы перегружаете <code>new</code> и <code>delete</code> , вы должны также рассмотреть возможность перегрузки вариантов массива.
zh_cn: 如果重载 <code>new</code> 和 <code>delete</code> ，则也应考虑重载数组变量。

source: If you overload <code>operator new</code>, you should always also overload the matching <code>operator delete</code>, even if you never intend to call it. The reason is that, if a constructor throws during the evaluation of a new expression, the run-time system will return the memory to the <code>operator delete</code> matching the <code>operator new</code> that was called to allocate the memory to create the object in. If you do not provide a matching <code>operator delete</code>, the default one is called, which is almost always wrong.
es: Si sobrecarga al <code>operator new</code> , siempre debe sobrecargar tambi&eacute;n el <code>operator delete</code> coincidente eliminar , incluso si nunca tiene la intenci&oacute;n de llamarlo. La raz&oacute;n es que, si un constructor lanza durante la evaluaci&oacute;n de una nueva expresi&oacute;n, el sistema de tiempo de ejecuci&oacute;n devolver&aacute; la memoria al <code>operator delete</code> coincidencia con el <code>operator new</code> que se llam&oacute; para asignar la memoria para crear el objeto. Si lo hace no proporciona una <code>operator delete</code> coincidente, se llama al predeterminado, que casi siempre es incorrecto.
ja: <code>operator new</code> をオーバーロードする場合は、それを呼び出すつもりがなくても、対応する <code>operator delete</code> も常にオーバーロードする必要があります。 その理由は、新しい式の評価中にコンストラクターがスローした場合、ランタイムシステムは、オブジェクトを作成するためにメモリを割り当てるために呼び出された <code>operator new</code> と一致する演算 <code>operator delete</code> メモリを返すからです。対応する <code>operator delete</code> 提供しない場合、デフォルトの演算子が呼び出されますが、これはほとんどの場合間違っています。
ko: <code>operator new</code> 를 오버로드하는 경우 호출하지 않으려는 경우에도 항상 일치하는 <code>operator delete</code> 오버로드해야합니다. 그 이유는 새 표현식을 평가하는 동안 생성자가 throw되면 런타임 시스템이 메모리를 <code>operator delete</code> 에게 반환하여 객체를 만들기 위해 메모리를 할당하기 위해 호출 된 <code>operator new</code> 일치하는 것을 삭제 하기 때문입니다. 일치하는 <code>operator delete</code> 제공하지 않으면 기본 연산자 가 호출되며 거의 항상 잘못됩니다.
ru: Если вы перегружаете <code>operator new</code> , вы также должны всегда перегружать соответствующий <code>operator delete</code> , даже если вы никогда не намеревались его вызывать. Причина в том, что, если конструктор выдает во время вычисления нового выражения, система времени выполнения вернет память <code>operator delete</code> совпадающему с <code>operator new</code> который был вызван для выделения памяти для создания объекта. Если вы это делаете не предоставлять соответствующий <code>operator delete</code> , вызывается оператор по умолчанию, что почти всегда неверно.
zh_cn: 如果您重载了 <code>operator new</code> ，那么即使您从未打算调用它，也应该始终重载匹配的 <code>operator delete</code> 。 原因是，如果构造函数在对新表达式求值时抛出异常，则运行时系统会将内存返回给 <code>operator delete</code> 将其与匹配的 <code>operator new</code> 运算符相匹配，后者被调用以分配内存以创建对象。不提供匹配的 <code>operator delete</code> ，则调用默认的运算符 ，这几乎总是错误的。

source: Implicit Conversion Operators (C++98/C++03 and C++11)
es: Operadores de conversión implícita (C++98C++03 y C++11)
ja: 暗黙の変換演算子(C++98C++03 および C++11
ko: 암시 적 변환 연산자 (C ++ 98 / C ++ 03 및 C ++ 11)
ru: Неявные операторы преобразования (C++98C++03 и C++11)
zh_cn: 隐式转换运算符(C++98C++03和C++11)

source: Implicit conversion operators, like one-argument constructors, are user-defined conversions. Compilers will grant one user-defined conversion when trying to match a call to an overloaded function.
es: Los operadores de conversión implícita,como los constructores de un solo argumento,son conversiones definidas por el usuario.Los compiladores concederán una conversión definida por el usuario cuando traten de hacer coincidir una llamada con una función sobrecargada.
ja: 1引数のコンストラクタのような暗黙の変換演算子は,ユーザ定義の変換です。コンパイラは,オーバーロードされた関数の呼び出しにマッチさせようとするときに,ユーザ定義の変換を1つ付与します。
ko: 하나의 인수 생성자와 같은 암시 적 변환 연산자는 사용자 정의 변환입니다. 컴파일러는 오버로드 된 함수에 대한 호출을 일치 시키려고 할 때 하나의 사용자 정의 변환을 허용합니다.
ru: Неявные операторы преобразования,как и однопараметрические конструкторы,являются определяемыми пользователем преобразованиями.Компиляторы выдают одно пользовательское преобразование при попытке сопоставить вызов перегруженной функции.
zh_cn: 隐式转换操作符,就像单参数构造函数一样,是用户定义的转换。编译器在尝试匹配调用重载函数时,会授予一个用户定义的转换操作符。

source: In C++ you can create conversion operators, operators that allow the compiler to convert between your types and other defined types. There are two types of conversion operators, implicit and explicit ones.
es: En C++se pueden crear operadores de conversión,operadores que permiten al compilador convertir entre sus tipos y otros tipos definidos.Hay dos tipos de operadores de conversión,implícitos y explícitos.
ja: C++では、変換演算子を作成することができます。これは、コンパイラが自分の型と他の定義された型の間で変換することを可能にする演算子です。変換演算子には、暗黙的なものと明示的なものの2種類があります。
ko: C ++에서는 컴파일러가 형식과 다른 정의 된 형식 사이에서 변환 할 수 있도록하는 연산자 인 변환 연산자를 만들 수 있습니다. 암시 적 연산자와 명시 적 연산자의 두 가지 유형의 변환 연산자가 있습니다.
ru: В C++можно создавать операторы преобразования,операторы,которые позволяют компилятору преобразовывать между вашими типами и другими заданными типами.Существует два типа операторов преобразования-неявные и явные.
zh_cn: 在C++中,你可以创建转换操作符,即允许编译器在你的类型和其他定义的类型之间进行转换的操作符。转换操作符有两种类型,隐式和显式转换操作符。
