Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <sup>2</sup><sub>This is covered in <a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">a later part</a> of this FAQ.</sub>
es: <sup>2</sup> <sub>Esto est&aacute; cubierto en <a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">una parte posterior</a> de estas preguntas frecuentes.</sub>
ja: <sup>2</sup> <sub>これについては、このFAQの<a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">後半で説明し</a>ます。</sub>
ko: <sup>2</sup> <sub>이 내용은이 FAQ <a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">의 뒷부분</a> 에서 다룹니다.</sub>
ru: <sup>2</sup> <sub>Это рассматривается в <a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">более поздней части</a> этого FAQ.</sub>
zh_cn: <sup>2</sup> <sub>此常见问题<a href="https://stackoverflow.com/questions/4421706/operator-overloading/4421729#4421729">的后面部分</a>对此进行了介绍。</sub>

source: <sup>3</sup><sub>Again, the lesson to be taken from this is that <code>a += b</code> is, in general, more efficient than <code>a + b</code> and should be preferred if possible.</sub>
es: <sup>3</sup> <sub>Nuevamente, la lecci&oacute;n que se debe extraer de esto es que <code>a += b</code> es, en general, m&aacute;s eficiente que <code>a + b</code> y se deber&iacute;a preferir si es posible.</sub>
ja: <sup>3</sup> <sub>繰り返しますが、これから得られる教訓は、 <code>a += b</code> は一般に <code>a + b</code> よりも効率的であり、可能であれば推奨されるということです。</sub>
ko: <sub>다시 한번, 이것으로부터 얻은 교훈은 <code>a += b</code> 가 일반적으로 <code>a + b</code> 보다 효율적이며 가능하다면 선호되어야한다는 것입니다.</sub>
ru: <sup>3</sup> <sub>Опять же, урок, который следует извлечь из этого, заключается в том, что <code>a += b</code> , в целом, более эффективен, чем <code>a + b</code> и его следует по возможности использовать предпочтительнее.</sub>
zh_cn: <sup>3</sup> <sub>再次，从中可以得出的教训是， <code>a += b</code> 通常比 <code>a + b</code> 更有效，并且如果可能的话应该首选。</sub>

source: <sup>3</sup><sub>The <code>@</code> is not a valid operator in C++ which is why I use it as a placeholder.</sub>
es: <sup>3</sup> <sub> <code>@</code> no es un operador v&aacute;lido en C ++, por eso lo uso como marcador de posici&oacute;n.</sub>
ja: <sup>3</sup> <sub> <code>@</code> はC ++では有効な演算子ではないため、プレースホルダーとして使用しています。</sub>
ko: <sup>3</sup> <sub> <code>@</code> 는 C ++에서 유효한 연산자가 아니기 때문에 자리 표시 자로 사용합니다.</sub>
ru: <sup>3</sup> <sub> <code>@</code> не является допустимым оператором в C ++, поэтому я использую его как заполнитель.</sub>
zh_cn: <sup>3</sup> <sub> <code>@</code> 在C ++中不是有效的运算符，这就是为什么我将其用作占位符。</sub>

source: <sup>4</sup><sub>The only ternary operator in C++ cannot be overloaded and the only n-ary operator must always be implemented as a member function.</sub>
es: <sup>4</sup> <sub>El &uacute;nico operador ternario en C ++ no se puede sobrecargar y el &uacute;nico operador n-ary siempre debe implementarse como una funci&oacute;n miembro.</sub>
ja: <sup>4</sup> <sub>C ++の唯一の3項演算子はオーバーロードできず、唯一のn項演算子は常にメンバー関数として実装する必要があります。</sub>
ko: <sup>4</sup> <sub>C ++의 유일한 삼항 연산자는 오버로드 될 수 없으며 유일한 n- 항 연산자는 항상 멤버 함수로 구현되어야합니다.</sub>
ru: <sup>4</sup> <sub>Единственный троичный оператор в C ++ не может быть перегружен, и единственный n-арный оператор всегда должен быть реализован как функция-член.</sub>
zh_cn: <sup>4</sup> <sub>C ++中唯一的三元运算符不能重载，并且唯一的n元运算符必须始终作为成员函数实现。</sub>

source: <sup><strong><em>Note:</em></strong> This only deals with the <strong><em>syntax</em></strong> of overloading <code>new</code> and <code>delete</code>, not with the <strong><em>implementation</em></strong> of such overloaded operators. I think that the semantics of overloading <strong><em><a href="https://stackoverflow.com/questions/7149461/"><code>new</code> and <code>delete</code> deserve their own FAQ</a></em></strong>, within the topic of operator overloading I can never do it justice.</sup>
es: <sup><strong><em>Nota:</em></strong> Esto solo trata con la <strong><em>sintaxis</em></strong> de sobrecargar <code>new</code> y <code>delete</code> , no con la <strong><em>implementaci&oacute;n</em></strong> de dichos operadores sobrecargados.</sup> <sup>Creo que la sem&aacute;ntica de sobrecargar <strong><em><a href="https://stackoverflow.com/questions/7149461/"> <code>new</code> y <code>delete</code> merecen sus propias preguntas frecuentes</a></em></strong> , en el tema de la sobrecarga de operadores nunca puedo hacerle justicia.</sup>
ja: <sup><strong><em>注：</em></strong>これは、オーバーロードされた <code>new</code> および <code>delete</code> の <strong><em>構文</em></strong>のみを扱い、そのようなオーバーロードされた演算子の<strong><em>実装</em></strong>は扱いません。</sup> <sup><strong><em><a href="https://stackoverflow.com/questions/7149461/"> <code>new</code> と <code>delete</code> </a></em></strong>のオーバーロードのセマンティクスは<strong><em>独自のFAQ</em></strong>に<strong><em>値するもの</em></strong>だと思います。オペレーターのオーバーロードのトピックでは、正直に言うことはできません。</sup>
ko: <sup><strong><em>참고 :</em></strong> 이것은 과부하 된 연산자의 <strong><em>구현</em></strong> 이 아니라 <code>new</code> 및 <code>delete</code> 오버로드 <strong><em>구문</em></strong> 만 처리 <strong><em>합니다</em></strong> .</sup> <sup>나는 <strong><em><a href="https://stackoverflow.com/questions/7149461/"> <code>new</code> </a></em></strong> 과부하 <strong><em>및 <code>delete</code> </em></strong> 의 의미가 운영자 과부하의 주제 내에서 <strong><em>자체 FAQ를받을 가치가</em></strong> 있다고 생각합니다. 나는 결코 그것을 정의 할 수 없습니다.</sup>
ru: <sup><strong><em>Примечание.</em></strong> Это касается только <strong><em>синтаксиса</em></strong> перегрузки <code>new</code> и <code>delete</code> , а не <strong><em>реализации</em></strong> таких перегруженных операторов.</sup> <sup>Я думаю, что семантика перегрузки <strong><em><a href="https://stackoverflow.com/questions/7149461/"> <code>new</code> и <code>delete</code> заслуживает отдельного FAQ</a></em></strong> , в рамках темы перегрузки операторов я никогда не смогу отдать должное.</sup>
zh_cn: <sup><strong><em>注意：</em></strong>这仅处理重载 <code>new</code> 和 <code>delete</code> 的<strong><em>语法</em></strong> ，而不处理此类重载运算符的<strong><em>实现</em></strong> 。</sup> <sup>我认为重载<strong><em><a href="https://stackoverflow.com/questions/7149461/"> <code>new</code> 和 <code>delete</code> </a></em></strong>的语义<strong><em>应该得到他们自己的FAQ</em></strong> ，在运算符重载的主题内，我永远无法做到这一点。</sup>

source: According to our rules of thumb, <code>+</code> and its companions should be non-members, while their compound assignment counterparts (<code>+=</code> etc.), changing their left argument, should be a member. Here is the exemplary code for <code>+=</code> and <code>+</code>; the other binary arithmetic operators should be implemented in the same way:
es: De acuerdo con nuestras reglas generales, <code>+</code> y sus compa&ntilde;eros deber&iacute;an ser no miembros, mientras que sus contrapartes de asignaci&oacute;n compuesta ( <code>+=</code> etc.), que cambien su argumento izquierdo, deber&iacute;an ser miembros. Aqu&iacute; est&aacute; el c&oacute;digo ejemplar para <code>+=</code> y <code>+</code> ; los otros operadores aritm&eacute;ticos binarios deben implementarse de la misma manera:
ja: 経験則によると、 <code>+</code> とそのコンパニオンは非メンバーである必要がありますが、左側の引数を変更するそれらの複合代入の対応物（ <code>+=</code> など）はメンバーである必要があります。 <code>+=</code> と <code>+</code> のコード例を次に示します。 他の2項算術演算子も同じ方法で実装する必要があります。
ko: 경험 법칙에 따르면 <code>+</code> 와 그 동반자는 비회원이어야하며, 왼쪽 인수를 변경하는 복합 할당 상대 ( <code>+=</code> 등)는 회원이어야합니다. 다음은 <code>+=</code> 및 <code>+</code> 의 예제 코드입니다. 다른 이진 산술 연산자는 같은 방식으로 구현되어야합니다.
ru: Согласно нашим практическим правилам, <code>+</code> и его компаньоны не должны быть членами, в то время как их составные аналоги присваивания ( <code>+=</code> и т. Д.), Изменяя свой левый аргумент, должны быть членами. Вот примерный код для <code>+=</code> и <code>+</code> ; другие двоичные арифметические операторы должны быть реализованы таким же образом:
zh_cn: 根据我们的经验法则， <code>+</code> 及其同伴应为非成员，而其复合赋值对应对象（ <code>+=</code> 等）（更改其左参数）应为成员。 这是 <code>+=</code> 和 <code>+</code> 的示例代码； 其他二进制算术运算符应以相同的方式实现：

source: Among the operators that can be overloaded in C++ are these:
es: Entre los operadores que pueden ser sobrecargados en C++están estos:
ja: C++でオーバーロードできる演算子には、以下のようなものがあります。
ko: C ++에서 오버로드 될 수있는 연산자는 다음과 같습니다.
ru: Среди операторов,которые могут быть перегружены в C++,можно назвать следующие:
zh_cn: 在C++中可以超载的运算符有以下几种。

source: An implicit conversion operator allows the compiler to implicitly convert (like the conversion between <code>int</code> and <code>long</code>) the value of a user-defined type to some other type.
es: Un operador de conversi&oacute;n impl&iacute;cita permite que el compilador convierta impl&iacute;citamente (como la conversi&oacute;n entre <code>int</code> y <code>long</code> ) el valor de un tipo definido por el usuario a otro tipo.
ja: 暗黙的な変換演算子を使用すると、コンパイラーはユーザー定義型の値を他の型に暗黙的に変換できます（ <code>int</code> と <code>long</code> 間の変換のように）。
ko: 암시 적 변환 연산자를 사용하면 컴파일러에서 사용자 정의 형식의 값을 다른 형식으로 암시 적으로 변환 할 수 있습니다 ( <code>int</code> 와 <code>long</code> 간의 변환과 같은).
ru: Оператор неявного преобразования позволяет компилятору неявно преобразовывать (например, преобразование между <code>int</code> и <code>long</code> ) значение определенного пользователем типа в некоторый другой тип.
zh_cn: 隐式转换运算符允许编译器将用户定义类型的值隐式转换（例如 <code>int</code> 和 <code>long</code> 之间的转换）为其他类型。

source: Arithmetic Operators
es: Operadores aritméticos
ja: 算術演算子
ko: 산술 연산자
ru: арифметические операторы
zh_cn: 算术运算器

source: Array Subscripting
es: Suscripción de matrices
ja: 配列のサブスクリプト
ko: 배열 첨자
ru: Подписка на массив
zh_cn: 阵列订阅

source: Assignment Operator
es: Operador de asignación
ja: 割り当てオペレータ
ko: 할당 연산자
ru: Назначение оператора
zh_cn: 分配操作员

source: At first this seems very helpful, but the problem with this is that the implicit conversion even kicks in when it isn&rsquo;t expected to. In the following code, <code>void f(const char*)</code> will be called because <code>my_string()</code> is not an <a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">lvalue</a>, so the first does not match:
es: Al principio esto parece muy &uacute;til, pero el problema con esto es que la conversi&oacute;n impl&iacute;cita incluso se activa cuando no se espera que lo haga. En el siguiente c&oacute;digo, se llamar&aacute; a <code>void f(const char*)</code> porque <code>my_string()</code> no es un valor <a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">l</a> , por lo que el primero no coincide:
ja: 最初はこれは非常に役立つように見えますが、これの問題は、暗黙の変換が予期されていないときにも発生することです。 次のコードでは、 <code>my_string()</code> が<a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">左辺値</a>ではないため、最初のものが一致しないため、 <code>void f(const char*)</code> が呼び出されます。
ko: 처음에는 이것이 매우 도움이되는 것처럼 보이지만, 이것의 문제점은 암시 적 변환이 예상되지 않은 경우에도 시작된다는 것입니다. 다음 코드에서는 <code>my_string()</code> 이 <a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">lvalue</a> 가 아니기 때문에 <code>void f(const char*)</code> 가 호출되므로 첫 번째가 일치하지 않습니다.
ru: Поначалу это кажется очень полезным, но проблема в том, что неявное преобразование включается даже тогда, когда оно не ожидается. В следующем коде <code>void f(const char*)</code> будет вызван, потому что <code>my_string()</code> не является <a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">lvalue</a> , поэтому первое не совпадает:
zh_cn: 乍一看，这似乎很有帮助，但是问题是隐式转换甚至会在预期不到的时候启动。 在以下代码中，将调用 <code>void f(const char*)</code> 因为 <code>my_string()</code> 不是<a href="https://stackoverflow.com/questions/3601602/what-are-rvalues-lvalues-xvalues-glvalues-and-prvalues">左值</a> ，因此第一个不匹配：

source: Basically, the first and foremost rule for overloading operators, at its very heart, says: <em>Don&rsquo;t do it</em>. That might seem strange, because there is a lot to be known about operator overloading and so a lot of articles, book chapters, and other texts deal with all this. But despite this seemingly obvious evidence, <em>there are only a surprisingly few cases where operator overloading is appropriate</em>. The reason is that actually it is hard to understand the semantics behind the application of an operator unless the use of the operator in the application domain is well known and undisputed. Contrary to popular belief, this is hardly ever the case.
es: B&aacute;sicamente, la primera y m&aacute;s importante regla para sobrecargar a los operadores, en esencia, dice: <em>no lo hagas</em> . Puede parecer extra&ntilde;o, porque hay mucho que saber sobre la sobrecarga del operador y muchos art&iacute;culos, cap&iacute;tulos de libros y otros textos tratan de todo esto. Pero a pesar de esta evidencia aparentemente obvia, <em>solo hay unos pocos casos sorprendentemente donde la sobrecarga del operador es apropiada</em> . La raz&oacute;n es que en realidad es dif&iacute;cil entender la sem&aacute;ntica detr&aacute;s de la aplicaci&oacute;n de un operador a menos que el uso del operador en el dominio de la aplicaci&oacute;n sea bien conocido e indiscutible. Contrariamente a la creencia popular, este casi nunca es el caso.
ja: 基本的に、演算子をオーバーロードするための最初の、そして最も重要なルールは、まさにその中心で、次のように述べ<em>てい</em>ます。 これは奇妙に思えるかもしれません。演算子のオーバーロードについては多くのことが知られているため、多くの記事、本の章、およびその他のテキストがこれを扱っています。 しかし、この一見明白な証拠にもかかわらず<em>、演算子のオーバーロードが適切であるのは驚くほど少ないケース</em>です。 その理由は、アプリケーションドメインでのオペレーターの使用がよく知られていて議論の余地がない限り、実際にはオペレーターのアプリケーションの背後にあるセマンティクスを理解するのが難しいためです。 一般に信じられていることとは逆に、これはほとんどありません。
ko: 기본적으로 과부하 연산자의 가장 중요한 규칙은 다음과 같이 말합니다. <em>하지 마십시오</em> . 연산자 오버로드에 대해 알려진 것이 많고 많은 기사, 서적 장 및 기타 텍스트가이 모든 것을 다루기 때문에 이상하게 보일 수 있습니다. 그러나이 명백한 증거에도 불구하고 <em>운영자 과부하가 적절한 경우는 놀랍게도 거의 없습니다</em> . 그 이유는 애플리케이션 도메인에서 운영자의 사용이 잘 알려져 있고 논쟁의 여지가 없다면 운영자의 애플리케이션 뒤에 의미를 이해하기 어렵 기 때문입니다. 대중의 신념과는 달리 이것은 거의 사실이 아닙니다.
ru: По сути, первое и главное правило перегрузки операторов в самом его сердце гласит: <em>не делайте этого</em> . Это может показаться странным, потому что многое известно о перегрузке операторов, и поэтому многие статьи, главы книг и другие тексты имеют дело со всем этим. Но, несмотря на это, казалось бы, очевидное свидетельство, <em>есть только удивительно немного случаев, когда перегрузка оператора является уместной</em> . Причина в том, что на самом деле трудно понять семантику, лежащую в основе применения оператора, если использование оператора в области приложения хорошо известно и неоспоримо. Вопреки распространенному мнению, это вряд ли когда-либо.
zh_cn: 基本上，重载运算符的首要原则就是说： <em>不要这样做</em> 。 这似乎很奇怪，因为关于运算符重载有很多已知的知识，因此许多文章，书籍章节和其他文本都涉及到这一切。 尽管有这些看似显而易见的证据， <em>但只有极少数情况下适合使用运算符重载</em> 。 原因是实际上很难理解运算符应用程序背后的语义，除非在应用程序域中对运算符的使用是众所周知的且无可争议。 与普遍的看法相反，情况并非如此。

source: Because the compiler will not cast "past" <code>bool</code>, explicit conversion operators now remove the need for the <a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">Safe Bool idiom</a>. For example, smart pointers before C++11 used the Safe Bool idiom to prevent conversions to integral types. In C++11, the smart pointers use an explicit operator instead because the compiler is not allowed to implicitly convert to an integral type after it explicitly converted a type to bool.
es: Debido a que el compilador no lanzar&aacute; <code>bool</code> "pasado", los operadores de conversi&oacute;n expl&iacute;citos ahora eliminan la necesidad del <a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">lenguaje Safe Bool</a> . Por ejemplo, los punteros inteligentes anteriores a C ++ 11 utilizaron el idioma Safe Bool para evitar conversiones a tipos integrales. En C ++ 11, los punteros inteligentes utilizan un operador expl&iacute;cito porque el compilador no puede convertir impl&iacute;citamente a un tipo integral despu&eacute;s de convertir expl&iacute;citamente un tipo a bool.
ja: コンパイラーは「過去の」 <code>bool</code> をキャストしないため、明示的な変換演算子により<a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">Safe Boolイディオム</a>が不要になりました。 たとえば、C ++ 11より前のスマートポインタでは、Safe Boolイディオムを使用して、整数型への変換を防止していました。 C ++ 11では、コンパイラが明示的に型をブールに変換した後、コンパイラが暗黙的に整数型に変換することができないため、スマートポインターは明示的な演算子を使用します。
ko: 컴파일러는 "과거" <code>bool</code> 을 캐스팅하지 않기 때문에 이제 명시 적 변환 연산자는 <a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">Safe Bool 관용구</a> 가 필요하지 않습니다. 예를 들어 C ++ 11 이전의 스마트 포인터는 Safe Bool 관용구를 사용하여 정수 유형으로 변환하지 못했습니다. C ++ 11에서 스마트 포인터는 대신 명시 적 연산자를 사용합니다. 컴파일러가 명시 적으로 형식을 bool로 변환 한 후 컴파일러가 암시 적으로 정수 형식으로 변환 할 수 없기 때문입니다.
ru: Поскольку компилятор не будет приводить &laquo;прошлые&raquo; <code>bool</code> , операторы явного преобразования теперь устраняют необходимость в <a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">идиоме Safe Bool</a> . Например, умные указатели до C ++ 11 использовали идиому Safe Bool для предотвращения преобразований в целочисленные типы. В C ++ 11 интеллектуальные указатели вместо этого используют явный оператор, потому что компилятору не разрешается неявно преобразовывать в целочисленный тип после того, как он явно преобразовал тип в bool.
zh_cn: 因为编译器不会 <code>bool</code> 转换过去，所以显式转换运算符现在无需使用<a href="http://en.wikibooks.org/wiki/More_C%2B%2B_Idioms/Safe_bool">Safe Bool习惯用法</a> 。 例如，C ++ 11之前的智能指针使用Safe Bool习惯用法来防止转换为整数类型。 在C ++ 11中，智能指针使用显式运算符代替，因为在将类型显式转换为bool之后，不允许编译器隐式转换为整数。

source: Beginners easily get this wrong and even experienced C++ programmers are sometimes surprised because the compiler picks an overload they didn&rsquo;t suspect. These problems can be mitigated by explicit conversion operators.
es: Los principiantes se equivocan f&aacute;cilmente e incluso los programadores experimentados de C ++ a veces se sorprenden porque el compilador elige una sobrecarga que no sospechaban. Estos problemas pueden ser mitigados por operadores de conversi&oacute;n expl&iacute;citos.
ja: 初心者はこれを簡単に間違えやすく、経験の浅いC ++プログラマーでも、コンパイラーが疑わなかったオーバーロードを選択するので驚かされることがあります。 これらの問題は、明示的な変換演算子によって軽減できます。
ko: 초보자도 쉽게이 문제를 경험할 수 있으며 심지어 숙련 된 C ++ 프로그래머도 컴파일러가 의심하지 않는 과부하를 선택하기 때문에 놀라게됩니다. 이러한 문제는 명시 적 변환 연산자로 완화 할 수 있습니다.
ru: Начинающие легко ошибаются, и даже опытные программисты на C ++ иногда удивляются, потому что компилятор выбирает перегрузку, которую они не подозревали. Эти проблемы могут быть смягчены явными операторами преобразования.
zh_cn: 初学者容易犯错，甚至经验丰富的C ++程序员有时也会感到惊讶，因为编译器会选择他们不怀疑的重载。 这些问题可以通过显式转换运算符缓解。

source: Binary arithmetic operators
es: Operadores de aritmética binaria
ja: 二項演算子
ko: 이진 산술 연산자
ru: двоичные арифметические операторы
zh_cn: 二进制算术运算符

source: Bitshift Operators (used for Stream I/O)
es: Operadores de cambio de bits (usado para Stream IO)
ja: ビットシフト演算子 (ストリーム IO に使用)
ko: 비트 시프트 연산자 (스트림 I / O에 사용)
ru: Операторы битсдвига (используются для входа в поток ввода-вывода)
zh_cn: 位移操作器(用于流 IO

source: C++ allows new and delete operators to take additional arguments.
es: C++permite que los operadores nuevos y los borradores tomen argumentos adicionales.
ja: C++では、新規演算子および削除演算子で追加の引数を取ることができます。
ko: C ++를 사용하면 new 및 delete 연산자가 추가 인수를 취할 수 있습니다.
ru: C++позволяет операторам new и delete принимать дополнительные аргументы.
zh_cn: C++允许新操作符和删除操作符采取额外的参数。

source: C++ allows you to tune both of these operations: memory management and the construction/destruction of the object at the allocated memory. The latter is done by writing constructors and destructors for a class. Fine-tuning memory management is done by writing your own <code>operator new</code> and <code>operator delete</code>.
es: C ++ le permite ajustar ambas operaciones: administraci&oacute;n de memoria y construcci&oacute;n / destrucci&oacute;n del objeto en la memoria asignada. Esto &uacute;ltimo se hace escribiendo constructores y destructores para una clase. El ajuste fino de la gesti&oacute;n de memoria se realiza escribiendo su propio <code>operator new</code> y el <code>operator delete</code> .
ja: C ++では、メモリ管理と割り当てられたメモリでのオブジェクトの構築/破棄の両方の操作を調整できます。 後者は、クラスのコンストラクタとデストラクタを記述することによって行われます。 メモリー管理の微調整は、独自の <code>operator new</code> および <code>operator delete</code> 作成することによって行われます。
ko: C ++를 사용하면 메모리 관리 및 할당 된 메모리에서 객체의 구성 / 파괴와 같은 두 가지 작업을 모두 조정할 수 있습니다. 후자는 클래스의 생성자와 소멸자를 작성하여 수행됩니다. 미세 조정 메모리 관리는 사용자 고유의 <code>operator new</code> 및 <code>operator delete</code> 를 작성하여 수행됩니다.
ru: C ++ позволяет настраивать обе эти операции: управление памятью и построение / уничтожение объекта в выделенной памяти. Последнее делается путем написания конструкторов и деструкторов для класса. Точная настройка управления памятью выполняется путем написания <code>operator new</code> <code>operator delete</code> .
zh_cn: C ++允许您调整以下两个操作：内存管理和分配的内存中对象的构造/销毁。 后者是通过为类编写构造函数和析构函数来完成的。 通过编写自己的 <code>operator new</code> 和 <code>operator delete</code> 可以对内存管理进行微调。

source: C++ poses no limitations on the semantics of overloaded operators. Your compiler will happily accept code that implements the binary <code>+</code> operator to subtract from its right operand. However, the users of such an operator would never suspect the expression <code>a + b</code> to subtract <code>a</code> from <code>b</code>. Of course, this supposes that the semantics of the operator in the application domain is undisputed.
es: C ++ no plantea limitaciones en la sem&aacute;ntica de los operadores sobrecargados. Su compilador aceptar&aacute; felizmente el c&oacute;digo que implementa el operador binario <code>+</code> para restar de su operando correcto. Sin embargo, los usuarios de dicho operador nunca sospechar&iacute;an que la expresi&oacute;n <code>a + b</code> reste <code>a</code> de <code>b</code> . Por supuesto, esto supone que la sem&aacute;ntica del operador en el dominio de la aplicaci&oacute;n es indiscutible.
ja: C ++では、オーバーロードされた演算子のセマンティクスに制限はありません。 コンパイラーは、バイナリー演算子 <code>+</code> を実装して正しいオペランドから減算するコードを喜んで受け入れます。 ただし、このような演算子のユーザーは、式 <code>a + b</code> からaを減算 <code>a</code> ことを疑うことはありません。 もちろん、これは、アプリケーション・ドメイン内のオペレーターのセマンティクスが議論の余地がないことを前提としています。
ko: C ++는 오버로드 된 연산자의 의미에 제한이 없습니다. 컴파일러는 바이너리 <code>+</code> 연산자를 구현하여 올바른 피연산자를 빼는 코드를 기꺼이 받아들입니다. 그러나 이러한 연산자를 사용하는 사용자는 <code>a + b</code> 식을 의심하여 a 를 b 에서 빼지 않습니다. 물론 이것은 응용 프로그램 도메인에서 연산자의 의미론이 논란의 여지가 없다고 가정합니다.
ru: C ++ не накладывает ограничений на семантику перегруженных операторов. Ваш компилятор с радостью примет код, который реализует двоичный оператор <code>+</code> , чтобы вычесть его из своего правого операнда. Однако пользователи такого оператора никогда не будут подозревать, что выражение <code>a + b</code> вычитает <code>a</code> из <code>b</code> . Конечно, это предполагает, что семантика оператора в области приложения неоспорима.
zh_cn: C ++对重载运算符的语义没有任何限制。 您的编译器将很乐意接受实现二进制 <code>+</code> 运算符的代码，以从其右操作数中减去。 但是，这种运算符的用户永远不会怀疑表达式 <code>a + b</code> 从 <code>b</code> 中减去a 。 当然，这假定在应用程序域中运算符的语义是无可争议的。

source: Class-specific new and delete
es: Específico de la clase nuevo y eliminar
ja: クラス固有の新規作成と削除
ko: 클래스 별 신규 및 삭제
ru: Новое и удалить по конкретному классу
zh_cn: 特定类别的新增和删除

source: Common operators to overload
es: Los operadores comunes para sobrecargar
ja: オーバーロードする一般的な演算子
ko: 과부하를 일으키는 일반적인 연산자
ru: Общие операторы для перегрузки
zh_cn: 常见的运算器过载

source: Comparison operators
es: Operadores de comparación
ja: 比較演算子
ko: 비교 연산자
ru: Операторы сравнения
zh_cn: 比较操作者
