Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: arithmetic operators: <code>+</code><code>-</code><code>*</code><code>/</code><code>%</code> and <code>+=</code><code>-=</code><code>*=</code><code>/=</code><code>%=</code> (all binary infix); <code>+</code><code>-</code> (unary prefix); <code>++</code><code>--</code> (unary prefix and postfix)
es: operadores aritm&eacute;ticos: <code>+</code> <code>-</code> <code>*</code> <code>/</code> <code>%</code> y <code>+=</code> <code>-=</code> <code>*=</code> <code>/=</code> <code>%=</code> (todos los infijos binarios); <code>+</code> <code>-</code> (prefijo unario); <code>++</code> <code>--</code> (prefijo unario y postfix)
ja: 算術演算子： <code>+</code> <code>-</code> <code>*</code> <code>/</code> <code>%</code> および <code>+=</code> <code>-=</code> <code>*=</code> <code>/=</code> <code>%=</code> （すべて2進インフィクス）; <code>+</code> <code>-</code> （単項接頭辞）; <code>++</code> <code>--</code> （単項接頭辞と後置）
ko: 산술 연산자 : <code>+</code> <code>-</code> <code>*</code> <code>/</code> <code>%</code> 및 <code>+=</code> <code>-=</code> <code>*=</code> <code>/=</code> <code>%=</code> (모든 이진 접두사); <code>+</code> <code>-</code> (단일 접두사); <code>++</code> <code>--</code> (단일 접두사 및 접미사)
ru: арифметические операторы: <code>+</code> <code>-</code> <code>*</code> <code>/</code> <code>%</code> и <code>+=</code> <code>-=</code> <code>*=</code> <code>/=</code> <code>%=</code> (все двоичные инфиксы); <code>+</code> <code>-</code> (одинарный префикс); <code>++</code> <code>--</code> (унарный префикс и постфикс)
zh_cn: 算术运算符： <code>+</code> <code>-</code> <code>*</code> <code>/</code> <code>%</code> 和 <code>+=</code> <code>-=</code> <code>*=</code> <code>/=</code> <code>%=</code> （所有二进制中缀）； <code>+</code> <code>-</code> （一元前缀）； <code>++</code> <code>--</code> （一元前缀和后缀）

source: bit manipulation: <code>&amp;</code><code>|</code><code>^</code><code>&lt;&lt;</code><code>&gt;&gt;</code> and <code>&amp;=</code><code>|=</code><code>^=</code><code>&lt;&lt;=</code><code>&gt;&gt;=</code> (all binary infix); <code>~</code> (unary prefix)
es: manipulaci&oacute;n de bits: <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> y <code>&amp;=</code> <code>|=</code> <code>^=</code> <code>&lt;&lt;=</code> <code>&gt;&gt;=</code> (todo infijo binario); <code>~</code> (prefijo unario)
ja: ビット操作： <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> および <code>&amp;=</code> <code>|=</code> <code>^=</code> <code>&lt;&lt;=</code> <code>&gt;&gt;=</code> （すべてのバイナリのインフィックス）; <code>~</code> （単項接頭辞）
ko: 비트 조작 : <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> 및 <code>&amp;=</code> <code>|=</code> <code>^=</code> <code>&lt;&lt;=</code> <code>&gt;&gt;=</code> (모든 이진 접두사); <code>~</code> (단일 접두사)
ru: битовые манипуляции: <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> и <code>&amp;=</code> <code>|=</code> <code>^=</code> <code>&lt;&lt;=</code> <code>&gt;&gt;=</code> (все двоичные инфиксы); <code>~</code> (одинарный префикс)
zh_cn: 位操作： <code>&amp;</code> <code>|</code> <code>^</code> <code>&lt;&lt;</code> <code>&gt;&gt;</code> 和 <code>&amp;=</code> <code>|=</code> <code>^=</code> <code>&lt;&lt;=</code> <code>&gt;&gt;=</code> （所有二进制中缀）； <code>~</code> （一元前缀）

source: boolean algebra: <code>==</code><code>!=</code><code>&lt;</code><code>&gt;</code><code>&lt;=</code><code>&gt;=</code><code>||</code><code>&amp;&amp;</code> (all binary infix); <code>!</code> (unary prefix)
es: &aacute;lgebra booleana: <code>==</code> <code>!=</code> <code>&lt;</code> <code>&gt;</code> <code>&lt;=</code> &gt; <code>&gt;=</code> <code>||</code> <code>&amp;&amp;</code> (todo infijo binario); <code>!</code> (prefijo unario)
ja: ブール代数： <code>==</code> <code>!=</code> <code>&lt;</code> <code>&gt;</code> &lt;=&gt; <code>&gt;=</code> <code>||</code> <code>&amp;&amp;</code> （すべてバイナリのインフィックス）; <code>!</code> （単項接頭辞）
ko: 부울 대수 : <code>==</code> <code>!=</code> <code>&lt;</code> <code>&gt;</code> <code>||</code> <code>&gt;=</code> || <code>&amp;&amp;</code> (모든 이진 접두사); <code>!</code> (단항 접두사)
ru: булева алгебра: <code>==</code> <code>!=</code> <code>&lt;</code> <code>&gt;</code> <code>&lt;=</code> &gt; <code>&gt;=</code> <code>||</code> <code>&amp;&amp;</code> (весь двоичный инфикс); <code>!</code> (одинарный префикс)
zh_cn: 布尔代数： <code>==</code> <code>!=</code> <code>&lt;</code> <code>&gt;</code> <code>||</code> <code>&gt;=</code> || <code>&amp;&amp;</code> （所有二进制中缀）； <code>!</code> （一元前缀）

source: implicit conversion operators
es: operadores de conversión implícitos
ja: 暗黙変換演算子
ko: 암시 적 변환 연산자
ru: операторы неявной конверсии
zh_cn: 隐含转换运算符

source: memory management: <code>new</code><code>new[]</code><code>delete</code><code>delete[]</code>
es: gesti&oacute;n de memoria: <code>new</code> <code>new[]</code> <code>delete</code> <code>delete[]</code>
ja: メモリ管理： <code>new</code> <code>new[]</code> <code>delete</code> <code>delete[]</code>
ko: 메모리 관리 : <code>new</code> <code>new[]</code> <code>delete</code> <code>delete[]</code>
ru: управление памятью: <code>new</code> <code>new[]</code> <code>delete</code> <code>delete[]</code>
zh_cn: 内存管理： <code>new</code> <code>new[]</code> <code>delete</code> <code>delete[]</code>

source: miscellany: <code>=</code><code>[]</code><code>-&gt;</code><code>-&gt;*</code><code>,</code> (all binary infix); <code>*</code><code>&amp;</code> (all unary prefix) <code>()</code> (function call, n-ary infix)
es: miscel&aacute;nea: <code>=</code> <code>[]</code> <code>-&gt;</code> <code>-&gt;*</code> <code>,</code> (todos los infijos binarios); <code>*</code> <code>&amp;</code> (todos los prefijos unarios) <code>()</code> (llamada a funci&oacute;n, infijo n-ario)
ja: その他： <code>=</code> <code>[]</code> <code>-&gt;</code> <code>-&gt;*</code> <code>,</code> （すべてバイナリのインフィックス）; <code>*</code> <code>&amp;</code> （すべて単項接頭辞） <code>()</code> （関数呼び出し、n項接頭辞）
ko: miscellany : <code>=</code> <code>[]</code> <code>-&gt;</code> <code>-&gt;*</code> <code>,</code> (모든 이진 접두사); <code>*</code> <code>&amp;</code> (모든 단항 접두사) <code>()</code> (함수 호출, n- 항 접두사)
ru: разное: <code>=</code> <code>[]</code> <code>-&gt;</code> <code>-&gt;*</code> <code>,</code> (все двоичные инфиксы); <code>*</code> <code>&amp;</code> (все унарные префиксы) <code>()</code> (вызов функции, n-арный инфикс)
zh_cn: 其他： <code>=</code> <code>[]</code> <code>-&gt;</code> <code>-&gt;*</code> <code>,</code> （所有二进制中缀）; <code>*</code> <code>&amp;</code> （所有一元前缀） <code>()</code> （函数调用，n元中缀）

source: which is very intuitive.
es: que es muy intuitivo.
ja: というのは、非常に直感的です。
ko: 매우 직관적입니다.
ru: что очень интуитивно понятно.
zh_cn: 这是很直观的。

source: which is very non-intuitive.
es: lo cual es muy poco intuitivo.
ja: これは非常に直感的ではありません。
ko: 매우 직관적이지 않습니다.
ru: что очень неинтуитивно.
zh_cn: 这是很不直观的。
