Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (However, <em>if</em> you make an exception, do not forget the issue of <code>const</code>-ness for the operand that, for member functions, becomes the implicit <code>this</code> argument. If the operator as a non-member function would take its left-most argument as a <code>const</code> reference, the same operator as a member function needs to have a <code>const</code> at the end to make <code>*this</code> a <code>const</code> reference.)
es: (Sin embargo, <em>si</em> hace una excepci&oacute;n, no olvide el problema de <code>const</code> -ness para el operando que, para las funciones miembro, se convierte en impl&iacute;cito <code>this</code> argumento. Si el operador como una funci&oacute;n no miembro tomar&iacute;a su argumento m&aacute;s a la izquierda como una referencia <code>const</code> ante , el mismo operador que una funci&oacute;n miembro necesita tener una <code>const</code> ante al final para que <code>*this</code> una referencia <code>const</code> ante ).
ja: （ただし、例外を作成する<em>場合</em> 、メンバー関数の場合、暗黙の <code>this</code> 引数になるオペランドの <code>const</code> -nessの問題を忘れないでください。非メンバー関数としての演算子が左端の引数を <code>const</code> 参照。メンバー関数と同じ演算子は、 <code>*this</code> を <code>const</code> 参照にするために、末尾に <code>const</code> が必要です。）
ko: (그러나 예외를 만드는 <em>경우</em> 멤버 함수의 경우 피연산자에 대한 <code>const</code> -ness 문제를 잊지 마십시오. <code>this</code> 함수는 암시 적 으로이 인수가됩니다. 비 멤버 함수로서의 연산자는 가장 왼쪽 인수를 <code>const</code> 참조, 멤버 함수와 동일한 연산자에는 <code>*this</code> 를 <code>const</code> 참조로 만들려면 끝에 <code>const</code> 가 있어야합니다.)
ru: (Однако, <em>если</em> вы сделаете исключение, не забудьте проблему константности для операнда, который для функций-членов становится неявным аргументом <code>this</code> . Если оператор в качестве функции, не являющейся членом, будет принимать свой самый левый аргумент как <code>const</code> ссылка, тот же оператор, что и у функции-члена, должен иметь <code>const</code> в конце, чтобы сделать <code>*this</code> <code>const</code> ссылку.)
zh_cn: （但是， <em>如果</em>您例外，请不要忘记操作数的 <code>const</code> -ness问题，对于成员函数，该操作数将成 <code>this</code> 参数的隐式参数。如果运算符作为非成员函数，则将其最左端的参数用作 <code>const</code> 引用，与成员函数相同的运算符需要在末尾具有 <code>const</code> 才能使 <code>*this</code> 成为 <code>const</code> 引用。）

source: <code>operator+=</code> returns its result per reference, while <code>operator+</code> returns a copy of its result. Of course, returning a reference is usually more efficient than returning a copy, but in the case of <code>operator+</code>, there is no way around the copying. When you write <code>a + b</code>, you expect the result to be a new value, which is why <code>operator+</code> has to return a new value.<sup>3</sup> Also note that <code>operator+</code> takes its left operand <strong><em>by copy</em></strong> rather than by const reference. The reason for this is the same as the reason giving for <code>operator=</code> taking its argument per copy.
es: <code>operator+=</code> devuelve su resultado por referencia, mientras que <code>operator+</code> devuelve una copia de su resultado. Por supuesto, devolver una referencia suele ser m&aacute;s eficiente que devolver una copia, pero en el caso del <code>operator+</code> , no hay forma de evitar la copia. Cuando escribe <code>a + b</code> , espera que el resultado sea un nuevo valor, raz&oacute;n por la cual el <code>operator+</code> tiene que devolver un nuevo valor. <sup>3</sup> Tambi&eacute;n tenga en cuenta que el <code>operator+</code> toma su operando izquierdo <strong><em>por copia en</em></strong> lugar de por referencia constante. La raz&oacute;n de esto es la misma que la raz&oacute;n que da para <code>operator=</code> tomar su argumento por copia.
ja: <code>operator+=</code> は参照ごとに結果を返しますが、 <code>operator+</code> は結果のコピーを返します。 もちろん、参照を返すことは通常、コピーを返すよりも効率的ですが、 <code>operator+</code> の場合、コピーを回避する方法はありません。 <code>a + b</code> を記述する場合、結果は新しい値であることが期待されます。そのため、 <code>operator+</code> は新しい値を返す必要があります。 <sup>3</sup> <code>operator+</code> は左オペランドをconst参照ではなく<strong><em>コピー</em></strong>で取得<strong><em>する</em></strong>ことにも注意してください。 これの理由は、 <code>operator=</code> がコピーごとに引数をとる理由と同じです。
ko: <code>operator+=</code> 는 참조 당 결과를 반환하고 <code>operator+</code> 는 결과의 복사본을 반환합니다. 물론 참조를 반환하는 것이 일반적으로 복사본을 반환하는 것보다 더 효율적이지만 <code>operator+</code> 의 경우 복사 주위에 방법이 없습니다. <code>a + b</code> 를 쓰면 결과가 새로운 값이 될 것으로 예상되므로 <code>operator+</code> 는 새로운 값을 반환해야합니다. <sup>3</sup> <code>operator+</code> 는 const 참조가 아니라 <strong><em>복사로</em></strong> 왼쪽 피연산자 <strong><em>를</em></strong> 가져옵니다. 그 이유는 <code>operator=</code> 연산자 가 인수 당 인수를 취하는 이유와 같습니다.
ru: <code>operator+=</code> возвращает свой результат по ссылке, а <code>operator+</code> возвращает копию своего результата. Конечно, возврат ссылки обычно более эффективен, чем возврат копии, но в случае <code>operator+</code> нет способа обойти копирование. Когда вы пишете <code>a + b</code> , вы ожидаете, что результатом будет новое значение, поэтому <code>operator+</code> должен возвращать новое значение. <sup>3</sup> Также обратите внимание, что <code>operator+</code> берет свой левый операнд <strong><em>по копии,</em></strong> а не по константной ссылке. Причина этого та же, что и для <code>operator=</code> принимающего аргумент за копию.
zh_cn: <code>operator+=</code> 返回每个引用的结果，而 <code>operator+</code> 返回其结果的副本。 当然，返回引用通常比返回副本更有效，但是在 <code>operator+</code> 的情况下，无法解决复制问题。 当编写 <code>a + b</code> ，您期望结果是一个新值，这就是为什么 <code>operator+</code> 必须返回新值的原因。 <sup>3</sup>还请注意， <code>operator+</code> <strong><em>通过复制</em></strong>而不是通过const引用获取其左操作数。 其原因与给 <code>operator=</code> 每个副本取其参数的原因相同。

source: <em>Operators are related to each other</em> and to other operations. If your type supports <code>a + b</code>, users will expect to be able to call <code>a += b</code>, too. If it supports prefix increment <code>++a</code>, they will expect <code>a++</code> to work as well. If they can check whether <code>a &lt; b</code>, they will most certainly expect to also to be able to check whether <code>a &gt; b</code>. If they can copy-construct your type, they expect assignment to work as well.
es: <em>Los operadores est&aacute;n relacionados entre s&iacute;</em> y con otras operaciones. Si su tipo admite <code>a + b</code> , los usuarios tambi&eacute;n podr&aacute;n llamar <code>a += b</code> . Si admite el incremento de prefijo <code>++a</code> , esperar&aacute;n que <code>a++</code> funcione tambi&eacute;n. Si pueden verificar si <code>a &lt; b</code> , seguramente tambi&eacute;n esperar&aacute;n poder verificar si <code>a &gt; b</code> . Si pueden copiar y construir su tipo, esperan que la asignaci&oacute;n funcione tambi&eacute;n.
ja: <em>オペレーターは相互に関連し、他の操作に関連してい</em>ます。 タイプが <code>a + b</code> サポートしている場合、ユーザーは <code>a += b</code> も呼び出すことができると期待します。 プレフィックスインクリメント <code>++a</code> をサポートしている場合、彼らは <code>a++</code> も同様に機能することを期待します。 彼らが <code>a &lt; b</code> であるかどうかを確認できる場合、彼らは最も確実に <code>a &gt; b</code> かどうかも確認できると期待します。 彼らがあなたのタイプをコピー構築できるなら、彼らは割り当てが同様に機能することを期待しています。
ko: <em>운영자는 서로</em> 및 다른 작업과 <em>관련이</em> 있습니다. 유형이 <code>a + b</code> 지원 하는 경우 사용자는 <code>a += b</code> 도 호출 할 수있을 것으로 기대합니다. 접두사 증가 <code>++a</code> 를 지원하면 <code>a++</code> 도 작동 할 것으로 예상 합니다 . 그들이 <code>a &lt; b</code> 인지 여부를 확인할 수 있다면, <code>a &gt; b</code> 인지 여부도 확인할 수있을 것입니다. 그들이 당신의 유형을 복사 구성 할 수 있다면, 그들은 또한 과제가 잘 작동 할 것으로 기대합니다.
ru: <em>Операторы связаны друг с другом</em> и с другими операциями. Если ваш тип поддерживает <code>a + b</code> , пользователи ожидают, что смогут также вызвать <code>a += b</code> . Если он поддерживает префикс приращения <code>++a</code> , они ожидают, что <code>a++</code> будет работать. Если они смогут проверить, <code>a &lt; b</code> ли a &lt;b , они наверняка также ожидают, что они смогут проверить, <code>a &gt; b</code> ли a&gt; b . Если они могут копировать-конструировать ваш тип, они ожидают, что назначение также будет работать.
zh_cn: <em>运算符彼此相关，</em>并且与其他操作相关。 如果您的类型支持 <code>a + b</code> ，则用户也希望能够调用 <code>a += b</code> 。 如果它支持前缀增量 <code>++a</code> ，他们将期望 <code>a++</code> 能正常工作。 如果他们可以检查 <code>a &lt; b</code> ，那么他们当然也希望能够检查 <code>a &gt; b</code> 。 如果他们可以复制构造您的类型，则希望分配也能正常工作。

source: <strong><em>Always provide all out of a set of related operations.</em></strong>
es: <strong><em>Proporcione siempre todo de un conjunto de operaciones relacionadas.</em></strong>
ja: <strong><em>関連する一連の操作のすべてを常に提供します。</em></strong>
ko: <strong><em>항상 관련 작업 세트를 모두 제공하십시오.</em></strong>
ru: <strong><em>Всегда предоставляйте все из набора связанных операций.</em></strong>
zh_cn: <strong><em>始终提供一组相关操作中的所有内容。</em></strong>

source: <strong><em>Always stick to the operator&rsquo;s well-known semantics.</em></strong>
es: <strong><em>Siempre respete la conocida sem&aacute;ntica del operador.</em></strong>
ja: <strong><em>常にオペレーターのよく知られたセマンティクスに固執してください。</em></strong>
ko: <strong><em>항상 운영자의 잘 알려진 의미를 고수하십시오.</em></strong>
ru: <strong><em>Всегда придерживайтесь известной семантики оператора.</em></strong>
zh_cn: <strong><em>始终遵守操作员的众所周知的语义。</em></strong>

source: <strong><em>Whenever the meaning of an operator is not obviously clear and undisputed, it should not be overloaded.</em></strong><em>Instead, provide a function with a well-chosen name.</em>
es: <strong><em>Siempre que el significado de un operador no sea obviamente claro e indiscutible, no debe sobrecargarse.</em></strong> <em>En su lugar, proporcione una funci&oacute;n con un nombre bien elegido.</em>
ja: <strong><em>演算子の意味が明らかに明確で議論の余地がない場合は常に、オーバーロードしないでください。</em></strong> <em>代わりに、適切に選択された名前の関数を提供してください。</em>
ko: <strong><em>운영자의 의미가 명백하고 명확하지 않을 때마다 과부하되지 않아야합니다.</em></strong> <em>대신, 잘 선택된 이름의 함수를 제공하십시오.</em>
ru: <strong><em>Всякий раз, когда значение оператора не является явно ясным и бесспорным, его не следует перегружать.</em></strong> <em>Вместо этого предоставьте функцию с правильно выбранным именем.</em>
zh_cn: <strong><em>只要运算符的含义不明显且无可争辩，就不应重载。</em></strong> <em>而是为函数提供一个精心选择的名称。</em>

source: <sub> <em>(Note: This is meant to be an entry to <a href="https://stackoverflow.com/questions/tagged/c++-faq">Stack Overflow's C++ FAQ</a>. If you want to critique the idea of providing an FAQ in this form, then <a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">the posting on meta that started all this</a> would be the place to do that. Answers to that question are monitored in the <a href="http://chat.stackoverflow.com/rooms/10/c-lounge">C++ chatroom</a>, where the FAQ idea started out in the first place, so your answer is very likely to get read by those who came up with the idea.)</em> </sub>
es: <sub><em>(Nota: Esto est&aacute; destinado a ser una entrada a <a href="https://stackoverflow.com/questions/tagged/c++-faq">las preguntas frecuentes de C ++ de Stack Overflow</a> . Si desea criticar la idea de proporcionar una pregunta frecuente en este formulario, entonces <a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">la publicaci&oacute;n en meta que comenz&oacute; todo esto</a> ser&iacute;a el lugar para hacerlo. Respuestas a esa pregunta se monitorea en la <a href="http://chat.stackoverflow.com/rooms/10/c-lounge">sala de chat de C ++</a> , donde la idea de preguntas frecuentes comenz&oacute; en primer lugar, por lo que es muy probable que su respuesta sea le&iacute;da por aquellos a quienes se les ocurri&oacute; la idea).</em></sub>
ja: <sub><em>（注：これは、 <a href="https://stackoverflow.com/questions/tagged/c++-faq">Stack OverflowのC ++ FAQ</a>へのエントリになることを意図しています。このフォームでFAQを提供するという考えを批評したい場合は、これ<a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">をすべて開始したメタへの投稿</a>がそのための場所になります。回答その質問は<a href="http://chat.stackoverflow.com/rooms/10/c-lounge">C ++チャットルーム</a>で監視され、FAQのアイデアはそもそも始まったので、アイデアを思いついた人があなたの答えを読む可能性が非常に高くなります。</em></sub>
ko: <sub><em>(참고 : 이것은 <a href="https://stackoverflow.com/questions/tagged/c++-faq">Stack Overflow의 C ++ FAQ에</a> 대한 항목입니다.이 양식으로 FAQ를 제공한다는 아이디어를 비판하려면이 <a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">모든 것을 시작한 메타에 게시</a> 하면됩니다. 이 질문은 <a href="http://chat.stackoverflow.com/rooms/10/c-lounge">C ++ 대화방</a> 에서 모니터링되며 여기서 FAQ 아이디어는 처음부터 시작되었으므로 아이디어를 얻은 사람들이 귀하의 답변을 읽을 가능성이 큽니다.)</em></sub>
ru: <sub><em>(Примечание. Предполагается, что это будет вход в <a href="https://stackoverflow.com/questions/tagged/c++-faq">FAQ по C ++</a> в Stack Overflow . Если вы хотите критиковать идею предоставления FAQ в этой форме, то <a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">публикация в meta, с которой все это началось,</a> будет местом, где это можно сделать. Ответы на Этот вопрос отслеживается в <a href="http://chat.stackoverflow.com/rooms/10/c-lounge">чате C ++</a> , где идея FAQ возникла в первую очередь, поэтому ваш ответ, скорее всего, будет прочитан теми, кто придумал эту идею.)</em></sub>
zh_cn: <sub><em>（注意：这本来是<a href="https://stackoverflow.com/questions/tagged/c++-faq">Stack Overflow的C ++ FAQ</a>的条目。如果您想批评以这种形式提供FAQ的想法，那么<a href="https://meta.stackexchange.com/questions/68647/setting-up-a-faq-for-the-c-tag">在所有这些</a>都开始的meta上的张贴将是这样做的地方。该问题在<a href="http://chat.stackoverflow.com/rooms/10/c-lounge">C ++聊天室</a>中进行监控，该问题最初是从FAQ想法开始的，所以提出这个想法的人很可能会读懂您的答案。）</em></sub>

source: <sub>(Note the <code>const</code> at the end.)</sub>
es: <sub>(Tenga en cuenta la <code>const</code> ante al final.)</sub>
ja: <sub>（最後の <code>const</code> に注意してください。）</sub>
ko: <sub>(끝의 <code>const</code> 에 유의하십시오.)</sub>
ru: <sub>(Обратите внимание на <code>const</code> в конце.)</sub>
zh_cn: <sub>（请注意最后的 <code>const</code> 。）</sub>

source: <sup>1</sup><sub>As with all rules of thumb, sometimes there might be reasons to break this one, too. If so, do not forget that the left-hand operand of the binary comparison operators, which for member functions will be <code>*this</code>, needs to be <code>const</code>, too. So a comparison operator implemented as a member function would have to have this signature:</sub>
es: <sup>1</sup> <sub>Como con todas las reglas generales, a veces puede haber razones para romper esta tambi&eacute;n.</sub> <sub>Si es as&iacute;, no olvide que el operando de la izquierda de los operadores de comparaci&oacute;n binarios, que para funciones miembro ser&aacute; <code>*this</code> , tambi&eacute;n debe ser <code>const</code> ante .</sub> <sub>Por lo tanto, un operador de comparaci&oacute;n implementado como una funci&oacute;n miembro deber&iacute;a tener esta firma:</sub>
ja: <sup>1</sup> <sub>すべての経験則と同様に、これを破る理由もある場合があります。</sub> <sub>その場合、メンバー関数では <code>*this</code> となる2項比較演算子の左側のオペランドも <code>const</code> である必要があることを忘れないでください。</sub> <sub>したがって、メンバー関数として実装された比較演算子には、次のシグネチャが必要です。</sub>
ko: <sup>1</sup> <sub>모든 경험 법칙과 마찬가지로 때때로이 규칙을 어기는 이유가있을 수 있습니다.</sub> <sub>그렇다면 멤버 함수의 <code>*this</code> 인 이진 비교 연산자의 왼쪽 피연산자도 <code>const</code> 이어야한다는 것을 잊지 마십시오.</sub> <sub>따라서 멤버 함수로 구현 된 비교 연산자에는 다음과 같은 서명이 있어야합니다.</sub>
ru: <sup>1</sup> <sub>Как и все эмпирические правила, иногда могут быть и причины нарушать это правило.</sub> <sub>Если это так, не забывайте, что левый операнд бинарных операторов сравнения, который для функций-членов будет <code>*this</code> , также должен быть <code>const</code> .</sub> <sub>Таким образом, оператор сравнения, реализованный как функция-член, должен иметь эту сигнатуру:</sub>
zh_cn: <sup>1</sup> <sub>与所有经验法则一样，有时也可能有理由打破这一原则。</sub> <sub>如果是这样，请不要忘记二进制比较运算符的左操作数（对于成员函数而言，它是 <code>*this</code> ）也必须是 <code>const</code> 。</sub> <sub>因此，实现为成员函数的比较运算符必须具有以下签名：</sub>

source: <sup>1</sup><sub>The term &ldquo;user-defined&rdquo; might be slightly misleading. C++ makes the distinction between built-in types and user-defined types. To the former belong for example int, char, and double; to the latter belong all struct, class, union, and enum types, including those from the standard library, even though they are not, as such, defined by users.</sub>
es: <sup>1</sup> <sub>El t&eacute;rmino "definido por el usuario" puede ser ligeramente enga&ntilde;oso.</sub> <sub>C ++ hace la distinci&oacute;n entre los tipos integrados y los tipos definidos por el usuario.</sub> <sub>A los primeros pertenecen, por ejemplo, int, char y double;</sub> <sub>a este &uacute;ltimo pertenecen todos los tipos de estructura, clase, uni&oacute;n y enumeraci&oacute;n, incluidos los de la biblioteca est&aacute;ndar, aunque no est&eacute;n definidos como tales por los usuarios.</sub>
ja: <sup>1</sup> <sub>「ユーザー定義」という用語は、少し誤解を招く可能性があります。</sub> <sub>C ++は、組み込み型とユーザー定義型を区別します。</sub> <sub>前者には、たとえば、int、char、doubleが属します。</sub> <sub>後者には、標準ライブラリからのものを含め、すべての構造体、クラス、共用体、および列挙型が属します。これらは、ユーザーによって定義されていない場合でも同様です。</sub>
ko: <sup>1</sup> <sub>"사용자 정의"라는 용어는 약간 잘못 될 수 있습니다.</sub> <sub>C ++은 내장 타입과 사용자 정의 타입을 구별합니다.</sub> <sub>전자는 예를 들어 int, char 및 double에 속합니다.</sub> <sub>후자는 표준 라이브러리의 타입을 포함하여 모든 구조체, 클래스, 공용체 및 열거 형에 속하지만 사용자가 정의하지는 않습니다.</sub>
ru: <sup>1</sup> <sub>Термин &laquo;пользовательский&raquo; может вводить в заблуждение.</sub> <sub>C ++ делает различие между встроенными типами и пользовательскими типами.</sub> <sub>К первым относятся, например, int, char и double;</sub> <sub>к последним относятся все типы struct, class, union и enum, в том числе из стандартной библиотеки, даже если они не определены пользователями.</sub>
zh_cn: <sup>1</sup> <sub>&ldquo;用户定义&rdquo;一词可能会引起误解。</sub> <sub>C ++区分内置类型和用户定义类型。</sub> <sub>前者属于int，char和double；</sub> <sub>后者属于所有struct，class，union和enum类型，包括标准库中的类型，即使它们不是由用户定义的。</sub>

source: <sup>2</sup><sub>Also note that the postfix variant does more work and is therefore less efficient to use than the prefix variant. This is a good reason to generally prefer prefix increment over postfix increment. While compilers can usually optimize away the additional work of postfix increment for built-in types, they might not be able to do the same for user-defined types (which could be something as innocently looking as a list iterator). Once you got used to do <code>i++</code>, it becomes very hard to remember to do <code>++i</code> instead when <code>i</code> is not of a built-in type (plus you'd have to change code when changing a type), so it is better to make a habit of always using prefix increment, unless postfix is explicitly needed.</sub>
es: <sup>2</sup> <sub>Tambi&eacute;n tenga en cuenta que la variante de postfix hace m&aacute;s trabajo y, por lo tanto, es menos eficiente de usar que la variante de prefijo.</sub> <sub>Esta es una buena raz&oacute;n para preferir generalmente el incremento de prefijo sobre el incremento de postfix.</sub> <sub>Si bien los compiladores generalmente pueden optimizar el trabajo adicional del incremento de postfix para los tipos incorporados, es posible que no puedan hacer lo mismo para los tipos definidos por el usuario (que podr&iacute;a ser algo tan inocentemente como un iterador de lista).</sub> <sub>Una vez que se haya acostumbrado a hacer <code>i++</code> , se hace muy dif&iacute;cil recordar hacer <code>++i</code> cuando no soy de tipo incorporado (adem&aacute;s, tendr&iacute;a que cambiar el c&oacute;digo al cambiar un tipo), por lo que es mejor Acost&uacute;mbrese a utilizar siempre el incremento de prefijo, a menos que se necesite expl&iacute;citamente postfix.</sub>
ja: <sup>2</sup> <sub>接尾辞バリアントは接頭辞バリアントよりも多くの作業を行うため、使用する効率が悪いことにも注意してください。</sub> <sub>これは、一般に接尾辞の増分よりも接頭辞の増分を優先する良い理由です。</sub> <sub>コンパイラーは通常、組み込み型のpostfixインクリメントの追加作業を最適化できますが、ユーザー定義型（リストイテレーターのように無邪気に見える可能性があるもの）に対しては同じことができない場合があります。</sub> <sub> <code>i++</code> と、組み込み型ではないときに <code>++i</code> を行うことを覚えるのが非常に難しくなります（さらに、型を変更するときにコードを変更する必要があります）。 postfixが明示的に必要でない限り、常に接頭辞インクリメントを使用する習慣をつけます。</sub>
ko: <sup>2</sup> <sub>접미사 변형이 더 많은 작업을 수행하므로 접두사 변형보다 사용 효율이 떨어집니다.</sub> <sub>이것이 일반적으로 접두사 증가보다 접두사 증가를 선호하는 좋은 이유입니다.</sub> <sub>컴파일러는 일반적으로 내장 유형에 대한 추가 접미사 증가 작업을 최적화 할 수 있지만 사용자 정의 유형 (목록 반복자처럼 순진하게 보일 수 있음)에 대해서도 동일한 작업을 수행하지 못할 수 있습니다.</sub> <sub> <code>i++</code> 사용하는 데 익숙해지면 내장 유형이 아닌 경우 ( <code>++i</code> 유형을 변경할 때 코드를 변경해야 함) 대신 ++ i 를 수행하는 것을 기억하기가 매우 어려워 지므로 더 좋습니다. postfix가 명시 적으로 필요하지 않으면 접두사 증가를 항상 사용하는 습관을들이십시오.</sub>
ru: <sup>2</sup> <sub>Также обратите внимание, что постфиксный вариант выполняет больше работы и поэтому менее эффективен в использовании, чем префиксный вариант.</sub> <sub>Это хорошая причина, как правило, предпочитать увеличение префикса над увеличением постфикса.</sub> <sub>Хотя компиляторы обычно могут оптимизировать дополнительную работу приращения постфикса для встроенных типов, они могут быть не в состоянии сделать то же самое для пользовательских типов (которые могут выглядеть невинно, как итератор списка).</sub> <sub>Как только вы привыкли делать <code>i++</code> , становится очень трудно запомнить <code>++i</code> вместо встроенного типа (плюс вам придется менять код при смене типа), поэтому лучше Возьмите за правило всегда использовать приращение префикса, если только постфикс не требуется явно.</sub>
zh_cn: <sup>2</sup> <sub>还请注意，postfix变体比前缀变体执行更多的工作，因此使用效率较低。</sub> <sub>这是一个很好的理由，通常优先选择前缀增量而不是后缀增量。</sub> <sub>尽管编译器通常可以优化内置类型的后缀增量的其他工作，但对于用户定义的类型，它们可能无法执行相同的工作（这可能像列表迭代器一样无辜）。</sub> <sub>一旦您习惯使用 <code>i++</code> ，当 <code>i</code> 不是内置类型（加上更改类型时必须更改代码）时，就很难记住要执行 <code>++i</code> 了。养成始终使用前缀增量的习惯，除非明确需要后缀。</sub>

source: <sup>2</sup><sub>It should be noted that the built-in version of <code>||</code> and <code>&amp;&amp;</code> use shortcut semantics. While the user defined ones (because they are syntactic sugar for method calls) do not use shortcut semantics. User will expect these operators to have shortcut semantics, and their code may depend on it, Therefore it is highly advised NEVER to define them.</sub>
es: <sup>2</sup> <sub>Cabe se&ntilde;alar que la versi&oacute;n incorporada de <code>||</code> </sub> <sub>y <code>&amp;&amp;</code> use la sem&aacute;ntica de atajos.</sub> <sub>Mientras que los definidos por el usuario (porque son az&uacute;car sint&aacute;ctica para las llamadas a m&eacute;todos) no use la sem&aacute;ntica de atajos.</sub> <sub>El usuario esperar&aacute; que estos operadores tengan sem&aacute;ntica de acceso directo, y su c&oacute;digo puede depender de ello, por lo tanto, se recomienda NUNCA definirlos.</sub>
ja: <sup>2</sup> <sub> <code>||</code> の組み込みバージョンは</sub> <sub> <code>&amp;&amp;</code> はショートカットセマンティクスを使用します。</sub> <sub>ユーザーが定義したもの（メソッド呼び出しのシンタックスシュガーであるため）は、ショートカットセマンティクスを使用しません。</sub> <sub>ユーザーはこれらの演算子にショートカットセマンティクスがあることを期待し、それらのコードはそれに依存する可能性があるため、絶対に定義しないことを強くお勧めします。</sub>
ko: <sup>2</sup> <sub>내장 버전의 <code>||</code> </sub> <sub> <code>&amp;&amp;</code> 단축키 사용을 사용합니다.</sub> <sub>사용자가 정의한 것 (메소드 호출의 구문 설탕이기 때문에)은 바로 가기 시맨틱을 사용하지 않습니다.</sub> <sub>사용자는 이러한 연산자에 바로 가기 의미가있을 것으로 예상되며 코드에 따라 달라질 수 있으므로 절대로 정의하지 않는 것이 좋습니다.</sub>
ru: <sup>2</sup> <sub>Следует отметить, что встроенная версия <code>||</code> </sub> <sub>и <code>&amp;&amp;</code> использовать семантику ярлыков.</sub> <sub>В то время как пользовательские (потому что они являются синтаксическим сахаром для вызовов методов), не используют сокращенную семантику.</sub> <sub>Пользователь будет ожидать, что эти операторы будут иметь семантику ярлыков, и их код может зависеть от этого, поэтому настоятельно рекомендуется НИКОГДА не определять их.</sub>
zh_cn: <sup>2</sup> <sub>应该注意的是 <code>||</code> 的内置版本</sub> <sub>和 <code>&amp;&amp;</code> 使用快捷方式语义。</sub> <sub>尽管用户定义的语法（因为它们是方法调用的语法糖），却不使用快捷方式语义。</sub> <sub>用户将期望这些运算符具有快捷方式语义，并且它们的代码可能依赖于此，因此，强烈建议不要定义它们。</sub>
