Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The stream operators, among the most commonly overloaded operators, are binary infix operators for which the syntax specifies no restriction on whether they should be members or non-members. Since they change their left argument (they alter the stream&rsquo;s state), they should, according to the rules of thumb, be implemented as members of their left operand&rsquo;s type. However, their left operands are streams from the standard library, and while most of the stream output and input operators defined by the standard library are indeed defined as members of the stream classes, when you implement output and input operations for your own types, you cannot change the standard library&rsquo;s stream types. That&rsquo;s why you need to implement these operators for your own types as non-member functions. The canonical forms of the two are these:
es: Los operadores de flujo, entre los operadores sobrecargados m&aacute;s com&uacute;nmente, son operadores infix binarios para los cuales la sintaxis no especifica ninguna restricci&oacute;n sobre si deben ser miembros o no miembros. Dado que cambian su argumento izquierdo (alteran el estado de la secuencia), deber&iacute;an, de acuerdo con las reglas generales, implementarse como miembros del tipo de operando izquierdo. Sin embargo, sus operandos izquierdos son flujos de la biblioteca est&aacute;ndar, y aunque la mayor&iacute;a de los operadores de salida y entrada de flujo definidos por la biblioteca est&aacute;ndar se definen como miembros de las clases de flujo, cuando implementa operaciones de salida y entrada para sus propios tipos, no puede cambiar los tipos de flujo de la biblioteca est&aacute;ndar. Es por eso que necesita implementar estos operadores para sus propios tipos como funciones que no son miembros. Las formas can&oacute;nicas de los dos son estas:
ja: ストリーム演算子は、最も一般的にオーバーロードされた演算子の1つであり、構文がメンバーまたは非メンバーであるかどうかの制限を指定しない2項中置演算子です。 それらは左引数を変更する（ストリームの状態を変更する）ため、経験則に従って、左オペランドの型のメンバーとして実装する必要があります。 ただし、それらの左側のオペランドは標準ライブラリからのストリームであり、標準ライブラリによって定義されたほとんどのストリーム出力および入力演算子は実際にストリームクラスのメンバーとして定義されていますが、独自のタイプの出力および入力操作を実装すると、標準ライブラリのストリームタイプを変更できません。 そのため、独自の型に対してこれらの演算子を非メンバー関数として実装する必要があります。 2つの正規形は次のとおりです。
ko: 가장 일반적으로 오버로드 된 연산자 중 스트림 연산자는 이진 삽입 연산자이며 구문은 멤버인지 멤버가 아닌지에 대한 제한을 지정하지 않습니다. 왼쪽 인수를 변경하기 때문에 (스트림의 상태를 변경 함) 경험 법칙에 따라 왼쪽 피연산자 유형의 멤버로 구현해야합니다. 그러나 왼쪽 피연산자는 표준 라이브러리의 스트림이며 표준 라이브러리에 의해 정의 된 대부분의 스트림 출력 및 입력 연산자는 실제로 자신의 유형에 대한 출력 및 입력 조작을 구현할 때 스트림 클래스의 멤버로 정의됩니다. 표준 라이브러리의 스트림 유형을 변경할 수 없습니다. 따라서 멤버가 아닌 함수로 자신의 유형에 대해 이러한 연산자를 구현해야합니다. 두 가지의 정식 형태는 다음과 같습니다.
ru: Операторы потока, среди наиболее часто перегруженных операторов, являются бинарными инфиксными операторами, для которых синтаксис не устанавливает никаких ограничений относительно того, должны ли они быть членами или не членами. Поскольку они изменяют свой левый аргумент (они изменяют состояние потока), они должны, согласно практическим правилам, быть реализованы как члены типа их левого операнда. Однако их левые операнды являются потоками из стандартной библиотеки, и хотя большинство операторов вывода и ввода потока, определенных стандартной библиотекой, действительно определены как члены классов потоков, при реализации операций вывода и ввода для ваших собственных типов вы не может изменить типы потоков стандартной библиотеки. Вот почему вам нужно реализовать эти операторы для ваших собственных типов как функции, не являющиеся членами. Канонические формы этих двух:
zh_cn: 在最常见的重载运算符中，流运算符是二进制中缀运算符，其语法对它们应为成员还是非成员不加限制。 由于它们更改了左参数（它们更改了流的状态），因此应根据经验法则将其实现为左操作数类型的成员。 但是，它们的左操作数是标准库中的流，尽管标准库定义的大多数流输出和输入运算符的确定义为流类的成员，但是当您为自己的类型实现输出和输入操作时，无法更改标准库的流类型。 这就是为什么您需要将自己的类型的这些运算符实现为非成员函数。 两者的规范形式如下：

source: The syntax for overloading the remaining binary boolean operators (<code>||</code>, <code>&amp;&amp;</code>) follows the rules of the comparison operators. However, it is <em>very</em> unlikely that you would find a reasonable use case for these<sup>2</sup>.
es: La sintaxis para sobrecargar los operadores booleanos binarios restantes ( <code>||</code> , <code>&amp;&amp;</code> ) sigue las reglas de los operadores de comparaci&oacute;n. Sin embargo, es <em>muy</em> poco probable que encuentre un caso de uso razonable para estos <sup>2</sup> .
ja: 残りの2項ブール演算子（ <code>||</code> 、 <code>&amp;&amp;</code> ）をオーバーロードするための構文は、比較演算子の規則に従います。 ただし、これらの<sup>2の</sup>合理的なユースケースを見つけることは<em>ほとんど</em>ありません。
ko: 나머지 이진 부울 연산자 ( <code>||</code> , <code>&amp;&amp;</code> )를 오버로드하는 구문은 비교 연산자의 규칙을 따릅니다. 그러나이 <sup>2에</sup> 대한 합리적인 사용 사례를 찾을 가능성은 <em>거의</em> 없습니다.
ru: Синтаксис для перегрузки оставшихся двоичных логических операторов ( <code>||</code> , <code>&amp;&amp;</code> ) соответствует правилам операторов сравнения. Тем не менее, <em>очень</em> маловероятно, что вы найдете разумный вариант использования этих <sup>2</sup> .
zh_cn: 重载其余二进制布尔运算符（ <code>||</code> ， <code>&amp;&amp;</code> ）的语法遵循比较运算符的规则。 但是，您不太可能为这些<sup>2</sup>找到合理的用例。

source: The unary address-of operator should never be overloaded.
es: La dirección unaria del operador nunca debe ser sobrecargada.
ja: 単項の address-of 演算子は決してオーバーロードしてはいけません。
ko: 단항 주소 연산자에 과부하가 걸리지 않아야합니다.
ru: Унарный адрес оператора никогда не должен быть перегружен.
zh_cn: 单一地址-of操作符绝对不应该过载。

source: The unary increment and decrement operators come in both prefix and postfix flavor. To tell one from the other, the postfix variants take an additional dummy int argument. If you overload increment or decrement, be sure to always implement both prefix and postfix versions. Here is the canonical implementation of increment, decrement follows the same rules:
es: Los operadores de incremento y decremento unario vienen en sabor de prefijo y postfijo.Para distinguir uno del otro,las variantes de postfix toman un argumento adicional de int ficticio.Si sobrecargas el incremento o el decremento,asegúrate de implementar siempre ambas versiones de prefijo y postfijo.Aquí está la implementación canónica de incrementos,decrementos sigue las mismas reglas:
ja: 単項演算子のインクリメントとデクリメントには、接頭辞と接尾辞があります。どちらか一方を見分けるために、postfix の場合はダミーの int 引数を追加しています。もし increment や decrement をオーバーロードする場合は、常に prefix と postfix の両方を実装するようにしてください。以下に increment と decrement の標準的な実装を示します。
ko: 단항 증가 및 감소 연산자는 접두사와 접미사 형식으로 제공됩니다. 다른 것을 구별하기 위해 접미사 변형은 추가 더미 int 인수를 사용합니다. 증분 또는 감소에 과부하가 걸리면 항상 접두사와 접미사 버전을 모두 구현해야합니다. 다음은 증가의 표준 구현입니다. 감소는 동일한 규칙을 따릅니다.
ru: Унарные операторы инкремента и декремента приходят как в префиксном,так и постфиксном вкусе.Чтобы отличить один от другого,постфиксные варианты принимают дополнительный фиктивный int аргумент.Если вы перегружаете инкремент или декремент,убедитесь,что всегда реализуете и префиксный,и постфиксный варианты.Вот каноническая реализация инкремента,декремент следует тем же правилам:
zh_cn: 单项增量和减量运算符有前缀和后缀两种类型。为了区分前缀和后缀操作符,后缀变体需要一个额外的虚值int参数。如果你超载了 increment 或 decrement,一定要确保同时实现前缀和后缀版本。下面是增量的常规实现,decrement遵循同样的规则。

source: There's a lot to be said about assignment. However, most of it has already been said in <a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">GMan's famous Copy-And-Swap FAQ</a>, so I'll skip most of it here, only listing the perfect assignment operator for reference:
es: Hay mucho que decir sobre la asignaci&oacute;n. Sin embargo, la mayor parte ya se ha dicho en <a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">las famosas preguntas frecuentes de Copiar e intercambiar de GMan, por lo que omitir&eacute; la</a> mayor parte aqu&iacute;, solo enumerando el operador de asignaci&oacute;n perfecto para referencia:
ja: 割り当てについては、多くのことを言う必要があります。 ただし、そのほとんどは<a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">GManの有名なコピーアンドスワップFAQ</a>ですでに述べられているので、ここではそのほとんどを省略し、参照用に完全な代入演算子のみをリストします。
ko: 과제에 대해 할 말이 많습니다. 그러나 대부분은 이미 <a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">GMan의 유명한 Copy-And-Swap FAQ</a> 에서 언급되었으므로 참조를 위해 완벽한 할당 연산자 만 나열하면 여기서 대부분 생략합니다.
ru: Многое можно сказать о назначении. Тем не менее, большинство из них уже было сказано в <a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">известном FAQ по копированию и замене GMan</a> , поэтому я пропущу большую часть здесь, перечисляя только идеальный оператор присваивания для справки:
zh_cn: 关于任务有很多要说的。 但是，大多数内容已经在<a href="https://stackoverflow.com/questions/3279543/what-is-the-copy-and-swap-idiom">GMan著名的复制和交换FAQ中进行了介绍</a> ，因此在此我将跳过大部分内容，仅列出完美的赋值运算符以供参考：

source: Throughout the C++ standard library, function objects are always copied. Your own function objects should therefore be cheap to copy. If a function object absolutely needs to use data which is expensive to copy, it is better to store that data elsewhere and have the function object refer to it.
es: En toda la biblioteca estándar de C++,los objetos de función siempre se copian.Por lo tanto,los objetos de función propios deberían ser baratos de copiar.Si un objeto de función necesita absolutamente utilizar datos que son caros de copiar,es mejor almacenar esos datos en otro lugar y hacer que el objeto de función se refiera a él.
ja: C++標準ライブラリ全体を通して、関数オブジェクトは常にコピーされています。したがって、独自の関数オブジェクトは、コピーするのにコストがかからないものでなければなりません。関数オブジェクトがどうしてもコピーするのに高価なデータを使用する必要がある場合は、そのデータを別の場所に保存して、関数オブジェクトがそれを参照するようにした方が良いでしょう。
ko: C ++ 표준 라이브러리 전체에서 함수 객체는 항상 복사됩니다. 따라서 자신의 함수 객체는 복사하기에 저렴해야합니다. 함수 객체가 복사하는 데 비용이 많이 드는 데이터를 절대적으로 사용해야하는 경우 해당 데이터를 다른 곳에 저장하고 함수 객체가 참조하는 것이 좋습니다.
ru: Во всей стандартной библиотеке C++объекты функций всегда копируются.Поэтому копирование собственных объектов функций должно быть дешевым.Если объекту функции абсолютно необходимо использовать данные,копирование которых стоит дорого,то лучше хранить эти данные в другом месте и иметь на них ссылку в объекте функции.
zh_cn: 在整个C++标准库中,函数对象总是被复制。因此,你自己的函数对象应该是廉价的复制对象。如果一个函数对象绝对需要使用数据,而这个数据的复制成本很高,那么最好把这个数据存储在其他地方,让函数对象引用它。

source: To invoke the explicit cast operator, you have to use <code>static_cast</code>, a C-style cast, or a constructor style cast ( i.e. <code>T(value)</code> ).
es: Para invocar el operador de <code>static_cast</code> expl&iacute;cito, debe usar static_cast , una conversi&oacute;n de estilo C o una conversi&oacute;n de estilo de constructor (es decir, <code>T(value)</code> ).
ja: 明示的なキャスト演算子を呼び出すには、 <code>static_cast</code> 、Cスタイルのキャスト、またはコンストラクタスタイルのキャスト（つまり <code>T(value)</code> ）を使用する必要があります。
ko: 명시 적 캐스트 연산자를 호출하려면 <code>static_cast</code> , C 스타일 캐스트 또는 생성자 스타일 캐스트 (예 : <code>T(value)</code> )를 사용해야합니다.
ru: Чтобы вызвать явный оператор приведения, вы должны использовать <code>static_cast</code> , приведение в стиле C или приведение в стиле конструктора (т. Е. <code>T(value)</code> ).
zh_cn: 要调用显式 <code>static_cast</code> 运算符，必​​须使用static_cast ，C样式强制转换或构造函数样式强制转换 （即 <code>T(value)</code> ）。

source: To overload the global new and delete, simply replace the pre-defined operators of the standard library with our own. However, this rarely ever needs to be done.
es: Para sobrecargar el nuevo global y eliminarlo,simplemente reemplace los operadores predefinidos de la biblioteca estándar por los nuestros.Sin embargo,esto raramente necesita hacerse.
ja: グローバルなnewとdeleteをオーバーロードするには、標準ライブラリのあらかじめ定義された演算子を独自のものに置き換えるだけです。しかし、これを行う必要はほとんどありません。
ko: 전역 새 항목을 오버로드하고 삭제하려면 표준 라이브러리의 사전 정의 된 연산자를 자체 연산자로 바꾸십시오. 그러나 이것은 거의 수행 할 필요가 없습니다.
ru: Чтобы перегрузить глобальную новинку и удалить,просто замените предопределенные операторы стандартной библиотеки на наши собственные.Однако это редко бывает необходимо сделать.
zh_cn: 要使全局的new和delete过载,只需将标准库中的预设操作符替换成我们自己的操作符即可。然而,很少有必要这样做。

source: Unary arithmetic operators
es: Operadores aritméticos unitarios
ja: 単項演算子
ko: 단항 산술 연산자
ru: Унарные арифметические операторы
zh_cn: 单元算术运算符

source: Unless you do not want users of your class to be able to change data elements returned by <code>operator[]</code> (in which case you can omit the non-const variant), you should always provide both variants of the operator.
es: A menos que no desee que los usuarios de su clase puedan cambiar los elementos de datos devueltos por el <code>operator[]</code> (en cuyo caso puede omitir la variante no constante), siempre debe proporcionar ambas variantes del operador.
ja: クラスのユーザーが <code>operator[]</code> によって返されるデータ要素を変更できないようにする場合を除き（非constバリアントを省略できる場合）、常に演算子の両方のバリアントを提供する必要があります。
ko: 클래스 사용자가 <code>operator[]</code> 의해 리턴 된 데이터 요소를 변경하지 못하게하려면 (이 경우 비 const 변형을 생략 할 수 있음) 항상 연산자의 두 변형을 모두 제공해야합니다.
ru: Если вы не хотите, чтобы пользователи вашего класса могли изменять элементы данных, возвращаемые <code>operator[]</code> (в этом случае вы можете опустить неконстантный вариант), вы всегда должны предоставлять оба варианта оператора.
zh_cn: 除非您不希望您的类的用户能够更改 <code>operator[]</code> 返回的数据元素（在这种情况下，您可以忽略non-const变体），否则应始终提供两种运算符变体。

source: Unlike implicit conversion operators, explicit conversion operators will never kick in when you don't expect them to. The following is a simple class with an explicit conversion operator:
es: A diferencia de los operadores de conversión implícitos,los operadores de conversión explícitos nunca se activarán cuando no se espera que lo hagan.La siguiente es una clase simple con un operador de conversión explícito:
ja: 暗黙の変換演算子とは異なり、明示的な変換演算子は、期待していないときには決してキックインしません。以下は,明示的な変換演算子を持つ単純なクラスです。
ko: 암시 적 변환 연산자와 달리 명시 적 변환 연산자는 사용자가 원하지 않을 때 시작되지 않습니다. 다음은 명시 적 변환 연산자가있는 간단한 클래스입니다.
ru: В отличие от операторов неявного преобразования,операторы явного преобразования никогда не будут запускаться,когда вы этого не ожидаете.Ниже приведен простой класс с оператором явного преобразования:
zh_cn: 与隐式转换操作符不同,显式转换操作符永远不会在你不期望它们出现的时候出现。下面是一个带有显式转换操作符的简单类。

source: What are the basic rules and idioms for operator overloading
es: ¿Cuáles son las reglas básicas y los modismos para la sobrecarga del operador
ja: オペレーターオーバーロードの基本的なルールと熟語とは?
ko: 운영자 과부하에 대한 기본 규칙 및 관용구는 무엇입니까
ru: Каковы основные правила и идиомы перегрузки оператора.
zh_cn: 操作员超载的基本规则和成语有哪些?

source: When implementing <code>operator&gt;&gt;</code>, manually setting the stream&rsquo;s state is only necessary when the reading itself succeeded, but the result is not what would be expected.
es: Al implementar el <code>operator&gt;&gt;</code> , establecer manualmente el estado de la secuencia solo es necesario cuando la lectura en s&iacute; misma tuvo &eacute;xito, pero el resultado no es lo que se esperar&iacute;a.
ja: <code>operator&gt;&gt;</code> 実装する場合、ストリーム自体の状態を手動で設定する必要があるのは、読み取り自体が成功した場合のみですが、期待どおりの結果は得られません。
ko: <code>operator&gt;&gt;</code> 구현할 때 스트림 상태를 수동으로 설정하는 것은 읽기 자체가 성공한 경우에만 필요하지만 결과는 예상과 다릅니다.
ru: При реализации <code>operator&gt;&gt;</code> ручная установка состояния потока необходима только тогда, когда само чтение завершилось успешно, но результат не соответствует ожидаемому.
zh_cn: 当实现 <code>operator&gt;&gt;</code> ，仅当读取本身成功时才需要手动设置流的状态，但是结果不是预期的。

source: When it comes to operator overloading in C++, there are <strong><em>three basic rules you should follow</em></strong>. As with all such rules, there are indeed exceptions. Sometimes people have deviated from them and the outcome was not bad code, but such positive deviations are few and far between. At the very least, 99 out of 100 such deviations I have seen were unjustified. However, it might just as well have been 999 out of 1000. So you&rsquo;d better stick to the following rules.
es: Cuando se trata de la sobrecarga del operador en C ++, hay <strong><em>tres reglas b&aacute;sicas que debe seguir</em></strong> . Al igual que con todas esas reglas, de hecho hay excepciones. A veces las personas se han desviado de ellos y el resultado no fue un mal c&oacute;digo, pero tales desviaciones positivas son pocas y distantes. Como m&iacute;nimo, 99 de cada 100 desviaciones que he visto no estaban justificadas. Sin embargo, bien podr&iacute;a haber sido 999 de 1000. Por lo tanto, es mejor que cumpla con las siguientes reglas.
ja: C ++での演算子のオーバーロードに関しては、 <strong><em>3つの基本的な規則に従う必要があります</em></strong> 。 そのようなすべてのルールと同様に、確かに例外があります。 時々人々はそれらから逸脱し、結果は悪いコードではありませんでしたが、そのような正の逸脱はほとんどありません。 少なくとも、私が見たそのような逸脱の100のうち99は正当化されませんでした。 ただし、1000のうちの999である可能性もあります。そのため、次のルールに従うことをお勧めします。
ko: C ++에서 연산자 오버로드와 관련하여 <strong><em>따라야 할 세 가지 기본 규칙이 있습니다</em></strong> . 이러한 모든 규칙과 마찬가지로 실제로 예외가 있습니다. 때때로 사람들은 그들로부터 벗어 났고 결과는 나쁜 코드가 아니었지만 그러한 긍정적 인 편차는 거의 없습니다. 적어도 내가 본 100 가지의 99 개 중 99 개가 정당화되지 않았습니다. 그러나 1000 개 중 999 개일 수도 있습니다. 따라서 다음 규칙을 따르는 것이 좋습니다.
ru: Когда дело доходит до перегрузки операторов в C ++, <strong><em>следует соблюдать три основных правила</em></strong> . Как и во всех таких правилах, действительно есть исключения. Иногда люди отклонялись от них, и в результате получился неплохой код, но таких положительных отклонений мало, и они далеко друг от друга. По крайней мере, 99 из 100 таких отклонений, которые я видел, были неоправданными. Тем не менее, это может быть и 999 из 1000. Так что вам лучше придерживаться следующих правил.
zh_cn: 对于C ++中的运算符重载， <strong><em>应遵循三个基本规则</em></strong> 。 与所有此类规则一样，确实存在例外。 有时人们偏离了他们，结果不是不好的代码，但是这种积极的偏差很少而且相差甚远。 至少在我看到的100个此类偏差中，有99个是不合理的。 但是，也可能是千分之九千。因此，您最好遵循以下规则。

source: Why can't <code>operator&lt;&lt;</code> function for streaming objects to <code>std::cout</code> or to a file be a member function?
es: &iquest;Por qu&eacute; la funci&oacute;n <code>operator&lt;&lt;</code> para transmitir objetos a <code>std::cout</code> o un archivo no puede ser una funci&oacute;n miembro?
ja: オブジェクトを <code>std::cout</code> またはファイルにストリーミングする <code>operator&lt;&lt;</code> 関数がメンバー関数にならないのはなぜですか？
ko: <code>std::cout</code> 또는 파일로 객체를 스트리밍하는 <code>operator&lt;&lt;</code> 함수를 멤버 함수로 사용할 수없는 이유는 무엇입니까?
ru: Почему <code>operator&lt;&lt;</code> функция для потоковой передачи объектов в <code>std::cout</code> или в файл не может быть функцией-членом?
zh_cn: 为什么 <code>operator&lt;&lt;</code> 函数无法将对象流式传输到 <code>std::cout</code> 或文件中，成为成员函数？

source: You can also overload <code>new</code> and <code>delete</code> with other arguments. As with the additional argument for placement new, these arguments are also listed within parentheses after the keyword <code>new</code>. Merely for historical reasons, such variants are often also called placement new, even if their arguments are not for placing an object at a specific address.
es: Tambi&eacute;n puede sobrecargar <code>new</code> y <code>delete</code> con otros argumentos. Al igual que con el argumento adicional para la colocaci&oacute;n de nuevos, estos argumentos tambi&eacute;n se enumeran entre par&eacute;ntesis despu&eacute;s de la palabra clave <code>new</code> . Simplemente por razones hist&oacute;ricas, tales variantes a menudo tambi&eacute;n se llaman colocaci&oacute;n nueva, incluso si sus argumentos no son para colocar un objeto en una direcci&oacute;n espec&iacute;fica.
ja: <code>new</code> をオーバーロードして、他の引数で <code>delete</code> こともできます。 配置newの追加の引数と同様に、これらの引数もキーワード <code>new</code> の後の括弧内にリストされます。 単に歴史的な理由から、そのようなバリアントは、特定のアドレスにオブジェクトを配置するための引数ではない場合でも、新しい配置とも呼ばれます。
ko: <code>new</code> 를 오버로드하고 다른 인수로 <code>delete</code> 수도 있습니다. new 배치에 대한 추가 인수와 마찬가지로 이러한 인수는 <code>new</code> 키워드 뒤에 괄호 안에 나열됩니다. 역사적 이유로, 이러한 변형은 인수가 특정 주소에 객체를 배치하기위한 것이 아니더라도 종종 새로운 배치라고도합니다.
ru: Вы также можете перегрузить <code>new</code> и <code>delete</code> с другими аргументами. Как и в случае с дополнительным аргументом для размещения new, эти аргументы также перечислены в скобках после ключевого слова <code>new</code> . По историческим причинам такие варианты часто также называют размещением нового, даже если их аргументы не для размещения объекта по определенному адресу.
zh_cn: 您还可以重载 <code>new</code> 和 <code>delete</code> 以及其他参数。 与用于放置new的其他参数一样，这些参数也在关键字 <code>new</code> 后面的括号内列出。 仅出于历史原因，此类变体通常也称为&ldquo;新放置&rdquo;，即使它们的参数不是要在特定地址放置对象。

source: You cannot change the meaning of operators for built-in types in C++, operators can only be overloaded for user-defined types<sup>1</sup>. That is, at least one of the operands has to be of a user-defined type. As with other overloaded functions, operators can be overloaded for a certain set of parameters only once.
es: No puede cambiar el significado de los operadores para los tipos integrados en C ++, los operadores solo se pueden sobrecargar para los tipos <sup>1</sup> definidos por el usuario. Es decir, al menos uno de los operandos debe ser de un tipo definido por el usuario. Al igual que con otras funciones sobrecargadas, los operadores pueden sobrecargarse para un determinado conjunto de par&aacute;metros solo una vez.
ja: C ++の組み込み型の演算子の意味を変更することはできません。演算子は、ユーザー定義型<sup>1</sup>に対してのみオーバーロードできます。 つまり、オペランドの少なくとも1つはユーザー定義型である必要があります。 他のオーバーロードされた関数と同様に、オペレーターは特定のパラメーターのセットに対して一度だけオーバーロードできます。
ko: C ++에서 내장 유형에 대한 연산자의 의미를 변경할 수 없으며 연산자는 사용자 정의 유형 <sup>1에</sup> 대해서만 오버로드 될 수 있습니다. 즉, 피연산자 중 적어도 하나는 사용자 정의 유형이어야합니다. 다른 오버로드 된 기능과 마찬가지로 특정 매개 변수 집합에 대해 연산자를 한 번만 오버로드 할 수 있습니다.
ru: Вы не можете изменить значение операторов для встроенных типов в C ++, операторы могут быть перегружены только для пользовательских типов <sup>1</sup> . То есть, по крайней мере, один из операндов должен быть пользовательского типа. Как и в случае с другими перегруженными функциями, операторы могут быть перегружены для определенного набора параметров только один раз.
zh_cn: 您不能更改C ++中内置类型的运算符的含义，只能对用户定义的类型<sup>1</sup>重载运算符。 即，至少一个操作数必须是用户定义的类型。 与其他重载函数一样，运算符只能对一组特定参数重载一次。

source: You will be able to use:
es: Usted será capaz de usar:
ja: 使えるようになります。
ko: 다음을 사용할 수 있습니다.
ru: Ты сможешь использовать:
zh_cn: 你将能够使用。

source: and you want to overload the increment and decrement operators for it, you cannot do this as a member functions, since in C++, enum types cannot have member functions. So you have to overload it as a free function. And <code>operator&lt;()</code> for a class template nested within a class template is much easier to write and read when done as a member function inline in the class definition. But these are indeed rare exceptions.
es: y desea sobrecargar los operadores de incremento y decremento, no puede hacer esto como funciones miembro, ya que en C ++, los tipos de enumeraci&oacute;n no pueden tener funciones miembro. Por lo tanto, debe sobrecargarlo como una funci&oacute;n gratuita. Y el <code>operator&lt;()</code> para una plantilla de clase anidada dentro de una plantilla de clase es mucho m&aacute;s f&aacute;cil de escribir y leer cuando se hace como una funci&oacute;n miembro en l&iacute;nea en la definici&oacute;n de clase. Pero estas son, de hecho, raras excepciones.
ja: C ++では列挙型はメンバー関数を持つことができないので、そのためにインクリメント演算子とデクリメント演算子をオーバーロードしたい場合、これをメンバー関数として実行することはできません。 したがって、フリー関数としてオーバーロードする必要があります。 また、クラステンプレート内にネストされたクラステンプレートの <code>operator&lt;()</code> は、クラス定義のインラインでメンバー関数として実行すると、書き込みと読み取りがはるかに簡単になります。 しかし、これらは確かにまれな例外です。
ko: 그리고 증가 및 감소 연산자를 오버로드하려면 C ++에서 열거 형 유형에 멤버 함수를 사용할 수 없으므로 멤버 함수 로이 작업을 수행 할 수 없습니다. 따라서 무료 기능으로 과부하해야합니다. 클래스 템플릿 내에 중첩 된 클래스 템플릿에 대한 <code>operator&lt;()</code> 는 클래스 정의에서 인라인 멤버 함수로 수행 할 때 훨씬 쉽게 읽고 쓸 수 있습니다. 그러나 이들은 실제로 드문 예외입니다.
ru: и вы хотите перегрузить операторы инкремента и декремента для него, вы не можете сделать это как функции-члены, так как в C ++ типы enum не могут иметь функции-члены. Таким образом, вы должны перегрузить его как бесплатную функцию. И <code>operator&lt;()</code> для шаблона класса, вложенного в шаблон класса, гораздо проще писать и читать, когда он выполняется как функция-член, встроенная в определение класса. Но это действительно редкие исключения.
zh_cn: 并且您想为其重载递增和递减运算符，则不能作为成员函数来执行此操作，因为在C ++中，枚举类型不能具有成员函数。 因此，您必须将其作为自由函数进行重载。 当在类定义中作为成员函数内联完成时，嵌套在类模板中的类模板的 <code>operator&lt;()</code> 易于编写和读取。 但是这些确实是罕见的例外。
