Repository: rueisnom/feedback
Catalog: xlf/44/21/70/6/4421706.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: In C++, operators are overloaded in the form of <strong><em>functions with special names</em></strong>. As with other functions, overloaded operators can generally be implemented either as a <strong><em>member function of their left operand's type</em></strong> or as <strong><em>non-member functions</em></strong>. Whether you are free to choose or bound to use either one depends on several criteria.<sup>2</sup> A unary operator <code>@</code><sup>3</sup>, applied to an object x, is invoked either as <code>operator@(x)</code> or as <code>x.operator@()</code>. A binary infix operator <code>@</code>, applied to the objects <code>x</code> and <code>y</code>, is called either as <code>operator@(x,y)</code> or as <code>x.operator@(y)</code>.<sup>4</sup>
es: En C ++, los operadores est&aacute;n sobrecargados en forma de <strong><em>funciones con nombres especiales</em></strong> . Al igual que con otras funciones, los operadores sobrecargados generalmente se pueden implementar como una <strong><em>funci&oacute;n miembro del tipo de su operando izquierdo</em></strong> o como <strong><em>funciones no miembros</em></strong> . Si es libre de elegir o est&aacute; obligado a usar cualquiera de ellos depende de varios criterios. <sup>2</sup> Un operador unario <code>@</code> <sup>3</sup> , aplicado a un objeto x, se invoca como <code>operator@(x)</code> o como <code>x.operator@()</code> . Un operador infijo binario <code>@</code> , aplicado a los objetos <code>x</code> e <code>y</code> , se denomina <code>operator@(x,y)</code> o como <code>x.operator@(y)</code> . <sup>4 4</sup>
ja: C ++では、演算子は<strong><em>特別な名前</em></strong>を<strong><em>持つ関数</em></strong>の形式でオーバーロードされ<strong><em>ます</em></strong> 。 他の関数と同様に、オーバーロードされた演算子は通常<strong><em>、左のオペランドの型の</em></strong> <strong><em>メンバー関数</em></strong>または<strong><em>非</em></strong> <strong><em>メンバー関数</em></strong>として実装でき<strong><em>ます</em></strong> 。 自由に選択できるか、どちらを使用するかは、いくつかの基準によって異なります。 <sup>2</sup>オブジェクトxに適用される単項演算子 <code>@</code> <sup>3は</sup> 、 <code>operator@(x)</code> または <code>x.operator@()</code> として呼び出されます。 オブジェクト <code>x</code> と <code>y</code> に適用されるバイナリのイン <code>x.operator@(y)</code> <code>operator@(x,y)</code> は、 operator @（x、y）またはx.operator @（y）と呼ばれます。 <sup>4</sup>
ko: C ++에서 연산자는 <strong><em>특수한 이름을 가진 함수</em></strong> 형태로 오버로드됩니다. 다른 함수와 마찬가지로 오버로드 된 연산자는 일반적으로 <strong><em>왼쪽 피연산자 유형의</em></strong> <strong><em>멤버 함수</em></strong> 또는 <strong><em>비</em></strong> <strong><em>멤버 함수</em></strong> 로 구현 될 수 있습니다. 어느 쪽이든 자유롭게 사용할 수 있는지 여부는 몇 가지 기준에 따라 다릅니다. <sup>2</sup> 객체 x에 적용된 단항 연산자 <code>@</code> <sup>3</sup> 은 <code>operator@(x)</code> 또는 <code>x.operator@()</code> 로 호출됩니다. 객체 <code>x</code> 와 <code>y</code> 에 적용되는 이진 <code>x.operator@(y)</code> <code>operator@(x,y)</code> 는 operator @ (x, y) 또는 x.operator @ (y) 로 불립니다 . <sup>4</sup>
ru: В C ++ операторы перегружены в виде <strong><em>функций со специальными именами</em></strong> . Как и в случае с другими функциями, перегруженные операторы обычно могут быть реализованы либо как <strong><em>функции-члены типа их левого операнда,</em></strong> либо как функции, <strong><em>не являющиеся членами</em></strong> . Вольны ли вы выбирать или обязаны использовать один из них, зависит от нескольких критериев. <sup>2</sup> Унарный оператор <code>@</code> <sup>3</sup> , примененный к объекту x, вызывается либо как <code>operator@(x)</code> либо как <code>x.operator@()</code> . Двоичный инфиксный оператор <code>@</code> , применяемый к объектам <code>x</code> и <code>y</code> , называется либо <code>operator@(x,y)</code> либо как <code>x.operator@(y)</code> . <sup>4</sup>
zh_cn: 在C ++中，运算符以<strong><em>具有特殊名称</em></strong>的<strong><em>函数</em></strong>的形式被重载。 与其他函数一样，重载运算符通常可以实现<strong><em>为其左操作数类型</em></strong> <strong><em>的成员函数</em></strong>或实现<strong><em>为非成员函数</em></strong> 。 您是否可以自由选择还是必须使用其中之一取决于多个条件。 <sup>2</sup>应用于对象x的一元运算符 <code>@</code> <sup>3</sup>可以作为 <code>operator@(x)</code> 或 <code>x.operator@()</code> 调用。 应用于对象 <code>x</code> 和 <code>y</code> 的二进制中缀运算符 <code>@</code> 被称为 <code>operator@(x,y)</code> 或 <code>x.operator@(y)</code> 。 <sup>4</sup>

source: In C++, when you write a <strong><em>new expression</em></strong> like <code>new T(arg)</code> two things happen when this expression is evaluated: First <strong><em><code>operator new</code></em></strong> is invoked to obtain raw memory, and then the appropriate constructor of <code>T</code> is invoked to turn this raw memory into a valid object. Likewise, when you delete an object, first its destructor is called, and then the memory is returned to <code>operator delete</code>.
es: En C ++, cuando escribe una <strong><em>nueva expresi&oacute;n</em></strong> como <code>new T(arg)</code> , suceden dos cosas cuando se eval&uacute;a esta expresi&oacute;n: primero se invoca el <strong><em> <code>operator new</code> </em></strong> para obtener memoria sin formato, y luego se invoca el constructor apropiado de <code>T</code> para convertir esta memoria sin formato en un objeto v&aacute;lido Del mismo modo, cuando elimina un objeto, primero se llama a su destructor, y luego la memoria vuelve a la <code>operator delete</code> .
ja: C ++では、 <code>new T(arg)</code> のような <strong><em>新しい式</em></strong>を記述すると、この式が評価されるときに2つのことが起こります。最初の<strong><em> <code>operator new</code> </em></strong>が呼び出されてrawメモリが取得され、次に <code>T</code> の適切なコンストラクターが呼び出されてこのrawメモリがaに変換されます。有効なオブジェクト。 同様に、オブジェクトを削除すると、まずそのデストラクタが呼び出され、次にメモリが <code>operator delete</code> に返されます。
ko: C ++에서 <code>new T(arg)</code> 와 같은 <strong><em>새 표현식</em></strong> 을 작성할 때이 표현식이 평가 될 때 두 가지 상황이 발생합니다. 첫 번째 <strong><em> <code>operator new</code> </em></strong> 는 원시 메모리를 얻기 위해 호출 된 다음 적절한 원시 생성자를 호출하여이 원시 메모리를 a로 변환합니다. 유효한 객체. 마찬가지로 객체를 삭제하면 먼저 소멸자가 호출 된 다음 메모리가 <code>operator delete</code> 로 반환됩니다.
ru: В C ++, когда вы пишете <strong><em>новое выражение,</em></strong> такое как <code>new T(arg)</code> , при вычислении этого выражения происходят две вещи: сначала вызывается <strong><em> <code>operator new</code> </em></strong> для получения необработанной памяти, а затем вызывается соответствующий конструктор <code>T</code> , чтобы превратить эту необработанную память в действительный объект. Аналогично, когда вы удаляете объект, сначала вызывается его деструктор, а затем память возвращается <code>operator delete</code> .
zh_cn: 在C ++中，当您编写一个类似于 <code>new T(arg)</code> 的<strong><em>新表达式</em></strong>时，对该表达式求值时会发生两件事：首先调用<strong><em> <code>operator new</code> </em></strong>以获取原始内存，然后调用 <code>T</code> 的适当构造函数以将该原始内存转换为a有效对象。 同样，删除对象时，首先将调用其析构函数，然后将内存返回给 <code>operator delete</code> 。

source: Input and Output Operators
es: Operadores de entrada y salida
ja: 入出力演算子
ko: 입력 및 출력 연산자
ru: Входные и выходные операторы
zh_cn: 输入和输出运算器

source: Let's say you have:
es: Digamos que sí:
ja: あるとしましょう。
ko: 가지고 있다고 가정 해 봅시다.
ru: Скажем так:
zh_cn: 假设你有。

source: Most commonly you will want to fine-tune memory management because measurement has shown that instances of a specific class, or of a group of related classes, are created and destroyed often and that the default memory management of the run-time system, tuned for general performance, deals inefficiently in this specific case. To improve this, you can overload new and delete for a specific class:
es: Lo más común es que se quiera afinar la gestión de la memoria porque las mediciones han demostrado que a menudo se crean y destruyen instancias de una clase específica,o de un grupo de clases relacionadas,y que la gestión de la memoria por defecto del sistema en tiempo de ejecución,afinada para el rendimiento general,se ocupa de manera ineficiente en este caso específico.Para mejorar esto,se puede sobrecargar la nueva y eliminar para una clase específica:
ja: なぜなら、特定のクラスや関連するクラスのグループのインスタンスが頻繁に生成・破棄されること、また、一般的なパフォーマンスに合わせて調整されたランタイムシステムのデフォルトのメモリ管理は、この特定のケースでは非効率的に処理されることが測定で明らかになっているからです。これを改善するには、特定のクラスに対して new や delete をオーバーロードすることができます。
ko: 측정 결과 특정 클래스 또는 관련 클래스 그룹의 인스턴스가 자주 생성 및 소멸되고 런타임 시스템의 기본 메모리 관리가 조정되었음을 보여 주므로 메모리 관리를 세부적으로 조정하려고합니다. 일반적인 성능은이 특정 사례에서 비효율적으로 처리됩니다. 이를 개선하기 위해 특정 클래스에 대해 새로운 과부하 및 삭제를 수행 할 수 있습니다.
ru: Чаще всего вам захочется тонко настроить управление памятью,так как измерения показали,что экземпляры определенного класса или группы связанных классов часто создаются и уничтожаются,и что управление памятью по умолчанию системы исполнения,настроенное на общую производительность,в данном конкретном случае работает неэффективно.Для улучшения этого можно перегрузить новый и удалить для конкретного класса:
zh_cn: 大多数情况下,你会希望对内存管理进行微调,因为测量表明,一个特定类或一组相关类的实例经常会被创建和销毁,而运行时系统的默认内存管理,在这种特殊情况下,为了一般的性能而调整的内存管理效率很低。为了改善这种情况,可以对特定类的新建和删除进行超载。

source: Most of the work in overloading operators is boiler-plate code. That is little wonder, since operators are merely syntactic sugar, their actual work could be done by (and often is forwarded to) plain functions. But it is important that you get this boiler-plate code right. If you fail, either your operator&rsquo;s code won&rsquo;t compile or your users&rsquo; code won&rsquo;t compile or your users&rsquo; code will behave surprisingly.
es: La mayor parte del trabajo en los operadores de sobrecarga es el c&oacute;digo de placa de caldera. No es de extra&ntilde;ar, ya que los operadores son simplemente az&uacute;car sint&aacute;ctica, su trabajo real podr&iacute;a realizarse (y a menudo se reenv&iacute;a a) funciones simples. Pero es importante que obtenga este c&oacute;digo correcto de placa de caldera. Si falla, el c&oacute;digo de su operador no se compilar&aacute; o el c&oacute;digo de sus usuarios no se compilar&aacute; o el c&oacute;digo de sus usuarios se comportar&aacute; sorprendentemente.
ja: 演算子のオーバーロードにおける作業のほとんどは、ボイラープレートコードです。 演算子は単なる構文上の糖なので、実際の作業は単純な関数で行うことができます（多くの場合、転送されます）。 ただし、この定型コードを正しく取得することが重要です。 失敗すると、オペレーターのコードがコンパイルされないか、ユーザーのコードがコンパイルされないか、ユーザーのコードが驚くほど動作します。
ko: 과부하 연산자의 대부분의 작업은 보일러 플레이트 코드입니다. 연산자가 단순히 구문 설탕이기 때문에 실제 작업이 일반 기능으로 수행 될 수 있으며 종종 전달됩니다. 그러나이 보일러 플레이트 코드를 올바르게 얻는 것이 중요합니다. 실패하면 운영자 코드가 컴파일되지 않거나 사용자 코드가 컴파일되지 않거나 사용자 코드가 놀랍게 동작합니다.
ru: Большая часть работы операторов по перегрузке - это код котельной плиты. Это неудивительно, поскольку операторы являются просто синтаксическим сахаром, их фактическая работа может выполняться (и часто направляется) простыми функциями. Но важно, чтобы вы правильно поняли этот код. Если вы потерпите неудачу, либо код вашего оператора не скомпилируется, либо код вашего пользователя не скомпилируется, либо код вашего пользователя будет вести себя на удивление.
zh_cn: 重载操作员中的大部分工作是样板代码。 这也就不足为奇了，由于运算符仅仅是语法糖，它们的实际工作可以通过（通常转发给）普通函数来完成。 但是，重要的是要正确编写此样板代码。 如果失败，则操作员的代码将无法编译，或者用户的代码将无法编译，或者用户的代码将表现出惊人的性能。

source: Not all operators can be overloaded in C++. Among the operators that cannot be overloaded are: <code>.</code><code>::</code><code>sizeof</code><code>typeid</code><code>.*</code> and the only ternary operator in C++, <code>?:</code>
es: No todos los operadores pueden sobrecargarse en C ++. Entre los operadores que no se pueden sobrecargar est&aacute;n:. <code>::</code> <code>sizeof</code> <code>typeid</code> <code>.*</code> y el &uacute;nico operador ternario en C ++, <code>?:</code>
ja: C ++では、すべての演算子をオーバーロードできるわけではありません。 オーバーロードできない演算子には次のものがあります <code>.</code> <code>::</code> <code>sizeof</code> <code>typeid</code> <code>.*</code> およびC ++で唯一の三項演算子 <code>?:</code>
ko: 모든 연산자가 C ++에서 오버로드 될 수있는 것은 아닙니다. 오버로드 할 수없는 연산자는 다음과 같습니다 <code>.</code> <code>::</code> <code>sizeof</code> <code>typeid</code> <code>.*</code> 및 C ++의 유일한 삼항 연산자 <code>?:</code>
ru: Не все операторы могут быть перегружены в C ++. Среди операторов, которые не могут быть перегружены: <code>::</code> <code>sizeof</code> <code>typeid</code> <code>.*</code> и единственный троичный оператор в C ++, <code>?:</code>
zh_cn: 并非所有运算符都可以在C ++中重载。 不能重载的运算符包括： <code>.</code> <code>::</code> <code>sizeof</code> <code>typeid</code> <code>.*</code> 和C ++中唯一的三元运算符 <code>?:</code>

source: Note that the postfix variant is implemented in terms of prefix. Also note that postfix does an extra copy.<sup>2</sup>
es: Tenga en cuenta que la variante postfix se implementa en t&eacute;rminos de prefijo. Tambi&eacute;n tenga en cuenta que postfix hace una copia adicional. <sup>2</sup>
ja: 接尾辞バリアントは接頭辞に関して実装されることに注意してください。 また、postfixは余分なコピーを行うことに注意してください。 <sup>2</sup>
ko: 접미사 변형은 접두사 측면에서 구현됩니다. 또한 postfix는 추가 사본을 수행합니다. <sup>2</sup>
ru: Обратите внимание, что постфиксный вариант реализован в терминах префикса. Также обратите внимание, что postfix делает дополнительную копию. <sup>2</sup>
zh_cn: 请注意，后缀变体是根据前缀实现的。 另请注意，后缀会额外复制。 <sup>2</sup>

source: Note that these, too, will almost always need both a const and a non-const version. For the <code>-&gt;</code> operator, if <code>value_type</code> is of <code>class</code> (or <code>struct</code> or <code>union</code>) type, another <code>operator-&gt;()</code> is called recursively, until an <code>operator-&gt;()</code> returns a value of non-class type.
es: Tenga en cuenta que estos tambi&eacute;n necesitar&aacute;n casi siempre una versi&oacute;n const y una versi&oacute;n sin const. Para el operador <code>-&gt;</code> , si <code>value_type</code> es de tipo de <code>class</code> (o <code>struct</code> o <code>union</code> ), se llama a otro <code>operator-&gt;()</code> forma recursiva, hasta que un <code>operator-&gt;()</code> devuelve un valor de tipo que no es de clase.
ja: これらも、ほとんど常にconstバージョンと非constバージョンの両方を必要とすることに注意してください。 <code>-&gt;</code> 演算子の場合、 <code>value_type</code> が <code>class</code> （または <code>struct</code> または <code>union</code> ）タイプである場合、 <code>operator-&gt;()</code> が非クラスタイプの値を返すまで、別のoperator-&gt;（）が再帰的に呼び出されます。
ko: 이것들도 거의 항상 const와 non-const 버전을 필요로합니다. <code>-&gt;</code> 연산자의 경우 <code>value_type</code> 이 <code>class</code> (또는 <code>struct</code> 또는 <code>union</code> ) 유형 인 경우 <code>operator-&gt;()</code> 가 비 클래스 유형의 값을 리턴 할 때까지 다른 <code>operator-&gt;()</code> 가 재귀 적으로 호출됩니다.
ru: Обратите внимание, что они также почти всегда нуждаются как в const, так и в неконстантной версии. Для оператора <code>-&gt;</code> , если <code>value_type</code> имеет <code>class</code> (или <code>struct</code> или <code>union</code> ), другой <code>operator-&gt;()</code> вызывается рекурсивно, пока <code>operator-&gt;()</code> вернет значение не-классового типа.
zh_cn: 注意，这些也几乎总是需要const和非const版本。 对于 <code>-&gt;</code> 运算符，如果 <code>value_type</code> 是 <code>class</code> （或 <code>struct</code> 或 <code>union</code> ）类型，则递归调用另一个 <code>operator-&gt;()</code> ，直到 <code>operator-&gt;()</code> 返回非类类型的值。

source: Note that, in the example code for placement new given above, <code>operator delete</code> is never called, unless the constructor of X throws an exception.
es: Tenga en cuenta que, en el c&oacute;digo de ejemplo para la ubicaci&oacute;n nueva dada anteriormente, nunca se llama a la <code>operator delete</code> , a menos que el constructor de X arroje una excepci&oacute;n.
ja: 上記の配置newのサンプルコードでは、Xのコンストラクターが例外をスローしない限り、 <code>operator delete</code> は呼び出されないことに注意してください。
ko: 위에 주어진 new 배치에 대한 예제 코드에서 X 생성자가 예외를 throw하지 않는 한 <code>operator delete</code> 는 호출되지 않습니다.
ru: Обратите внимание, что в приведенном выше примере кода для размещения нового <code>operator delete</code> никогда не вызывается, если только конструктор X не выдает исключение.
zh_cn: 请注意，在上面给出的用于放置新位置的示例代码中，除非X的构造函数抛出异常，否则永远不会调用 <code>operator delete</code> 。

source: Note: The answers were given in <em>a specific order</em>, but since many users sort answers according to votes, rather than the time they were given, here's an <strong><em>index of the answers</em></strong> in the order in which they make most sense:
es: Nota: Las respuestas se dieron en <em>un orden espec&iacute;fico</em> , pero dado que muchos usuarios clasifican las respuestas de acuerdo con los votos, en lugar del tiempo en que se dieron, aqu&iacute; hay un <strong><em>&iacute;ndice de las respuestas</em></strong> en el orden en que tienen m&aacute;s sentido:
ja: 注：回答は<em>特定の順序</em>で与えられまし<em>た</em>が、多くのユーザーは、与えられた時間ではなく投票に従って回答を並べ替えるため、最も意味のある順序で<strong><em>回答のインデックスを次に示します</em></strong> 。
ko: 참고 : 답변은 <em>특정 순서대로 제공</em> 되었지만 많은 사용자가 답변을받은 시간이 아니라 투표에 따라 답변을 정렬하므로 가장 적합한 순서대로 <strong><em>답변 색인을 제공합니다</em></strong> .
ru: Примечание. Ответы были даны в <em>определенном порядке</em> , но поскольку многие пользователи сортируют ответы по голосам, а не по времени, в которое они были даны, вот <strong><em>индекс ответов</em></strong> в том порядке, в котором они имеют наибольшее значение:
zh_cn: 注意：答案是按照<em>特定顺序</em>给出的，但是由于许多用户是根据投票而不是给出时间<strong><em>来对答案</em></strong>进行排序的，因此以下是最有意义的顺序的<strong><em>索引</em></strong> ：

source: Notice the <code>explicit</code>. Now when you try to execute the unexpected code from the implicit conversion operators, you get a compiler error:
es: Observe lo <code>explicit</code> . Ahora, cuando intenta ejecutar el c&oacute;digo inesperado de los operadores de conversi&oacute;n impl&iacute;citos, obtiene un error del compilador:
ja: <code>explicit</code> 注意してください。 暗黙の変換演算子から予期しないコードを実行しようとすると、コンパイラエラーが発生します。
ko: <code>explicit</code> 주목하십시오. 이제 암시 적 변환 연산자에서 예기치 않은 코드를 실행하려고하면 컴파일러 오류가 발생합니다.
ru: Обратите внимание на <code>explicit</code> . Теперь, когда вы пытаетесь выполнить неожиданный код из операторов неявного преобразования, вы получаете ошибку компилятора:
zh_cn: 注意 <code>explicit</code> 。 现在，当您尝试从隐式转换运算符执行意外的代码时，会出现编译器错误：

source: Of course, as with all rules of thumb, there are exceptions. If you have a type
es: Por supuesto,como en todas las reglas generales,hay excepciones.Si tienes un tipo
ja: もちろん、すべての経験則と同様に、例外もあります。もしも、あなたが
ko: 물론 모든 경험 규칙과 마찬가지로 예외가 있습니다. 유형이 있다면
ru: Конечно,как и во всех правилах,есть исключения.Если у вас есть тип
zh_cn: 当然,与所有的经验法则一样,也有例外。如果你有一个类型

source: Operators for Pointer-like Types
es: Operadores para los tipos de puntero
ja: ポインタ型のための演算子
ko: 포인터 형 타입을위한 연산자
ru: Операторы для указательных типов
zh_cn: 类似指针类型的运算符

source: Operators that are implemented as non-member functions are sometimes friend of their operand&rsquo;s type.
es: Los operadores que se implementan como funciones que no son miembros a veces son amigos del tipo de su operando.
ja: 非メンバー関数として実装されている演算子は、そのオペランドの型のフレンドである場合があります。
ko: 비 멤버 함수로 구현 된 연산자는 때때로 피연산자 유형의 친구입니다.
ru: Операторы, которые реализованы как функции, не являющиеся членами, иногда являются друзьями типа своего операнда.
zh_cn: 实现为非成员函数的运算符有时是其操作数类型的朋友。

source: Other operators can be implemented either as members or as non-members. Some of them, however, usually have to be implemented as non-member functions, because their left operand cannot be modified by you. The most prominent of these are the input and output operators <code>&lt;&lt;</code> and <code>&gt;&gt;</code>, whose left operands are stream classes from the standard library which you cannot change.
es: Otros operadores pueden implementarse como miembros o no miembros. Algunos de ellos, sin embargo, generalmente tienen que implementarse como funciones que no son miembros, porque su operando izquierdo no puede ser modificado por usted. Los m&aacute;s destacados son los operadores de entrada y salida <code>&lt;&lt;</code> y <code>&gt;&gt;</code> , cuyos operandos izquierdos son clases de flujo de la biblioteca est&aacute;ndar que no puede cambiar.
ja: 他のオペレーターは、メンバーまたは非メンバーとして実装できます。 ただし、それらの一部は、左のオペランドを変更できないため、通常は非メンバー関数として実装する必要があります。 これらの中で最も顕著なのは、入力および出力演算子 <code>&lt;&lt;</code> および <code>&gt;&gt;</code> です。これらの左オペランドは、変更できない標準ライブラリのストリームクラスです。
ko: 다른 연산자는 멤버 또는 비 멤버로 구현할 수 있습니다. 그러나 일부는 왼쪽 피연산자를 수정할 수 없으므로 일반적으로 비 멤버 함수로 구현해야합니다. 이들 중 가장 눈에 띄는 것은 입력 및 출력 연산자 <code>&lt;&lt;</code> 및 <code>&gt;&gt;</code> 로 , 왼쪽 피연산자는 표준 라이브러리의 스트림 클래스이며 변경할 수 없습니다.
ru: Другие операторы могут быть реализованы как члены или не члены. Однако некоторые из них обычно должны быть реализованы как функции, не являющиеся членами, поскольку их левый операнд не может быть изменен вами. Наиболее заметными из них являются операторы ввода и вывода <code>&lt;&lt;</code> и <code>&gt;&gt;</code> , левые операнды которых являются потоковыми классами из стандартной библиотеки, которые нельзя изменить.
zh_cn: 其他运算符可以实现为成员或非成员。 但是，其中一些通常必须实现为非成员函数，因为您无法修改其左操作数。 其中最突出的是输入和输出运算符 <code>&lt;&lt;</code> 和 <code>&gt;&gt;</code> ，其左操作数是标准库中的流类，您不能更改它们。

source: Overloaded thus, new and delete behave like static member functions. For objects of <code>my_class</code>, the <code>std::size_t</code> argument will always be <code>sizeof(my_class)</code>. However, these operators are also called for dynamically allocated objects of <strong><em>derived classes</em></strong>, in which case it might be greater than that.
es: Sobrecargado as&iacute;, new y delete se comportan como funciones miembro est&aacute;ticas. Para los objetos de <code>my_class</code> , el argumento <code>std::size_t</code> siempre ser&aacute; <code>sizeof(my_class)</code> . Sin embargo, estos operadores tambi&eacute;n son llamados para objetos asignados din&aacute;micamente de <strong><em>clases derivadas</em></strong> , en cuyo caso podr&iacute;a ser mayor que eso.
ja: したがって、オーバーロードされたnewおよびdeleteは、静的メンバー関数のように動作します。 <code>my_class</code> のオブジェクトの場合 、 <code>std::size_t</code> 引数は常に <code>sizeof(my_class)</code> になります。 ただし、これらの演算子は、 <strong><em>派生クラスの</em></strong>動的に割り当てられたオブジェクトに対しても呼び出されます。その場合、それよりも大きくなる可能性があります。
ko: 따라서 오버로드되면 new 및 delete는 정적 멤버 함수처럼 작동합니다. <code>my_class</code> 의 오브젝트의 경우 <code>std::size_t</code> 인수는 항상 <code>sizeof(my_class)</code> 입니다. 그러나 이러한 연산자는 <strong><em>파생 클래스</em></strong> 의 동적으로 할당 된 객체에 대해서도 호출되며,이 경우 이보다 클 수 있습니다.
ru: Перегруженные таким образом, new и delete ведут себя как статические функции-члены. Для объектов <code>my_class</code> аргумент <code>std::size_t</code> всегда будет <code>sizeof(my_class)</code> . Однако эти операторы также вызываются для динамически размещаемых объектов <strong><em>производных классов</em></strong> , и в этом случае они могут быть больше, чем это.
zh_cn: 因此，new和delete重载时的行为类似于静态成员函数。 对于 <code>my_class</code> 的对象， <code>std::size_t</code> 参数始终为 <code>sizeof(my_class)</code> 。 但是，也需要为<strong><em>派生类的</em></strong>动态分配的对象调用这些运算符，在这种情况下，它可能会更大。

source: Overloading <code>new</code> and <code>delete</code>
es: Sobrecargando <code>new</code> y <code>delete</code>
ja: <code>new</code> および <code>delete</code> オーバーロード
ko: <code>new</code> 과부하 및 <code>delete</code>
ru: Перегрузка <code>new</code> и <code>delete</code>
zh_cn: 重载 <code>new</code> 和 <code>delete</code>

source: Overloading new and delete
es: Sobrecargar nuevo y eliminar
ja: 新規・削除のオーバーロード
ko: 새로운 과부하 및 삭제
ru: Перегрузка новых и удаление
zh_cn: 超载新增和删除

source: Overloading unary minus and plus is not very common and probably best avoided. If needed, they should probably be overloaded as member functions.
es: La sobrecarga de unario menos y más no es muy común y probablemente sea mejor evitarla.Si es necesario,probablemente deberían ser sobrecargados como funciones de los miembros.
ja: 単項のマイナスとプラスをオーバーロードすることはあまり一般的ではありませんし、おそらく避けた方が良いでしょう。必要であれば、メンバ関数としてオーバーロードすべきでしょう。
ko: 단항 빼기 및 더하기 과부하는 흔하지 않으며 피하는 것이 가장 좋습니다. 필요한 경우 멤버 함수로 오버로드되어야합니다.
ru: Перегрузка без учета минусов и плюсов не очень распространена и,возможно,ее лучше всего избегать.При необходимости,они,вероятно,должны быть перегружены как функции члена.
zh_cn: 过载单数减法和加法不是很常见,可能最好避免。如果需要的话,大概应该把它们作为成员函数超载。

source: Placement <code>new</code>
es: Colocaci&oacute;n <code>new</code>
ja: <code>new</code> 配置
ko: 게재 위치 <code>new</code>
ru: Размещение <code>new</code>
zh_cn: <code>new</code> 刊登位置
