Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Controlling the lifetime and memory management (disposal) semantics of the property - particularly important in non-managed memory environments (like C++ or Objective-C).
es: El control de la vida útil y la semántica de la gestión de la memoria (eliminación)de la propiedad-particularmente importante en los entornos de memoria no gestionada (como C++u Objetivo-C).
ja: プロパティのライフタイムとメモリ管理(廃棄)セマンティクスを制御します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성의 수명 및 메모리 관리 (처분) 시맨틱 제어-특히 관리되지 않는 메모리 환경 (예 : C ++ 또는 Objective-C)에서 중요합니다.</font></font>
ru: Управление семантикой времени жизни и управления памятью (утилизации)свойства-особенно важно в неуправляемых окружениях памяти (например,C++или Objective-C).
zh_cn: 控制属性的生命周期和内存管理(处置)语义--在非管理型内存环境(如C++或Objective-C)中尤其重要。

source: Depends on your language. You've tagged this "object-oriented" rather than "Java", so I'd like to point out that ChssPly76's answer is language-dependent. In Python, for instance, there is no reason to use getters and setters. If you need to change the behavior, you can use a property, which wraps a getter and setter around basic attribute access. Something like this:
es: Depende de su idioma.Has etiquetado esto como "orientado a objetos" en lugar de "Java",así que me gustaría señalar que la respuesta de ChssPly76 depende del lenguaje.En Python,por ejemplo,no hay razón para usar getters y setters.Si necesitas cambiar el comportamiento,puedes usar una propiedad,que envuelve un getter y setter alrededor del acceso a los atributos básicos.Algo como esto:
ja: あなたの言語に依存します。あなたはこれを「Java」ではなく「オブジェクト指向」とタグ付けしているので、ChssPly76さんの答えは言語に依存していることを指摘しておきます。例えばPythonでは、ゲッターやセッターを使う理由がありません。挙動を変更する必要がある場合は、基本的な属性アクセスの周りにゲッターとセッターをラップするプロパティを使用することができます。このようなものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언어에 따라 다릅니다. </font><font style="vertical-align: inherit;">"Java"가 아닌 "object-oriented"에 태그를 달았으므로 ChssPly76의 답변은 언어에 따라 다릅니다. </font><font style="vertical-align: inherit;">예를 들어 파이썬에서는 게터와 세터를 사용할 이유가 없습니다. </font><font style="vertical-align: inherit;">동작을 변경해야하는 경우 기본 속성 액세스를 통해 getter 및 setter를 랩핑하는 특성을 사용할 수 있습니다. </font><font style="vertical-align: inherit;">이 같은:</font></font>
ru: Зависит от твоего языка.Вы пометили этот "объектно-ориентированный",а не "Java",поэтому я хотел бы отметить,что ответ ChssPly76 зависит от языка.На Python,например,нет причин использовать геттеры и сеттеры.Если нужно изменить поведение,можно использовать свойство,которое обёртывает геттер и сеттер вокруг доступа к базовому атрибуту.Что-то вроде этого:
zh_cn: 这要看你的语言了。你把这个标记为 "面向对象",而不是 "Java",所以我想指出,ChssPly76的答案是依赖于语言的。比如在Python中,没有理由使用getters和setter。如果你需要改变行为,你可以使用一个属性,将getter和setter包裹在基本的属性访问中。类似于这样的东西。

source: Don't use getters setters unless needed for your current delivery I.e. Don't think too much about what would happen in the future, if any thing to be changed its a change request in most of the production applications, systems.
es: No utilice getters setters a menos que sea necesario para su entrega actual,es decir,no piense demasiado en lo que sucedería en el futuro,si alguna cosa a cambiar es una solicitud de cambio en la mayoría de las aplicaciones de producción,sistemas.
ja: 現在の配送に必要な場合を除き、ゲッターセッターを使用しないようにしてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">현재 제공에 필요한 경우가 아니면 getters setter를 사용하지 마십시오. 즉, 대부분의 프로덕션 응용 프로그램, 시스템에서 변경 요청이 변경 될 경우 향후 어떤 일이 발생할지 너무 많이 생각하지 마십시오.</font></font>
ru: Не используйте сеттеры геттеров,если они не нужны для вашей текущей поставки,т.е.не думайте слишком много о том,что случится в будущем,если что-то будет изменено,это запрос на изменение в большинстве производственных приложений,систем.
zh_cn: 不要使用getters设置器,除非你当前的交付需要,即不要过多的考虑未来会发生什么,如果有什么事情要改变,在大多数的生产应用、系统中,它是一个变更请求。

source: EDIT: I answered this question because there are a bunch of people learning programming asking this, and most of the answers are very technically competent, but they're not as easy to understand if you're a newbie. We were all newbies, so I thought I'd try my hand at a more newbie friendly answer.
es: EDITORIAL:Respondí a esta pregunta porque hay un montón de gente aprendiendo programación preguntando esto,y la mayoría de las respuestas son muy competentes técnicamente,pero no son tan fáciles de entender si eres un novato.Todos éramos novatos,así que pensé en intentar una respuesta más amigable para los novatos.
ja: EDIT:プログラミングを学んでいる人たちが何人もこの質問をしているので、私はこの質問に答えたのですが、ほとんどの回答は技術的には非常に優れているのですが、初心者の方にはわかりにくいものです。みんな初心者なので、もう少し初心者に優しい回答をしてみようと思いました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">편집 : 나는이 질문을하는 프로그래밍을 배우는 사람들이 많기 때문에이 질문에 대답했으며 대부분의 대답은 매우 기술적으로 유능하지만 초보자라면 이해하기 쉽지 않습니다. </font><font style="vertical-align: inherit;">우리는 모두 초보자 였기 때문에 좀 더 친숙한 답변을 시도 할 것이라고 생각했습니다.</font></font>
ru: EDIT:Я ответил на этот вопрос,потому что есть куча людей,изучающих программирование,которые спрашивают об этом,и большинство ответов очень технически грамотны,но их не так легко понять,если вы новичок.Мы все были новичками,поэтому я решил попробовать свои силы в более дружелюбном ответе для новичков.
zh_cn: EDIT:我回答这个问题是因为有一堆学编程的人在问这个问题,而且大部分人的回答都很有技术含量,但是如果你是新手的话,就没有那么容易理解了。因为大家都是新手,所以我想我也可以试着给大家一个更适合新手的答案。

source: Encapsulation mantra
es: Encapsulación del mantra
ja: マントラのカプセル化
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캡슐화 만트라</font></font>
ru: инкапсуляция Мантры
zh_cn: 咒语封装

source: Encapsulation of behavior associated with getting or setting the property - this allows additional functionality (like validation) to be added more easily later.
es: Encapsulación del comportamiento asociado con la obtención o el establecimiento de la propiedad-esto permite una funcionalidad adicional (como la validación)para ser añadida más fácilmente más tarde.
ja: プロパティの取得または設定に関連する動作のカプセル化-これにより、後から追加機能(バリデーションなど)をより簡単に追加することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 가져 오기 또는 설정과 관련된 동작 캡슐화-유효성 검사와 같은 추가 기능을 나중에 더 쉽게 추가 할 수 있습니다.</font></font>
ru: Инкапсуляция поведения,связанного с получением или установкой свойства-это позволяет легче добавлять дополнительную функциональность (например,валидацию)позже.
zh_cn: 封装了与获取或设置属性相关的行为----这允许以后更容易添加额外的功能(如验证)。

source: Even if your language does have properties, there may be cases where they're insufficient or inappropriate. For example, if you want to allow subclasses to control the semantics of an attribute, in languages without dynamic access, a subclass can't substitute a computed property for an attribute.
es: Incluso si su lenguaje tiene propiedades,puede haber casos en los que son insuficientes o inapropiadas.Por ejemplo,si quiere permitir que las subclases controlen la semántica de un atributo,en los idiomas sin acceso dinámico,una subclase no puede sustituir una propiedad calculada por un atributo.
ja: あなたの言語がプロパティを持っていたとしても、それが不十分であったり、不適切な場合があるかもしれません。例えば、サブクラスが属性のセマンティクスを制御できるようにしたい場合、動的アクセスのない言語では、サブクラスは計算されたプロパティを属性の代わりにすることはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언어에 속성이 있더라도 언어가 불충분하거나 부적절 할 수 있습니다. </font><font style="vertical-align: inherit;">예를 들어, 동적 액세스가없는 언어에서 하위 클래스가 속성의 의미를 제어 할 수 있도록하려면 하위 클래스가 계산 된 속성을 속성으로 대체 할 수 없습니다.</font></font>
ru: Даже если ваш язык обладает свойствами,могут быть случаи,когда они недостаточны или неуместны.Например,если Вы хотите разрешить подклассам управлять семантикой атрибута,в языках без динамического доступа,подкласс не может заменить вычисленное свойство атрибутом.
zh_cn: 即使你的语言确实有属性,也可能会出现属性不足或不合适的情况。例如,如果你想让子类控制一个属性的语义,在没有动态访问的语言中,子类不能用计算属性代替属性。

source: Even though getter and setter methods are useful, you should be careful not to overuse them because, among other issues, they can make code maintenance more difficult in certain situations. Also, they provide access to your class implementation, like public members. OOP practice discourages direct access to properties within a class.
es: Aunque los métodos de getter y setter son útiles,hay que tener cuidado de no abusar de ellos porque,entre otras cosas,pueden dificultar el mantenimiento del código en determinadas situaciones.Además,proporcionan acceso a la implementación de su clase,como los miembros públicos.La práctica de OOP desalienta el acceso directo a las propiedades dentro de una clase.
ja: ゲッターメソッドやセッターメソッドは便利ですが、使いすぎないように注意する必要があります。また、ゲッターメソッドはパブリックメンバのようにクラスの実装へのアクセスを提供します。OOP の実践では、クラス内のプロパティに直接アクセスすることは推奨されていません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter 및 setter 메소드가 유용하지만 다른 문제 중에서도 특정 상황에서 코드 유지 보수를 더 어렵게 만들 수 있으므로 과도하게 사용하지 않도록주의해야합니다. </font><font style="vertical-align: inherit;">또한 공개 멤버와 같은 클래스 구현에 대한 액세스를 제공합니다. </font><font style="vertical-align: inherit;">OOP 연습은 클래스 내의 속성에 대한 직접 액세스를 권장하지 않습니다.</font></font>
ru: Несмотря на то,что методы getter и setter полезны,следует быть осторожным,чтобы не злоупотреблять ими,так как,помимо прочего,они могут усложнить сопровождение кода в определенных ситуациях.Кроме того,они предоставляют доступ к реализации вашего класса,как и публичные члены.Практика ООП препятствует прямому доступу к свойствам внутри класса.
zh_cn: 尽管getter和setter方法很有用,但你应该注意不要过度使用它们,因为在其他问题中,它们会在某些情况下增加代码维护的难度。另外,它们提供了对你的类实现的访问,就像公共成员一样。OOP实践不鼓励直接访问类内的属性。

source: Even though the getter and setter methods do not add new functionality, we can change our mind come back later to make that method
es: Aunque los métodos de getter y setter no añaden nuevas funcionalidades,podemos cambiar de opinión y volver más tarde para hacer que ese método
ja: ゲッターメソッドとセッターメソッドに新しい機能が追加されていなくても、後から考えを変えて、そのメソッドを
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter 및 setter 메소드가 새로운 기능을 추가하지 않더라도 나중에 다시 해당 메소드를 작성하도록 마음을 바꿀 수 있습니다.</font></font>
ru: Несмотря на то,что методы геттера и сеттера не добавляют новой функциональности,мы можем передумать и вернуться позже,чтобы сделать этот метод
zh_cn: 尽管getter和setter方法并没有增加新的功能,但我们可以改变主意,稍后再来使该方法

source: For example, if <code>foo</code> was public, I could easily set it to <code>null</code> and then someone else could try to call a method on the object. But it's not there anymore! With a <code>setFoo</code> method, I could ensure that <code>foo</code> was never set to <code>null</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, si </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> era p&uacute;blico, podr&iacute;a configurarlo f&aacute;cilmente como </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y luego alguien m&aacute;s podr&iacute;a intentar llamar a un m&eacute;todo en el objeto. </font><font style="vertical-align: inherit;">&iexcl;Pero ya no est&aacute; all&iacute;! </font><font style="vertical-align: inherit;">Con un </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>setFoo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , podr&iacute;a asegurarme de que </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> nunca se configurara como </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">たとえば、</font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">がパブリックの</font><font style="vertical-align: inherit;">場合</font><font style="vertical-align: inherit;">、簡単に</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に設定して、</font><font style="vertical-align: inherit;">他の誰かがオブジェクトのメソッドを呼び出そうとする可能性があります。</font><font style="vertical-align: inherit;">しかし、それはもうありません！</font></font> <code>setFoo</code> の<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法、私がいることを保証でき</font></font> <code>foo</code> が<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に設定されていませんでした</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">예를 들어, </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 public이면 쉽게 </font></font> <code>null</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정하면 </font><font style="vertical-align: inherit;">다른 사람이 객체에서 메서드를 호출하려고 할 수 있습니다. </font><font style="vertical-align: inherit;">그러나 더 이상 존재하지 않습니다! </font></font> <code>setFoo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 메소드를 </font><font style="vertical-align: inherit;">사용하면 </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 </font></font> <code>null</code> 로<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정되지 않았 음을 확인할 수 </font><font style="vertical-align: inherit;">있습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Например, если </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> было общедоступным, я мог бы легко установить его в </font></font> <code>null</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем кто-то другой мог бы попытаться вызвать метод объекта. </font><font style="vertical-align: inherit;">Но его больше нет! </font><font style="vertical-align: inherit;">С помощью </font><font style="vertical-align: inherit;">метода </font></font> <code>setFoo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> я мог убедиться, что </font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> никогда не был установлен на </font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">例如，如果</font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">是公共的，则可以轻松地将其设置为</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，然后其他人可以尝试在对象上调用方法。</font><font style="vertical-align: inherit;">但是现在不存在了！</font><font style="vertical-align: inherit;">使用</font></font> <code>setFoo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法，可以确保</font></font> <code>foo</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">永远不会设置为</font></font> <code>null</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: From a object orientation design standpoint both alternatives can be damaging to the maintenance of the code by weakening the encapsulation of the classes. For a discussion you can look into this excellent article: <a href="http://typicalprogrammer.com/?p=23">http://typicalprogrammer.com/?p=23</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde el punto de vista del dise&ntilde;o de orientaci&oacute;n a objetos, ambas alternativas pueden ser perjudiciales para el mantenimiento del c&oacute;digo al debilitar la encapsulaci&oacute;n de las clases. </font><font style="vertical-align: inherit;">Para una discusi&oacute;n, puede consultar este excelente art&iacute;culo: </font></font><a href="http://typicalprogrammer.com/?p=23"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://typicalprogrammer.com/?p=23</font></font></a>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクト指向の設計の観点からは、クラスのカプセル化を弱めることにより、両方の選択肢がコードのメンテナンスに悪影響を与える可能性があります。</font><font style="vertical-align: inherit;">ディスカッションについては、次の優れた記事を</font><a href="http://typicalprogrammer.com/?p=23"><font style="vertical-align: inherit;">ご覧</font></a><font style="vertical-align: inherit;">ください</font><font style="vertical-align: inherit;">。http</font><font style="vertical-align: inherit;">：</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//typicalprogrammer.com/？p = 23</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 지향 디자인 관점에서 두 가지 대안 모두 클래스의 캡슐화를 약화시켜 코드 유지 관리에 손상을 줄 수 있습니다. </font><font style="vertical-align: inherit;">토론을 위해이 훌륭한 기사를 볼 수 있습니다 : </font></font><a href="http://typicalprogrammer.com/?p=23"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://typicalprogrammer.com/?p=23</font></font></a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">С точки зрения проектно-ориентированного проектирования обе альтернативы могут повредить обслуживанию кода, ослабляя инкапсуляцию классов. </font><font style="vertical-align: inherit;">Для обсуждения вы можете заглянуть в эту прекрасную статью: </font></font><a href="http://typicalprogrammer.com/?p=23"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://typicalprogrammer.com/?p=23</font></font></a>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">从面向对象的设计角度来看，这两种选择都可能通过削弱类的封装来破坏代码的维护。</font><font style="vertical-align: inherit;">要进行讨论，您可以阅读这篇出色的文章：</font><a href="http://typicalprogrammer.com/?p=23"><font style="vertical-align: inherit;">http</font></a><font style="vertical-align: inherit;"> : </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">//typicalprogrammer.com/?p=23</font></font>

source: From an OO theory point of view, getters and setters are useless. The interface of your class is what it does, not what its state is. (If not, you've written the wrong class.) In very simple cases, where what a class does is just, e.g., represent a point in rectangular coordinates,* the attributes are part of the interface; getters and setters just cloud that. But in anything but very simple cases, neither the attributes nor getters and setters are part of the interface.
es: Desde el punto de vista de la teoría de OO,los getters y setters son inútiles.La interfaz de su clase es lo que hace,no su estado.(Si no,has escrito la clase equivocada.)En casos muy simples,donde lo que hace una clase es sólo,por ejemplo,representar un punto en coordenadas rectangulares,*los atributos son parte de la interfaz;los getters y setters sólo nublan eso.Pero en cualquier cosa menos en casos muy simples,ni los atributos ni los getters y setters son parte de la interfaz.
ja: OO理論的には、ゲッターやセッターは無用の長物です。クラスのインターフェイスはそれが何をするかであって、その状態が何であるかではありません。(そうでない場合、あなたは間違ったクラスを書いていることになります。)非常に単純なケースでは、クラスが何をするかというと、例えば点を長方形の座標で表現するだけで、*属性はインターフェースの一部です。しかし、非常に単純なケース以外では、属性もゲッターもセッターもインターフェースの一部ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OO 이론의 관점에서, 게터와 세터는 쓸모가 없습니다. </font><font style="vertical-align: inherit;">클래스의 인터페이스는 상태가 아닌 클래스의 인터페이스입니다. </font><font style="vertical-align: inherit;">(그렇지 않은 경우, 잘못된 클래스를 작성했습니다.) 매우 간단한 경우, 클래스가하는 일이 예를 들어 직사각형 좌표로 점을 나타내는 경우 * 속성은 인터페이스의 일부입니다. </font><font style="vertical-align: inherit;">게터와 세터는 단지 그것을 클라우드합니다. </font><font style="vertical-align: inherit;">그러나 매우 단순한 경우를 제외하고는 속성이나 게터 및 세터가 인터페이스의 일부가 아닙니다.</font></font>
ru: С точки зрения теории OO,геттеры и сеттеры бесполезны.Интерфейс вашего класса-это то,что он делает,а не его состояние.(Если нет,то вы написали не тот класс.)В очень простых случаях,когда то,что делает класс,это просто,например,представляет точку в прямоугольных координатах*,атрибуты являются частью интерфейса;геттеры и сеттеры просто затуманивают это.Но ни в чём,кроме очень простых случаев,ни атрибуты,ни геттеры,ни сеттеры не являются частью интерфейса.
zh_cn: 从OO理论的角度来看,getter和setter是没有用的。你的类的接口是它做什么,而不是它的状态是什么。(如果不是,你写错了类。)在非常简单的情况下,类所做的事情只是,例如,用矩形坐标表示一个点,*属性是接口的一部分;getters和setters只是掩盖了这一点。但在非常简单的情况下,属性和getter和setter都不是接口的一部分。

source: Getter and setter methods are accessor methods, meaning that they are generally a public interface to change private class members. You use getter and setter methods to define a property. You access getter and setter methods as properties outside the class, even though you define them within the class as methods. Those properties outside the class can have a different name from the property name in the class.
es: Los métodos de getter y setter son métodos de acceso,lo que significa que generalmente son una interfaz pública para cambiar los miembros de la clase privada.Los métodos getter y setter se utilizan para definir una propiedad.Accedes a los métodos getter y setter como propiedades fuera de la clase,aunque los definas dentro de la clase como métodos.Esas propiedades fuera de la clase pueden tener un nombre diferente del nombre de la propiedad en la clase.
ja: ゲッターメソッドとセッターメソッドはアクセサメソッドであり、一般的にはプライベートクラスのメンバを変更するためのパブリックインターフェースであることを意味します。ゲッターメソッドとセッターメソッドを使用してプロパティを定義します。ゲッターメソッドとセッターメソッドは、クラス内でメソッドとして定義していても、クラス外のプロパティとしてアクセスします。クラス外のプロパティは、クラス内のプロパティ名とは異なる名前を持つことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getter 및 Setter 메서드는 접근 자 메서드이므로 일반적으로 개인 클래스 멤버를 변경하는 공용 인터페이스입니다. </font><font style="vertical-align: inherit;">getter 및 setter 메소드를 사용하여 특성을 정의하십시오. </font><font style="vertical-align: inherit;">클래스 내에서 메소드로 정의하더라도 getter 및 setter 메소드는 클래스 외부의 특성으로 액세스합니다. </font><font style="vertical-align: inherit;">클래스 외부의 속성은 클래스의 속성 이름과 다른 이름을 가질 수 있습니다.</font></font>
ru: Методы Getter и Setter являются методами доступа,что означает,что они,как правило,являются публичным интерфейсом для изменения членов приватного класса.Вы используете методы getter и setter для определения свойства.Вы получаете доступ к методам getter и setter как к свойствам вне класса,даже если вы определяете их внутри класса как методы.Эти свойства вне класса могут иметь другое имя,чем имя свойства в классе.
zh_cn: getter和setter方法是访问器方法,也就是说,它们一般是改变私有类成员的公共接口。你使用getter和setter方法来定义一个属性。即使你在类内定义了getter和setter方法作为类外的属性来访问,即使你在类内定义了它们作为方法。那些在类外的属性可以有一个与类中的属性名称不同的名称。

source: Getter and setter methods are public interfaces to access private class members.
es: Los métodos Getter y Setter son interfaces públicas para acceder a los miembros de la clase privada.
ja: ゲッターメソッドとセッターメソッドは、プライベートクラスのメンバにアクセスするためのパブリックインターフェースです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getter 및 Setter 메서드는 개인 클래스 멤버에 액세스하기위한 공용 인터페이스입니다.</font></font>
ru: Методы Getter и Setter являются публичными интерфейсами для доступа к закрытым членам класса.
zh_cn: Getter和setter方法是访问私有类成员的公共接口。

source: Getters and setters can allow different access levels - for example the get may be public, but the set could be protected.
es: Los getters y setters pueden permitir diferentes niveles de acceso,por ejemplo,el get puede ser público,pero el set puede ser protegido.
ja: ゲッターとセッターは異なるアクセスレベルを許可することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getter와 Setter는 서로 다른 액세스 수준을 허용 할 수 있습니다. 예를 들어 get은 공개적이지만 집합은 보호 될 수 있습니다.</font></font>
ru: Геттеры и сеттеры могут разрешать различные уровни доступа-например,геттер может быть публичным,но набор может быть защищен.
zh_cn: 获取器和设置器可以允许不同的访问级别--例如,获取器可能是公共的,但设置器可能是受保护的。
