Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Well i just want to add that even if sometimes they are necessary for the encapsulation and security of your variables/objects, if we want to code a real Object Oriented Program, then we need to <strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1">STOP OVERUSING THE ACCESSORS</a></strong>, cause sometimes we depend a lot on them when is not really necessary and that makes almost the same as if we put the variables public.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bueno, solo quiero agregar que incluso si a veces son necesarias para la encapsulaci&oacute;n y la seguridad de sus variables / objetos, si queremos codificar un programa orientado a objetos real, entonces debemos </font></font><strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">DEJAR DE USAR LOS ACCESORIOS</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , porque a veces dependemos mucho sobre ellos cuando no es realmente necesario y eso hace casi lo mismo que si pusi&eacute;ramos las variables p&uacute;blicas.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">まあ、変数/オブジェクトのカプセル化とセキュリティに必要な場合でも、それを追加したいだけです。実際のオブジェクト指向プログラムをコーディングしたい場合は、</font></font><strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ACCESSORSの過剰</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">な使用を</font><strong><font style="vertical-align: inherit;">やめる</font></strong><font style="vertical-align: inherit;">必要があり</font><font style="vertical-align: inherit;">ます。それらが本当に必要でない場合、それらは変数を公開する場合とほとんど同じになります。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">글쎄, 때로는 변수 / 객체의 캡슐화 및 보안에 필요한 경우에도 실제 객체 지향 프로그램을 코딩하려는 경우 </font></font><strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">액세서리 오버 스톱</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 을 </font><strong><font style="vertical-align: inherit;">중지</font></strong><font style="vertical-align: inherit;"> 해야하며 </font><font style="vertical-align: inherit;">때로는 우리가 많이 의존해야합니다. 실제로 필요하지 않을 때 변수를 공개하는 것과 거의 같습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ну, я просто хочу добавить, что даже если иногда они необходимы для инкапсуляции и безопасности ваших переменных / объектов, если мы хотим закодировать реальную объектно-ориентированную программу, нам нужно </font></font><strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ОСТАНОВИТЬ ПРЕОДОЛЕНИЕ АКСЕССОРОВ</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , потому что иногда мы сильно зависимы на них, когда это действительно не нужно, и это делает почти то же самое, как если бы мы сделали переменные общедоступными</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">好吧，我只是想补充一点，即使有时候它们对于变量/对象的封装和安全性是必需的，如果我们想编写一个真正的面向对象程序，那么我们就需要</font></font><strong><a href="http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">停止过度使用这些访问者</font></font></a></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，因为有时我们依赖很多在没有必要的时候，它们几乎和我们将变量公开一样。</font></font>

source: Well, you wouldn't expect that to work, right? You want there to be some kind of sanity check. And worse, what if I never specified the maximum capacity? Oh dear, we have a problem.
es: Bueno,no esperarías que eso funcionara,¿verdad? Quieres que haya algún tipo de control de la cordura.Y peor aún,¿qué pasa si nunca he especificado la capacidad máxima? Oh,querido,tenemos un problema.
ja: それがうまくいくとは思わないだろう?ある種の正気度チェックが欲しいんだろ?さらに悪いことに、もし私が最大容量を指定しなかったら?やれやれ、問題発生だ
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">글쎄, 당신은 작동하지 않을 것입니다, 그렇죠? </font><font style="vertical-align: inherit;">당신은 어떤 종류의 위생 검사를 원합니다. </font><font style="vertical-align: inherit;">그리고 더 이상 최대 용량을 지정하지 않으면 어떻게됩니까? </font><font style="vertical-align: inherit;">오, 문제가 있습니다.</font></font>
ru: Ну,ты же не ожидал,что это сработает,верно? Ты хочешь,чтобы была какая-то проверка на вменяемость.И что еще хуже,что если я никогда не буду указывать максимальную вместимость? О боже,у нас проблема.
zh_cn: 好吧,你不会希望这样做能成功吧?你希望有某种理智的检查。更糟的是,如果我没有指定最大容量呢?哦,亲爱的,我们有一个问题。

source: What happens when I do:
es: Lo que pasa cuando lo hago:
ja: そうするとどうなるのか。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 할 때 어떻게됩니까?</font></font>
ru: Что будет,когда я это сделаю:
zh_cn: 当我这样做的时候会怎么样。

source: What's the advantage of using getters and setters - that only get and set - instead of simply using public fields for those variables?
es: ¿Cuál es la ventaja de usar getters y setters-que sólo get and set-en lugar de usar simplemente campos públicos para esas variables?
ja: ゲッターやセッターを使用する利点は何ですか?
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">변수에 공용 필드를 사용하는 대신 getter 및 setter를 사용하면 얻을 수있는 장점은 무엇입니까?</font></font>
ru: В чем преимущество использования геттеров и сеттеров-которые только получают и устанавливают-вместо того,чтобы просто использовать публичные поля для этих переменных?
zh_cn: 使用getter和setter----只能获取和设置----而不是简单地使用公共字段来处理这些变量有什么好处?

source: When you realize you need to do more than just set and get the value, you can just make the field private, which will instantly tell you where you've directly accessed it.
es: Cuando te das cuenta de que necesitas hacer algo más que establecer y obtener el valor,puedes hacer que el campo sea privado,lo que te dirá instantáneamente dónde has accedido directamente.
ja: 単に値を設定して取得するだけでなく、それ以上のことをする必要があることに気づいたときには、フィールドを非公開にするだけで、直接アクセスした場所がすぐにわかります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">단순히 값을 설정하고 얻는 것 이상의 일을해야한다는 것을 깨닫게되면 필드를 비공개로 설정하면 바로 액세스 한 위치를 즉시 알 수 있습니다.</font></font>
ru: Когда вы понимаете,что вам нужно сделать больше,чем просто установить и получить значение,вы можете просто сделать поле приватным,которое мгновенно скажет вам,где вы получили прямой доступ к нему.
zh_cn: 当你意识到你需要做的不仅仅是设置和获取值的时候,你可以直接把这个字段做成私有化,这样就可以瞬间告诉你直接访问这个字段的位置。

source: When you write classes, you are always encouraged to make as many as possible of your instance variables private and add getter and setter methods accordingly. This is because there are several times when you may not want to let users change certain variables within your classes. For example, if you have a private static method that tracks the number of instances created for a specific class, you don't want a user to modify that counter using code. Only the constructor statement should increment that variable whenever it's called. In this situation, you might create a private instance variable and allow a getter method only for the counter variable, which means users are able to retrieve the current value only by using the getter method, and they won't be able to set new values using the setter method. Creating a getter without a setter is a simple way of making certain variables in your class read-only.
es: Cuando escribes las clases,siempre se te anima a hacer privadas tantas variables de tu instancia como sea posible y añadir métodos de getter y setter en consecuencia.Esto se debe a que hay varias veces en las que puede que no quieras dejar que los usuarios cambien ciertas variables dentro de tus clases.Por ejemplo,si tienes un método estático privado que rastrea el número de instancias creadas para una clase específica,no querrás que un usuario modifique ese contador usando código.Sólo la sentencia constructora debe incrementar esa variable cada vez que se llame.En esta situación,puede crear una variable de instancia privada y permitir un método getter sólo para la variable del contador,lo que significa que los usuarios podrán recuperar el valor actual sólo mediante el método getter,y no podrán establecer nuevos valores mediante el método setter.Crear un getter sin un setter es una forma sencilla de hacer que ciertas variables de su clase sean de sólo lectura.
ja: クラスを書くときには、インスタンス変数をできるだけ多くプライベートにして、それに応じてゲッターメソッドやセッターメソッドを追加することを常に推奨します。これは、ユーザにクラス内の特定の変数を変更させたくない場合がいくつかあるからです。例えば、特定のクラスで作成されたインスタンスの数を追跡するプライベートなスタティックメソッドを持っている場合、ユーザがコードを使ってそのカウンタを変更することは望まないでしょう。コンストラクタ文だけが呼び出されるたびにその変数をインクリメントしなければなりません。このような状況では、プライベートなインスタンス変数を作成し、カウンタ変数に対してのみゲッターメソッドを許可することができます。セッターなしのゲッターを作成することは、クラス内の特定の変数を読み取り専用にする簡単な方法です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스를 작성할 때는 항상 가능한 많은 인스턴스 변수를 전용으로 설정하고 그에 따라 getter 및 setter 메소드를 추가하는 것이 좋습니다. 사용자가 클래스 내에서 특정 변수를 변경하지 못하게하려는 경우가 있기 때문입니다. 예를 들어 특정 클래스에 대해 생성 된 인스턴스 수를 추적하는 전용 정적 메서드가있는 경우 사용자가 코드를 사용하여 해당 카운터를 수정하지 못하게합니다. 생성자 명령문 만 호출 될 때마다 해당 변수를 증가시켜야합니다. 이 경우 개인 인스턴스 변수를 작성하고 카운터 변수에 대해서만 getter 메소드를 허용 할 수 있습니다. 즉, 사용자는 getter 메소드를 사용해야 만 현재 값을 검색 할 수 있으며 새 값을 설정할 수 없습니다. 세터 방법을 사용합니다.setter없이 getter를 작성하는 것은 클래스의 특정 변수를 읽기 전용으로 만드는 간단한 방법입니다.</font></font>
ru: При написании классов всегда рекомендуется делать как можно больше переменных вашего экземпляра приватными и добавлять методы getter и setter соответственно.Это связано с тем,что бывает несколько случаев,когда вы не хотите,чтобы пользователи меняли определенные переменные в ваших классах.Например,если у вас есть приватный статический метод,который отслеживает количество экземпляров,созданных для конкретного класса,вы не хотите,чтобы пользователь изменял этот счетчик с помощью кода.Только оператор конструктора должен увеличивать эту переменную при каждом ее вызове.В этой ситуации вы можете создать приватную переменную экземпляра и разрешить метод getter только для переменной счетчика,то есть пользователи смогут получать текущее значение только с помощью метода getter,и они не смогут устанавливать новые значения с помощью метода setter.Создание геттера без вычислителя-это простой способ сделать определенные переменные в вашем классе доступными только для чтения.
zh_cn: 当你编写类时,我们总是鼓励你尽可能多地将实例变量私有化,并相应地添加getter和setter方法。这是因为有几次你可能不想让用户改变你的类中的某些变量。例如,如果你有一个私有的静态方法来跟踪特定类创建的实例数,你不希望用户使用代码修改该计数器。只有构造函数语句应该在每次调用该变量时,才会递增该变量。在这种情况下,你可能会创建一个私有实例变量,并且只允许对计数器变量使用getter方法,这意味着用户只能通过使用getter方法来获取当前值,而不能使用setter方法来设置新的值。创建一个没有setter的getter方法是一种简单的方法,可以使类中的某些变量只读。

source: Whereas the former takes a lot less boilerplate code.
es: Mientras que el primero requiere mucho menos código de calderilla.
ja: 前者は、ボイラ・プレート・コードを大幅に減らすことができるのに対し、後者は、ボイラ・プレート・コードを大幅に減らすことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">전자는 상용구 코드가 훨씬 적습니다.</font></font>
ru: В то время как первый занимает намного меньше кода шаблона.
zh_cn: 而前者所需要的模板代码要少得多。

source: Why use getters and setters/accessors
es: ¿Por qué usar los getters y settersaccessors
ja: なぜゲッターとセッターアクセサを使うのか
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">게터와 세터 / 액세서를 사용하는 이유</font></font>
ru: Зачем использовать геттеры и сеттер-аксессуары.
zh_cn: 为什么使用getter和setteraccessors?

source: With 10 million cycles, the times are almost the same. Here are 100 thousand (0.1 million) cycles:
es: Con 10 millones de ciclos,los tiempos son casi los mismos.Aquí hay 100 mil (0,1 millones)de ciclos:
ja: 1,000万回のサイクルでは、ほぼ同じ回数になります。ここに10万回(0.1万回)のサイクルがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">천만 사이클로 시간은 거의 같습니다. </font><font style="vertical-align: inherit;">10 만 사이클은 다음과 같습니다.</font></font>
ru: С 10 миллионами циклов время почти одинаково.Здесь 100 тысяч (0,1 миллиона)циклов:
zh_cn: 以1000万个周期计算,时间基本相同。这里是10万(0.1万)周期。

source: You can change the value being set - this is an absolute nightmare when the caller passes you a value that they [shock horror] want you to store AS IS.
es: Puedes cambiar el valor que se establece-esto es una absoluta pesadilla cuando la persona que llama te pasa un valor que ellos [horror de choque]quieren que guardes TAL CUAL.
ja: 設定されている値を変更することができます-これは、呼び出し元が「そのまま保存してほしい」という値を渡したときに絶対的な悪夢です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">설정되는 값을 변경할 수 있습니다. 이것은 발신자가 당신에게 [쇼크 호러]가 당신이있는 그대로 저장하기를 원하는 값을 전달할 때의 악몽입니다.</font></font>
ru: Вы можете изменить установленное значение-это абсолютный кошмар,когда звонящий передает вам значение,которое он [шокирует ужас]хочет,чтобы вы сохранили КАК ЕСТЬ.
zh_cn: 你可以改变被设置的值----当呼叫者传给你一个他们[惊恐]希望你将值存储为AS IS时,这绝对是个噩梦。

source: You can hide the internal representation - fantastic, so you're making sure that all these operations are symmetrical right?
es: Puedes ocultar la representación interna-fantástico,así que te aseguras de que todas estas operaciones son simétricas,¿verdad?
ja: 内部表現を隠すことができます-素晴らしいですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부 표현을 숨길 수 있습니다-환상적이므로 모든 작업이 대칭인지 확인하고 있습니까?</font></font>
ru: Внутреннее представление можно скрыть-фантастика,значит,все эти операции симметричны,верно?
zh_cn: 你可以隐藏内部表象--太棒了,所以你确定这些操作都是对称的吧?

source: You may find more about them in Section 3.5 of <a href="https://www.yegor256.com/elegant-objects.html">Elegant Objects</a> (my book about object-oriented programming).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede encontrar m&aacute;s informaci&oacute;n sobre ellos en la Secci&oacute;n 3.5 de </font></font><a href="https://www.yegor256.com/elegant-objects.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Objetos elegantes</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (mi libro sobre programaci&oacute;n orientada a objetos).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それらについては、</font></font><a href="https://www.yegor256.com/elegant-objects.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">エレガントオブジェクトの</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セクション3.5 </font><font style="vertical-align: inherit;">（オブジェクト指向プログラミングに関する私の本）を参照してください。</font></font>
ko: <font style="vertical-align: inherit;"></font><a href="https://www.yegor256.com/elegant-objects.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Elegant Objects의</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3.5 절 </font><font style="vertical-align: inherit;">(객체 지향 프로그래밍에 관한 저서) </font><font style="vertical-align: inherit;">에서 더 많은 것을 찾을 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вы можете найти больше о них в Разделе 3.5 &laquo; </font></font><a href="https://www.yegor256.com/elegant-objects.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Элегантных объектов&raquo;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (моя книга об объектно-ориентированном программировании).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您可以在</font></font><a href="https://www.yegor256.com/elegant-objects.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Elegant Objects的</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 3.5节</font><font style="vertical-align: inherit;">（我的有关面向对象编程的书）中</font><font style="vertical-align: inherit;">找到有关它们的更多信息</font><font style="vertical-align: inherit;">。</font></font>

source: You see, the getter is (almost) always a bit faster. Then I tried with different numbers of cycles. Instead of 1 million, I used 10 million and 0.1 million. The results:
es: Verás,el receptor es (casi)siempre un poco más rápido.Entonces lo intenté con diferentes números de ciclos.En lugar de 1 millón,usé 10 millones y 0,1 millones.Los resultados:
ja: ご覧の通り、ゲッターの方が(ほとんど)いつも少し速いです。次に、異なるサイクル数で試してみました。100万回の代わりに、1000万回と0.1万回を使ってみました。結果は以下の通りです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">알다시피, 게터는 (거의) 항상 조금 더 빠릅니다. </font><font style="vertical-align: inherit;">그런 다음 다른 횟수의 사이클로 시도했습니다. </font><font style="vertical-align: inherit;">백만 대신에 나는 천만 및 0.1만을 사용했습니다. </font><font style="vertical-align: inherit;">결과 :</font></font>
ru: Видишь ли,геттер (почти)всегда немного быстрее.Потом я попробовал с разным количеством циклов.Вместо 1 миллиона я использовал 10 миллионов и 0,1 миллиона.Результаты:
zh_cn: 你看,getter(几乎)总是快一点。然后,我用不同的循环数进行了尝试。我没有用100万,而是用了1000万和0.1万。结果是:

source: You should use getters and setters when:
es: Deberías usar getters y setters cuando..:
ja: ゲッターとセッターを使うべきなのは、次のようなときです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음과 같은 경우 getter 및 setter를 사용해야합니다.</font></font>
ru: Вы должны использовать геттеры и сеттеры,когда:
zh_cn: 你应该使用getter和setter的时候。

source: You're dealing with something that is conceptually an attribute, but:
es: Estás tratando con algo que es conceptualmente un atributo,pero:
ja: 概念的には属性のようなものを扱っているが
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개념적으로 속성이있는 것을 다루고 있지만,</font></font>
ru: Ты имеешь дело с чем-то,что концептуально является атрибутом,но..:
zh_cn: 你所处理的东西在概念上是一种属性,但。

source: You've insulated your public interface from changes under the sheets - if you were designing an interface and weren't sure whether direct access to something was OK, then you should have kept designing.
es: Si estabas diseñando una interfaz y no estabas seguro de si el acceso directo a algo estaba bien,entonces deberías haber seguido diseñando.
ja: あなたは、シートの下の変更から公開インターフェースを絶縁しました-インターフェースを設計していて、何かに直接アクセスしても良いかどうか分からなかったのであれば、設計を続けるべきでした。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">시트 아래의 변경 사항으로부터 공용 인터페이스를 분리했습니다. 인터페이스를 디자인하고 있고 무언가에 직접 액세스 할 수 있는지 확실하지 않은 경우 계속 디자인해야합니다.</font></font>
ru: Вы изолировали свой публичный интерфейс от изменений под листами-если вы проектировали интерфейс и не были уверены,что прямой доступ к чему-то в порядке,то вам следовало продолжить проектирование.
zh_cn: 你已经将你的公共界面与床单下的变化隔绝了--如果你在设计一个界面时,不确定直接访问某个东西是否可以,那么你应该继续设计。

source: Your language doesn't have properties (or some similar mechanism, like Tcl's variable traces), or
es: Su lenguaje no tiene propiedades (o algún mecanismo similar,como las trazas variables de Tcl),o
ja: あなたの言語はプロパティを持っていない(または、Tclの変数トレースのようないくつかの類似のメカニズム)、または
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언어에 속성 (또는 Tcl의 변수 추적과 같은 유사한 메커니즘)이 없거나</font></font>
ru: Ваш язык не имеет свойств (или какого-то похожего механизма,например,трассы переменных Tcl),или
zh_cn: 你的语言没有属性(或类似的机制,比如Tcl的变量痕迹),或

source: Your language's (or sometimes your framework's) idiomatic conventions encourage getters or setters for this use case.
es: Las convenciones idiomáticas de su lenguaje (o a veces de su marco)alientan a los que se dedican a este caso de uso.
ja: あなたの言語 (あるいはフレームワークの)の慣用句は、このユースケースのためのゲッターやセッターを奨励しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 언어 (또는 경우에 따라 프레임 워크)의 관용적 관습은이 사용 사례에 대해 게터 나 세터를 권장합니다.</font></font>
ru: Идиоматические конвенции вашего языка (а иногда и вашей структуры)поощряют геттеров или сеттеров в этом случае использования.
zh_cn: 你的语言(有时是你的框架)的成语惯例鼓励这种用例的getter或setter。

source: Your language's property support isn't sufficient for this use case, or
es: El apoyo a la propiedad de su idioma no es suficiente para este caso de uso,o
ja: あなたの言語のプロパティのサポートは、この使用ケースでは十分ではありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">귀하의 언어 속성 지원이이 사용 사례에 충분하지 않거나</font></font>
ru: Поддержка собственности на вашем языке не достаточна для этого случая использования,или
zh_cn: 你的语言的属性支持对于这个用例来说并不充分,或者说

source: for members you have only one access specification for both setting and getting
es: para los miembros sólo tienes una especificación de acceso tanto para establecer como para obtener
ja: メンバーの場合、設定と取得の両方でアクセス指定ができるのは1つだけです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">회원의 경우 설정 및 가져 오기에 대한 하나의 액세스 사양 만 있습니다</font></font>
ru: для членов у вас есть только одна спецификация доступа как для настройки,так и для получения
zh_cn: 对于会员来说,你只有一个访问规范,用于设置和获取

source: for reusability
es: para la reutilización
ja: 再利用可能
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">재사용 성</font></font>
ru: для многоразового использования
zh_cn: 可重复使用

source: for setters and getters you can fine tune it and define it separately
es: para los setters y getters puedes afinarlo y definirlo por separado
ja: セッターとゲッターについては、微調整して個別に定義することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세터와 게터의 경우 세밀하게 조정하고 별도로 정의 할 수 있습니다.</font></font>
ru: для сеттеров и геттеров можно тонко настроить и определить его отдельно.
zh_cn: 对于setter和getter,你可以对其进行微调并单独定义。

source: is any worse than:
es: es peor que:
ja: よりも悪いことはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다음보다 더 나쁘다 :</font></font>
ru: хуже,чем:
zh_cn: 是什么都不如。

source: safer; and
es: más seguro;y
ja: より安全に。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 안전한; </font><font style="vertical-align: inherit;">과</font></font>
ru: безопаснее;и
zh_cn: 更安全;以及

source: to perform validation in later stages of programming
es: para realizar la validación en etapas posteriores de la programación
ja: プログラミングの後の段階で検証を行うために
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">프로그래밍의 후기 단계에서 검증을 수행</font></font>
ru: проводить валидацию на более поздних этапах программирования
zh_cn: 以便在后期的程序设计中进行验证
