Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Improved interoperability with libraries that are designed to operate against property getter/setters - Mocking, Serialization, and WPF come to mind.
es: La interoperabilidad mejorada con las bibliotecas que están diseñadas para operar en contra de las propiedades de los gettersetters-Burla,Serialización y WPF vienen a la mente.
ja: プロパティゲッターセッターに対して動作するように設計されたライブラリとの相互運用性が向上しました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 게터 / 세터에 대해 작동하도록 설계된 라이브러리와의 향상된 상호 운용성-Mocking, Serialization 및 WPF가 떠 오릅니다.</font></font>
ru: Улучшенная совместимость с библиотеками,которые предназначены для работы с геттерсеттерами свойств-на ум приходят насмешки,сериализация и WPF.
zh_cn: 改进了与那些被设计成针对属性获取器的库的互操作性-Mocking、Serialization和WPF都会想到。

source: In a pure object-oriented world getters and setters is a <strong>terrible anti-pattern</strong>. Read this article: <a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html">Getters/Setters. Evil. Period</a>. In a nutshell, they encourage programmers to think about objects as of data structures, and this type of thinking is pure procedural (like in COBOL or C). In an object-oriented language there are no data structures, but only objects that expose behavior (not attributes/properties!)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En un mundo puro orientado a objetos, los captadores y establecedores son un </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">antipatr&oacute;n terrible</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Lea este art&iacute;culo: </font></font><a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getters / Setters. </font><font style="vertical-align: inherit;">Mal. </font><font style="vertical-align: inherit;">Periodo</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">En pocas palabras, alientan a los programadores a pensar en los objetos como estructuras de datos, y este tipo de pensamiento es puramente de procedimiento (como en COBOL o C). </font><font style="vertical-align: inherit;">En un lenguaje orientado a objetos no hay estructuras de datos, sino solo objetos que exponen el comportamiento (&iexcl;no atributos / propiedades!)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">純粋なオブジェクト指向の世界では、ゲッターとセッターは</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ひどいアンチパターン</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">です。</font><font style="vertical-align: inherit;">この記事を読む：</font></font><a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッター/セッター。</font><font style="vertical-align: inherit;">悪の。</font><font style="vertical-align: inherit;">期間</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">簡単に言えば、データ構造としてオブジェクトについて考えることをプログラマに奨励し、このタイプの考え方は純粋な手続き型（COBOLやCのような）です。</font><font style="vertical-align: inherit;">オブジェクト指向言語では、データ構造はなく、動作を公開するオブジェクトのみです（属性/プロパティではありません！）</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">순수한 객체 지향 세계에서 게터와 세터는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">끔찍한 안티 패턴</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 입니다. </font></font><a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getters / Setters</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 기사를 읽으십시오 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">악. </font><font style="vertical-align: inherit;">기간</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">간단히 말해서 프로그래머는 데이터 구조를 기준으로 객체에 대해 생각하도록 장려하며 이러한 유형의 사고는 순수한 절차 적입니다 (COBOL 또는 C와 같이). </font><font style="vertical-align: inherit;">객체 지향 언어에는 데이터 구조가 없지만 동작을 노출하는 객체 만 있습니다 (속성 / 속성이 아님).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В чистом объектно-ориентированном мире геттеры и сеттеры это </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">страшный анти-паттерн</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Прочитайте эту статью: </font></font><a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getters / Setters. </font><font style="vertical-align: inherit;">Злой. </font><font style="vertical-align: inherit;">Период</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Короче говоря, они поощряют программистов думать об объектах как о структурах данных, и этот тип мышления является чисто процедурным (как в COBOL или C). </font><font style="vertical-align: inherit;">В объектно-ориентированном языке нет структур данных, а есть только объекты, демонстрирующие поведение (не атрибуты / свойства!)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在纯粹的面向对象的世界中，吸气剂和吸气剂是一种</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">可怕的反模式</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">阅读本文：</font></font><a href="http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getters / Setters。</font><font style="vertical-align: inherit;">邪恶。</font><font style="vertical-align: inherit;">期间</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">简而言之，他们鼓励程序员考虑数据结构中的对象，而这种类型的考虑是纯过程性的（例如在COBOL或C中）。</font><font style="vertical-align: inherit;">在面向对象的语言中，没有数据结构，只有暴露行为的对象（没有属性/属性！）</font></font>

source: In an object oriented language the methods, and their access modifiers, declare the interface for that object. Between the constructor and the accessor and mutator methods it is possible for the developer to control access to the internal state of an object. If the variables are simply declared public then there is no way to regulate that access. And when we are using setters we can restrict the user for the input we need. Mean the feed for that very variable will come through a proper channel and the channel is predefined by us. So it's safer to use setters.
es: En un lenguaje orientado a objetos,los métodos,y sus modificadores de acceso,declaran la interfaz para ese objeto.Entre el constructor y el acceso y los métodos mutadores es posible para el desarrollador controlar el acceso al estado interno de un objeto.Si las variables se declaran simplemente públicas,entonces no hay forma de regular ese acceso.Y cuando estamos usando los constructores podemos restringir al usuario para la entrada que necesitamos.Significa que la alimentación de esa misma variable vendrá a través de un canal apropiado y el canal está predefinido por nosotros.Así que es más seguro usar reguladores.
ja: オブジェクト指向言語では、メソッドとそのアクセス修飾子がそのオブジェクトのインターフェイスを宣言します。コンストラクタとアクセサメソッドとミューテータメソッドの間で、 開発者はオブジェクトの内部状態へのアクセスを制御することができます。もし変数が単に公開されているだけならば、そのアクセスを制御する方法はありません。また、セッターを使用している場合は、必要な入力に対してユーザーを制限することができます。つまり、その変数へのフィードは適切なチャネルを経由して送られてくることになり、チャネルは事前に定義されています。そのため、セッターを使った方が安全です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">객체 지향 언어에서 메소드 및 액세스 수정자는 해당 객체의 인터페이스를 선언합니다. </font><font style="vertical-align: inherit;">생성자와 액세서 및 뮤 테이터 메소드 사이에서 개발자가 오브젝트의 내부 상태에 대한 액세스를 제어 할 수 있습니다. </font><font style="vertical-align: inherit;">변수가 단순히 public으로 선언되면 해당 액세스를 조절할 방법이 없습니다. </font><font style="vertical-align: inherit;">그리고 setter를 사용할 때 필요한 입력으로 사용자를 제한 할 수 있습니다. </font><font style="vertical-align: inherit;">해당 변수에 대한 피드가 올바른 채널을 통해 전달되고 채널이 Google에 의해 사전 정의되어 있음을 의미합니다. </font><font style="vertical-align: inherit;">따라서 세터를 사용하는 것이 더 안전합니다.</font></font>
ru: На объектно-ориентированном языке методы и модификаторы доступа к ним объявляют интерфейс для этого объекта.Между конструктором и методами доступа и мутаторами разработчик может контролировать доступ к внутреннему состоянию объекта.Если переменные просто объявлены публично,то нет никакого способа регулировать этот доступ.А когда мы используем сеттеры,мы можем ограничить пользователя на нужный нам вход.Это означает,что входная информация для этой самой переменной будет поступать по соответствующему каналу,а канал предопределен нами.Так что безопаснее использовать сеттеры.
zh_cn: 在面向对象语言中,方法和它们的访问修饰符声明了对象的接口。在构造函数和访问器和突变器方法之间,开发者可以控制对对象内部状态的访问。如果简单地声明变量是公有的,那么就没有办法控制这种访问。而当我们使用setter时,我们可以限制用户对我们需要的输入进行限制。这意味着这个变量的输入将通过一个适当的通道,而这个通道是由我们预定义的。所以,使用setter是比较安全的。

source: In languages which don't support "properties" (C++, Java) or require recompilation of clients when changing fields to properties (C#), using get/set methods is easier to modify. For example, adding validation logic to a setFoo method will not require changing the public interface of a class.
es: En los lenguajes que no soportan "propiedades" (C++,Java)o que requieren la recompilación de los clientes al cambiar los campos a propiedades (C#),el uso de métodos de getset es más fácil de modificar.Por ejemplo,añadir una lógica de validación a un método setFoo no requerirá cambiar la interfaz pública de una clase.
ja: プロパティ」をサポートしていない言語(C++、Java)や、フィールドをプロパティに変更する際にクライアントの再コンパイルが必要な言語(C#)では、getetメソッドを使用した方が修正が容易です。例えば、setFooメソッドにバリデーションロジックを追加しても、クラスのパブリックインターフェースを変更する必要はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"속성"(C ++, Java)을 지원하지 않거나 필드를 속성 (C #)으로 변경할 때 클라이언트를 다시 컴파일해야하는 언어에서는 get / set 메소드를 사용하는 것이 더 쉽습니다. </font><font style="vertical-align: inherit;">예를 들어, setFoo 메소드에 유효성 검증 로직을 추가하면 클래스의 공용 인터페이스를 변경할 필요가 없습니다.</font></font>
ru: В языках,которые не поддерживают "свойства" (C++,Java)или требуют перекомпиляции клиентов при изменении полей на свойства (C#),использование методов getet легче модифицировать.Например,добавление логики валидации в метод setFoo не потребует изменения публичного интерфейса класса.
zh_cn: 在不支持 "属性 "的语言中(C++、Java),或者在将字段改成属性时需要重新编译客户端(C#),使用getset方法更容易修改。例如,在setFoo方法中添加验证逻辑,就不需要改变类的公共接口。

source: In languages which support "real" properties (Python, Ruby, maybe Smalltalk?) there is no point to get/set methods.
es: En los lenguajes que soportan propiedades "reales" (Python,Ruby,tal vez Smalltalk?)no tiene sentido usar métodos de getset.
ja: リアル」なプロパティをサポートする言語(Python、Ruby、Smalltalkかも?)では、getetメソッドは意味がありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"실제"속성을 지원하는 언어 (Python, Ruby, 아마도 Smalltalk?)에서는 메소드를 가져 오거나 설정할 필요가 없습니다.</font></font>
ru: В языках,которые поддерживают "реальные" свойства (Python,Ruby,может быть Smalltalk?),нет смысла приобретать методы.
zh_cn: 在支持 "真实 "属性的语言中(Python,Ruby,也许是Smalltalk?),没有getset方法的意义。

source: In layman's terms
es: En términos simples
ja: 平たく言えば
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">평신도의 관점에서</font></font>
ru: В дилетантском плане
zh_cn: 通俗点说,就是

source: In other words, the only way you can specify a field in an interface is by providing a method for writing a new value and a method for reading the current value.
es: En otras palabras,la única forma en que se puede especificar un campo en una interfaz es proporcionando un método para escribir un nuevo valor y un método para leer el valor actual.
ja: つまり、インターフェースでフィールドを指定するには、新しい値を書き込むためのメソッドと、現在の値を読み込むためのメソッドを提供するしかありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, 인터페이스에서 필드를 지정할 수있는 유일한 방법은 새 값을 작성하는 방법과 현재 값을 읽는 방법을 제공하는 것입니다.</font></font>
ru: Другими словами,единственный способ указать поле в интерфейсе-это указать метод записи нового значения и метод чтения текущего значения.
zh_cn: 换句话说,在接口中指定一个字段的唯一方法就是提供一个写新值的方法和一个读取当前值的方法。

source: Inheriting this class, you can override default functionality - in other words you can REALLY confuse callers by not only hiding the implementation but making it inconsistent.
es: Heredando esta clase,puedes anular la funcionalidad por defecto-en otras palabras,puedes confundir REALMENTE a los llamantes no sólo ocultando la implementación sino haciéndola inconsistente.
ja: このクラスを継承することで、デフォルトの機能をオーバーライドすることができます。言い換えれば、実装を隠すだけでなく一貫性を持たせることで、呼び出し元を本当に混乱させることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 클래스를 상속하면 기본 기능을 재정의 할 수 있습니다. 즉, 구현을 숨기고 일관성이 없어서 호출자를 혼란스럽게 할 수 있습니다.</font></font>
ru: Унаследовав этот класс,вы можете переопределить функциональность по умолчанию-другими словами,вы можете НЕОБХОДИМО запутать вызывающих абонентов,не только скрыв реализацию,но и сделав ее непоследовательной.
zh_cn: 继承这个类,你可以覆盖默认的功能--换句话说,你不仅可以通过隐藏实现,还可以使其不一致,从而使调用者感到困惑。

source: Instead of
es: En lugar de
ja: の代わりに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대신에</font></font>
ru: вместо
zh_cn: 而不是

source: Instead of doing this, we can create a bean <code>class(Person)</code> with getter and setter methods. So tomorrow we can just create objects of this Bean <code>class(Person class)</code> whenever we need to add a new person (see the figure). Thus we are reusing the fields and methods of bean class, which is much better.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En lugar de hacer esto, podemos crear una </font></font> <code>class(Person)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean </font><font style="vertical-align: inherit;">(Persona)</font><font style="vertical-align: inherit;"> con los m&eacute;todos getter y setter. </font><font style="vertical-align: inherit;">As&iacute; que ma&ntilde;ana podemos crear objetos de esta </font></font> <code>class(Person class)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean </font><font style="vertical-align: inherit;">(clase Persona)</font><font style="vertical-align: inherit;"> siempre que necesitemos agregar una nueva persona (ver la figura). </font><font style="vertical-align: inherit;">Por lo tanto, estamos reutilizando los campos y m&eacute;todos de la clase bean, que es mucho mejor.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">これを行う代わりに</font><font style="vertical-align: inherit;">、getterメソッドとsetterメソッド</font><font style="vertical-align: inherit;">を使用してBean </font></font> <code>class(Person)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を</font><font style="vertical-align: inherit;">作成できます</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">明日は</font><font style="vertical-align: inherit;">、新しい人物を追加する必要があるときはいつでも</font><font style="vertical-align: inherit;">、このBean </font></font> <code>class(Person class)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">オブジェクトを作成できます</font><font style="vertical-align: inherit;">（図を参照）。</font><font style="vertical-align: inherit;">したがって、Beanクラスのフィールドとメソッドを再利用しています。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이를 수행하는 대신 </font><font style="vertical-align: inherit;">getter 및 setter 메소드를 </font><font style="vertical-align: inherit;">사용하여 Bean </font></font> <code>class(Person)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">작성할 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">그래서 내일 우리는 </font><font style="vertical-align: inherit;">새로운 사람을 추가해야 할 때마다이 </font><font style="vertical-align: inherit;">Bean </font></font> <code>class(Person class)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 객체를 만들 수 있습니다 </font><font style="vertical-align: inherit;">(그림 참조). </font><font style="vertical-align: inherit;">따라서 빈 클래스의 필드와 메소드를 재사용하는 것이 훨씬 좋습니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вместо этого мы можем создать </font></font> <code>class(Person)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> bean </font><font style="vertical-align: inherit;">(Person)</font><font style="vertical-align: inherit;"> с методами getter и setter. </font><font style="vertical-align: inherit;">Поэтому завтра мы можем просто создавать объекты этого </font></font> <code>class(Person class)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Bean </font><font style="vertical-align: inherit;">(класса Person)</font><font style="vertical-align: inherit;"> всякий раз, когда нам нужно добавить нового человека (см. Рисунок). </font><font style="vertical-align: inherit;">Таким образом, мы повторно используем поля и методы класса bean, что намного лучше.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代替执行此操作，我们可以</font><font style="vertical-align: inherit;">使用getter和setter方法</font><font style="vertical-align: inherit;">创建一个bean </font></font> <code>class(Person)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，明天我们</font><font style="vertical-align: inherit;">只要有需要添加新人员时，</font><font style="vertical-align: inherit;">就可以创建Bean </font></font> <code>class(Person class)</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">对象</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">因此，我们正在重用bean类的字段和方法，这要好得多。</font></font>

source: Insulating your public interface from change - allowing the public interface to remain constant while the implementation changes without affecting existing consumers.
es: Aislando su interfaz pública del cambio-permitiendo que la interfaz pública permanezca constante mientras la implementación cambia sin afectar a los consumidores existentes.
ja: パブリック インターフェイスの変更からの絶縁-既存の消費者に影響を与えることなく、実装が変更されてもパブリック インターフェイスを一定に保つことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">퍼블릭 인터페이스를 변경으로부터 보호-기존 소비자에게 영향을주지 않고 구현이 변경되는 동안 퍼블릭 인터페이스를 일정하게 유지할 수 있습니다.</font></font>
ru: Изоляция вашего публичного интерфейса от изменений-позволяет публичному интерфейсу оставаться постоянным,в то время как внедрение меняется,не затрагивая существующих потребителей.
zh_cn: 使你的公共接口不受变化的影响----让公共接口保持不变,而不影响现有的消费者。

source: It can be useful for lazy-loading. Say the object in question is stored in a database, and you don't want to go get it unless you need it. If the object is retrieved by a getter, then the internal object can be null until somebody asks for it, then you can go get it on the first call to the getter.
es: Puede ser útil para la carga perezosa.Digamos que el objeto en cuestión está almacenado en una base de datos,y no quieres ir a buscarlo a menos que lo necesites.Si el objeto es recuperado por un getter,entonces el objeto interno puede ser nulo hasta que alguien lo pida,entonces puedes ir a buscarlo en la primera llamada al getter.
ja: これは、レイジーロードに便利です。問題のオブジェクトがデータベースに保存されていて、それを必要としない限り取りに行きたくないとします。オブジェクトがゲッターによって取得されている場合、誰かがそれを要求するまで内部オブジェクトはnullにすることができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지연 로딩에 유용 할 수 있습니다. </font><font style="vertical-align: inherit;">문제의 객체가 데이터베이스에 저장되어 있고 필요하지 않으면 가져 가고 싶지 않다고 가정하십시오. </font><font style="vertical-align: inherit;">getter가 객체를 검색하면 누군가가 요청할 때까지 내부 객체가 null 일 수 있습니다. 그러면 getter를 처음 호출 할 때 객체를 가져올 수 있습니다.</font></font>
ru: Он может быть полезен при ленивой загрузке.Скажем,объект хранится в базе данных,и вы не захотите идти за ним,если он вам не нужен.Если объект извлекается геттером,то внутренний объект может быть нулевым до тех пор,пока кто-то его не попросит,тогда вы можете пойти и получить его при первом же вызове геттера.
zh_cn: 它可以用于偷懒加载。假设这个对象存储在数据库中,除非你需要,否则你不想去获取它。如果这个对象是由getter检索的,那么内部的对象可以是空的,直到有人问起它,然后你就可以在第一次调用getter时去获取它。

source: It gives you many benefits, one of which being that you can change the implementation of the getter/setter behind the scenes but any consumer of that value will continue to work as long as the data type remains the same.
es: Le da muchos beneficios,uno de los cuales es que puede cambiar la implementación del "gettersetter" entre bastidores,pero cualquier consumidor de ese valor seguirá trabajando mientras el tipo de datos siga siendo el mismo.
ja: これは多くの利点を提供します。その一つは、ゲッターセッターの実装を裏で変更することができるということですが、データ型が同じである限り、その値のコンシューマは動作し続けます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 많은 이점을 제공합니다. 그중 하나는 배후에서 게터 / 세터의 구현을 변경할 수 있지만 그 값을 가진 소비자는 데이터 유형이 동일하게 유지되는 한 계속 작동합니다.</font></font>
ru: Это дает вам много преимуществ,одним из которых является то,что вы можете изменить реализацию геттерсеттера за кулисами,но любой потребитель этой ценности будет продолжать работать до тех пор,пока тип данных остается прежним.
zh_cn: 它给你带来了很多好处,其中之一就是你可以在幕后改变取值器的实现,但只要数据类型不变,该值的任何消费者都会继续工作。
