Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Put another way: If you believe that consumers of your class shouldn't even know that you have a <code>spam</code> attribute, much less be able to change it willy-nilly, then giving them a <code>set_spam</code> method is the last thing you want to do.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dicho de otra manera: si crees que los consumidores de tu clase ni siquiera deber&iacute;an saber que tienes un </font><font style="vertical-align: inherit;">atributo de </font></font> <code>spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , mucho menos ser capaz de cambiarlo de forma involuntaria, entonces lo </font><font style="vertical-align: inherit;">&uacute;ltimo que quieres hacer es </font><font style="vertical-align: inherit;">darles un </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>set_spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">別の言い方をすると、あなたのクラスのコンシューマーがあなたが</font></font> <code>spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性</font><font style="vertical-align: inherit;">を持っていることすら知らないはずであると信じているなら</font><font style="vertical-align: inherit;">、はるかにそれを</font></font> <code>set_spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">に変更することができず、彼らに</font><font style="vertical-align: inherit;">set_spam</font><font style="vertical-align: inherit;">メソッド</font><font style="vertical-align: inherit;">を与える</font><font style="vertical-align: inherit;">ことはあなたがしたい最後のことです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">다른 방법을 넣어 : 당신이 가지고 클래스의 소비자가 알지도해야한다고 여겨지는 경우 </font></font> <code>spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 속성을 훨씬 덜 다음 그들에게주는 다짜고짜를 변경할 수 </font></font> <code>set_spam</code> 의<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 방법은 당신이 원하는 마지막 일이다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другими словами: если вы считаете, что потребители вашего класса даже не должны знать, что у вас есть </font><font style="vertical-align: inherit;">атрибут </font></font> <code>spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , тем более, что вы можете изменить его </font></font> <code>set_spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , тогда предоставление им </font><font style="vertical-align: inherit;">метода </font><font style="vertical-align: inherit;">set_spam</font><font style="vertical-align: inherit;"> - это последнее, что вы хотите сделать.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">换句话说，如果您认为类的使用者甚至不应该知道您拥有</font></font> <code>spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">属性，那么就很难随意更改它，那么给他们提供</font></font> <code>set_spam</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">方法是您要做的最后一件事。</font></font>

source: Say you're looking through hundreds of lines of code and you come across this:
es: Digamos que estás buscando a través de cientos de líneas de código y te encuentras con esto:
ja: 何百行ものコードに目を通していて、これに出くわしたとしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">수백 줄의 코드를 살펴보고 다음과 같은 내용을 접한다고 가정 해보십시오.</font></font>
ru: Скажем,что ты просматриваешь сотни строк кода и сталкиваешься с этим:
zh_cn: 说你在翻阅几百行代码的时候,遇到了这个。

source: So I program as follows (assuming an "agile" type approach -- ie when I write code not knowing <em>exactly</em> what it will be doing/don't have time or experience to plan an elaborate waterfall style interface set):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">As&iacute; que programo de la siguiente manera (suponiendo un enfoque de tipo "&aacute;gil", es decir, cuando escribo c&oacute;digo sin saber </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">exactamente</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lo que har&aacute; / no tengo tiempo o experiencia para planificar un elaborado conjunto de interfaces de estilo cascada):</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">したがって、私は次のようにプログラムします（「アジャイル」タイプのアプローチを想定しています。つまり、コードが</font><font style="vertical-align: inherit;">何をするの</font><font style="vertical-align: inherit;">か</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">正確に</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">わからない場合/手の込んだウォーターフォールスタイルのインターフェイスセットを計画する時間や経験がない場合）：</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 다음과 같이 프로그래밍합니다 ( "민첩한"유형 접근을 가정합니다. 즉, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">정확히</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 어떤 폭포 스타일 인터페이스 세트를 계획 할 시간이나 경험이 없는지 </font><em><font style="vertical-align: inherit;">정확히</font></em><font style="vertical-align: inherit;"> 알 </font><em><font style="vertical-align: inherit;">수</font></em><font style="vertical-align: inherit;"> 없는 코드를 작성할 때 </font><font style="vertical-align: inherit;">) :</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поэтому я программирую следующим образом (предполагая подход &laquo;гибкого&raquo; типа - то есть когда я пишу код, не зная </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">точно,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> что он будет делать / не имеет времени или опыта для планирования сложного набора интерфейсов стилей водопада):</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因此，我按以下方式进行编程（假设采用&ldquo;敏捷&rdquo;类型的方法-即，当我编写的代码不</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">完全</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">知道将要做什么/没有时间或经验来计划精心设计的瀑布样式接口集时）：</font></font>

source: So the getter saves me from trying to figure out, on each child page, what I will need. If I need it, I call the getter, and it goes to find it for me if I don't already have it.
es: Así que el getter me salva de tratar de averiguar,en cada página de niños,lo que necesitaré.Si lo necesito,llamo al buscador,y va a buscarlo por mí si no lo tengo ya.
ja: そのため、ゲッターを使えば、子ページごとに必要なものを探す手間が省けます。必要なものがあればゲッターを呼び、まだ持っていない場合はゲッターが探してくれます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 getter는 각 자식 페이지에서 필요한 내용을 파악하지 않아도됩니다. </font><font style="vertical-align: inherit;">필요한 경우 getter를 호출하고 아직없는 경우이를 찾으러갑니다.</font></font>
ru: Так что геттер спасает меня от попыток выяснить на каждой детской странице,что мне понадобится.Если она мне понадобится,я звоню геттеру,и он идет искать ее для меня,если у меня ее еще нет.
zh_cn: 所以,getter让我不用在每一个子页面上想办法找出我需要的东西。如果我需要的话,我可以调用getter,如果我还没有,它就会帮我找到它。

source: So this is very rarely a general OO question; it's a language-specific question, with different answers for different languages (and different use cases).
es: Por lo tanto,muy raramente se trata de una pregunta general de OO;es una pregunta específica del idioma,con diferentes respuestas para diferentes idiomas (y diferentes casos de uso).
ja: つまり、これは一般的な OO の質問ではなく、言語固有の質問であり、異なる言語(および異なるユースケース)に対して異なる答えを持っています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 이것은 일반적인 OO 질문은 거의 없습니다. </font><font style="vertical-align: inherit;">다른 언어 (및 다른 사용 사례)에 대해 다른 답변을 가진 언어 별 질문입니다.</font></font>
ru: Таким образом,это очень редко является общим вопросом OO;это языковой вопрос,с разными ответами для разных языков (и разных случаев использования).
zh_cn: 所以这很少是一个一般的OO问题,这是一个针对语言的问题,不同的语言(和不同的用例)有不同的答案。

source: So you have:
es: Así que lo has hecho:
ja: そうなんですね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그래서 당신은 :</font></font>
ru: Так и есть:
zh_cn: 所以你有。

source: So, now that you broke the contract, changing every file in the codebase is something you should want to do, not avoid. If you avoid it you're making the assumption that all the code assumed the contract for those methods was different.
es: Así que,ahora que has roto el contrato,cambiar cada archivo de la base de código es algo que deberías querer hacer,no evitar.Si lo evitas estás haciendo la suposición de que todo el código asumió que el contrato para esos métodos era diferente.
ja: 契約を破ってしまったので、コードベース内のすべてのファイルを変更することは避けたいことではありません。もしそれを避けるのであれば、すべてのコードがそれらのメソッドの契約が異なると仮定していることになります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">따라서 계약을 파기 했으므로 코드베이스의 모든 파일을 변경하는 것은 피해야 할 일입니다. </font><font style="vertical-align: inherit;">피하지 않으면 모든 코드가 해당 메소드의 계약이 다르다고 가정합니다.</font></font>
ru: Итак,теперь,когда вы нарушили договор,изменение каждого файла в кодебазе-это то,чего вы должны хотеть,а не избегать.Если вы избегаете этого,вы делаете предположение,что все коды предполагали,что контракт на эти методы был разным.
zh_cn: 所以,现在你既然打破了契约,改变代码库中的每一个文件都是你应该想做的事情,而不是回避。如果你避免了,你就等于做了一个假设,所有的代码都假设那些方法的契约是不同的。

source: Some libraries expect this, but not many - reflection, serialization, mock objects all work just fine with public fields.
es: Algunas bibliotecas esperan esto,pero no muchas:la reflexión,la serialización,los objetos de burla funcionan bien en los campos públicos.
ja: いくつかのライブラリはこれを期待していますが、多くはありません-リフレクション、シリアライズ、モックオブジェクトはすべてパブリックフィールドで正常に動作します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">일부 라이브러리는 이것을 기대하지만 반사, 직렬화, 모의 객체는 모두 공공 장소에서 잘 작동합니다.</font></font>
ru: Некоторые библиотеки ожидают этого,но не многие-отражение,сериализация,насмешка над объектами-все это прекрасно работает с публичными полями.
zh_cn: 有些库期望这样做,但不是很多----反射、序列化、模拟对象都可以在公共字段中正常工作。

source: Suppose we have an Employee class:
es: Supongamos que tenemos una clase para empleados:
ja: Employeeクラスがあるとします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Employee 클래스가 있다고 가정하십시오.</font></font>
ru: Предположим,у нас есть класс для сотрудников:
zh_cn: 假设我们有一个员工类。

source: Suppose we need to store the details of this <code>Person</code>. This <code>Person</code> has the fields <code>name</code>, <code>age</code> and <code>sex</code>. Doing this involves creating methods for <code>name</code>, <code>age</code> and <code>sex</code>. Now if we need create another person, it becomes necessary to create the methods for <code>name</code>, <code>age</code>, <code>sex</code> all over again.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Supongamos que necesitamos almacenar los detalles de esta </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Esta </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tiene los campos </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>sex</code> o<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Hacer esto implica crear m&eacute;todos para </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>sex</code> o<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Ahora, si necesitamos crear otra persona, es necesario crear los m&eacute;todos para </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>sex</code> o<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> nuevamente.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">この</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の詳細を保存する必要があるとし</font><font style="vertical-align: inherit;">ます。この</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">フィールドがあります</font><font style="vertical-align: inherit;">。これを行うには、</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを作成する必要が</font><font style="vertical-align: inherit;">あり</font><font style="vertical-align: inherit;">ます。ここで別の人を作成する必要がある場合は、</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">メソッドを</font><font style="vertical-align: inherit;">もう一度</font><font style="vertical-align: inherit;">作成する必要があります</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 세부 사항을 저장해야한다고 가정하십시오 </font><font style="vertical-align: inherit;">. 이 </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 필드 </font><font style="vertical-align: inherit;">를가</font><font style="vertical-align: inherit;"> 집니다. 이를 위해서는 </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 방법을 만들어야합니다 </font><font style="vertical-align: inherit;">. 이제 다른 사람을 만들어야한다면 </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sex</code> 에<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 대한 방법을 </font><font style="vertical-align: inherit;">다시 </font><font style="vertical-align: inherit;">만들어야 </font><font style="vertical-align: inherit;">합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Предположим, нам нужно хранить данные этого </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Этот </font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> имеет </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> поля </font><font style="vertical-align: inherit;">, </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Это включает в себя создание методов для </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Теперь, если нам нужно создать другого человека, становится необходимым снова и снова создавать методы для </font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">假设我们需要存储此</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的详细信息</font><font style="vertical-align: inherit;">。此</font></font> <code>Person</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">具有</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。这样做涉及创建</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。现在，如果我们需要创建另一个人，则有必要重新创建</font></font> <code>name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>age</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>sex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的方法</font><font style="vertical-align: inherit;">。</font></font>

source: Thanks, that really clarified my thinking. Now here is (almost) 10 (almost) good reasons NOT to use getters and setters:
es: Gracias,eso realmente aclaró mi pensamiento.Ahora aquí hay (casi)10 (casi)buenas razones para NO usar getters y setters:
ja: ありがとうございます。さて、ゲッターとセッターを使わない理由を10個(ほぼ)紹介します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">고마워, 정말 내 생각을 명확히했다. </font><font style="vertical-align: inherit;">이제 getter와 setter를 사용하지 말아야 할 10 가지 이유가 있습니다.</font></font>
ru: Спасибо,это действительно прояснило мои мысли.Теперь вот (почти)10 (почти)веских причин НЕ использовать геттеры и сеттеры:
zh_cn: 谢谢,这真的澄清了我的想法。现在这里有10个(几乎)不使用getter和setter的好理由。
