Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>Setter Methods:</strong><em>We can modify private fields.</em>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todos de Setter: </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">podemos modificar campos privados.</font></font></em>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッターメソッド：</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プライベートフィールドを変更できます。</font></font></em>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세터 메소드 : </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개인 필드를 수정할 수 있습니다.</font></font></em>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Методы установки: </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">мы можем изменять приватные поля.</font></font></em>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设置方法：</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以修改私有字段。</font></font></em>

source: <strong>There are actually <em>many good reasons</em> to consider using accessors</strong> rather than directly exposing fields of a class - beyond just the argument of encapsulation and making future changes easier.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En realidad, hay </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">muchas buenas razones</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para considerar el uso de accesores en</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de exponer directamente los campos de una clase, m&aacute;s all&aacute; del argumento de encapsulaci&oacute;n y facilitar los cambios futuros.</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実際に</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、クラスのフィールドを直接公開するのではなく、</font><strong><font style="vertical-align: inherit;">アクセサーの使用を検討する</font></strong><strong><em><font style="vertical-align: inherit;">多くの正当な理由</font></em></strong><strong><font style="vertical-align: inherit;">があります</font></strong><font style="vertical-align: inherit;"> -カプセル化の議論だけでなく、将来の変更を容易にすることもあります。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">실제로이 있습니다 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 좋은 이유</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 접근을 사용하는 것을 고려하는</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 캡슐화 단지 인수를 넘어 미래를 쉽게 변경하기 -보다는 직접 클래스의 필드를 노출은.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">На самом деле есть </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">много веских причин,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы рассмотреть вопрос об использовании методов доступа,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а не обнародовать поля класса - кроме аргумента инкапсуляции и облегчения будущих изменений.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">实际上，有</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">很多充分的理由</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">考虑使用访问器，</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是直接公开类的字段-除了封装的论点之外，并使将来的更改更容易。</font></font>

source: <sub>* Even for that simple class, you may not necessarily want to allow setting the <code>x</code> and <code>y</code> values. If this is really a class, shouldn't it have methods like <code>translate</code>, <code>rotate</code>, etc.? If it's only a class because your language doesn't have records/structs/named tuples, then this isn't really a question of OO&hellip;</sub>
es: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* Incluso para esa clase simple, es posible que no desee permitir establecer los </font><font style="vertical-align: inherit;">valores </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si esto es realmente una clase, &iquest;no deber&iacute;a tener m&eacute;todos como </font></font> <code>translate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>rotate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , etc.? </font><font style="vertical-align: inherit;">Si es solo una clase porque su lenguaje no tiene registros / estructuras / tuplas con nombre, entonces esto no es realmente una cuesti&oacute;n de OO ...</font></font></sub>
ja: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*その単純なクラスでも、</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値</font><font style="vertical-align: inherit;">と</font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">値の</font><font style="vertical-align: inherit;">設定を許可したくない場合があり</font><font style="vertical-align: inherit;">ます。</font><font style="vertical-align: inherit;">これが本当にクラスである場合、</font></font> <code>translate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font> <code>rotate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">などの</font><font style="vertical-align: inherit;">メソッドが必要ではありません</font><font style="vertical-align: inherit;">か？</font><font style="vertical-align: inherit;">言語にレコード/構造体/名前付きタプルがないためクラスだけの場合、これは実際にはオブジェクト指向の問題ではありません&hellip;</font></font></sub>
ko: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* 간단한 클래스라도 </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 및 </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 값을 </font><font style="vertical-align: inherit;">설정하지 않아도 </font><font style="vertical-align: inherit;">됩니다. </font><font style="vertical-align: inherit;">이것이 실제로 클래스라면 </font></font> <code>translate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>rotate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 등의 </font><font style="vertical-align: inherit;">메소드가 없어야 </font><font style="vertical-align: inherit;">합니까? </font><font style="vertical-align: inherit;">귀하의 언어에 레코드 / 구조체 / 명명 된 튜플이 없기 때문에 클래스 일 경우 실제로 OO의 문제는 아닙니다 ...</font></font></sub>
ru: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">* Даже для этого простого класса вам не обязательно разрешать установку </font><font style="vertical-align: inherit;">значений </font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Если это действительно класс, разве не должно быть таких методов, как </font></font> <code>translate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>rotate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и т. Д.? </font><font style="vertical-align: inherit;">Если это только класс, потому что ваш язык не имеет записей / структур / именованных кортежей, то это на самом деле не вопрос ОО&hellip;</font></font></sub>
zh_cn: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">*即使对于那个简单的类，您也不一定要允许设置</font></font> <code>x</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font> <code>y</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">值。</font><font style="vertical-align: inherit;">如果这确实是一个类，它是否不应该具有诸如</font></font> <code>translate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，</font></font> <code>rotate</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">等方法？</font><font style="vertical-align: inherit;">如果因为您的语言没有记录/结构/命名元组而只是一堂课，那么这实际上不是OO问题。</font></font></sub>

source: A public field is not worse than a getter/setter pair that does nothing except returning the field and assigning to it. First, it's clear that (in most languages) there is no functional difference. Any difference must be in other factors, like maintainability or readability.
es: Un campo público no es peor que un par de gettersetters que no hace nada más que devolver el campo y asignarlo.Primero,está claro que (en la mayoría de los idiomas)no hay ninguna diferencia funcional.Cualquier diferencia debe estar en otros factores,como la mantenibilidad o la legibilidad.
ja: パブリックフィールドは、フィールドを返してそれに代入する以外は何もしないゲッターセッターのペアよりも悪くない。まず、(ほとんどの言語で)機能的な違いがないことは明らかです。違いがあるとすれば、保守性や可読性などの他の要素にあるはずです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공개 필드는 필드를 반환하고 할당하는 것 외에는 아무것도하지 않는 getter / setter 쌍보다 나쁘지 않습니다. </font><font style="vertical-align: inherit;">첫째, (대부분의 언어에서) 기능상의 차이가 없다는 것이 분명합니다. </font><font style="vertical-align: inherit;">차이는 유지 관리 성 또는 가독성과 같은 다른 요소에 있어야합니다.</font></font>
ru: Публичное поле не хуже геттерсеттерной пары,которая ничего не делает,кроме как возвращает поле и присваивает его.Во-первых,понятно,что (в большинстве языков)функциональной разницы нет.Любая разница должна быть связана с другими факторами,такими как удобство обслуживания или читабельность.
zh_cn: 一个公共字段不比一个getter对,除了返回该字段并赋值给它之外,什么都不做。首先,很明显(在大多数语言中)没有功能上的区别。任何差异一定是在其他因素上,比如可维护性或可读性。

source: A very simple class that holds how much liquid is in it, and what its capacity is (in milliliters).
es: Una clase muy simple que contiene cuánto líquido hay en ella,y cuál es su capacidad (en mililitros).
ja: 液体がどのくらい入っていて、その容量が何なのか(ミリリットル単位)を保持している非常にシンプルなクラスです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">액체의 양과 용량 (밀리리터)을 담는 매우 간단한 클래스입니다.</font></font>
ru: Очень простой класс,который вмещает в себя столько жидкости,сколько в ней содержится,и каково ее количество (в миллилитрах).
zh_cn: 一个非常简单的类,它可以容纳多少液体,以及它的容量是多少(以毫升为单位)。

source: Accessors and mutators also allow for encapsulation - if you aren't supposed to see the value once its set (perhaps it's set in the constructor and then used by methods, but never supposed to be changed), it will never been seen by anyone. But if you can allow other classes to see or change it, you can provide the proper accessor and/or mutator.
es: Los accesorios y los mutadores también permiten la encapsulación-si se supone que no se debe ver el valor una vez que se establece (tal vez se establece en el constructor y luego se utiliza por métodos,pero nunca se supone que se cambie),nunca será visto por nadie.Pero si puedes permitir que otras clases lo vean o lo cambien,puedes proporcionar el accesorio adecuado o el mutador.
ja: アクセサやミューテータはカプセル化も可能にしています。もし値が設定された後に見ることが想定されていない場合 (おそらくコンストラクタで設定され、その後メソッドで使用され、変更されることは想定されていない)、それは誰にも見られません。しかし、他のクラスに見られたり変更されたりすることを許すことができるのであれば、適切なアクセサやミューテータを提供することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">접근 자와 뮤 테이터는 또한 캡슐화를 허용합니다. 값이 일단 설정되면 (생성자에서 설정되고 메소드에서 사용되지만 절대 변경되지 않아야 함) 값을 볼 수 없다면 아무도 볼 수 없습니다. </font><font style="vertical-align: inherit;">그러나 다른 클래스에서 보거나 변경하도록 허용하는 경우 적절한 접근 자 및 / 또는 뮤 테이터를 제공 할 수 있습니다.</font></font>
ru: Аксессуары и мутаторы также допускают инкапсуляцию-если вы не должны видеть значение после его установки (возможно,оно установлено в конструкторе и затем используется методами,но никогда не должно быть изменено),то оно никогда не будет видно никому.Но если вы можете разрешить другим классам видеть или изменять его,вы можете предоставить подходящий андор и андор мутатор.
zh_cn: 访问器和突变器也允许封装--如果你不应该看到这个值,一旦它被设置了,你就不应该看到它(也许它是在构造函数中设置的,然后被方法使用,但永远不应该被改变),那么它将永远不会被任何人看到。但如果你能允许其他类看到或改变它,你可以提供适当的访问器和突变器。

source: Adding pass-through getter/setter pairs to such a class adds no value. Other classes should provide meaningful operations, not just operations that fields already provide. That's how you can define and maintain useful invariants.
es: Agregar pares de pasantes a esta clase no agrega ningún valor.Otras clases deberían proporcionar operaciones significativas,no sólo operaciones que los campos ya proporcionan.Así es como puedes definir y mantener invariantes útiles.
ja: このようなクラスにパススルーのゲッターセッターペアを追加しても何の価値もありません。他のクラスは、フィールドが既に提供している操作だけではなく、意味のある操作を提供すべきです。そうすることで、有用な不変量を定義し、維持することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이러한 클래스에 패스 스루 게터 / 세터 쌍을 추가하면 값이 추가되지 않습니다. </font><font style="vertical-align: inherit;">다른 클래스는 필드가 이미 제공 한 작업뿐만 아니라 의미있는 작업을 제공해야합니다. </font><font style="vertical-align: inherit;">이것이 유용한 불변량을 정의하고 유지할 수있는 방법입니다.</font></font>
ru: Добавление пар проходных геттерсеттеров к такому классу не добавляет никакой ценности.Другие классы должны предоставлять содержательные операции,а не только операции,которые уже предоставляют поля.Так можно определить и поддерживать полезные инварианты.
zh_cn: 在这样的类中加入直通式的取值器对不会增加任何价值。其他的类应该提供有意义的操作,而不只是字段已经提供的操作。这就是你如何定义和维护有用的不变性。

source: Additionally, this is to "future-proof" your class. In particular, changing from a field to a property is an ABI break, so if you do later decide that you need more logic than just "set/get the field", then you need to break ABI, which of course creates problems for anything else already compiled against your class.
es: Además,esto es para "probar el futuro" de su clase.En particular,cambiar de un campo a una propiedad es una ruptura ABI,así que si más tarde decides que necesitas más lógica que sólo "ajustar el campo",entonces necesitas romper ABI,lo que por supuesto crea problemas para cualquier otra cosa ya compilada contra tu clase.
ja: さらに、これはクラスを「将来に備える」ためのものです。特に、フィールドからプロパティへの変更はABIのブレークなので、後になって「フィールドをsetgetする」以上のロジックが必要だと判断した場合、ABIをブレークする必要がありますが、これはもちろんクラスに対して既にコンパイルされている他の何かの問題を引き起こします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 이것은 수업을 "미래에 대비"하기위한 것입니다. </font><font style="vertical-align: inherit;">특히, 필드에서 속성으로 변경하는 것은 ABI 중단이므로 나중에 "필드 설정 / 받기"보다 더 많은 논리가 필요하다고 결정하면 ABI를 중단해야합니다. 그렇지 않으면 이미 클래스에 대해 컴파일되었습니다.</font></font>
ru: Кроме того,это для "будущего" вашего класса.В частности,переход от поля к свойству-это разрыв ABI,так что если вы позже решите,что вам нужно больше логики,чем просто "setget the field",то вам нужно разбить ABI,что,конечно,создает проблемы для всего остального,что уже скомпилировано против вашего класса.
zh_cn: 另外,这是为你的类做 "未来防护"。特别是,从字段到属性的改变是一个ABI的突破,所以如果你以后决定你需要更多的逻辑,而不仅仅是 "setget the field",那么你就需要打破ABI,这当然会给其他已经编译到你的类带来问题。

source: Allowing inheritors to change the semantics of how the property behaves and is exposed by overriding the getter/setter methods.
es: Permitiendo a los herederos cambiar la semántica de cómo la propiedad se comporta y se expone anulando los métodos de gettersetter.
ja: 継承者がプロパティの振る舞いのセマンティクスを変更し、ゲッターセッターメソッドをオーバーライドして公開することを可能にします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">상속자가 getter / setter 메서드를 재정 의하여 속성의 동작 및 노출 방식의 의미를 변경할 수 있도록합니다.</font></font>
ru: Позволяет наследникам изменять семантику того,как свойство ведет себя и подвергается воздействию,переопределяя методы геттерсеттера.
zh_cn: 允许继承者通过重写getetterter方法来改变属性行为的语义,并通过重写getetter方法来暴露。

source: Allowing the getter/setter to be passed around as lambda expressions rather than values.
es: Permitiendo que el "gettersetter" se pase como expresiones lambda en lugar de valores.
ja: ゲッターセッターを値ではなくラムダ式として渡せるようにします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter / setter를 값이 아닌 람다 식으로 전달할 수 있습니다.</font></font>
ru: Позволяет передавать геттерсеттер в виде лямбда-выражений,а не значений.
zh_cn: 允许以lambda表达式而不是值的形式传递getterter。

source: Also with different amounts of cycles, the getter is a little bit faster than the regular way. I hope this helped you.
es: También con diferentes cantidades de ciclos,el getter es un poco más rápido que la forma regular.Espero que esto te haya ayudado.
ja: また、サイクルの量を変えれば、通常の方法よりもゲッターが少し速くなります。これがお役に立てたなら幸いです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 다른 사이클 양으로 인해 게터는 일반적인 방식보다 약간 빠릅니다. </font><font style="vertical-align: inherit;">이것이 도움이 되었기를 바랍니다.</font></font>
ru: Также при различном количестве циклов,геттер немного быстрее обычного.Надеюсь,это тебе помогло.
zh_cn: 同样是用不同的循环量,获取器的速度比常规的方式要快一点。希望对你有帮助。

source: Also, it's important to follow the idioms of the language (or framework) you're using. If you write beautiful Ruby-style code in C#, any experienced C# developer other than you is going to have trouble reading it, and that's bad. Some languages have stronger cultures around their conventions than others.&mdash;and it may not be a coincidence that Java and Python, which are on opposite ends of the spectrum for how idiomatic getters are, happen to have two of the strongest cultures.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adem&aacute;s, es importante seguir los modismos del lenguaje (o marco) que est&aacute; utilizando. </font><font style="vertical-align: inherit;">Si escribe un hermoso c&oacute;digo de estilo Ruby en C #, cualquier desarrollador experimentado de C # que no sea usted tendr&aacute; problemas para leerlo, y eso es malo. </font><font style="vertical-align: inherit;">Algunos lenguajes tienen culturas m&aacute;s fuertes en torno a sus convenciones que otros. Y puede que no sea una coincidencia que Java y Python, que se encuentran en extremos opuestos del espectro por lo idiom&aacute;ticos que son los captadores, tengan dos de las culturas m&aacute;s fuertes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">また、使用している言語（またはフレームワーク）のイディオムに従うことも重要です。</font><font style="vertical-align: inherit;">美しいRubyスタイルのコードをC＃で書くと、あなた以外の経験豊富なC＃開発者はそれを読むのに苦労するでしょう、それは悪いことです。</font><font style="vertical-align: inherit;">一部の言語は、その慣習に関して他の言語よりも強い文化を持っています。そして、慣用的なゲッターがいかにスペクトルの反対側にあるJavaとPythonが偶然にも2つの最も強い文化を持っているのは偶然ではないかもしれません。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 사용중인 언어 (또는 프레임 워크)의 관용구를 따르는 것이 중요합니다. </font><font style="vertical-align: inherit;">C #으로 멋진 루비 스타일 코드를 작성하면 경험이없는 C # 개발자가 코드를 읽는 데 어려움을 겪을 수 있습니다. </font><font style="vertical-align: inherit;">어떤 언어는 다른 언어보다 관습에 대해 더 강한 문화를 가지고 있습니다. 관용 게터가 어떻게 다른 스펙트럼 끝에있는 Java와 Python이 가장 강한 문화 중 하나를 갖는 것은 우연이 아닙니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кроме того, важно следовать идиомам языка (или структуры), который вы используете. </font><font style="vertical-align: inherit;">Если вы пишете красивый код в стиле Ruby на C #, любой опытный разработчик C #, кроме вас, будет испытывать трудности при его чтении, и это плохо. </font><font style="vertical-align: inherit;">Некоторые языки имеют более сильные культуры в своих соглашениях, чем другие. И это не может быть совпадением, что Java и Python, которые находятся на разных концах спектра того, насколько идиоматическими являются добытчики, имеют две из самых сильных культур.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">同样，遵循您使用的语言（或框架）的习惯用法也很重要。</font><font style="vertical-align: inherit;">如果您用C＃编写漂亮的Ruby风格的代码，那么除您之外的任何经验丰富的C＃开发人员都将很难阅读它，这很糟糕。</font><font style="vertical-align: inherit;">一些语言比其他语言具有更强的习惯文化。Java和Python在习惯用法的获取者方面处于相反的地位，碰巧拥有两种最强的文化，这并非巧合。</font></font>
