Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Great! And now we just change Bottle to this:
es: ¡Grandioso! Y ahora cambiamos a Botella por esto:
ja: いいね!そして今、我々はボトルをこれに変更します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">큰! </font><font style="vertical-align: inherit;">이제 병을 다음과 같이 변경합니다.</font></font>
ru: Здорово! А теперь мы просто поменяем Бутылку на эту:
zh_cn: 太好了!现在我们只要把瓶子改成这样

source: Here the implementation details of Full Name is hidden from the user and is not accessible directly to the user, unlike a public attribute.
es: En este caso,los detalles de implementación de Nombre Completo se ocultan al usuario y no son accesibles directamente al usuario,a diferencia de un atributo público.
ja: ここでは、公開属性とは異なり、フルネームの実装詳細はユーザーから隠されており、ユーザーが直接アクセスすることはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여기서 전체 이름의 구현 세부 사항은 사용자에게 표시되지 않으며 공용 속성과 달리 사용자가 직접 액세스 할 수 없습니다.</font></font>
ru: Здесь детали реализации Full Name скрыты от пользователя и не доступны непосредственно пользователю,в отличие от публичного атрибута.
zh_cn: 这里的 "全名 "的实现细节是隐藏的,用户无法直接访问,不像公共属性。

source: Hiding the internal representation of the property while exposing a property using an alternative representation.
es: Ocultar la representación interna de la propiedad mientras se expone una propiedad usando una representación alternativa.
ja: 代替表現を使用してプロパティを公開しながら、プロパティの内部表現を隠す。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">대체 표현을 사용하여 속성을 노출시키면서 속성의 내부 표현을 숨 깁니다.</font></font>
ru: Скрытие внутреннего представления имущества при выставке имущества с использованием альтернативного представления.
zh_cn: 隐藏属性的内部表示,同时用另一种表示方式暴露属性的内部表示。

source: I find this approach allows me to avoid sitting there and religiously writing getter/setters when a lot of data members get migrated out, shifted around, etc. during the early stages of a class's evolution.
es: Creo que este enfoque me permite evitar sentarme y escribir religiosamente "gettersetters" cuando muchos miembros de los datos emigran,se desplazan,etc.durante las primeras etapas de la evolución de una clase.
ja: このアプローチにより、クラスの進化の初期段階で多くのデータメンバーがマイグレーションされたり、シフトされたりしたときに、その場に座って宗教的にゲッターを書く必要がないことに気付きました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 접근법을 통해 클래스 진화의 초기 단계에서 많은 데이터 멤버가 마이그레이션되거나 이동하는 등 종교적인 게터 / 세터를 피할 수 있습니다.</font></font>
ru: Я считаю,что такой подход позволяет мне избежать сидения и религиозного написания геттерсеттеров,когда многие члены данных мигрируют,перемещаются и т.д.на ранних стадиях эволюции класса.
zh_cn: 我发现这种方法可以让我避免在一个班级进化的初期,当很多数据成员被迁移出去、转移到其他地方去的时候,坐在那里虔诚地写着gettersetters。

source: I had a base page class in a project that was handed to me that was loading some data from a couple different web service calls, but the data in those web service calls wasn't always used in all child pages. Web services, for all of the benefits, pioneer new definitions of "slow", so you don't want to make a web service call if you don't have to.
es: Tenía una clase de página base en un proyecto que se me entregó y que cargaba algunos datos de un par de llamadas de servicio web diferentes,pero los datos de esas llamadas de servicio web no siempre se usaban en todas las páginas de niños.Los servicios web,por todos los beneficios,son pioneros en nuevas definiciones de "lento",así que no quieres hacer una llamada al servicio web si no tienes que hacerlo.
ja: あるプロジェクトのベースページクラスで、いくつかの異なるウェブサービスコールからデータをロードしていたのですが、それらのウェブサービスコールのデータがすべての子ページで使われているとは限りませんでした。ウェブサービスは、あらゆる利点のために、「遅い」という新しい定義を開拓しているので、必要がなければウェブサービスコールをしたくありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">몇 가지 다른 웹 서비스 호출에서 일부 데이터를로드하는 프로젝트에 기본 페이지 클래스가 있었지만 해당 웹 서비스 호출의 데이터가 항상 모든 하위 페이지에서 사용되는 것은 아닙니다. </font><font style="vertical-align: inherit;">웹 서비스는 모든 이점을 위해 "느린"에 대한 새로운 정의를 개척하여 필요하지 않은 경우 웹 서비스 호출을 원하지 않습니다.</font></font>
ru: У меня был класс базовой страницы в проекте,который был передан мне и который загружал некоторые данные из пары разных вызовов веб-сервиса,но данные в этих вызовах веб-сервиса не всегда использовались на всех дочерних страницах.Веб-службы,при всех преимуществах,стали пионерами новых определений "медленных",так что вы не захотите совершать вызов веб-службы,если вам это не нужно.
zh_cn: 我有一个项目中的基础页面类,交给我的项目中,有几个不同的web服务调用加载一些数据,但这些web服务调用中的数据并不总是用于所有的子页面。Web服务,为了所有的好处,开创了 "慢 "的新定义,所以如果没有必要的话,你就不要去做一个Web服务调用。

source: I have massive system written without getters setters only with access modifiers and some methods to validate n perform biz logic. If you absolutely needed the. Use anything.
es: Tengo un sistema masivo escrito sin getters setters sólo con modificadores de acceso y algunos métodos para validar la lógica del negocio.Si es absolutamente necesario.Usa cualquier cosa.
ja: 私は大規模なシステムをゲッター・セッターなしで書いていて、アクセス修飾子といくつかのメソッドだけでビズロジックを検証しています。あなたが絶対に必要な場合。何かを使用してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">액세스 수정 자 및 n 비즈 로직을 검증하는 몇 가지 방법으로 만 getters setter없이 작성된 대규모 시스템이 있습니다. </font><font style="vertical-align: inherit;">당신이 절대적으로 필요한 경우. </font><font style="vertical-align: inherit;">무엇이든 사용하십시오.</font></font>
ru: У меня есть огромные системы,написанные без сеттеров геттеров только с модификаторами доступа и некоторыми методами проверки n выполняют biz логику.Если вам это было абсолютно необходимо.Используйте что угодно.
zh_cn: 我有一个庞大的系统,没有getters设置器,只用访问修改器和一些方法来验证n执行business逻辑。如果你绝对需要的。用什么都可以。

source: I know it's a bit late, but I think there are some people who are interested in performance.
es: Sé que es un poco tarde,pero creo que hay algunas personas que están interesadas en la actuación.
ja: 遅くなりましたが、パフォーマンスに興味のある方もいらっしゃると思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">약간 늦었지만 성능에 관심이있는 사람들이 있다고 생각합니다.</font></font>
ru: Я знаю,что немного поздно,но я думаю,что есть люди,которые заинтересованы в выступлении.
zh_cn: 我知道时间有点晚了,但我觉得有些人对表演有兴趣。

source: I moved from public fields to getters, and now the getters check the cache, and if it's not there call the web service. So with a little wrapping, a lot of web service calls were prevented.
es: Pasé de los campos públicos a los getters,y ahora los getters comprueban el caché,y si no está ahí,llama al servicio web.Así que con un poco de envoltura,se evitaron muchas llamadas al servicio web.
ja: 公開フィールドからゲッターに移行し、ゲッターがキャッシュをチェックして、キャッシュがなければウェブサービスを呼び出すようになりました。そのため、少しのラッピングで、多くのウェブサービスの呼び出しを防ぐことができました。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">공개 필드에서 게터로 옮겼는데 이제 게터가 캐시를 확인하고 웹 서비스가 없으면 캐시를 확인합니다. </font><font style="vertical-align: inherit;">따라서 작은 줄 바꿈으로 많은 웹 서비스 호출이 방지되었습니다.</font></font>
ru: Я перешел от публичных полей к геттерам,и теперь геттеры проверяют кэш,и если его нет,звоните в веб-службу.Так что с небольшой оберткой,многие звонки в веб-службу были предотвращены.
zh_cn: 我把公共字段改成了getters,现在getters检查缓存,如果不在,就调用web服务。所以稍微包装一下,就避免了很多web服务的调用。

source: I spent quite a while thinking this over for the Java case, and I believe the real reasons are:
es: Pasé bastante tiempo pensando en esto para el caso de Java,y creo que las verdaderas razones son:
ja: Javaの件でかなりの時間をかけて考えたのですが、本当の理由はこれだと思います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Java 케이스에 대해 이것을 생각하는 데 꽤 오랜 시간을 보냈으며 실제 이유는 다음과 같습니다.</font></font>
ru: Я потратил довольно много времени на обдумывание этого дела для Java,и я считаю,что настоящие причины таковы:
zh_cn: 我花了相当长的时间来思考这个问题,我相信真正的原因是。

source: I would just like to throw the idea of annotation : @getter and @setter. With @getter, you should be able to obj = class.field but not class.field = obj. With @setter, vice versa. With @getter and @setter you should be able to do both. This would preserve encapsulation and reduce the time by not calling trivial methods at runtime.
es: Me gustaría lanzar la idea de la anotación:@getter y @setter.Con @getter,deberías ser capaz de obj=class.field pero no class.field=obj.Con @setter,viceversa.Con @getter y @setter deberías ser capaz de hacer ambas cosas.Esto preservaría la encapsulación y reduciría el tiempo al no llamar a métodos triviales en tiempo de ejecución.
ja: 私はちょうどアノテーションのアイデアを投げたいと思います。ゲッターとセッター。ゲッターでは、obj=class.fieldはできるはずだが、class.field=objはできない。setterの場合はその逆です。ゲッターとセッターを使うと、両方ができるようになります。これにより、カプセル化を維持し、実行時につまらないメソッドを呼び出さないようにすることで、時間を短縮することができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@getter 및 @setter : 주석 아이디어를 던지고 싶습니다. </font><font style="vertical-align: inherit;">@getter를 사용하면 obj = class.field는 할 수 있지만 class.field = obj는 할 수 없습니다. </font><font style="vertical-align: inherit;">@setter를 사용하면 그 반대도 마찬가지입니다. </font><font style="vertical-align: inherit;">@getter와 @setter를 사용하면 둘 다 할 수 있어야합니다. </font><font style="vertical-align: inherit;">이렇게하면 런타임에 사소한 메서드를 호출하지 않아 캡슐화가 유지되고 시간이 줄어 듭니다.</font></font>
ru: Я просто хотел бы бросить идею аннотации:@getter и @setter.С помощью @getter вы должны иметь возможность obj=class.field,но не class.field=obj.С @setter,наоборот.С помощью @getter и @setter вы должны уметь делать и то,и другое.Это позволит сохранить инкапсуляцию и сократить время,не вызывая тривиальные методы во время выполнения.
zh_cn: 我只想抛出一个注释的想法。@getter和@setter。用@getter,你应该可以obj=class.field,但不能用class.field=obj。使用@setter,反之亦然。使用 @getter 和 @setter,你应该可以同时进行。这将保留封装,并通过在运行时不调用琐碎的方法来减少时间。

source: I would not take advantage of ignorance of business owners of deep technical know how just because I think it's correct or I like the approach.
es: No me aprovecharía de la ignorancia de los empresarios de profundo conocimiento técnico sólo porque creo que es correcto o me gusta el enfoque.
ja: 私は、自分が正しいと思ったり、アプローチが好きだからといって、深い技術的なノウハウを持つ経営者の無知を利用することはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">심도 깊은 기술 소유자의 무지를 활용하지 않을 것입니다. 그것이 옳다고 생각하거나 접근 방식을 좋아한다는 이유 만 알고 있습니다.</font></font>
ru: Я бы не воспользовался невежеством владельцев бизнеса с глубокими техническими знаниями просто потому,что я считаю это правильным или мне нравится подход.
zh_cn: 我不会因为我觉得这样做是正确的,或者我喜欢这样的做法,就会利用企业主对深层次技术知识的无知,我也不会因为我觉得这样做是正确的,或者我喜欢这样的做法。

source: I'll leave the definition of the BottleOverflowException as an exercise to the reader.
es: Dejaré la definición de la excepción de la botella como un ejercicio para el lector.
ja: BottleOverflowExceptionの定義は読者の方に練習としてお任せします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">나는 BottleOverflowException의 정의를 독자에게 연습으로 남겨 둘 것이다.</font></font>
ru: Я оставлю определение BottleOverflowException как упражнение для читателя.
zh_cn: 我将把BottleOverflowException的定义留给读者作为练习。

source: I've done a little performance test. I wrote a class "NumberHolder" which, well, holds an Integer. You can either read that Integer by using the getter method <code>anInstance.getNumber()</code> or by directly accessing the number by using <code>anInstance.number</code>. My programm reads the number 1,000,000,000 times, via both ways. That process is repeated five times and the time is printed. I've got the following result:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He hecho una peque&ntilde;a prueba de rendimiento. </font><font style="vertical-align: inherit;">Escrib&iacute; una clase "NumberHolder" que, bueno, contiene un n&uacute;mero entero. </font><font style="vertical-align: inherit;">Puede leer ese n&uacute;mero entero utilizando el m&eacute;todo getter </font></font> <code>anInstance.getNumber()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o accediendo directamente al n&uacute;mero utilizando </font></font> <code>anInstance.number</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Mi programa lee el n&uacute;mero 1,000,000,000 de veces, en ambos sentidos. </font><font style="vertical-align: inherit;">Ese proceso se repite cinco veces y se imprime el tiempo. </font><font style="vertical-align: inherit;">Tengo el siguiente resultado:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">少しパフォーマンステストを行いました。</font><font style="vertical-align: inherit;">Integerを保持するクラス「NumberHolder」を作成しました。</font><font style="vertical-align: inherit;">あなたは、どちらかのgetterメソッドを使用して、その整数を読み取ることができ </font></font> <code>anInstance.getNumber()</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接使用して番号にアクセスすることにより</font></font> <code>anInstance.number</code> を<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">私のプログラムは、両方の方法で1,000,000,000回数値を読み取ります。</font><font style="vertical-align: inherit;">このプロセスが5回繰り返され、時間が印刷されます。</font><font style="vertical-align: inherit;">次の結果が得られました。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">약간의 성능 테스트를 수행했습니다. </font><font style="vertical-align: inherit;">나는 정수를 보유하고있는 "NumberHolder"클래스를 작성했다. </font><font style="vertical-align: inherit;">getter 메소드 </font></font> <code>anInstance.getNumber()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하거나 </font></font> <code>anInstance.number</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 사용하여 숫자에 직접 액세스 </font><font style="vertical-align: inherit;">하여 해당 Integer를 읽을 수 있습니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">내 프로그램은 두 가지 방법으로 1,000,000,000 번을 읽습니다. </font><font style="vertical-align: inherit;">이 과정이 5 번 반복되고 시간이 인쇄됩니다. </font><font style="vertical-align: inherit;">다음과 같은 결과가 나타납니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я сделал небольшой тест производительности. </font><font style="vertical-align: inherit;">Я написал класс "NumberHolder", который, ну, в общем, содержит целое число. </font><font style="vertical-align: inherit;">Вы можете либо прочитать это Integer, используя метод </font></font> <code>anInstance.getNumber()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> либо напрямую получить доступ к номеру, используя </font></font> <code>anInstance.number</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Моя программа читает число 1 000 000 000 раз обоими способами. </font><font style="vertical-align: inherit;">Этот процесс повторяется пять раз, и время печатается. </font><font style="vertical-align: inherit;">Я получил следующий результат:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我做了一些性能测试。</font><font style="vertical-align: inherit;">我写了一个&ldquo; NumberHolder&rdquo;类，它拥有一个整数。</font><font style="vertical-align: inherit;">您可以通过使用getter方法</font></font> <code>anInstance.getNumber()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或通过使用</font></font> <code>anInstance.number</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">直接访问该数字来</font><font style="vertical-align: inherit;">读取该Integer </font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">我的程序通过两种方式读取该数字1,000,000,000次。</font><font style="vertical-align: inherit;">重复该过程五次，并打印时间。</font><font style="vertical-align: inherit;">我得到以下结果：</font></font>

source: If a class has these dumb getters and setters for every field, then it is a class that has no invariants whatsoever, <em>no contract</em>. Is that really object-oriented design? If all the class has is those getters and setters, it's just a dumb data holder, and dumb data holders should look like dumb data holders:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si una clase tiene estos captadores y establecedores tontos para cada campo, entonces es una clase que no tiene invariantes, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ni contrato</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iquest;Es realmente un dise&ntilde;o orientado a objetos? </font><font style="vertical-align: inherit;">Si toda la clase tiene esos captadores y establecedores, es solo un titular de datos tontos, y los titulares de datos tontos deber&iacute;an verse como titulares de datos tontos:</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスがすべてのフィールドに対してこれらのダムゲッターとセッターを持っている場合、そのクラスは不変条件がまったくなく、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コントラクト</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">もありません</font><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">それは本当にオブジェクト指向のデザインですか？</font><font style="vertical-align: inherit;">すべてのクラスにそれらのゲッターとセッターがある場合、それは単なるデータホルダーであり、ダムデータホルダーはダムデータホルダーのように見えるはずです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클래스가 모든 필드에 대해 이러한 벙어리 게터와 세터를 가지고 있다면, 그것은 불변성이 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">없고 계약</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 이없는 클래스입니다 </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">이것이 실제로 객체 지향 디자인입니까? </font><font style="vertical-align: inherit;">모든 클래스에 게터와 세터가 있다면 바보 데이터 홀더 일뿐이며 바보 데이터 홀더는 바보 데이터 홀더처럼 보일 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если у класса есть эти тупые методы получения и установки для каждого поля, то это класс, который не имеет ни инвариантов, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ни контракта</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Это действительно объектно-ориентированный дизайн? </font><font style="vertical-align: inherit;">Если все, что есть в классе, это те геттеры и сеттеры, это просто тупой держатель данных, и тупые держатели данных должны выглядеть как тупые держатели данных:</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果一个类的每个字段都具有这些愚蠢的获取器和设置器，则该类将没有任何不变式，也</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">没有合同</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font><font style="vertical-align: inherit;">那真的是面向对象的设计吗？</font><font style="vertical-align: inherit;">如果班上所有的人都是那些getter和setter，那只是一个哑数据持有人，而哑数据持有人应该看起来像哑数据持有人：</font></font>

source: If getters and setters are ever doing more than just the simple get/set, I can figure this one out very quickly, but I'm not 100% clear on how:
es: Si los getters y setters hacen algo más que el simple getset,puedo entender esto muy rápidamente,pero no tengo 100% claro cómo:
ja: ゲッターとセッターが単純なゲッター以上のことをしているのなら、これはすぐにわかるのですが、どのようにすればいいのか100%はわかりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter와 setter가 단순한 get / set 이상의 기능을 수행하는 경우이 정보를 매우 빠르게 파악할 수 있지만 방법에 대해서는 100 % 명확하지 않습니다.</font></font>
ru: Если геттеры и сеттеры когда-нибудь делают больше,чем просто геттеры,я могу разобраться в этом очень быстро,но я не на 100% понимаю,как:
zh_cn: 如果说getter和setter曾经不仅仅是做简单的getset,我可以很快就弄清楚这个问题,但我并不是百分之百的清楚。

source: If that should not have been the contract, then the interface was allowing clients to put the object in invalid states. <em>That's the exact opposite of encapsulation</em> If that field could not really be set to anything from the start, why wasn't the validation there from the start?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si ese no deber&iacute;a haber sido el contrato, entonces la interfaz estaba permitiendo a los clientes poner el objeto en estados no v&aacute;lidos. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso es exactamente lo opuesto a la encapsulaci&oacute;n.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Si ese campo no se pudo establecer realmente desde el principio, &iquest;por qu&eacute; no se realiz&oacute; la validaci&oacute;n desde el principio?</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それが契約ではなかった場合、インターフェイスはクライアントがオブジェクトを無効な状態にすることを許可していました。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それはカプセル化の正反対です。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">そのフィールドを最初から実際に何にも設定できない場合、なぜ最初から検証が行われなかったのですか？</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 계약이 아니어야한다면, 인터페이스는 클라이언트가 객체를 유효하지 않은 상태로 놓을 수 있도록 허용 한 것입니다. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이것이 캡슐화의 정반대입니다.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 해당 필드를 실제로 시작부터 다른 것으로 설정할 수 없다면 왜 시작부터 검증이 이루어지지 않았습니까?</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если это не должно было быть контрактом, то интерфейс позволял клиентам переводить объект в недопустимые состояния. </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это полная противоположность инкапсуляции.</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Если это поле не может быть действительно установлено с нуля с самого начала, почему не было проверки с самого начала?</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果这不应该是合同，则该接口允许客户端将对象置于无效状态。</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这与封装完全相反。</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">如果从一开始就无法将该字段真正设置为任何值，那么为什么从一开始就不进行验证呢？</font></font>

source: If your language doesn't have properties, then the only way to represent something that's conceptually an attribute, but is actually computed, or validated, etc., is through getters and setters.
es: Si su lenguaje no tiene propiedades,entonces la única manera de representar algo que es conceptualmente un atributo,pero que en realidad es computado,o validado,etc.,es a través de getters y setters.
ja: あなたの言語がプロパティを持たない場合、概念的には属性ですが、実際に計算されたり検証されたりするものを表現する唯一の方法は、ゲッターやセッターを使うことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">언어에 속성이없는 경우 개념적으로 속성이지만 실제로 계산 또는 검증되는 것을 나타내는 유일한 방법은 getter 및 setter를 사용하는 것입니다.</font></font>
ru: Если у вашего языка нет свойств,то единственный способ представить что-то,что концептуально является атрибутом,но на самом деле вычисляется,или проверяется,и т.д.,это через геттеры и сеттеры.
zh_cn: 如果你的语言没有属性,那么唯一的方法就是通过getter和setter来表示概念上是属性的东西,但实际上是计算的,或者是验证的等等。
