Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: An oft-mentioned advantage of getter/setter pairs, isn't. There's this claim that you can change the implementation and your clients don't have to be recompiled. Supposedly, setters let you add functionality like validation later on and your clients don't even need to know about it. However, adding validation to a setter is a change to its preconditions, <strong>a violation of the previous contract</strong>, which was, quite simply, "you can put anything in here, and you can get that same thing later from the getter".
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una ventaja a menudo mencionada de los pares getter / setter, no lo es. Existe la afirmaci&oacute;n de que puede cambiar la implementaci&oacute;n y sus clientes no tienen que ser recompilados. Supuestamente, los configuradores le permiten agregar funcionalidades como validaci&oacute;n m&aacute;s adelante y sus clientes ni siquiera necesitan saberlo. Sin embargo, agregar validaci&oacute;n a un colocador es un cambio en sus condiciones previas, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">una violaci&oacute;n del contrato anterior</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que era, simplemente, "puede poner cualquier cosa aqu&iacute;, y puede obtener lo mismo m&aacute;s tarde del getter".</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッター/セッターのペアのよく言われる利点はそうではありません。実装を変更でき、クライアントを再コンパイルする必要がないという主張があります。おそらく、セッターを使用すると、検証などの機能を後で追加でき、クライアントはそれについて知る必要すらありません。ただし、検証をセッターに追加すると、前提条件が変更され</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、以前のコントラクトに違反します</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。これは、簡単に言うと、「ここに何でも入れることができ、後でゲッターから同じものを取得できる」ということです。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter / setter 쌍의 장점은 그렇지 않습니다. </font><font style="vertical-align: inherit;">구현을 변경할 수 있으며 클라이언트를 다시 컴파일 할 필요가 없다는 주장이 있습니다. </font><font style="vertical-align: inherit;">아마도 setter를 사용하면 나중에 유효성 검사와 같은 기능을 추가 할 수 있으며 클라이언트도 알 필요가 없습니다. </font><font style="vertical-align: inherit;">그러나 세터에 유효성 검사를 추가하는 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">것은 이전 계약을 위반</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 전제 조건의 변경 </font><strong><font style="vertical-align: inherit;">입니다.</font></strong><font style="vertical-align: inherit;"> 이는 단순히 "여기에 아무 것도 넣을 수 있으며 나중에 게터에서 같은 것을 얻을 수 있습니다"라는 것입니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Часто упоминаемое преимущество пар геттер / сеттер - это не так. Есть утверждение, что вы можете изменить реализацию, и ваши клиенты не должны перекомпилироваться. Предположительно, сеттеры позволяют вам добавлять функциональность, такую ​​как проверка, и вашим клиентам даже не нужно знать об этом. Однако добавление проверки к установщику является изменением его предварительных условий, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">нарушением предыдущего контракта</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , который, по сути, заключался в том, что &laquo;вы можете положить сюда что-нибудь, и вы можете получить то же самое позже от получателя&raquo;.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并非经常提到的getter / setter对的优点。有人声称您可以更改实现，而不必重新编译客户。据说，通过设置器，您可以稍后添加诸如验证之类的功能，而您的客户甚至不需要了解它。但是，将验证器添加到设置器中是对其先决条件的更改，</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这违反了先前的合同</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，这很简单，即&ldquo;您可以在此处放置任何内容，稍后可以从获取器中获取相同的内容&rdquo;。</font></font>

source: And all these can have different ways to handle various whoopsies. The Bottle just checks and if it's overflowing it throws a RuntimeException. But that might be the wrong thing to do. (There is a useful discussion to be had about error handling, but I'm keeping it very simple here on purpose. People in comments will likely point out the flaws of this simplistic approach. ;) )
es: Y todos estos pueden tener diferentes maneras de manejar varias feromonas.La botella sólo se comprueba y si se desborda lanza una excepción de tiempo de ejecución.Pero eso podría ser lo que no se hace.(Hay una discusión útil sobre el manejo de errores,pero lo mantengo muy simple aquí a propósito.La gente en los comentarios probablemente señalará las fallas de este enfoque simplista.;))
ja: そして、これらはすべて、様々なwhoopssiを処理するための異なる方法を持つことができます。ボトルはチェックするだけで、溢れている場合はRuntimeExceptionをスローします。しかし、それは間違っているかもしれません。(エラー処理については有益な議論がありますが、ここでは意図的に非常にシンプルにしています。コメント欄の人たちは、この単純なアプローチの欠点を指摘してくれるでしょう。))
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고이 모든 것들은 다양한 솜씨를 다루는 다른 방법을 가질 수 있습니다. </font><font style="vertical-align: inherit;">병은 단지 검사하고 넘치면 RuntimeException을 발생시킵니다. </font><font style="vertical-align: inherit;">그러나 그것은 잘못된 일일 수 있습니다. </font><font style="vertical-align: inherit;">(오류 처리에 관한 유용한 토론이 있지만 여기서는 매우 간단하게 설명하고 있습니다. 의견을 가진 사람들은이 단순한 접근 방식의 결함을 지적 할 것입니다.;))</font></font>
ru: И все это может иметь разные способы справиться с разными сумасбродствами.Бутылка просто проверяет,и если она переполнена,она бросает RuntimeException.Но это может быть неправильным.(Есть полезная дискуссия об обработке ошибок,но здесь я специально все упрощаю.Люди в комментариях,скорее всего,укажут на недостатки этого упрощенного подхода.;))
zh_cn: 而这些都可以有不同的方式来处理各种whoopsies。Bottle只是检查一下,如果溢出了就会抛出一个RuntimeException。但这可能是错误的处理方式。(关于错误处理,有一个有用的讨论,但我在这里故意把它保持得很简单。人们在评论中很可能会指出这种简单化的方法的缺陷。))

source: And yes, it seems like we go from a very simple idea to getting much better answers quickly.
es: Y sí,parece que pasamos de una idea muy simple a obtener respuestas mucho mejores rápidamente.
ja: そして、そうですね、非常に単純なアイデアから、より良い答えをすぐに得られるようになるようです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그리고 그렇습니다. 우리는 매우 간단한 아이디어에서 훨씬 더 나은 답변을 빨리 얻는 것처럼 보입니다.</font></font>
ru: И да,кажется,что мы переходим от очень простой идеи к быстрому получению гораздо лучших ответов.
zh_cn: 而且是的,我们似乎从一个非常简单的想法,很快就能得到更好的答案。

source: Any validation you perform in there can only be context free, which validation rarely is in practice.
es: Cualquier validación que se realice allí sólo puede ser libre de contexto,lo que rara vez se hace en la práctica.
ja: そこで実行される検証はすべてコンテキストフリーであることができますが、実際にはそのような検証はほとんどありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">거기에서 수행하는 모든 유효성 검사에는 컨텍스트가 없을 수 있으며 실제로는 거의 유효하지 않습니다.</font></font>
ru: Любая валидация,которую вы там проводите,может быть только бесконтекстной,что редко встречается на практике.
zh_cn: 你在那里进行的任何验证都只能是无上下文的,而实际操作中很少有这样的验证。

source: Anywhere a value can be used, a method that returns that value can be added. Instead of:
es: En cualquier lugar donde se pueda utilizar un valor,se puede añadir un método que devuelva ese valor.En lugar de:
ja: 値を使用できる場所であれば、その値を返すメソッドを追加することができます。の代わりに
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">값을 사용할 수있는 곳이면 해당 값을 반환하는 메소드를 추가 할 수 있습니다. </font><font style="vertical-align: inherit;">대신에:</font></font>
ru: Везде,где можно использовать значение,можно добавить метод,возвращающий это значение.Вместо этого:
zh_cn: 任何可以使用值的地方,都可以添加一个返回该值的方法。而不是:

source: As for the "what if I want to change my implementation later?" question (which is repeated multiple times in different wording in both the OP's question and the accepted answer): If it really is a pure implementation change, and you started with an attribute, you can change it to a property without affecting the interface. Unless, of course, your language doesn't support that. So this is really just the same case again.
es: En cuanto a la pregunta "¿qué pasa si quiero cambiar mi aplicación más tarde?" (que se repite varias veces con diferente redacción tanto en la pregunta de la OP como en la respuesta aceptada):Si realmente se trata de un cambio de implementación puro,y se comenzó con un atributo,se puede cambiar a una propiedad sin afectar la interfaz.A menos,por supuesto,que tu lenguaje no soporte eso.Así que este es realmente el mismo caso otra vez.
ja: 後から実装を変更したい場合は?"という質問については(OPの質問と受け入れられた回答の両方で異なる言葉で何度も繰り返されています)、「実装を変更したい場合は?もし本当に純粋な実装の変更で、属性から始めたのであれば、インターフェースに影響を与えずにプロパティに変更することができます。もちろん、あなたの言語がそれをサポートしていない場合は別です。ですから、これは本当にまた同じケースです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">"나중에 구현을 나중에 변경하려면 어떻게해야합니까?" </font><font style="vertical-align: inherit;">질문 (OP의 질문과 허용 된 답변 모두에서 다른 표현으로 여러 번 반복됨) : 실제로 순수한 구현 변경이고 속성으로 시작한 경우 인터페이스에 영향을 미치지 않고 속성으로 변경할 수 있습니다. </font><font style="vertical-align: inherit;">물론, 당신의 언어가 그것을 지원하지 않는 한. </font><font style="vertical-align: inherit;">따라서 이것은 다시 똑같은 경우입니다.</font></font>
ru: Что касается вопроса "что,если я хочу изменить свою реализацию позже?" (который повторяется несколько раз в разных формулировках как в вопросе ОП,так и в принятом ответе):Если это действительно чистое изменение реализации,и вы начали с атрибута,вы можете изменить его на свойство,не затрагивая интерфейс.Если,конечно,ваш язык этого не поддерживает.Так что на самом деле это опять тот же самый случай.
zh_cn: 至于 "如果我以后想改变实现怎么办?"的问题(这个问题在OP的问题和接受的答案中都用不同的措辞重复了多次)。如果真的是纯粹的实现改变,而你一开始是改变属性,你可以把它改成属性,而不影响接口。当然,除非,你的语言不支持这种情况。所以,这真的又是同样的情况。

source: Because 2 weeks (months, years) from now when you realize that your setter needs to do <strong>more</strong> than just set the value, you'll also realize that the property has been used directly in 238 other classes :-)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debido a que dentro de 2 semanas (meses, a&ntilde;os) a partir de ahora, cuando se d&eacute; cuenta de que su setter necesita hacer </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">m&aacute;s</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que solo establecer el valor, tambi&eacute;n se dar&aacute; cuenta de que la propiedad se ha utilizado directamente en otras 238 clases :-)</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2週間（月、年）後、セッターが</font><font style="vertical-align: inherit;">値を設定する</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">以上の</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ことを行う必要があることに</font><font style="vertical-align: inherit;">気づくと、プロパティが他の238のクラスで直接使用されていることにも気付くでしょう:-)</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지금부터 2 주 (월, 년) 동안 세터가 </font><font style="vertical-align: inherit;">단순히 값을 설정하는 것보다 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">더 많은</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 일을해야한다는 것을 깨달았 기 때문에이 </font><font style="vertical-align: inherit;">속성이 238 개의 다른 클래스에서 직접 사용되었다는 것을 알게 될 것입니다. :-)</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Потому что через 2 недели (месяцы, годы), когда вы поймете, что ваш установщик должен делать </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">больше,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чем просто установить значение, вы также поймете, что свойство было использовано непосредственно в 238 других классах :-)</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">因为从2现在周（月，年），当你意识到你的二传手需要做</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">更多的</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">比刚才设置的值，你也会意识到，财产已经在其他238类直接使用:-)</font></font>

source: Beyond human readers, there will be libraries and tools that expect you to follow the conventions, and make your life harder if you don't. Hooking Interface Builder widgets to anything but ObjC properties, or using certain Java mocking libraries without getters, is just making your life more difficult. If the tools are important to you, don't fight them.
es: Más allá de los lectores humanos,habrá bibliotecas y herramientas que esperan que sigas las convenciones,y que te hagan la vida más difícil si no lo haces.Enganchar los widgets del Interface Builder a cualquier cosa menos a las propiedades de ObjC,o usar ciertas librerías de burla de Java sin getters,sólo está haciendo tu vida más difícil.Si las herramientas son importantes para ti,no luches contra ellas.
ja: 人間の読者以外にも、規則に従うことを要求するライブラリやツールがあり、従わないと生活が苦しくなります。Interface BuilderウィジェットをObjCプロパティ以外のものにフックしたり、ゲッターを使わずに特定のJavaモッキングライブラリを使ったりすることは、あなたの生活をより困難にしているだけです。ツールがあなたにとって重要なものであるならば、それらと争う必要はありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인간 독자 이외에도 규칙을 따르고 그렇지 않으면 인생을 더 힘들게 만드는 라이브러리와 도구가 있습니다. </font><font style="vertical-align: inherit;">Interface Builder 위젯을 ObjC 속성 이외의 것에 연결하거나 게터없이 특정 Java mocking 라이브러리를 사용하면 인생이 더 어려워집니다. </font><font style="vertical-align: inherit;">도구가 당신에게 중요하다면, 싸우지 마십시오.</font></font>
ru: Помимо читателей-людей,существуют библиотеки и инструменты,которые ожидают,что вы будете следовать конвенциям и сделаете свою жизнь труднее,если вы этого не сделаете.Подключение виджетов Hooking Interface Builder к чему угодно,кроме свойств ObjC,или использование некоторых насмешливых библиотек Java без геттеров,только усложняет вашу жизнь.Если инструменты важны для вас,не боритесь с ними.
zh_cn: 除了人类读者,还有一些库和工具希望你遵循约定,如果你不遵循约定,就会让你的生活变得更加困难。将 Interface Builder widgets 挂钩到任何东西,但不使用 ObjC 属性,或者使用某些 Java mocking 库而不使用 getters,只会让你的生活更加困难。如果这些工具对你来说很重要,就不要和它们对抗。

source: But nobody is ever doing general OO design. They're doing design, and implementation, in a specific language. And in some languages, getters and setters are far from useless.
es: Pero nadie está haciendo nunca un diseño general de OO.Están haciendo el diseño,y la implementación,en un lenguaje específico.Y en algunos lenguajes,los getters y setters están lejos de ser inútiles.
ja: しかし、誰も一般的な OO デザインをしているわけではありません。彼らがやっているのは、特定の言語での設計と実装です。そして、いくつかの言語では、ゲッターやセッターが役に立たないことはありません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 아무도 일반 OO 디자인을하고 있지 않습니다. </font><font style="vertical-align: inherit;">그들은 특정 언어로 디자인과 구현을하고 있습니다. </font><font style="vertical-align: inherit;">그리고 일부 언어에서는 게터와 세터가 쓸모가 없습니다.</font></font>
ru: Но никто никогда не занимается генеральным проектированием.Они занимаются проектированием и внедрением,на определенном языке.А в некоторых языках геттеры и сеттеры далеко не бесполезны.
zh_cn: 但是,没有人在做一般的OO设计。他们在做设计,和实现,在特定的语言中。而在某些语言中,getter和setter远非一无是处。

source: But there's another problem too. What if bottles were just one type of container? What if we had several containers, all with capacities and amounts of liquid filled? If we could just make an interface, we could let the rest of our program accept that interface, and bottles, jerrycans and all sorts of stuff would just work interchangably. Wouldn't that be better? Since interfaces demand methods, this is also a good thing.
es: Pero también hay otro problema.¿Qué pasaría si las botellas fueran sólo un tipo de recipiente? ¿Y si tuviéramos varios contenedores,todos con capacidades y cantidades de líquido llenos? Si pudiéramos hacer una interfaz,podríamos dejar que el resto de nuestro programa la aceptara,y las botellas,los bidones y todo tipo de cosas funcionarían de forma intercambiable.¿No sería eso mejor? Ya que las interfaces exigen métodos,esto también es algo bueno.
ja: しかし、もう一つ問題があります。もしボトルが1種類の容器にすぎなかったら?複数の容器があって、それぞれの容量や量の液体が入っていたらどうでしょうか?もしインターフェイスを作ることができれば、プログラムの残りの部分がそのインターフェイスを受け入れることができます。その方がいいのではないでしょうか?インターフェースはメソッドを要求するので、これもまた良いことです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그러나 또 다른 문제가 있습니다. </font><font style="vertical-align: inherit;">병이 단지 한 유형의 용기라면? </font><font style="vertical-align: inherit;">용량과 액체가 채워진 용기가 여러 개인 경우 어떻게해야합니까? </font><font style="vertical-align: inherit;">인터페이스를 만들 수 있다면 나머지 프로그램에서 해당 인터페이스를 받아 들일 수 있으며 병, jerrycans 및 모든 종류의 것들이 상호 교환 적으로 작동합니다. </font><font style="vertical-align: inherit;">더 나아지지 않습니까? </font><font style="vertical-align: inherit;">인터페이스는 메소드를 요구하기 때문에 이것도 좋습니다.</font></font>
ru: Но есть и другая проблема.Что если бы бутылки были всего лишь одним типом контейнеров? Что,если бы у нас было несколько контейнеров,все с емкостями и количеством жидкости? Если бы мы могли просто сделать интерфейс,мы могли бы позволить остальной части нашей программы принять этот интерфейс,и бутылки,канистры и всевозможные вещи просто работали бы взаимозаменяемо.Разве это не было бы лучше? Так как интерфейсы требуют методов,это тоже хорошо.
zh_cn: 但是,还有一个问题也在这里。如果瓶子只是一种容器呢?如果我们有几个容器,所有的容器都有容量和液体的数量呢?如果我们可以做一个接口,让我们的程序的其他部分接受这个接口,那么瓶子、罐子和各种东西就可以互换工作了。这样不是更好吗?既然接口需要方法,这也是一件好事。

source: Code <em>evolves</em>. <code>private</code> is great for when <em>you need data member protection</em>. Eventually all classes should be sort of "miniprograms" that have a well-defined interface <em>that you can't just screw with the internals of</em>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El c&oacute;digo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">evoluciona</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es ideal para cuando </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">necesita protecci&oacute;n de miembro de datos</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . Eventualmente, todas las clases deber&iacute;an ser una especie de "miniprogramas" que tienen una interfaz bien definida </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">que no se puede simplemente atornillar con las partes internas</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">コードは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">進化し</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ます。 </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">データメンバーの保護が必要</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">な場合に最適です</font><font style="vertical-align: inherit;">。結局のところ、すべてのクラスは</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、の内部をねじ込むことができない</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">明確に定義されたインターフェース</font><em><font style="vertical-align: inherit;">を</font></em><font style="vertical-align: inherit;">持つ一種の「ミニプログラム」で</font><em><font style="vertical-align: inherit;">ある必要があります</font></em><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">코드가 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">진화합니다</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">데이터 멤버 보호가 필요할</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 때 유용 </font><em><font style="vertical-align: inherit;">합니다</font></em><font style="vertical-align: inherit;"> . 결국 모든 클래스는 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내부적으로 조일 수없는</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 잘 정의 된 인터페이스 </font><em><font style="vertical-align: inherit;">를</font></em><font style="vertical-align: inherit;"> 가진 일종의 "미니 프로그램"이어야합니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Код </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">развивается</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> отлично подходит, когда </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">вам нужна защита членов данных</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . В конце концов, все классы должны быть своего рода &laquo;минипрограммами&raquo;, которые имеют четко определенный интерфейс, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">который вы не можете просто</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> испортить </font><font style="vertical-align: inherit;">.</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不断发展</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。 </font><font style="vertical-align: inherit;">当</font><em><font style="vertical-align: inherit;">您需要数据成员保护</font></em><font style="vertical-align: inherit;">时，</font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">非常适合</font><font style="vertical-align: inherit;">。最终，所有类都应该是具有明确定义的接口的&ldquo;小程序&rdquo; </font><em><font style="vertical-align: inherit;">，您不能仅仅使用它们的内部结构</font></em><font style="vertical-align: inherit;">。</font></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font><em><font style="vertical-align: inherit;"></font></em><font style="vertical-align: inherit;"></font>
