Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It's a beautifully simply piece of code until you realize its a setter. Now, you follow that setter and find that it also sets person.firstName, person.lastName, person.isHuman, person.hasReallyCommonFirstName, and calls person.update(), which sends a query out to the database, etc. Oh, that's where your memory leak was occurring.
es: Es un hermoso y simple pedazo de código hasta que te das cuenta de que es un setter.Ahora,sigues a ese configurador y encuentras que también configura person.firstName,person.lastName,person.isHuman,person.hasReallyCommonFirstName,y llama person.update(),que envía una consulta a la base de datos,etc.Oh,ahí es donde estaba ocurriendo la fuga de memoria.
ja: セッターであることに気づくまでは、美しくシンプルなコードです。さて、そのセッターをたどってみると、 person.firstName、 person.lastName、 person.isHuman、 person.hassReallyCommonFirstName を設定し、 person.update()を呼び出してデータベースにクエリを送信していることがわかります。あ、そこでメモリリークが発生していましたね。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세터를 깨닫기 전까지는 아주 간단하게 코드 조각입니다. </font><font style="vertical-align: inherit;">이제 해당 setter를 따라 person.firstName, person.lastName, person.isHuman, person.hasReallyCommonFirstName을 설정하고 person.update ()를 호출하여 데이터베이스로 쿼리를 보내는 등을 찾습니다. 메모리 누수가 발생한 위치</font></font>
ru: Это красивый простой кусок кода,пока вы не поймете,что это сеттер.Теперь,вы следуете этому сеттеру и обнаружите,что он также устанавливает person.firstName,person.lastName,person.isHuman,person.hasReallyCommonFirstName,и вызывает person.update(),которая посылает запрос в базу данных,и т.д..Вот где произошла утечка памяти.
zh_cn: 这段代码很简单,直到你意识到它是一个设置器。现在,你按照这个setter,发现它还设置了person.firstName,person.lastName,person.isHuman,person.hasReallyCommonFirstName,并调用person.update(),向数据库发送查询等。哦,这就是你的内存泄露的地方。

source: Let's say we have this simple class:
es: Digamos que tenemos esta simple clase:
ja: このシンプルなクラスがあったとしましょう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이 간단한 클래스가 있다고 가정 해 봅시다.</font></font>
ru: Допустим,у нас есть этот простой урок:
zh_cn: 假设我们有这样一个简单的班级。

source: Lots of people talk about the advantages of getters and setters but I want to play devil's advocate. Right now I'm debugging a very large program where the programmers decided to make everything getters and setters. That might seem nice, but its a reverse-engineering nightmare.
es: Mucha gente habla de las ventajas de los getters y setters pero yo quiero hacer de abogado del diablo.Ahora mismo estoy depurando un programa muy grande en el que los programadores decidieron hacer todo tipo de getters y setters.Eso puede parecer bonito,pero es una pesadilla de ingeniería inversa.
ja: 多くの人がゲッターとセッターの利点について話していますが、私は悪魔の味方をしたいと思っています。今、私は非常に大規模なプログラムをデバッグしています。それは良いことのように見えるかもしれませんが、リバースエンジニアリングの悪夢です。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">많은 사람들이 게터와 세터의 장점에 대해 이야기하지만 저는 악마의 옹호자를하고 싶습니다. </font><font style="vertical-align: inherit;">지금은 프로그래머가 모든 게터와 세터를 만들기로 결정한 매우 큰 프로그램을 디버깅하고 있습니다. </font><font style="vertical-align: inherit;">멋지게 보일지 모르지만 리버스 엔지니어링의 악몽입니다.</font></font>
ru: Многие говорят о преимуществах геттеров и сеттеров,но я хочу поиграть в дьявольского защитника.Сейчас я отлаживаю очень большую программу,где программисты решили сделать все геттеры и сеттеры.Это может показаться неплохим,но это реверс-инженерный кошмар.
zh_cn: 很多人都在谈论getter和setter的好处,但我想扮演魔鬼代言人。现在我正在调试一个非常大的程序,程序员们决定让所有的东西都用getter和setter。这似乎很好,但这是个反向工程的噩梦。

source: My 2 cents :)
es: Mis 2 centavos :)
ja: 私の2セント :)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내 2 센트 :)</font></font>
ru: Мои 2 цента :)
zh_cn: 我的两分钱 :)

source: Not only is <code>getVar()</code> visually noisy, it gives this illusion that <code>gettingVar()</code> is somehow a more complex process than it really is. How you (as the class writer) regard the sanctity of <code>var</code> is particularly confusing to a user of your class if it has a passthru setter -- then it looks like you're putting up these gates to "protect" something you insist is valuable, (the sanctity of <code>var</code>) but yet even you concede <code>var</code>'s protection isn't worth much by the ability for anyone to just come in and <code>set</code><code>var</code> to whatever value they want, without you even peeking at what they are doing.
es: <font style="vertical-align: inherit;"></font> <code>getVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no solo es </font><font style="vertical-align: inherit;">visualmente ruidoso, da la ilusi&oacute;n de que </font></font> <code>gettingVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es de alguna manera un proceso m&aacute;s complejo de lo que realmente es. La forma en que usted (como escritor de la clase) considera que la santidad de </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es particularmente confusa para un usuario de su clase si tiene un configurador passthru, entonces parece que est&aacute; colocando estas puertas para "proteger" algo que insiste es valioso , (la santidad de </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) pero aun as&iacute; usted reconoce que </font><font style="vertical-align: inherit;">la protecci&oacute;n de </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no vale mucho por la capacidad de cualquiera de entrar y </font></font> <code>set</code> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al valor que quiera, sin siquiera mirar lo que est&aacute;n haciendo.</font></font>
ja: <font style="vertical-align: inherit;"></font> <code>getVar()</code> は<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">視覚的にノイズが多い</font><font style="vertical-align: inherit;">だけでなく</font><font style="vertical-align: inherit;">、</font></font> <code>gettingVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">が実際よりも複雑なプロセスである</font><font style="vertical-align: inherit;">という錯覚を与え</font><font style="vertical-align: inherit;">ます。 （クラスライターとして）</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の神聖さをどのように見なす</font><font style="vertical-align: inherit;">かは、パススルーセッターがある場合、クラスのユーザーを特に混乱させます-主張するものを「保護」するためにこれらのゲートを設置しているようです、（の神聖</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）が、まだも、あなたは認める</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">の保護は、誰もがちょうどに来るとするための能力によってあまり価値がない</font></font> <code>set</code> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたも、彼らがやっていることで覗きせずに、彼らが望むどのような値に。</font></font>
ko: <font style="vertical-align: inherit;"></font> <code>getVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 시각적으로 노이즈 </font><font style="vertical-align: inherit;">가 </font><font style="vertical-align: inherit;">있을</font><font style="vertical-align: inherit;"> 뿐만 아니라 </font></font> <code>gettingVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 가 실제보다 복잡한 프로세스라는 </font><font style="vertical-align: inherit;">착각을 </font><font style="vertical-align: inherit;">줍니다</font><font style="vertical-align: inherit;"> . 당신이 (클래스 라이터로서) </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 신성도를 고려하는 </font><font style="vertical-align: inherit;">방법은 경유지 세터가있는 경우 클래스의 사용자에게 특히 혼란 스럽습니다. 그러면 당신이 주장하는 것을 "보호"하기 위해이 게이트를 세우는 것처럼 보입니다. , ( </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 신성함 </font><font style="vertical-align: inherit;">) 그러나 당신은 심지어 </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 의 보호는 누군가가 들어 와서 </font><font style="vertical-align: inherit;">원하는 값으로 </font> <code>var</code> <font style="vertical-align: inherit;"> 를 </font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 하는 능력에 의해 가치가 없다고 생각 </font><font style="vertical-align: inherit;">합니다.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"></font> <code>getVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не только </font><font style="vertical-align: inherit;">визуально зашумлен, но и создает иллюзию того, что </font></font> <code>gettingVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> является более сложным процессом, чем на самом деле. То, как вы (как писатель класса) относитесь к святости </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , особенно сбивает с толку пользователя вашего класса, если у него есть промежуточный установщик - тогда похоже, что вы открываете эти ворота, чтобы &laquo;защитить&raquo; то, на чем вы настаиваете, ценно , (святость </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), но даже если вы признаете, </font><font style="vertical-align: inherit;">что защита </font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не стоит того, чтобы кто-то мог просто войти и </font></font> <code>set</code> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на любое значение, которое он хочет, даже если вы даже не смотрите на то, что он делает.</font></font>
zh_cn: <font style="vertical-align: inherit;"></font> <code>getVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">不仅</font><font style="vertical-align: inherit;">视觉上嘈杂，还给人一种幻觉，即</font></font> <code>gettingVar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">在某种程度上比实际情况更复杂。如果您（作为班级编写者）如何看待</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的神圣性，</font><font style="vertical-align: inherit;">如果它具有passthru设置器，这会让您的班级用户特别困惑-看来您正在建立这些大门来&ldquo;保护&rdquo;您坚持认为有价值的东西，（</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的神圣性</font><font style="vertical-align: inherit;">），但是即使您也承认</font></font> <code>var</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">的保护价值并不高，因为任何人只要进入</font> <code>var</code> <font style="vertical-align: inherit;">并将其</font></font> <code>set</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">为他们想要的任何值，而您甚至都不会窥视他们在做什么，就</font><font style="vertical-align: inherit;">没有太大的</font><font style="vertical-align: inherit;">价值。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: Now notice how much more robust this is. We can deal with any type of container in our code now by accepting LiquidContainer instead of Bottle. And how these bottles deal with this sort of stuff can all differ. You can have bottles that write their state to disk when it changes, or bottles that save on SQL databases or GNU knows what else.
es: Ahora noten lo mucho más robusto que es esto.Podemos tratar con cualquier tipo de contenedor en nuestro código ahora aceptando el LiquidContainer en lugar de la botella.Y la forma en que estas botellas tratan con este tipo de cosas puede ser diferente.Puedes tener botellas que escriben su estado en el disco cuando cambia,o botellas que guardan en bases de datos SQL o GNU sabe qué más.
ja: ここで、これがどれだけロバストになったかに注目してください。ボトルの代わりに LiquidContainer を受け入れることで、コード内のあらゆるタイプのコンテナを扱うことができるようになりました。そして、これらのボトルがどのようにこの種のものを扱うかは、すべて異なる可能性があります。状態が変化したときにディスクに書き出すボトルや、SQLデータベースに保存するボトル、GNUは何を知っているかわからないボトルなどがあります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 이것이 훨씬 더 강력하다는 것을 알 수 있습니다. </font><font style="vertical-align: inherit;">이제 Bottle 대신 LiquidContainer를 수락하면 코드에서 모든 유형의 컨테이너를 처리 할 수 ​​있습니다. </font><font style="vertical-align: inherit;">이 병이 이런 종류의 물건을 다루는 방법은 모두 다를 수 있습니다. </font><font style="vertical-align: inherit;">상태가 변경 될 때 디스크에 상태를 기록하는 병이나 SQL 데이터베이스 또는 GNU에 저장된 병이 다른 것을 알고있을 수 있습니다.</font></font>
ru: А теперь заметьте,насколько это надежнее.Теперь мы можем работать с любым типом контейнеров в нашем коде,принимая LiquidContainer вместо Bottle.И то,как эти бутылки справляются с такими вещами,может различаться.Можно иметь бутылки,которые записывают свое состояние на диск,когда оно меняется,или бутылки,которые хранятся в базах данных SQL или GNU знают,что еще.
zh_cn: 现在注意到这是多么的健壮。我们现在可以通过接受LiquidContainer而不是Bottle来处理我们的代码中的任何类型的容器。而这些瓶子如何处理这类东西都可以有不同的处理方式。你可以让瓶子在状态发生变化时将状态写入磁盘,也可以让瓶子保存在SQL数据库或GNU知道其他的东西。

source: Now what if EVERYWHERE in your code you were using the public field and then you realized you need the above requirement? Have fun hunting down every usage of the public field instead of just modifying your setter.
es: ¿Y si en TODOS los lugares de su código estuviera usando el campo público y se diera cuenta de que necesita el requisito anterior? Diviértete cazando cada uso del campo público en lugar de sólo modificar tu setter.
ja: コードの至る所でパブリックフィールドを使用していて、上記の要件が必要であることに気付いたとしたらどうでしょうか?セッターを修正するのではなく、パブリックフィールドの使用法を探してみてください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">이제 코드의 어디에나 퍼블릭 필드를 사용하고 있고 위의 요구 사항이 필요하다는 것을 깨달았다면 어떻게해야합니까? </font><font style="vertical-align: inherit;">세터를 수정하는 대신 퍼블릭 필드의 모든 사용법을 재미있게 찾아보십시오.</font></font>
ru: Что теперь,если КАКОГДА в вашем коде вы использовали публичное поле,а затем поняли,что вам нужно вышеуказанное требование? Получайте удовольствие,отслеживая каждое использование поля public вместо того,чтобы просто модифицировать свой сеттер.
zh_cn: 现在,如果你的代码中的每一个地方都在使用公共字段,然后你发现你需要上述的要求呢?那你就会发现你需要上述的要求。

source: On the other hand, if the member is public, the tools don't make it possible to filter read/write access to the member. So you have to trudge though all uses of the member.
es: Por otro lado,si el miembro es público,las herramientas no permiten filtrar el acceso de lectura y escritura al miembro.Así que tienes que recorrer todos los usos del miembro.
ja: 一方、メンバが公開されている場合、ツールではメンバへの読み書きアクセスをフィルタリングすることができません。そのため、そのメンバーのすべての用途を調べなければなりません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">반면, 멤버가 공개 인 경우 도구를 사용하면 멤버에 대한 읽기 / 쓰기 액세스를 필터링 할 수 없습니다. </font><font style="vertical-align: inherit;">따라서 회원의 모든 용도를 망쳐 놓아야합니다.</font></font>
ru: С другой стороны,если член является публичным,инструменты не позволяют отфильтровать доступ к чтению для члена.Таким образом,вам приходится перебирать все варианты использования этого члена.
zh_cn: 另一方面,如果该成员是公共的,工具无法过滤对该成员的读写权限。因此,你必须对该会员的所有用途进行trudge,虽然会员的所有用途。

source: One advantage of accessors and mutators is that you can perform validation.
es: Una de las ventajas de los accesorios y mutadores es que se puede realizar la validación.
ja: アクセサやミューテータの利点の一つは、バリデーションを実行できることです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">접근 자와 뮤 테이터의 장점 중 하나는 유효성 검사를 수행 할 수 있다는 것입니다.</font></font>
ru: Одним из преимуществ аксессуаров и мутаторов является то,что вы можете выполнять проверку.
zh_cn: 访问器和突变器的一个优点是,你可以进行验证。

source: One aspect I missed in the answers so far, the access specification:
es: Un aspecto que he pasado por alto en las respuestas hasta ahora,la especificación del acceso:
ja: これまでの回答の中で見逃していた一面、アクセスの仕様。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">지금까지 답변에서 놓친 한 가지 측면은 액세스 사양입니다.</font></font>
ru: Один аспект,который я пропустил в ответах,спецификация доступа:
zh_cn: 到目前为止,我错过了一个方面的答案,就是访问规范。

source: One of the basic principals of OO design: <strong>Encapsulation!</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uno de los principios b&aacute;sicos del dise&ntilde;o OO: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;Encapsulaci&oacute;n!</font></font></strong>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OO設計の基本原則の1つ：</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">カプセル化！</font></font></strong>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OO 디자인의 기본 원칙 중 하나 : </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캡슐화!</font></font></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Один из основных принципов ОО дизайна: </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">инкапсуляция!</font></font></strong>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">OO设计的基本原理之一：</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">封装！</font></font></strong>

source: One other use (in languages that support properties) is that setters and getters can imply that an operation is non-trivial. Typically, you want to avoid doing anything that's computationally expensive in a property.
es: Otro uso (en los idiomas que soportan las propiedades)es que los setters y getters pueden implicar que una operación no es trivial.Típicamente,se quiere evitar hacer algo que sea computacionalmente caro en una propiedad.
ja: 他にも(プロパティをサポートする言語では)、セッターやゲッターを使用することで、ある操作が非自明であることを暗示することができます。一般的に、プロパティで計算コストの高いことをするのは避けたいものです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성을 지원하는 언어에서 다른 용도로는 setter와 getter가 조작이 중요하지 않다는 것을 암시 할 수 있습니다. </font><font style="vertical-align: inherit;">일반적으로 속성에서 계산 비용이 많이 드는 작업은 피하려고합니다.</font></font>
ru: Еще одно использование (в языках,поддерживающих свойства)-это то,что сеттеры и геттеры могут подразумевать,что операция является нетривиальной.Обычно,вы хотите избежать делать в свойстве что-то,что связано с большими вычислительными затратами.
zh_cn: 另一个用途(在支持属性的语言中)是,setter和getter可以暗示一个操作是非琐碎的。通常情况下,你要避免在属性中做任何计算成本高的操作。

source: One relatively modern advantage of getters/setters is that is makes it easier to browse code in tagged (indexed) code editors. E.g. If you want to see who sets a member, you can open the call hierarchy of the setter.
es: Una ventaja relativamente moderna de los getterssetters es que facilita la búsqueda de código en los editores de código etiquetados (indexados).Por ejemplo,si quieres ver quién configura un miembro,puedes abrir la jerarquía de llamadas del configurador.
ja: ゲッターセッターの比較的現代的な利点は、タグ付けされた(インデックス化された)コードエディタでのコードの閲覧が容易になることです。例えば、誰がメンバーを設定しているかを知りたい場合は、セッターの呼び出し階層を開くことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter / setter의 상대적으로 현대적인 이점 중 하나는 태그가있는 (색인이있는) 코드 편집기에서 코드를 쉽게 찾을 수 있다는 것입니다. </font><font style="vertical-align: inherit;">예를 들어 누가 멤버를 설정하는지 보려면 세터의 통화 계층을 열 수 있습니다.</font></font>
ru: Относительно современным преимуществом геттерссеттеров является то,что они облегчают просмотр кода в редакторах с тегами (индексированными).Например,если вы хотите посмотреть,кто устанавливает член,вы можете открыть иерархию вызовов сеттера.
zh_cn: getterssetters的一个相对现代的优点是,它使在标签化(索引化)代码编辑器中浏览代码变得更加容易。例如,如果你想看谁设置了一个成员,可以打开设置器的调用层次结构。

source: Please note also that you can't change the capacity of a bottle. It's now set in stone. You could do this with an int by declaring it final. But if this was a list, you could empty it, add new things to it, and so on. You can't limit the access to touching the innards.
es: Tenga en cuenta también que no puede cambiar la capacidad de una botella.Ahora está grabada en piedra.Podrías hacer esto con un int,declarándolo definitivo.Pero si esto fuera una lista,podrías vaciarla,añadirle cosas nuevas,y así sucesivamente.No puedes limitar el acceso a tocar las tripas.
ja: また、ボトルの容量変更はできませんのでご注意ください。これで定石になりました。intであれば、それを最終的なものと宣言することで、これを行うことができます。しかし、これがリストだったら、空にしたり、新しいものを追加したりすることができます。内臓に触れるアクセスを制限することはできません。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">병의 용량은 변경할 수 없습니다. </font><font style="vertical-align: inherit;">이제 돌로 설정되었습니다. </font><font style="vertical-align: inherit;">최종 선언하여 int 로이 작업을 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">그러나이 목록 인 경우 목록을 비우고 새 항목을 추가하는 등의 작업을 수행 할 수 있습니다. </font><font style="vertical-align: inherit;">내부를 만지는 것에 대한 액세스를 제한 할 수 없습니다.</font></font>
ru: Пожалуйста,обратите внимание,что вместимость бутылки не может быть изменена.Теперь она установлена в камне.Ты можешь сделать это с помощью информатора,объявив его окончательным.Но если бы это был список,вы могли бы опустошить его,добавить в него новые вещи и так далее.Ты не можешь ограничить доступ к внутренности.
zh_cn: 还请注意,你不能改变一个瓶子的容量。它现在已经定下来了。你可以通过声明它是最终的,用一个int来做。但如果这是一个列表,你可以清空它,给它添加新的东西,以此类推。你不能限制触碰内脏的访问量。

source: Providing a debugging interception point for when a property changes at runtime - debugging when and where a property changed to a particular value can be quite difficult without this in some languages.
es: Proporcionar un punto de intercepción de depuración para cuando una propiedad cambia en tiempo de ejecución-depurar cuándo y dónde una propiedad cambió a un valor particular puede ser bastante difícil sin esto en algunos idiomas.
ja: 実行時にプロパティが変更されたときのデバッグインターセプトポイントを提供する-プロパティがいつ、どこで特定の値に変更されたかをデバッグするのは、言語によってはこれがないと非常に難しい場合があります。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">런타임에 속성이 변경 될 때 디버깅 차단 지점 제공-일부 언어에서는 속성이 특정 값으로 변경된 시점과 위치를 디버깅하기가 매우 어려울 수 있습니다.</font></font>
ru: Обеспечение точки перехвата при отладке,когда какое-либо свойство изменяется во время выполнения-отладка,когда и где какое-либо свойство изменяется до определенного значения,на некоторых языках может быть довольно сложным без этого.
zh_cn: 当属性在运行时发生变化时,提供一个调试拦截点----在某些语言中,如果没有这个功能,调试属性何时、何地改变为特定的值是相当困难的。
