Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: That said, <em>software development</em> isn't about setting down that final version of the class as if you're pressing some cast iron statue on the first try. While you're working with it, code is more like clay. <strong>It evolves</strong> as you develop it and learn more about the problem domain you are solving. During development classes may interact with each other than they should (dependency you plan to factor out), merge together, or split apart. So I think the debate boils down to people not wanting to religiously write
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dicho esto, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el desarrollo de software</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no se trata de establecer esa versi&oacute;n final de la clase como si estuvieras presionando alguna estatua de hierro fundido en el primer intento. Mientras trabajas con &eacute;l, el c&oacute;digo es m&aacute;s como arcilla. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Evoluciona a</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> medida que lo desarrolla y aprende m&aacute;s sobre el dominio del problema que est&aacute; resolviendo. Durante el desarrollo, las clases pueden interactuar entre s&iacute; de lo que deber&iacute;an (dependencia que planea descontar), fusionarse o separarse. As&iacute; que creo que el debate se reduce a las personas que no quieren escribir religiosamente</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font><font style="vertical-align: inherit;">はいえ</font><font style="vertical-align: inherit;">、</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ソフトウェア開発</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、最初の試行で鋳鉄の彫像を押しているかのように、クラスの最終バージョンを設定することではありません。作業している間、コードは粘土のようになります。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">それは</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">あなたがそれを開発し、あなたが解決している問題領域についてさらに学ぶ</font><strong><font style="vertical-align: inherit;">につれて進化</font></strong><font style="vertical-align: inherit;">します。開発中、クラスは必要以上に相互に影響し合う可能性があり（分解を計画している依存関係）、結合したり、分離したりします。ですから、この論争は、宗教的に書こうとしない人たちにまで及ぶと思います。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">즉, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">소프트웨어 개발</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 은 첫 번째 시도에서 주철 조각상을 누르는 것처럼 클래스의 최종 버전을 설정하는 것이 아닙니다. </font><font style="vertical-align: inherit;">작업하는 동안 코드는 점토와 비슷합니다. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그것은 진화</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 당신이 그것을 개발하고 해결하는 문제 영역에 대해 더 배울 수있다. </font><font style="vertical-align: inherit;">개발 과정에서 클래스는 서로 (인식 할 계획 인 의존성), 서로 합치거나 분리되는 것보다 서로 상호 작용할 수 있습니다. </font><font style="vertical-align: inherit;">그래서 나는 토론이 종교적으로 글을 쓰고 싶지 않은 사람들에게 귀결된다고 생각합니다.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Тем не менее, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">разработка программного обеспечения</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> не сводится к установке окончательной версии класса, как будто вы нажимаете на чугунную статую с первой попытки. Пока вы работаете с ним, код больше похож на глину. </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он развивается по мере того,</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как вы его разрабатываете и узнаете больше о проблемной области, которую вы решаете. Во время разработки классы могут взаимодействовать друг с другом, чем они должны (зависимость, которую вы планируете выделить), объединяться или разделяться. Поэтому я думаю, что дискуссия сводится к людям, которые не хотят писать религиозно</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">也就是说，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">软件开发</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">并不是要设置课程的最终版本，就好像您在第一次尝试时按了一些铸铁雕像一样。使用它时，代码更像黏土。 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">它随着</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您的开发而发展，并更多地了解您要解决的问题领域。在开发过程中，类可能会相互干扰（您打算排除的依赖性），合并在一起或分裂。因此，我认为辩论归结为那些不想信奉宗教信仰的人</font></font>

source: The encapsulation mantra is to make fields private and methods public.
es: El mantra de la encapsulación es hacer los campos privados y los métodos públicos.
ja: カプセル化のマントラは、フィールドを非公開にし、メソッドを公開することです。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">캡슐화 만트라는 필드를 개인용 및 메소드를 공용으로 만드는 것입니다.</font></font>
ru: Мантра инкапсуляции заключается в том,чтобы сделать поля частными и методы публичными.
zh_cn: 封装的口号是让字段私有化,方法公开化。

source: The last three I'm just leaving (N/A or D/C)...
es: Los últimos tres que estoy dejando (NA o DC)...
ja: 最後の3つは出ていくだけなんですが(NAかDCか)...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 마지막으로 떠나는 마지막 3 명 (N / A 또는 D / C) ...</font></font>
ru: Последние три я уже ухожу (NA или DC)...
zh_cn: 后面的三个我刚走(NA或DC)......

source: The two main ones are polymorphism, and validation. Even if it's just a stupid data structure.
es: Los dos principales son el polimorfismo y la validación.Incluso si es sólo una estúpida estructura de datos.
ja: ポリモーフィズムとバリデーションの2本立てです。くだらないデータ構造だとしても
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">두 가지 주요한 것은 다형성과 검증입니다. </font><font style="vertical-align: inherit;">바보 같은 데이터 구조 일지라도.</font></font>
ru: Два основных-полиморфизм и валидация.Даже если это просто глупая структура данных.
zh_cn: 主要有两个,一是多态性,二是验证性。哪怕只是一个愚蠢的数据结构。

source: There are many reasons. My favorite one is when you need to change the behavior or regulate what you can set on a variable. For instance, lets say you had a setSpeed(int speed) method. But you want that you can only set a maximum speed of 100. You would do something like:
es: Hay muchas razones.Mi favorita es cuando necesitas cambiar el comportamiento o regular lo que puedes establecer en una variable.Por ejemplo,digamos que tienes un método setSpeed(int speed).Pero quieres que sólo puedas establecer una velocidad máxima de 100.Harías algo como:
ja: 理由はたくさんあります。私のお気に入りは、動作を変更したり、変数に設定できるものを規制する必要がある場合です。例えば、setSpeed(int speed)メソッドを持っていたとします。しかし、あなたは100の最大速度のみを設定することができます。あなたは次のようなことをします。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">여러 가지 이유가 있습니다. </font><font style="vertical-align: inherit;">내가 가장 좋아하는 것은 동작을 변경하거나 변수에 설정할 수있는 것을 조절해야 할 때입니다. </font><font style="vertical-align: inherit;">예를 들어 setSpeed ​​(int speed) 메서드가 있다고 가정 해 봅시다. </font><font style="vertical-align: inherit;">그러나 최대 속도 100 만 설정할 수 있기를 원합니다.</font></font>
ru: Есть много причин.Моя любимая-это когда нужно изменить поведение или регулировать то,что можно задать в переменной.Например,скажем,у вас был метод setSpeed(int speed).Но вы хотите,чтобы вы могли установить только максимальную скорость 100.Вы бы сделали что-нибудь в этом роде:
zh_cn: 原因有很多。我最喜欢的一个是当你需要改变行为或规范你可以在变量上设置什么的时候。例如,假设你有一个setSpeed(int speed)方法。但你希望你只能设置一个最大速度为100。你会做这样的事情。

source: There are reasons to use getters and setters, but if those reasons don't exist, making getter/setter pairs in the name of false encapsulation gods is not a good thing. Valid reasons to make getters or setters include the things often mentioned as the potential changes you can make later, like validation or different internal representations. Or maybe the value should be readable by clients but not writable (for example, reading the size of a dictionary), so a simple getter is a nice choice. But those reasons should be there when you make the choice, and not just as a potential thing you may want later. This is an instance of YAGNI (<em>You Ain't Gonna Need It</em>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay razones para usar getters y setters, pero si esas razones no existen, hacer pares getter / setter en nombre de dioses de encapsulaci&oacute;n falsa no es algo bueno. </font><font style="vertical-align: inherit;">Las razones v&aacute;lidas para hacer captadores o establecedores incluyen las cosas que a menudo se mencionan como los posibles cambios que puede realizar m&aacute;s adelante, como la validaci&oacute;n o diferentes representaciones internas. </font><font style="vertical-align: inherit;">O tal vez el valor deber&iacute;a ser legible por los clientes pero no escribible (por ejemplo, leer el tama&ntilde;o de un diccionario), por lo que un simple captador es una buena opci&oacute;n. </font><font style="vertical-align: inherit;">Pero esas razones deber&iacute;an estar ah&iacute; cuando elijas, y no solo como algo potencial que podr&iacute;as desear m&aacute;s adelante. </font><font style="vertical-align: inherit;">Esta es una instancia de YAGNI ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No lo vas a necesitar</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッターとセッターを使用する理由はありますが、それらの理由が存在しない場合は、偽のカプセル化の神の名前でゲッターとセッターのペアを作成することは良いことではありません。</font><font style="vertical-align: inherit;">ゲッターまたはセッターを作成する正当な理由には、検証やさまざまな内部表現など、後で行うことができる潜在的な変更としてしばしば言及されるものが含まれます。</font><font style="vertical-align: inherit;">または、値はクライアントによって読み取り可能であるが書き込み可能ではない（たとえば、辞書のサイズを読み取る）必要があるため、単純なゲッターが適切な選択です。</font><font style="vertical-align: inherit;">しかし、これらの理由は、後で選択する可能性があるだけでなく、選択するときにも存在するはずです。</font><font style="vertical-align: inherit;">これはYAGNI（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">You Ai n't Gonna Need It</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）の</font><font style="vertical-align: inherit;">インスタンスです</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">게터와 세터를 사용해야 할 이유가 있지만, 그 이유가 존재하지 않으면 거짓 캡슐화 신의 이름으로 게터 / 세터 쌍을 만드는 것은 좋지 않습니다. 게터 나 세터를 만드는 유효한 이유에는 유효성 검사 또는 다른 내부 표현과 같이 나중에 변경할 수있는 잠재적 변경 사항으로 자주 언급되는 사항이 포함됩니다. 또는 클라이언트가 값을 읽을 수는 있지만 쓸 수 없어야합니다 (예 : 사전의 크기를 읽는 것). 간단한 getter를 선택하는 것이 좋습니다. 그러나 이러한 이유는 나중에 원하는 잠재적 인 것이 아니라 선택을 할 때 있어야합니다. 이것은 YAGNI의 인스턴스입니다 ( </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">You Ai n't Gonna Need It</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Есть причины использовать геттеры и сеттеры, но если этих причин не существует, создание пар геттер / сеттер во имя ложных богов инкапсуляции не очень хорошая вещь. </font><font style="vertical-align: inherit;">Допустимые причины для создания или получения включают в себя такие вещи, которые часто упоминаются как потенциальные изменения, которые вы можете сделать позже, такие как проверка или другие внутренние представления. </font><font style="vertical-align: inherit;">Или, может быть, это значение должно быть доступно для чтения клиентами, но не доступно для записи (например, чтение размера словаря), поэтому простой метод получения - хороший выбор. </font><font style="vertical-align: inherit;">Но эти причины должны быть, когда вы делаете выбор, а не просто как потенциальная вещь, которую вы можете захотеть позже. </font><font style="vertical-align: inherit;">Это пример YAGNI (он </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">тебе не нужен</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">有使用getter和setter的理由，但是如果不存在这些理由，以假封装之神的名义创建getter / setter对将不是一件好事。</font><font style="vertical-align: inherit;">进行getter或setter的有效理由包括经常提到的事情，这些事情是您以后可以进行的潜在更改，例如验证或不同的内部表示形式。</font><font style="vertical-align: inherit;">或者，该值应该对客户端可读，但不可写（例如，读取字典的大小），因此，简单的getter方法是不错的选择。</font><font style="vertical-align: inherit;">但是，当您做出选择时，这些原因应该存在，而不仅仅是以后可能需要的潜在原因。</font><font style="vertical-align: inherit;">这是YAGNI的一个实例（</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">您将不需要它</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">）。</font></font>

source: There are some advantages to using getter and setter methods, such as the ability to let you create members with sophisticated functionality that you can access like properties. They also let you create read-only and write-only properties.
es: Hay algunas ventajas en el uso de los métodos de getter y setter,como la posibilidad de crear miembros con sofisticadas funcionalidades a las que se puede acceder como propiedades.También te permiten crear propiedades de sólo lectura y sólo escritura.
ja: ゲッターメソッドやセッターメソッドを使用する利点は、プロパティのようにアクセスできる洗練された機能を持つメンバーを作成できることなどです。また、読み取り専用のプロパティと書き込み専用のプロパティを作成することもできます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">getter 및 setter 메소드를 사용하면 몇 가지 장점이 있습니다. 예를 들어, 유사한 특성에 액세스 할 수있는 정교한 기능을 가진 멤버를 작성할 수 있습니다. </font><font style="vertical-align: inherit;">또한 읽기 전용 및 쓰기 전용 속성을 만들 수 있습니다.</font></font>
ru: Есть некоторые преимущества в использовании методов getter и setter,такие как возможность позволять вам создавать членов со сложной функциональностью,к которым вы можете получить доступ,как к свойствам.Они также позволяют создавать свойства только для чтения и записи.
zh_cn: 使用getter和setter方法有一些好处,比如可以让你创建具有复杂功能的成员,你可以像访问属性一样访问这些成员。它们还可以让你创建只读和只写属性。

source: There is a good reason to consider using accessors is there is no property inheritance. See next example:
es: Hay una buena razón para considerar el uso de accesorios es que no hay herencia de propiedad.Ver el siguiente ejemplo:
ja: アクセサの使用を検討するには、プロパティの継承がないことには理由があります。次の例を参照してください。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">속성 상속이 없기 때문에 접근자를 사용하는 것이 좋습니다. </font><font style="vertical-align: inherit;">다음 예를 참조하십시오.</font></font>
ru: Существует веская причина рассматривать использование аксессуаров-это отсутствие наследования собственности.См.следующий пример:
zh_cn: 考虑使用访问器有一个很好的理由,那就是没有属性继承。请看下一个例子。

source: There's also the third thing that not everyone has addressed: getters and setters use method calls. That means that they look like normal methods everywhere else does. Instead of having weird specific syntax for DTOs and stuff, you have the same thing everywhere.
es: También hay una tercera cosa que no todos han abordado:los getters y setters usan llamadas de método.Eso significa que se parecen a los métodos normales que se usan en todas partes.En lugar de tener una sintaxis específica rara para los DTOs y esas cosas,tienes lo mismo en todas partes.
ja: また、誰もが取り組んでいない3つ目のことがあります:ゲッターとセッターはメソッドコールを使用します。つまり、どこでも普通のメソッドと同じように見えるということです。DTO などのための奇妙な固有の構文を持つのではなく、どこでも同じものを使うことができます。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">또한 모든 사람이 다룰 수있는 것은 아닙니다. 게터와 세터는 메소드 호출을 사용합니다. </font><font style="vertical-align: inherit;">즉, 다른 곳에서는 일반적인 방법처럼 보입니다. </font><font style="vertical-align: inherit;">DTO 및 물건에 대해 이상한 특정 구문을 사용하는 대신 모든 곳에서 동일한 내용을 갖습니다.</font></font>
ru: Есть также третья вещь,к которой не все обращались:геттеры и сеттеры используют вызовы методов.Это означает,что они выглядят как обычные методы везде.Вместо того,чтобы иметь странный специфический синтаксис для DTO и прочего,у вас везде одно и то же.
zh_cn: 还有第三点不是所有人都涉及到了:getter和setter使用方法调用。这意味着它们看起来就像其他地方的正常方法一样。而不是有奇怪的DTO之类的特殊语法,你在任何地方都是一样的。

source: Think simple, easy, add complexity when needed.
es: Piensa simple,fácil,añade complejidad cuando sea necesario.
ja: シンプルに考えて、簡単に、必要に応じて複雑さを追加します。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">간단하고 쉽게 생각하고 필요할 때 복잡성을 추가하십시오.</font></font>
ru: Думайте просто,легко,добавляйте сложности,когда это необходимо.
zh_cn: 想的简单,容易,需要时增加复杂性。

source: This same argument applies to other supposed advantages of these pass-through getter/setter pairs: if you later decide to change the value being set, you're breaking the contract. If you override the default functionality in a derived class, in a way beyond a few harmless modifications (like logging or other non-observable behaviour), you're breaking the contract of the base class. That is a violation of the Liskov Substitutability Principle, which is seen as one of the tenets of OO.
es: Este mismo argumento se aplica a otras supuestas ventajas de estos pares de pass-through gettersetter:si más tarde decides cambiar el valor que se está fijando,estás rompiendo el contrato.Si anulas la funcionalidad por defecto en una clase derivada,de alguna manera más allá de unas pocas modificaciones inofensivas (como el registro u otro comportamiento no observable),estás rompiendo el contrato de la clase base.Eso es una violación del Principio de Sustituibilidad de Liskov,que es visto como uno de los principios de OO.
ja: この同じ議論は、これらのパススルー型ゲッターセッターペアの他の利点にも当てはまります:後になって設定されている値を変更しようと思ったら、契約を破っていることになります。もし派生クラスのデフォルト機能をオーバーライドした場合、いくつかの無害な変更(ロギングやその他の観測不可能な動作など)を超えた方法で、基底クラスの契約を破っていることになります。これは OO の信条の一つとされる Liskov Substitutability Principle に違反しています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">동일한 인수가 이러한 통과 게터 / 세터 쌍의 다른 가정 된 장점에도 적용됩니다. 나중에 설정중인 값을 변경하기로 결정하면 계약을 위반하게됩니다. </font><font style="vertical-align: inherit;">파생 클래스에서 기본 기능을 재정의하면 몇 가지 무해한 수정 (예 : 로깅 또는 기타 관찰 할 수없는 동작)을 넘어 서면 기본 클래스의 계약을 위반하게됩니다. </font><font style="vertical-align: inherit;">이는 OO의 신조 중 하나로 여겨지는 Liskov Substitutability Principle을 위반하는 것입니다.</font></font>
ru: Этот же аргумент применим и к другим предполагаемым преимуществам этих сквозных пар геттерсеттеров:если вы позже решите изменить установленное значение,вы нарушаете договор.Если вы переопределяете функциональность по умолчанию в производном классе,выходя за рамки нескольких безобидных модификаций (таких как протоколирование или другое ненаблюдаемое поведение),вы нарушаете договор базового класса.Это является нарушением принципа заменяемости Лискова,который рассматривается как один из принципов OO.
zh_cn: 同样的论点也适用于这些直通式取值器对的其他假定的优点:如果你以后决定改变被设置的值,你就是破坏了合约。如果你覆盖了派生类中的默认功能,在一些无害的修改(比如日志或其他不可观测行为)之外,你就违反了基类的契约。这就违反了Liskov Substitutability原则,这被视为OO的原则之一。

source: Those methods are the infamous getter and setter....
es: Esos métodos son el infame "getter and setter"...
ja: それらのメソッドは悪名高いゲッターとセッターです...。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">그 방법은 악명 높은 게터와 세터입니다 ....</font></font>
ru: Эти методы-печально известные геттер и сеттер....
zh_cn: 那些方法就是臭名昭著的getter和setter.....。

source: Understanding a local piece of code at first glance is an important property of good readability that getters and setters tend to break. That is why I try to avoid them when I can, and minimize what they do when I use them.
es: Comprender un código local a primera vista es una propiedad importante de buena legibilidad que los receptores y fijadores tienden a romper.Por eso intento evitarlos cuando puedo,y minimizar lo que hacen cuando los uso.
ja: 一目見てローカルなコードを理解することは、ゲッターやセッターが壊れがちな読みやすさの重要な特性です。だからこそ、私はできる限りそれらを避け、それらを使うときには、それらが何をするかを最小限に抑えるようにしています。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">로컬 코드를 한눈에 이해하는 것은 게터와 세터가 깨지기 쉬운 가독성의 중요한 특성입니다. </font><font style="vertical-align: inherit;">그렇기 때문에 가능한 한 피하는 것을 피하고 사용하면하는 일을 최소화하려고합니다.</font></font>
ru: Понимание локальной части кода на первый взгляд является важным свойством хорошей читабельности,которое геттеры и сеттеры имеют тенденцию ломаться.Поэтому я стараюсь избегать их,когда могу,и минимизировать то,что они делают,когда я их использую.
zh_cn: 第一眼看懂一段局部代码是良好的可读性的重要属性,getter和setter容易被破坏。这就是为什么我在使用它们的时候尽量避免它们,尽量减少它们的作用。

source: We use getters and setters:
es: Usamos getters y setters:
ja: ゲッターとセッターを使います。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 getter와 setter를 사용합니다 :</font></font>
ru: Мы используем геттеры и сеттеры:
zh_cn: 我们使用getter和setter。

source: We'd end up with something like:
es: Terminaríamos con algo como:
ja: 最終的にはこんな感じになるだろう。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">우리는 다음과 같은 결과를 얻었습니다.</font></font>
ru: Мы бы закончили чем-то вроде:
zh_cn: 我们最终会有这样的结果:
