Repository: rueisnom/feedback
Catalog: xlf/15/68/09/1/1568091.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: (Time 1 is the direct way, Time 2 is the getter)
es: (El tiempo 1 es el camino directo,el tiempo 2 es el que lo consigue)
ja: (時間1は直通、時間2はゲッター)
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(시간 1은 직접적인 방법이고 시간 2는 게터입니다)</font></font>
ru: (Время 1-прямой путь,Время 2-геттер)
zh_cn: (时间1是直接方式,时间2是获取者)

source: 1) Start with all public members for basic objects with data and behavior. This is why in all my C++ "example" code you'll notice me using <code>struct</code> instead of <code>class</code> everywhere.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) Comience con todos los miembros p&uacute;blicos para objetos b&aacute;sicos con datos y comportamiento. </font><font style="vertical-align: inherit;">Es por eso que en todo mi c&oacute;digo de "ejemplo" de C ++ me notar&aacute;s usando </font></font> <code>struct</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>class</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> todas partes.</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）データと動作を備えた基本オブジェクトのすべてのパブリックメンバーから始めます。</font><font style="vertical-align: inherit;">これが、すべてのC ++の「サンプル」コード</font><font style="vertical-align: inherit;">で、</font><font style="vertical-align: inherit;">どこでも</font> <code>class</code> <font style="vertical-align: inherit;">なく</font></font> <code>struct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">を使用していることに気付くのはこのためです</font><font style="vertical-align: inherit;">。</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) 데이터와 행동으로 기본 개체에 대한 모든 공개 멤버로 시작하십시오. </font><font style="vertical-align: inherit;">이것이 모든 C ++ "example"코드 </font><font style="vertical-align: inherit;">에서 </font> <code>class</code> <font style="vertical-align: inherit;"> 대신 </font></font> <code>struct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 를 </font><font style="vertical-align: inherit;">사용하는 것을 알 수있는 이유입니다 </font><font style="vertical-align: inherit;">.</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) Начните со всех открытых членов для основных объектов с данными и поведением. </font><font style="vertical-align: inherit;">Вот почему во всем моем &laquo;примерном&raquo; коде C ++ вы заметите, что я </font><font style="vertical-align: inherit;">везде </font><font style="vertical-align: inherit;">использую </font></font> <code>struct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вместо </font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1）从所有具有数据和行为的基本对象的公共成员开始。</font><font style="vertical-align: inherit;">这就是为什么在我所有的C ++&ldquo;示例&rdquo;代码中，您都会注意到我在所有</font><font style="vertical-align: inherit;">地方都</font><font style="vertical-align: inherit;">使用</font></font> <code>struct</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">而不是</font></font> <code>class</code> 的原因<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: 10 million cycles:
es: 10 millones de ciclos:
ja: 1000万サイクル。
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">천만 사이클 :</font></font>
ru: 10 миллионов циклов:
zh_cn: 1000万个周期。

source: 2) When an object's internal behavior for a data member becomes complex enough, (for example, it likes to keep an internal <code>std::list</code> in some kind of order), accessor type functions are written. Because I'm programming by myself, I don't always set the member <code>private</code> right away, but somewhere down the evolution of the class the member will be "promoted" to either <code>protected</code> or <code>private</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) Cuando el comportamiento interno de un objeto para un miembro de datos se vuelve lo suficientemente complejo (por ejemplo, le gusta mantener una </font></font> <code>std::list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> interna </font><font style="vertical-align: inherit;">en alg&uacute;n tipo de orden), se escriben las funciones de tipo de acceso. Debido a que estoy programando solo, no siempre configuro el miembro como </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> inmediato, pero en alg&uacute;n momento de la evoluci&oacute;n de la clase, el miembro ser&aacute; "promovido" a </font></font> <code>protected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）データメンバーに対するオブジェクトの内部動作が十分に複雑になると（たとえば、内部</font></font> <code>std::list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">をなんらかの順序で保持したい場合）、アクセサー型関数が記述されます。私は自分でプログラミングしているので、メンバーを</font><font style="vertical-align: inherit;">すぐに</font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">設定するわけではありません</font><font style="vertical-align: inherit;">が、クラスの進化のどこかで、メンバーは</font></font> <code>protected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">または</font></font> <code>private</code> に<font style="vertical-align: inherit;"><font style="vertical-align: inherit;">「昇格」されます</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) 데이터 멤버에 대한 객체의 내부 동작이 충분히 복잡해지면 (예 </font></font> <code>std::list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 내부 </font><font style="vertical-align: inherit;">std :: list</font><font style="vertical-align: inherit;"> 를 어떤 종류의 순서 </font><font style="vertical-align: inherit;">로 유지하려는 경우 </font><font style="vertical-align: inherit;">) 접근 자 유형 함수가 작성됩니다. 내가 직접 프로그래밍하고 있기 때문에 항상 멤버를 </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 설정하지는 않지만 </font><font style="vertical-align: inherit;">클래스의 발전이 어딘가에서 멤버는 </font></font> <code>protected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 또는 </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 로 "승격"됩니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) Когда внутреннее поведение объекта для члена данных становится достаточно сложным (например, ему нравится хранить внутренний </font></font> <code>std::list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> в некотором порядке), пишутся функции типа средства доступа. Поскольку я сам занимаюсь программированием, я не всегда сразу устанавливаю </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> члена </font><font style="vertical-align: inherit;">, но где-то в процессе эволюции класса член будет &laquo;повышен&raquo; до уровня </font></font> <code>protected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2）当对象的数据成员内部行为变得足够复杂时（例如，它喜欢按</font><font style="vertical-align: inherit;">某种顺序</font><font style="vertical-align: inherit;">保留内部</font></font> <code>std::list</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">），将编写访问器类型函数。因为我是一个人在编程，所以我并不总是立即将成员设置为</font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">，但是在类演变的某个地方，该成员将被&ldquo;提升&rdquo;为</font></font> <code>protected</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">或</font></font> <code>private</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: 3) Classes that are fully fleshed out and have strict rules about their internals (ie <em>they</em> know exactly what they are doing, and you are not to "fuck" (technical term) with its internals) are given the <code>class</code> designation, default private members, and only a select few members are allowed to be <code>public</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3) Las clases que est&aacute;n completamente desarrolladas y tienen reglas estrictas sobre sus componentes internos (es decir </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> saben exactamente lo que est&aacute;n haciendo, y usted no debe "joder" (t&eacute;rmino t&eacute;cnico) con sus </font><font style="vertical-align: inherit;">componentes </font><font style="vertical-align: inherit;">internos) reciben la </font><font style="vertical-align: inherit;">designaci&oacute;n de </font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , miembros privados predeterminados , y solo unos pocos miembros seleccionados pueden ser </font></font> <code>public</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
ja: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3）完全に具体化されており、内部について厳格なルールがあるクラス（つまり</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">、</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クラスは</font><font style="vertical-align: inherit;">何をしているのかを正確に把握しており</font><font style="vertical-align: inherit;">、内部で</font><font style="vertical-align: inherit;">「ファック」（専門用語）してはならない）には、</font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">指定、デフォルトのプライベートメンバー</font><font style="vertical-align: inherit;">が与えられ</font><font style="vertical-align: inherit;">ます、そして限られた数のメンバーだけが</font></font> <code>public</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">許可されています</font><font style="vertical-align: inherit;">。</font></font>
ko: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3) 완전히 구체화하고 자신의 내부에 대한 엄격한 규칙을 (즉이되는 클래스 </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">들은</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 그들이 무엇을 정확히 알고, 당신이 "씨발"(전문 용어로하지 않습니다)의 내부와) 지정된되어 </font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> private 멤버를 기본값을 지정 일부 회원 만 </font></font> <code>public</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 할 수 있습니다 </font><font style="vertical-align: inherit;">.</font></font>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3) Классы, которые полностью проработаны и имеют строгие правила в отношении своих внутренних элементов (то есть </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">они</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> точно знают, что они делают, и вы не должны &laquo;трахать&raquo; (технический термин) с его внутренними </font><font style="vertical-align: inherit;">элементами </font><font style="vertical-align: inherit;">), получают </font><font style="vertical-align: inherit;">обозначение </font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , закрытые члены по умолчанию и только избранным членам разрешено быть </font></font> <code>public</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>
zh_cn: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3）完全充实并且对内部构造有严格规定的类（即，</font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">他们</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">确切地知道自己在做什么，并且您不希望对其内部进行&ldquo;操蛋&rdquo;（技术术语））被赋予</font></font> <code>class</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">名称，默认为私有成员，只有少数几个成员被允许</font></font> <code>public</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">。</font></font>

source: <em>Here are the some of the reasons I am aware of:</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Estas son algunas de las razones que conozco:</font></font></em>
ja: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ここに私が知っているいくつかの理由があります：</font></font></em>
ko: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">내가 알고있는 몇 가지 이유는 다음과 같습니다.</font></font></em>
ru: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот некоторые из причин, которые мне известны:</font></font></em>
zh_cn: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">这是我知道的一些原因：</font></font></em>

source: <strong>Client</strong>: "Oh... cool, I guess?"
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cliente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "Oh ... genial, supongo?"</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クライアント</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：「あら&hellip;&hellip;かっこいいね？」</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "아 ... 근사한 것 같아?"</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Клиент</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "Ох ... круто, наверное?"</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">客户</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：&ldquo;哦，太酷了，我猜是吗？&rdquo;</font></font>

source: <strong>Client</strong>: "What can I do with an object of this class?"
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cliente</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "&iquest;Qu&eacute; puedo hacer con un objeto de esta clase?"</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">クライアント</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：「このクラスのオブジェクトで何ができるか？」</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">클라이언트</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "이 클래스의 객체로 무엇을 할 수 있습니까?"</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Клиент</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : &laquo;Что я могу сделать с объектом этого класса?&raquo;</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">客户</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：&ldquo;我可以用这个类的对象做什么？&rdquo;</font></font>

source: <strong>Code to the interface, not the implementation</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">C&oacute;digo para la interfaz, no la implementaci&oacute;n</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">実装ではなくインターフェースへのコード</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">구현이 아닌 인터페이스에 대한 코드</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Код для интерфейса, а не реализация</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">代码到接口，而不是实现</font></font></strong>

source: <strong>Designer</strong>: "You can read and write several variables."
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dise&ntilde;ador</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "Puedes leer y escribir varias variables".</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">デザイナー</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：「いくつかの変数を読み書きできます。」</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">디자이너</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : "여러 변수를 읽고 쓸 수 있습니다."</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Дизайнер</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : &laquo;Вы можете читать и писать несколько переменных&raquo;.</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">设计器</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">：&ldquo;您可以读写几个变量。&rdquo;</font></font>

source: <strong>Getter Methods:</strong><em>We can get access to private variables.</em>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todos Getter: </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">podemos obtener acceso a variables privadas.</font></font></em>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッターメソッド：</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">プライベート変数にアクセスできます。</font></font></em>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getter 메서드 : </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">개인 변수에 액세스 할 수 있습니다.</font></font></em>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Методы получения: </font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">мы можем получить доступ к закрытым переменным.</font></font></em>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getter方法：</font></font></strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">我们可以访问私有变量。</font></font></em>

source: <strong>Getters</strong> and <strong>setters</strong> are used to implement two of the fundamental aspects of Object Oriented Programming which are:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Getters</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setters</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se utilizan para implementar dos de los aspectos fundamentales de la Programaci&oacute;n Orientada a Objetos que son:</font></font>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ゲッター</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">と</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">セッター</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">は、オブジェクト指向プログラミングの2つの基本的な側面を実装するために使用されます。</font></font>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">게터</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 와 </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">세터</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 는 다음과 같은 객체 지향 프로그래밍의 두 가지 기본 측면을 구현하는 데 사용됩니다.</font></font>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Геттеры</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">сеттеры</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> используются для реализации двух основных аспектов объектно-ориентированного программирования:</font></font>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">使用getter</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">和</font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">setter</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">来实现面向对象编程的两个基本方面：</font></font>

source: <strong>Interfaces only specify methods, not fields</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las interfaces solo especifican m&eacute;todos, no campos</font></font></strong>
ja: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">インターフェイスはフィールドではなくメソッドのみを指定します</font></font></strong>
ko: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">인터페이스는 필드가 아닌 메소드 만 지정합니다.</font></font></strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Интерфейсы только указывают методы, а не поля</font></font></strong>
zh_cn: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">接口仅指定方法，不指定字段</font></font></strong>
