Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: This post: <a href="https://stackoverflow.com/a/4105123/1275169">Undefined, unspecified and implementation-defined behavior</a> is also relevant.
es: Esta publicaci&oacute;n: El <a href="https://stackoverflow.com/a/4105123/1275169">comportamiento indefinido, no especificado y definido por la implementaci&oacute;n</a> tambi&eacute;n es relevante.
ko: 이 게시물 : <a href="https://stackoverflow.com/a/4105123/1275169">정의되지 않은 지정되지 않은 구현 정의 동작</a> 도 관련이 있습니다.
ru: Этот пост: <a href="https://stackoverflow.com/a/4105123/1275169">неопределенное, неопределенное и определяемое реализацией поведение</a> также имеет отношение к делу.
zh_cn: 这篇文章： <a href="https://stackoverflow.com/a/4105123/1275169">未定义，未指定和实现定义的行为</a>也很重要。

source: This too has <em>unspecified behaviour</em> because the order of evaluation of <code>++x</code> and <code>y++</code> is unspecified. But it's perfectly legal and valid statement. There's <em>no</em> undefined behaviour in this statement. Because the modifications (<code>++x</code> and <code>y++</code>) are done to <em>distinct</em> objects.
es: Esto tambi&eacute;n tiene <em>un comportamiento no especificado</em> porque el orden de evaluaci&oacute;n de <code>++x</code> e <code>y++</code> no est&aacute; especificado. Pero es una declaraci&oacute;n perfectamente legal y v&aacute;lida. No <em>hay</em> comportamiento indefinido en esta declaraci&oacute;n. Porque las modificaciones ( <code>++x</code> e <code>y++</code> ) se realizan a objetos <em>distintos</em> .
ko: <code>++x</code> 및 <code>y++</code> 의 평가 순서가 <em>지정되어 있지</em> 않기 때문에 이것도 <em>지정되지 않은 동작을</em> 합니다. 그러나 그것은 완벽하게 합법적이고 유효한 진술입니다. 이 문장 <em>에는</em> 정의되지 않은 동작이 <em>없습니다</em> . 객체를 <em>구별</em> 하기 위해 수정 ( <code>++x</code> 및 <code>y++</code> )이 수행되기 때문입니다.
ru: Это также имеет <em>неопределенное поведение,</em> потому что порядок вычисления <code>++x</code> и <code>y++</code> не указан. Но это совершенно законное и обоснованное утверждение. Там <em>нет</em> неопределенного поведения в этом утверждении. Потому что изменения ( <code>++x</code> и <code>y++</code> ) выполняются для <em>разных</em> объектов.
zh_cn: 这也具有<em>未指定的行为，</em>因为 <code>++x</code> 和 <code>y++</code> 的求值顺序未指定。 但这是完全合法有效的声明。 此语句中<em>没有</em>未定义的行为。 因为修改（ <code>++x</code> 和 <code>y++</code> ）是针对<em>不同的</em>对象进行的。

source: Use of an unspecified value, or other behavior where this International Standard provides two or more possibilities and imposes no further requirements on which is chosen in any instance.
es: Utilización de un valor no especificado,u otro comportamiento en el que esta Norma Internacional proporcione dos o más posibilidades y no imponga ningún otro requisito sobre el que se elija en ningún caso.
ko: 지정되지 않은 값 또는이 국제 표준이 둘 이상의 가능성을 제공하고 어떤 경우에도 선택되는 추가 요구 사항을 부과하지 않는 기타 행동의 사용.
ru: Использование неопределенного значения,или другое поведение,когда данный международный стандарт предоставляет две или более возможности и не налагает никаких дополнительных требований,которые выбраны в любом случае.
zh_cn: 使用未指定的值,或本国际标准规定了两种或两种以上的可能性,并且在任何情况下都不对选择哪种可能性提出进一步要求的其他行为。

source: We also have <em>undefined behavior</em> here as well since the program is modifying variables(<code>i</code>, <code>u</code>, etc..) more than once between <a href="http://en.wikipedia.org/wiki/Sequence_point">sequence points</a>. From draft standard section <code>6.5</code> paragraph <em>2</em>(<em>emphasis mine</em>):
es: Tambi&eacute;n tenemos <em>un comportamiento indefinido</em> aqu&iacute;, ya que el programa est&aacute; modificando variables ( <code>i</code> , <code>u</code> , etc.) m&aacute;s de una vez entre <a href="http://en.wikipedia.org/wiki/Sequence_point">puntos de secuencia</a> . Del borrador de la secci&oacute;n <code>6.5</code> , p&aacute;rrafo <em>2</em> ( <em>&eacute;nfasis m&iacute;o</em> ):
ko: 프로그램이 <a href="http://en.wikipedia.org/wiki/Sequence_point">시퀀스 포인트</a> 사이에서 변수 ( <code>i</code> , <code>u</code> 등)를 두 번 이상 수정하기 때문에 여기에도 <em>정의되지 않은 동작이</em> 있습니다. 표준 섹션 <code>6.5</code> 단락 <em>2</em> ( <em>강조 광산</em> )에서 :
ru: У нас также есть <em>неопределенное поведение,</em> так как программа изменяет переменные ( <code>i</code> , <code>u</code> и т. Д.) Более одного раза между <a href="http://en.wikipedia.org/wiki/Sequence_point">точками последовательности</a> . Из проекта стандарта раздела <code>6.5</code> , параграф <em>2</em> ( <em>выделено мной</em> ):
zh_cn: 由于程序在<a href="http://en.wikipedia.org/wiki/Sequence_point">序列点</a>之间多次修改变量（ <code>i</code> ， <code>u</code> 等），因此我们在这里也具有<em>未定义的行为</em> 。 从标准草案第 <code>6.5</code> 条第<em>2</em>款（ <em>重点是我的</em> ）：

source: We used to spend countless hours on comp.lang.c discussing expressions like these and <em>why</em> they're undefined. Two of my longer answers, that try to really explain why, are archived on the web:
es: Sol&iacute;amos pasar innumerables horas comp.lang.c discutiendo expresiones como estas y <em>por qu&eacute;</em> no est&aacute;n definidas. Dos de mis respuestas m&aacute;s largas, que intentan explicar realmente por qu&eacute;, est&aacute;n archivadas en la web:
ko: 우리는 comp.lang.c에서 이와 같은 표현과 <em>왜</em> 정의되지 <em>않은지에</em> 대해 많은 시간을 보냈습니다. 이유를 설명하려는 더 긴 두 가지 답변이 웹에 보관됩니다.
ru: Мы привыкли тратить бесчисленные часы на comp.lang.c, обсуждая подобные выражения и <em>почему</em> они не определены. Два моих более длинных ответа, которые пытаются действительно объяснить, почему, заархивированы в Интернете:
zh_cn: 过去，我们在comp.lang.c上花费了无数的时间来讨论诸如此类的表达式以及它们<em>为何</em>未定义的原因。 我的两个较长的答案（试图真正解释原因）已存储在网络上：

source: What about this crazy expression?
es: ¿Qué hay de esta expresión de locura?
ko: 이 미친 표현은 어떻습니까?
ru: А как же это безумное выражение?
zh_cn: 那么这个疯狂的表情呢?

source: What makes an expression undefined? Are expressions involving <code>++</code> and <code>--</code> always undefined? Of course not: these are useful operators, and if you use them properly, they're perfectly well-defined.
es: &iquest;Qu&eacute; hace que una expresi&oacute;n sea indefinida? &iquest;Las expresiones que involucran <code>++</code> y <code>--</code> siempre est&aacute;n indefinidas? Por supuesto que no: estos son operadores &uacute;tiles, y si los usa correctamente, est&aacute;n perfectamente bien definidos.
ko: 식이 정의되지 않은 이유는 무엇입니까? <code>++</code> 및 <code>--</code> 와 관련된 표현식이 항상 정의되어 있지 않습니까? 물론 아닙니다 : 이들은 유용한 연산자이며 올바르게 사용하면 완벽하게 정의됩니다.
ru: Что делает выражение неопределенным? Выражения с участием <code>++</code> и <code>--</code> всегда неопределены? Конечно, нет: это полезные операторы, и если вы используете их правильно, они совершенно четко определены.
zh_cn: 是什么使表达式不确定？ 表达式是否涉及 <code>++</code> 和 <code>--</code> 始终未定义？ 当然不是：它们是有用的运算符，如果正确使用它们，它们的定义就很好。

source: What renders the following statement
es: Lo que hace que la siguiente declaración
ko: 다음 진술을하는 것
ru: Что делает следующее заявление
zh_cn: 是什么使下面这句话变成了

source: Where several operators appear together, they have equal precedence and are evaluated according to their associativity. The operators in the table are described in the sections beginning with Postfix Operators.
es: Cuando varios operadores aparecen juntos,tienen igual precedencia y se evalúan según su asociatividad.Los operadores de la tabla se describen en las secciones que comienzan con Operadores de Postfix.
ko: 여러 연산자가 함께 나타나는 경우 우선 순위가 같고 연관성에 따라 평가됩니다. 표의 연산자는 접미사 연산자로 시작하는 섹션에 설명되어 있습니다.
ru: Там,где несколько операторов появляются вместе,они имеют одинаковый приоритет и оцениваются в соответствии с их ассоциативностью.Операторы в таблице описаны в разделах,начинающихся с Постфиксных операторов.
zh_cn: 当几个运算符一起出现时,它们具有同等的优先级,并根据它们的关联性进行评估。表中的运算符在从后缀运算符开始的章节中描述。

source: While I don't think any processors support the hardware to allow such a thing to be done efficiently, one can easily imagine situations where such behavior would make multi-threaded code easier (e.g. it would guarantee that if two threads try to perform the above sequence simultaneously, <code>i</code> would get incremented by two) and it's not totally inconceivable that some future processor might provide a feature something like that.
es: Si bien no creo que ning&uacute;n procesador sea compatible con el hardware para permitir que tal cosa se haga de manera eficiente, uno puede imaginar f&aacute;cilmente situaciones en las que tal comportamiento har&iacute;a m&aacute;s f&aacute;cil el c&oacute;digo multiproceso (por ejemplo, garantizar&iacute;a que si dos hilos intentan realizar lo anterior secuencia simult&aacute;nea, <code>i</code> incrementar&iacute;a en dos) y no es totalmente inconcebible que alg&uacute;n procesador futuro pueda proporcionar una caracter&iacute;stica como esa.
ko: 프로세서가 그러한 일을 효율적으로 수행 할 수 있도록 하드웨어를 지원한다고 생각하지는 않지만 그러한 행동으로 인해 멀티 스레드 코드를 더 쉽게 만드는 상황을 쉽게 상상할 수 있습니다 (예 : 두 개의 스레드가 위의 작업을 수행하려고하면 보장 할 것입니다) 동시에 두 개씩 증가합니다) 그리고 미래의 일부 프로세서가 이와 같은 기능을 제공 할 수는 없습니다.
ru: Хотя я не думаю, что какие-либо процессоры поддерживают аппаратное обеспечение, позволяющее эффективно выполнять такие действия, можно легко представить себе ситуации, в которых такое поведение могло бы упростить многопоточный код (например, это гарантировало бы, что если два потока попытаются выполнить описанное выше) Последовательность одновременно, <code>i</code> бы увеличился на два), и не исключено, что какой-нибудь будущий процессор может обеспечить такую ​​функцию.
zh_cn: 虽然我不认为任何处理器都支持硬件来有效地完成这样的事情，但人们可以轻松想象这种行为会使多线程代码更容易的情况（例如，如果两个线程尝试执行上述操作，则可以保证这种情况）序列同时， <code>i</code> 将增加两个），并且将来的处理器可能会提供类似的功能并不是完全不可想象的。

source: While it is unlikely that any compilers and processors would actually do so, it would be legal, under the C standard, for the compiler to implement "i++" with the sequence:
es: Si bien es poco probable que ningún compilador o procesador lo haga realmente,sería legal,con arreglo a la norma C,que el compilador implementara "i++" con la secuencia:
ko: 컴파일러와 프로세서가 실제로 그렇게 할 가능성은 낮지 만 C 표준에 따라 컴파일러가 시퀀스로 "i ++"를 구현하는 것이 합법적입니다.
ru: Хотя маловероятно,что какие-либо компиляторы и процессоры на самом деле сделают это,было бы законно,согласно стандарту Си,чтобы компилятор реализовывал "i++" с этой последовательностью:
zh_cn: 虽然不太可能有任何编译器和处理器真的会这样做,但在C标准下,编译器用序列实现 "i++"是合法的。

source: While the <strong>syntax</strong> of the expressions like <code>a = a++</code> or <code>a++ + a++</code> is legal, the <strong>behaviour</strong> of these constructs is <strong>undefined</strong> because a <strong><em>shall</em></strong> in C standard is not obeyed. <a href="http://port70.net/~nsz/c/c99/n1256.html#6.5p2">C99 6.5p2</a>:
es: Si bien la <strong>sintaxis</strong> de las expresiones como <code>a = a++</code> o <code>a++ + a++</code> es legal, el <strong>comportamiento</strong> de estas construcciones <strong>no</strong> est&aacute; <strong>definido</strong> porque no se obedece un <strong><em>will</em></strong> en el est&aacute;ndar C. <a href="http://port70.net/~nsz/c/c99/n1256.html#6.5p2">C99 6.5p2</a> :
ko: <code>a = a++</code> 또는 <code>a++ + a++</code> 와 같은 표현식의 <strong>구문</strong> 은 합법적이지만 C 표준의 <strong><em>shall</em></strong> 이 준수 <strong>되지</strong> 않기 때문에 이러한 구문의 <strong>동작</strong> 은 <strong>정의되지</strong> 않습니다. <a href="http://port70.net/~nsz/c/c99/n1256.html#6.5p2">C99 6.5p2</a> :
ru: Хотя <strong>синтаксис</strong> выражений, таких как <code>a = a++</code> или <code>a++ + a++</code> является допустимым, <strong>поведение</strong> этих конструкций не <strong>определено,</strong> поскольку в стандарте C не соблюдается. <a href="http://port70.net/~nsz/c/c99/n1256.html#6.5p2">C99 6.5p2</a> :
zh_cn: 尽管像 <code>a = a++</code> 或 <code>a++ + a++</code> 之类的表达式的<strong>语法</strong>是合法的，但<strong>未定义</strong>这些构造的<strong>行为</strong> ，因为未遵循C标准中的a must。 <a href="http://port70.net/~nsz/c/c99/n1256.html#6.5p2">C99 6.5p2</a> ：

source: While this is also <a href="https://en.wikipedia.org/wiki/Undefined_behavior"><em>undefined behaviour</em></a> as stated already, there are subtle differences when <code>printf()</code> is involved when comparing to a statement such as:
es: Si bien esto tambi&eacute;n es <a href="https://en.wikipedia.org/wiki/Undefined_behavior"><em>un comportamiento indefinido,</em></a> como ya se dijo, existen diferencias sutiles cuando <code>printf()</code> est&aacute; involucrado cuando se compara con una declaraci&oacute;n como:
ko: 이것은 이미 언급 한 바와 같이 <a href="https://en.wikipedia.org/wiki/Undefined_behavior"><em>정의되지 않은 동작</em></a> 이지만, <code>printf()</code> 가 다음과 같은 명령문과 비교할 때 미묘한 차이점이 있습니다.
ru: Хотя это также <a href="https://en.wikipedia.org/wiki/Undefined_behavior"><em>неопределенное поведение,</em></a> как уже говорилось, есть небольшие различия, когда <code>printf()</code> участвует в сравнении с таким утверждением, как:
zh_cn: 如上所述，虽然这也是<a href="https://en.wikipedia.org/wiki/Undefined_behavior"><em>未定义的行为</em></a> ，但是与以下语句进行比较时，在涉及 <code>printf()</code> 时仍存在细微差别：

source: Why are these constructs using pre and post-increment undefined behavior
es: ¿Por qué estas construcciones usan un comportamiento indefinido pre y post-incremento
ko: 사전 및 사후 증가 정의되지 않은 동작을 사용하는 이유는 무엇입니까?
ru: Почему эти конструкции используют пред-и пост-инкрементное неопределённое поведение.
zh_cn: 为什么这些构造物使用了增量前和增量后的未定义行为?

source: Why doesn't the Standard define what these do?
es: ¿Por qué el Estándar no define lo que estos hacen?
ko: 왜 표준이 이것들을 무엇으로 정의하지 않습니까?
ru: Почему бы Стандарту не определить,что они делают?
zh_cn: 为什么《标准》不规定这些是干什么的?

source: With <a href="http://port70.net/~nsz/c/c99/n1256.html#note73">footnote 73</a> further clarifying that
es: Con la <a href="http://port70.net/~nsz/c/c99/n1256.html#note73">nota a pie de p&aacute;gina 73</a> aclarando m&aacute;s que
ko: <a href="http://port70.net/~nsz/c/c99/n1256.html#note73">각주 73</a> 더 명확하게
ru: В <a href="http://port70.net/~nsz/c/c99/n1256.html#note73">сноске 73</a> уточняется, что
zh_cn: <a href="http://port70.net/~nsz/c/c99/n1256.html#note73">脚注73</a>进一步阐明了这一点

source: You can detect such errors in a program by for example using a recent version of GCC with <code>-Wall</code> and <code>-Werror</code>, and then GCC will outright refuse to compile your program. The following is the output of gcc (Ubuntu 6.2.0-5ubuntu12) 6.2.0 20161005:
es: Puede detectar dichos errores en un programa, por ejemplo, utilizando una versi&oacute;n reciente de GCC con <code>-Wall</code> y <code>-Werror</code> , y luego GCC se negar&aacute; por completo a compilar su programa. La siguiente es la salida de gcc (Ubuntu 6.2.0-5ubuntu12) 6.2.0 20161005:
ko: 예를 들어 <code>-Wall</code> 및 <code>-Werror</code> 와 함께 최신 버전의 GCC를 사용하여 프로그램에서 이러한 오류를 감지하면 GCC가 프로그램 컴파일을 거부합니다. 다음은 gcc (Ubuntu 6.2.0-5ubuntu12) 6.2.0 20161005의 출력입니다.
ru: Вы можете обнаружить такие ошибки в программе, например, используя последнюю версию GCC с <code>-Wall</code> и <code>-Werror</code> , и тогда GCC полностью откажется компилировать вашу программу. Ниже приведен вывод gcc (Ubuntu 6.2.0-5ubuntu12) 6.2.0 20161005:
zh_cn: 您可以通过例如使用带有 <code>-Wall</code> 和 <code>-Werror</code> 的最新版本的GCC来检测程序中的此类错误，然后GCC将完全拒绝编译您的程序。 以下是gcc（Ubuntu 6.2.0-5ubuntu12）6.2.0 20161005的输出：

source: You might imagine that precedence or associativity or left-to-right evaluation tells you what order things happen in, but they do not. You may not believe me, but please take my word for it, and I'll say it again: precedence and associativity do not determine every aspect of the evaluation order of an expression in C. In particular, if within one expression there are multiple different spots where we try to assign a new value to something like <code>x</code>, precedence and associativity do <em>not</em> tell us which of those attempts happens first, or last, or anything.
es: Puede imaginar que la precedencia o la asociatividad o la evaluaci&oacute;n de izquierda a derecha le dicen en qu&eacute; orden suceden las cosas, pero no es as&iacute;. Puede que no me creas, pero por favor toma mi palabra y lo dir&eacute; nuevamente: la precedencia y la asociatividad no determinan todos los aspectos del orden de evaluaci&oacute;n de una expresi&oacute;n en C. En particular, si dentro de una expresi&oacute;n hay m&uacute;ltiples diferentes lugares donde tratamos de asignar un nuevo valor a algo como <code>x</code> , la precedencia y la asociatividad <em>no</em> nos dicen cu&aacute;l de esos intentos ocurre primero, o el &uacute;ltimo, o algo as&iacute;.
ko: 우선 순위 또는 연관성 또는 왼쪽에서 오른쪽으로 평가하면 어떤 순서로 발생하는지 알 수 있지만 그렇지 않습니다. 당신은 저를 믿지 않을 수도 있지만, 제 말을 들어주세요. 다시 말하겠습니다. 우선 순위와 연관성은 C에서 표현식의 평가 순서의 모든 측면을 결정하지는 않습니다. 특히, 하나의 표현식 내에 여러 개가있는 경우 <code>x</code> , 우선 순위 및 연관성에 새로운 값을 할당하려고하는 다른 지점은 이러한 시도 중 어느 것이 처음 또는 마지막으로 발생하는지 또는 다른 것을 알려주지 <em>않습니다</em> .
ru: Вы можете себе представить, что приоритет или ассоциативность или оценка слева направо говорит вам, в каком порядке происходят вещи, но это не так. Вы можете не верить мне, но, пожалуйста, поверьте мне на слово, и я скажу это снова: приоритет и ассоциативность не определяют каждый аспект порядка вычисления выражения в C. В частности, если в одном выражении есть несколько различные места, где мы пытаемся присвоить новое значение чему-либо, например, <code>x</code> , приоритет и ассоциативность, <em>не</em> говорят нам, какая из этих попыток происходит первой, последней или какой-либо другой.
zh_cn: 您可能会想象优先级，关联性或从左至右的评估告诉您事情发生的顺序，但事实却并非如此。 您可能不相信我，但请您信守我的诺言，我再说一遍：优先级和关联性并不能确定C中表达式的求值顺序的每个方面。特别是，如果一个表达式中有多个在我们尝试为 <code>x</code> ，优先级和关联性之类的值分配新值的不同地方，并<em>不能</em>告诉我们这些尝试中的哪一个首先发生，最后发生或发生什么。

source: Your most interesting-looking example, the one with
es: Su ejemplo más interesante,el que tiene
ko: 가장 흥미로운 예,
ru: Твой самый интересный пример,тот,что с
zh_cn: 你最有趣的例子,就是那个有

source: Your question was probably not, "Why are these constructs undefined behavior in C?". Your question was probably, "Why did this code (using <code>++</code>) not give me the value I expected?", and someone marked your question as a duplicate, and sent you here.
es: Su pregunta probablemente no fue, "&iquest;Por qu&eacute; estas construcciones no tienen un comportamiento definido en C?". Probablemente su pregunta fue: "&iquest;Por qu&eacute; este c&oacute;digo (usando <code>++</code> ) no me dio el valor que esperaba?", Y alguien marc&oacute; su pregunta como un duplicado y lo envi&oacute; aqu&iacute;.
ko: 귀하의 질문은 아마도 "왜 이러한 구성이 C에서 정의되지 않은 동작입니까?" 귀하의 질문은 아마도 "이 코드 ( <code>++</code> 사용)가 나에게 기대 한 값을주지 않은 이유는 무엇입니까?"였을 것이고 누군가 누군가 귀하의 질문을 중복으로 표시하고 여기로 보냈습니다.
ru: Ваш вопрос был, вероятно, не &laquo;Почему эти конструкции неопределенного поведения в C?&raquo;. Ваш вопрос был, вероятно, &laquo;Почему этот код (с использованием <code>++</code> ) не дал мне ожидаемого значения?&raquo;, И кто-то пометил ваш вопрос как дубликат и отправил вас сюда.
zh_cn: 您的问题可能不是，&ldquo;为什么这些构造在C中未定义行为？&rdquo;。 您的问题可能是，&ldquo;为什么这段代码（使用 <code>++</code> ）没有给我期望的值？&rdquo;，有人将您的问题标记为重复，然后将您发送给这里。

source: according to <a href="http://helpcentreonline.com/article/operator_console_gcc.pdf">GCC C++: Operators</a>
es: seg&uacute;n <a href="http://helpcentreonline.com/article/operator_console_gcc.pdf">GCC C ++: operadores</a>
ko: <a href="http://helpcentreonline.com/article/operator_console_gcc.pdf">GCC C ++</a> 에 따르면 : 연산자
ru: согласно <a href="http://helpcentreonline.com/article/operator_console_gcc.pdf">GCC C ++: операторы</a>
zh_cn: 根据<a href="http://helpcentreonline.com/article/operator_console_gcc.pdf">GCC C ++：运算符</a>

source: and 6.5.16 Assignment operators, &sect;4:
es: y 6.5.16 Operadores de asignaci&oacute;n, &sect;4:
ko: 6.5.16 할당 연산자, &sect;4 :
ru: и 6.5.16 Операторы присваивания, &sect;4:
zh_cn: 和6.5.16赋值运算符，第4节：

source: and <em>undefined behavior</em> is defined in section <code>3.4.3</code> as:
es: y el <em>comportamiento indefinido</em> se define en la secci&oacute;n <code>3.4.3</code> como:
ko: <em>정의되지 않은 동작</em> 은 섹션 <code>3.4.3</code> 에서 다음과 같이 정의됩니다.
ru: и <em>неопределенное поведение</em> определяется в разделе <code>3.4.3</code> как:
zh_cn: <em>未定义的行为</em>在 <code>3.4.3</code> 节中定义为：

source: and notes that:
es: y toma nota de eso:
ko: 그리고 메모 :
ru: и отмечает это:
zh_cn: 并注意到:

source: and so on violate that rule. The standard also says that behavior is undefined and not unspecified. Some compilers do detect these and produce some result but this is not per standard.
es: y así sucesivamente violar esa regla.La norma también dice que el comportamiento es indefinido y no sin especificar.Algunos compiladores los detectan y producen algún resultado,pero esto no es por el estándar.
ko: 그 규칙에 위배됩니다. 이 표준은 또한 행동이 정의되지 않았으며 지정되지 않았다고 말합니다. 일부 컴파일러는이를 감지하여 일부 결과를 생성하지만 이는 표준에 맞지 않습니다.
ru: и так далее нарушать это правило.Стандарт также говорит о том,что поведение не определено и не является неопределенным.Некоторые компиляторы обнаруживают их и дают некоторый результат,но это не соответствует стандарту.
zh_cn: 等违反了该规则。标准还说,行为是未定义的,不是未指定的。有些编译器确实会检测到这些,并产生一些结果,但这不是按标准规定的。

source: as <em>undefined behaviour</em> is the fact that these two expressions modify the <em>same</em> object <code>i</code> without an intervening <a href="https://en.wikipedia.org/wiki/Sequence_point"><em>sequence point</em></a>.
es: como <em>comportamiento indefinido</em> es el hecho de que estas dos expresiones modifican el <em>mismo</em> objeto <code>i</code> sin un <a href="https://en.wikipedia.org/wiki/Sequence_point"><em>punto de secuencia</em></a> intermedio.
ko: <em>정의되지 않은 동작</em> 은이 두 표현식이 중간 <a href="https://en.wikipedia.org/wiki/Sequence_point"><em>시퀀스 포인트</em></a> 없이 <em>동일한</em> 객체 <code>i</code> 를 수정한다는 사실입니다.
ru: <em>неопределенным поведением</em> является тот факт, что эти два выражения модифицируют один и тот <em>же</em> объект <code>i</code> без промежуточной <a href="https://en.wikipedia.org/wiki/Sequence_point"><em>точки последовательности</em></a> .
zh_cn: 由于<em>未定义的行为</em> ，这两个表达式修改了<em>同一</em>对象 <code>i</code> 而中间没有<a href="https://en.wikipedia.org/wiki/Sequence_point"><em>序列点</em></a> 。

source: as Visual Studio documentation states at <a href="https://msdn.microsoft.com/en-us/library/2bxt6kc4.aspx">Precedence and Order of Evaluation</a>:
es: como lo indica la documentaci&oacute;n de Visual Studio en <a href="https://msdn.microsoft.com/en-us/library/2bxt6kc4.aspx">Precedencia y orden de evaluaci&oacute;n</a> :
ko: <a href="https://msdn.microsoft.com/en-us/library/2bxt6kc4.aspx">우선 순위 및 평가 순서에</a> Visual Studio 설명서가 명시되어 있습니다.
ru: как указано в документации Visual Studio в порядке <a href="https://msdn.microsoft.com/en-us/library/2bxt6kc4.aspx">приоритета и порядке оценки</a> :
zh_cn: 正如Visual Studio文档在<a href="https://msdn.microsoft.com/en-us/library/2bxt6kc4.aspx">评估的优先级和顺序中</a>指出的那样 ：

source: because both all these forms to interpret the code <code>i=i++</code> are valid and because both generate different answers, the behavior is undefined.
es: porque ambas formas para interpretar el c&oacute;digo <code>i=i++</code> son v&aacute;lidas y porque ambas generan respuestas diferentes, el comportamiento es indefinido.
ko: 코드 <code>i=i++</code> 를 해석하는 이러한 모든 형식이 유효하고 둘 다 다른 응답을 생성하기 때문에 동작이 정의되지 않습니다.
ru: поскольку обе эти формы для интерпретации кода <code>i=i++</code> являются допустимыми, и поскольку обе выдают разные ответы, поведение не определено.
zh_cn: 因为所有这两种解释代码 <code>i=i++</code> 都是有效的，并且因为两者都生成不同的答案，所以行为是不确定的。

source: behavior, upon use of a nonportable or erroneous program construct or of erroneous data, for which this International Standard imposes no requirements
es: comportamiento,al utilizar una construcción de programa no portátil o errónea o de datos erróneos,para los cuales esta Norma Internacional no impone ningún requisito
ko: 휴대 할 수 없거나 잘못된 프로그램 구조 또는 잘못된 데이터를 사용하는 경우,이 표준에 요구 사항이없는 행동
ru: поведение,при использовании некорректной или ошибочной программной конструкции или ошибочных данных,к которым настоящий Международный стандарт не предъявляет требований
zh_cn: 在使用非便携式或错误的程序结构或错误的数据时的行为,本国际标准没有规定任何要求。

source: can be interpreted as
es: puede ser interpretado como
ko: 로 해석 될 수있다
ru: может быть истолковано как
zh_cn: 可以理解为
