Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: C, of course, has a handy shortcut:
es: C,por supuesto,tiene un atajo práctico:
ko: 물론 C에는 편리한 단축키가 있습니다.
ru: У C,конечно,есть удобный короткий путь:
zh_cn: C,当然也有一个方便的捷径。

source: Depending on whether assignment occurs before or after the increment, different results will be produced and that's the one of the case of <strong>undefined behavior</strong>.
es: Dependiendo de si la asignaci&oacute;n ocurre antes o despu&eacute;s del incremento, se producir&aacute;n resultados diferentes y ese es el caso del <strong>comportamiento indefinido</strong> .
ko: 할당이 증분 이전 또는 이후에 발생하는지에 따라 다른 결과가 생성되며 이는 <strong>정의되지 않은 동작</strong> 의 경우입니다.
ru: В зависимости от того, происходит ли присвоение до или после приращения, будут получены разные результаты, и это один из случаев <strong>неопределенного поведения</strong> .
zh_cn: 根据赋值是在增量之前还是之后进行，将产生不同的结果，这就是<strong>不确定行为的一种</strong> 。

source: Doesn't operator precedence determine the order of evaluation?
es: ¿No determina la precedencia del operador el orden de la evaluación?
ko: 운영자 우선 순위가 평가 순서를 결정하지 않습니까?
ru: Разве приоритет оператора не определяет порядок оценки?
zh_cn: 操作者的优先级不决定评价顺序吗?

source: EXAMPLE An example of unspecified behavior is the order in which the arguments to a function are evaluated.
es: EJEMPLO Un ejemplo de comportamiento no especificado es el orden en que se evalúan los argumentos de una función.
ko: 예 지정되지 않은 동작의 예는 함수의 인수가 평가되는 순서입니다.
ru: ПРИМЕР Пример неуказанного поведения-порядок вычисления аргументов к функции.
zh_cn: 例子 未指定行为的一个例子是对一个函数的参数进行评价的顺序。

source: Evaluations can be one of two things:
es: Las evaluaciones pueden ser una de dos cosas:
ko: 평가는 다음 두 가지 중 하나 일 수 있습니다.
ru: Оценка может быть одной из двух вещей:
zh_cn: 评价可以是两种情况之一。

source: For the expressions we're talking about what makes them undefined is when there's too much going on at once, when we're not sure what order things will happen in, but when the order matters to the result we get.
es: Porque las expresiones de las que hablamos lo que las hace indefinidas es cuando ocurren demasiadas cosas a la vez,cuando no estamos seguros de en qué orden ocurrirán las cosas,pero cuando el orden importa para el resultado que obtenemos.
ko: 표현을 위해 우리가 그것들을 정의하지 않는 것은 한 번에 너무 많은 일이 발생하는 경우, 어떤 일이 일어날 지 확실하지 않지만 결과가 우리의 결과에 중요 할 때입니다.
ru: Для выражений,о которых мы говорим,что делает их неопределенными,это когда происходит слишком много сразу,когда мы не уверены,в каком порядке будут происходить вещи,но когда порядок имеет значение для результата,который мы получаем.
zh_cn: 对于我们所说的表达式来说,让它们无法定义的是,当一次发生的事情太多了,当我们不确定事情会按照什么顺序发生,但当顺序对我们得到的结果很重要的时候。

source: For those who are new to <em>undefined behaviour</em> would benefit from reading <a href="http://blog.llvm.org/2011/05/what-every-c-programmer-should-know.html">What Every C Programmer Should Know About Undefined Behavior</a> to understand the concept and many other variants of undefined behaviour in C.
es: Para aquellos que son nuevos en el <em>comportamiento indefinido,</em> se beneficiar&iacute;an de leer <a href="http://blog.llvm.org/2011/05/what-every-c-programmer-should-know.html">Lo que todo programador de C debe saber sobre el comportamiento indefinido</a> para comprender el concepto y muchas otras variantes del comportamiento indefinido en C.
ko: <em>정의되지 않은 행동을</em> 처음 접하는 사람들에게는 <a href="http://blog.llvm.org/2011/05/what-every-c-programmer-should-know.html">모든 C 프로그래머가 정의되지 않은 행동</a> 에 대해 알아야 할 내용 을 읽으면 C에서 정의되지 않은 행동 의 개념과 다른 많은 변형을 이해할 수 있습니다.
ru: Для тех, кто <em>плохо знаком</em> с <em>неопределенным поведением,</em> было бы полезно прочитать, <a href="http://blog.llvm.org/2011/05/what-every-c-programmer-should-know.html">что каждый программист C должен знать о неопределенном поведении,</a> чтобы понять концепцию и многие другие варианты неопределенного поведения на C.
zh_cn: 对于那些<em>不熟悉行为的人</em>来说，阅读<a href="http://blog.llvm.org/2011/05/what-every-c-programmer-should-know.html">每位C程序员应了解的</a>有关<em>未定义行为的知识，</em>将从中受益，以了解C中未定义行为的概念和许多其他变体。

source: Given any two evaluations <code>A</code> and <code>B</code>, if <code>A</code> is sequenced before <code>B</code>, then the execution of <code>A</code> shall precede the execution of <code>B</code>.
es: Dadas cualesquiera dos evaluaciones <code>A</code> y <code>B</code> , si <code>A</code> se secuencia antes que <code>B</code> , entonces la ejecuci&oacute;n de <code>A</code> preceder&aacute; a la ejecuci&oacute;n de <code>B</code> .
ko: 두 가지 평가 <code>A</code> 와 <code>B</code> 가 주어지면, <code>A</code> 가 <code>B</code> 보다 먼저 시퀀싱되면 A 의 실행이 <code>B</code> 의 실행보다 우선합니다.
ru: При любых двух оценках <code>A</code> и <code>B</code> , если <code>A</code> упорядочен перед <code>B</code> , тогда выполнение <code>A</code> должно предшествовать выполнению <code>B</code> .
zh_cn: 给定 <code>A</code> 和 <code>B</code> 中的任何两个评估，如果 <code>A</code> 在 <code>B</code> 之前排序，则A的执行应在 <code>B</code> 的执行之前。

source: How does GCC work? it evaluates sub expressions at a left to right order for the right hand side (RHS) , then assigns the value to the left hand side (LHS) . This is exactly how Java and C# behave and define their standards. (Yes, the equivalent software in Java and C# has defined behaviors). It evaluate each sub expression one by one in the RHS Statement in a left to right order; for each sub expression: the ++c (pre-increment) is evaluated first then the value c is used for the operation, then the post increment c++).
es: ¿Cómo funciona el GCC? Evalúa las subexpresiones en un orden de izquierda a derecha para el lado derecho (RHS),luego asigna el valor al lado izquierdo (LHS).Así es exactamente como Java y C#se comportan y definen sus estándares.(Sí,el software equivalente en Java y C#tiene comportamientos definidos).Evalúa cada subexpresión una por una en la Declaración RHS en un orden de izquierda a derecha;para cada subexpresión:primero se evalúa el ++c (preincremento),luego se utiliza el valor c para la operación,luego el post incremento c++).
ko: GCC는 어떻게 작동합니까? 오른쪽 (RHS)에 대해 왼쪽에서 오른쪽 순서로 하위 표현식을 평가 한 다음 값을 왼쪽 (LHS)에 지정합니다. 이것이 바로 Java와 C #이 동작하고 표준을 정의하는 방식입니다. (예, Java 및 C #의 해당 소프트웨어는 동작을 정의했습니다). RHS 선언문에서 각 하위 표현식을 왼쪽에서 오른쪽으로 하나씩 평가합니다. 각 하위 표현식에 대해 : ++ c (사전 증가)가 먼저 평가 된 다음 c 값이 연산에 사용 된 후 사후 증가 c ++)가 사용됩니다.
ru: Как работает GCC? он оценивает подвыражения в порядке справа налево для правой стороны (RHS),затем присваивает значение левой стороне (LHS).Именно так ведут себя Java и C#и определяют свои стандарты.(Да,эквивалентное программное обеспечение на Java и C#определяет поведение).Оно оценивает каждое подвыражение по одному в RHS-операторе в порядке слева направо;для каждого подвыражения:сначала вычисляется ++c (пре-инкремент),затем для операции используется значение c,затем пост-инкремент c++).
zh_cn: GCC是如何工作的? 它以从左到右的顺序对子表达式进行评估,然后将值分配给左手(RHS)。这正是Java和C#的工作方式和定义标准。是的,Java和C#中的对等软件都有定义行为)。它按照从左到右的顺序逐一评价RHS语句中的每个子表达式;对于每个子表达式:先评价++c(前增量),然后再评价值c(后增量c++)。

source: How does visual studio work, it takes another approach, it evaluates all pre-increments expressions in first pass, then uses variables values in the operations in second pass, assign from RHS to LHS in third pass, then at last pass it evaluates all the post-increment expressions in one pass.
es: Cómo funciona el estudio visual,toma otro enfoque,evalúa todas las expresiones pre-incrementales en la primera pasada,luego usa valores de variables en las operaciones en la segunda pasada,asigna de RHS a LHS en la tercera pasada,luego en la última pasada evalúa todas las expresiones post-incrementales en una sola pasada.
ko: Visual Studio는 어떻게 작동하고 다른 접근 방식을 취하며 첫 번째 단계에서 모든 사전 증분 식을 평가 한 다음 두 번째 단계에서 연산의 변수 값을 사용하고 세 번째 단계에서 RHS에서 LHS로 할당 한 다음 마지막으로 모든 단계를 평가합니다. 한 번에 증가 후 표현식.
ru: Как работает визуальная студия,она использует другой подход,в первом проходе вычисляет все преинкрементные выражения,во втором проходе использует значения переменных,в третьем проходе присваивает из RHS в LHS,а в последнем проходе вычисляет все постинкрементные выражения за один проход.
zh_cn: visual studio是如何工作的,它采取了另一种方法,它在第一遍中评估所有的前增量表达式,然后在第二遍中使用操作中的变量值,在第三遍中从RHS到LHS分配,然后在最后一遍中评估所有的后增量表达式。

source: However if you stick to one compiler, you will find the behavior persistent, as long as you don't add function calls or pointers, which would make the behavior more messy.
es: Sin embargo,si te aferras a un compilador,encontrarás que el comportamiento es persistente,siempre y cuando no añadas llamadas a funciones o punteros,lo que haría que el comportamiento fuera más desordenado.
ko: 그러나 하나의 컴파일러를 고수하면 함수 호출이나 포인터를 추가하지 않으면 동작이 더 지저분해질 것입니다.
ru: Однако,если вы будете придерживаться одного компилятора,поведение будет продолжаться до тех пор,пока вы не добавите вызовы функций или указатели,что сделает поведение более грязным.
zh_cn: 但是如果你坚持使用一个编译器,你会发现这个行为是持久性的,只要你不添加函数调用或指针,这样的行为就会变得更加混乱。

source: However, the <code>,</code> in function argument lists is <em>not</em> a comma operator, and there is no sequence point between evaluations of distinct arguments; instead their evaluations are unsequenced with regard to each other; so the function call
es: Sin embargo, la lista de argumentos en funci&oacute;n <em>no</em> es un operador de coma y no hay un punto de secuencia entre las evaluaciones de argumentos distintos; en cambio, sus evaluaciones no tienen secuencia entre s&iacute;; entonces la llamada a la funci&oacute;n
ko: 그러나 함수 인수 목록에서 <code>,</code> 는 쉼표 연산자가 <em>아니며</em> 고유 인수 평가 사이에 시퀀스 포인트가 없습니다. 대신 그들의 평가는 서로에 대해 순서가 정해지지 않습니다. 그래서 함수 호출
ru: Однако списки аргументов функции <em>не</em> являются запятыми, и между оценками различных аргументов нет точки последовательности; вместо этого их оценки не последовательны по отношению друг к другу; поэтому вызов функции
zh_cn: 但是，函数参数列表中的in <em>不是</em>逗号运算符，并且不同参数的求值之间没有顺序点。 相反，他们的评估彼此之间没有先后顺序； 所以函数调用

source: However, two different variables can be incremented between two sequence points.
es: Sin embargo,dos variables diferentes pueden incrementarse entre dos puntos de secuencia.
ko: 그러나 두 시퀀스 포인트간에 서로 다른 두 변수를 증분시킬 수 있습니다.
ru: Однако между двумя точками следования могут быть увеличены две различные переменные.
zh_cn: 但是,两个不同的变量可以在两个序列点之间递增。

source: I assume you've heard the basic definition of C's <code>++</code> and <code>--</code> operators by now, and how the prefix form <code>++x</code> differs from the postfix form <code>x++</code>. But these operators are hard to think about, so to make sure you understood, perhaps you wrote a tiny little test program involving something like
es: Supongo que ya ha escuchado la definici&oacute;n b&aacute;sica de C's <code>++</code> y <code>--</code> operadores, y c&oacute;mo la forma del prefijo <code>++x</code> difiere de la forma del postfix <code>x++</code> . Pero es dif&iacute;cil pensar en estos operadores, as&iacute; que para asegurarte de que entiendes, tal vez escribiste un peque&ntilde;o programa de prueba que involucra algo como
ko: 지금까지 C의 <code>++</code> 및 <code>--</code> 연산자에 대한 기본 정의를들은 것으로 가정하고 접두사 형식 <code>++x</code> 가 접미사 형식 <code>x++</code> 과 어떻게 다른지 알고 있습니다. 그러나 이러한 연산자는 생각하기가 어렵습니다. 이해를 돕기 위해 아마도 다음과 같은 작은 테스트 프로그램을 작성했을 것입니다.
ru: Я предполагаю, что вы уже слышали базовое определение операторов C <code>++</code> и <code>--</code> , и чем префиксная форма <code>++x</code> отличается от постфиксной формы <code>x++</code> . Но об этих операторах трудно думать, поэтому, чтобы убедиться, что вы поняли, возможно, вы написали крошечную тестовую программу, включающую что-то вроде
zh_cn: 我假设您现在已经听说过C的 <code>++</code> 和 <code>--</code> 运算符的基本定义，以及前缀形式 <code>++x</code> 与后缀形式 <code>x++</code> 有何不同。 但是这些运算符很难考虑，因此为了确保您理解，也许您编写了一个包含以下内容的小型测试程序：

source: I explain the ideas.
es: Explico las ideas.
ko: 나는 아이디어를 설명한다.
ru: Я объясняю идеи.
zh_cn: 我解释了一下思路。

source: I think the relevant parts of the C99 standard are 6.5 Expressions, &sect;2
es: Creo que las partes relevantes del est&aacute;ndar C99 son 6.5 Expresiones, &sect;2
ko: C99 표준의 관련 부분은 6.5 식, &sect;2라고 생각합니다.
ru: Я думаю, что соответствующие части стандарта C99 - 6,5 выражений, &sect;2
zh_cn: 我认为C99标准的相关部分是6.5表达式，&sect;2

source: If <code>A</code> is not sequenced before or after <code>B</code>, then <code>A</code> and <code>B</code> are unsequenced.
es: Si <code>A</code> no est&aacute; secuenciado antes o despu&eacute;s de <code>B</code> , entonces <code>A</code> y <code>B</code> no est&aacute;n secuenciados.
ko: <code>A</code> 가 <code>B</code> 전후에 시퀀싱되지 않으면 <code>A</code> 와 <code>B</code> 는 순서가 지정되지 않습니다.
ru: Если <code>A</code> не секвенируется до или после <code>B</code> , то <code>A</code> и <code>B</code> не секвенируются.
zh_cn: 如果 <code>A</code> 在 <code>B</code> 之前或之后未排序，则 <code>A</code> 和 <code>B</code> 不排序。

source: If a side effect on a scalar object is unsequenced relative to either a different side effect on the same scalar object or a value computation using the value of the same scalar object, the behavior is undefined. If there are multiple allowable orderings of the subexpressions of an expression, the behavior is undefined if such an unsequenced side effect occurs in any of the orderings.84)
es: Si un efecto secundario en un objeto escalar no está secuenciado en relación con un efecto secundario diferente en el mismo objeto escalar o con un cálculo de valores utilizando el valor del mismo objeto escalar,el comportamiento es indefinido.Si hay múltiples ordenamientos permitidos de las subexpresiones de una expresión,el comportamiento es indefinido si tal efecto secundario no secuenciado se produce en cualquiera de los ordenamientos.84)
ko: 스칼라 오브젝트의 부작용이 동일한 스칼라 오브젝트의 다른 부작용 또는 동일한 스칼라 오브젝트의 값을 사용한 값 계산과 관련하여 순서가 지정되지 않으면 동작이 정의되지 않습니다. 표현식의 하위 표현식에 허용되는 순서가 여러 개인 경우 순서에 상관없이 이러한 부작용이 발생하면 동작이 정의되지 않습니다 .84)
ru: Если побочный эффект на скалярном объекте является непоследовательным относительно либо другого побочного эффекта на одном и том же скалярном объекте,либо вычисления значения с использованием значения одного и того же скалярного объекта,поведение является неопределенным.Если существует несколько допустимых порядков подвыражений выражения,поведение не определено,если такой непоследовательный побочный эффект возникает в любом из порядков84).
zh_cn: 如果一个标量对象上的边效相对于同一标量对象上的不同边效或使用同一标量对象的值计算的值来说是无序的,那么该行为是未定义的。如果一个表达式的子表达式有多个允许的顺序,那么,如果在任何一个顺序中出现了这样的无序侧效应,该行为是未定义的。)

source: If the compiler were to write <code>i++</code> as indicated above (legal under the standard) and were to intersperse the above instructions throughout the evaluation of the overall expression (also legal), and if it didn't happen to notice that one of the other instructions happened to access <code>i</code>, it would be possible (and legal) for the compiler to generate a sequence of instructions that would deadlock. To be sure, a compiler would almost certainly detect the problem in the case where the same variable <code>i</code> is used in both places, but if a routine accepts references to two pointers <code>p</code> and <code>q</code>, and uses <code>(*p)</code> and <code>(*q)</code> in the above expression (rather than using <code>i</code> twice) the compiler would not be required to recognize or avoid the deadlock that would occur if the same object's address were passed for both <code>p</code> and <code>q</code>.
es: Si el compilador escribiera <code>i++</code> como se indic&oacute; anteriormente (legal seg&uacute;n el est&aacute;ndar) e intercalara las instrucciones anteriores a lo largo de la evaluaci&oacute;n de la expresi&oacute;n general (tambi&eacute;n legal), y si no se notara que una de las otras instrucciones si tuviera acceso a <code>i</code> , ser&iacute;a posible (y legal) para el compilador generar una secuencia de instrucciones que se estancar&iacute;an. Sin duda, un compilador seguramente detectar&aacute; el problema en el caso en que se use la misma variable <code>i</code> en ambos lugares, pero si una rutina acepta referencias a dos punteros <code>p</code> y <code>q</code> , y usa <code>(*p)</code> y <code>(*q)</code> en la expresi&oacute;n anterior (en lugar de usar <code>i</code> dos veces) no se requerir&iacute;a que el compilador reconozca o evite el punto muerto que ocurrir&iacute;a si se pasara la misma direcci&oacute;n del objeto para <code>p</code> y <code>q</code> .
ko: 컴파일러가 위에서 명시한대로 (표준에 따라) <code>i++</code> 를 작성하고 전체 표현의 평가를 통해 위의 지시 사항을 산재하고 (법적) 다른 지시 사항 중 하나를 발견하지 못한 경우 <code>i</code> 에 액세스하면 컴파일러가 교착 상태에 빠질 수있는 일련의 명령어를 생성하는 것이 가능하고 합법적입니다. 확실히하기 위해 컴파일러는 동일한 변수 <code>i</code> 가 두 곳에서 사용되는 경우 거의 확실하게 문제를 감지하지만 루틴이 두 포인터 <code>p</code> 와 <code>q</code> 에 대한 참조를 허용하고 <code>(*p)</code> 와 <code>(*q)</code> 를 사용하는 경우 위의 표현식에서 ( <code>i</code> 를 두 번 사용하는 대신) 컴파일러는 동일한 객체의 주소가 <code>p</code> 및 <code>q</code> 모두에 대해 전달 된 경우 발생할 수있는 교착 상태를 인식하거나 피할 필요가 없습니다.
ru: Если бы компилятор должен был написать <code>i++</code> как указано выше (юридически согласно стандарту), и должен был перемежать вышеприведенные инструкции во время оценки общего выражения (также легально), и если не случилось, заметил, что одна из других инструкций в случае доступа к <code>i</code> , для компилятора было бы возможно (и законно) сгенерировать последовательность инструкций, которые бы зашли в тупик. Безусловно, компилятор почти наверняка обнаружит проблему в случае, когда одна и та же переменная <code>i</code> используется в обоих местах, но если подпрограмма принимает ссылки на два указателя <code>p</code> и <code>q</code> и использует <code>(*p)</code> и <code>(*q)</code> в приведенном выше выражении (вместо использования <code>i</code> дважды) компилятору не потребуется распознавать или избегать тупиковой ситуации, которая возникнет, если один и тот же адрес объекта будет передан как для <code>p</code> ,так и для <code>q</code> .
zh_cn: 如果编译器按照上述指示编写 <code>i++</code> （根据标准合法）并在整个表达式求值过程中散布上述指令（也是合法的），并且没有注意到其他指令之一碰巧访问了 <code>i</code> ，编译器可能会（并且合法）生成一系列死锁的指令。 可以肯定的是，在两个地方都使用相同变量 <code>i</code> 的情况下，但是如果例程接受对两个指针 <code>p</code> 和 <code>q</code> 的引用，并使用 <code>(*p)</code> 和 <code>(*q)</code> ，则编译器几乎可以检测到问题。在上面的表达式中（而不是使用 <code>i</code> 两次），不需要编译器识别或避免如果为 <code>p</code> 和 <code>q</code> 传递了相同对象的地址时将发生死锁。

source: If there's a variable that's getting modified in one place, and having its value used in another place, how do you know whether it uses the old value or the new value?
es: Si hay una variable que se modifica en un lugar,y se utiliza su valor en otro lugar,¿cómo sabes si utiliza el valor antiguo o el nuevo?
ko: 한 곳에서 수정되고 다른 곳에서 값을 사용하는 변수가있는 경우 이전 값을 사용하는지 새 값을 사용하는지 어떻게 알 수 있습니까?
ru: Если есть переменная,которая изменяется в одном месте,и ее значение используется в другом месте,как узнать,использует ли она старое или новое значение?
zh_cn: 如果有一个变量在一个地方被修改,而它的值在另一个地方被使用,你怎么知道它使用的是旧值还是新值?

source: If there's one variable that's getting modified (assigned to) in two or more different places, how do you know which modification happens first?
es: Si hay una variable que se está modificando (asignando)en dos o más lugares diferentes,¿cómo sabes qué modificación ocurre primero?
ko: 둘 이상의 다른 위치에서 수정 (할당)되는 변수가 하나 있으면 어떤 수정이 먼저 발생하는지 어떻게 알 수 있습니까?
ru: Если есть одна переменная,которая модифицируется (присваивается)в двух или более разных местах,как узнать,какая модификация происходит в первую очередь?
zh_cn: 如果有一个变量在两个或多个不同的地方被修改(分配到),你怎么知道哪个修改是先发生的?

source: Immediately before a library function returns (7.1.4).
es: Inmediatamente antes de que regrese una función de la biblioteca (7.1.4).
ko: 라이브러리 함수가 (7.1.4)를 반환하기 직전에.
ru: Непосредственно перед возвращением библиотечной функции (7.1.4).
zh_cn: 紧接在库函数返回之前(7.1.4)。

source: Immediately before and immediately after each call to a comparison function, and also between any call to a comparison function and any movement of the objects passed as arguments to that call (7.22.5).
es: Inmediatamente antes e inmediatamente después de cada llamada a una función de comparación,y también entre cualquier llamada a una función de comparación y cualquier movimiento de los objetos pasados como argumentos a esa llamada (7.22.5).
ko: 비교 함수에 대한 각 호출 직전과 직후 그리고 비교 함수에 대한 호출과 해당 호출에 대한 인수로 전달 된 객체의 이동 사이 (7.22.5).
ru: Непосредственно перед и сразу после каждого вызова функции сравнения,а также между любым вызовом функции сравнения и любым движением объектов,переданных в качестве аргументов этому вызову (7.22.5).
zh_cn: 在每次调用一个比较函数之前和之后,以及在调用一个比较函数和作为参数传递给该调用的对象的任何移动之间(7.22.5)。

source: In <a href="https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c">https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c</a> someone asked about a statement like:
es: En <a href="https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c">https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c</a> alguien pregunt&oacute; acerca de una declaraci&oacute;n como:
ko: <a href="https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c">https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c에서</a> 누군가가 다음과 같은 진술에 대해 물었습니다.
ru: В <a href="https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c">https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c</a> кто-то спросил о таком утверждении, как:
zh_cn: 在<a href="https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c">https://stackoverflow.com/questions/29505280/incrementing-array-index-in-c中，</a>有人问到以下语句：

source: In GCC C++, the precedence of the operators controls the order in which the individual operators are evaluated
es: En GCC C++,la precedencia de los operadores controla el orden en que se evalúan los operadores individuales
ko: GCC C ++에서 연산자의 우선 순위는 개별 연산자가 평가되는 순서를 제어합니다.
ru: В GCC C++приоритет операторов контролирует порядок,в котором оцениваются отдельные операторы
zh_cn: 在GCC C++中,运算符的优先级控制了单个运算符的评估顺序。

source: In all these examples the code is attempting to modify an object more than once in the same sequence point, which will end with the <code>;</code> in each one of these cases:
es: En todos estos ejemplos, el c&oacute;digo intenta modificar un objeto m&aacute;s de una vez en el mismo punto de secuencia, que terminar&aacute; con <code>;</code> en cada uno de estos casos:
ko: 이 모든 예제에서 코드는 동일한 시퀀스 포인트에서 객체를 두 번 이상 수정하려고 시도합니다 <code>;</code> 이러한 경우 각각 :
ru: Во всех этих примерах код пытается изменить объект более одного раза в одной и той же точке последовательности, что заканчивается на <code>;</code> в каждом из этих случаев:
zh_cn: 在所有这些示例中，代码都试图在同一序列点中多次修改对象，这些对象将以 <code>;</code> 结尾。 在以下每种情况下：

source: In the following statement:
es: En la siguiente declaración:
ko: 다음 진술에서 :
ru: В следующем заявлении:
zh_cn: 在以下声明中:
