Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: The behavior can't really be explained because it invokes both <a href="http://en.wikipedia.org/wiki/Unspecified_behavior">unspecified behavior</a> and <a href="http://en.wikipedia.org/wiki/Undefined_behavior">undefined behavior</a>, so we can not make any general predictions about this code, although if you read <em>Olve Maudal's</em> work such as <a href="http://www.slideshare.net/olvemaudal/deep-c">Deep C</a> and <a href="http://www.pvv.org/~oma/UnspecifiedAndUndefined_ACCU_Apr2013.pdf">Unspecified and Undefined</a> sometimes you can make good guesses in very specific cases with a specific compiler and environment but please don't do that anywhere near production.
es: El comportamiento realmente no se puede explicar porque invoca tanto el <a href="http://en.wikipedia.org/wiki/Unspecified_behavior">comportamiento no especificado como el comportamiento</a> <a href="http://en.wikipedia.org/wiki/Undefined_behavior">indefinido</a> , por lo que no podemos hacer predicciones generales sobre este c&oacute;digo, aunque si lee <em>el</em> trabajo de <em>Olve Maudal</em> , como <a href="http://www.slideshare.net/olvemaudal/deep-c">Deep C</a> y <a href="http://www.pvv.org/~oma/UnspecifiedAndUndefined_ACCU_Apr2013.pdf">Unspecified and Undefined, a</a> veces puede ser bueno adivina en casos muy espec&iacute;ficos con un compilador y un entorno espec&iacute;ficos, pero no lo haga cerca de la producci&oacute;n.
ko: <a href="http://en.wikipedia.org/wiki/Unspecified_behavior">지정되지 않은 동작</a> 과 <a href="http://en.wikipedia.org/wiki/Undefined_behavior">정의되지</a> 않은 동작을 모두 호출하기 때문에 동작을 실제로 설명 할 수 없으므로 <a href="http://www.slideshare.net/olvemaudal/deep-c">Deep C</a> 및 <a href="http://www.pvv.org/~oma/UnspecifiedAndUndefined_ACCU_Apr2013.pdf">Unspecified 및 Undefined</a> 와 같은 <em>Olve Maudal의</em> 작업을 읽으면 <em>때때로이</em> 코드를 만들 수는 있지만이 코드에 대한 일반적인 예측을 할 수는 없습니다. 특정 컴파일러와 환경에서 매우 구체적인 경우를 추측하지만 프로덕션 근처에서는 그렇게하지 마십시오.
ru: Поведение на самом деле не может быть объяснено, потому что оно вызывает как <a href="http://en.wikipedia.org/wiki/Undefined_behavior">неопределенное поведение</a> , так и неопределенное поведение , поэтому мы не можем делать какие-либо общие предсказания об этом коде, хотя, если вы читаете работы <em>Олве Модала,</em> такие как <a href="http://www.slideshare.net/olvemaudal/deep-c">Deep C</a> и <a href="http://www.pvv.org/~oma/UnspecifiedAndUndefined_ACCU_Apr2013.pdf">Unspecified и Undefined,</a> иногда вы можете сделать хорошо угадывает в очень специфических случаях с конкретным компилятором и средой, но, пожалуйста, не делайте этого где-нибудь рядом с производством
zh_cn: 该行为无法真正解释，因为它同时调用了<a href="http://en.wikipedia.org/wiki/Unspecified_behavior">未指定的行为</a>和<a href="http://en.wikipedia.org/wiki/Undefined_behavior">未定义的行为</a> ，因此我们无法对此代码做出任何一般性的预测，尽管如果您阅读<em>Olve Maudal的</em>著作（例如<a href="http://www.slideshare.net/olvemaudal/deep-c">Deep C</a>和<a href="http://www.pvv.org/~oma/UnspecifiedAndUndefined_ACCU_Apr2013.pdf">Unspecified and Undefined），</a>有时可以在特定情况下使用特定的编译器和环境进行猜测，但请不要在生产环境附近这样做。

source: The comma operator evaluates its operands left-to-right and yields only the value of the last operand. So in <code>j = (++i, i++);</code>, <code>++i</code> increments <code>i</code> to <code>6</code> and <code>i++</code> yields old value of <code>i</code> (<code>6</code>) which is assigned to <code>j</code>. Then <code>i</code> becomes <code>7</code> due to post-increment.
es: El operador de coma eval&uacute;a sus operandos de izquierda a derecha y produce solo el valor del &uacute;ltimo operando. Entonces en <code>j = (++i, i++);</code> , <code>++i</code> incrementa <code>i</code> a <code>6</code> e <code>i++</code> produce el antiguo valor de <code>i</code> ( <code>6</code> ) que se asigna a <code>j</code> . Entonces <code>i</code> convierto en <code>7</code> debido al incremento posterior.
ko: 쉼표 연산자는 피연산자를 왼쪽에서 오른쪽으로 평가하고 마지막 피연산자 값만 산출합니다. 따라서 <code>j = (++i, i++);</code> <code>++i</code> 는 <code>i</code> 를 <code>6</code> 으로 증가시키고 <code>i++</code> 는 <code>j</code> 에 할당 된 <code>i</code> ( <code>6</code> )의 오래된 값을 산출합니다. 그런 다음 증가 후로 <code>7</code> 이됩니다.
ru: Оператор запятой оценивает свои операнды слева направо и выдает только значение последнего операнда. Так в <code>j = (++i, i++);</code> , <code>++i</code> увеличивает <code>i</code> до <code>6</code> , а <code>i++</code> возвращает старое значение <code>i</code> ( <code>6</code> ), которое присваивается <code>j</code> . Тогда <code>i</code> становлюсь <code>7</code> из-за постинкремента.
zh_cn: 逗号运算符从左到右评估其操作数，并且仅产生最后一个操作数的值。 所以在 <code>j = (++i, i++);</code> ， <code>++i</code> 将i递增到 <code>6</code> ,而 <code>i++</code> 产生 <code>i</code> （ <code>6</code> ）的旧值，该值分配给 <code>j</code> 。 然后由于后增量， <code>i</code> 变成 <code>7</code> 。

source: The end of a full declarator: declarators (6.7.6);
es: El fin de un declarante completo:declarantes (6.7.6);
ko: 완전한 선언의 끝 : 선언자 (6.7.6);
ru: Конец полного декларатора:деклараторы (6.7.6);
zh_cn: 完整声明者的结局:声明者(6.7.6)。

source: The first fragment asked about, <code>i = i++ + ++i</code>, is pretty clearly insane in my book. No one would ever write it in a real program, it's not obvious what it does, there's no conceivable algorithm someone could have been trying to code that would have resulted in this particular contrived sequence of operations. And since it's not obvious to you and me what it's supposed to do, it's fine in my book if the compiler can't figure out what it's supposed to do, either.
es: El primer fragmento sobre el que se pregunt&oacute;, <code>i = i++ + ++i</code> , es bastante loco en mi libro. Nadie lo escribir&iacute;a en un programa real, no es obvio lo que hace, no hay un algoritmo concebible que alguien podr&iacute;a haber intentado codificar que hubiera resultado en esta secuencia de operaciones artificial. Y dado que no es obvio para ti y para m&iacute; lo que se supone que debe hacer, est&aacute; bien en mi libro si el compilador tampoco puede entender qu&eacute; se supone que debe hacer.
ko: <code>i = i++ + ++i</code> 에 대해 묻는 첫 번째 조각은 필자의 책에서 분명히 미쳤습니다. 아무도 실제 프로그램으로 작성하지 않았으며, 그것이 무엇을하는지 명확하지 않으며, 누군가가이 특별한 계획된 조작 순서를 초래할 수있는 코딩을 시도했을지도 모를 알고리즘도 없습니다. 그리고 당신과 나에게해야 할 일이 분명하지 않기 때문에 컴파일러가해야 할 일을 이해할 수 없다면 내 책에서 괜찮습니다.
ru: Первый фрагмент, о котором <code>i = i++ + ++i</code> спрашиваю, i = i ++ + ++ i , в моей книге совершенно безумен. Никто никогда не напишет ее в реальной программе, не очевидно, что она делает, нет мыслимого алгоритма, который кто-то мог бы пытаться кодировать, который привел бы к этой конкретной надуманной последовательности операций. И поскольку для нас и для нас не очевидно, что он должен делать, в моей книге хорошо, если компилятор не может понять, что он должен делать.
zh_cn: 问到的第一个片段 <code>i = i++ + ++i</code> 在我的书中显然很疯狂。 没有人会在一个真实的程序中编写它，它的作用尚不明确，没有一种可以想象的算法，有人试图编写会导致这种特殊的操作序列的算法。 而且由于您和我都不知道应该做什么，因此如果编译器也无法弄清楚应该做什么，那么在我的书中也可以。

source: The following are the sequence points described in 5.1.2.3:
es: Los siguientes son los puntos de la secuencia descritos en 5.1.2.3:
ko: 다음은 5.1.2.3에 설명 된 시퀀스 포인트입니다.
ru: Ниже приведены точки следования,описанные в пункте 5.1.2.3:
zh_cn: 以下是5.1.2.3中描述的顺序点。

source: The grouping of operators and operands is indicated by the syntax.74) Except as specified later (for the function-call (), &amp;&amp;, ||, ?:, and comma operators), <strong>the order of evaluation of subexpressions and the order in which side effects take place are both unspecified.</strong>
es: La agrupaci&oacute;n de operadores y operandos se indica mediante la sintaxis.74) Excepto como se especifica m&aacute;s adelante (para los operadores call-function (), &amp;&amp;, ||,?: Y coma), <strong>el orden de evaluaci&oacute;n de subexpresiones y el orden en qu&eacute; efectos secundarios tienen lugar no est&aacute;n especificados.</strong>
ko: 연산자와 피연산자의 그룹화는 구문으로 표시됩니다 .74) 나중에 지정된 경우 (함수 호출 (), &amp;&amp;, ||,? : 및 쉼표 연산자의 경우), <strong>하위 표현식의 평가 순서 및 순서 어떤 부작용이 발생하는지는 명시되어 있지 않습니다.</strong>
ru: Группировка операторов и операндов указывается синтаксисом.74) За исключением случаев, указанных позднее (для операторов function-call (), &amp;&amp;, ||,?: И запятых), <strong>порядок вычисления подвыражений и порядок в какие побочные эффекты имеют место, оба не определены.</strong>
zh_cn: 语法表示运算符和操作数的分组。74）除非后面有指定（对于函数调用（），&amp;&amp;，||，？：和逗号运算符）， <strong>子表达式的求值顺序和哪种副作用都未指定。</strong>

source: The important part is to know <a href="https://stackoverflow.com/questions/3575350/sequence-points-in-c">what a sequence point is -- and <em>what is</em> a sequence point and what <em>isn't</em></a>. For example the <em>comma operator</em> is a sequence point, so
es: La parte importante es saber <a href="https://stackoverflow.com/questions/3575350/sequence-points-in-c">qu&eacute; es un punto de secuencia, y <em>qu&eacute; es</em> un punto de secuencia y qu&eacute; <em>no</em> lo <em>es</em></a> . Por ejemplo, el <em>operador de coma</em> es un punto de secuencia, entonces
ko: 중요한 부분은 <a href="https://stackoverflow.com/questions/3575350/sequence-points-in-c">시퀀스 포인트가 무엇인지, 시퀀스 포인트가 무엇인지 <em>아닌지</em></a> 아는 것 입니다. 예를 들어 <em>쉼표 연산자</em> 는 시퀀스 포인트이므로
ru: Важная часть состоит в <a href="https://stackoverflow.com/questions/3575350/sequence-points-in-c">том,</a> чтобы знать, что такое точка последовательности - и <em>что такое</em> точка последовательности, а что <em>нет</em> . Например, <em>оператор запятой</em> является точкой последовательности, поэтому
zh_cn: 重要的部分是知道<a href="https://stackoverflow.com/questions/3575350/sequence-points-in-c">什么是序列点， <em>什么是</em>序列点，什么<em>不是</em></a> 。 例如， <em>逗号运算符</em>是一个序列点，因此

source: The main rule from the standard ISO 9899 that applies in this situation is 6.5p2.
es: La principal regla de la norma ISO 9899 que se aplica en esta situación es 6,5p2.
ko: 이 상황에 적용되는 표준 ISO 9899의 기본 규칙은 6.5p2입니다.
ru: Основное правило из стандарта ISO 9899,которое применяется в этой ситуации-6.5p2.
zh_cn: ISO 9899标准中适用于这种情况的主要规则是6.5p2。

source: The order in which the function designator, arguments, and subexpressions within the arguments are evaluated in a function call (6.5.2.2).
es: El orden en que se evalúan el designador de la función,los argumentos y las subexpresiones dentro de los argumentos en una llamada a la función (6.5.2.2).
ko: 인수 내의 함수 지정자, 인수 및 부속 식의 순서는 함수 호출 (6.5.2.2)에서 평가됩니다.
ru: Порядок,в котором обозначение функции,аргументы и подвыражения внутри аргументов вычисляются при вызове функции (6.5.2.2).
zh_cn: 函数代号、参数和参数内的子表达式在函数调用中的评价顺序(6.5.2.2)。

source: The order of evaluation of the operands is unspecified. If an attempt is made to modify the result of an assignment operator or to access it after the next sequence point, the behavior is undefined.
es: El orden de evaluación de los operandos no está especificado.Si se intenta modificar el resultado de un operador de asignación o acceder a él después del siguiente punto de la secuencia,el comportamiento es indefinido.
ko: 피연산자의 평가 순서는 지정되어 있지 않습니다. 할당 연산자의 결과를 수정하거나 다음 시퀀스 포인트 이후에 액세스하려고하면 동작이 정의되지 않습니다.
ru: Порядок оценки операндов не определен.Если предпринимается попытка изменить результат оператора присваивания или получить к нему доступ после следующей точки следования,поведение не определено.
zh_cn: 运算子的评价顺序是未指定的。如果试图修改一个赋值运算符的结果或在下一个序列点之后访问它,则该行为是未定义的。

source: The presence of a sequence point between the evaluation of expressions <code>A</code> and <code>B</code> implies that every <em>value computation</em> and <em>side effect</em> associated with <code>A</code> is sequenced before every <em>value computation</em> and <em>side effect</em> associated with <code>B</code>.
es: La presencia de un punto de secuencia entre la evaluaci&oacute;n de las expresiones <code>A</code> y <code>B</code> implica que cada <em>c&aacute;lculo de valor</em> y <em>efecto secundario</em> asociado con <code>A</code> se secuencia antes de cada <em>c&aacute;lculo de valor</em> y <em>efecto secundario</em> asociado con <code>B</code> .
ko: 식 <code>A</code> 와 <code>B</code> 의 평가 사이에 서열 지점이 존재한다는 것은 A 와 관련된 모든 <em>값 계산</em> 및 <em>부작용</em> 이 <code>B</code> 와 관련된 모든 <em>값 계산</em> 및 <em>부작용</em> 전에 순서화됨을 의미한다.
ru: Наличие точки последовательности между оценками выражений <code>A</code> и <code>B</code> подразумевает, что каждое <em>вычисление значения</em> и <em>побочный эффект,</em> связанный с <code>A</code> , упорядочивается перед каждым <em>вычислением значения</em> и <em>побочным эффектом,</em> связанным с <code>B</code> .
zh_cn: 在表达式 <code>A</code> 和 <code>B</code> 的求值之间存在序列点意味着，与 <code>A</code> 关联的每个<em>值计算</em>和<em>副作用都在</em>与 <code>B</code> 关联的每个<em>值计算</em>和<em>副作用</em>之前进行排序。

source: The problem with this expression is that it contains three different attempts to modify the value of x: (1) the <code>x++</code> part tries to add 1 to x, store the new value in <code>x</code>, and return the old value of <code>x</code>; (2) the <code>++x</code> part tries to add 1 to x, store the new value in <code>x</code>, and return the new value of <code>x</code>; and (3) the <code>x =</code> part tries to assign the sum of the other two back to x. Which of those three attempted assignments will "win"? Which of the three values will actually get assigned to <code>x</code>? Again, and perhaps surprisingly, there's no rule in C to tell us.
es: El problema con esta expresi&oacute;n es que contiene tres intentos diferentes de modificar el valor de x: (1) la parte <code>x++</code> intenta agregar 1 a x, almacenar el nuevo valor en <code>x</code> y devolver el valor anterior de <code>x</code> ; (2) la parte <code>++x</code> intenta agregar 1 a x, almacenar el nuevo valor en <code>x</code> y devolver el nuevo valor de <code>x</code> ; y (3) la parte <code>x =</code> intenta asignar la suma de los otros dos a x. &iquest;Cu&aacute;l de esos tres intentos de tareas "ganar&aacute;"? &iquest;Cu&aacute;l de los tres valores se asignar&aacute; realmente a <code>x</code> ? De nuevo, y quiz&aacute;s sorprendentemente, no hay una regla en C que nos diga.
ko: 이 표현식의 문제점은 x의 값을 수정하려는 세 가지 다른 시도를 포함한다는 것입니다. (1) <code>x++</code> 부분은 x 를 1에 더하고 x에 새 값을 저장하고 <code>x</code> 의 이전 값을 리턴합니다. (2) <code>++x</code> 부분은 1을 x에 더하고 x에 새로운 값을 저장하고 <code>x</code> 의 새로운 값을 반환하려고 시도합니다. 그리고 (3) <code>x =</code> 부분은 다른 두 개의 합을 다시 x에 할당하려고 시도합니다. 이 세 번의 과제 중 어느 것이 "승리"할 것인가? 세 값 중 실제로 <code>x</code> 에 할당되는 값은 무엇입니까? 다시 말하지만 놀랍게도 C에는 우리에게 말할 규칙이 없습니다.
ru: Проблема с этим выражением состоит в том, что оно содержит три различные попытки изменить значение x: (1) часть <code>x++</code> пытается добавить 1 к x, сохранить новое значение в <code>x</code> и вернуть старое значение <code>x</code> ; (2) часть <code>++x</code> пытается добавить 1 к x, сохранить новое значение в <code>x</code> и вернуть новое значение <code>x</code> ; и (3) часть <code>x =</code> пытается присвоить сумму двух других обратно x. Какое из этих трех попыток будет &laquo;выиграно&raquo;? Какое из трех значений будет присвоено <code>x</code> ? Опять же, и, возможно, что удивительно, в Си нет правил, чтобы говорить нам.
zh_cn: 该表达式的问题在于，它包含三种不同的尝试来修改x的值：（1） <code>x++</code> 部分尝试向x加1，将新值存储在 <code>x</code> 中 ，并返回x的旧值； （2） <code>++x</code> 部分尝试将x加1，将新值存储在 <code>x</code> 中 ，然后返回x的新值； （3） <code>x =</code> 部分尝试将其他两个的和分配回x。 这三项尝试中的哪一项将&ldquo;获胜&rdquo;？ 这三个值中的哪一个实际上将分配给 <code>x</code> ？ 同样，也许令人惊讶的是，C语言中没有规则可以告诉我们。

source: The reason is that the program is running undefined behavior. The problem lies in the evaluation order, because there is no sequence points required according to C++98 standard ( no operations is sequenced before or after another according to C++11 terminology).
es: La razón es que el programa está ejecutando un comportamiento indefinido.El problema radica en el orden de evaluación,porque no se requieren puntos de secuencia según el estándar C++98 (no se secuencian operaciones antes o después de otra según la terminología C++11).
ko: 그 이유는 프로그램이 정의되지 않은 동작을 실행하고 있기 때문입니다. 문제는 C ++ 98 표준에 따라 필요한 시퀀스 포인트가 없기 때문에 평가 순서에 있습니다 (C ++ 11 용어에 따라 다른 작업 전후에 시퀀스가 ​​수행되지 않음).
ru: Причина в том,что программа работает с неопределённым поведением.Проблема заключается в порядке вычислений,так как согласно стандарту C++98 не требуется никаких точек следования (согласно терминологии C++11 никакие операции не выполняются до или после).
zh_cn: 原因是程序运行时出现了未定义的行为。问题在于评价顺序,因为按照C++98标准,没有要求的顺序点(按照C++11的术语,没有操作的顺序在前或在后)。

source: The second fragment, <code>i = i++</code>, is a little easier to understand. Someone is clearly trying to increment i, and assign the result back to i. But there are a couple ways of doing this in C. The most basic way to add 1 to i, and assign the result back to i, is the same in almost any programming language:
es: El segundo fragmento, <code>i = i++</code> , es un poco m&aacute;s f&aacute;cil de entender. Alguien claramente est&aacute; tratando de incrementar i, y asignar el resultado nuevamente a i. Pero hay un par de formas de hacer esto en C. La forma m&aacute;s b&aacute;sica de agregar 1 a i, y asignar el resultado a i, es la misma en casi cualquier lenguaje de programaci&oacute;n:
ko: 두 번째 조각 인 <code>i = i++</code> 는 이해하기 조금 더 쉽습니다. 누군가가 분명히 i를 증가시키고 결과를 i에 다시 할당하려고합니다. 그러나 C에서 이것을 수행하는 몇 가지 방법이 있습니다. 1을 i에 더하고 결과를 다시 i에 할당하는 가장 기본적인 방법은 거의 모든 프로그래밍 언어에서 동일합니다.
ru: Второй фрагмент, <code>i = i++</code> , немного проще для понимания. Кто-то явно пытается увеличить i и присвоить результат обратно i. Но есть несколько способов сделать это в C. Самый простой способ добавить 1 к i и присвоить результат обратно i, одинаков почти для любого языка программирования:
zh_cn: 第二个片段 <code>i = i++</code> 有点容易理解。 显然有人在尝试递增i，并将结果分配回i。 但是用C语言有两种方法。在几乎所有编程语言中，将1加到i并将结果分配回i的最基本方法是相同的：

source: The sequence points in an expression like <code>i=i++</code> are before <code>i=</code> and after <code>i++</code>.
es: Los puntos de secuencia en una expresi&oacute;n como <code>i=i++</code> son antes de <code>i=</code> y despu&eacute;s de <code>i++</code> .
ko: <code>i=i++</code> 와 같은 표현식의 시퀀스 포인트는 i = 이전과 <code>i++</code> 이후입니다.
ru: Точки последовательности в выражении типа <code>i=i++</code> находятся перед <code>i=</code> и после <code>i++</code> .
zh_cn: 像 <code>i=i++</code> 这样的表达式中的序列点在i =之前和 <code>i++</code> 。

source: The various sequence points are listed in Annex C of <a href="http://port70.net/~nsz/c/c11/n1570.html#C">C11</a> (and <a href="http://port70.net/~nsz/c/c99/n1256.html#C">C99</a>):
es: Los diversos puntos de secuencia se enumeran en el Anexo C de <a href="http://port70.net/~nsz/c/c11/n1570.html#C">C11</a> (y <a href="http://port70.net/~nsz/c/c99/n1256.html#C">C99</a> ):
ko: 다양한 시퀀스 포인트가 <a href="http://port70.net/~nsz/c/c11/n1570.html#C">C11</a> (및 <a href="http://port70.net/~nsz/c/c99/n1256.html#C">C99</a> )의 부록 C에 나열되어 있습니다.
ru: Различные точки последовательности перечислены в Приложении C к <a href="http://port70.net/~nsz/c/c11/n1570.html#C">C11</a> (и <a href="http://port70.net/~nsz/c/c99/n1256.html#C">C99</a> ):
zh_cn: <a href="http://port70.net/~nsz/c/c11/n1570.html#C">C11</a> （和<a href="http://port70.net/~nsz/c/c99/n1256.html#C">C99</a> ）的附件C中列出了各个序列点：

source: The wording of the same <a href="http://port70.net/~nsz/c/c11/n1570.html#6.5p2">paragraph in C11</a> is:
es: La redacci&oacute;n del mismo <a href="http://port70.net/~nsz/c/c11/n1570.html#6.5p2">p&aacute;rrafo en C11</a> es:
ko: <a href="http://port70.net/~nsz/c/c11/n1570.html#6.5p2">C11</a> 에서 동일한 단락 의 문구는 다음과 같습니다.
ru: Формулировка того же <a href="http://port70.net/~nsz/c/c11/n1570.html#6.5p2">параграфа в C11</a> :
zh_cn: <a href="http://port70.net/~nsz/c/c11/n1570.html#6.5p2">C11中</a>同一段的措词为：

source: Then we go to <a href="https://www.visualstudio.com/">Visual Studio</a>. Visual Studio 2015, you get:
es: Luego vamos a <a href="https://www.visualstudio.com/">Visual Studio</a> . Visual Studio 2015, obtienes:
ko: 그런 다음 <a href="https://www.visualstudio.com/">Visual Studio</a> 로갑니다. Visual Studio 2015는 다음과 같은 이점을 제공합니다.
ru: Затем мы идем в <a href="https://www.visualstudio.com/">Visual Studio</a> . Visual Studio 2015, вы получаете:
zh_cn: 然后我们转到<a href="https://www.visualstudio.com/">Visual Studio</a> 。 使用Visual Studio 2015，您将获得：

source: Therefore, the above expression invokes UB because two side effects on the same object <code>i</code> is unsequenced relative to each other. That means it is not sequenced whether the side effect by assignment to <code>i</code> will be done before or after the side effect by <code>++</code>.
es: Por lo tanto, la expresi&oacute;n anterior invoca UB porque dos efectos secundarios en el mismo objeto <code>i</code> no est&aacute;n secuenciados entre s&iacute;. Eso significa que no se secuencia si el efecto secundario por asignaci&oacute;n a <code>i</code> se realizar&aacute; antes o despu&eacute;s del efecto secundario por <code>++</code> .
ko: 따라서 동일한 객체 <code>i</code> 에 대한 두 부작용이 서로에 대해 순서가 다르지 않기 때문에 위의 표현식은 UB를 호출합니다. 즉, <code>i</code> 에 할당하여 부작용을 <code>++</code> 로 부작용 전후에 수행할지 여부는 순서가 지정되지 않습니다.
ru: Следовательно, вышеприведенное выражение вызывает UB, потому что два побочных эффекта для одного <code>i</code> того же объекта i не секвенированы относительно друг друга. Это означает, что не определено, будет ли побочный эффект путем присвоения <code>i</code> выполняться до или после побочного эффекта <code>++</code> .
zh_cn: 因此，上面的表达式调用UB，因为对同一对象 <code>i</code> 的两个副作用相对于彼此没有顺序。 这就意味着，对赋给 <code>i</code> 的副作用是否要在 <code>++</code> 的副作用之前或之后进行，尚无定论。

source: These expressions are all fine:
es: Estas expresiones están bien:
ko: 이 표현들은 모두 괜찮습니다.
ru: Все эти выражения в порядке:
zh_cn: 这些表达方式都很好。

source: These expressions are all undefined:
es: Estas expresiones son todas indefinidas:
ko: 이 표현식은 모두 정의되어 있지 않습니다.
ru: Все эти выражения неопределенны:
zh_cn: 这些表达式都是未定义的。

source: This is an important distinction because the <em>comma operator</em> does introduce a <em>sequence point</em> between the evaluation of their operands, which makes the following legal:
es: Esta es una distinci&oacute;n importante porque el <em>operador de coma</em> introduce un <em>punto de secuencia</em> entre la evaluaci&oacute;n de sus operandos, lo que hace que lo siguiente sea legal:
ko: <em>쉼표 연산자</em> 가 피연산자 평가 사이에 <em>시퀀스 포인트</em> 를 도입하여 다음을 합법화하기 때문에 이는 중요한 차이점입니다.
ru: Это важное различие, потому что <em>оператор запятой</em> вводит <em>точку последовательности</em> между оценкой их операндов, что делает следующее законным:
zh_cn: 这是一个重要的区别，因为<em>逗号运算符</em>的确在操作数的评估之间引入了一个<em>序列点</em> ，这使得以下合法性：

source: This is what I get on my machine, together with what I think is going on:
es: Esto es lo que tengo en mi máquina,junto con lo que creo que está pasando:
ko: 이것이 내가 생각하는 것과 함께 내 컴퓨터에 얻는 것입니다.
ru: Это то,что я получаю на своей машине,вместе с тем,что я думаю,что происходит:
zh_cn: 这是我的机器上得到的,加上我认为的情况。

source: This means, "add 1 to i, and assign the result back to i". So if we construct a hodgepodge of the two, by writing
es: Esto significa,"sumar 1 a i,y asignar el resultado de nuevo a i".Así que si construimos una mezcolanza de los dos,escribiendo
ko: 이는 "i에 1을 추가하고 결과를 i에 다시 할당"을 의미합니다. 따라서 우리가이 두 가지를 만들어서
ru: Это означает "добавить 1 к i,а результат присвоить обратно i".Итак,если мы построим из них ходжподж,написав
zh_cn: 这意味着,"把1加到i上,把结果分配给i"。所以,如果我们把这两者构造成一个大杂烩,通过写出

source: This paragraph renders undefined statement expressions such as
es: En este párrafo se presentan expresiones de declaración no definidas como
ko: 이 단락은 다음과 같은 정의되지 않은 명령문 표현식을 렌더링합니다.
ru: В этом пункте приводятся неопределенные выражения высказываний,такие как
zh_cn: 本段将未定义的语句表达式,如
