Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: has <em>undefined behaviour</em> because <strong>there is no sequence point between the evaluations of <code>i++</code> and <code>++i</code> in function arguments</strong>, and the value of <code>i</code> is therefore modified twice, by both <code>i++</code> and <code>++i</code>, between the previous and the next sequence point.
es: tiene <em>un comportamiento indefinido</em> porque <strong>no hay un punto de secuencia entre las evaluaciones de <code>i++</code> y <code>++i</code> en los argumentos de la funci&oacute;n</strong> y, por lo tanto, el valor de <code>i</code> se modifica dos veces, tanto por <code>i++</code> como por <code>++i</code> , entre el punto de secuencia anterior y el siguiente.
ko: <strong>함수 인수에서 <code>i++</code> 와 <code>++i</code> 의 평가 사이에 시퀀스 포인트가 없으므로 i</strong> 의 값이 이전과 다음 시퀀스 포인트 사이에서 <code>i++</code> 와 <code>++i</code> 에 의해 두 번 수정되므로 <em>정의되지 않은 동작</em> 이 있습니다.
ru: имеет <em>неопределенное поведение,</em> потому <strong>что между значениями <code>i++</code> и <code>++i</code> в аргументах функции отсутствует точка последовательности</strong> , и поэтому значение <code>i</code> изменяется дважды, как <code>i++</code> и <code>++i</code> , между предыдущей и следующей точкой последовательности.
zh_cn: 之所以具有<em>未定义的行为</em> <strong>，是</strong>因为<strong>在函数参数中 <code>i++</code> 和 <code>++i</code> 的求值之间没有序列点，</strong>因此 <code>i</code> 的值被 <code>i++</code> 和 <code>++i</code> 两次修改了前一个和下一个序列点之间。

source: is a text-book example of undefined behavior (see Wikipedia's entry on <a href="http://en.wikipedia.org/wiki/Sequence_point">sequence points</a>).
es: es un ejemplo de libro de texto de comportamiento indefinido (vea la entrada de Wikipedia sobre <a href="http://en.wikipedia.org/wiki/Sequence_point">puntos de secuencia</a> ).
ko: 정의되지 않은 동작의 교과서 예제입니다 ( <a href="http://en.wikipedia.org/wiki/Sequence_point">시퀀스 포인트</a> 에 대한 Wikipedia의 항목 참조).
ru: пример учебника из неопределенного поведения (см. статью Википедии о <a href="http://en.wikipedia.org/wiki/Sequence_point">точках последовательности</a> ).
zh_cn: 是未定义行为的教科书示例（请参阅Wikipedia关于<a href="http://en.wikipedia.org/wiki/Sequence_point">序列点</a>的条目）。

source: is well-defined, and will increment <code>i</code> by one, yielding the old value, discard that value; then at comma operator, settle the side effects; and then increment <code>i</code> by one, and the resulting value becomes the value of the expression - i.e. this is just a contrived way to write <code>j = (i += 2)</code> which is yet again a "clever" way to write
es: est&aacute; bien definido e incrementar&aacute; <code>i</code> en uno, produciendo el valor anterior, descarte ese valor; luego, en el operador de coma, resuelva los efectos secundarios; y luego incrementa <code>i</code> en uno, y el valor resultante se convierte en el valor de la expresi&oacute;n, es decir, esta es solo una forma artificial de escribir <code>j = (i += 2)</code> que nuevamente es una forma "inteligente" de escribir
ko: 잘 정의되어 있으며 <code>i</code> 를 1 씩 증가시켜 이전 값을 산출하고 해당 값을 버립니다. 그런 다음 쉼표 연산자에서 부작용을 해결하십시오. 그리고 <code>i</code> 를 1 씩 증가 시키면 결과 값은 표현식의 값이됩니다. 즉 이것은 <code>j = (i += 2)</code> 하는 또 다른 방법입니다.
ru: четко определен и будет увеличивать <code>i</code> на единицу, давая старое значение, отбрасывать это значение; затем в оператор запятой, урегулировать побочные эффекты; и затем увеличиваем <code>i</code> на единицу, и результирующее значение становится значением выражения - т.е. это просто надуманный способ записи <code>j = (i += 2)</code> который снова является &laquo;умным&raquo; способом записи
zh_cn: 定义明确，将 <code>i</code> 加1，得到旧值，然后舍弃该值； 然后在逗号运算符处解决副作用； 然后将 <code>i</code> 加1，结果值就成为表达式的值-即，这只是编写 <code>j = (i += 2)</code> 一种人为方式，而这又是一种&ldquo;聪明&rdquo;的编写方式

source: it cites the following code examples as being undefined:
es: cita los siguientes ejemplos de código como no definidos:
ko: 다음 코드 예제는 정의되지 않은 것으로 인용합니다.
ru: он приводит следующие примеры кода как неопределенные:
zh_cn: 它引用了以下未定义的代码示例:

source: or as
es: o como
ko: 또는
ru: или как
zh_cn: 或作为

source: or similar variants.
es: o variantes similares.
ko: 또는 유사한 변형.
ru: или похожие варианты.
zh_cn: 或类似的变体。

source: resulting in two different results <code>1</code> and <code>2</code> which depends on the sequence of side effects by assignment and <code>++</code> and hence invokes UB.
es: resultando en dos resultados diferentes <code>1</code> y <code>2</code> que dependen de la secuencia de efectos secundarios por asignaci&oacute;n y <code>++</code> y, por lo tanto, invoca UB.
ko: 할당과 <code>++</code> 에 의한 부작용 순서에 따라 두 가지 다른 결과 <code>1</code> 과 <code>2</code> 가되므로 UB를 호출합니다.
ru: в результате получаются два разных результата <code>1</code> и <code>2</code> , которые зависят от последовательности побочных эффектов при назначении и <code>++</code> и, следовательно, вызывают UB.
zh_cn: 产生两个不同的结果 <code>1</code> 和 <code>2</code> ，这取决于赋值和 <code>++</code> 的副作用序列，因此调用UB。

source: standard says that:
es: El estándar dice eso:
ko: 표준은 말합니다 :
ru: Стандарт так говорит:
zh_cn: 标准是这样说的。

source: the <a href="http://en.cppreference.com/w/c/language/eval_order"><em>order of evaluation</em></a> of arguments in <code>printf()</code> is <a href="https://en.wikipedia.org/wiki/Unspecified_behavior"><em>unspecified</em></a>. That means, expressions <code>i++</code> and <code>++i</code> could be evaluated in any order. <a href="http://port70.net/~nsz/c/c11/n1570.html">C11 standard</a> has some relevant descriptions on this:
es: El <a href="http://en.cppreference.com/w/c/language/eval_order"><em>orden de evaluaci&oacute;n</em></a> de los argumentos en <code>printf()</code> <a href="https://en.wikipedia.org/wiki/Unspecified_behavior"><em>no</em></a> est&aacute; <em>especificado</em> . Eso significa que las expresiones <code>i++</code> y <code>++i</code> podr&iacute;an evaluarse en cualquier orden. <a href="http://port70.net/~nsz/c/c11/n1570.html">El est&aacute;ndar C11</a> tiene algunas descripciones relevantes sobre esto:
ko: <code>printf()</code> 의 인수 <a href="http://en.cppreference.com/w/c/language/eval_order"><em>평가 순서</em></a> 는 <a href="https://en.wikipedia.org/wiki/Unspecified_behavior"><em>지정되어 있지 않습니다</em></a> . 즉, 식 <code>i++</code> 및 <code>++i</code> 는 임의의 순서로 평가 될 수 있습니다. <a href="http://port70.net/~nsz/c/c11/n1570.html">C11 표준</a> 에는 다음과 같은 관련 설명이 있습니다.
ru: <a href="http://en.cppreference.com/w/c/language/eval_order"><em>порядок вычисления</em></a> аргументов в <code>printf()</code> не <a href="https://en.wikipedia.org/wiki/Unspecified_behavior"><em>указан</em></a> . Это означает, что выражения <code>i++</code> и <code>++i</code> можно вычислять в любом порядке. <a href="http://port70.net/~nsz/c/c11/n1570.html">Стандарт C11</a> имеет некоторые соответствующие описания по этому вопросу:
zh_cn: <a href="https://en.wikipedia.org/wiki/Unspecified_behavior"><em>未指定</em></a> <code>printf()</code> 中参数<a href="http://en.cppreference.com/w/c/language/eval_order"><em>的求值顺序</em></a> 。 这意味着表达式 <code>i++</code> 和 <code>++i</code> 可以按任何顺序求值。 <a href="http://port70.net/~nsz/c/c11/n1570.html">C11标准</a>对此有一些相关描述：

source: the equivalent code in defined behavior C++ as GCC understands:
es: el código equivalente en el comportamiento definido C++como entiende GCC:
ko: GCC가 이해하는 정의 된 동작 C ++의 해당 코드 :
ru: эквивалентный код в определенном поведении Си++,как понимает GCC:
zh_cn: GCC理解的定义行为C++中的等价代码。

source: the question is, before calling <code>printf</code>, does the compiler compute the value of <code>x</code> first, or <code>x++</code>, or maybe <code>++x</code>? But it turns out <em>we don't know</em>. There's no rule in C which says that the arguments to a function get evaluated left-to-right, or right-to-left, or in some other order. So we can't say whether the compiler will do <code>x</code> first, then <code>++x</code>, then <code>x++</code>, or <code>x++</code> then <code>++x</code> then <code>x</code>, or some other order. But the order clearly matters, because depending on which order the compiler uses, we'll clearly get different results printed by <code>printf</code>.
es: la pregunta es, antes de llamar a <code>printf</code> , &iquest;el compilador calcula el valor de <code>x</code> primero, o <code>x++</code> , o tal vez <code>++x</code> ? Pero resulta <em>que no lo sabemos</em> . No hay una regla en C que diga que los argumentos de una funci&oacute;n se eval&uacute;an de izquierda a derecha, o de derecha a izquierda, o en alg&uacute;n otro orden. Por lo tanto, no podemos decir si el compilador har&aacute; <code>x</code> primero, luego <code>++x</code> , luego <code>x++</code> o <code>x++</code> luego <code>++x</code> luego <code>x</code> , o alg&uacute;n otro orden. Pero el orden claramente importa, porque dependiendo del orden que use el compilador, claramente obtendremos diferentes resultados impresos por <code>printf</code> .
ko: 문제는 <code>printf</code> 를 호출하기 전에 컴파일러가 <code>x</code> 의 값을 먼저 계산합니까, <code>x++</code> 또는 <code>++x</code> 입니까? 그러나 <em>우리는 모른다</em> . C에는 함수에 대한 인수가 왼쪽에서 오른쪽으로, 오른쪽에서 왼쪽으로 또는 다른 순서로 평가된다는 규칙이 없습니다. 따라서 컴파일러가 <code>x</code> 를 먼저 수행 한 다음 <code>++x</code> , <code>x++</code> 또는 <code>x++</code> 를 수행하고 <code>++x</code> 다음에 <code>x</code> 또는 다른 순서를 수행할지 여부를 알 수 없습니다. 그러나 순서는 분명히 중요합니다. 컴파일러가 사용하는 순서에 따라 <code>printf</code> 에 의해 다른 결과가 명확하게 인쇄되기 때문입니다.
ru: вопрос перед вызовом <code>printf</code> : компилятор сначала вычисляет значение <code>x</code> , или <code>x++</code> , или, возможно, <code>++x</code> ? Но оказывается, что <em>мы не знаем</em> . В C нет правила, согласно которому аргументы функции оцениваются слева направо, справа налево или в каком-либо другом порядке. Поэтому мы не можем сказать, будет ли компилятор делать сначала <code>x</code> , затем <code>++x</code> , затем <code>x++</code> или <code>x++</code> затем <code>++x</code> , затем <code>x</code> или какой-то другой порядок. Но порядок явно имеет значение, потому что в зависимости от того, какой порядок использует компилятор, мы ясно получим разные результаты, напечатанные <code>printf</code> .
zh_cn: 问题是，在调用 <code>printf</code> 之前，编译器会先计算 <code>x</code> 的值，还是 <code>x++</code> 或 <code>++x</code> ？ 但是事实证明<em>我们不知道</em> 。 C语言中没有规则说函数的参数从左到右或从右到左或以其他顺序求值。 所以我们不能说编译器是先执行 <code>x</code> ，然后执行 <code>++x</code> ，然后执行 <code>x++</code> ，还是先执行 <code>x++</code> 然后执行 <code>++x</code> 然后执行 <code>x</code> ，或执行其他一些顺序。 但是顺序显然很重要，因为根据编译器使用的顺序，我们显然会得到由 <code>printf</code> 打印的不同结果。

source: there are three attempts to modify `x.
es: hay tres intentos de modificar `x.
ko: `x를 수정하려는 세 가지 시도가 있습니다.
ru: есть три попытки изменить `x.
zh_cn: 有三次修改`x的尝试:

source: use of an unspecified value, or other behavior where this International Standard provides two or more possibilities and imposes no further requirements on which is chosen in any instance
es: uso de un valor no especificado,u otro comportamiento en el que esta Norma Internacional proporcione dos o más posibilidades y no imponga ningún otro requisito sobre el que se elija en ningún caso
ko: 불특정 한 가치의 사용, 또는이 국제 표준이 둘 이상의 가능성을 제공하고 어떤 경우에도 선택되는 추가 요구 사항을 부과하지 않는 기타 행동
ru: использование неопределенного значения или иное поведение,когда данный международный стандарт предоставляет две или более возможности и не налагает никаких дополнительных требований,которые выбраны ни в одном из случаев
zh_cn: 使用未指定的值,或本国际标准提供了两种或两种以上的可能性,并且在任何情况下都不对选择哪种可能性提出进一步要求的其他行为

source: we both use the value of <code>x</code>, and modify it.
es: ambos usamos el valor de <code>x</code> y lo modificamos.
ko: 우리는 <code>x</code> 값을 사용하고 수정합니다.
ru: мы оба используем значение <code>x</code> и модифицируем его.
zh_cn: 我们都使用 <code>x</code> 的值，并对其进行修改。

source: we do not know whether <code>i++</code> or <code>++i</code> will be evaluated first. This is mainly to give the compiler <a href="https://stackoverflow.com/a/12540468/1708801">better options for optimization</a>.
es: no sabemos si <code>i++</code> o <code>++i</code> ser&aacute;n evaluados primero. Esto es principalmente para dar al compilador <a href="https://stackoverflow.com/a/12540468/1708801">mejores opciones para la optimizaci&oacute;n</a> .
ko: 우리는 <code>i++</code> 또는 <code>++i</code> 가 먼저 평가되는지 알 수 없습니다. 이것은 주로 컴파일러에게 <a href="https://stackoverflow.com/a/12540468/1708801">최적화를위한 더 나은 옵션을 제공하기위한 것</a> 입니다.
ru: мы не знаем, будет ли <code>i++</code> или <code>++i</code> оценены первыми. Это главным образом для того, чтобы дать компилятору <a href="https://stackoverflow.com/a/12540468/1708801">лучшие возможности для оптимизации</a> .
zh_cn: 我们不知道会先评估 <code>i++</code> 还是 <code>++i</code> 。 这主要是为编译器提供<a href="https://stackoverflow.com/a/12540468/1708801">更好的优化选项</a> 。

source: what we're really saying is "add 1 to i, and assign the result back to i, and assign the result back to i". We're confused, so it doesn't bother me too much if the compiler gets confused, too.
es: lo que realmente estamos diciendo es "agregue 1 a i,y asigne el resultado de nuevo a i,y asigne el resultado de nuevo a i".Estamos confundidos,así que no me molesta demasiado si el compilador también se confunde.
ko: 우리가 실제로 말하는 것은 "i에 1을 더하고 결과를 다시 i에 할당하고 결과를 다시 i에 할당"입니다. 우리는 혼란스러워서 컴파일러가 혼란스러워도 너무 귀찮게하지 않습니다.
ru: На самом деле мы говорим,что "добавьте 1 к i,и присваивайте результат обратно i,и присваивайте результат обратно i".Мы запутались,так что меня не слишком беспокоит,если компилятор тоже запутается.
zh_cn: 我们真正要说的是 "把1加到i上,把结果赋给i,再把结果赋给i,再把结果赋给i"。我们是糊涂了,所以如果编译器也糊涂了,我也不会太在意。

source: which prints 7... the OP expected it to print 6.
es: que imprime 7...la OP esperaba que imprimiera 6.
ko: 7을 인쇄합니다. OP는 6을 인쇄 할 것으로 예상했습니다.
ru: который напечатал 7...ОП ожидало,что напечатает 6.
zh_cn: 打印的是7.........OP希望它打印的是6。

source: while allowing
es: mientras que permite
ko: 허용하면서
ru: позволяя
zh_cn: 同时,允许

source: will not be a problem. But it invokes <em>undefined behaviour</em> because the <em>comma</em> here is a <em>separator</em>.
es: No ser&aacute; un problema. Pero invoca <em>un comportamiento indefinido</em> porque la <em>coma</em> aqu&iacute; es un <em>separador</em> .
ko: 문제가되지 않습니다. 그러나 여기서 <em>쉼표</em> 는 <em>구분 기호</em> 이므로 <em>정의되지 않은 동작을</em> 호출합니다.
ru: не будет проблемой. Но это вызывает <em>неопределенное поведение,</em> потому что <em>запятая</em> здесь является <em>разделителем</em> .
zh_cn: 不会有问题。 但是它调用<em>未定义的行为，</em>因为这里的<em>逗号</em>是<em>分隔符</em> 。
