Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: In the paper that I quoted above it is explained that you can figure out the program as being formed by small boxes, each box containing the instructions between 2 consecutive sequence points. The sequence points are defined in annex C of the standard, in the case of <code>i=i++</code> there are 2 sequence points that delimit a full-expression. Such an expression is syntactically equivalent with an entry of <code>expression-statement</code> in the Backus-Naur form of the grammar (a grammar is provided in annex A of the Standard).
es: En el documento que cit&eacute; anteriormente, se explica que puede descubrir que el programa est&aacute; formado por peque&ntilde;os cuadros, cada cuadro contiene las instrucciones entre 2 puntos de secuencia consecutivos. Los puntos de secuencia se definen en el anexo C de la norma, en el caso de <code>i=i++</code> hay 2 puntos de secuencia que delimitan una expresi&oacute;n completa. Tal expresi&oacute;n es sint&aacute;cticamente equivalente con una entrada de <code>expression-statement</code> en la forma de la gram&aacute;tica Backus-Naur (se proporciona una gram&aacute;tica en el anexo A de la Norma).
ko: 위에서 인용 한 논문에서는 프로그램이 작은 상자로 구성되는 것으로 파악할 수 있다고 설명합니다. 각 상자에는 두 개의 연속적인 시퀀스 지점 사이의 명령이 들어 있습니다. 서열 점은 표준의 부속서 C에 정의되어 있으며, <code>i=i++</code> 경우, 완전한 발현을 한정하는 2 개의 서열 점이 존재한다. 이러한 표현은 문법의 Backus-Naur 형태의 <code>expression-statement</code> 입력과 구문 적으로 동등합니다 (문법은 표준의 부록 A에 제공됨).
ru: В статье, которую я цитировал выше, объясняется, что вы можете понять, что программа состоит из маленьких прямоугольников, каждый из которых содержит инструкции между двумя последовательными точками последовательности. Точки последовательности определены в приложении C к стандарту, в случае <code>i=i++</code> есть две точки последовательности, которые ограничивают полное выражение. Такое выражение синтаксически эквивалентно записи <code>expression-statement</code> в форме грамматики Бэкуса-Наура (грамматика приведена в приложении А к Стандарту).
zh_cn: 在上面引用的论文中，我们解释了您可以认为程序是由小盒子组成的，每个小盒子都包含2个连续序列点之间的指令。 序列点在标准的附录C中定义，在 <code>i=i++</code> 的情况下，有2个序列点界定完整表达。 这样的表达在语法上等同于以Backus-Naur格式的语法（在标准的附件A中提供了一种语法）形式的 <code>expression-statement</code> 。

source: It means the expression <code>il = ir++</code> could be evaluated either as
es: Significa que la expresi&oacute;n <code>il = ir++</code> podr&iacute;a evaluarse como
ko: 이는 <code>il = ir++</code> 표현식을 다음과 같이 평가할 수 있음을 의미합니다.
ru: Это означает, что выражение <code>il = ir++</code> может быть оценено как
zh_cn: 这意味着表达式 <code>il = ir++</code> 可以计算为

source: Just compile and disassemble your line of code, if you are so inclined to know how exactly it is you get what you are getting.
es: Sólo compila y desmonta tu línea de código,si estás tan inclinado a saber cómo exactamente es que obtienes lo que obtienes.
ko: 당신이 얻는 것을 얼마나 정확하게 얻는 지 알고 싶다면 코드 라인을 컴파일하고 분해하십시오.
ru: Просто скомпилируйте и разберите ваш код,если вы так склонны знать,как именно вы получаете то,что получаете.
zh_cn: 只要编译和拆解你的那行代码就可以了,如果你这么想知道到底是怎么得到的,你就会得到你所得到的东西。

source: Let's go back to the two examples I've used in this answer. When I wrote
es: Volvamos a los dos ejemplos que he usado en esta respuesta.Cuando escribí
ko: 이 답변에서 사용한 두 가지 예로 돌아가 보겠습니다. 내가 쓸 때
ru: Давайте вернемся к двум примерам,которые я использовал в этом ответе.Когда я писал
zh_cn: 我们再来看看我在这个答案中用过的两个例子。当我写到

source: Lets rename the <code>i</code> at left of assignment be <code>il</code> and at the right of assignment (in the expression <code>i++</code>) be <code>ir</code>, then the expression be like
es: Cambiemos el nombre de <code>i</code> a la izquierda de la asignaci&oacute;n por <code>il</code> y a la derecha de la asignaci&oacute;n (en la expresi&oacute;n <code>i++</code> ) sea <code>ir</code> , entonces la expresi&oacute;n ser&aacute; como
ko: 과제의 왼쪽에있는 <code>i</code> 의 이름을 <code>il</code> 로 하고 과제의 오른쪽에있는 <code>i++</code> (식 i ++에서 )의 이름을 <code>ir</code> 로 바꾸면 표현식은 다음과 같습니다.
ru: Давайте переименуем <code>i</code> слева от присваивания быть <code>il</code> , а справа от присваивания (в выражении <code>i++</code> ) - <code>ir</code> , тогда выражение будет похоже
zh_cn: 让重命名赋值左边的 <code>i</code> 为 <code>il</code> ,并赋值右边的 <code>i++</code> （在表达式i ++中 ）为 <code>ir</code> ，则表达式类似

source: Modern compilers will optimize this very well. In fact, possibly better than the code you originally wrote (assuming it had worked the way you had hoped).
es: Los compiladores modernos optimizarán esto muy bien.De hecho,posiblemente mejor que el código que escribió originalmente (suponiendo que haya funcionado de la manera que esperaba).
ko: 최신 컴파일러는 이것을 잘 최적화합니다. 실제로, 원래 작성한 코드보다 더 좋을 수 있습니다 (원하는 방식으로 작동했다고 가정).
ru: Современные компиляторы очень хорошо это оптимизируют.На самом деле,возможно,лучше,чем код,который вы написали изначально (предполагая,что он работал так,как вы надеялись).
zh_cn: 现代编译器会很好地优化这个问题。事实上,可能比你最初写的代码要好(假设它按你希望的方式工作)。

source: Most of the answers here quoted from C standard emphasizing that the behavior of these constructs are undefined. To understand <strong>why the behavior of these constructs are undefined</strong>, let's understand these terms first in the light of C11 standard:
es: La mayor&iacute;a de las respuestas aqu&iacute; citadas del est&aacute;ndar C enfatizan que el comportamiento de estas construcciones no est&aacute; definido. Para comprender <strong>por qu&eacute; el comportamiento de estas construcciones no est&aacute; definido</strong> , comprendamos primero estos t&eacute;rminos a la luz del est&aacute;ndar C11:
ko: 여기에 나오는 대부분의 답변은 C 표준에서 인용 한 것으로, 이러한 구성의 동작이 정의되어 있지 않음을 강조합니다. <strong>이러한 구성의 동작이 정의되지 않은 이유</strong> 를 이해하려면 C11 표준에 비추어 먼저이 용어를 이해하십시오.
ru: Большинство ответов здесь процитированы из стандарта C, подчеркивая, что поведение этих конструкций не определено. Чтобы понять, <strong>почему поведение этих конструкций не определено</strong> , давайте сначала разберемся в этих терминах в свете стандарта C11:
zh_cn: 这里大多数引用C标准的答案都强调这些构造的行为是不确定的。 要理解<strong>为什么未定义这些构造的行为</strong> ，让我们首先根据C11标准来理解这些术语：

source: Now coming to the question, for the expressions like
es: Ahora llegando a la pregunta,por las expresiones como
ko: 이제 질문에옵니다.
ru: Теперь перейдем к вопросу,для таких выражений,как
zh_cn: 现在说到这个问题,对于像这样的表达方式,如

source: Often this question is linked as a duplicate of questions related to code like
es: A menudo esta pregunta se vincula como un duplicado de las preguntas relacionadas con el código como
ko: 종종이 질문은 다음과 같은 코드와 관련된 질문의 중복으로 연결됩니다
ru: Часто этот вопрос связан как дубликат вопросов,относящихся к коду типа
zh_cn: 通常情况下,这个问题是作为与代码相关的问题的重复链接,如

source: Or, perhaps you're looking at a hard-to-understand expression like
es: O,tal vez estás viendo una expresión difícil de entender como
ko: 또는 아마도 이해하기 어려운 표현을보고있을 것입니다
ru: Или,возможно,вы смотрите на труднопонятное выражение вроде
zh_cn: 或者,也许你看到的是一种难以理解的表达方式,如

source: Other good source for explaining such ambiguities are the entries from <a href="http://c-faq.com/">c-faq</a> site (also published <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">as a book</a>) , namely <a href="http://c-faq.com/expr/seqpoints.html">here</a> and <a href="http://c-faq.com/expr/evalorder4.html">here</a> and <a href="http://c-faq.com/expr/confused.html">here</a> .
es: Otra buena fuente para explicar tales ambig&uuml;edades son las entradas del sitio <a href="http://c-faq.com/">c-faq</a> (tambi&eacute;n publicado <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">como libro</a> ), es decir, <a href="http://c-faq.com/expr/seqpoints.html">aqu&iacute;</a> y <a href="http://c-faq.com/expr/evalorder4.html">aqu&iacute;</a> y <a href="http://c-faq.com/expr/confused.html">aqu&iacute;</a> .
ko: 이러한 모호성을 설명하는 또 다른 좋은 출처는 <a href="http://c-faq.com/">c-faq</a> 사이트 ( <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">도서로</a> 도 게시 됨 )의 항목, 즉 <a href="http://c-faq.com/expr/seqpoints.html">여기</a> 와 <a href="http://c-faq.com/expr/evalorder4.html">여기</a> 및 <a href="http://c-faq.com/expr/confused.html">여기</a> 입니다.
ru: Другим хорошим источником для объяснения такой неоднозначности являются записи с сайта <a href="http://c-faq.com/">c-faq</a> (также опубликованные <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">в виде книги</a> ), а именно <a href="http://c-faq.com/expr/seqpoints.html">здесь,</a> <a href="http://c-faq.com/expr/evalorder4.html">здесь</a> и <a href="http://c-faq.com/expr/confused.html">здесь</a> .
zh_cn: 其他解释此类歧义的好方法是来自<a href="http://c-faq.com/">c-faq</a>网站（也<a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">作为书出版</a> ）的条目，即<a href="http://c-faq.com/expr/seqpoints.html">此处</a> ， <a href="http://c-faq.com/expr/evalorder4.html">此处</a>和<a href="http://c-faq.com/expr/confused.html">此处</a> 。

source: Perhaps someone gave you that code as a puzzle. This code also makes no sense, especially if you run it -- and if you compile and run it under two different compilers, you're likely to get two different answers! What's up with that? Which answer is correct? (And the answer is that both of them are, or neither of them are.)
es: Tal vez alguien le dio ese código como un rompecabezas.Este código tampoco tiene sentido,especialmente si lo ejecutas...y si lo compilas y ejecutas en dos compiladores diferentes,¡es probable que obtengas dos respuestas diferentes! ¿Qué pasa con eso? ¿Qué respuesta es correcta? (Y la respuesta es que ambas lo son,o ninguna de ellas lo es.)
ko: 아마도 누군가 당신에게 그 코드를 퍼즐로 줬을 것입니다. 이 코드는 특히 실행하는 경우 의미가 없으며 두 개의 다른 컴파일러에서 컴파일하고 실행하면 두 가지 다른 답변을 얻을 수 있습니다! 무슨 일이야? 어떤 대답이 맞습니까? (그리고 대답은 둘 다 또는 둘 다 없다는 것입니다.)
ru: Возможно,кто-то дал тебе этот код в качестве головоломки.Этот код также не имеет смысла,особенно если вы его запускаете --и если вы скомпилируете и запустите его под двумя разными компиляторами,вы,скорее всего,получите два разных ответа! Что это такое? Какой ответ правильный? (И ответ в том,что оба они или ни один из них).
zh_cn: 也许有人把这段代码作为谜题给了你。这段代码也没有任何意义,尤其是当你运行它的时候--如果你在两个不同的编译器下编译和运行它,你很可能得到两个不同的答案!这段代码是什么意思?这到底是怎么回事?哪一个答案是正确的?答案是两个都是,或者两个都不是)。

source: Possible undefined behavior ranges from ignoring the situation completely with unpredictable results, to behaving during translation or program execution in a documented manner characteristic of the environment (with or without the issuance of a diagnostic message), to terminating a translation or execution (with the issuance of a diagnostic message).
es: El posible comportamiento indefinido va desde ignorar completamente la situación con resultados impredecibles,hasta comportarse durante la traducción o la ejecución del programa de manera documentada y característica del entorno (con o sin la emisión de un mensaje de diagnóstico).
ko: 정의되지 않은 동작은 예측할 수없는 결과로 상황을 완전히 무시하는 것, 환경의 특징적인 문서화 된 방식으로 진단 또는 프로그램 실행 중 (진단 메시지 발행 여부에 관계없이), 번역 또는 실행 종료 (발급 포함)에 이르기까지 다양합니다. 진단 메시지).
ru: Возможное неопределённое поведение варьируется от игнорирования ситуации полностью с непредсказуемыми результатами,до поведения во время трансляции или выполнения программы в документированной форме,характерной для данной среды (с выдачей или без выдачи диагностического сообщения),до прекращения трансляции или выполнения (с выдачей диагностического сообщения).
zh_cn: 可能出现的未定义的行为,从完全无视情况,结果不可预知,到在翻译或程序执行过程中以环境特征的记录方式(有或没有发出诊断信息),再到终止翻译或执行(发出诊断信息)。

source: Realistically, the only time these crazy expressions get written is when people are using them as artificial examples of how ++ is supposed to work. And of course it is important to understand how ++ works. But one practical rule for using ++ is, "If it's not obvious what an expression using ++ means, don't write it."
es: Siendo realistas,la única vez que estas locas expresiones se escriben es cuando la gente las usa como ejemplos artificiales de cómo se supone que funciona el ++.Y por supuesto es importante entender cómo funciona el ++.Pero una regla práctica para usar ++es,"Si no es obvio lo que significa una expresión que usa ++,no la escribas".
ko: 현실적으로,이 미친 표현은 사람들이 ++가 어떻게 작동해야하는지에 대한 인공적인 예로서 사용하는 경우에만 가능합니다. 물론 ++ 작동 방식을 이해하는 것이 중요합니다. 그러나 ++를 사용하는 실질적인 규칙 중 하나는 "++를 사용한 표현의 의미가 확실하지 않으면 쓰지 마십시오"입니다.
ru: Реалистично эти сумасшедшие выражения пишутся только тогда,когда люди используют их в качестве искусственных примеров того,как должен работать ++.И,конечно же,важно понимать,как работает ++.Но одно практическое правило использования ++:"Если не очевидно,что означает выражение,использующее ++,не пишите его".
zh_cn: 现实上,这些疯狂的表达方式唯一被写出来的时候,就是人们把这些疯狂的表达方式作为+++应该如何工作的人为例子。当然,理解+++的工作原理也很重要。但使用+++的一个实际规则是,"如果使用++的表达式的意思不明显,就不要写它。"

source: See also <a href="http://c-faq.com/expr/seqpoints.html">question 3.8</a> and the rest of the questions in <a href="http://c-faq.com/expr/index.html">section 3</a> of the <a href="http://c-faq.com/">C FAQ list</a>.
es: Consulte tambi&eacute;n la <a href="http://c-faq.com/expr/seqpoints.html">pregunta 3.8</a> y el resto de las preguntas en la <a href="http://c-faq.com/expr/index.html">secci&oacute;n 3</a> de la <a href="http://c-faq.com/">lista de preguntas frecuentes de C.</a>
ko: <a href="http://c-faq.com/expr/seqpoints.html">질문 3.8</a> 및 <a href="http://c-faq.com/">C FAQ 목록</a> 의 <a href="http://c-faq.com/expr/index.html">섹션 3</a> 에있는 나머지 질문 도 참조하십시오.
ru: См. Также <a href="http://c-faq.com/expr/seqpoints.html">вопрос 3.8</a> и остальные вопросы в <a href="http://c-faq.com/expr/index.html">разделе 3</a> <a href="http://c-faq.com/">списка C FAQ</a> .
zh_cn: 另请参阅<a href="http://c-faq.com/expr/seqpoints.html">问题3.8</a>和<a href="http://c-faq.com/">C常见问题解答列表</a> <a href="http://c-faq.com/expr/index.html">第3节中</a>的其余问题 。

source: So a sequence point can be seen by the beginning and the end of each box that composes the program [the boxes are atomic units in C] and inside a box the order of instructions is not defined in all cases. Changing that order one can change the result sometimes.
es: Así que se puede ver un punto de secuencia por el principio y el final de cada caja que compone el programa [las cajas son unidades atómicas en C]y dentro de una caja el orden de las instrucciones no está definido en todos los casos.Cambiando ese orden se puede cambiar el resultado a veces.
ko: 따라서 프로그램을 구성하는 각 상자의 시작과 끝에서 시퀀스 포인트를 볼 수 있습니다 (상자는 C의 원자 단위 임). 상자 안의 지시 순서는 모든 경우에 정의되지 않습니다. 순서를 변경하면 결과가 변경 될 수 있습니다.
ru: Таким образом,точка следования видна по началу и концу каждого ящика,составляющего программу [ящики являются атомными единицами в C],а внутри ящика не во всех случаях определен порядок следования инструкций.Изменяя этот порядок иногда можно изменить результат.
zh_cn: 所以一个序列点可以通过组成程序的每一个框的开头和结尾看到[框是C语言中的原子单位],而在一个框内,指令的顺序并不是在所有情况下都是确定的。改变这个顺序有时会改变结果。

source: So every statement of the form:
es: Así que cada declaración del formulario:
ko: 따라서 양식의 모든 진술 :
ru: Так что каждое утверждение формы:
zh_cn: 所以,每一个声明的形式。

source: So first the GCC: Using <a href="https://nuwen.net/mingw.html">Nuwen MinGW</a> 15 GCC 7.1 you will get:
es: Primero el GCC: Usando <a href="https://nuwen.net/mingw.html">Nuwen MinGW</a> 15 GCC 7.1 obtendr&aacute;s:
ko: 먼저 GCC : <a href="https://nuwen.net/mingw.html">Nuwen MinGW</a> 15 GCC 7.1을 사용하면 다음과 같은 이점 이 있습니다.
ru: Итак, сначала GCC: Используя <a href="https://nuwen.net/mingw.html">Nuwen MinGW</a> 15 GCC 7.1, вы получите:
zh_cn: 所以首先是GCC：使用<a href="https://nuwen.net/mingw.html">Nuwen MinGW</a> 15 GCC 7.1，您将获得：

source: So if the <em>comma</em> in the function call were to be a comma operator then
es: Entonces, si la <em>coma</em> en la llamada de funci&oacute;n fuera un operador de coma, entonces
ko: 따라서 함수 호출의 쉼표가 쉼표 연산자 인 경우
ru: Так что, если <em>запятая</em> в вызове функции должна быть оператором запятой, то
zh_cn: 因此，如果函数调用中的逗号是逗号运算符，则

source: So moving on to <em>unspecified behavior</em>, in <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">draft c99 standard</a> section<code>6.5</code> paragraph <em>3</em> says(<em>emphasis mine</em>):
es: Entonces, pasando al <em>comportamiento no especificado</em> , en el <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">borrador de la</a> secci&oacute;n <code>6.5</code> del est&aacute;ndar c99 , el p&aacute;rrafo <em>3</em> dice ( <em>&eacute;nfasis m&iacute;o</em> ):
ko: 따라서 <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">c99 표준 초안</a> <code>6.5</code> 단락 <em>3</em> 에서 <em>지정되지 않은 동작으로</em> 이동하면 다음과 같이 말합니다 ( <em>강조 광산</em> ).
ru: Итак, переходя к <em>неопределенному поведению</em> , в <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">черновике c99 стандарта c99</a> параграф <em>3</em> гласит ( <em>выделено мной</em> ):
zh_cn: 因此，继续进行<em>未指定的行为</em> ，在<a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">c99标准草案</a>第 <code>6.5</code> 节第<em>3</em>段中说（ <em>重点是我</em> ）：

source: So that's the answer: make sure that in any expression you write, each variable is modified at most once, and if a variable is modified, you don't also attempt to use the value of that variable somewhere else.
es: Así que esa es la respuesta:asegúrate de que en cualquier expresión que escribas,cada variable se modifique a lo sumo una vez,y si una variable se modifica,no intentes también utilizar el valor de esa variable en otro lugar.
ko: 이것이 바로 답입니다. 작성한 표현식에서 각 변수는 최대 한 번 수정되고 변수가 수정 된 경우 해당 변수의 값을 다른 곳에서도 사용하려고 시도하지 마십시오.
ru: Вот и ответ:убедитесь,что в любом написанном вами выражении каждая переменная изменяется максимум один раз,и если переменная изменяется,вы также не пытаетесь использовать значение этой переменной где-то еще.
zh_cn: 所以这就是答案:确保在你写的任何表达式中,每个变量最多修改一次,如果一个变量被修改了,你不要同时尝试在其他地方使用该变量的值。

source: So the equivalent in defined behavior C++ as Visual C++ understands:
es: Así que el equivalente en comportamiento definido C++como Visual C++entiende:
ko: 따라서 Visual C ++이 이해하는 정의 된 동작 C ++과 동등한 기능은 다음과 같습니다.
ru: То есть эквивалент в определенном поведении С++,как понимает Visual C++:
zh_cn: 所以Visual C++理解的定义行为C++中的等价物。

source: So the order of instructions inside a box has no clear order.
es: Así que el orden de las instrucciones dentro de una caja no tiene un orden claro.
ko: 따라서 상자 안의 지시 순서는 명확한 순서가 아닙니다.
ru: Таким образом,порядок указания внутри коробки не имеет четкого порядка.
zh_cn: 所以一个盒子里面的指示顺序没有明确的顺序。

source: So when we have a line like this:
es: Así que cuando tenemos una línea como esta:
ko: 따라서 다음과 같은 줄이있을 때 :
ru: Так что,когда у нас есть такая линия:
zh_cn: 所以,当我们有这样一条线的时候。

source: So with all that background and introduction out of the way, if you want to make sure that all your programs are well-defined, which expressions can you write, and which ones can you not write?
es: Así que con todos esos antecedentes e introducción fuera del camino,si quieres asegurarte de que todos tus programas están bien definidos,¿qué expresiones puedes escribir y cuáles no?
ko: 따라서 모든 배경과 소개를 벗어난 상태에서 모든 프로그램을 잘 정의하고 싶다면 어떤 표현을 작성할 수 있고 어떤 표현을 쓸 수 없습니까?
ru: Итак,со всем этим фоном и введением,если Вы хотите удостовериться,что все Ваши программы хорошо определены,какие выражения Вы можете писать,а какие нет?
zh_cn: 那么,说了这么多的背景和介绍,如果你想保证你的程序都能很好的定义,那么哪些表达式可以写,哪些不能写呢?

source: So, with that in mind, why are these "issues"? The language clearly says that certain things lead to <a href="http://en.wikipedia.org/wiki/Undefined_behavior">undefined behavior</a>. There is no problem, there is no "should" involved. If the undefined behavior changes when one of the involved variables is declared <code>volatile</code>, that doesn't prove or change anything. It is <em>undefined</em>; you cannot reason about the behavior.
es: Entonces, con eso en mente, &iquest;por qu&eacute; son estos "problemas"? El lenguaje dice claramente que ciertas cosas conducen a <a href="http://en.wikipedia.org/wiki/Undefined_behavior">un comportamiento indefinido</a> . No hay problema, no hay "deber&iacute;a" involucrado. Si el comportamiento indefinido cambia cuando una de las variables involucradas se declara <code>volatile</code> , eso no prueba ni cambia nada. Es <em>indefinido</em> ; No puedes razonar sobre el comportamiento.
ko: 그래서, 그 점을 염두에두고 왜 이러한 "문제"가 있습니까? 언어는 특정 사물이 <a href="http://en.wikipedia.org/wiki/Undefined_behavior">정의되지 않은 행동으로</a> 이어진다 고 분명히 말합니다. 문제는 없습니다. 관련된 "해야합니다"없습니다. 관련 변수 중 하나가 <code>volatile</code> 로 선언 될 때 정의되지 않은 동작이 변경되면 아무 것도 증명하거나 변경하지 않습니다. <em>정의되어 있지 않습니다</em> . 당신은 그 행동에 대해 추론 할 수 없습니다.
ru: Итак, с учетом этого, почему эти "проблемы"? Язык ясно говорит, что определенные вещи приводят к <a href="http://en.wikipedia.org/wiki/Undefined_behavior">неопределенному поведению</a> . Нет проблем, нет &laquo;надо&raquo; участвовать. Если неопределенное поведение изменяется, когда одна из задействованных переменных объявлена ​​как <code>volatile</code> , это ничего не доказывает и не меняет. Это не <em>определено</em> ; Вы не можете рассуждать о поведении.
zh_cn: 因此，考虑到这些原因，为什么会出现这些&ldquo;问题&rdquo;？ 该语言清楚地指出，某些事情会导致<a href="http://en.wikipedia.org/wiki/Undefined_behavior">不确定的行为</a> 。 没问题，没有&ldquo;应该&rdquo;涉及。 如果在将其中一个涉及的变量声明为 <code>volatile</code> 时未定义的行为发生了变化，则不会证明或更改任何内容。 它是<em>未定义的</em> ; 您无法对此行为进行推理。

source: The <code>++i</code> increments aren't guaranteed to all complete before the rest of the calculations. In fact, different compilers will get different results here. In the example you provided, the first 2 <code>++i</code> executed, then the values of <code>k[]</code> were read, then the last <code>++i</code> then <code>k[]</code>.
es: No se garantiza que los incrementos de <code>++i</code> se completen antes del resto de los c&aacute;lculos. De hecho, diferentes compiladores obtendr&aacute;n diferentes resultados aqu&iacute;. En el ejemplo que proporcion&oacute;, se ejecutaron los primeros 2 <code>++i</code> , luego se leyeron los valores de <code>k[]</code> , luego el &uacute;ltimo <code>++i</code> luego <code>k[]</code> .
ko: <code>++i</code> 증분이 나머지 계산 전에 모두 완료되는 것은 아닙니다. 실제로 다른 컴파일러는 다른 결과를 얻습니다. 제공 한 예제에서 처음 두 <code>++i</code> 가 실행 된 다음 <code>k[]</code> 의 값을 읽은 다음 마지막 <code>++i</code> 와 k [] 를 읽었습니다.
ru: Инкременты <code>++i</code> не гарантируются для всех завершенных до остальных вычислений. Фактически, разные компиляторы будут получать разные результаты здесь. В приведенном вами примере сначала были выполнены 2 <code>++i</code> , затем были прочитаны значения <code>k[]</code> , затем последний <code>++i</code> и <code>k[]</code> .
zh_cn: <code>++i</code> 增量不能保证在其余计算之前全部完成。 实际上，不同的编译器在这里会得到不同的结果。 在您提供的示例中，首先执行2个 <code>++i</code> ，然后读取 <code>k[]</code> 的值，然后读取最后一个 <code>++i</code> ，然后读取 <code>k[]</code> 。

source: The <em>unspecified behaviour</em> itself is NOT an issue. Consider this example:
es: El <em>comportamiento no especificado en</em> s&iacute; NO es un problema. Considere este ejemplo:
ko: <em>지정되지 않은 동작</em> 자체는 문제가되지 않습니다. 이 예제를 고려하십시오.
ru: <em>Неопределенное поведение</em> само по себе НЕ является проблемой. Рассмотрим этот пример:
zh_cn: <em>未指定的行为</em>本身不是问题。 考虑以下示例：

source: The C standard says that a variable should only be assigned at most once between two sequence points. A semi-colon for instance is a sequence point.
es: La norma C dice que una variable sólo debe ser asignada como máximo una vez entre dos puntos de secuencia.Un punto y coma,por ejemplo,es un punto de secuencia.
ko: C 표준에 따르면 변수는 두 시퀀스 포인트 사이에 최대 한 번만 할당해야합니다. 예를 들어 세미콜론은 시퀀스 포인트입니다.
ru: Стандарт С гласит,что переменная должна присваиваться не более одного раза между двумя точками следования.Полуколонна,например,является точкой следования.
zh_cn: C标准规定,一个变量最多只能在两个序列点之间分配一次。例如,分号就是一个序列点。

source: The above is a common coding practice while copying/analysing strings.
es: Lo anterior es una práctica común de codificación mientras se copian y analizan las cuerdas.
ko: 위의 내용은 문자열을 복사 / 분석하는 동안 일반적인 코딩 방법입니다.
ru: Вышеизложенное является обычной практикой кодирования при копировании строк.
zh_cn: 以上是复制分析字符串时常用的编码做法。
