Repository: rueisnom/feedback
Catalog: xlf/94/94/33/949433.*.001.xlf
Languages: es, ko, ru, zh_cn

source: (I... suppose that the 0x00000014 instruction was some kind of compiler optimization?)
es: (Yo...supongo que la instrucción 0x00000014 era algún tipo de optimización del compilador?)
ko: (저는 0x00000014 명령이 일종의 컴파일러 최적화라고 가정합니다.)
ru: (Я...предположим,что инструкция 0x00000014 была какой-то оптимизацией компилятора?)
zh_cn: (我...........假设0x00000014指令是编译器的某种优化?)

source: 6.5 Expressions:
es: 6.5 Expresiones:
ko: 6.5 표현 :
ru: 6.5 Выражения:
zh_cn: 6.5 表达方式:

source: <a href="https://stackoverflow.com/a/17935062/2455888">An important point</a> regarding Postfix <code>++</code> operator is that:
es: <a href="https://stackoverflow.com/a/17935062/2455888">Un punto importante con</a> respecto al operador Postfix <code>++</code> es que:
ko: Postfix <code>++</code> 연산자와 관련하여 <a href="https://stackoverflow.com/a/17935062/2455888">중요한 점</a> 은 다음과 같습니다.
ru: <a href="https://stackoverflow.com/a/17935062/2455888">Важным моментом в</a> отношении оператора Postfix <code>++</code> является то, что:
zh_cn: 关于Postfix <code>++</code> 运算符<a href="https://stackoverflow.com/a/17935062/2455888">的重要一点</a>是：

source: <em>This</em> answer tries to answer that question: why did your code not give you the answer you expected, and how can you learn to recognize (and avoid) expressions that will not work as expected.
es: <em>Esta</em> respuesta intenta responder a esa pregunta: por qu&eacute; su c&oacute;digo no le dio la respuesta que esperaba y c&oacute;mo puede aprender a reconocer (y evitar) expresiones que no funcionar&aacute;n como se esperaba.
ko: <em>이</em> 답변은 그 질문에 답하려고합니다 : 왜 당신의 코드가 당신에게 기대 한 대답을주지 않았으며, 예상대로 작동하지 않을 표현을 인식하고 피하는 법을 배울 수 있습니다.
ru: <em>Этот</em> ответ пытается ответить на этот вопрос: почему ваш код не дал ожидаемого вами ответа, и как вы можете научиться распознавать (и избегать) выражения, которые не будут работать должным образом.
zh_cn: <em>这个</em>答案试图回答这个问题：为什么您的代码没有给您期望的答案，以及如何学习识别（并避免）不能按预期工作的表达式。

source: <em>Unspecified behavior</em> is defined in the <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">draft c99 standard</a> in section <code>3.4.4</code> as:
es: <em>El comportamiento no especificado</em> se define en el <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">borrador del est&aacute;ndar c99</a> en la secci&oacute;n <code>3.4.4</code> como:
ko: <em>지정되지 않은 동작</em> 은 섹션 <code>3.4.4</code> 의 <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">c99 표준 초안에</a> 다음과 같이 정의됩니다.
ru: <em>Неопределенное поведение</em> определено в <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">проекте стандарта c99</a> в разделе <code>3.4.4</code> как:
zh_cn: <em>未指定的行为</em>在<a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf">c99标准草案的</a> <code>3.4.4</code> 节中定义为：

source: <strong>3.4.4, unspecified behavior</strong>
es: <strong>3.4.4, comportamiento no especificado</strong>
ko: <strong>3.4.4, 불특정 행동</strong>
ru: <strong>3.4.4, неопределенное поведение</strong>
zh_cn: <strong>3.4.4，未指定的行为</strong>

source: <strong>Annex J, unspecified behaviours</strong>
es: <strong>Anexo J, comportamientos no especificados</strong>
ko: <strong>부록 J, 불특정 행동</strong>
ru: <strong>Приложение J, неопределенное поведение</strong>
zh_cn: <strong>附件J，未指明的行为</strong>

source: <strong>Between the previous and next sequence point an object shall have its stored value modified at most once</strong> by the evaluation of an expression. Furthermore, <strong>the prior value shall be read only to determine the value to be stored</strong>.
es: <strong>Entre el punto de secuencia anterior y el siguiente, un objeto tendr&aacute; su valor almacenado modificado como m&aacute;ximo una vez</strong> por la evaluaci&oacute;n de una expresi&oacute;n. Adem&aacute;s, <strong>el valor anterior se leer&aacute; solo para determinar el valor que se almacenar&aacute;</strong> .
ko: <strong>이전과 다음 시퀀스 포인트 사이에서 객체는</strong> 표현식의 평가에 의해 <strong>저장된 값을 최대 한 번 수정해야</strong> 합니다. 또한, <strong>저장 될 값을 결정하기 위해 이전 값은 읽기 전용이어야한다</strong> .
ru: <strong>Между предыдущей и следующей точкой последовательности объект должен иметь свое сохраненное значение, измененное не более одного раза</strong> путем оценки выражения. Кроме того, <strong>предыдущее значение должно быть только для чтения, чтобы определить значение, которое будет сохранено</strong> .
zh_cn: <strong>在上一个序列点与下一个序列点之间，对象的存储值最多只能</strong>通过对表达式的求<strong>值来修改</strong> 。 此外， <strong>先验值应仅被读取以确定要存储的值</strong> 。

source: <strong>If a side effect on a scalar object is unsequenced relative to</strong> either <strong>a different side effect on the same scalar object</strong> or a value computation using the value of the same scalar object, <strong>the behavior is undefined</strong>. [...]
es: <strong>Si un efecto secundario en un objeto escalar no est&aacute; secuenciado en relaci&oacute;n con</strong> <strong>un efecto secundario diferente en el mismo objeto escalar</strong> o un c&aacute;lculo de valor utilizando el valor del mismo objeto escalar, <strong>el comportamiento es indefinido</strong> . [...]
ko: <strong>스칼라 객체의</strong> <strong>부작용이 동일한 스칼라 객체의 다른 부작용</strong> 또는 <strong>동일한 스칼라 객체</strong> 의 값을 사용한 값 계산과 관련하여 순서 <strong>가 지정되지 않은 경우 동작이 정의되지 않습니다</strong> . [...]
ru: <strong>Если побочный эффект на скалярный объект не секвенирован относительно</strong> <strong>другого побочного эффекта на тот же скалярный объект</strong> или вычисления значения с использованием значения того же скалярного объекта, <strong>поведение не определено</strong> . [...]
zh_cn: <strong>如果相对于</strong> <strong>对相同标量对象的不同副作用</strong>或使用<strong>相同标量对象</strong>的值进行的值计算， <strong>相对于标量对象的副作用未排序</strong> ， <strong>则行为未定义</strong> 。 [...]

source: <strong>Sequence Point:</strong>
es: <strong>Punto de secuencia:</strong>
ko: <strong>시퀀스 포인트 :</strong>
ru: <strong>Точка последовательности:</strong>
zh_cn: <strong>顺序点：</strong>

source: <strong>Sequenced:</strong> (5.1.2.3)
es: <strong>Secuenciado:</strong> (5.1.2.3)
ko: <strong>순서 :</strong> (5.1.2.3)
ru: <strong>Последовательность:</strong> (5.1.2.3)
zh_cn: <strong>顺序：</strong> （5.1.2.3）

source: <strong>just because the <code>++</code> comes after the variable does not mean that the increment happens late</strong>. The increment can happen as early as the compiler likes <em>as long as the compiler ensures that the original value is used</em>.
es: <strong>el hecho de que <code>++</code> aparezca despu&eacute;s de la variable no significa que el incremento ocurra tarde</strong> . El incremento puede ocurrir tan pronto como le guste al compilador <em>, siempre y cuando el compilador se asegure de que se use el valor original</em> .
ko: <strong> <code>++</code> 가 변수 뒤에 온다고해서 증분이 늦게 발생하는 것은 아닙니다</strong> . 컴파일러가 <em>원래 값을 사용</em> 하는 한 컴파일러가 원하는 <em>만큼</em> 증가 할 수 있습니다.
ru: <strong>просто потому, что <code>++</code> идет после переменной, не означает, что приращение происходит поздно</strong> . Приращение может произойти, как только компилятор захочет, <em>если компилятор гарантирует, что используется исходное значение</em> .
zh_cn: <strong>仅仅因为 <code>++</code> 紧随变量之后并不意味着增量会延迟</strong> 。 <em>只要编译器确保使用原始值</em> ，增量就可以在编译器喜欢的时候发生。

source: <strong>side effects</strong>, which are modifications of objects.
es: <strong>efectos secundarios</strong> , que son modificaciones de objetos.
ko: <strong>부작용</strong> 은 객체의 수정입니다.
ru: <strong>побочные эффекты</strong> , которые представляют собой модификации объектов.
zh_cn: <strong>副作用</strong> ，是对对象的修改。

source: <strong>value computations</strong>, which work out the result of an expression; and
es: <strong>c&aacute;lculos de valor</strong> , que resuelven el resultado de una expresi&oacute;n; y
ko: 식의 결과를 <strong>산출</strong> 하는 <strong>값 계산</strong> ; 과
ru: <strong>вычисления значений</strong> , которые вырабатывают результат выражения; и
zh_cn: <strong>值计算</strong> ， <strong>计算</strong>出表达式的结果； 和

source: A good explanation about what happens in this kind of computation is provided in the document <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1188.pdf">n1188</a> from <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/">the ISO W14 site</a>.
es: Se proporciona una buena explicaci&oacute;n sobre lo que sucede en este tipo de c&aacute;lculo en el documento <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1188.pdf">n1188</a> del <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/">sitio ISO W14</a> .
ko: 이런 종류의 계산에서 발생하는 것에 대한 좋은 설명은 <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/">ISO W14 사이트</a> 의 문서 <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1188.pdf">n1188에</a> 제공되어 있습니다 .
ru: Хорошее объяснение того, что происходит при такого рода вычислениях, приведено в документе <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1188.pdf">n1188</a> с <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/">сайта ISO W14</a> .
zh_cn: <a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/">ISO W14网站上</a>的文档<a href="http://www.open-std.org/jtc1/sc22/wg14/www/docs/n1188.pdf">n1188</a>提供了有关这种计算会发生什么的很好的解释。

source: After the actions associated with each formatted input/output function conversion specifier (7.21.6, 7.29.2).
es: Después de las acciones asociadas a cada especificador de conversión de la función de inputoutput formateada (7.21.6,7.29.2).
ko: 형식화 된 각 입력 / 출력 기능 변환 지정자와 연관된 조치 후 (7.21.6, 7.29.2)
ru: После действий,связанных с каждым форматированным спецификатором преобразования входных и выходных функций (7.21.6,7.29.2).
zh_cn: 在与每个格式化输入输出函数转换指定器相关联的操作之后(7.21.6、7.29.2)。

source: And the last question is, how can you tell which expressions are well-defined, and which expressions are undefined?
es: Y la última pregunta es,¿cómo se puede saber qué expresiones están bien definidas y cuáles no?
ko: 마지막 질문은 어떤식이 잘 정의되어 있고 어떤식이 정의되어 있지 않은지 어떻게 알 수 있습니까?
ru: И последний вопрос-как определить,какие выражения хорошо определены,а какие нет?
zh_cn: 而最后一个问题是,如何区分哪些表达式是定义好的,哪些表达式是未定义的?

source: Another detail is that the <em>comma</em> involved in the printf() call is a <em>separator</em>, not the <a href="https://en.wikipedia.org/wiki/Comma_operator"><em>comma operator</em></a>.
es: Otro detalle es que la <em>coma</em> involucrada en la llamada printf () es un <em>separador</em> , no el <a href="https://en.wikipedia.org/wiki/Comma_operator"><em>operador de coma</em></a> .
ko: 또 다른 세부 사항은 printf () 호출과 관련된 <a href="https://en.wikipedia.org/wiki/Comma_operator"><em>쉼표가 쉼표 연산자</em></a> 가 아니라 <em>분리</em> <em>자라는 것입니다</em> .
ru: Другая деталь заключается в том, что <em>запятая,</em> используемая в вызове printf (), является <em>разделителем</em> , а не <a href="https://en.wikipedia.org/wiki/Comma_operator"><em>оператором запятой</em></a> .
zh_cn: 另一个细节是，printf（）调用中涉及的<em>逗号</em>是<em>分隔符</em> ，而不是<a href="https://en.wikipedia.org/wiki/Comma_operator"><em>逗号运算符</em></a> 。

source: Another way of answering this, rather than getting bogged down in arcane details of sequence points and undefined behavior, is simply to ask, <em>what are they supposed to mean?</em><em>What was the programmer trying to do?</em>
es: Otra forma de responder a esto, en lugar de atascarse en detalles arcanos de puntos de secuencia y comportamiento indefinido, es simplemente preguntar, <em>&iquest;qu&eacute; se supone que significan?</em> <em>&iquest;Qu&eacute; intentaba hacer el programador?</em>
ko: 시퀀스 포인트와 정의되지 않은 동작의 세부적인 세부 사항에 얽매이지 않고 이것을 대답하는 또 다른 방법은 단순히 묻는 것입니다. <em>무엇을 의미합니까?</em> <em>프로그래머는 무엇을하려고 했습니까?</em>
ru: Другой способ ответить на этот вопрос, а не увязнуть в тайных деталях точек последовательности и неопределенного поведения, - просто спросить, <em>что они должны означать?</em> <em>Что пытался сделать программист?</em>
zh_cn: 回答这个问题的另一种方法，而不是被序列点和未定义行为的奥秘细节所困扰，只是问<em>他们应该意味着什么？</em> <em>程序员想做什么？</em>

source: As I said earlier, the undefined expressions are the ones where there's too much going at once, where you can't be sure what order things happen in, and where the order matters:
es: Como dije antes,las expresiones indefinidas son aquellas en las que hay demasiadas cosas a la vez,en las que no se puede estar seguro del orden en que suceden las cosas,y en las que el orden importa:
ko: 앞에서 말했듯이, 정의되지 않은 표현식은 한 번에 너무 많은 일이 발생하고 순서가 어떻게 진행되는지 확실하지 않은 순서와 순서가 중요한 부분입니다.
ru: Как я уже говорил,неопределенные выражения-это те,в которых за один раз слишком много всего происходит,где нельзя быть уверенным,в каком порядке происходят вещи,и где порядок имеет значение:
zh_cn: 就像我前面说的,未定义的表达式是指一下子发生了太多的事情,你不能确定事情发生的顺序,而且顺序很重要。

source: As an example of #1, in the expression
es: Como ejemplo del número 1,en la expresión
ko: 식에서 # 1의 예로서
ru: В качестве примера #1,в выражении
zh_cn: 作为#1的一个例子,在表达式中

source: As an example of #2, in the expression
es: Como ejemplo del número 2,en la expresión
ko: # 2의 예로서, 표현에서
ru: В качестве примера #2,в выражении
zh_cn: 作为#2的一个例子,在表达式中

source: As far as I know, the standard doesn't explicitly say <em>why</em> the concept of undefined behavior exists. In my mind, it's simply because the language designers wanted there to be some leeway in the semantics, instead of i.e. requiring that all implementations handle integer overflow in the exact same way, which would very likely impose serious performance costs, they just left the behavior undefined so that if you write code that causes integer overflow, anything can happen.
es: Hasta donde yo s&eacute;, el est&aacute;ndar no dice expl&iacute;citamente <em>por qu&eacute;</em> existe el concepto de comportamiento indefinido. En mi opini&oacute;n, es simplemente porque los dise&ntilde;adores de lenguaje quer&iacute;an que hubiera un margen de maniobra en la sem&aacute;ntica, en lugar de exigir que todas las implementaciones manejen el desbordamiento de enteros exactamente de la misma manera, lo que probablemente impondr&iacute;a serios costos de rendimiento, simplemente dejaron el comportamiento indefinido para que si escribe c&oacute;digo que causa un desbordamiento de enteros, cualquier cosa puede suceder.
ko: 내가 아는 한, 표준은 <em>왜</em> 정의되지 않은 행동의 개념이 존재 <em>하는지</em> 명시하지 않습니다. 제 생각에는 언어 디자이너가 의미론에 약간의 여유가 있기를 원했기 때문입니다. 즉, 모든 구현이 정확히 동일한 방식으로 정수 오버플로를 처리하도록 요구하기 때문에 심각한 성능 비용이 발생할 가능성이 매우 높습니다. 정수 오버플로를 일으키는 코드를 작성하면 어떤 일이 발생할 수 있습니다.
ru: Насколько я знаю, в стандарте прямо не говорится, <em>почему существует</em> понятие неопределенного поведения. На мой взгляд, это просто потому, что разработчики языка хотели, чтобы в семантике была некоторая свобода, вместо того, чтобы требовать, чтобы все реализации обрабатывали целочисленное переполнение точно таким же образом, что, скорее всего, повлекло бы за собой серьезные потери производительности, они просто оставили поведение undefined, так что если вы напишите код, который вызывает целочисленное переполнение, все может произойти.
zh_cn: 据我所知，该标准并未明确说明<em>为什么</em>存在未定义行为的概念。 在我看来，这仅仅是因为语言设计师希望语义上有一些余地，而不是要求所有实现以完全相同的方式处理整数溢出，这很可能会带来严重的性能损失，他们只是放弃了行为未定义，因此如果您编写导致整数溢出的代码，则可能会发生任何事情。

source: As you've heard by now, all of these expressions are <em>undefined</em>, which means that the C language makes no guarantee about what they'll do. This is a strange and surprising result, because you probably thought that any program you could write, as long as it compiled and ran, would generate a unique, well-defined output. But in the case of undefined behavior, that's not so.
es: Como ya ha escuchado, todas estas expresiones <em>no</em> est&aacute;n <em>definidas</em> , lo que significa que el lenguaje C no garantiza lo que har&aacute;n. Este es un resultado extra&ntilde;o y sorprendente, porque probablemente pens&oacute; que cualquier programa que pudiera escribir, siempre y cuando se compilara y ejecutara, generar&iacute;a un resultado &uacute;nico y bien definido. Pero en el caso de un comportamiento indefinido, eso no es as&iacute;.
ko: 지금까지 들었 듯이,이 모든 표현들은 <em>정의</em> 되어 <em>있지 않습니다</em> . 즉, C 언어는 그들이 할 일을 보증하지 않습니다. 컴파일하고 실행하는 한 작성할 수있는 모든 프로그램이 고유하고 잘 정의 된 출력을 생성 할 것이라고 생각했기 때문에 이것은 이상하고 놀라운 결과입니다. 그러나 정의되지 않은 동작의 경우에는 그렇지 않습니다.
ru: Как вы уже слышали, все эти выражения не <em>определены</em> , что означает, что язык C не дает никаких гарантий относительно того, что они будут делать. Это странный и удивительный результат, потому что вы, вероятно, думали, что любая программа, которую вы можете написать, пока она компилируется и запускается, будет генерировать уникальный, четко определенный вывод. Но в случае неопределенного поведения это не так.
zh_cn: 正如您现在所听到的，所有这些表达式都是<em>undefined</em> ，这意味着C语言不能保证它们会做什么。 这是一个奇怪且令人惊讶的结果，因为您可能认为只要编写并运行该程序，您便可以生成任何唯一的，定义明确的输出。 但是对于未定义的行为，事实并非如此。

source: Between the evaluation of a full expression and the next full expression to be evaluated. The following are full expressions: an initializer that is not part of a compound literal (6.7.9); the expression in an expression statement (6.8.3); the controlling expression of a selection statement (if or switch) (6.8.4); the controlling expression of a while or do statement (6.8.5); each of the (optional) expressions of a for statement (6.8.5.3); the (optional) expression in a return statement (6.8.6.4).
es: Entre la evaluación de una expresión completa y la siguiente expresión completa a evaluar.Las siguientes son expresiones completas:un inicializador que no forma parte de un literal compuesto (6.7.9);la expresión en una declaración de expresión (6.8.3);la expresión controladora de una declaración de selección (si o cambio)(6.8.4);la expresión controladora de una declaración "while or do" (6.8.5);cada una de las expresiones (facultativas)de una declaración "for" (6.8.5.3);la expresión (facultativa)de una declaración "return" (6.8.6.4).
ko: 전체 표현식의 평가와 평가할 다음 전체 표현식 사이. 다음은 전체 표현식입니다. 복합 리터럴 (6.7.9)의 일부가 아닌 이니셜 라이저; 표현 문의 표현 (6.8.3); 선택문 (if 또는 switch)의 제어식 (6.8.4); while 또는 do 문의 제어 표현 (6.8.5); for 문 (6.8.5.3)의 각각의 (선택적) 표현; 리턴 명령문의 (선택 사항) 표현식 (6.8.6.4)
ru: Между оценкой полного выражения и следующей оценкой полного выражения.Полными являются следующие выражения:инициализатор,не являющийся частью составного литерала (6.7.9);выражение в операторе выражений (6.8.3);контрольное выражение оператора выбора (если или переключаться)(6.8.4);контрольное выражение оператора while или do (6.8.5);каждое из (необязательных)выражений оператора for (6.8.5.3);(необязательное)выражение в возвращаемом операторе (6.8.6.4).
zh_cn: 在评价一个完整表达式和下一个要评价的完整表达式之间。以下是完整表达式:不属于复合字面意义的初始化器(6.7.9);表达式语句中的表达式(6.8.3);选择语句(if或switch)的控制表达式(6.8.4);while或do语句的控制表达式(6.8.5);for语句的每个(可选)表达式(6.8.5.3);返回语句中的(可选)表达式(6.8.6.4)。

source: Between the evaluations of the first and second operands of the following operators: logical AND &amp;&amp; (6.5.13); logical OR || (6.5.14); comma , (6.5.17).
es: Entre las evaluaciones del primer y segundo operandos de los siguientes operadores: l&oacute;gico AND &amp;&amp; (6.5.13); OR l&oacute;gico || (6.5.14); coma, (6.5.17).
ko: 다음 연산자의 첫 번째 피연산자와 두 번째 피연산자의 평가 사이 : 논리 AND &amp;&amp; (6.5.13); 논리 OR || (6.5.14); 쉼표 (6.5.17)
ru: Между вычислениями первого и второго операндов используются следующие операторы: логическое И &amp; &amp; (6.5.13); логическое ИЛИ || (6.5.14); запятая, (6.5.17).
zh_cn: 在以下运算符的第一和第二操作数的求值之间：逻辑AND &amp;&amp;（6.5.13）; 逻辑或|| （6.5.14）； 逗号（6.5.17）。

source: Between the evaluations of the first operand of the conditional ? : operator and whichever of the second and third operands is evaluated (6.5.15).
es: Entre las evaluaciones del primer operando del operador condicional ?:y el que se evalúe del segundo y tercer operando (6.5.15).
ko: 조건부?의 첫 번째 피연산자 평가 사이 : 연산자와 두 번째 및 세 번째 피연산자 중 어느 것이 든 평가됩니다 (6.5.15).
ru: Между оценками первого операнда условного оператора ?:и тем,какой из операндов второго и третьего вычисляется (6.5.15).
zh_cn: 在条件运算符的第一个运算符的第一个执行项和第二个和第三个执行项中的任何一个被评价(6.5.15)。

source: Between the evaluations of the function designator and actual arguments in a function call and the actual call. (6.5.2.2).
es: Entre las evaluaciones del designador de la función y los argumentos reales en una llamada de la función y la llamada real.(6.5.2.2).
ko: 함수 지정자의 평가와 함수 호출의 실제 인수 및 실제 호출 사이. (6.5.2.2).
ru: Между вычислениями обозначения функции и фактическими аргументами в вызове функции и фактическим вызовом.(6.5.2.2).
zh_cn: 在函数调用中的函数代号和实际参数的评价与实际调用之间。(6.5.2.2).

source: Between the previous and next sequence point an object shall have its stored value modified at most once by the evaluation of an expression. Furthermore, the prior value shall be read only to determine the value to be stored.
es: Entre el punto de secuencia anterior y el siguiente un objeto tendrá su valor almacenado modificado como máximo una vez por la evaluación de una expresión.Además,el valor anterior se leerá sólo para determinar el valor que se almacenará.
ko: 이전과 다음 시퀀스 포인트 사이에서 객체는 표현식의 평가에 의해 저장된 값을 최대 한 번 수정해야합니다. 또한, 저장 될 값을 결정하기 위해 이전 값은 읽기 전용이어야한다.
ru: Между предыдущей и следующей точкой следования объект должен иметь сохраненное значение,измененное не более одного раза путем оценки выражения.Кроме того,предыдущее значение должно быть прочитано только для определения хранимого значения.
zh_cn: 在上一个序列点和下一个序列点之间,一个对象的存储值最多只能被一个表达式的评价修改一次。此外,前一个值只能被读取,以确定要存储的值。

source: Between the previous and next sequence point an object shall have its stored value modified at most once by the evaluation of an expression. [72] Furthermore, the prior value shall be read only to determine the value to be stored [73]
es: Entre el punto de secuencia anterior y el siguiente un objeto tendrá su valor almacenado modificado como máximo una vez por la evaluación de una expresión.72]Además,el valor anterior se leerá sólo para determinar el valor que se almacenará [73].
ko: 이전과 다음 시퀀스 포인트 사이에서 객체는 표현식의 평가에 의해 저장된 값을 최대 한 번 수정해야합니다. [72] 또한, 저장 될 값을 결정하기 위해 사전 값이 판독 될 것 [73]
ru: Между предыдущей и следующей точкой следования объект должен иметь сохраненное значение,измененное не более одного раза путем оценки выражения.Кроме того,предыдущее значение должно считываться только для определения хранимого значения [73].
zh_cn: 在上一个序列点和下一个序列点之间,一个对象的存储值最多只能被一个表达式的评价修改一次。[72]此外,对前一个值的读取只能是为了确定要存储的值[73]。

source: But, to your surprise, this program did <em>not</em> help you understand -- it printed some strange, unexpected, inexplicable output, suggesting that maybe <code>++</code> does something completely different, not at all what you thought it did.
es: Pero, para su sorpresa, este programa no <em>lo</em> ayud&oacute; a comprender: imprimi&oacute; un resultado extra&ntilde;o, inesperado e inexplicable, lo que sugiere que quiz&aacute;s <code>++</code> hace algo completamente diferente, en absoluto lo que pensaba que hizo.
ko: 그러나 놀랍게도이 프로그램은 이해하기 <em>어렵</em> 습니다. 이상하고, 예상치 못한, 설명 할 수없는 결과물이 인쇄되어, <code>++</code> 가 생각했던 것과 전혀 다른 것이 아니라 ++ 가 완전히 다른 것을 할 수 있음을 시사합니다.
ru: Но, к вашему удивлению, эта программа <em>не</em> помогла вам понять - она ​​напечатала какой-то странный, неожиданный, необъяснимый вывод, предполагая, что, возможно, <code>++</code> делает что-то совершенно другое, совсем не то, что вы думали, что оно сделало.
zh_cn: 但是，令您惊讶的是，该程序并<em>没有</em>帮助您理解-它打印了一些奇怪的，意想不到的，无法解释的输出，表明 <code>++</code> 也许所做的事情完全不同，而根本没有您想像的那样。

source: C has the concept of undefined behavior, i.e. some language constructs are syntactically valid but you can't predict the behavior when the code is run.
es: C tiene el concepto de comportamiento indefinido,es decir,algunas construcciones del lenguaje son sintácticamente válidas pero no se puede predecir el comportamiento cuando se ejecuta el código.
ko: C에는 정의되지 않은 동작의 개념이 있습니다. 즉 일부 언어 구문은 구문 상 유효하지만 코드가 실행될 때 동작을 예측할 수 없습니다.
ru: В языке C есть понятие неопределённого поведения,т.е.некоторые конструкции языка являются синтаксически действительными,но вы не можете предсказать поведение при выполнении кода.
zh_cn: C语言有未定义行为的概念,即有些语言构造的语法上是有效的,但你无法预测代码运行时的行为。
