Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Another general case where one might receive this exception involves mocking classes during unit testing. Regardless of the mocking framework being used, you must ensure that all appropriate levels of the class hierarchy are properly mocked. In particular, all properties of <code>HttpContext</code> which are referenced by the code under test must be mocked.
es: Otro caso general en el que uno podr&iacute;a recibir esta excepci&oacute;n implica burlarse de clases durante las pruebas unitarias. Independientemente del marco de simulaci&oacute;n que se utilice, debe asegurarse de que todos los niveles apropiados de la jerarqu&iacute;a de clases se burlen correctamente. En particular, se deben burlar todas las propiedades de <code>HttpContext</code> a las que hace referencia el c&oacute;digo bajo prueba.
ja: この例外が発生する可能性があるもう1つの一般的なケースは、ユニットテスト中にクラスをモックすることです。 使用されているモックフレームワークに関係なく、クラス階層のすべての適切なレベルが適切にモックされていることを確認する必要があります。 特に、テスト中のコードによって参照される <code>HttpContext</code> のすべてのプロパティは、モックする必要があります。
ko: 이 예외가 발생할 수있는 또 다른 일반적인 경우는 단위 테스트 중에 클래스를 조롱하는 것입니다. 사용되는 조롱 프레임 워크에 관계없이 모든 적절한 수준의 클래스 계층 구조가 제대로 조롱되었는지 확인해야합니다. 특히 테스트중인 코드에서 참조하는 <code>HttpContext</code> 의 모든 속성을 조롱해야합니다.
ru: Другой общий случай, когда можно получить это исключение, связан с классами насмешек во время модульного тестирования. Независимо от используемой среды моделирования, вы должны убедиться, что все соответствующие уровни иерархии классов должным образом смоделированы. В частности, все свойства <code>HttpContext</code> ,на которые ссылается тестируемый код, должны быть проверены.
zh_cn: 可能会收到此异常的另一种常见情况涉及在单元测试期间模拟类。 无论使用哪种模拟框架，都必须确保正确模拟了类层次结构的所有适当级别。 特别是，必须模拟被测试代码引用的 <code>HttpContext</code> 的所有属性。

source: Another scenario is when you cast a null object into a <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">value type</a>. For example, the code below:
es: Otro escenario es cuando convierte un objeto nulo en un <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">tipo de valor</a> . Por ejemplo, el siguiente c&oacute;digo:
ja: 別のシナリオは、nullオブジェクトを<a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">値型に</a>キャストする場合です。 たとえば、次のコード：
ko: 또 다른 시나리오는 널 오브젝트를 <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">값 유형</a> 으로 캐스트 할 때입니다. 예를 들어 아래 코드는 다음과 같습니다.
ru: Другой сценарий - когда вы приводите нулевой объект в <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">тип значения</a> . Например, код ниже:
zh_cn: 另一种情况是将空对象转换为<a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">值类型时</a> 。 例如，下面的代码：

source: Array Elements
es: Elementos de la matriz
ja: 配列要素
ko: 배열 요소
ru: Элементы массива
zh_cn: 阵列元素

source: Arrays in Visual Basic
es: Los arreglos en Visual Basic
ja: Visual Basicでの配列
ko: Visual Basic의 배열
ru: Массивы в Visual Basic
zh_cn: Visual Basic中的数组

source: Arrays must also be instantiated:
es: Los arreglos también deben ser instanciados:
ja: 配列もインスタンス化する必要があります。
ko: 배열도 인스턴스화해야합니다.
ru: Массивы также должны быть инстанциированы:
zh_cn: 数组也必须被实例化。

source: As before, the <code>ds</code> Dataset object was declared, but an instance was never created. The <code>DataAdapter</code> will fill an existing <code>DataSet</code>, not create one. In this case, since <code>ds</code> is a local variable, <em>the IDE warns you</em> that this might happen:
es: Como antes, se declar&oacute; el objeto <code>ds</code> Dataset, pero nunca se cre&oacute; una instancia. El <code>DataAdapter</code> llenar&aacute; un <code>DataSet</code> existente, no crear&aacute; uno. En este caso, dado que <code>ds</code> es una variable local, <em>el IDE le advierte</em> que esto podr&iacute;a suceder:
ja: 以前と同様に、 <code>ds</code> Datasetオブジェクトが宣言されましたが、インスタンスは作成されませんでした。 <code>DataAdapter</code> は、既存の <code>DataSet</code> を作成しますが、作成しません。 この場合、 <code>ds</code> はローカル変数である<em>ため、IDE</em>はこれが発生する可能性がある<em>こと</em>を<em>警告します</em> 。
ko: 이전과 마찬가지로 <code>ds</code> Dataset 객체가 선언되었지만 인스턴스가 생성되지 않았습니다. <code>DataAdapter</code> 는 기존 <code>DataSet</code> 을 채우지 않고 채 웁니다. 이 경우 <code>ds</code> 는 로컬 변수이므로 <em>IDE는</em> 이러한 상황이 발생할 <em>수</em> 있음을 <em>경고합니다</em> .
ru: Как и прежде, объект <code>ds</code> Dataset был объявлен, но экземпляр не был создан. <code>DataAdapter</code> заполнит существующий <code>DataSet</code> , а не создаст его. В этом случае, поскольку <code>ds</code> является локальной переменной, <em>IDE предупреждает вас о</em> том, что это может произойти:
zh_cn: 和以前一样，声明了 <code>ds</code> Dataset对象，但是从未创建实例。 <code>DataAdapter</code> 将填充现有的 <code>DataSet</code> ，而不创建一个。 在这种情况下，由于 <code>ds</code> 是局部变量， <em>因此IDE警告您</em>可能会发生这种情况：

source: As before, this is incorrect:
es: Como antes,esto es incorrecto:
ja: 今まで通り、これは正しくありません。
ko: 이전과 같이 이것은 올바르지 않습니다.
ru: Как и прежде,это неправильно:
zh_cn: 如前所述,这是不正确的。

source: As before, you can test for Nothing, then for a specific value:
es: Como antes,puedes hacer la prueba de la Nada,y luego la de un valor específico:
ja: 前と同じように、Nothing をテストし、次に特定の値をテストすることができます。
ko: 이전과 같이 Nothing을 테스트 한 다음 특정 값을 테스트 할 수 있습니다.
ru: Как и раньше,вы можете протестировать на "Ничего",а затем на конкретную величину:
zh_cn: 和之前一样,你可以测试Nothing,然后再测试一个特定的值。

source: As seen in the above code, the statement <strong>Student s</strong> - only declares the variable of type Student, note that the Student class is not instantiated at this point. Hence, when the statement <strong>s.GetFullName()</strong> gets executed, it will throw the NullReferenceException.
es: Como se ve en el c&oacute;digo anterior, la declaraci&oacute;n <strong>Student s</strong> - solo declara la variable de tipo Student, tenga en cuenta que la clase Student no se instancia en este punto. Por lo tanto, cuando se ejecuta la instrucci&oacute;n <strong>s.GetFullName ()</strong> , arrojar&aacute; la NullReferenceException.
ja: 上記のコードに見られるように、ステートメント<strong>Student s</strong> - <strong>Student</strong>型の変数のみを宣言します。この時点ではStudentクラスはインスタンス化されていないことに注意してください。 したがって、ステートメント<strong>s.GetFullName（）</strong>が実行されると、NullReferenceExceptionがスローされます。
ko: 위 코드에서 볼 수 있듯이 <strong>Student s</strong> 문은 <strong>Student</strong> 유형의 변수 만 선언합니다. 이때 Student 클래스는 인스턴스화되지 않습니다. 따라서 <strong>s.GetFullName ()</strong> 문이 실행될 때 NullReferenceException이 발생합니다.
ru: Как видно из приведенного выше кода, оператор <strong>Student s</strong> - только объявляет переменную типа Student, обратите внимание, что на этом этапе класс Student не создается. Следовательно, когда выполняется оператор <strong>s.GetFullName ()</strong> , он генерирует исключение NullReferenceException.
zh_cn: 如上面的代码所示，语句<strong>Student s-</strong>仅声明了Student类型的变量，请注意，此时尚未实例化Student类。 因此，当执行<strong>s.GetFullName（）</strong>语句时，它将抛出NullReferenceException。

source: As you can see above as with nullable you would access the underlying value through the <code>Value</code> property. Alternatively, you can use an explicit or implicit cast, you can see an example with the return value below:
es: Como puede ver arriba, como con nullable, acceder&iacute;a al valor subyacente a trav&eacute;s de la propiedad <code>Value</code> . Alternativamente, puede usar una conversi&oacute;n expl&iacute;cita o impl&iacute;cita, puede ver un ejemplo con el valor de retorno a continuaci&oacute;n:
ja: 上記のようにnullableと同様に、 <code>Value</code> プロパティを介して基になる値にアクセスします。 または、明示的または暗黙的なキャストを使用できます。以下の戻り値の例を見ることができます。
ko: 위에서 null을 허용하는 것처럼 볼 수 있듯이 <code>Value</code> 속성을 통해 기본 값에 액세스합니다. 또는 명시 적 또는 암시 적 캐스트를 사용할 수 있습니다. 아래 반환 값이있는 예제를 볼 수 있습니다.
ru: Как вы можете видеть выше, как и для nullable, вы получите доступ к базовому значению через свойство <code>Value</code> . Кроме того, вы можете использовать явное или неявное приведение, вы можете увидеть пример с возвращаемым значением ниже:
zh_cn: 正如您在上面看到的具有nullable的那样，您将通过 <code>Value</code> 属性访问基础值。 另外，您可以使用显式或隐式强制转换，可以在下面看到带有返回值的示例：

source: Assume that you have a class named Student.
es: Asume que tienes una clase llamada Estudiante.
ja: Studentという名前のクラスがあるとします。
ko: Student라는 클래스가 있다고 가정하십시오.
ru: Предположим,у вас есть класс по имени Студент.
zh_cn: 假设你有一个班级叫学生。

source: Basic Meaning
es: Significado básico
ja: 基本的な意味
ko: 기본 의미
ru: Основной смысл
zh_cn: 基本含义

source: Be aware that regardless of the scenario, the cause is always the same in .NET:
es: Tenga en cuenta que independientemente del escenario,la causa es siempre la misma en .NET:
ja: .NETではシナリオに関係なく、原因は常に同じであることに注意してください。
ko: 시나리오에 관계없이 .NET에서는 원인이 항상 동일합니다.
ru: Имейте в виду,что независимо от сценария,причина всегда одна и та же в .NET:
zh_cn: 要注意的是,无论在.NET中,无论什么情况下,原因都是一样的。

source: Both a null pointer and a null reference in <code>C#</code> are internally represented as the number zero, and so any attempt to dereference it into its corresponding memory storage causes the operating system to produce an error. The .NET runtime then detects this error and turns it into the null dereference exception.
es: Tanto un puntero nulo como una referencia nula en <code>C#</code> se representan internamente como el n&uacute;mero cero, por lo que cualquier intento de desreferenciarlo en su almacenamiento de memoria correspondiente hace que el sistema operativo produzca un error. El tiempo de ejecuci&oacute;n .NET luego detecta este error y lo convierte en la excepci&oacute;n de anulaci&oacute;n de referencia nula.
ja: <code>C#</code> の nullポインターとnull参照はどちらも内部的には数値0として表されるため、対応するメモリストレージに逆参照しようとすると、オペレーティングシステムでエラーが発生します。 次に.NETランタイムはこのエラーを検出し、それをnull逆参照例外に変換します。
ko: <code>C#</code> 에서 Null 포인터와 Null 참조는 모두 내부적으로 숫자 0으로 표시되므로이를 해당 메모리 저장소로 역 참조하려고하면 운영 체제에서 오류가 발생합니다. 그런 다음 .NET 런타임은이 오류를 감지하여 null 역 참조 예외로 바꿉니다.
ru: И нулевой указатель, и нулевая ссылка в <code>C#</code> внутренне представлены как нулевое число, и поэтому любая попытка разыменовать его в соответствующее хранилище памяти приводит к ошибке операционной системы. Затем среда выполнения .NET обнаруживает эту ошибку и превращает ее в исключение нулевой разыменования.
zh_cn: <code>C#</code> 中的空指针和空引用在内部都表示为数字零，因此任何尝试将其取消引用到其相应的内存中的操作都会导致操作系统产生错误。 然后，.NET运行时将检测到此错误，并将其转换为null取消引用异常。

source: Bottom Line
es: En resumen...
ja: ボトムライン
ko: 결론
ru: Итог
zh_cn: 底线

source: But I was able to run the application with no problems with this "error". I was able to get rid of the error by changing the structure of the <code>foreach</code> loop to look like this:
es: Pero pude ejecutar la aplicaci&oacute;n sin problemas con este "error". Pude deshacerme del error cambiando la estructura del bucle <code>foreach</code> para que se vea as&iacute;:
ja: しかし、私はこの「エラー」で問題なくアプリケーションを実行することができました。 <code>foreach</code> ループの構造を次のように変更することで、エラーを取り除くことができました。
ko: 그러나이 "오류"에 문제없이 응용 프로그램을 실행할 수있었습니다. <code>foreach</code> 루프의 구조를 다음과 같이 변경하여 오류를 제거 할 수있었습니다.
ru: Но я смог запустить приложение без проблем с этой &laquo;ошибкой&raquo;. Мне удалось избавиться от ошибки, изменив структуру цикла <code>foreach</code> так:
zh_cn: 但是我能够运行该应用程序而不会出现&ldquo;错误&rdquo;问题。 通过将 <code>foreach</code> 循环的结构更改为如下所示，我可以消除该错误：

source: But if you set "property X must never have a null value" as method precondition, then you can prevent the scenario described before:
es: Pero si se establece "la propiedad X nunca debe tener un valor nulo" como condición previa del método,entonces se puede evitar el escenario descrito anteriormente:
ja: しかし、メソッドの前提条件として「プロパティXは絶対にNULL値を持ってはいけない」と設定しておけば、先ほどのようなシナリオを防ぐことができます。
ko: 그러나 "속성 X에 null 값이 없어야 함"을 메소드 전제 조건으로 설정하면 앞에서 설명한 시나리오를 막을 수 있습니다.
ru: Но если в качестве предусловия метода задать "свойство X никогда не должно иметь нулевого значения",то можно предотвратить описанный ранее сценарий:
zh_cn: 但如果设置 "属性X绝对不能有一个空值 "作为方法前提条件,那么就可以防止前面描述的情况。

source: By doing that and making PostSharp part of your build process <code>obj</code> will be checked for null at runtime. See: <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">PostSharp null check</a>
es: Al hacer eso y hacer que PostSharp sea parte de su proceso de compilaci&oacute;n, <code>obj</code> se comprobar&aacute; como nulo en tiempo de ejecuci&oacute;n. Ver: <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">verificaci&oacute;n nula PostSharp</a>
ja: これを行い、PostSharpをビルドプロセスの一部にすることにより、 <code>obj</code> は実行時にnullかどうかがチェックされます。 参照： <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">PostSharp nullチェック</a>
ko: 그렇게하고 빌드 프로세스의 PostSharp를 만들면 런타임에 <code>obj</code> 가 null인지 확인합니다. 참조 : <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">PostSharp null 검사</a>
ru: Сделав это и сделав PostSharp частью вашего процесса сборки, <code>obj</code> будет проверен на null во время выполнения. Смотрите: <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">PostSharp нулевая проверка</a>
zh_cn: 通过这样做并将PostSharp纳入构建过程的一部分，将在运行时检查 <code>obj</code> 是否为null。 请参阅： <a href="http://www.postsharp.net/blog/post/Validating-parameters-field-and-properties-in-PostSharp-3">PostSharp空检查</a>

source: By finding by name I mean some framework allow you to FIndObjects using strings and the code might look like this: <strong>FindObject("ObjectName");</strong>
es: Al buscar por nombre me refiero a que alg&uacute;n marco le permite FIndObjects usando cadenas y el c&oacute;digo podr&iacute;a verse as&iacute;: <strong>FindObject ("ObjectName");</strong>
ja: 名前で検索するということは、一部のフレームワークでは文字列を使用してFIndObjectsを実行できることを意味し、コードは次のようになります<strong>。FindObject（ "ObjectName"）;</strong>
ko: 이름으로 찾음에 따라 일부 프레임 워크에서 문자열을 사용하여 FIndObject를 찾을 수 있으며 코드는 다음과 같습니다. <strong>FindObject ( "ObjectName");</strong>
ru: Под поиском по имени я подразумеваю, что некоторые фреймворки позволяют вам FIndObjects использовать строки, и код может выглядеть так: <strong>FindObject ("ObjectName");</strong>
zh_cn: 通过名称查找，我的意思是某些框架允许您使用字符串来查找对象，并且代码可能如下所示： <strong>FindObject（&ldquo; ObjectName&rdquo;）;</strong>

source: By following the program flow this way, you can find the location where the instance should not be null, and why it isn't properly set.
es: Siguiendo el flujo del programa de esta manera,puedes encontrar la ubicación donde la instancia no debería ser nula,y por qué no está correctamente establecida.
ja: このようにプログラムの流れを追うことで、インスタンスがNULLになってはいけない場所や、なぜ適切に設定されていないのかを見つけることができます。
ko: 이 방법으로 프로그램 흐름을 따르면 인스턴스가 null이 아니어야하는 위치와 제대로 설정되지 않은 이유를 찾을 수 있습니다.
ru: Следуя потоку программы таким образом,вы можете найти место,где экземпляр не должен быть нулевым,и почему он не установлен должным образом.
zh_cn: 按照这样的程序流程,你可以找到实例不应该为空的位置,以及为什么没有正确设置的原因。

source: By writing a null check like this you prevent the null dereference, but you move the null argument exception to the point of the <em>iteration</em>, not to the point of the <em>call</em>, and that is <em>very confusing to debug</em>.
es: Al escribir un cheque nulo como este, evita la desreferencia nula, pero mueve la excepci&oacute;n de argumento nulo al punto de la <em>iteraci&oacute;n</em> , no al punto de la <em>llamada</em> , y eso es <em>muy confuso para depurar</em> .
ja: このようにnullチェックを記述することにより、null逆参照を防ぐことができますが、null引数の例外を<em>呼び出し</em>のポイントではなく<em>反復</em>のポイントに移動するため、 <em>デバッグ</em>が<em>非常に混乱し</em>ます。
ko: 이와 같이 null 검사를 작성하면 null 역 참조를 방지 할 수 있지만 null 인수 예외를 <em>호출</em> 지점이 아닌 <em>반복</em> 지점으로 이동하면 <em>디버그하기</em> 가 <em>매우 복잡합니다</em> .
ru: Путем написания нулевой проверки, подобной этой, вы предотвращаете разыменование нулевого значения, но перемещаете исключение нулевого аргумента в точку <em>итерации</em> , а не в точку <em>вызова</em> , и это <em>очень сбивает с толку при отладке</em> .
zh_cn: 通过编写这样的null检查，可以防止null取消引用，但是可以将null参数异常移到<em>迭代</em>点，而不是<em>调用</em>点，这会使<em>调试非常混乱</em> 。

source: C# 6.0 introduced the "null-conditional operator" that helps with this a little. With this feature, you can reference nested objects and if any one of them is <code>null</code> the whole expression returns <code>null</code>.
es: C # 6.0 introdujo el "operador nulo-condicional" que ayuda un poco con esto. Con esta caracter&iacute;stica, puede hacer referencia a objetos anidados y si alguno de ellos es <code>null</code> la expresi&oacute;n completa devuelve <code>null</code> .
ja: C＃6.0では、これに少し役立つ「null条件演算子」が導入されました。 この機能を使用すると、ネストされたオブジェクトを参照でき、それらのいずれかが <code>null</code> の場合 、式全体が <code>null</code> を返します 。
ko: C # 6.0에서는이를 지원하는 "무조건 연산자"가 도입되었습니다. 이 기능을 사용하면 중첩 된 객체를 참조 할 수 있으며 그 중 하나가 <code>null</code> 이면 전체 표현식이 <code>null</code> 을 반환합니다.
ru: В C # 6.0 введен &laquo;нулевой оператор&raquo;, который немного помогает в этом. С помощью этой функции вы можете ссылаться на вложенные объекты, и если какой-либо из них является <code>null</code> все выражение возвращает <code>null</code> .
zh_cn: C＃6.0引入了&ldquo;空条件运算符&rdquo;，它对此有所帮助。 使用此功能，您可以引用嵌套对象，如果其中任何一个为 <code>null</code> ,则整个表达式将返回 <code>null</code> 。

source: C# has a nice shorthand for <code>Nullable&lt;T&gt;</code>, you can make something nullable by putting a question mark after the type like so <code>int?</code>.
es: C # tiene una buena abreviatura para <code>Nullable&lt;T&gt;</code> , puede hacer que algo sea anulable poniendo un signo de interrogaci&oacute;n despu&eacute;s del tipo como <code>int?</code> .
ja: C＃には <code>Nullable&lt;T&gt;</code> 省略形があり <code>int?</code> 型の後ろに疑問符を置くことで、何かをnull可能にできますか？ 。
ko: C #에는 <code>Nullable&lt;T&gt;</code> 약어가 있습니다. <code>int?</code> 와 같은 형식 뒤에 물음표를 넣어서 nullable을 만들 수 있습니까? .
ru: В C # есть хорошее сокращение для <code>Nullable&lt;T&gt;</code> , вы можете сделать что-нибудь обнуляемое, поставив вопросительный знак после типа вроде <code>int?</code> ,
zh_cn: C＃有一个很好的 <code>Nullable&lt;T&gt;</code> 速记，您可以通过在问号后面加一个问号使 <code>int?</code> 变成可空值？ 。

source: C#8.0 introduces <strong>nullable reference types</strong> and <strong>non-nullable reference types</strong>. So only nullable reference types must be checked to avoid a <strong>NullReferenceException</strong>.
es: C # 8.0 introduce <strong>tipos de referencia anulables</strong> y <strong>tipos de referencia</strong> <strong>no anulables</strong> . Por lo tanto, solo se deben verificar los tipos de referencia anulables para evitar una <strong>excepci&oacute;n NullReferenceException</strong> .
ja: C＃8.0では、 <strong>null許容の参照型</strong>と<strong>null不可の</strong> <strong>参照型が</strong>導入されてい<strong>ます</strong> 。 したがって、 <strong>NullReferenceException</strong>を回避するには、null許容の参照型のみをチェックする必要があります。
ko: C # 8.0은 <strong>널 입력 가능 참조 유형</strong> 과 <strong>널 입력 불가능</strong> <strong>참조 유형을</strong> 도입 <strong>합니다</strong> . 따라서 <strong>NullReferenceException</strong> 을 피하려면 널 입력 가능 참조 유형 만 검사해야합니다.
ru: В C # 8.0 вводятся <strong>пустые ссылочные типы</strong> и <strong>ненулевые ссылочные типы</strong> . Поэтому необходимо проверять только обнуляемые ссылочные типы, чтобы избежать исключения <strong>NullReferenceException</strong> .
zh_cn: C＃8.0引入了<strong>可为空的引用类型</strong>和<strong>不可为空的引用类型</strong> 。 因此，仅必须检查可为空的引用类型，以避免<strong>NullReferenceException</strong> 。

source: Cast with <code>as</code>
es: Fundido con <code>as</code>
ja: <code>as</code> でキャスト
ko: 로 캐스트
ru: В ролях <code>as</code>
zh_cn: 投放 <code>as</code>

source: Changing the order of the declarations in the <code>XAML</code> (i.e., listing <code>label1</code> before <code>comboBox1</code>, ignoring issues of design philosophy, would at least resolve the <code>NullReferenceException</code> here.
es: Cambiar el orden de las declaraciones en el <code>XAML</code> (es decir, enumerar <code>label1</code> antes de <code>comboBox1</code> , ignorar los problemas de la filosof&iacute;a de dise&ntilde;o, al menos resolver&iacute;a la <code>NullReferenceException</code> aqu&iacute;.
ja: <code>XAML</code> で宣言の順序を変更すると（つまり、デザインフィロソフィーの問題を無視して、 <code>label1</code> 前にlabel1をリストすると）、少なくともここでは <code>NullReferenceException</code> が解決されます。
ko: <code>XAML</code> 에서 선언의 순서를 변경하면 (즉, 디자인 철학의 문제를 무시하고 <code>comboBox1</code> 앞에 <code>label1</code> 을 나열하는 경우) 여기서 적어도 <code>NullReferenceException</code> 이 해결됩니다.
ru: Изменение порядка объявлений в <code>XAML</code> (т. <code>label1</code> Перечисление label1 перед <code>comboBox1</code> , игнорируя проблемы философии проектирования, по крайней мере разрешило <code>NullReferenceException</code> здесь исключение NullReferenceException .
zh_cn: 更改 <code>XAML</code> 中声明的顺序（即，在 <code>comboBox1</code> 之前列出 <code>label1</code> ，而忽略设计哲学问题）至少会在这里解决 <code>NullReferenceException</code> 。

source: Class Objects / Creating an Instance
es: Objetos de clase que crean una instancia
ja: クラス オブジェクト インスタンスの作成
ko: 클래스 객체 / 인스턴스 생성
ru: Объекты класса Создание экземпляра
zh_cn: 类对象 创建一个实例

source: Combine <code>NotNull&lt;T&gt;</code> with an extension method and you can cover even more situations. Here is an example of what the extension method can look like:
es: Combine <code>NotNull&lt;T&gt;</code> con un m&eacute;todo de extensi&oacute;n y podr&aacute; abarcar a&uacute;n m&aacute;s situaciones. Aqu&iacute; hay un ejemplo de c&oacute;mo puede verse el m&eacute;todo de extensi&oacute;n:
ja: <code>NotNull&lt;T&gt;</code> を拡張メソッドと組み合わせると、さらに多くの状況をカバーできます。 以下は、拡張メソッドの例です。
ko: <code>NotNull&lt;T&gt;</code> 을 확장 방법과 결합하면 더 많은 상황을 처리 할 수 ​​있습니다. 다음은 확장 방법의 예입니다.
ru: Объедините <code>NotNull&lt;T&gt;</code> с методом расширения, и вы сможете охватить еще больше ситуаций. Вот пример того, как может выглядеть метод расширения:
zh_cn: 将 <code>NotNull&lt;T&gt;</code> 与扩展方法结合使用，您可以涵盖更多的情况。 这是扩展方法的示例：

source: Compiler for the above code raises an error that variable <strong>obj</strong> is unassigned which signifies that our variable has null values or nothing. Compiler for the above code raises an error that variable <strong>obj</strong> is unassigned which signifies that our variable has null values or nothing.
es: El compilador para el c&oacute;digo anterior genera un error de que la variable <strong>obj</strong> no est&aacute; asignada, lo que significa que nuestra variable tiene valores nulos o nada. El compilador para el c&oacute;digo anterior genera un error de que la variable <strong>obj</strong> no est&aacute; asignada, lo que significa que nuestra variable tiene valores nulos o nada.
ja: 上記のコードのコンパイラーは、変数<strong>obj</strong>が割り当てられていないというエラーを発生させます。これは、変数にnull値があるか何もないことを示します。 上記のコードのコンパイラーは、変数<strong>obj</strong>が割り当てられていないというエラーを発生させます。これは、変数にnull値があるか何もないことを示します。
ko: 위 코드를위한 컴파일러는 변수 <strong>obj</strong> 가 할당되지 않았다는 오류를 <strong>일으켜</strong> 변수에 null 값이 있거나 없음을 나타냅니다. 위 코드를위한 컴파일러는 변수 <strong>obj</strong> 가 할당되지 않았다는 오류를 <strong>일으켜</strong> 변수에 null 값이 있거나 없음을 나타냅니다.
ru: Компилятор для приведенного выше кода выдает ошибку, что переменная <strong>obj</strong> не назначена, что означает, что наша переменная имеет нулевые значения или ничего. Компилятор для приведенного выше кода выдает ошибку, что переменная <strong>obj</strong> не назначена, что означает, что наша переменная имеет нулевые значения или ничего.
zh_cn: 上面的代码的编译器会产生一个错误，指出未分配变量<strong>obj</strong> ，这表明我们的变量具有空值或什么都没有。 上面的代码的编译器会产生一个错误，指出未分配变量<strong>obj</strong> ，这表明我们的变量具有空值或什么都没有。

source: DBNull is not the same as Nothing
es: DBNull no es lo mismo que Nada
ja: DBNullはNothingと同じではない
ko: DBNull은 Nothing과 같지 않습니다
ru: DBNull-это не то же самое,что Nothing.
zh_cn: DBNull与Nothing不一样

source: Data Provider Objects
es: Objetos proveedores de datos
ja: データプロバイダオブジェクト
ko: 데이터 제공자 객체
ru: Объекты поставщиков данных
zh_cn: 数据提供者对象
