Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <strong>UPDATE:</strong> It is worth mentioning that the term was coined by Bertrand Meyer <a href="https://www.eiffel.com/values/design-by-contract/">in connection with his design of the Eiffel programming language</a>.
es: <strong>ACTUALIZACI&Oacute;N:</strong> Vale la pena mencionar que el t&eacute;rmino fue acu&ntilde;ado por Bertrand Meyer <a href="https://www.eiffel.com/values/design-by-contract/">en relaci&oacute;n con su dise&ntilde;o del lenguaje de programaci&oacute;n Eiffel</a> .
ja: <strong>更新：</strong>この用語が<a href="https://www.eiffel.com/values/design-by-contract/">彼のエッフェルプログラミング言語の設計に関連して</a>バートランドマイヤーによって造られたことに言及する価値があります 。
ko: <strong>업데이트 :</strong> 이 용어는 <a href="https://www.eiffel.com/values/design-by-contract/">에펠 프로그래밍 언어의 디자인과 관련하여</a> Bertrand Meyer 에 의해 만들어졌습니다.
ru: <strong>ОБНОВЛЕНИЕ:</strong> Стоит отметить, что этот термин был придуман Бертраном Мейером <a href="https://www.eiffel.com/values/design-by-contract/">в связи с его разработкой языка программирования Eiffel</a> .
zh_cn: <strong>更新：</strong>值得一提的是，该术语是由Bertrand Meyer <a href="https://www.eiffel.com/values/design-by-contract/">与其Eiffel编程语言设计相关的</a> 。

source: <strong>Update C#8.0, 2019: Nullable reference types</strong>
es: <strong>Actualizaci&oacute;n C # 8.0, 2019: tipos de referencia anulables</strong>
ja: <strong>C＃8.0、2019を更新：null可能な参照型</strong>
ko: <strong>C # 8.0, 2019 업데이트 : Nullable 참조 유형</strong>
ru: <strong>Обновление C # 8.0, 2019: Обнуляемые ссылочные типы</strong>
zh_cn: <strong>更新C＃8.0,2019：可引用类型</strong>

source: <strong>Use Tools</strong>
es: <strong>Usar herramientas</strong>
ja: <strong>ツールを使用する</strong>
ko: <strong>도구 사용</strong>
ru: <strong>Используйте инструменты</strong>
zh_cn: <strong>使用工具</strong>

source: <strong>Value types (you can simply ignore these ones):</strong>
es: <strong>Tipos de valor (simplemente puede ignorar estos):</strong>
ja: <strong>値のタイプ（これらは単純に無視できます）：</strong>
ko: <strong>값 유형 (단순히 무시할 수 있음) :</strong>
ru: <strong>Типы значений (вы можете просто игнорировать эти):</strong>
zh_cn: <strong>值类型（您可以简单地忽略这些类型）：</strong>

source: <strong>What can you do about it?</strong>
es: <strong>&iquest;Qu&eacute; puedes hacer al respecto?</strong>
ja: <strong>あなたはそれについて何ができますか？</strong>
ko: <strong>그것에 대해 무엇을 할 수 있습니까?</strong>
ru: <strong>Что вы можете сделать по этому поводу?</strong>
zh_cn: <strong>你能为这个做什么？</strong>

source: <sup>1</sup> If Break on Throws is too aggressive and the debugger stops on an NPE in the .NET or 3rd-party library, <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">Break on User-Unhandled</a> can be used to limit the exceptions caught. Additionally, VS2012 introduces <a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">Just My Code</a> which I recommend enabling as well.
es: <sup>1</sup> Si Break on Throws es demasiado agresivo y el depurador se detiene en un NPE en la biblioteca .NET o de terceros, se puede usar <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">Break on User-Unledled</a> para limitar las excepciones detectadas. Adem&aacute;s, VS2012 presenta <a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">Just My Code,</a> que tambi&eacute;n recomiendo habilitar.
ja: <sup>1</sup> Break on Throwsが非常に強力で、.NETまたはサードパーティライブラリのNPEでデバッガーが停止した場合、 <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">Break on User-Unhandled</a>を使用して、キャッチされる例外を制限できます。 さらに、VS2012は<a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">Just My Code</a>を導入しています。これも有効にすることをお勧めします。
ko: <sup>1</sup> Break on Throws가 너무 공격적이며 .NET 또는 타사 라이브러리의 NPE에서 디버거가 중지되면 <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">User-Unhandled</a> 에서 Break를 사용하여 포착 된 예외를 제한 할 수 있습니다. 또한 VS2012에는 <a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">Just My Code</a> 가 도입되어 활성화하는 것이 좋습니다.
ru: <sup>1</sup> Если Break on Throws слишком агрессивен и отладчик останавливается на NPE в .NET или сторонней библиотеке, можно использовать <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">Break on User-Unhandled</a> для ограничения перехвата исключений. Кроме того, VS2012 представляет <a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">Just My Code,</a> который я также рекомендую включить.
zh_cn: <sup>1</sup>如果&ldquo;抛出时中断&rdquo;过于激进，并且调试器在.NET或3rd-party库中的NPE上停止，则可以使用&ldquo; <a href="https://msdn.microsoft.com/en-us/library/038tzxdw.aspx">用户未处理时中断&rdquo;</a>来限制捕获的异常。 另外，VS2012引入了<a href="https://msdn.microsoft.com/en-us/library/dn457346.aspx">&ldquo;我的代码&rdquo;</a> ，我建议也启用它。

source: A <code>MsgBox</code> in the Catch which displays <code>Error while...</code> will be of little help. This method also leads to <em>very bad</em> Stack&nbsp; Overflow questions, because you can't describe the actual exception, the object involved or even the line of code where it happens.
es: Un <code>MsgBox</code> en Catch que muestre <code>Error while...</code> ser&aacute; de poca ayuda. Este m&eacute;todo tambi&eacute;n lleva a preguntas <em>muy malas de</em> desbordamiento de pila, porque no puede describir la excepci&oacute;n real, el objeto involucrado o incluso la l&iacute;nea de c&oacute;digo donde sucede.
ja: キャッチ中に <code>Error while...</code> を表示する <code>MsgBox</code> はほとんど役に立ちません。 この方法は、実際の例外、関係するオブジェクト、またはそれが発生するコード行さえ記述できないため、 <em>非常に悪い</em>スタックオーバーフローの質問<em>に</em>もつながります。
ko: Catch의 <code>MsgBox</code> 는 <code>Error while...</code> 을 표시하는데 도움이되지 않습니다. 이 방법은 또한 실제 예외, 관련된 객체 또는 발생하는 코드 라인을 설명 할 수 없기 때문에 <em>매우 잘못된</em> 스택 오버플로 질문으로 이어집니다.
ru: <code>MsgBox</code> в Catch, который отображает <code>Error while...</code> будет мало помочь. Этот метод также приводит к <em>очень плохим</em> вопросам переполнения стека, потому что вы не можете описать фактическое исключение, задействованный объект или даже строку кода, где это происходит.
zh_cn: Catch中的一个 <code>MsgBox</code> ， <code>Error while...</code> 时显示错误，将无济于事。 这种方法还会导致<em>非常糟糕的</em> Stack Overflow问题，因为您无法描述实际的异常，所涉及的对象甚至发生异常的代码行。

source: A <code>NullReferenceException</code> is thrown when we are trying to access Properties of a null object or when a string value becomes empty and we are trying to access string methods.
es: Se produce una <code>NullReferenceException</code> cuando intentamos acceder a las propiedades de un objeto nulo o cuando un valor de cadena se vac&iacute;a y estamos intentando acceder a m&eacute;todos de cadena.
ja: <code>NullReferenceException</code> は、nullオブジェクトのプロパティにアクセスしようとした場合、または文字列値が空になって文字列メソッドにアクセスしようとした場合にスローされます。
ko: <code>NullReferenceException</code> 은 null 객체의 속성에 액세스하려고하거나 문자열 값이 비어 있고 문자열 메서드에 액세스하려고 할 때 발생합니다.
ru: <code>NullReferenceException</code> генерируется, когда мы пытаемся получить доступ к свойствам нулевого объекта или когда строковое значение становится пустым, и мы пытаемся получить доступ к строковым методам.
zh_cn: 当我们尝试访问null对象的Properties或字符串值变为空并且试图访问字符串方法时，将引发 <code>NullReferenceException</code> 。

source: A NullReferenceException exception is thrown when you try to access a member of a type whose value is null.
es: Una excepción de NullReferenceException se lanza cuando se intenta acceder a un miembro de un tipo cuyo valor es nulo.
ja: 値が NULL の型のメンバにアクセスしようとすると、NullReferenceException 例外がスローされます。
ko: 값이 null 인 유형의 멤버에 액세스하려고하면 NullReferenceException 예외가 발생합니다.
ru: Исключение NullReferenceException бросается,когда вы пытаетесь получить доступ к члену типа,значение которого равно нулю.
zh_cn: 当你尝试访问一个值为空的类型成员时,会抛出一个NullReferenceException异常。

source: A badly implemented Try/Catch can hide where the problem is and result in new ones:
es: Un TryCatch mal implementado puede ocultar dónde está el problema y dar lugar a otros nuevos:
ja: 下手に実装されたTryCatchは、問題がどこにあるのかを隠してしまい、新たな問題が発生してしまうことがあります。
ko: 잘못 구현 된 Try / Catch는 문제가있는 위치를 숨기고 새로운 문제를 초래할 수 있습니다.
ru: Плохо реализованный TryCatch может скрыть,где проблема,и привести к появлению новых:
zh_cn: 一个执行得不好的TryCatch会隐藏问题所在,导致新的问题出现。

source: A common oversight is a class which uses a collection <code>Type</code>:
es: Un descuido com&uacute;n es una clase que usa un <code>Type</code> colecci&oacute;n:
ja: 一般的な見落としは、コレクション <code>Type</code> を使用するクラスです。
ko: 일반적인 감독은 컬렉션 <code>Type</code> 을 사용하는 클래스입니다.
ru: Обычный недосмотр - это класс, который использует коллекцию <code>Type</code> :
zh_cn: 常见的疏忽是使用集合 <code>Type</code> 的类 ：

source: A more "formal" way of preventing such error conditions <em>while developing</em> is applying <em><a href="http://en.wikipedia.org/wiki/Design_by_contract">design by contract</a></em> in your code. This means you need to set class <em>invariants</em>, and/or even function/method <em>preconditions</em> and <em>postconditions</em> on your system, while developing.
es: Una forma m&aacute;s "formal" de prevenir tales condiciones de error <em>durante el desarrollo</em> es aplicar el <em><a href="http://en.wikipedia.org/wiki/Design_by_contract">dise&ntilde;o por contrato</a></em> en su c&oacute;digo. Esto significa que necesita establecer <em>invariantes de</em> clase y / o incluso <em>precondiciones</em> y <em>postcondiciones de</em> funci&oacute;n / m&eacute;todo en su sistema, mientras se desarrolla.
ja: <em>開発中に</em>そのようなエラー状態<em>を</em>防ぐより「正式な」方法は、コードで<em><a href="http://en.wikipedia.org/wiki/Design_by_contract">契約</a></em>により<em>設計を</em>適用することです。 つまり、開発中に、システムにクラス<em>不変式</em>を設定したり、関数/メソッドの<em>事前条件</em>や<em>事後条件</em>を設定したりする必要があります。
ko: <em>개발하는 동안</em> 이러한 오류 조건 <em>을</em> 방지하는보다 "공식적인"방법은 <em><a href="http://en.wikipedia.org/wiki/Design_by_contract">계약</a></em> 에 따라 코드를 <em>설계하는</em> 것입니다. 즉, 개발하는 동안 클래스 <em>불변</em> 값을 설정하거나 시스템의 기능 / 메소드 <em>전제 조건</em> 및 <em>사후 조건을</em> 설정해야합니다.
ru: Более &laquo;формальным&raquo; способом предотвращения возникновения таких ошибок <em>при разработке</em> является применение <em><a href="http://en.wikipedia.org/wiki/Design_by_contract">проекта по контракту</a></em> в вашем коде. Это означает, что вам нужно установить <em>инварианты</em> класса и / или даже <em>предварительные условия</em> и <em>постфункции</em> в вашей системе при разработке.
zh_cn: 防止此类错误情况<em>发生</em>的更&ldquo;正式&rdquo;方法是在代码中<em><a href="http://en.wikipedia.org/wiki/Design_by_contract">按合同</a></em>应用<em>设计</em> 。 这意味着在开发时，您需要在系统上设置类<em>不变式</em> ，甚至函数/方法的<em>前提条件</em>和<em>后置条件</em> 。

source: A note on null dereferences in unsafe code
es: Una nota sobre las dereferencias nulas en código inseguro
ja: 安全ではないコードにおけるヌル参照の派生に関する注意事項
ko: 안전하지 않은 코드에서 null 역 참조에 대한 참고 사항
ru: Записка о нулевых разыменованиях в небезопасном коде
zh_cn: 关于不安全代码中的空定义的说明

source: A nullable reference type is noted using the same syntax as nullable value types: a <code>?</code> is appended to the type of the variable.
es: Se observa un tipo de referencia anulable utilizando la misma sintaxis que los tipos de valores anulables: a <code>?</code> se agrega al tipo de la variable.
ja: null可能な参照型は、null可能な値型と同じ構文を使用して示されます <code>?</code> 変数の型に追加されます。
ko: 널 입력 가능 참조 유형은 널 입력 가능 값 유형과 동일한 구문을 사용하여 표시됩니다 <code>?</code> 변수 유형에 추가됩니다.
ru: Обнуляемый ссылочный тип отмечается с использованием того же синтаксиса, что и типы значений, допускающие значение NULL: a <code>?</code> добавляется к типу переменной.
zh_cn: 使用与可空值类型相同的语法来记录可空引用类型： 附加到变量的类型。

source: A typo is a problem here: <code>Employees</code> vs <code>Employee</code>. There was no <code>DataTable</code> named "Employee" created, so a <code>NullReferenceException</code> results trying to access it. Another potential problem is assuming there will be <code>Items</code> which may not be so when the SQL includes a WHERE clause.
es: Un error tipogr&aacute;fico es un problema aqu&iacute;: <code>Employees</code> vs <code>Employee</code> . No se cre&oacute; ninguna <code>DataTable</code> llamada "Empleado", por lo que se produce una <code>NullReferenceException</code> intentar acceder a ella. Otro problema potencial es asumir que habr&aacute; <code>Items</code> que pueden no serlo cuando el SQL incluye una cl&aacute;usula WHERE.
ja: ここでのタイプミスは問題です： <code>Employees</code> vs <code>Employee</code> 。 「Employee」という名前の <code>DataTable</code> は作成されなかったため、 <code>NullReferenceException</code> がアクセスしようとしました。 もう1つの潜在的な問題は、SQLにWHERE句が含まれている場合にそうでない可能性がある <code>Items</code> があると想定することです。
ko: 오타는 여기서 문제입니다 : <code>Employees</code> vs <code>Employee</code> . 이름이 "Employee"인 <code>DataTable</code> 이 없으므로 <code>NullReferenceException</code> 이 액세스하려고합니다. 또 다른 잠재적 인 문제는 SQL에 WHERE 절이 포함되어있을 때 그렇지 않을 수있는 <code>Items</code> 이 있다고 가정하는 것입니다.
ru: Опечатка - проблема здесь: <code>Employees</code> против <code>Employee</code> . Не было создано <code>DataTable</code> с именем &laquo;Employee&raquo;, поэтому при попытке доступа к нему возникает <code>NullReferenceException</code> . Другая потенциальная проблема заключается в предположении, что будут <code>Items</code> которых может не быть, если в SQL есть предложение WHERE.
zh_cn: 错字在这里是一个问题： <code>Employees</code> vs <code>Employee</code> 。 没有创建名为&ldquo; Employee&rdquo;的 <code>DataTable</code> ，因此会导致 <code>NullReferenceException</code> 尝试访问它。 另一个潜在的问题是，假设在SQL包含WHERE子句时，可能不会有Item。

source: ASP.NET MVC empty view models
ja: ASP.NET MVC 空のビューモデル
ko: ASP.NET MVC 빈 뷰 모델
ru: ASP.NET MVC пустые модели просмотра
zh_cn: ASP.NET MVC空视图模型

source: ASP.NET Page Life cycle:
es: Página ASP.NET Ciclo de vida:
ja: ASP.NETページのライフサイクル。
ko: ASP.NET 페이지 수명주기 :
ru: ASP.NET Page Жизненный цикл:
zh_cn: ASP.NET页面生命周期。

source: ASP.NET Session Values
es: Valores de la sesión de ASP.NET
ja: ASP.NET セッション値
ko: ASP.NET 세션 값
ru: Сессия ASP.NET Ценности
zh_cn: ASP.NET会话值

source: Access Levels in Visual Basic
es: Niveles de acceso en Visual Basic
ja: Visual Basicのアクセスレベル
ko: Visual Basic의 액세스 수준
ru: Уровни доступа в Visual Basic
zh_cn: Visual Basic中的访问级别

source: Add a RigidBody to your object with AddComponent &gt; Physics &gt; Rigidbody
es: Agregue un RigidBody a su objeto con AddComponent&gt; F&iacute;sica&gt; Rigidbody
ja: AddComponent&gt; Physics&gt; RigidbodyでRigidBodyをオブジェクトに追加します
ko: AddComponent&gt; Physics&gt; Rigidbody를 사용하여 객체에 RigidBody 추가
ru: Добавьте RigidBody к вашему объекту с помощью AddComponent&gt; Физика&gt; Rigidbody
zh_cn: 使用AddComponent&gt; Physics&gt; Rigidbody将RigidBody添加到您的对象

source: Adding a case when the class name for entity used in entity framework is same as class name for a web form code-behind file.
es: Añadir un caso en el que el nombre de la clase para la entidad utilizada en el marco de la entidad es el mismo que el nombre de la clase para un archivo de código de formulario web.
ja: エンティティフレームワークで使用するエンティティのクラス名が、Webフォームのコードバックファイルのクラス名と同じ場合の追加
ko: 엔티티 프레임 워크에서 사용되는 엔티티의 클래스 이름이 웹 양식 코드 숨김 파일의 클래스 이름과 동일한 경우를 추가하십시오.
ru: Добавление случая,когда имя класса для сущности,используемого в фреймворке сущностей,совпадает с именем класса для файла веб-формы,находящегося за кодом.
zh_cn: 增加一个实体框架中使用的实体类名称与Web表单代码后面文件的类名称相同的情况。

source: Alternatively, design by contract can be applied using <em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">assertions</a></em>.
es: Alternativamente, el dise&ntilde;o por contrato se puede aplicar utilizando <em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">aserciones</a></em> .
ja: または、契約による設計は<em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">アサーション</a></em>を使用して適用できます。
ko: 또는 <em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">어설 션을</a></em> 사용하여 계약 별 디자인을 적용 할 수 있습니다.
ru: В качестве альтернативы, дизайн по контракту может быть применен с использованием <em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">утверждений</a></em> .
zh_cn: 或者，可以使用<em><a href="http://en.wikipedia.org/wiki/Assertion_%28software_development%29">断言</a></em>来应用按合同设计。

source: Alternatively, you can use <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code>
es: Alternativamente, puede usar <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code>
ja: または、 <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code> 使用することもできます。
ko: 또는 <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code> 사용할 수도 있습니다 .
ru: Кроме того, вы можете использовать <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code>
zh_cn: 或者，您可以使用 <code>(ComboBox5.SelectedItem IsNot Nothing) AndAlso...</code>

source: Although I have a feeling it was because Visual Studio was misreading the ampersands and brackets.
es: Aunque tengo el presentimiento de que fue porque Visual Studio estaba malinterpretando los amperios y los soportes.
ja: Visual Studio がアンパサンドと括弧を読み違えていたからだと思いますが。
ko: Visual Studio가 앰퍼샌드와 괄호를 잘못 읽고 있기 때문에 느낌이 들었습니다.
ru: Хотя у меня такое чувство,что это произошло из-за того,что Visual Studio неправильно прочитала амперсанды и скобки.
zh_cn: 虽然我有一种感觉,那是因为Visual Studio读错了安培号和括号。

source: Always initialize your objects before you try to do anything with them.
es: Siempre inicialice sus objetos antes de intentar hacer algo con ellos.
ja: オブジェクトで何かをしようとする前に、必ずオブジェクトを初期化してください。
ko: 무언가를 시도하기 전에 항상 객체를 초기화하십시오.
ru: Всегда инициализируйте свои объекты перед тем,как пытаться что-либо с ними сделать.
zh_cn: 在你尝试对对象做任何事情之前,一定要先初始化你的对象。

source: Among other things, this code does not anticipate that the user may not have selected something in one or more UI controls. <code>ListBox1.SelectedItem</code> may well be <code>Nothing</code>, so <code>ListBox1.SelectedItem.ToString</code> will result in an NRE.
es: Entre otras cosas, este c&oacute;digo no anticipa que el usuario no haya seleccionado algo en uno o m&aacute;s controles de IU. <code>ListBox1.SelectedItem</code> puede ser <code>Nothing</code> , por lo que <code>ListBox1.SelectedItem.ToString</code> dar&aacute; como resultado una NRE.
ja: 特に、このコードは、ユーザーが1つ以上のUIコントロールで何かを選択していない可能性があることを予期していません。 <code>ListBox1.SelectedItem</code> は <code>Nothing</code> である可能性があるため、 <code>ListBox1.SelectedItem.ToString</code> はNREになります。
ko: 무엇보다도이 코드는 사용자가 하나 이상의 UI 컨트롤에서 무언가를 선택하지 않았을 것으로 예상하지 않습니다. <code>ListBox1.SelectedItem</code> 은 <code>Nothing</code> 일 수 있으므로 <code>ListBox1.SelectedItem.ToString</code> 은 NRE가됩니다.
ru: Помимо прочего, этот код не предполагает, что пользователь, возможно, не выбрал что-то в одном или нескольких элементах управления пользовательского интерфейса. <code>ListBox1.SelectedItem</code> вполне может быть <code>Nothing</code> , поэтому <code>ListBox1.SelectedItem.ToString</code> приведет к NRE.
zh_cn: 除其他外，此代码无法预期用户可能未在一个或多个UI控件中选择某些内容。 <code>ListBox1.SelectedItem</code> 可能为 <code>Nothing</code> ，因此 <code>ListBox1.SelectedItem.ToString</code> 将导致NRE。

source: An empty <code>Catch</code> block is the devil's playground. This OP was baffled why he was getting an NRE in the <code>Finally</code> block. In other situations, an empty <code>Catch</code> may result in something else much further downstream going haywire and cause you to spend time looking at the wrong things in the wrong place for the problem. (The "silent exception" described above provides the same entertainment value.)
es: Un bloque de <code>Catch</code> vac&iacute;o es el patio de recreo del diablo. Este OP estaba desconcertado por qu&eacute; estaba obteniendo una NRE en el bloque <code>Finally</code> . En otras situaciones, una <code>Catch</code> vac&iacute;a puede dar lugar a que algo mucho m&aacute;s lejos se vuelva loco y hacer que pierda tiempo buscando las cosas incorrectas en el lugar equivocado para el problema. (La "excepci&oacute;n silenciosa" descrita anteriormente proporciona el mismo valor de entretenimiento).
ja: 空の <code>Catch</code> ブロックは、悪魔の遊び場です。 このOPは、 <code>Finally</code> ブロックでNREを取得する理由に困惑しました。 他の状況では、 <code>Catch</code> が空になると、さらに下流で問題が発生し、問題の場所と場所を間違えるのに時間がかかる場合があります。 （上記の「サイレント例外」は、同じエンターテイメントの価値を提供します。）
ko: 빈 <code>Catch</code> 블록은 악마의 놀이터입니다. 이 OP는 왜 Final 블록에서 NRE를 받고 있었는지 당황했습니다. 다른 상황에서, 빈 <code>Catch</code> 가 비어 있으면 하류로가는 훨씬 더 많은 다운 스트림이 생길 수 있으며 문제의 잘못된 장소에서 잘못된 것을 보는 데 시간을 소비하게됩니다. 위에서 설명한 "자동 예외"는 동일한 엔터테인먼트 가치를 제공합니다.
ru: Пустой блок <code>Catch</code> - игровая площадка дьявола. Этот ОП был сбит с толку, почему он получил NRE в блоке &laquo; <code>Finally</code> . В других ситуациях пустой <code>Catch</code> может привести к тому, что что-то гораздо более низкое по течению станет бесполезным, и вы потратите время на поиск неправильных вещей в неподходящем месте для решения проблемы. (Описанное выше &laquo;тихое исключение&raquo; обеспечивает ту же развлекательную ценность.)
zh_cn: 一个空的 <code>Catch</code> 块是魔鬼的游乐场。 这个OP令他为何在Final块中获得NRE感到困惑。 在其他情况下，空的 <code>Catch</code> 可能会导致下游进一步混乱，并导致您花费时间在错误的地方寻找错误的地方以解决问题。 （上述&ldquo;静默例外&rdquo;提供相同的娱乐价值。）

source: An example of this exception being thrown is: When you are trying to check something, that is null.
es: Un ejemplo de esta excepción que se lanza es:Cuando se intenta comprobar algo,eso es nulo.
ja: この例外がスローされる例は次のとおりです。
ko: 이 예외가 발생하는 예는 다음과 같습니다. 무언가를 확인하려고하면 null입니다.
ru: Пример такого исключения:когда вы пытаетесь что-то проверить,это ноль.
zh_cn: 这个异常被抛出的一个例子是:当你试图检查某个东西时,它是空的。

source: And here is an example of how it could be used:
es: Y aquí hay un ejemplo de cómo podría ser utilizado:
ja: そして、その使い方の一例をご紹介します。
ko: 다음은 사용 방법에 대한 예입니다.
ru: И вот пример того,как его можно использовать:
zh_cn: 这里举个例子,说明如何使用它。

source: And it worked.
es: Y funcionó.
ja: そして、それが功を奏した。
ko: 그리고 효과가있었습니다.
ru: И это сработало.
zh_cn: 而且成功了。

source: Another case where <code>NullReferenceExceptions</code> can happen is the (incorrect) use of the <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as"><code>as</code> operator</a>:
es: Otro caso en el que puede ocurrir <code>NullReferenceExceptions</code> es el uso (incorrecto) del <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as">operador <code>as</code> </a> :
ja: <code>NullReferenceExceptions</code> が発生する可能性があるもう1つのケースは、 <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as"> <code>as</code> 演算子の</a> （正しくない）使用です。
ko: <code>NullReferenceExceptions</code> 이 발생할 수있는 또 다른 경우는 <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as"> <code>as</code> 연산자를</a> 잘못 사용하는 것 입니다 .
ru: Другой случай, когда могут возникать <code>NullReferenceExceptions</code> , - это (неправильное) использование <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as">оператора <code>as</code> </a> :
zh_cn: <code>NullReferenceExceptions</code> 可能发生的另一种情况是（错误）使用<a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/as"> <code>as</code> 运算符</a> ：
