Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Use the null coalescing operator: <code>??</code> [C#] or <code>If()</code> [VB].
es: Utilice el operador de fusi&oacute;n nulo: <code>??</code> [C #] o <code>If()</code> [VB].
ja: nullの合体演算子を使用します。 [C＃]または <code>If()</code> [VB]。
ko: 널 병합 연산자를 사용하십시오. <code>??</code> [C #] 또는 <code>If()</code> [VB].
ru: Используйте оператор слияния null: <code>??</code> [C #] или <code>If()</code> [VB].
zh_cn: 使用空合并运算符： <code>??</code> [C＃]或 <code>If()</code> [VB]。

source: Use the null condition operator: <code>?.</code> or <code>?[x]</code> for arrays (available in C# 6 and VB.NET 14):
es: Utilice el operador de condici&oacute;n nula: <code>?.</code> o <code>?[x]</code> para matrices (disponible en C # 6 y VB.NET 14):
ja: NULL条件演算子を使用します： <code>?.</code> または <code>?[x]</code> 配列（C＃6およびVB.NET 14で利用可能）：
ko: 널 조건 연산자 ( <code>?.</code> 사용하십시오 . 또는 배열의 경우 <code>?[x]</code> (C # 6 및 VB.NET 14에서 사용 가능) :
ru: Используйте нулевой оператор условия: <code>?.</code> или <code>?[x]</code> для массивов (доступно в C # 6 и VB.NET 14):
zh_cn: 使用空条件运算符： <code>?.</code> 或 <code>?[x]</code> 用于数组（在C＃6和VB.NET 14中可用）：

source: User defined structs
es: Estructuras definidas por el usuario
ja: ユーザー定義構造体
ko: 사용자 정의 구조체
ru: Пользовательские структуры
zh_cn: 用户定义的结构

source: Using a <code>List(Of T)</code> will make it quite difficult to have an element without a valid object:
es: Usar una <code>List(Of T)</code> har&aacute; que sea bastante dif&iacute;cil tener un elemento sin un objeto v&aacute;lido:
ja: <code>List(Of T)</code> を使用すると、有効なオブジェクトなしで要素を持つことが非常に難しくなります。
ko: <code>List(Of T)</code> 를 사용하면 유효한 객체가없는 요소를 갖는 것이 매우 어렵습니다.
ru: Использование <code>List(Of T)</code> значительно затруднит наличие элемента без допустимого объекта:
zh_cn: 使用 <code>List(Of T)</code> 会使没有有效对象的元素变得非常困难：

source: Validate data before using it (also use <code>Option Strict</code> and SQL parameters):
es: Valide los datos antes de usarlos (tambi&eacute;n use los par&aacute;metros <code>Option Strict</code> y SQL):
ja: 使用する前にデータを検証します（ <code>Option Strict</code> およびSQLパラメーターも使用します）。
ko: 사용하기 전에 데이터의 유효성을 검사하십시오 ( <code>Option Strict</code> 및 SQL 매개 변수도 사용).
ru: Проверьте данные перед их использованием (также используйте параметры <code>Option Strict</code> и SQL):
zh_cn: 在使用之前验证数据（也使用 <code>Option Strict</code> 和SQL参数）：

source: Value Types and Reference Types
es: Tipos de valor y tipos de referencia
ja: 値の型と参照の型
ko: 값 유형 및 참조 유형
ru: Типы значений и эталонные типы
zh_cn: 值类型和参考类型

source: Visual Basic Forms
es: Formas básicas visuales
ja: Visual Basic フォーム
ko: Visual Basic 양식
ru: Визуальные основные формы
zh_cn: Visual Basic表格

source: Visual Basic tries to make the process clear repeatedly using <strong><code>New</code></strong>: Using the <strong><code>New</code></strong> Operator creates a <strong>new</strong> object and calls <strong><code>Sub New</code></strong> -- the constructor -- where your object can perform any other initialization.
es: Visual Basic intenta aclarar el proceso repetidamente usando <strong> <code>New</code> </strong> : el uso del <strong> <code>New</code> </strong> Operator crea un <strong>nuevo</strong> objeto y llama a <strong> <code>Sub New</code> </strong> , el constructor, donde su objeto puede realizar cualquier otra inicializaci&oacute;n.
ja: Visual Basicは、 <strong> <code>New</code> </strong>を使用してプロセスを繰り返し明確にしようとします。New演算子を使用すると、 <strong>新しい</strong>オブジェクトが作成され、 <strong> <code>Sub New</code> </strong> （コンストラクタ）が呼び出されます。ここで、オブジェクトは他の初期化を実行できます。
ko: Visual Basic은 <strong> <code>New</code> 를</strong> 사용하여 프로세스를 반복적으로 명확하게 만들려고합니다. <strong>New</strong> 연산자를 사용하면 <strong>새</strong> 개체가 만들어지고 개체가 다른 초기화를 수행 할 수있는 <strong> <code>Sub New</code> (</strong> 생성자)가 호출됩니다.
ru: Visual Basic пытается сделать процесс очистки многократно, используя <strong> <code>New</code> </strong> : с помощью оператора <strong> <code>New</code> </strong> создается <strong>новый</strong> объект и вызывается <strong> <code>Sub New</code> </strong> - конструктор, - где ваш объект может выполнить любую другую инициализацию.
zh_cn: Visual Basic尝试使用<strong> <code>New</code> </strong>反复使过程更清晰：使用<strong> <code>New</code> </strong> Operator创建一个<strong>新</strong>对象并调用<strong> <code>Sub New</code> </strong> （构造函数），您的对象可以在其中执行任何其他初始化。

source: WPF Control Creation Order and Events
es: Orden de creación de control de WPF y eventos
ja: WPFコントロールの作成順序とイベント
ko: WPF 컨트롤 생성 순서 및 이벤트
ru: Порядок и события создания управления WPF
zh_cn: WPF控件创建顺序和事件

source: Ways to Avoid
es: Formas de evitar
ja: 避ける方法
ko: 피하는 방법
ru: Способы избежать
zh_cn: 避免的方法

source: We can add data really easily actually in a few ways:
es: Podemos añadir datos muy fácilmente,en realidad de varias maneras:
ja: 私たちは、いくつかの方法で実際には本当に簡単にデータを追加することができます。
ko: 실제로 몇 가지 방법으로 데이터를 실제로 쉽게 추가 할 수 있습니다.
ru: Мы можем действительно легко добавлять данные на самом деле несколькими способами:
zh_cn: 实际上,我们可以通过以下几种方式来增加数据。

source: Well, in simple terms:
es: Bueno,en términos simples:
ja: まあ、簡単に言うと
ko: 간단히 말해서,
ru: Ну,проще говоря:
zh_cn: 那么,简单来说。

source: What about the second point? Dereferencing <em>any</em> invalid pointer that falls in the lowest page of virtual memory causes the same operating system error, and thereby the same exception.
es: &iquest;Qu&eacute; pasa con el segundo punto? Anular la referencia a <em>cualquier</em> puntero no v&aacute;lido que se encuentre en la p&aacute;gina m&aacute;s baja de la memoria virtual provoca el mismo error del sistema operativo y, por lo tanto, la misma excepci&oacute;n.
ja: 2番目のポイントはどうですか？ 仮想メモリの最下位ページにある無効なポインタを逆参照<em>する</em>と、同じオペレーティングシステムエラーが発生し、同じ例外が発生します。
ko: 두 번째 요점은 어떻습니까? 가상 메모리의 가장 낮은 페이지에 해당 <em>하는</em> 잘못된 포인터를 참조하면 동일한 운영 체제 오류가 발생하여 동일한 예외가 발생합니다.
ru: Как насчет второго пункта? Разыменование <em>любого</em> недопустимого указателя, который попадает на самую нижнюю страницу виртуальной памяти, вызывает ту же ошибку операционной системы и, следовательно, то же исключение.
zh_cn: 那第二点呢？ 取消引用落在虚拟内存最低页中的<em>任何</em>无效指针会导致相同的操作系统错误，从而导致相同的异常。

source: What does that mean?
es: ¿Qué significa eso?
ja: それはどういう意味なのか?
ko: 그게 무슨 뜻이야?
ru: Что это значит?
zh_cn: 那是什么意思?

source: What does this mean, and what can I do to fix this error?
es: ¿Qué significa esto,y qué puedo hacer para arreglar este error?
ja: これはどういう意味なのでしょうか、また、このエラーを修正するにはどうしたらいいのでしょうか?
ko: 이것은 무엇을 의미하며이 오류를 해결하기 위해 무엇을 할 수 있습니까?
ru: Что это значит,и что я могу сделать,чтобы исправить эту ошибку?
zh_cn: 这意味着什么,我该怎么做才能解决这个错误?

source: What is a NullReferenceException, and how do I fix it
es: ¿Qué es una excepción de referencia nula y cómo la arreglo?
ja: NullReferenceException とは何ですか?
ko: NullReferenceException은 무엇이며 어떻게 해결합니까?
ru: Что такое NullReferenceException,и как мне это исправить.
zh_cn: 什么是NullReferenceException,如何修复它?

source: What is the cause?
es: ¿Cuál es la causa?
ja: 原因は何か?
ko: 원인이 무엇입니까?
ru: В чем причина?
zh_cn: 是什么原因造成的?

source: When a property of a null object accessed:
es: Cuando se accede a una propiedad de un objeto nulo:
ja: null オブジェクトのプロパティにアクセスした場合。
ko: null 객체의 속성에 액세스 한 경우 :
ru: При доступе к свойству нулевого объекта:
zh_cn: 当访问一个空对象的属性时。

source: When a string method of an empty string accessed:
es: Cuando un método de cadena de una cadena vacía accedió:
ja: 空文字列の文字列メソッドにアクセスした場合。
ko: 빈 문자열의 문자열 메소드에 액세스 한 경우 :
ru: При обращении к методу пустой строки:
zh_cn: 当访问一个空字符串方法的字符串时。

source: When declared as a module/class level variable, as appears to be the case with <code>con</code>, the compiler can't know if the object was created by an upstream procedure. Do not ignore warnings.
es: Cuando se declara como una variable de nivel de m&oacute;dulo / clase, como parece ser el caso con <code>con</code> , el compilador no puede saber si el objeto fue creado por un procedimiento ascendente. No ignore las advertencias.
ja: モジュール/クラスレベル変数として宣言された場合、 <code>con</code> の場合と同様に、コンパイラーはオブジェクトが上流のプロシージャによって作成されたかどうかを知ることができません。 警告を無視しないでください。
ko: <code>con</code> 의 경우와 같이 모듈 / 클래스 레벨 변수로 선언되면 컴파일러는 객체가 업스트림 프로 시저에 의해 작성되었는지 알 수 없습니다. 경고를 무시하지 마십시오.
ru: Когда декларируется как переменная уровня модуля / класса, как это имеет место в случае с <code>con</code> , компилятор не может знать, был ли объект создан вышестоящей процедурой. Не игнорируйте предупреждения.
zh_cn: 当声明为模块/类级别的变量（如 <code>con</code> 的情况）时，编译器无法知道该对象是否由上游过程创建。 不要忽略警告。

source: When it is only appropriate to create the instance later:
es: Cuando sólo es apropiado crear la instancia más tarde:
ja: インスタンスの作成が後回しにしかならない場合。
ko: 나중에 인스턴스를 작성하는 것이 적절한 경우 :
ru: Когда уместно создать экземпляр только позже:
zh_cn: 当它只适合于以后创建实例时。

source: When working <strong>across different layers</strong>, for example in an MVC application, a controller needs services to call business operations. In such scenarios <strong>Dependency Injection Container</strong> can be used to initialize the services to avoid the <strong>NullReferenceException</strong>. So that means you don't need to worry about checking for null and just call the services from the controller as though they will always to available (and initialized) as either a singleton or a prototype.
es: Cuando se trabaja <strong>en diferentes capas</strong> , por ejemplo, en una aplicaci&oacute;n MVC, un controlador necesita servicios para llamar a las operaciones comerciales. En tales escenarios, el <strong>Contenedor de inyecci&oacute;n de dependencias</strong> se puede utilizar para inicializar los servicios para evitar la <strong>NullReferenceException</strong> . Eso significa que no necesita preocuparse por verificar nulos y simplemente llamar a los servicios desde el controlador como si siempre estuvieran disponibles (e inicializados) como un singleton o un prototipo.
ja: MVCアプリケーションなど、 <strong>さまざまなレイヤー</strong>で作業する場合、コントローラーにはビジネスオペレーションを呼び出すサービスが必要です。 このようなシナリオでは、 <strong>依存性注入コンテナ</strong>を使用してサービスを初期化し、 <strong>NullReferenceException</strong>を回避できます。 つまり、nullのチェックについて心配する必要はなく、コントローラからサービスを呼び出すだけで、シングルトンまたはプロトタイプのいずれかとして常に利用可能（および初期化）であるかのように処理できます。
ko: MVC 애플리케이션과 같이 <strong>서로 다른 계층</strong> 에서 작업 할 때 컨트롤러는 비즈니스 운영을 호출하는 서비스가 필요합니다. 이러한 시나리오에서는 <strong>Dependency Injection Container</strong> 를 사용하여 <strong>NullReferenceException</strong> 을 피하기 위해 서비스를 초기화 할 수 있습니다. 따라서 null 검사에 대해 걱정할 필요가 없으며 컨트롤러에서 서비스를 항상 싱글 톤 또는 프로토 타입으로 사용할 수있는 것처럼 호출하면됩니다.
ru: При работе <strong>на разных уровнях</strong> , например, в приложении MVC, контроллеру нужны сервисы для вызова бизнес-операций. В таких сценариях <strong>Dependency Injection Container</strong> можно использовать для инициализации служб, чтобы избежать исключения <strong>NullReferenceException</strong> . Таким образом, это означает, что вам не нужно беспокоиться о проверке на null и просто вызывать сервисы из контроллера, как если бы они всегда были доступны (и инициализированы) в виде одиночного или прототипа.
zh_cn: 当<strong>跨不同的层</strong>工作时（例如在MVC应用程序中），控制器需要服务来调用业务操作。 在这种情况下，可以使用<strong>依赖项注入容器</strong>来初始化服务以避免<strong>NullReferenceException</strong> 。 因此，这意味着您不必担心检查null并只需从控制器调用服务，就好像它们将始终作为单例或原型可用（并初始化）一样。

source: When you know during development that a method maybe can, but never should return <code>null</code>, you can use <code>Debug.Assert()</code> to break as soon as possible when it does occur:
es: Cuando sabe durante el desarrollo que un m&eacute;todo puede, pero nunca debe volver <code>null</code> , puede usar <code>Debug.Assert()</code> para que se rompa lo antes posible cuando ocurra:
ja: 開発中にメソッドが <code>null</code> を返す可能性があるが絶対に返すべきではないことがわかっている場合は、 <code>Debug.Assert()</code> を使用して、発生したときにできるだけ早くブレークすることができます。
ko: 개발 중에 메서드가 가능하지만 <code>null</code> 을 반환해서는 안된다는 것을 알면 <code>Debug.Assert()</code> 를 사용하여 가능한 빨리 중단 할 수 있습니다.
ru: Если во время разработки вы знаете, что метод может, но никогда не должен возвращать <code>Debug.Assert()</code> , вы можете использовать Debug.Assert () для прерывания как можно скорее, когда это произойдет:
zh_cn: 当您在开发过程中知道某个方法可以但不能返回 <code>null</code> 时 ，可以使用 <code>Debug.Assert()</code> 使其在出现时尽快中断：

source: When your <code>DataGridView</code> has <code>AllowUserToAddRows</code> as <code>True</code> (the default), the <code>Cells</code> in the blank/new row at the bottom will all contain <code>Nothing</code>. Most attempts to use the contents (for example, <code>ToString</code>) will result in an NRE.
es: Cuando su <code>DataGridView</code> tiene <code>AllowUserToAddRows</code> como <code>True</code> (el valor predeterminado), las <code>Cells</code> en la fila en blanco / nueva en la parte inferior no contendr&aacute;n <code>Nothing</code> . La mayor&iacute;a de los intentos de usar el contenido (por ejemplo, <code>ToString</code> ) dar&aacute; como resultado una NRE.
ja: <code>DataGridView</code> の <code>AllowUserToAddRows</code> が <code>True</code> （デフォルト）の場合、下部の空白/新しい行の <code>Cells</code> にはすべて <code>Nothing</code> が含まれます。 コンテンツ（たとえば、 <code>ToString</code> ）を使用しようとすると、ほとんどの場合NREになります。
ko: <code>DataGridView</code> 에 <code>AllowUserToAddRows</code> 가 <code>True</code> (기본값) 인 경우 맨 아래에있는 빈 / 새 행의 <code>Cells</code> 에는 모두 <code>Nothing</code> 이 포함됩니다. 대부분의 내용 (예 : <code>ToString</code> )을 사용하면 NRE가 발생합니다.
ru: Когда ваш <code>DataGridView</code> имеет значение <code>AllowUserToAddRows</code> как <code>True</code> (по умолчанию), <code>Cells</code> в пустой / новой строке внизу все будут содержать <code>Nothing</code> . Большинство попыток использовать содержимое (например, <code>ToString</code> ) приводит к NRE.
zh_cn: 当您的 <code>DataGridView</code> 的 <code>AllowUserToAddRows</code> 为 <code>True</code> （默认值）时，底部空白/新行中的 <code>Cells</code> 都将包含 <code>Nothing</code> 。 大多数尝试使用内容的尝试（例如 <code>ToString</code> ）将导致NRE。

source: While <em>what</em> causes a <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">NullReferenceExceptions</a> and approaches to <em>avoid/fix</em> such an exception have been addressed in other answers, what many programmers haven't learned yet is how to independently <em>debug</em> such exceptions during development.
es: Si bien <em>lo que</em> causa un <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">NullReferenceExceptions</a> y los enfoques para <em>evitar / corregir</em> dicha excepci&oacute;n se han abordado en otras respuestas, lo que muchos programadores a&uacute;n no han aprendido es c&oacute;mo <em>depurar de</em> forma independiente dichas excepciones durante el desarrollo.
ja: <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">NullReferenceExceptionsの</a>原因とそのような例外を<em>回避/修正</em>する<em>ための</em>アプローチは他の回答で扱われていますが、多くのプログラマがまだ学んでいないのは、開発中にそのような例外を個別に<em>デバッグ</em>する方法です。
ko: <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">NullReferenceExceptions을</a> 유발하는 원인과 그러한 예외를 <em>피 / 수정</em> 하는 접근법은 다른 답변에서 해결되었지만 많은 프로그래머가 아직 배우지 않은 것은 개발 중에 이러한 예외를 독립적으로 <em>디버깅</em> 하는 방법입니다.
ru: В <em>то</em> время <em>как</em> причины других <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">исключений NullReferenceException</a> и подходы, позволяющие <em>избежать / исправить</em> такое исключение, были рассмотрены в других ответах, многие программисты еще не узнали, как самостоятельно <em>отлаживать</em> такие исключения во время разработки.
zh_cn: 虽然导致<a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">NullReferenceExceptions的</a>原因以及<em>避免/修复</em>此类异常的方法已在其他答案中得到了解决，但是许多程序员尚未了解的是如何在开发过程中独立<em>调试</em>此类异常。

source: While the <code>new</code> keyword is used, it only creates a new instance of <code>Book</code>, but not a new instance of <code>Person</code>, so the <code>Author</code> the property is still <code>null</code>.
es: Mientras se usa la <code>new</code> palabra clave, solo crea una nueva instancia de <code>Book</code> , pero no una nueva instancia de <code>Person</code> a , por lo que el <code>Author</code> la propiedad a&uacute;n es <code>null</code> .
ja: <code>new</code> キーワードが使用されている間、作成されるのは <code>Book</code> の新しいインスタンスのみで、 <code>Person</code> の新しいインスタンスは作成されないため、 <code>Author</code> プロパティは <code>null</code> のままです。
ko: <code>new</code> 키워드가 사용되는 동안 <code>Book</code> 의 새 인스턴스 만 작성되지만 <code>Person</code> 의 새 인스턴스는 작성되지 않으므로 <code>Author</code> 속성은 여전히 <code>null</code> 입니다.
ru: Пока используется <code>new</code> ключевое слово, оно создает только новый экземпляр <code>Book</code> , но не новый экземпляр <code>Person</code> , поэтому свойство <code>Author</code> по-прежнему имеет значение <code>null</code> .
zh_cn: 使用 <code>new</code> 关键字时，它仅创建 <code>Book</code> 的新实例，而不创建 <code>Person</code> 的新实例，因此 <code>Author</code> 属性仍然为 <code>null</code> 。

source: Why does this make sense? Well, suppose we have a struct containing two ints, and an unmanaged pointer equal to null. If we attempt to dereference the second int in the struct, the <code>CLR</code> will not attempt to access the storage at location zero; it will access the storage at location four. But logically this is a null dereference because we are getting to that address <em>via</em> the null.
es: &iquest;Por qu&eacute; esto tiene sentido? Bueno, supongamos que tenemos una estructura que contiene dos entradas y un puntero no administrado igual a nulo. Si intentamos desreferenciar el segundo int en la estructura, el <code>CLR</code> no intentar&aacute; acceder al almacenamiento en la ubicaci&oacute;n cero; acceder&aacute; al almacenamiento en la ubicaci&oacute;n cuatro. Pero l&oacute;gicamente, esta es una anulaci&oacute;n de referencia nula porque estamos llegando a esa direcci&oacute;n a <em>trav&eacute;s de</em> la nula.
ja: これはなぜ意味があるのですか？ 2つの整数を含む構造体と、nullに等しいアンマネージポインターがあるとします。 構造体の2番目のintを逆参照しようとした場合、 <code>CLR</code> は位置0のストレージにアクセスしようとしません。 ロケーション4のストレージにアクセスします。 しかし、論理的にはnull <em>経由で</em>そのアドレスに到達しているため、これはnull逆参照です。
ko: 왜 이것이 의미가 있습니까? 두 개의 int를 포함하는 구조체와 null과 같은 관리되지 않는 포인터가 있다고 가정 해보십시오. 구조체에서 두 번째 int를 역 참조하려고하면 <code>CLR</code> 은 위치 0에서 저장소에 액세스하려고 시도하지 않습니다. 위치 4의 스토리지에 액세스합니다. 그러나 논리적으로 이것은 null을 <em>통해</em> 해당 주소에 도달하기 때문에 null 역 참조입니다.
ru: Почему это имеет смысл? Хорошо, предположим, у нас есть структура, содержащая два целых числа и неуправляемый указатель, равный нулю. Если мы попытаемся разыменовать второе int в структуре, <code>CLR</code> не будет пытаться получить доступ к хранилищу в нулевом местоположении; он получит доступ к хранилищу в расположении четыре. Но логически это нулевая разыменование, потому что мы получаем по этому адресу <em>через</em> нуль.
zh_cn: 为什么这有意义？ 好吧，假设我们有一个包含两个int的结构，以及一个等于null的非托管指针。 如果我们尝试取消引用结构中的第二个int， <code>CLR</code> 将不会尝试访问零位置的存储； 它将访问第四位置的存储。 但是从逻辑上讲，这是一个空取消引用，因为我们要<em>通过</em>空到达该地址。

source: Why is this wrong? Because the iterator block does not actually <em>run</em> until the <code>foreach</code>! The call to <code>GetFrobs</code> simply returns an object which <em>when iterated</em> will run the iterator block.
es: &iquest;Por qu&eacute; est&aacute; mal esto? &iexcl;Porque el bloque iterador no se <em>ejecuta</em> hasta el <code>foreach</code> ! La llamada a <code>GetFrobs</code> simplemente devuelve un objeto que, <em>cuando se itera</em> , ejecutar&aacute; el bloque iterador.
ja: なぜこれが間違っているのですか？ イテレータブロックは、実際には <code>foreach</code> まで<em>実行さ</em>れないためです。 <code>GetFrobs</code> の呼び出しは、 <em>反復される</em>と反復子ブロックを実行するオブジェクトを返すだけです。
ko: 왜 이것이 잘못 되었습니까? 반복자 블록은 실제로 <code>foreach</code> ! <code>GetFrobs</code> 에 대한 호출은 단순히 <em>반복</em> 될 <em>때</em> 반복자 블록을 실행할 개체를 반환합니다.
ru: Почему это не так? Потому что блок итератора фактически не <em>работает</em> до <code>foreach</code> ! Вызов <code>GetFrobs</code> просто возвращает объект, который <em>при повторении</em> запускает блок итератора.
zh_cn: 为什么会这样呢？ 因为迭代器块直到 <code>foreach</code> 才实际<em>运行</em> ！ 对 <code>GetFrobs</code> 的调用仅返回一个对象，该对象<em>在进行迭代时</em>将运行迭代器块。

source: Why it occurs?
es: ¿Por qué ocurre?
ja: なぜ発生するのか?
ko: 왜 발생합니까?
ru: Почему это происходит?
zh_cn: 为什么会出现这种情况?

source: Working with databases presents many opportunities for a NullReference because there can be many objects (<code>Command</code>, <code>Connection</code>, <code>Transaction</code>, <code>Dataset</code>, <code>DataTable</code>, <code>DataRows</code>....) in use at once. <strong>Note:</strong> It does not matter which data provider you are using -- MySQL, SQL Server, OleDB, etc. -- the <em>concepts</em> are the same.
es: Trabajar con bases de datos presenta muchas oportunidades para una referencia nula porque puede haber muchos objetos ( <code>Command</code> , <code>Connection</code> , <code>Transaction</code> , <code>Dataset</code> , <code>DataRows</code> datos , filas de datos ...) en uso a la vez. <strong>Nota:</strong> No importa qu&eacute; proveedor de datos est&eacute; utilizando (MySQL, SQL Server, OleDB, etc.), los <em>conceptos</em> son los mismos.
ja: 一度に多数のオブジェクト（ <code>Command</code> 、 <code>Connection</code> 、 <code>Transaction</code> 、 <code>Dataset</code> 、 <code>DataTable</code> 、 <code>DataRows</code> ....）を使用できるため、データベースを操作すると、NullReferenceの多くの機会がもたらされます。 <strong>注：</strong> MySQL、SQL Server、OleDBなど、使用しているデータプロバイダーは関係ありません。 <em>概念</em>は同じです。
ko: 데이터베이스를 사용하면 한 번에 많은 오브젝트 ( <code>Command</code> , <code>Connection</code> , <code>Transaction</code> , <code>Dataset</code> , <code>DataTable</code> , <code>DataRows</code> ....)가 사용될 수 있으므로 NullReference에 많은 기회가 제공됩니다. <strong>참고 :</strong> MySQL, SQL Server, OleDB 등 어떤 데이터 공급자를 사용하든 <em>개념</em> 은 동일하지 않습니다.
ru: Работа с базами данных предоставляет множество возможностей для NullReference, поскольку одновременно может использоваться много объектов ( <code>Command</code> , <code>Connection</code> , <code>Transaction</code> , <code>Dataset</code> , <code>DataTable</code> , <code>DataRows</code> ....). <strong>Примечание.</strong> Неважно, какой поставщик данных вы используете - MySQL, SQL Server, OleDB и т. Д. - <em>концепции</em> совпадают.
zh_cn: 使用数据库为NullReference提供了很多机会，因为可以同时使用许多对象（ <code>Command</code> ， <code>Connection</code> ， <code>Transaction</code> ， <code>Dataset</code> ， <code>DataTable</code> ， <code>DataRows</code> ....）。 <strong>注意：</strong>使用哪个数据提供程序（MySQL，SQL Server，OleDB等）无关紧要， <em>概念</em>是相同的。

source: You are trying to access an object that isn't created or currently not in memory.
es: Está tratando de acceder a un objeto que no está creado o que actualmente no está en la memoria.
ja: 作成されていない、または現在メモリにないオブジェクトにアクセスしようとしています。
ko: 작성되지 않았거나 현재 메모리에없는 오브젝트에 액세스하려고합니다.
ru: Вы пытаетесь получить доступ к объекту,который не создан или в данный момент не находится в памяти.
zh_cn: 您正在尝试访问一个未创建或当前不在内存中的对象。
