Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The rest of this article goes into more detail and shows mistakes that many programmers often make which can lead to a <code>NullReferenceException</code>.
es: El resto de este art&iacute;culo entra en m&aacute;s detalles y muestra errores que muchos programadores suelen cometer que pueden conducir a una <code>NullReferenceException</code> .
ja: この記事の残りの部分では、より詳細に説明し、多くのプログラマーがよく犯す <code>NullReferenceException</code> につながる可能性のある間違いを示します。
ko: 이 기사의 나머지 부분은 더 자세히 설명하고 많은 프로그래머가 종종 <code>NullReferenceException</code> 을 일으킬 수있는 실수를 보여줍니다.
ru: В остальной части этой статьи более подробно рассматриваются ошибки, которые часто допускают многие программисты, что может привести к <code>NullReferenceException</code> .
zh_cn: 本文的其余部分将更详细地介绍并显示许多程序员经常犯的错误，这些错误可能导致 <code>NullReferenceException</code> 。

source: The result is that the name will be null when p is null or when p.Spouse is null.
es: El resultado es que el nombre será nulo cuando p es nulo o cuando p.Cónyuge es nulo.
ja: その結果、pがnullの場合は名前がnullになり、p.Spouseがnullの場合は名前がnullになります。
ko: 결과는 p가 null이거나 p.Spouse가 null 일 때 이름이 null이됩니다.
ru: В результате имя будет нулевым,когда p будет нулевым или когда p.Spouse будет нулевым.
zh_cn: 其结果是,当p为空或p.Spouse为空时,名字将为空。

source: The same applies to nested object initializers:
es: Lo mismo se aplica a los inicializadores de objetos anidados:
ja: 入れ子になったオブジェクトのイニシャライザも同様です。
ko: 중첩 객체 이니셜 라이저에도 동일하게 적용됩니다.
ru: То же самое относится и к инициализаторам вложенных объектов:
zh_cn: 嵌套对象的初始化器也是如此。

source: The shorthand to providing a default value when a <code>null</code> is encountered:
es: La forma abreviada de proporcionar un valor predeterminado cuando se encuentra un valor <code>null</code> :
ja: <code>null</code> が発生したときにデフォルト値を提供するための省略表現：
ko: <code>null</code> 이 발생했을 때 기본값을 제공하는 속기 :
ru: Сокращение для предоставления значения по умолчанию, когда встречается <code>null</code> :
zh_cn: 遇到 <code>null</code> 时提供默认值的简写：

source: Then either <a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>Start with Debugging (F5)</em></a> or <a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>Attach [the VS Debugger] to Running Process</em></a>. On occasion it may be useful to use <a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"><code>Debugger.Break</code></a>, which will prompt to launch the debugger.
es: Luego, <a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>comience con la depuraci&oacute;n (F5)</em></a> o <a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>adjunte [el depurador VS] al proceso en ejecuci&oacute;n</em></a> . En ocasiones puede ser &uacute;til usar <a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"> <code>Debugger.Break</code> </a> , que le pedir&aacute; que inicie el depurador.
ja: 次に<a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>、デバッグから開始（F5）</em></a>または<a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>[VSデバッガ]を実行中のプロセスにアタッチし</em></a>ます。 <a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"> <code>Debugger.Break</code> </a>起動を促すDebugger.Breakを使用すると便利な場合があります。
ko: 그런 다음 <a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>디버깅 시작 (F5)</em></a> 또는 <a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>[VS 디버거]를 실행중인 프로세스에 연결하십시오</em></a> . 때때로 <a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"> <code>Debugger.Break</code> </a> 을 사용하는 것이 유용 할 수 있는데, 이는 디버거를 시작하라는 프롬프트를 표시합니다.
ru: Затем либо <a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>начните с отладки (F5),</em></a> либо <a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>присоедините [отладчик VS] к запущенному процессу</em></a> . Иногда может быть полезно использовать <a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"> <code>Debugger.Break</code> </a> , который предложит запустить отладчик.
zh_cn: 然后， <a href="https://blogs.msdn.microsoft.com/zainnab/2010/11/01/start-debugging-vs-start-without-debugging/"><em>从调试（F5）开始</em></a>或<a href="https://msdn.microsoft.com/en-us/library/3s68z0b3.aspx"><em>将[VS调试器]附加到正在运行的进程</em></a> 。 有时使用<a href="https://msdn.microsoft.com/en-us/library/system.diagnostics.debugger.break(v=vs.110).aspx"> <code>Debugger.Break</code> </a>可能会有用，它将提示启动调试器。

source: Then following code will throw a NullReferenceException when you call context.SaveChanges()
es: El siguiente código arrojará una excepción de referencia nula cuando llame a context.SaveChanges()
ja: そうすると、以下のコードは、context.SaveChanges()を呼び出すと NullReferenceException をスローします。
ko: 그런 다음 context를 호출하면 다음 코드에서 NullReferenceException이 발생합니다 .SaveChanges ()
ru: Затем следующий код бросит NullReferenceException при вызове context.SaveChanges().
zh_cn: 那么当你调用context.SaveChanges()时,以下代码会抛出一个NullReferenceException

source: Then go into your script and type <code>rb = GetComponent&lt;Rigidbody&gt;();</code>
es: Luego vaya a su script y escriba <code>rb = GetComponent&lt;Rigidbody&gt;();</code>
ja: 次に、スクリプトに移動して、 <code>rb = GetComponent&lt;Rigidbody&gt;();</code> と入力します。
ko: 그런 다음 스크립트로 이동하여 <code>rb = GetComponent&lt;Rigidbody&gt;();</code>
ru: Затем войдите в свой скрипт и введите <code>rb = GetComponent&lt;Rigidbody&gt;();</code>
zh_cn: 然后进入您的脚本并输入 <code>rb = GetComponent&lt;Rigidbody&gt;();</code>

source: There are also several libraries that can help. "Resharper" for example can provide you with warnings while you are writing code, especially if you use their attribute: <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>
es: Tambi&eacute;n hay varias bibliotecas que pueden ayudar. "Resharper", por ejemplo, puede proporcionarle advertencias mientras escribe c&oacute;digo, especialmente si usa su atributo: <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>
ja: 役立つライブラリもいくつかあります。 たとえば、 "Resharper"は、コードを記述しているときに、特にその属性を使用する場合に警告を表示します： <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>
ko: 도움을 줄 수있는 여러 라이브러리도 있습니다. 예를 들어 "Resharper"는 코드를 작성하는 동안, 특히 해당 속성을 사용하는 경우 경고를 제공 할 수 있습니다. <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>
ru: Есть также несколько библиотек, которые могут помочь. Например, &laquo;Resharper&raquo; может выдавать вам предупреждения во время написания кода, особенно если вы используете их атрибут: <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>
zh_cn: 也有几个库可以提供帮助。 例如，&ldquo; Resharper&rdquo;可以在编写代码时向您提供警告，尤其是在使用其属性的情况下： <a href="https://www.jetbrains.com/resharper/help/Reference__Code_Annotation_Attributes.html#NotNullAttribute">NotNullAttribute</a>

source: There are many good answers already here. You can also check more detailed description with examples on my <a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">blog</a>.
es: Ya hay muchas buenas respuestas aqu&iacute;. Tambi&eacute;n puede consultar una descripci&oacute;n m&aacute;s detallada con ejemplos en mi <a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">blog</a> .
ja: ここにはすでに多くの良い答えがあります。 また、私の<a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">ブログ</a>で例を使用して詳細な説明を確認することもできます。
ko: 이미 많은 좋은 답변이 있습니다. 내 <a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">블로그의</a> 예제를 통해 더 자세한 설명을 확인할 수도 있습니다.
ru: Здесь уже есть много хороших ответов. Вы также можете проверить более подробное описание с примерами в моем <a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">блоге</a> .
zh_cn: 这里已经有很多好的答案。 您还可以在我的<a href="https://www.mistercode.net/2017/07/09/object-reference-not-set-to-an-instance-of-an-object/">博客</a>上查看带有示例的更详细的描述。

source: There are various ways and methods to avoid this renowned exception:
es: Hay varias maneras y métodos para evitar esta renombrada excepción:
ja: この有名な例外を避けるためには、様々な方法や方法があります。
ko: 이 예외를 피할 수있는 다양한 방법과 방법이 있습니다.
ru: Существуют различные способы и методы,чтобы избежать этого известного исключения:
zh_cn: 有各种方式和方法可以避免这个著名的特例。

source: There is a lot of good answers here explaining what a null reference is and how to debug it. But there is very little on how to prevent the issue or at least make it easier to catch.
es: Hay muchas buenas respuestas aquí que explican qué es una referencia nula y cómo depurarla.Pero hay muy poco sobre cómo prevenir el problema o al menos hacerlo más fácil de detectar.
ja: ここには、ヌル参照とは何か、そしてそれをデバッグする方法を説明する良い回答がたくさんあります。しかし、この問題を防ぐ方法や、少なくともキャッチしやすくする方法についてはほとんど書かれていません。
ko: 여기에는 null 참조가 무엇인지 그리고 그것을 디버깅하는 방법을 설명하는 좋은 답변이 많이 있습니다. 그러나이 문제를 방지하거나 최소한 쉽게 잡을 수있는 방법은 거의 없습니다.
ru: Здесь много хороших ответов,объясняющих,что такое нулевая ссылка и как ее отлаживать.Но очень мало говорится о том,как предотвратить проблему или,по крайней мере,сделать ее легче поймать.
zh_cn: 这里有很多很好的答案,解释了什么是空引用,以及如何调试它。但是关于如何防止问题的发生,或者至少让它更容易被抓住的问题却很少。

source: There is an extra comma in the SQL (after 'mailaddress') which results in an exception at <code>.ExecuteReader</code>. After the <code>Catch</code> does nothing, <code>Finally</code> tries to perform clean up, but since you cannot <code>Close</code> a null <code>DataReader</code> object, a brand new <code>NullReferenceException</code> results.
es: Hay una coma adicional en el SQL (despu&eacute;s de 'mailaddress') que da como resultado una excepci&oacute;n en <code>.ExecuteReader</code> . Despu&eacute;s de que <code>Catch</code> no haga nada, <code>Finally</code> intenta realizar la limpieza, pero como no puede <code>Close</code> un objeto <code>DataReader</code> nulo, se obtiene una nueva <code>NullReferenceException</code> .
ja: SQLの余分なコンマ（ 'mailaddress'の後）があり、 <code>.ExecuteReader</code> で例外が発生します 。 <code>Catch</code> が何もしない場合、 <code>Finally</code> クリーンアップを実行しようとしますが、null <code>DataReader</code> オブジェクトを <code>Close</code> ことができないため、新しい <code>NullReferenceException</code> が発生します。
ko: SQL에 여분의 쉼표가 있으며 ( 'mailaddress'뒤에) <code>.ExecuteReader</code> 에서 예외가 발생합니다. <code>Catch</code> 가 아무 작업도 수행하지 않으면 <code>Finally</code> 정리를 수행하려고하지만 null <code>DataReader</code> 개체를 <code>Close</code> 수 없으므로 새로운 <code>NullReferenceException</code> 이 발생합니다.
ru: В SQL есть дополнительная запятая (после 'mailaddress'), что приводит к исключению в <code>.ExecuteReader</code> . После того, как <code>Catch</code> ничего не делает, <code>Finally</code> пытается выполнить очистку, но, поскольку вы не можете <code>Close</code> нулевой объект <code>DataReader</code> , возникает совершенно новое <code>NullReferenceException</code> .
zh_cn: SQL中有一个多余的逗号（在'mailaddress'之后），导致 <code>.ExecuteReader</code> 处出现异常。 在 <code>Catch</code> 不执行任何操作之后， <code>Finally</code> 尝试执行清除操作，但是由于您无法 <code>Close</code> null的 <code>DataReader</code> 对象，因此会产生全新的 <code>NullReferenceException</code> 。

source: There's "Microsoft Code Contracts" where you use syntax like <code>Contract.Requires(obj != null)</code> which gives you runtime and compile checking: <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">Introducing Code Contracts</a>.
es: Hay "Contratos de c&oacute;digo de Microsoft" donde usa una sintaxis como <code>Contract.Requires(obj != null)</code> que le brinda tiempo de ejecuci&oacute;n y verificaci&oacute;n de compilaci&oacute;n: <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">Introducci&oacute;n de contratos de c&oacute;digo</a> .
ja: 「Microsoft Code Contracts」があり、 <code>Contract.Requires(obj != null)</code> ような構文を使用して、ランタイムとコンパイルのチェックを行うことができます： <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">コードコントラクトの紹介</a> 。
ko: 런타임 및 컴파일 검사를 제공하는 <code>Contract.Requires(obj != null)</code> 와 같은 구문을 사용하는 "Microsoft Code Contracts"가 있습니다 : <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">Introducing Code Contracts</a> .
ru: Есть &laquo;Microsoft Code Contracts&raquo;, где вы используете синтаксис, такой как <code>Contract.Requires(obj != null)</code> который дает вам время выполнения и проверку компиляции: <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">Введение в Code Contracts</a> .
zh_cn: 在&ldquo; Microsoft代码合同&rdquo;中，您使用诸如 <code>Contract.Requires(obj != null)</code> 类的语法，该语法为您提供运行时和编译检查： <a href="http://www.codeproject.com/Articles/103779/Introducing-Code-Contracts">代码合同简介</a> 。

source: There's also "PostSharp" which will allow you to just use attributes like this:
es: También está el "PostSharp" que te permitirá usar atributos como este:
ja: こんな感じで属性だけでも使えるようになる「PostSharp」もあります。
ko: "PostSharp"도 있는데 다음과 같은 속성을 사용할 수 있습니다.
ru: Также есть "PostSharp",который позволит вам просто использовать такие атрибуты:
zh_cn: 还有一个 "PostSharp",可以让你直接使用这样的属性。

source: These cases arise because of the special rules the runtime uses when boxing <code>Nullable&lt;&gt;</code> instances.
es: Estos casos surgen debido a las reglas especiales que el tiempo de ejecuci&oacute;n usa cuando se encajonan instancias <code>Nullable&lt;&gt;</code> .
ja: これらのケースは、 <code>Nullable&lt;&gt;</code> インスタンスをボックス化するときにランタイムが使用する特別なルールが原因で発生します。
ko: 이러한 경우는 <code>Nullable&lt;&gt;</code> 인스턴스를 상자에 넣을 때 런타임에서 사용하는 특수 규칙으로 인해 발생합니다.
ru: Эти случаи возникают из-за специальных правил, которые среда выполнения использует при <code>Nullable&lt;&gt;</code> экземпляров Nullable &lt;&gt; .
zh_cn: 这些情况的出现是由于运行时在对 <code>Nullable&lt;&gt;</code> 实例进行装箱时使用的特殊规则。

source: These should be easy to find now that you know what you are looking for:
es: Estos deberían ser fáciles de encontrar ahora que sabes lo que estás buscando:
ja: これらは、あなたが探しているものを知っている今、簡単に見つけることができるはずです。
ko: 당신이 찾고있는 것을 알았으므로 이제 쉽게 찾을 수 있습니다.
ru: Их должно быть легко найти теперь,когда ты знаешь,что ищешь:
zh_cn: 这些应该很容易找到,现在你知道你要找什么了。

source: This answer will use Visual Basic terms, syntax, and context. The examples used come from a large number of past Stack&nbsp; Overflow questions. This is to maximize relevance by using the <em>kinds</em> of situations often seen in posts. A bit more explanation is also provided for those who might need it. An example similar to yours is <em>very</em> likely listed here.
es: Esta respuesta usar&aacute; t&eacute;rminos, sintaxis y contexto de Visual Basic. Los ejemplos utilizados provienen de una gran cantidad de preguntas anteriores de Stack Overflow. Esto es para maximizar la relevancia mediante el uso de los <em>tipos</em> de situaciones que a menudo se ven en las publicaciones. Tambi&eacute;n se proporciona un poco m&aacute;s de explicaci&oacute;n para aquellos que lo necesiten. Un ejemplo similar al suyo es <em>muy</em> probable que aparezca aqu&iacute;.
ja: この回答では、Visual Basicの用語、構文、およびコンテキストを使用します。 使用されている例は、過去のスタックオーバーフローに関する多数の質問に基づいています。 これは、投稿でよく見られる状況を使用して関連性を最大化するためです。 それを必要とするかもしれない人々のために、もう少し説明が提供されます。 あなたに似た例がおそらくここにリストされています。
ko: 이 답변은 Visual Basic 용어, 구문 및 컨텍스트를 사용합니다. 사용 된 예제는 과거의 많은 스택 오버플로 질문에서 비롯된 것입니다. 게시물에서 자주 볼 수있는 상황을 사용하여 관련성을 극대화합니다. 그것을 필요로하는 사람들을 위해 조금 더 설명이 제공됩니다. 귀하와 유사한 예가 여기에 나열되어있을 가능성이 큽니다.
ru: В этом ответе будут использоваться термины, синтаксис и контекст Visual Basic. Используемые примеры взяты из большого количества прошлых вопросов о переполнении стека. Это делается для максимизации релевантности с помощью ситуаций, часто встречающихся в сообщениях. Немного больше объяснений также предоставляется тем, кому это может понадобиться. Пример, похожий на ваш, <em>очень</em> вероятно, приведен здесь.
zh_cn: 该答案将使用Visual Basic术语，语法和上下文。 使用的示例来自大量过去的Stack Overflow问题。 这是通过使用帖子中经常出现的<em>各种</em>情况来最大化相关性。 还为可能需要的人提供了更多解释。 此处<em>很</em>可能列出与您类似的示例。

source: This array has only been declared, not created. There are several ways to initialize an array:
es: Esta matriz sólo ha sido declarada,no creada.Hay varias maneras de inicializar una matriz:
ja: この配列は宣言されているだけで、作成されていません。配列を初期化する方法はいくつかあります。
ko: 이 배열은 선언되지 않았으며 생성되지 않았습니다. 배열을 초기화하는 방법에는 여러 가지가 있습니다.
ru: Этот массив только был объявлен,а не создан.Существует несколько способов инициализации массива:
zh_cn: 这个数组只被声明了,没有创建。有几种方法可以初始化一个数组。

source: This can be solved by following the convention to prefix fields with an underscore:
es: Esto puede resolverse siguiendo la convención de prefijar los campos con un guión bajo:
ja: これは、フィールドの前にアンダースコアを付ける慣習に従うことで解決できます。
ko: 필드에 밑줄을 붙이는 규칙에 따라 해결할 수 있습니다.
ru: Это можно решить,следуя конвенции,чтобы префиксные поля с подчеркиванием:
zh_cn: 这个问题可以按照惯例用下划线作为字段的前缀来解决。

source: This doesn't throw an <code>InvalidCastException</code> but returns a <code>null</code> when the cast fails (and when <code>someObject</code> is itself null). So be aware of that.
es: Esto no arroja una <code>InvalidCastException</code> sino que devuelve un <code>null</code> cuando falla la <code>someObject</code> (y cuando someObject es nulo). As&iacute; que ten cuidado con eso.
ja: これは <code>InvalidCastException</code> をスローしませんが、キャストが失敗した場合（および <code>someObject</code> 自体がnullの場合）は <code>null</code> を返します。 ですので注意してください。
ko: 이것은 <code>InvalidCastException</code> 을 발생 시키지 않지만 캐스트가 실패 할 때 (그리고 <code>someObject</code> 자체가 null 일 경우) <code>null</code> 을 반환합니다. 그러니 알아 두십시오.
ru: Это не <code>InvalidCastException</code> но возвращает ноль, когда приведение завершается неудачно (и когда <code>someObject</code> сам по себе является нулем). Так что знайте об этом.
zh_cn: 这不会引发 <code>InvalidCastException</code> ,而是在强制转换失败时（并且 <code>someObject</code> 本身为null）返回null。 因此请注意。

source: This is a case of an object not being created as expected, but also demonstrates the counter usefulness of an empty <code>Catch</code>.
es: Este es un caso de un objeto que no se crea como se esperaba, pero tambi&eacute;n demuestra la utilidad del contador de un <code>Catch</code> vac&iacute;o.
ja: これは、オブジェクトが期待どおりに作成されない場合ですが、空の <code>Catch</code> のカウンターの有用性も示しています。
ko: 이것은 예상대로 객체가 생성되지 않는 경우이지만 빈 <code>Catch</code> 의 카운터 유용성을 보여줍니다.
ru: Это случай, когда объект создается не так, как ожидалось, но также демонстрирует полезность счетчика пустого <code>Catch</code> .
zh_cn: 这是一种未按预期方式创建对象的情况，但也证明了空 <code>Catch</code> 的反作用。

source: This is a case where the IDE will warn you that '<em>not all paths return a value and a <code>NullReferenceException</code> may result</em>'. You can suppress the warning, by replacing <code>Exit Function</code> with <code>Return Nothing</code>, but that does not solve the problem. Anything which tries to use the return when <code>someCondition = False</code> will result in an NRE:
es: Este es un caso en el que el IDE le advertir&aacute; que " <em>no todas las rutas devuelven un valor y puede producirse una <code>NullReferenceException</code> </em> ". Puede suprimir la advertencia, reemplazando <code>Exit Function</code> con <code>Return Nothing</code> , pero eso no resuelve el problema. Cualquier cosa que intente usar el retorno cuando <code>someCondition = False</code> dar&aacute; como resultado una NRE:
ja: これは、IDEが「 <em>すべてのパスが値を返すわけではなく、 <code>NullReferenceException</code> が発生する可能性</em>がある」と警告する場合です。 <code>Exit Function</code> を <code>Return Nothing</code> に置き換えることで警告を抑制できますが、それでも問題は解決しません。 <code>someCondition = False</code> ときにreturnを使用しようとすると、NREになります。
ko: IDE가 ' <em>모든 경로가 값을 반환하는 것은 아니며 <code>NullReferenceException</code> 이 발생할 수 있습니다</em> '라고 경고하는 경우입니다. <code>Exit Function</code> 을 <code>Return Nothing</code> 으로 바꾸면 경고가 나타나지 않지만 문제가 해결되지는 않습니다. <code>someCondition = False</code> 때 리턴 값을 사용하려고하면 NRE가됩니다.
ru: Это тот случай, когда IDE предупредит вас, что &laquo; <em>не все пути возвращают значение, и может возникнуть <code>NullReferenceException</code> </em> &raquo;. Вы можете отключить предупреждение, заменив <code>Exit Function</code> на <code>Return Nothing</code> , но это не решит проблему. Все, что пытается использовать возврат, когда <code>someCondition = False</code> приведет к NRE:
zh_cn: 在这种情况下，IDE会警告您&ldquo; <em>并非所有路径都返回值，并且可能会导致 <code>NullReferenceException</code> </em> &rdquo;。 您可以通过将 <code>Exit Function</code> 替换为 <code>Return Nothing</code> 来取消警告，但这不能解决问题。 当 <code>someCondition = False</code> 时，任何尝试使用返回值的东西都将导致NRE：

source: This is a fairly common way to get an NRE. In C#, depending on how it is coded, the IDE will report that <code>Controls</code> does not exist in the current context, or "cannot reference non-static member". So, to some extent, this is a VB-only situation. It is also complex because it can result in a failure cascade.
es: Esta es una forma bastante com&uacute;n de obtener una NRE. En C #, dependiendo de c&oacute;mo est&eacute; codificado, el IDE informar&aacute; que los <code>Controls</code> no existen en el contexto actual o que "no pueden hacer referencia a miembros no est&aacute;ticos". Entonces, hasta cierto punto, esta es una situaci&oacute;n de solo VB. Tambi&eacute;n es complejo porque puede provocar una cascada de fallas.
ja: これは、NREを取得するためのかなり一般的な方法です。 C＃では、コーディング方法に応じて、IDEは現在のコンテキストに <code>Controls</code> が存在しない、または「非静的メンバーを参照できない」ことを報告します。 したがって、ある程度、これはVBのみの状況です。 また、カスケードが失敗する可能性があるため、複雑です。
ko: 이것은 NRE를 얻는 매우 일반적인 방법입니다. C #에서는 코딩 방법에 따라 IDE가 현재 컨텍스트에 <code>Controls</code> 이 없거나 "정적이 아닌 멤버를 참조 할 수 없음"을보고합니다. 따라서 어느 정도 VB 전용 상황입니다. 또한 캐스케이드 오류가 발생할 수 있으므로 복잡합니다.
ru: Это довольно распространенный способ получить NRE. В C #, в зависимости от того, как это закодировано, IDE сообщит, что <code>Controls</code> не существует в текущем контексте, или &laquo;не может ссылаться на нестатический член&raquo;. Так что, в некоторой степени, это ситуация только для VB. Это также сложно, потому что это может привести к каскаду сбоев.
zh_cn: 这是获得NRE的相当普遍的方法。 在C＃中，根据其编码方式，IDE将报告 <code>Controls</code> 在当前上下文中不存在，或&ldquo;无法引用非静态成员&rdquo;。 因此，在某种程度上，这是仅VB的情况。 它也很复杂，因为它可能导致失败的级联。

source: This is also sometimes called the safe navigation or Elvis (after its shape) operator. If the expression on the left side of the operator is null, then the right side will not be evaluated, and null is returned instead. That means cases like this:
es: A veces también se le llama el operador de navegación segura o Elvis (por su forma).Si la expresión en el lado izquierdo del operador es nula,entonces el lado derecho no será evaluado,y en su lugar se devuelve nulo.Eso significa casos como este:
ja: これは、安全なナビゲーションやエルビス(その形状にちなんだ)演算子と呼ばれることもあります。演算子の左側の式がnullの場合、右側の式は評価されず、代わりにnullが返されます。つまり、このようなケースです。
ko: 안전 탐색 또는 Elvis (모양 이후) 연산자라고도합니다. 연산자의 왼쪽에있는 표현식이 널이면 오른쪽이 평가되지 않고 대신 널이 리턴됩니다. 이는 다음과 같은 경우를 의미합니다.
ru: Это также иногда называется безопасной навигацией или оператором Elvis (по форме).Если выражение с левой стороны оператора является нулевым,то правая сторона не будет вычисляться,а вместо нее будет возвращен ноль.Это означает такие случаи:
zh_cn: 这有时也被称为安全导航或Elvis(以其形状命名)算子。如果操作符左边的表达式为空,那么右边的表达式将不被执行,而是返回null。这意味着像这样的情况。
