Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Generic dictionaries in .NET are not thread-safe and they <em>sometimes</em> might throw a <code>NullReference</code> or even (more frequent) a <code>KeyNotFoundException</code> when you try to access a key from two concurrent threads. The exception is quite misleading in this case.
es: Los diccionarios gen&eacute;ricos en .NET no son seguros para subprocesos y a <em>veces</em> pueden arrojar una <code>NullReference</code> o incluso (m&aacute;s frecuente) una <code>KeyNotFoundException</code> cuando intenta acceder a una clave desde dos subprocesos simult&aacute;neos. La excepci&oacute;n es bastante enga&ntilde;osa en este caso.
ja: .NETのジェネリックディクショナリはスレッドセーフではなく、2つの同時スレッドからキーにアクセスしようとすると、 <code>NullReference</code> またはさらに（より頻繁に） <code>KeyNotFoundException</code> がスローされる場合があります。 この場合、例外はかなり誤解を招きます。
ko: .NET의 일반 사전은 스레드로부터 안전하지 않으며 두 개의 동시 스레드에서 키에 액세스하려고 할 때 <code>NullReference</code> 또는 더 빈번한 <code>KeyNotFoundException</code> 을 발생시킬 수 있습니다. 이 경우 예외는 오해의 소지가 있습니다.
ru: Общие словари в .NET не являются поточно- <code>NullReference</code> и <em>иногда</em> могут выдавать NullReference или даже (чаще) <code>KeyNotFoundException</code> при попытке получить доступ к ключу из двух параллельных потоков. Исключение весьма обманчиво в этом случае.
zh_cn: .NET中的通用词典不是线程安全的，当您尝试从两个并发线程访问键时，它们<em>有时</em>可能会抛出 <code>NullReference</code> 甚至是（更常见） <code>KeyNotFoundException</code> 。 在这种情况下，例外情况非常容易引起误解。

source: Here <code>comboBox1</code> is created before <code>label1</code>. If <code>comboBox1_SelectionChanged</code> attempts to reference `label1, it will not yet have been created.
es: Aqu&iacute; se crea <code>label1</code> antes de label1 . Si <code>comboBox1_SelectionChanged</code> intenta hacer referencia a `label1, a&uacute;n no se habr&aacute; creado.
ja: ここで、 <code>comboBox1</code> は <code>label1</code> の前に作成されます。 comboBox1_SelectionChangedが `label1を参照しようとした場合、まだ作成されていません。
ko: <code>comboBox1</code> 은 <code>label1</code> 이전에 작성됩니다. <code>comboBox1_SelectionChanged</code> 가`label1을 참조하려고 시도하면 아직 작성되지 않은 것입니다.
ru: Здесь <code>comboBox1</code> создается до <code>label1</code> . Если <code>comboBox1_SelectionChanged</code> попытается сослаться на `label1, он еще не будет создан.
zh_cn: 在这里， <code>comboBox1</code> 在 <code>label1</code> 之前创建。 如果 <code>comboBox1_SelectionChanged</code> 尝试引用`label1，则尚未创建。

source: Here, <code>Book</code> and <code>Car</code> are incompatible types; a <code>Car</code> cannot be converted/cast to a <code>Book</code>. When this cast fails, <code>as</code> returns <code>null</code>. Using <code>mybook</code> after this causes a <code>NullReferenceException</code>.
es: Aqu&iacute;, <code>Book</code> y <code>Car</code> son tipos incompatibles; un <code>Car</code> no puede convertirse / lanzarse en un <code>Book</code> . Cuando este lanzamiento falla, <code>as</code> devuelve <code>null</code> . Usar <code>mybook</code> despu&eacute;s de esto provoca una <code>NullReferenceException</code> .
ja: ここでは、 <code>Book</code> と <code>Car</code> は互換性のないタイプです。 <code>Car</code> を <code>Book</code> 変換/キャストすることはできません。 このキャストが失敗すると、 <code>as</code> は <code>null</code> を返します 。 この後に <code>mybook</code> を使用すると、 <code>NullReferenceException</code> が発生します。
ko: 여기서 <code>Book</code> 과 <code>Car</code> 는 호환되지 않는 유형입니다. <code>Car</code> 는 <code>Book</code> 으로 변환 / 전송할 수 없습니다. 이 캐스트가 실패하면 <code>as</code> 가 <code>null</code> 을 반환합니다. 이 후 <code>mybook</code> 을 사용하면 <code>NullReferenceException</code> 이 발생합니다.
ru: Здесь <code>Book</code> и <code>Car</code> являются несовместимыми типами; <code>Car</code> не может быть преобразован / брошен в <code>Book</code> . Когда это приведение не удается, <code>as</code> возвращает <code>null</code> . Использование <code>mybook</code> после этого вызывает <code>NullReferenceException</code> .
zh_cn: 在这里， <code>Book</code> 和 <code>Car</code> 是不兼容的类型； 不能将 <code>Car</code> 转换/铸造为 <code>Book</code> 。 如果此转换失败，则 <code>as</code> 返回 <code>null</code> 。 之后使用 <code>mybook</code> 会导致 <code>NullReferenceException</code> 。

source: Here, <code>SelectedDate</code> is in fact a property - of <code>DateTime</code> type - of the <code>Calendar</code> Web Control type, and the binding could perfectly return something null. The implicit ASP.NET Generator will create a piece of code that will be equivalent to the cast code above. And this will raise a <code>NullReferenceException</code> that is quite difficult to spot, because it lies in ASP.NET generated code which compiles fine...
es: Aqu&iacute;, <code>SelectedDate</code> es, de hecho, una propiedad, del tipo <code>DateTime</code> ,del tipo <code>Calendar</code> Web Control, y el enlace podr&iacute;a devolver perfectamente algo nulo. El Generador ASP.NET impl&iacute;cito crear&aacute; un fragmento de c&oacute;digo que ser&aacute; equivalente al c&oacute;digo de transmisi&oacute;n anterior. Y esto generar&aacute; una <code>NullReferenceException</code> que es bastante dif&iacute;cil de detectar, ya que se encuentra en el c&oacute;digo generado por ASP.NET que compila bien ...
ja: ここで、 <code>SelectedDate</code> は実際には <code>DateTime</code> タイプの <code>Calendar</code> Web Controlタイプのプロパティであり、バインディングは完全にnullを返す可能性があります。 暗黙のASP.NETジェネレーターは、上記のキャストコードと同等のコードを作成します。 そして、これはうまくコンパイルするASP.NET生成コードにあるため、見つけるのが非常に難しい <code>NullReferenceException</code> を発生させます...
ko: 여기서 <code>SelectedDate</code> 는 실제로 <code>Calendar</code> Web Control 유형의 속성 <code>DateTime</code> 유형의 속성이며 바인딩은 null을 완벽하게 반환 할 수 있습니다. 암시 적 ASP.NET 생성기는 위의 캐스트 코드와 동등한 코드를 만듭니다. 그리고 이것은 잘 컴파일되는 ASP.NET 생성 코드에 있기 때문에 발견하기 어려운 <code>NullReferenceException</code> 을 발생시킵니다 ...
ru: Здесь <code>SelectedDate</code> на самом деле является свойством - типа <code>DateTime</code> - типа веб-элемента управления <code>Calendar</code> , и привязка может совершенно вернуть что-то нулевое. Неявный ASP.NET Generator создаст фрагмент кода, который будет эквивалентен приведенному выше коду. И это вызовет <code>NullReferenceException</code> , которое довольно сложно обнаружить, поскольку оно находится в сгенерированном ASP.NET коде, который прекрасно компилируется ...
zh_cn: 在这里， <code>SelectedDate</code> 实际上是 <code>Calendar</code> Web Control类型的 <code>DateTime</code> 类型的属性，并且绑定可以完美地返回null。 隐式ASP.NET生成器将创建一段与上面的强制转换代码等效的代码。 这将引发一个 <code>NullReferenceException</code> ，这很难发现，因为它位于ASP.NET生成的代码中，可以很好地编译...

source: Here, <code>myWebBrowser</code> or <code>Document</code> could be Nothing or the <code>formfld1</code> element may not exist.
es: Aqu&iacute;, <code>myWebBrowser</code> o <code>Document</code> podr&iacute;a ser Nothing o el elemento <code>formfld1</code> puede no existir.
ja: ここで、 <code>myWebBrowser</code> または <code>Document</code> がNothingであるか、 <code>formfld1</code> 要素が存在しない可能性があります。
ko: 여기에서 <code>myWebBrowser</code> 또는 <code>Document</code> 가 Nothing이거나 <code>formfld1</code> 요소가 없을 수 있습니다.
ru: Здесь <code>myWebBrowser</code> или <code>Document</code> могут иметь значение Nothing или элемент <code>formfld1</code> может не существовать.
zh_cn: 在这里， <code>myWebBrowser</code> 或 <code>Document</code> 可能为Nothing或 <code>formfld1</code> 元素可能不存在。

source: Hope this helps too!
es: ¡Espero que esto también ayude!
ja: これも役立つことを願っています
ko: 이것이 도움이되기를 바랍니다!
ru: Надеюсь,это тоже поможет!
zh_cn: 希望这也能帮到你!

source: How can it be avoided?
es: ¿Cómo se puede evitar?
ja: どうすれば回避できるのでしょうか?
ko: 어떻게 피할 수 있습니까?
ru: Как этого можно избежать?
zh_cn: 怎样才能避免呢?

source: How do you find the source of a <code>NullReferenceException</code>? Apart from looking at the exception itself, which will be thrown exactly at the location where it occurs, the general rules of debugging in Visual Studio apply: place strategic breakpoints and <a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">inspect your variables</a>, either by hovering the mouse over their names, opening a (Quick)Watch window or using the various debugging panels like Locals and Autos.
es: &iquest;C&oacute;mo encuentra la fuente de una <code>NullReferenceException</code> ? Adem&aacute;s de mirar la excepci&oacute;n en s&iacute;, que se lanzar&aacute; exactamente en el lugar donde ocurre, se aplican las reglas generales de depuraci&oacute;n en Visual Studio: coloque puntos de interrupci&oacute;n estrat&eacute;gicos e <a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">inspeccione sus variables</a> , ya sea colocando el mouse sobre sus nombres, abriendo un ( R&aacute;pido) Mire la ventana o use los diversos paneles de depuraci&oacute;n como Locales y Autos.
ja: <code>NullReferenceException</code> のソースをどのように見つけますか？ 例外が発生した場所で正確にスローされる例外自体を見ることとは別に、Visual Studioでのデバッグの一般的なルールが適用されます：戦略的ブレークポイントを配置<a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">し、変数</a>を検査します。 Quick）Watchウィンドウ、またはLocalsやAutosなどのさまざまなデバッグパネルの使用。
ko: <code>NullReferenceException</code> 의 소스는 어떻게 찾습니까? 예외가 발생하는 위치에서 정확하게 발생하는 예외 자체를 보는 것 외에도 Visual Studio의 일반적인 디버깅 규칙이 적용됩니다. 전략적 중단 점을 배치하고 <a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">변수를</a> 이름 위에 마우스를 갖다 대면 ( 빨리보기) 또는 지역 및 자동차와 같은 다양한 디버깅 패널을 사용하십시오.
ru: Как вы находите источник <code>NullReferenceException</code> ? Помимо рассмотрения самого исключения, которое будет сгенерировано точно в том месте, где оно происходит, применяются общие правила отладки в Visual Studio: устанавливайте стратегические контрольные точки и <a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">проверяйте свои переменные</a> , наведя указатель мыши на их имена, открывая ( Быстро) Наблюдайте за окном или используя различные панели отладки, такие как Locals и Autos.
zh_cn: 您如何找到 <code>NullReferenceException</code> 的来源？ 除了查看将要引发的异常本身之外，Visual Studio中的调试一般规则也适用：放置战略断点并<a href="https://msdn.microsoft.com/en-us/library/esta7c62.aspx">检查变量</a> ，方法是将鼠标悬停在它们的名称上，然后打开（快速）监视窗口或使用各种调试面板（例如本地和自动）。

source: I have a different perspective to answering this. This sort of answers <strong>"what else can I do to avoid it?</strong>"
es: Tengo una perspectiva diferente para responder esto. Este tipo de respuestas <strong>"&iquest;qu&eacute; m&aacute;s puedo hacer para evitarlo?</strong> "
ja: 私はこれに答える別の視点を持っています。 この種の答えは<strong>「それを避けるために他に何ができるか？</strong> 」
ko: 나는 이것에 대답하는 데 다른 관점을 가지고 있습니다. 이런 종류의 대답은 <strong>"어떻게 피할 수 있습니까?</strong> "
ru: У меня другая точка зрения на ответ. Такого рода ответы <strong>"что еще я могу сделать, чтобы избежать этого?</strong> "
zh_cn: 我对此有不同的看法。 这种回答<strong>&ldquo;我还能做些什么来避免呢？</strong> &rdquo;

source: I have some code and when it executes, it throws a <code>NullReferenceException</code>, saying:
es: Tengo un c&oacute;digo y cuando se ejecuta, arroja una <code>NullReferenceException</code> , que dice:
ja: いくつかのコードがあり、実行すると <code>NullReferenceException</code> がスローされます。
ko: 코드가 있고 실행될 때 <code>NullReferenceException</code> 이 발생하여 다음 과 같이 말합니다.
ru: У меня есть некоторый код, и когда он выполняется, он <code>NullReferenceException</code> , говоря:
zh_cn: 我有一些代码，执行时会抛出 <code>NullReferenceException</code> ，说：

source: I was getting <code>Object reference not set to an instance of an object</code> when I tried to render a View within a View by sending it a Model, like this:
es: <code>Object reference not set to an instance of an object</code> cuando intent&eacute; representar una vista dentro de una vista envi&aacute;ndole un modelo, como este:
ja: 次のように、モデルを送信してビュー内にビューをレンダリングしようとしたときに <code>Object reference not set to an instance of an object</code> がオブジェクトのインスタンスに設定されていませんでした 。
ko: 다음과 같이 모델을 보내 뷰에서 뷰를 렌더링하려고 할 때 <code>Object reference not set to an instance of an object</code> 가 객체의 인스턴스로 설정되지 않았습니다 .
ru: Я получал <code>Object reference not set to an instance of an object</code> когда пытался отрисовать представление в представлении, отправив ему модель, например так:
zh_cn: 当我尝试通过向其发送模型来在视图中呈现视图时，我 <code>Object reference not set to an instance of an object</code> ，如下所示：

source: I'll be using a RigidBody variable as an example.
es: Usaré una variable de Cuerpo Rígido como ejemplo.
ja: 今回はRigidBodyの変数を例に挙げてみます。
ko: 예를 들어 RigidBody 변수를 사용하겠습니다.
ru: В качестве примера я буду использовать переменную RigidBody.
zh_cn: 我将用一个RigidBody变量作为例子。

source: If <code>dgvBooks</code> has <code>AutoGenerateColumns = True</code>, it will create the columns, but it does not name them, so the above code fails when it references them by name.
es: Si <code>dgvBooks</code> tiene <code>AutoGenerateColumns = True</code> , crear&aacute; las columnas, pero no las nombrar&aacute;, por lo que el c&oacute;digo anterior falla cuando hace referencia a ellas por nombre.
ja: <code>dgvBooks</code> に <code>AutoGenerateColumns = True</code> がある場合、列は作成されますが、名前は付けられないため、上記のコードは名前で参照すると失敗します。
ko: <code>dgvBooks</code> 에 <code>AutoGenerateColumns = True</code> 인 경우 열을 만들지 만 이름을 지정하지 않으므로 이름으로 참조 할 때 위의 코드가 실패합니다.
ru: Если <code>dgvBooks</code> имеет <code>AutoGenerateColumns = True</code> , он создает столбцы, но не называет их, поэтому приведенный выше код завершается ошибкой, когда ссылается на них по имени.
zh_cn: 如果 <code>dgvBooks</code> 的 <code>AutoGenerateColumns = True</code> ，它将创建列，但未命名列，因此当按名称引用它们时，上面的代码将失败。

source: If <code>whatever</code> results in <code>null</code> then <code>MakeFrob</code> will throw. Now, you might think that the right thing to do is this:
es: Si <code>whatever</code> resulte en <code>null</code> , <code>MakeFrob</code> lo lanzar&aacute;. Ahora, podr&iacute;a pensar que lo correcto es esto:
ja: 結果が <code>null</code> の場合、 <code>MakeFrob</code> がスローします。 今、あなたは正しいことはこれだと思うかもしれません：
ko: 결과가 <code>null</code> 이면 <code>MakeFrob</code> 가 발생합니다. 이제해야 할 일은 다음과 같습니다.
ru: Если <code>whatever</code> приведет к <code>null</code> то <code>MakeFrob</code> сгенерирует. Теперь вы можете подумать, что правильно сделать следующее:
zh_cn: 如果 <code>whatever</code> 结果为 <code>null</code> ,则 <code>MakeFrob</code> 将抛出。 现在，您可能会认为正确的做法是：

source: If a <code>CheckBox</code> with <code>chkName</code> can't be found (or exists in a <code>GroupBox</code>), then <code>chk</code> will be Nothing and be attempting to reference any property will result in an exception.
es: Si no se puede encontrar un <code>CheckBox</code> con <code>chkName</code> (o existe en un <code>GroupBox</code> ), entonces <code>chk</code> ser&aacute; Nothing e intentar hacer referencia a cualquier propiedad dar&aacute; como resultado una excepci&oacute;n.
ja: <code>chkName</code> を持つ <code>CheckBox</code> が見つからない（または <code>GroupBox</code> に存在する）場合、 <code>chk</code> はNothingになり、プロパティを参照しようとすると例外が発生します。
ko: <code>chkName</code> 을 가진 <code>CheckBox</code> 를 찾을 수 없거나 <code>GroupBox</code> 에있는 경우 <code>chk</code> 는 Nothing이되고 속성을 참조하려고하면 예외가 발생합니다.
ru: Если <code>CheckBox</code> с <code>chkName</code> не может быть найден (или существует в <code>GroupBox</code> ), то <code>chk</code> будет Nothing и попытка ссылки на какое-либо свойство приведет к исключению.
zh_cn: 如果找不到带有 <code>chkName</code> 的 <code>CheckBox</code> （或存在于 <code>GroupBox</code> 中 ），则 <code>chk</code> 将为Nothing，并且尝试引用任何属性都将导致异常。

source: If a <code>NullReferenceException</code> is thrown by <code>unsafe</code> code, you might look at your pointer variables, and check them for <code>IntPtr.Zero</code> or something. Which is the same thing ("null pointer exception"), but in unsafe code, variables are often cast to value-types/arrays, etc., and you bang your head against the wall, wondering how a value-type can throw this exception.
es: Si un c&oacute;digo <code>unsafe</code> <code>IntPtr.Zero</code> una excepci&oacute;n <code>NullReferenceException</code> , puede mirar sus variables de puntero y verificarlas para IntPtr.Zero o algo as&iacute;. Lo que es lo mismo ("excepci&oacute;n de puntero nulo"), pero en el c&oacute;digo inseguro, las variables a menudo se convierten en tipos / matrices de valores, etc., y te golpeas la cabeza contra la pared, pregunt&aacute;ndote c&oacute;mo un tipo de valor puede arrojar esto excepci&oacute;n.
ja: <code>unsafe</code> コードによって <code>NullReferenceException</code> がスローされた場合は、ポインタ変数を調べて、 <code>IntPtr.Zero</code> などが含まれていないか確認してください。 これは同じことですが（「nullポインタ例外」）、安全でないコードでは、変数が値の型/配列などにキャストされることが多く、壁に頭をぶつけて、値の型がこれをスローする方法を疑問に思います例外。
ko: <code>unsafe</code> 코드로 <code>NullReferenceException</code> 이 발생하면 포인터 변수를보고 <code>IntPtr.Zero</code> 등을 확인할 수 있습니다. 어느 것이 똑같지 만 ( "널 포인터 예외") 안전하지 않은 코드에서 변수는 종종 값 유형 / 배열 등으로 캐스트되고, 값 유형이 어떻게 이것을 던질 수 있는지 궁금해 벽에 머리를 부딪칩니다. 예외.
ru: Если <code>NullReferenceException</code> вызывается <code>unsafe</code> кодом, вы можете просмотреть переменные-указатели и проверить их на <code>IntPtr.Zero</code> или чего-либо еще. Это то же самое (&laquo;исключение нулевого указателя&raquo;), но в небезопасном коде переменные часто приводятся к типам значений / массивам и т. Д., И вы бьетесь головой о стену, задаваясь вопросом, как тип значения может бросить это исключение.
zh_cn: 如果 <code>unsafe</code> 代码引发了 <code>NullReferenceException</code> ,则可能会查看指针变量，并检查它们的 <code>IntPtr.Zero</code> 或其他内容。 这是同一回事（&ldquo;空指针异常&rdquo;），但是在不安全的代码中，变量通常被转换为值类型/数组等，然后您将头撞墙，想知道值类型如何抛出该值例外。

source: If it is caused on some <strong>database</strong> commands because the object isn't present then all you need to do is do a null check and handle it:
es: Si se produce en algunos comandos de la <strong>base de datos</strong> porque el objeto no est&aacute; presente, entonces todo lo que necesita hacer es hacer una verificaci&oacute;n nula y manejarlo:
ja: オブジェクトが存在しないために一部の<strong>データベース</strong>コマンドで発生した場合は、nullチェックを実行してそれを処理するだけです。
ko: 오브젝트가 없기 때문에 일부 <strong>데이터베이스</strong> 명령에서 발생하는 경우 널 점검을 수행하고 처리하기 만하면됩니다.
ru: Если это вызвано в некоторых командах <strong>базы данных,</strong> потому что объект не присутствует, тогда все, что вам нужно сделать, это сделать нулевую проверку и обработать ее:
zh_cn: 如果它是由于不存在该对象而在某些<strong>数据库</strong>命令上引起的，那么您所需要做的就是进行空检查并处理它：

source: If one is getting this message during saving or compiling the build, just close all the files and then open any file to compile and save.
es: Si uno recibe este mensaje durante el guardado o la compilación de la construcción,simplemente cierre todos los archivos y luego abra cualquier archivo para compilar y guardar.
ja: ビルドの保存やコンパイル中にこのメッセージが表示された場合は、すべてのファイルを閉じてから、任意のファイルを開いてコンパイルして保存してください。
ko: 빌드를 저장하거나 컴파일하는 동안이 메시지가 표시되면 모든 파일을 닫은 다음 파일을 열어 컴파일하고 저장하십시오.
ru: Если кто-то получает это сообщение во время сохранения или компиляции сборки,просто закройте все файлы,а затем откройте любой файл для компиляции и сохранения.
zh_cn: 如果在保存或编译过程中收到这个消息,只需关闭所有文件,然后打开任意文件进行编译保存即可。

source: If ref1 or ref2 or ref3 is null, then you'll get a <code>NullReferenceException</code>. If you want to solve the problem, then find out which one is null by rewriting the expression to its simpler equivalent:
es: Si ref1 o ref2 o ref3 es nulo, obtendr&aacute; una <code>NullReferenceException</code> . Si desea resolver el problema, descubra cu&aacute;l es nulo reescribiendo la expresi&oacute;n a su equivalente m&aacute;s simple:
ja: ref1、ref2、またはref3がnullの場合、 <code>NullReferenceException</code> が発生します。 問題を解決したい場合は、式をより単純な同等のものに書き直して、どれがnullかを調べます。
ko: ref1 또는 ref2 또는 ref3이 null이면 <code>NullReferenceException</code> 이 발생 합니다. 문제를 해결하려면 식을 더 간단한 것으로 다시 작성하여 널 중 하나를 찾으십시오.
ru: Если ref1 или ref2 или ref3 равны нулю, вы получите <code>NullReferenceException</code> . Если вы хотите решить проблему, то выясните, какая из них равна нулю, переписав выражение в его более простой эквивалент:
zh_cn: 如果ref1或ref2或ref3为null，则将获得 <code>NullReferenceException</code> 。 如果要解决该问题，请通过将表达式重写为更简单的等价项来找出哪个为空：

source: If the exception occurs when referencing a property of <code>@Model</code> in an <code>ASP.NET MVC View</code>, you need to understand that the <code>Model</code> gets set in your action method, when you <code>return</code> a view. When you return an empty model (or model property) from your controller, the exception occurs when the views access it:
es: Si la excepci&oacute;n ocurre cuando se hace referencia a una propiedad de <code>@Model</code> en una <code>ASP.NET MVC View</code> , debe comprender que el <code>Model</code> se establece en su m&eacute;todo de acci&oacute;n, cuando <code>return</code> una vista. Cuando devuelve un modelo vac&iacute;o (o propiedad de modelo) desde su controlador, la excepci&oacute;n ocurre cuando las vistas acceden a &eacute;l:
ja: <code>ASP.NET MVC View</code> で <code>@Model</code> のプロパティを参照しているときに例外が発生した場合、 ビューを <code>return</code> ときに、アクションメソッドで <code>Model</code> が設定されることを理解する必要があります。 コントローラーから空のモデル（またはモデルプロパティ）を返すと、ビューがアクセスしたときに例外が発生します。
ko: <code>ASP.NET MVC View</code> 에서 <code>@Model</code> 속성을 참조 할 때 예외가 발생하면 뷰 를 <code>return</code> 할 때 <code>Model</code> 이 액션 메서드에서 설정됨을 이해해야합니다. 컨트롤러에서 빈 모델 (또는 모델 속성)을 반환하면 뷰가 액세스 할 때 예외가 발생합니다.
ru: Если исключение возникает при обращении к свойству <code>@Model</code> в представлении <code>ASP.NET MVC View</code> , необходимо понимать, что <code>Model</code> устанавливается в вашем методе действия при <code>return</code> представления. Когда вы возвращаете пустую модель (или свойство модели) из вашего контроллера, исключение возникает, когда представления обращаются к нему:
zh_cn: 如果在 <code>ASP.NET MVC View</code> 中引用 <code>@Model</code> 的属性时发生异常，则需要了解在 <code>return</code> 视图时在操作方法中设置了 <code>Model</code> 。 当从控制器返回空模型（或模型属性）时，视图访问它时会发生异常：

source: If the person does not have a title, this will throw an exception because it is trying to call <code>ToUpper</code> on a property with a null value.
es: Si la persona no tiene un t&iacute;tulo, esto generar&aacute; una excepci&oacute;n porque est&aacute; intentando llamar a <code>ToUpper</code> en una propiedad con un valor nulo.
ja: 人物にタイトルがない場合、null値のプロパティで <code>ToUpper</code> を呼び出そうとしているため、これは例外をスローします。
ko: 사람에게 제목이 없으면 null 값을 가진 속성에서 <code>ToUpper</code> 를 호출하려고하기 때문에 예외가 발생합니다.
ru: Если у человека нет заголовка, это вызовет исключение, потому что он пытается вызвать <code>ToUpper</code> для свойства с нулевым значением.
zh_cn: 如果此人没有标题，这将引发异常，因为它试图在具有空值的属性上调用 <code>ToUpper</code> 。

source: If we consider common scenarios where this exception can be thrown, accessing properties withing object at the top.
es: Si consideramos los escenarios comunes donde esta excepción puede ser lanzada,accediendo a las propiedades con el objeto en la parte superior.
ja: この例外がスローされる可能性がある一般的なシナリオを考えてみると、上部にあるオブジェクトを持つプロパティにアクセスします。
ko: 이 예외가 발생할 수있는 일반적인 시나리오를 고려하면 맨 위에 객체가있는 속성에 액세스합니다.
ru: Если рассмотреть общие сценарии,в которых это исключение может быть брошено,то доступ к свойствам с объектом сверху.
zh_cn: 如果我们考虑到常见的情况下会抛出这种异常,访问顶层对象的属性。

source: If you are debugging with Just My Code enabled, the behavior is slightly different. With Just My Code enabled, the debugger ignores first-chance common language runtime (CLR) exceptions that are thrown outside of My Code and do not pass through My Code
es: Si estás depurando con Sólo mi código activado,el comportamiento es ligeramente diferente.Con Sólo mi código activado,el depurador ignora las excepciones de tiempo de ejecución de lenguaje común (CLR)que se lanzan fuera de Mi código y no pasan a través de Mi código.
ja: Just My Code を有効にしてデバッグしている場合は、動作が少し異なります。Just My Code を有効にした場合、デバッガは、My Code の外に投げられ、My Code を通らないファーストチャンスの共通言語ランタイム (CLR)例外を無視します。
ko: Just My Code를 사용하여 디버깅하는 경우 동작이 약간 다릅니다. 내 코드 만 사용으로 설정하면 디버거는 내 코드 외부에서 발생하고 내 코드를 통과하지 못하는 CLR (first-chance common language runtime) 예외를 무시합니다.
ru: Если вы отлаживаетесь с включенным Just My Code,поведение немного отличается.При включенной опции Just My Code отладчик игнорирует исключения из правил выполнения программы на общем языке (CLR),которые выбрасываются за пределы My Code и не проходят через My Code.
zh_cn: 如果您在调试时启用了 "我的代码",那么行为就会略有不同。启用了 "我的代码 "后,调试器会忽略在 "我的代码 "之外抛出的第一次通用语言运行时(CLR)异常,而不通过 "我的代码"。
