Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Null operators: Null Coalescing operator and null conditional operators can also be used in handy while setting values to objects, variables, properties and fields.
es: Operadores nulos:El operador nulo de coalescencia y los operadores nulo condicional también pueden utilizarse de forma práctica mientras se establecen los valores de los objetos,las variables,las propiedades y los campos.
ja: ヌル演算子。Null合体演算子とNULL条件演算子は、オブジェクト、変数、プロパティ、フィールドに値を設定する際にも便利に使用できます。
ko: Null 연산자 : Null Coalescing 연산자 및 Null 조건부 연산자를 사용하여 값을 개체, 변수, 속성 및 필드로 설정할 수 있습니다.
ru: Нулл-операторы:Нулевой коалесцирующий оператор и нулевой условный оператор также могут быть использованы в удобстве при установке значений для объектов,переменных,свойств и полей.
zh_cn: 空运算符。在给对象、变量、属性和字段设置值时,也可以使用空凝聚运算符和空条件运算符。

source: NullReference Exception &mdash; Visual Basic
es: Excepci&oacute;n de referencia nula - Visual Basic
ja: NullReference例外&mdash; Visual Basic
ko: NullReference 예외 &mdash; Visual Basic
ru: Исключение NullReference - Visual Basic
zh_cn: NullReference异常&mdash; Visual Basic

source: NullReferenceException arises due to our fault for not checking the object&rsquo;s value. We often leave the object values unchecked in the code development.
es: NullReferenceException surge debido a nuestra falla por no verificar el valor del objeto. A menudo dejamos los valores del objeto sin marcar en el desarrollo del c&oacute;digo.
ja: NullReferenceExceptionは、オブジェクトの値をチェックしないというフォールトが原因で発生します。 多くの場合、コード開発ではオブジェクト値をオフのままにします。
ko: NullReferenceException은 객체 값을 확인하지 않은 오류로 인해 발생합니다. 우리는 종종 코드 개발에서 객체 값을 체크하지 않은 채로 둡니다.
ru: NullReferenceException возникает из-за нашей ошибки в том, что мы не проверили значение объекта. Мы часто оставляем значения объектов без контроля при разработке кода.
zh_cn: 由于我们没有检查对象的值而导致的错误，导致NullReferenceException出现。 我们经常在代码开发中不检查对象值。

source: NullReferenceException or Object reference not set to an instance of an object occurs when an object of the class you are trying to use is not instantiated. For example:
es: NullReferenceException o Referencia de objeto no establecida a una instancia de un objeto ocurre cuando un objeto de la clase que se intenta utilizar no está instanciado.Por ejemplo:
ja: NullReferenceException またはオブジェクトのインスタンスにオブジェクト参照が設定されていない場合は、使用しようとしているクラスのオブジェクトがインスタンス化されていない場合に発生します。例えば、以下のような場合に発生します。
ko: 사용하려는 클래스의 객체가 인스턴스화되지 않은 경우 NullReferenceException 또는 객체 참조가 객체의 인스턴스로 설정되지 않음이 발생합니다. 예를 들면 다음과 같습니다.
ru: NullReferenceException или ссылка на объект,не установленная для экземпляра объекта,возникает,когда объект класса,который вы пытаетесь использовать,не инстанцируется.Например:
zh_cn: NullReferenceException或对象引用未被设置为对象的实例时,当你要使用的类的对象没有被实例化时,会发生NullReferenceException。比如说。

source: NullReferenceException won't occur if we are using Value type members.
es: La excepción de la Referencia Nula no ocurrirá si estamos usando miembros del tipo Valor.
ja: Value型のメンバを使用している場合は、NullReferenceExceptionは発生しません。
ko: Value 유형 멤버를 사용하는 경우 NullReferenceException이 발생하지 않습니다.
ru: NullReferenceException не произойдет,если мы используем члены типа Value.
zh_cn: 如果我们使用Value类型的成员,就不会出现NullReferenceException。

source: Numeric types
es: Tipos numéricos
ja: 数値型
ko: 숫자 형
ru: Числовые типы
zh_cn: 数字类型

source: Object Paths / Nested
es: Los caminos de los objetos anidados
ja: オブジェクトパスのネスト
ko: 객체 경로 / 중첩
ru: Вложенные пути объектов
zh_cn: 对象路径 嵌套

source: Object reference not set to an instance of an object.
es: La referencia al objeto no se fija en una instancia de un objeto.
ja: オブジェクトのインスタンスにオブジェクト参照が設定されていません。
ko: 객체 참조가 객체의 인스턴스로 설정되지 않았습니다.
ru: Ссылка на объект не установлена на экземпляр объекта.
zh_cn: 对象引用未设置为对象的实例。

source: Object variables which are <strong>uninitialized</strong> and hence <strong>point to nothing.</strong> In this case, if you access properties or methods of such objects, it causes a <code>NullReferenceException</code>.
es: Variables de objeto que <strong>no</strong> est&aacute;n <strong>inicializadas</strong> y, por lo tanto, no <strong>apuntan a nada.</strong> En este caso, si accede a las propiedades o m&eacute;todos de dichos objetos, se produce una <code>NullReferenceException</code> .
ja: <strong>初期化さ</strong>れて<strong>いない</strong>ため<strong>に何もポイントしない</strong>オブジェクト変数<strong>。</strong> この場合、そのようなオブジェクトのプロパティまたはメソッドにアクセスすると、 <code>NullReferenceException</code> が発生します。
ko: <strong>초기화되지 않은</strong> 객체 변수는 <strong>아무것도 가리 키지 않습니다.</strong> 이 경우 해당 객체의 속성 또는 메서드에 액세스하면 <code>NullReferenceException</code> 이 발생합니다.
ru: Переменные объекта, которые <strong>неинициализированы</strong> и, следовательно, <strong>ни на что не указывают.</strong> В этом случае, если вы <code>NullReferenceException</code> к свойствам или методам таких объектов, это вызывает исключение NullReferenceException .
zh_cn: <strong>未初始化的</strong>对象变量，因此<strong>没有指向任何对象。</strong> 在这种情况下，如果访问此类对象的属性或方法，则将导致 <code>NullReferenceException</code> 。

source: Of course, you <em>still</em> have to check <code>title</code> for null or use the null condition operator together with the null coalescing operator (<code>??</code>) to supply a default value:
es: Por supuesto, <em>a&uacute;n</em> debe verificar el <code>title</code> para nulo o usar el operador de condici&oacute;n nula junto con el operador de fusi&oacute;n nulo ( <code>??</code> ) para proporcionar un valor predeterminado:
ja: もちろん、 <code>title</code> のnullを確認するか、null条件演算子とnull結合演算子（ <code>??</code> ）を使用してデフォルト値を指定する必要があります。
ko: 물론 기본값을 제공하려면 <em>여전히</em> null <code>title</code> 을 확인하거나 null 조건 연산자를 null 병합 연산자 ( <code>??</code> )와 함께 사용해야합니다.
ru: Конечно, вам <em>все равно</em> нужно проверить <code>title</code> на null или использовать оператор условия null вместе с оператором объединения нулей ( <code>??</code> ), чтобы задать значение по умолчанию:
zh_cn: 当然，您<em>仍然</em>必须检查 <code>title</code> 是否为null或将null条件运算符与null合并运算符（ <code>??</code> ）一起使用以提供默认值：

source: On the matter of <strong>"what should I do about it"</strong>, there can be many answers.
es: En cuanto a <strong>"qu&eacute; debo hacer al respecto"</strong> , puede haber muchas respuestas.
ja: <strong>「どうすればいいか」については</strong> 、答えがたくさんあります。
ko: <strong>"어떻게해야합니까"</strong> 와 관련하여 많은 답변이있을 수 있습니다.
ru: На вопрос <strong>&laquo;что мне с этим делать&raquo;</strong> может быть много ответов.
zh_cn: 关于<strong>&ldquo;我该怎么办&rdquo;</strong> ，可能会有很多答案。

source: Once <em>where</em> the exception is throw has been located, it's usually trivial to reason backwards to find out where the null value was [incorrectly] introduced --
es: Una vez <em>que</em> se ha localizado la excepci&oacute;n, generalmente es trivial razonar hacia atr&aacute;s para descubrir d&oacute;nde se introdujo [incorrectamente] el valor nulo:
ja: 例外がスローされた場所が特定されると、通常、null値が[誤って]導入された場所を逆に推論するのは簡単です。
ko: 예외가 발생하면 null 값이 [부적절하게] 도입 된 위치를 찾기 위해 거꾸로 추론하는 것이 일반적입니다.
ru: Когда локализацией является исключение throw, обычно тривиально рассуждать в обратном направлении, чтобы выяснить, где было введено нулевое значение - неправильно
zh_cn: 一旦定位了引发异常的位置，通常不容易进行倒推以找出[错误地]引入了null值的位置-

source: Once you know what and where the problem is, it is usually fairly easy to fix and faster than posting a new question.
es: Una vez que sabes cuál es el problema y dónde está,suele ser bastante fácil de arreglar y más rápido que publicar una nueva pregunta.
ja: 問題が何で、どこにあるのかがわかれば、通常はかなり簡単に解決でき、新しい質問を投稿するよりも早いです。
ko: 문제의 위치와 위치를 알고 나면 새로운 질문을 게시하는 것보다 수정하기가 쉽고 빠릅니다.
ru: Как только вы знаете,что и где проблема,это обычно довольно легко исправить и быстрее,чем написать новый вопрос.
zh_cn: 一旦你知道了问题是什么,问题在哪里,通常是相当容易解决的,而且比发布一个新问题要快。

source: One example of this is this simple ASP.NET binding fragment with the Calendar control:
es: Un ejemplo de esto es este simple fragmento de unión ASP.NET con el control del Calendario:
ja: その一例として、CalendarコントロールとのシンプルなASP.NETバインディングフラグメントがあります。
ko: 이에 대한 한 가지 예는 Calendar 컨트롤이있는이 간단한 ASP.NET 바인딩 조각입니다.
ru: Одним из примеров этого является простой фрагмент привязки ASP.NET с управлением Calendar:
zh_cn: 其中一个例子就是这个简单的ASP.NET与Calendar控件绑定片段。

source: Only reference types, as the name is suggesting, can hold references or point literally to nothing (or 'null'). Whereas value types always contain a value.
es: Sólo los tipos de referencia,como sugiere el nombre,pueden contener referencias o no apuntan literalmente a nada (o "nulo").Mientras que los tipos de valores siempre contienen un valor.
ja: 名前が示唆しているように、参照型だけが、参照を保持したり、文字通り何も指し示していない(または 'null' を指す)ことができます。一方、値の型には常に値が含まれています。
ko: 이름에서 알 수 있듯이 참조 유형 만 참조를 보유하거나 문자 그대로 아무 것도 가리 키지 않을 수 있습니다 ( 'null'). 반면에 값 유형에는 항상 값이 포함됩니다.
ru: Только типы ссылок,как предполагает имя,могут содержать ссылки или точку буквально ни на что (или 'ноль').В то время как типы значений всегда содержат значение.
zh_cn: 只有引用类型,就像名字所暗示的那样,可以持有引用,也可以直接指向任何东西(或 "null")。而值类型总是包含一个值。

source: Option Infer Statement
es: Declaración de Inferencia de Opción
ja: オプションインファー文
ko: 옵션 추론
ru: Заявление об условных обозначениях
zh_cn: 选项推理声明

source: Or you can always code your own approach using plain old code. For example here is a struct that you can use to catch null references. It's modeled after the same concept as <code>Nullable&lt;T&gt;</code>:
es: O siempre puede codificar su propio enfoque utilizando un c&oacute;digo antiguo simple. Por ejemplo, aqu&iacute; hay una estructura que puede usar para capturar referencias nulas. Est&aacute; modelado seg&uacute;n el mismo concepto que <code>Nullable&lt;T&gt;</code> :
ja: または、プレーンな古いコードを使用して、いつでも独自のアプローチをコーディングできます。 たとえば、次の例は、null参照をキャッチするために使用できる構造体です。 <code>Nullable&lt;T&gt;</code> と同じコンセプトに基づいてモデル化されています 。
ko: 또는 항상 평범한 오래된 코드를 사용하여 자신 만의 방식을 코딩 할 수 있습니다. 예를 들어 다음은 널 참조를 포착하는 데 사용할 수있는 구조체입니다. <code>Nullable&lt;T&gt;</code> 와 같은 개념으로 모델링되었습니다.
ru: Или вы всегда можете написать свой собственный подход, используя простой старый код. Например, вот структура, которую вы можете использовать для перехвата нулевых ссылок. Он смоделирован по той же концепции, что и <code>Nullable&lt;T&gt;</code> :
zh_cn: 或者，您始终可以使用简单的旧代码编写自己的方法。 例如，这里是一个可用于捕获空引用的结构。 它以与 <code>Nullable&lt;T&gt;</code> 相同的概念建模：

source: Or you can even use it when the method just returns <code>T</code> (in this case <code>Person</code>) by doing a cast. For example, the following code would just like the code above:
es: O incluso puede usarlo cuando el m&eacute;todo solo devuelve <code>T</code> (en este caso <code>Person</code> a ) haciendo un lanzamiento. Por ejemplo, al siguiente c&oacute;digo le gustar&iacute;a el c&oacute;digo anterior:
ja: または、メソッドがキャストを実行して <code>T</code> （この場合は <code>Person</code> ）を返すだけの場合にも使用できます。 たとえば、次のコードは上記のコードと同じです。
ko: 또는 캐스팅을 수행하여 메소드가 <code>T</code> (이 경우 <code>Person</code> )를 반환 할 때도 사용할 수 있습니다. 예를 들어 다음 코드는 위 코드와 같습니다.
ru: Или вы можете даже использовать его, когда метод просто возвращает <code>T</code> (в данном случае <code>Person</code> ), выполняя приведение. Например, следующий код будет похож на код выше:
zh_cn: 或者，甚至在方法通过执行 <code>Person</code> 仅返回 <code>T</code> （在这种情况下为Person ）时使用它。 例如，以下代码与上面的代码类似：

source: Otherwise, the variable name will be assigned the value of the p.Spouse.FirstName.
es: De lo contrario,al nombre de la variable se le asignará el valor del p.Nombre del cónyuge.
ja: そうでなければ、変数名にはp.Spouse.FirstNameの値が代入されます。
ko: 그렇지 않으면 변수 이름에 p.Spouse.FirstName의 값이 지정됩니다.
ru: В противном случае,имени переменной будет присвоено значение p.Spouse.FirstName.
zh_cn: 否则,变量名称将被分配为p.Spouse.FirstName的值。

source: Poorly Implemented Try/Catch
es: Mal implementado TryCatch
ja: 実装が不十分なTryCatch
ko: 잘못 구현 된 시도 / 캐치
ru: Плохо реализованная система TryCatch
zh_cn: 执行不力的TryCatch

source: Possibly, other code prematurely invalidated an object still in use
es: Posiblemente,otro código invalidó prematuramente un objeto todavía en uso
ja: 他のコードがまだ使用中のオブジェクトを早期に無効にした可能性があります。
ko: 다른 코드가 아직 사용중인 객체를 조기에 무효화했을 수 있습니다.
ru: Возможно,другой код преждевременно признал недействительным еще используемый объект
zh_cn: 可能是其他代码过早地使一个还在使用中的对象失效了

source: Range Variable (Indirect/Deferred)
es: Variable de alcance (IndirectaDiferida)
ja: 範囲変数(IndirectDeferred
ko: 범위 변수 (간접 / 지연)
ru: Переменная диапазона (IndirectDeferred)
zh_cn: 范围变量(间接递延)

source: Rather than indirect references by name using the form's <code>Controls</code> collection, use the control reference:
es: En lugar de referencias indirectas por nombre usando la colecci&oacute;n de <code>Controls</code> del formulario, use la referencia de control:
ja: フォームの <code>Controls</code> コレクションを使用した名前による間接参照ではなく、コントロール参照を使用します。
ko: 폼의 <code>Controls</code> 컬렉션을 사용하여 이름으로 간접 참조하는 대신 컨트롤 참조를 사용하십시오.
ru: Вместо косвенных ссылок по имени, используя коллекцию <code>Controls</code> формы, используйте ссылку control:
zh_cn: 而不是使用表单的 <code>Controls</code> 集合按名称进行间接引用，而应使用控件引用：

source: Referencing array elements later will result in an NRE. If you do this in <code>Form_Load</code>, due to an odd bug, the IDE <em>may not</em> report the exception when it happens. The exception will pop up <em>later</em> when your code tries to use the array. This "silent exception" is <a href="https://stackoverflow.com/a/4934010/1070452">detailed in this post</a>. For our purposes, the key is that when something catastrophic happens while creating a form (<code>Sub New</code> or <code>Form Load</code> event), exceptions may go unreported, the code exits the procedure and just displays the form.
es: Hacer referencia a elementos de la matriz m&aacute;s adelante dar&aacute; como resultado una NRE. Si hace esto en <code>Form_Load</code> , debido a un error extra&ntilde;o, el IDE <em>puede no</em> informar la excepci&oacute;n cuando ocurra. La excepci&oacute;n aparecer&aacute; m&aacute;s <em>tarde</em> cuando su c&oacute;digo intente usar la matriz. Esta "excepci&oacute;n silenciosa" se <a href="https://stackoverflow.com/a/4934010/1070452">detalla en esta publicaci&oacute;n</a> . Para nuestros prop&oacute;sitos, la clave es que cuando ocurre algo catastr&oacute;fico al crear un formulario (evento <code>Sub New</code> o <code>Form Load</code> ), las excepciones pueden no informarse, el c&oacute;digo sale del procedimiento y solo muestra el formulario.
ja: 後で配列要素を参照すると、NREになります。 これを <code>Form_Load</code> で行うと、奇妙なバグが原因で、IDE <em>は</em>例外が発生したときに例外を報告し<em>ない</em>場合があります。 コードが配列を使用しようとすると、例外が<em>後で</em>ポップアップします。 この「サイレント例外」 <a href="https://stackoverflow.com/a/4934010/1070452">については、この投稿で詳しく説明してい</a>ます。 私たちの目的にとって重要なのは、フォームの作成中に致命的な事態（ <code>Sub New</code> または <code>Form Load</code> イベント）が発生すると、例外が報告されず、コードがプロシージャを終了してフォームを表示することです。
ko: 나중에 배열 요소를 참조하면 NRE가 발생합니다. 이상한 버그로 인해 <code>Form_Load</code> 에서이 작업을 수행하면 IDE에서 예외가 발생했을 때보고 <em>하지 않을 수 있습니다</em> . <em>나중에</em> 코드에서 배열을 사용하려고하면 예외가 나타납니다. 이 "자동 예외"는 <a href="https://stackoverflow.com/a/4934010/1070452">이 게시물에 자세히 설명되어</a> 있습니다. 우리의 목적을 위해, 핵심은 양식 ( <code>Sub New</code> 또는 <code>Form Load</code> 이벤트)을 작성하는 동안 심각한 상황이 발생하면 예외가보고되지 않고 코드가 프로 시저를 종료하고 양식 만 표시한다는 것입니다.
ru: Ссылка на элементы массива позже приведет к NRE. Если вы сделаете это в <code>Form_Load</code> из-за странной ошибки, IDE <em>может не</em> сообщить об исключении, когда это произойдет. Исключение появится <em>позже,</em> когда ваш код попытается использовать массив. Это &laquo;тихое исключение&raquo; <a href="https://stackoverflow.com/a/4934010/1070452">подробно описано в этом посте</a> . Для наших целей ключевым моментом является то, что когда что-то катастрофическое происходит при создании формы (событие <code>Sub New</code> или <code>Form Load</code> ), исключения могут не сообщаться, код выходит из процедуры и просто отображает форму.
zh_cn: 以后引用数组元素将导致NRE。 如果在 <code>Form_Load</code> 中执行此操作，则由于一个奇怪的错误，IDE <em>可能不会</em>在发生异常时报告该异常。 当您的代码尝试使用数组时，异常将在<em>以后</em>弹出。 <a href="https://stackoverflow.com/a/4934010/1070452">这篇文章详细介绍了这种</a> &ldquo;无声例外&rdquo;。 出于我们的目的，关键是当创建表单时发生灾难性事件（ <code>Sub New</code> 或 <code>Form Load</code> 事件）时，可能不会报告异常，代码将退出过程并仅显示表单。

source: Replace <code>Exit Function</code> in the function with <code>Return bList</code>. Returning an <em>empty</em><code>List</code> is not the same as returning <code>Nothing</code>. If there is a chance that a returned object can be <code>Nothing</code>, test before using it:
es: Reemplace la <code>Exit Function</code> en la funci&oacute;n con <code>Return bList</code> . Devolver una <code>List</code> a <em>vac&iacute;a</em> no es lo mismo que devolver <code>Nothing</code> . Si existe la posibilidad de que un objeto devuelto pueda ser <code>Nothing</code> , pruebe antes de usarlo:
ja: <code>Exit Function</code> を <code>Return bList</code> に置き換えます。 <em>空の</em> <code>List</code> 返すことは、 <code>Nothing</code> を返すことと同じではありません 。 返されたオブジェクトが <code>Nothing</code> になる可能性がある場合は、使用する前にテストしてください。
ko: <code>Exit Function</code> 을 <code>Return bList</code> 로 바꾸십시오 . <em>빈</em> <code>List</code> 를 반환하는 <code>Nothing</code> 을 반환하는 것과 다릅니다. 반환 된 객체가 <code>Nothing</code> 일 가능성이있는 경우 사용하기 전에 테스트하십시오.
ru: Замените <code>Exit Function</code> в функции на <code>Return bList</code> . Возврат <em>пустого</em> <code>List</code> - это не то же самое, что возврат <code>Nothing</code> . Если есть вероятность, что возвращаемый объект может быть <code>Nothing</code> , протестируйте его перед использованием:
zh_cn: 用 <code>Return bList</code> 替换 <code>Exit Function</code> 中的Exit Function 。 返回<em>空</em> <code>List</code> 与返回 <code>Nothing</code> 不同 。 如果返回的对象可能是 <code>Nothing</code> ，请在使用它之前进行测试：

source: Scope in Visual Basic
es: Alcance en Visual Basic
ja: Visual Basicのスコープ
ko: Visual Basic의 범위
ru: Область применения визуальной основы
zh_cn: Visual Basic中的范围

source: See "<a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">NullReferenceException thrown when testing custom AuthorizationAttribute</a>" for a somewhat verbose example.
es: Consulte " <a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">NullReferenceException lanzada al probar AuthorizationAttribute personalizado</a> " para obtener un ejemplo algo detallado.
ja: やや冗長な例については、「 <a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">カスタムAuthorizationAttributeのテスト時にスローされるNullReferenceException</a> 」を参照してください。
ko: 다소 자세한 예제는 " <a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">사용자 정의 AuthorizationAttribute를 테스트 할 때 NullReferenceException 발생</a> "을 참조하십시오.
ru: См. &laquo; <a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">NullReferenceException, генерируемое при тестировании пользовательского AuthorizationAttribute</a> &raquo; для несколько подробного примера.
zh_cn: 请参阅&ldquo; <a href="https://stackoverflow.com/questions/19314340/nullreferenceexception-thrown-when-testing-custom-authorizationattribute">测试自定义AuthorizationAttribute时抛出的NullReferenceException</a> &rdquo;，以获取一些冗长的示例。

source: See also <a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">DataTable Class</a>.
es: Ver tambi&eacute;n la <a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">clase DataTable</a> .
ja: <a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">DataTableクラス</a>も参照してください。
ko: <a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">DataTable 클래스</a> 도 참조하십시오.
ru: Смотрите также <a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">DataTable Class</a> .
zh_cn: 另请参见<a href="http://msdn.microsoft.com/en-us/library/System.Data.DataTable(v=vs.110).aspx">DataTable类</a> 。

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: Since VB is managing Settings for you, it is reasonable to expect it to initialize the collection. It will, but only if you have previously added an initial entry to the collection (in the Settings editor). Since the collection is (apparently) initialized when an item is added, it remains <code>Nothing</code> when there are no items in the Settings editor to add.
es: Dado que VB administra la configuraci&oacute;n por usted, es razonable esperar que inicialice la recopilaci&oacute;n. Lo har&aacute;, pero solo si ha agregado previamente una entrada inicial a la colecci&oacute;n (en el editor de Configuraci&oacute;n). Dado que la colecci&oacute;n se inicializa (aparentemente) cuando se agrega un elemento, permanece como <code>Nothing</code> cuando no hay elementos en el editor de Configuraci&oacute;n para agregar.
ja: VBが設定を管理しているので、コレクションの初期化を期待するのが妥当です。 ただし、以前に（設定エディターで）コレクションに初期エントリを追加している場合に限ります。 コレクションは（見かけ上）アイテムが追加されるときに初期化されるため、設定エディターに追加するアイテムがない場合、コレクションは <code>Nothing</code> のままです。
ko: VB가 설정을 관리하고 있으므로 모음을 초기화 할 것으로 기대하는 것이 합리적입니다. 이전에 컬렉션에 초기 항목을 추가 한 경우에만 설정 편집기에서 수행됩니다. 항목이 추가 될 때 컬렉션이 (명확하게) 초기화되기 때문에 설정 편집기에 추가 할 항목이 없으면 <code>Nothing</code> 유지 되지 않습니다 .
ru: Поскольку VB управляет настройками для вас, разумно ожидать, что он инициализирует коллекцию. Это произойдет, но только если вы ранее добавили начальную запись в коллекцию (в редакторе настроек). Поскольку коллекция (по-видимому) инициализируется при добавлении элемента, она остается <code>Nothing</code> если в редакторе настроек нет элементов, которые можно добавить.
zh_cn: 由于VB正在为您管理&ldquo;设置&rdquo;，因此可以期望它初始化集合。 它将，但前提是您先前已在集合中添加了初始条目（在&ldquo;设置&rdquo;编辑器中）。 由于添加时（显然）初始化了集合，因此在&ldquo;设置&rdquo;编辑器中没有要添加的项目时，该集合将保持为空。

source: Since no other code in your <code>Sub New</code> or <code>Form Load</code> event will run after the NRE, <em>a great many other things</em> can be left uninitialized.
es: Dado que ning&uacute;n otro c&oacute;digo en su evento <code>Sub New</code> o <code>Form Load</code> se ejecutar&aacute; despu&eacute;s del NRE, <em>muchas otras cosas</em> pueden dejarse sin inicializar.
ja: <code>Sub New</code> イベントまたは <code>Form Load</code> イベントの他のコードはNREの後に実行されないため、他の<em>多くのもの</em>を初期化せずに残す<em>こと</em>ができます。
ko: <code>Sub New</code> 또는 <code>Form Load</code> 이벤트의 다른 코드는 NRE 이후에 실행되지 않으므로 다른 <em>많은 것들이</em> 초기화되지 않은 채 남아 <em>있을</em> 수 있습니다.
ru: Поскольку никакой другой код в вашем событии <code>Sub New</code> или <code>Form Load</code> не будет выполняться после NRE, <em>многие другие вещи</em> можно оставить неинициализированными.
zh_cn: 由于NRE之后将不会再运行 <code>Sub New</code> 或 <code>Form Load</code> 事件中的其他代码，因此<em>许多其他事情</em>可以保留为未初始化。
