Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>somevar</code> assignment will result in an immediate NRE because Nothing doesn't have a <code>.Text</code> property
es: La asignaci&oacute;n de <code>somevar</code> dar&aacute; como resultado una NRE inmediata porque Nothing no tiene una propiedad <code>.Text</code>
ja: <code>somevar</code> の割り当てでは、 <code>.Text</code> プロパティがないため、NREがすぐに発生します。
ko: Nothing에 <code>.Text</code> 속성이 없기 때문에 <code>somevar</code> 할당은 즉시 NRE가됩니다.
ru: Назначение <code>somevar</code> приведет к немедленному NRE, потому что Nothing не имеет свойства <code>.Text</code>
zh_cn: <code>somevar</code> 分配将立即产生NRE，因为Nothing没有 <code>.Text</code> 属性

source: The <strong>Remedy</strong> is the same, reference the table by index:
es: El <strong>remedio</strong> es el mismo, consulte la tabla por &iacute;ndice:
ja: <strong>対処法</strong>は同じで、インデックスでテーブルを参照します。
ko: <strong>해결책</strong> 은 동일합니다. 색인으로 테이블을 참조하십시오.
ru: <strong>Средство не изменилось</strong> , обратитесь к таблице по индексу:
zh_cn: <strong>补救措施</strong>是相同的，按索引引用表：

source: The Array will contain five elements of Nothing
es: La matriz contendrá cinco elementos de Nada
ja: 配列には、Nothingの5つの要素が含まれます。
ko: 이 배열에는 Nothing의 다섯 가지 요소가 포함됩니다
ru: Массив будет содержать пять элементов "Ничего".
zh_cn: 阵列将包含5个Nothing元素

source: The DGV has a few quirks seen periodically:
es: El DGV tiene algunas peculiaridades que se ven periódicamente:
ja: DGVには定期的に見られるいくつかのクセがあります。
ko: DGV에는 다음과 같은 몇 가지 단점이 있습니다.
ru: У DGV есть несколько причуд,которые мы периодически видим:
zh_cn: DGV有一些怪癖,定期看到的。

source: The DataGridView
es: El DataGridView
ja: DataGridView
ko: DataGridView
ru: DataGridView
zh_cn: 数据网格视图

source: The System.DBNull value indicates that the Object represents missing or non-existent data. DBNull is not the same as Nothing, which indicates that a variable has not yet been initialized.
es: El valor System.DBNull indica que el Objeto representa datos que faltan o no existen.DBNull no es lo mismo que Nada,lo que indica que una variable aún no ha sido inicializada.
ja: System.DBNull 値は、オブジェクトが存在しない、または存在しないデータを表していることを示します。DBNullは、変数がまだ初期化されていないことを示すNothingとは異なります。
ko: System.DBNull 값은 Object가 없거나 존재하지 않는 데이터를 나타냅니다. DBNull은 Nothing과 같지 않으므로 변수가 아직 초기화되지 않았 음을 나타냅니다.
ru: Значение System.DBNull указывает на то,что Объект представляет отсутствующие или несуществующие данные.DBNull не то же самое,что Nothing,что указывает на то,что переменная еще не инициализирована.
zh_cn: System.DBNull值表示对象表示缺失或不存在数据。DBNull与Nothing不同,后者表示变量尚未被初始化。

source: The above code shows simple string which is assigned with a <strong>null</strong> value.
es: El c&oacute;digo anterior muestra una cadena simple que se asigna con un valor <strong>nulo</strong> .
ja: 上記のコードは、 <strong>null</strong>値が割り当てられた単純な文字列を示してい<strong>ます</strong> 。
ko: 위의 코드는 <strong>null</strong> 값이 할당 된 간단한 문자열을 보여줍니다.
ru: Приведенный выше код показывает простую строку, которой присваивается <strong>нулевое</strong> значение.
zh_cn: 上面的代码显示了一个简单的字符串，该字符串分配了一个<strong>空</strong>值。

source: The array code may not be out of the woods yet. Any controls which are in a container control (like a <code>GroupBox</code> or <code>Panel</code>) will not be found in <code>Me.Controls</code>; they will be in the Controls collection of that Panel or GroupBox. Nor will a control be returned when the control name is misspelled (<code>"TeStBox2"</code>). In such cases, <code>Nothing</code> will again be stored in those array elements and an NRE will result when you attempt to reference it.
es: Es posible que el c&oacute;digo de matriz a&uacute;n no est&eacute; fuera de peligro. Los controles que est&aacute;n en un control de contenedor (como <code>GroupBox</code> o <code>Panel</code> ) no se encontrar&aacute;n en <code>Me.Controls</code> ; estar&aacute;n en la colecci&oacute;n de Controles de ese Panel o GroupBox. Tampoco se devolver&aacute; un control cuando el nombre del control est&eacute; mal escrito ( <code>"TeStBox2"</code> ). En tales casos, <code>Nothing</code> volver&aacute; a almacenarse en esos elementos de la matriz y aparecer&aacute; un NRE cuando intente hacer referencia a &eacute;l.
ja: 配列コードはまだ森から出ていないかもしれません。 コンテナコントロール（ <code>GroupBox</code> や <code>Panel</code> など ）にあるコントロールは、 Me.Controlsにはありません。 それらは、そのPanelまたはGroupBoxのControlsコレクションに含まれます。 また、コントロール名のスペルが間違っていても、コントロールは返されません（ <code>"TeStBox2"</code> ）。 このような場合、これらの配列要素には何も格納されず、参照しようとするとNREが発生します。
ko: 배열 코드가 아직 숲에서 나오지 않았을 수 있습니다. 컨테이너 컨트롤 ( <code>GroupBox</code> 또는 <code>Panel</code> 과 같은)에있는 컨트롤은 <code>Me.Controls</code> 에서 찾을 수 없습니다. 해당 패널 또는 GroupBox의 Controls 컬렉션에 있습니다. 제어 이름의 철자가 <code>"TeStBox2"</code> 제어도 리턴되지 않습니다 ( "TeStBox2" ). 이러한 경우 해당 배열 요소에 <code>Nothing</code> 다시 저장 되지 않으며 참조하려고하면 NRE가 발생합니다.
ru: Код массива еще может быть не в лесу. Любые элементы управления, которые находятся в элементе управления контейнера (например, <code>GroupBox</code> или <code>Panel</code> ), не будут найдены в <code>Me.Controls</code> ; они будут в коллекции Controls этой Panel или GroupBox. Также не будет возвращен элемент управления, если имя <code>"TeStBox2"</code> управления написано с ошибкой ( "TeStBox2" ). В таких случаях <code>Nothing</code> будет снова сохранено в этих элементах массива, и при попытке сослаться на него будет получено NRE.
zh_cn: 阵列代码可能还没有走出困境。 在 <code>Me.Controls</code> 中找不到容器控件中的任何控件（例如 <code>GroupBox</code> 或 <code>Panel</code> ）。 它们将位于该Panel或GroupBox的Controls集合中。 拼写错误的控件名称（ <code>"TeStBox2"</code> ）也不会返回控件。 在这种情况下， <code>Nothing</code> 也不会再存储在这些数组元素中，并且在您尝试引用它时会产生NRE。

source: The array has been created, but the <code>Foo</code> objects in it have not.
es: La matriz se ha creado, pero los objetos <code>Foo</code> que contiene no.
ja: 配列は作成されましたが、その中の <code>Foo</code> オブジェクトは作成されていません。
ko: 배열이 생성되었지만 그 안에 <code>Foo</code> 개체가 없습니다.
ru: Массив создан, а объекты <code>Foo</code> в нем - нет.
zh_cn: 数组已创建，但其中的 <code>Foo</code> 对象尚未创建。

source: The code is only testing <code>Items</code> while both <code>myFoo</code> and <code>Bar</code> may also be Nothing. The <strong>remedy</strong> is to test the entire chain or path of objects one at a time:
es: El c&oacute;digo solo prueba <code>Items</code> mientras que <code>myFoo</code> y <code>Bar</code> tambi&eacute;n pueden ser Nothing. El <strong>remedio</strong> es probar la cadena o ruta completa de los objetos, uno a la vez:
ja: コードは <code>Items</code> をテストするだけですが、 <code>myFoo</code> と <code>Bar</code> の両方がNothingの場合もあります。 <strong>対策</strong>は、オブジェクトのチェーン全体またはパスを一度に1つずつテストすることです。
ko: 이 코드는 <code>Items</code> 만 테스트하는 반면 <code>myFoo</code> 와 <code>Bar</code> 는 모두 아무것도 아닙니다. <strong>해결책</strong> 은 한 번에 하나씩 전체 체인 또는 객체 경로를 테스트하는 것입니다.
ru: Код только тестирует <code>Items</code> то время как <code>myFoo</code> и <code>Bar</code> также могут иметь значение Nothing. Средство <strong>защиты</strong> состоит в том, чтобы проверить всю цепочку или путь объектов по одному:
zh_cn: 该代码仅用于测试 <code>Items</code> ,而 <code>myFoo</code> 和 <code>Bar</code> 都可能为Nothing。 <strong>补救措施</strong>是一次测试一个对象的整个链或路径：

source: The constructor for the <code>ArgumentNullException</code> even takes the name of the parameter and a message as arguments so you can tell the developer exactly what the problem is.
es: El constructor de <code>ArgumentNullException</code> incluso toma el nombre del par&aacute;metro y un mensaje como argumentos para que pueda decirle al desarrollador exactamente cu&aacute;l es el problema.
ja: <code>ArgumentNullException</code> のコンストラクターは、パラメーターの名前とメッセージを引数として取り、開発者に問題が何であるかを正確に伝えることができます。
ko: <code>ArgumentNullException</code> 의 생성자는 매개 변수 이름과 메시지를 인수로 사용하므로 개발자에게 문제가 무엇인지 정확하게 알려줄 수 있습니다.
ru: Конструктор для <code>ArgumentNullException</code> даже принимает имя параметра и сообщение в качестве аргумента, чтобы вы могли точно сказать разработчику, в чем заключается проблема.
zh_cn: <code>ArgumentNullException</code> 的构造函数甚至将参数的名称和一条消息作为参数，以便您可以确切地告诉开发者问题所在。

source: The correct fix is:
es: La solución correcta es:
ja: 正しい修正方法は
ko: 올바른 수정 사항은 다음과 같습니다.
ru: Правильное исправление:
zh_cn: 正确的解决方法是:

source: The data Type and array size are inferred from the data being assigned. Class/Module level declarations still require <code>As &lt;Type&gt;</code> with <code>Option Strict</code>:
es: El tipo de datos y el tama&ntilde;o de la matriz se infieren de los datos que se asignan. Las declaraciones de nivel de clase / m&oacute;dulo a&uacute;n requieren <code>As &lt;Type&gt;</code> con <code>Option Strict</code> :
ja: データタイプと配列サイズは、割り当てられているデータから推測されます。 クラス/モジュールレベルの宣言には、 <code>Option Strict</code> した <code>As &lt;Type&gt;</code> が必要です。
ko: 데이터 유형 및 배열 크기는 할당되는 데이터에서 유추됩니다. 클래스 / 모듈 레벨 선언에는 여전히 <code>Option Strict</code> 가있는 <code>As &lt;Type&gt;</code> 이 필요합니다.
ru: Тип данных и размер массива выводятся из назначаемых данных. Для объявлений уровня класса / модуля все еще требуется <code>As &lt;Type&gt;</code> с <code>Option Strict</code> :
zh_cn: 数据类型和数组大小是从分配的数据推断出来的。 类/模块级别的声明仍然需要带有 <code>Option Strict</code> 的 <code>As &lt;Type&gt;</code> ：

source: The developer is <strong>using <code>null</code> intentionally to indicate there is no meaningful value available.</strong> Note that C# has the concept of nullable datatypes for variables (like database tables can have nullable fields) - you can assign <code>null</code> to them to indicate there is no value stored in it, for example <code>int? a = null;</code> where the question mark indicates it is allowed to store null in variable <code>a</code>. You can check that either with <code>if (a.HasValue) {...}</code> or with <code>if (a==null) {...}</code>. Nullable variables, like <code>a</code> this example, allow to access the value via <code>a.Value</code> explicitly, or just as normal via <code>a</code>.
es: El desarrollador est&aacute; <strong>usando <code>null</code> intencionalmente para indicar que no hay un valor significativo disponible.</strong> Tenga en cuenta que C # tiene el concepto de tipos de datos anulables para variables (como las tablas de la base de datos pueden tener campos anulables); puede asignarles valores <code>null</code> para indicar que no hay ning&uacute;n valor almacenado en &eacute;l, por ejemplo, <code>int? a = null;</code> a = nulo; donde el signo de interrogaci&oacute;n indica que est&aacute; permitido almacenar nulo en la variable <code>a</code> . Puede verificar eso con <code>if (a.HasValue) {...}</code> o con <code>if (a==null) {...}</code> . Las variables anulables, como este ejemplo, permiten acceder al valor a trav&eacute;s de <code>a.Value</code> expl&iacute;citamente, o de la misma manera a trav&eacute;s de <code>a</code> .
ja: 開発者は<strong>、意図的に <code>null</code> を使用して、使用できる意味のある値がないことを示しています。</strong> C＃には変数のnull許容データ型の概念があります（データベーステーブルはnull許容フィールドを持つことができるなど）-変数に <code>null</code> を割り当てて、値が格納されていないことを示すことができます（例： <code>int? a = null;</code> a = null; 疑問符は、変数 <code>a</code> に nullを格納できることを示しています。 <code>if (a.HasValue) {...}</code> または <code>if (a==null) {...}</code> いずれかで確認できます 。 この例のようなnull可能な変数は、 <code>a.Value</code> を介して明示的に、または。
ko: 개발자는 <strong>의미있는 값이 없음을 나타 내기 위해 의도적으로 <code>null</code> 을 사용하고 있습니다.</strong> C #에는 변수에 대한 nullable 데이터 유형 개념이 있습니다 (데이터베이스 테이블에 nullable 필드가있을 수 있음). 값이 저장되어 있지 않음을 나타 내기 위해 <code>null</code> 을 지정할 수 있습니다 (예 : <code>int? a = null;</code> a = 널; 여기서 물음표는 변수 <code>a</code> 에 null을 저장할 수 있음을 나타냅니다. <code>if (a.HasValue) {...}</code> 또는 <code>if (a==null) {...}</code> 있습니다. 이 예제와 같이 <code>a.Value</code> 입력 가능 변수를 사용하면 a.Value 를 통해 명시 적으로 또는 <code>a</code> 를 통해 정상적으로 액세스 할 수 있습니다.
ru: Разработчик <strong>намеренно использует значение <code>null</code> , чтобы указать, что значимых доступных значений нет.</strong> Обратите внимание, что в C # есть концепция обнуляемых типов данных для переменных (например, таблицы базы данных могут иметь обнуляемые поля) - вы можете присвоить им значение <code>null</code> , чтобы указать, что в нем нет значения, например <code>int? a = null;</code> а = ноль; где знак вопроса указывает, что разрешено хранить ноль в переменной <code>a</code> . Вы можете проверить это либо с помощью <code>if (a.HasValue) {...}</code> либо с помощью <code>if (a==null) {...}</code> . Обнуляемые переменные, как и <code>a</code> этом примере, позволяют получить доступ к значению через <code>a.Value</code> явно или просто как обычно через <code>a</code> .
zh_cn: 开发人员<strong>有意使用 <code>null</code> 来指示没有可用的有意义的值。</strong> 请注意，C＃具有变量的可为空的数据类型的概念（例如数据库表可以具有可为空的字段）-您可以为它们分配 <code>null</code> 来指示其中没有存储任何值，例如 <code>int? a = null;</code> a = null; 问号表示允许在变量 <code>a</code> 中存储null 的位置 。 您可以使用 <code>if (a.HasValue) {...}</code> 或 <code>if (a==null) {...}</code> 。 像本示例一样，可空变量允许通过 <code>a.Value</code> 显式地访问值，或者像通常一样通过 <code>a</code> 。

source: The error line "Object reference not set to an instance of an object. " states that you have not assigned instance object to a object reference and still you are accessing properies/methods of that object.
es: La línea de error "Referencia de objeto no establecida en una instancia de un objeto"." afirma que no ha asignado el objeto de la instancia a una referencia de objeto y aún así está accediendo a los métodos de propiedad de ese objeto.
ja: オブジェクト参照がオブジェクトのインスタンスに設定されていません。"は、オブジェクト参照にインスタンスオブジェクトを代入していないのに、そのオブジェクトの properiesmethods にアクセスしていることを示しています。
ko: 오류 개체 "개체 참조가 개체의 인스턴스로 설정되지 않았습니다."는 인스턴스 개체를 개체 참조에 할당하지 않았지만 여전히 해당 개체의 속성 / 방법에 액세스하고 있음을 나타냅니다.
ru: Строка ошибки "Ссылка на объект не установлена на экземпляр объекта." указывает на то,что вы не назначили экземпляр объекта ссылкой на объект,и все равно имеете доступ к соответствующим методам этого объекта.
zh_cn: 错误行 "Object reference not set to an instance of an object."说明你没有将实例对象分配给对象引用,而你仍然在访问该对象的 properiesmethods。

source: The error occurs when both the entity and codebehind class are in same namespace. To fix this, rename the entity class or the codebehind class for Contact.aspx.
es: El error se produce cuando tanto la entidad como la clase de código están en el mismo espacio de nombres.Para solucionarlo,renombre la clase de entidad o la clase codebehind para Contact.aspx.
ja: エンティティクラスとコードバインドクラスが同じ名前空間にある場合にエラーが発生します。これを修正するには、Contact.aspxのエンティティクラスまたはコードバインドクラスの名前を変更してください。
ko: 엔티티 및 코드 숨김 클래스가 모두 동일한 네임 스페이스에있는 경우 오류가 발생합니다. 이 문제를 해결하려면 Contact.aspx의 엔터티 클래스 또는 코드 숨김 클래스의 이름을 바꾸십시오.
ru: Ошибка возникает в том случае,когда и сущность,и класс codebehind находятся в одном и том же пространстве имён.Чтобы исправить это,переименуйте класс сущности или класс codebehind для Contact.aspx.
zh_cn: 当实体类和codebehind类都在同一个命名空间时,就会出现错误。要解决这个问题,请重命名实体类或codebehind类为Contact.aspx。

source: The examples (from Stack&nbsp; Overflow posts) do not always show the best way to do something in the first place.
es: Los ejemplos (de las publicaciones de Stack Overflow) no siempre muestran la mejor manera de hacer algo en primer lugar.
ja: （Stack Overflowの投稿からの）例は、最初から何かを行うための最良の方法を常に示しているわけではありません。
ko: 스택 오버플로 게시물의 예제가 항상 처음에 무언가를 수행하는 가장 좋은 방법을 보여주지는 않습니다.
ru: Примеры (из сообщений Stack Overflow) не всегда показывают лучший способ сделать что-либо в первую очередь.
zh_cn: 这些示例（来自Stack Overflow的帖子）并不总是始终显示最佳的方法。

source: The exception error is:
es: El error de excepción es:
ja: 例外エラーになっています。
ko: 예외 오류는 다음과 같습니다.
ru: Ошибка исключения:
zh_cn: 异常错误是。

source: The exception itself says that something is being referred but whose value is not being set. So this denotes that it only occurs while using reference types as Value types are non-nullable.
es: La propia excepción dice que se está refiriendo a algo pero cuyo valor no se está fijando.Por lo tanto,esto denota que sólo ocurre cuando se utilizan tipos de referencia ya que los tipos de valor no son anulables.
ja: この例外自体は、何かが参照されているが、その値が設定されていないことを示しています。つまり、これは値の型が非 null 型であるため、参照型を使用している場合にのみ発生することを示しています。
ko: 예외 자체는 무언가가 참조되고 있지만 값이 설정되지 않았다고 말합니다. 따라서 이것은 값 유형이 널 입력 불가능하므로 참조 유형을 사용하는 동안에 만 발생 함을 나타냅니다.
ru: В самом исключении говорится,что что-то упоминается,но чье значение не устанавливается.Это означает,что это происходит только при использовании типов ссылок,так как типы Value не являются исчерпывающими.
zh_cn: 异常本身就表示某物被引用,但其值没有被设置。所以,这表示只有在使用引用类型时才会出现,因为值类型是不可空的。

source: The hardest one .. if the <strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC</a></strong> collected the object already... This generally occurs if you are trying to find an object using strings... That is, finding it by name of the object then it may happen that the GC might already cleaned it up... This is hard to find and will become quite a problem... A better way to tackle this is do null checks wherever necessary during the development process. This will save you a lot of time.
es: El m&aacute;s dif&iacute;cil ... si el <strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC ya</a></strong> recolect&oacute; el objeto ... Esto generalmente ocurre si est&aacute; tratando de encontrar un objeto usando cadenas ... Es decir, si lo encuentra por el nombre del objeto, puede suceder que el GC ya pueda lo limpi&oacute; ... Esto es dif&iacute;cil de encontrar y se convertir&aacute; en un gran problema ... Una mejor manera de abordar esto es hacer verificaciones nulas siempre que sea necesario durante el proceso de desarrollo. Esto te ahorrara mucho tiempo.
ja: 最も難しいもの.. <strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC</a></strong>がオブジェクトを既に収集している場合...これは一般に、文字列を使用してオブジェクトを検索しようとしている場合に発生します...つまり、オブジェクトの名前でオブジェクトを検索すると、GCがすでに発生している可能性があります。クリーンアップしました...これは見つけるのが難しく、かなり問題になります...これに取り組むためのより良い方法は、開発プロセス中に必要に応じてnullチェックを実行することです。 これにより、多くの時間を節約できます。
ko: 가장 어려운 것은 .. <strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC가</a></strong> 이미 개체를 수집 한 경우 ... 이것은 일반적으로 문자열을 사용하여 개체를 찾으려고 할 때 발생합니다. 즉, 개체 이름으로 개체를 찾으면 GC가 이미 발생할 수 있습니다. 정리하기 ... 이것은 찾기가 어렵고 상당히 문제가 될 것입니다 ... 이것을 해결하는 더 좋은 방법은 개발 과정에서 필요한 곳에서 null 검사를하는 것입니다. 이렇게하면 많은 시간이 절약됩니다.
ru: Сложнее всего ... если <strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC уже</a></strong> собрал объект ... Обычно это происходит, если вы пытаетесь найти объект с помощью строк ... То есть, находя его по имени объекта, может случиться так, что GC может уже Вычистил это ... Это трудно найти и станет большой проблемой ... Лучший способ справиться с этим - делать нулевые проверки везде, где это необходимо в процессе разработки. Это сэкономит вам много времени.
zh_cn: 最难的一个..如果<strong><a href="http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29">GC</a></strong>已经收集了对象...如果您尝试使用字符串查找对象，这通常会发生...也就是说，通过对象的名称查找它，则可能发生GC清理它...这很难找到，并且将成为一个大问题。解决此问题的更好方法是在开发过程中的必要位置进行空检查。 这样可以节省您很多时间。

source: The message <em>"Object not set to an instance of Object"</em> means you are trying to use an object which has not been initialized. This boils down to one of these:
es: El mensaje <em>"Objeto no establecido en una instancia de Objeto"</em> significa que est&aacute; intentando utilizar un objeto que no se ha inicializado. Esto se reduce a uno de estos:
ja: <em>「オブジェクトがオブジェクトのインスタンスに設定されていません」</em>というメッセージは、初期化されていないオブジェクトを使用しようとしていることを意味します。 これは、次のいずれかに要約されます。
ko: <em>"개체가 개체의 인스턴스로 설정되지 않았습니다"</em> 라는 메시지는 초기화되지 않은 개체를 사용하려고 함을 나타냅니다. 이것은 다음 중 하나로 요약됩니다.
ru: Сообщение <em>&laquo;Объект не установлен в экземпляр объекта&raquo;</em> означает, что вы пытаетесь использовать объект, который не был инициализирован. Это сводится к одному из них:
zh_cn: 消息<em>&ldquo;对象未设置为对象的实例&rdquo;</em>表示您正在尝试使用尚未初始化的对象。 归结为以下之一：

source: The nested collection <code>Initializers</code> behave the same:
es: Los <code>Initializers</code> colecci&oacute;n anidada se comportan igual:
ja: ネストされたコレクションの <code>Initializers</code> は同じように動作します。
ko: 중첩 컬렉션 <code>Initializers</code> 는 동일하게 동작합니다.
ru: <code>Initializers</code> вложенной коллекции ведут себя так же:
zh_cn: 嵌套集合 <code>Initializers</code> 的行为相同：

source: The nullable annotation context and nullable warning context can be set for a project using the <code>Nullable</code> element in your <code>csproj</code> file. This element configures how the compiler interprets the nullability of types and what warnings are generated. Valid settings are:
es: El contexto de anulaci&oacute;n anulable y el contexto de advertencia anulable se pueden configurar para un proyecto utilizando el elemento <code>Nullable</code> en su archivo <code>csproj</code> . Este elemento configura c&oacute;mo el compilador interpreta la nulabilidad de los tipos y qu&eacute; advertencias se generan. Las configuraciones v&aacute;lidas son:
ja: nullsableアノテーションコンテキストとnullable警告コンテキストは、 <code>csproj</code> ファイルの <code>Nullable</code> 要素を使用してプロジェクトに設定できます。 この要素は、コンパイラーが型のNULL可能性を解釈する方法と生成される警告を構成します。 有効な設定は次のとおりです。
ko: <code>csproj</code> 파일의 <code>Nullable</code> 요소를 사용하여 프로젝트에 대해 Null 허용 주석 컨텍스트 및 Null 허용 경고 컨텍스트를 설정할 수 있습니다. 이 요소는 컴파일러가 형식의 null 허용 여부를 해석하는 방법과 생성되는 경고를 구성합니다. 유효한 설정은 다음과 같습니다.
ru: Обнуляемый контекст аннотации и обнуляемый контекст предупреждения могут быть установлены для проекта с использованием элемента <code>Nullable</code> в вашем <code>csproj</code> . Этот элемент определяет, как компилятор интерпретирует обнуляемость типов и какие предупреждения генерируются. Допустимые настройки:
zh_cn: 可以使用 <code>csproj</code> 文件中的 <code>Nullable</code> 元素为项目设置可为空的注释上下文和可为空的警告上下文。 该元素配置编译器如何解释类​​型的可空性以及生成什么警告。 有效设置为：

source: The plain versions <code>First()</code> and <code>Single()</code> throw exceptions when there is nothing. The "OrDefault" versions return null in that case. So be aware of that.
es: Las versiones simples <code>First()</code> y <code>Single()</code> lanzan excepciones cuando no hay nada. Las versiones "OrDefault" devuelven nulo en ese caso. As&iacute; que ten cuidado con eso.
ja: プレーンバージョンの <code>First()</code> および <code>Single()</code> は、何もないときに例外をスローします。 その場合、「OrDefault」バージョンはnullを返します。 ですので注意してください。
ko: 일반 버전 <code>First()</code> 및 <code>Single()</code> 은 아무것도 없을 때 예외를 발생시킵니다. 이 경우 "OrDefault"버전은 null을 반환합니다. 그러니 알아 두십시오.
ru: Простые версии <code>First()</code> и <code>Single()</code> генерируют исключения, когда ничего нет. Версии &laquo;OrDefault&raquo; в этом случае возвращают ноль. Так что знайте об этом.
zh_cn: 没有任何内容时，普通版本的 <code>First()</code> 和 <code>Single()</code> 会引发异常。 在这种情况下，&ldquo; OrDefault&rdquo;版本返回null。 因此请注意。

source: The problem is that <code>Dim</code> does not create a CashRegister <em>object</em>; it only declares a variable named <code>reg</code> of that Type. <em>Declaring</em> an object variable and creating an <em>instance</em> are two different things.
es: El problema es que <code>Dim</code> no crea un <em>objeto</em> CashRegister; solo declara una variable llamada <code>reg</code> de ese tipo. <em>Declarar</em> una variable de objeto y crear una <em>instancia</em> son dos cosas diferentes.
ja: 問題は、 <code>Dim</code> がCashRegister <em>オブジェクトを</em>作成しないことです。 そのタイプの <code>reg</code> という名前の変数を宣言するだけです。 オブジェクト変数の<em>宣言</em>と<em>インスタンスの</em>作成は、2つの異なるものです。
ko: 문제는 <code>Dim</code> 이 CashRegister <em>오브젝트를</em> 작성하지 않는다는 것입니다. 해당 유형의 <code>reg</code> 라는 변수 만 선언합니다. 객체 변수 <em>선언</em> 과 <em>인스턴스</em> 생성은 서로 다른 두 가지입니다.
ru: Проблема в том, что <code>Dim</code> не создает <em>объект</em> CashRegister; он только объявляет переменную с именем <code>reg</code> этого типа. <em>Объявление</em> переменной объекта и создание <em>экземпляра</em> - это две разные вещи.
zh_cn: 问题是 <code>Dim</code> 不会创建CashRegister <em>对象</em> 。 它仅声明该类型的名为 <code>reg</code> 的变量。 <em>声明</em>对象变量和创建<em>实例</em>是两件事。
