Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Since the problem is an object reference which is <code>Nothing</code>, the answer is to examine them to find out which one. Then determine why it is not initialized. Hold the mouse over the various variables and Visual Studio (VS) will show their values - the culprit will be <code>Nothing</code>.
es: Dado que el problema es una referencia de objeto que no es <code>Nothing</code> , la respuesta es examinarlos para averiguar cu&aacute;l. Luego determine por qu&eacute; no se inicializa. Mantenga el mouse sobre las diversas variables y Visual Studio (VS) mostrar&aacute; sus valores; el culpable ser&aacute; <code>Nothing</code> .
ja: 問題は <code>Nothing</code> であるオブジェクト参照であるため、答えはそれらを調べてどれを見つけるかです。 次に、初期化されていない理由を判別します。 さまざまな変数の上にマウスを置くと、Visual Studio（VS）がそれらの値を表示します-原因は <code>Nothing</code> です。
ko: 문제는 <code>Nothing</code> 객체 참조이므로 답변을 조사하여 어느 것을 찾아야합니다. 그런 다음 초기화되지 않은 이유를 판별하십시오. 다양한 변수 위에 마우스를 대면 Visual Studio (VS)에 값이 표시됩니다. 원인은 <code>Nothing</code> 입니다.
ru: Так как проблема - ссылка на объект, которая является <code>Nothing</code> , ответ состоит в том, чтобы исследовать их, чтобы выяснить, какой. Затем определите, почему он не инициализирован. Наведите указатель мыши на различные переменные, и Visual Studio (VS) покажет их значения - виновником будет <code>Nothing</code> .
zh_cn: 由于问题是一个对象引用，为 <code>Nothing</code> ，答案是检查它们以找出哪个对象。 然后确定为什么不初始化。 将鼠标悬停在各个变量上，Visual Studio（VS）将显示它们的值-罪魁祸首是 <code>Nothing</code> 。

source: Since this uses one table, using <code>Tables(0)</code> will avoid spelling errors. Examining <code>Rows.Count</code> can also help:
es: Como esto usa una tabla, el uso de <code>Tables(0)</code> evitar&aacute; errores ortogr&aacute;ficos. Examinar <code>Rows.Count</code> tambi&eacute;n puede ayudar:
ja: これは1つのテーブルを使用するため、 <code>Tables(0)</code> を使用するとスペルミスを回避できます。 <code>Rows.Count</code> を調べることも役立ちます：
ko: 이것은 하나의 테이블을 사용하므로 <code>Tables(0)</code> 하면 철자 오류를 피할 수 있습니다. <code>Rows.Count</code> 는 또한 다음을 도울 수 있습니다.
ru: Поскольку для этого используется одна таблица, использование <code>Tables(0)</code> позволит избежать орфографических ошибок. Изучение <code>Rows.Count</code> также может помочь:
zh_cn: 由于它使用一个表，因此使用 <code>Tables(0)</code> 可以避免拼写错误。 检查 <code>Rows.Count</code> 还可以帮助：

source: So how to tackle this:
es: Entonces,¿cómo abordar esto?
ja: では、どうやって取り組むか。
ko: 그래서 이것을 해결하는 방법 :
ru: Итак,как с этим справиться:
zh_cn: 那么,如何解决这个问题。

source: So, as a practice we should always use null check, before accessing properties in such objects (specially in generic)
es: Por lo tanto,como práctica deberíamos usar siempre el control nulo,antes de acceder a las propiedades en tales objetos (especialmente en genéricos)
ja: そのため、練習として、このようなオブジェクトのプロパティにアクセスする前には、常にヌルチェックを使用する必要があります(特にジェネリックな場合)。
ko: 따라서 실제로는 이러한 객체의 속성에 액세스하기 전에 항상 null 검사를 사용해야합니다 (특히 일반)
ru: Поэтому в качестве практики всегда следует использовать нулевую проверку,перед тем как обращаться к свойствам в таких объектах (особенно в общих)
zh_cn: 所以,作为一种做法,我们应该在访问这些对象(特别是在通用对象中)的属性之前,始终使用空校验。

source: So, if you're dealing with <strong>value types</strong>, NullReferenceExceptions can <strong>not</strong> occur. Though you need to keep alert when dealing with <strong>reference types</strong>!
es: Por lo tanto, si se trata de <strong>tipos de valores</strong> , NullReferenceExceptions <strong>no</strong> puede ocurrir. &iexcl;Aunque debe mantenerse alerta al tratar con <strong>tipos de referencia</strong> !
ja: したがって、 <strong>値型</strong>を処理している<strong>場合</strong> 、NullReferenceExceptions <strong>は</strong>発生し<strong>ません</strong> 。 ただし、 <strong>参照型</strong>を扱う場合は注意が必要です。
ko: 따라서 <strong>값 유형을</strong> 처리하는 경우 NullReferenceExceptions가 발생할 수 <strong>없습니다</strong> . <strong>참조 유형을</strong> 다룰 때주의를 기울여야 <strong>합니다</strong> !
ru: Таким образом, если вы имеете дело с <strong>типами значений</strong> , NullReferenceExceptions <strong>не</strong> может возникнуть. Хотя вы должны быть начеку, когда имеете дело с <strong>ссылочными типами</strong> !
zh_cn: 因此，如果要处理<strong>值类型</strong> ，则<strong>不会</strong>发生NullReferenceExceptions。 尽管在处理<strong>引用类型</strong>时需要保持警惕！

source: Some common scenarios where the exception can be thrown:
es: Algunos escenarios comunes donde la excepción puede ser lanzada:
ja: 例外が投げられる一般的なシナリオをいくつか紹介します。
ko: 예외가 발생할 수있는 몇 가지 일반적인 시나리오 :
ru: Некоторые распространенные сценарии,в которых можно бросить исключение:
zh_cn: 一些常见的情况下,可以抛出异常情况。

source: Something which your code assumed would initialize an object, did not
es: Algo que su código asumió que inicializaría un objeto,no
ja: あなたのコードでは、オブジェクトを初期化すると想定していたものが、初期化されませんでした。
ko: 코드에서 객체를 초기화한다고 가정했지만
ru: То,что,как предполагал ваш код,инициализирует объект,не было
zh_cn: 你的代码假设会初始化一个对象,但却没有

source: Something you assumed would perform flawlessly to return an initialized object to your code, did not.
es: Algo que usted asumió que funcionaría perfectamente para devolver un objeto inicializado a su código,no lo hizo.
ja: あなたのコードに初期化されたオブジェクトを返すために完璧に実行されると仮定したものは、そうではありませんでした。
ko: 초기화 된 객체를 코드에 반환하기 위해 완벽하게 수행한다고 가정하지는 않았습니다.
ru: То,что вы предполагали выполнить безупречно,чтобы вернуть инициализированный объект в ваш код,не выполнило.
zh_cn: 你以为可以完美无缺地执行的东西,向你的代码中返回一个初始化的对象,却没有。

source: Sometimes the boxing happens in another way. For example with this non-generic extension method:
es: A veces el boxeo ocurre de otra manera.Por ejemplo,con este método de extensión no genérico:
ja: 時々、別の方法でボクシングが起こることがあります。例えばこの非一般的な拡張方法では
ko: 때로는 권투가 다른 방식으로 발생합니다. 예를 들어이 제네릭이 아닌 확장 방법의 경우 :
ru: Иногда бокс происходит по-другому.Например,с помощью этого неэнергетического метода расширения:
zh_cn: 有的时候,拳脚相向是以另一种方式发生的。比如说用这种非通用的扩展方法。

source: Special techniques for debugging and fixing null derefs in iterators
es: Técnicas especiales de depuración y fijación de nulos derefs en los iteradores
ja: イテレータにおけるヌルデフのデバッグと修正のための特別なテクニック
ko: 반복자에서 널 참조를 디버깅하고 수정하는 특수 기술
ru: Специальные методы отладки и фиксации нулевого растрескивания в итераторах
zh_cn: 用于调试和修复迭代器中的null derefs的特殊技术

source: Specifically, in <code>HttpContext.Current.User.Identity.Name</code>, the <code>HttpContext.Current</code> could be null, or the <code>User</code> property could be null, or the <code>Identity</code> property could be null.
es: Espec&iacute;ficamente, en <code>HttpContext.Current.User.Identity.Name</code> , <code>HttpContext.Current</code> podr&iacute;a ser nulo, o la propiedad <code>User</code> podr&iacute;a ser nula, o la propiedad <code>Identity</code> podr&iacute;a ser nula.
ja: 具体的には、 <code>HttpContext.Current.User.Identity.Name</code> では、 <code>HttpContext.Current</code> がnullであるか、 <code>User</code> プロパティがnullであるか、 <code>Identity</code> プロパティがnullである可能性があります。
ko: 특히 <code>HttpContext.Current.User.Identity.Name</code> 에서 <code>HttpContext.Current</code> 는 null이거나 <code>User</code> 속성은 null이거나 <code>Identity</code> 속성은 null 일 수 있습니다.
ru: В частности, в <code>HttpContext.Current.User.Identity.Name</code> значение <code>HttpContext.Current</code> может быть нулевым, либо свойство <code>User</code> может быть нулевым, либо свойство <code>Identity</code> может быть нулевым.
zh_cn: 具体来说，在 <code>HttpContext.Current.User.Identity.Name</code> 中 ， <code>HttpContext.Current</code> 可以为null，或者 <code>User</code> 属性可以为null，或者 <code>Identity</code> 属性可以为null。

source: Suppose I have a class and member method in it. I have not instantiated my class but only named my class. Now if I try to use the method, the compiler will throw an error or issue a warning (depending on the compiler).
es: Supongamos que tengo un método de clase y miembro en él.No he instanciado a mi clase,sino que sólo le he puesto nombre a mi clase.Ahora,si trato de usar el método,el compilador arrojará un error o emitirá una advertencia (dependiendo del compilador).
ja: 私がクラスとその中のメンバーメソッドを持っているとします。私は自分のクラスをインスタンス化していませんが、自分のクラスの名前を付けただけです。このメソッドを使おうとすると、コンパイラがエラーを出したり、警告を出したりします(コンパイラによります)。
ko: 클래스와 멤버 메소드가 있다고 가정하십시오. 클래스를 인스턴스화하지 않았지만 클래스 이름 만 지정했습니다. 이제 메서드를 사용하려고하면 컴파일러에 따라 오류가 발생하거나 경고가 발생합니다 (컴파일러에 따라 다름).
ru: Предположим,у меня есть класс и метод членства в нем.Я не инстанцировал свой класс,а только назвал свой класс.Теперь,если я попытаюсь использовать метод,компилятор выдаст ошибку или предупреждение (в зависимости от компилятора).
zh_cn: 假设我有一个类和成员方法。我没有实例化我的类,只是给我的类命名。现在如果我尝试使用这个方法,编译器会抛出一个错误或发出警告(取决于编译器)。

source: Suppose you have a web form Contact.aspx whose codebehind class is Contact and you have an entity name Contact.
es: Supongamos que tienes un formulario web Contact.aspx cuya clase de código es Contact y tienes un nombre de entidad Contact.
ja: WebフォームContact.aspxのコードバインドクラスがContactで、エンティティ名がContactであるとします。
ko: 코드 숨김 클래스가 Contact 인 웹 양식 Contact.aspx가 있고 엔터티 이름이 Contact이라고 가정합니다.
ru: Предположим,у вас есть веб-форма Contact.aspx,чей кодовым классом является Contact,и у вас есть название организации Contact.
zh_cn: 假设你有一个Web表单Contact.aspx,其代码背后的类是Contact,并且你有一个实体名称为Contact。

source: System.NullReferenceException: Object reference not set to an instance of an object. at Program.Main()
es: Sistema.Excepción de referencia nula:Referencia de objeto no establecida en una instancia de un objeto.en Program.Main()
ja: System.NullReferenceException.オブジェクト参照がオブジェクトのインスタンスに設定されていません。
ko: System.NullReferenceException : 개체 참조가 개체의 인스턴스로 설정되지 않았습니다. Program.Main ()에서
ru: Система.Нульрефлексотерапия:Ссылка на объект не установлена на экземпляр объекта.в Program.Main()
zh_cn: System.NullReferenceException:对象引用未设置为对象的实例。

source: Take the time required to understand the cause of the exception. Inspect for null expressions. Inspect the previous expressions which could have resulted in such null expressions. Add <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">breakpoints</a> and step through the program as appropriate. <em>Use the debugger.</em>
es: T&oacute;mese el tiempo necesario para comprender la causa de la excepci&oacute;n. Inspeccione las expresiones nulas. Inspeccione las expresiones anteriores que podr&iacute;an haber resultado en tales expresiones nulas. Agregue <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">puntos de interrupci&oacute;n</a> y avance por el programa seg&uacute;n corresponda. <em>Usa el depurador.</em>
ja: 例外の原因を理解するのに必要な時間をかけてください。 null式を検査します。 そのようなnull式をもたらす可能性があった前の式を調べます。 <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">ブレークポイント</a>を追加し、必要に応じてプログラムをステップ実行します。 <em>デバッガーを使用します。</em>
ko: 예외의 원인을 이해하는 데 필요한 시간을 가지십시오. 널 표현식을 검사하십시오. 이러한 널 표현식을 초래할 수있는 이전 표현식을 검사하십시오. <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">중단 점을</a> 추가하고 프로그램을 적절히 단계별로 진행하십시오. <em>디버거를 사용하십시오.</em>
ru: Потратьте время, необходимое для понимания причины исключения. Осмотрите для нулевых выражений. Проверьте предыдущие выражения, которые могли привести к таким нулевым выражениям. Добавьте <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">точки останова</a> и, при необходимости, выполните программу. <em>Используйте отладчик.</em>
zh_cn: 花点时间了解异常原因。 检查空表达式。 检查可能导致这种空表达式的先前表达式。 添加<a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/ktf38f66(v=vs.90)">断点</a>并根据需要逐步执行该程序。 <em>使用调试器。</em>

source: That is, make a private helper method that has the iterator block logic, and a public surface method that does the null check and returns the iterator. Now when <code>GetFrobs</code> is called, the null check happens immediately, and then <code>GetFrobsForReal</code> executes when the sequence is iterated.
es: Es decir, cree un m&eacute;todo auxiliar privado que tenga la l&oacute;gica de bloqueo del iterador y un m&eacute;todo de superficie p&uacute;blica que haga la comprobaci&oacute;n nula y devuelva el iterador. Ahora, cuando se llama a <code>GetFrobs</code> , la comprobaci&oacute;n nula ocurre inmediatamente y luego <code>GetFrobsForReal</code> se ejecuta cuando se itera la secuencia.
ja: つまり、イテレータブロックロジックを持つプライベートヘルパーメソッドと、nullチェックを実行してイテレータを返すパブリックサーフェスメソッドを作成します。 <code>GetFrobs</code> が呼び出されるとすぐにnullチェックが発生し、シーケンスが反復されるときに <code>GetFrobsForReal</code> が実行されます。
ko: 즉, 반복자 블록 논리가있는 개인 헬퍼 메소드와 널 점검을 수행하고 반복자를 리턴하는 공용 표면 메소드를 작성하십시오. 이제 <code>GetFrobs</code> 가 호출되면 null 검사가 즉시 수행 된 다음 시퀀스가 ​​반복 될 때 <code>GetFrobsForReal</code> 이 실행됩니다.
ru: То есть создайте частный вспомогательный метод, который имеет блочную логику итератора, и метод открытой поверхности, который выполняет нулевую проверку и возвращает итератор. Теперь, когда <code>GetFrobs</code> , проверка нуля происходит немедленно, и затем <code>GetFrobsForReal</code> выполняется, когда последовательность повторяется.
zh_cn: 也就是说，制作一个具有迭代器块逻辑的私有帮助器方法，以及一个执行空检查并返回迭代器的公共表面方法。 现在， <code>GetFrobs</code> 时，将立即执行空检查，然后在迭代序列时执行 <code>GetFrobsForReal</code> 。

source: That means if any member which doesn&rsquo;t hold any value and we are making that member to perform certain task then the system will undoubtedly toss a message and say-
es: Eso significa que si cualquier miembro que no tiene ning&uacute;n valor y estamos haciendo que ese miembro realice cierta tarea, el sistema arrojar&aacute; indudablemente un mensaje y dir&aacute;:
ja: つまり、値を保持していないメンバーがあり、そのメンバーに特定のタスクを実行させている場合、システムは間違いなくメッセージを投げて、
ko: 즉, 가치가없는 회원이 있고 해당 회원이 특정 작업을 수행하도록하는 경우 시스템은 의심의 여지없이 메시지를 던져
ru: Это означает, что если какой-либо участник, который не имеет никакого значения, и мы заставляем этого участника выполнять определенную задачу, то система, несомненно, бросит сообщение и скажет:
zh_cn: 这意味着，如果有任何成员没有任何价值，而我们正在使该成员执行某些任务，那么系统无疑会抛出一条消息并说：

source: That will throw the error because while I've declared the variable "<code>connection</code>", it's not pointed to anything. When I try to call the member "<code>Open</code>", there's no reference for it to resolve, and it will throw the error.
es: Eso arrojar&aacute; el error porque si bien he declarado la variable " <code>connection</code> ", no apunta a nada. Cuando intento llamar al miembro " <code>Open</code> ", no hay referencia para resolverlo y arrojar&aacute; el error.
ja: 変数 " <code>connection</code> "を宣言しているのに、何も指定されていないため、エラーが発生します。 メンバーを「 <code>Open</code> 」と呼び出そうとすると、解決するための参照がなく、エラーがスローされます。
ko: 변수 " <code>connection</code> "을 선언했지만 아무 것도 가리 키지 않기 때문에 오류가 발생합니다. " <code>Open</code> "멤버를 호출하려고 할 때이를 해결할 참조가 없으며 오류가 발생합니다.
ru: Это приведет к ошибке, потому что, хотя я объявил переменную &laquo; <code>connection</code> &raquo;, она ни на что не указана. Когда я пытаюсь вызвать члена &laquo; <code>Open</code> &raquo;, нет ссылки для его разрешения, и он выдаст ошибку.
zh_cn: 这将引发错误，因为当我声明变量&ldquo; <code>connection</code> &rdquo;时，它没有指向任何东西。 当我尝试将成员称为&ldquo; <code>Open</code> &rdquo;时，没有可解决的引用，它将引发错误。

source: That's why dereferencing both a null pointer and a null reference produces the same exception.
es: Por eso la derivación de un puntero nulo y una referencia nula produce la misma excepción.
ja: NULLポインタとNULL参照の両方を参照解除しても同じ例外が発生するのはそのためです。
ko: 따라서 널 포인터와 널 참조를 모두 역 참조하면 동일한 예외가 발생합니다.
ru: Поэтому разыменование и нулевого указателя,и нулевой ссылки приводит к одному и тому же исключению.
zh_cn: 这就是为什么去掉一个空指针和一个空引用都会产生相同的异常。

source: The .NET runtime will throw a NullReferenceException when you attempt to perform an action on something which hasn't been instantiated i.e. the code above.
es: El tiempo de ejecución .NET lanzará una NullReferenceException cuando intente realizar una acción sobre algo que no haya sido instanciado,es decir,el código anterior.
ja: .NET ランタイムは、インスタンス化されていないもの、つまり上記のコードに対してアクションを実行しようとすると、NullReferenceException をスローします。
ko: .NET 런타임은 인스턴스화되지 않은 무언가, 즉 위의 코드에서 작업을 수행하려고 할 때 NullReferenceException을 발생시킵니다.
ru: Время выполнения .NET вызовет NullReferenceException,когда вы попытаетесь выполнить действие над чем-то,что не было инстанциировано,т.е.над приведенным выше кодом.
zh_cn: 当你试图对没有被实例化的东西执行一个动作时,例如上面的代码,.NET运行时将抛出一个NullReferenceException。

source: The <code>DataAdapter</code> will provide <code>TableNames</code> as shown in the previous example, but it does not parse names from the SQL or database table. As a result, <code>ds.Tables("TICKET_RESERVATION")</code> references a non-existent table.
es: <code>DataAdapter</code> proporcionar&aacute; <code>TableNames</code> como se muestra en el ejemplo anterior, pero no analiza los nombres de la tabla SQL o de la base de datos. Como resultado, <code>ds.Tables("TICKET_RESERVATION")</code> referencia a una tabla inexistente.
ja: <code>DataAdapter</code> は、前の例に示すように <code>TableNames</code> を提供しますが、SQLまたはデータベーステーブルからの名前を解析しません。 その結果、 <code>ds.Tables("TICKET_RESERVATION")</code> は存在しないテーブルを参照します。
ko: <code>DataAdapter</code> 는 이전 예에서와 같이 <code>TableNames</code> 을 제공하지만 SQL 또는 데이터베이스 테이블에서 이름을 구문 분석하지는 않습니다. 결과적으로 <code>ds.Tables("TICKET_RESERVATION")</code> 는 존재하지 않는 테이블을 참조합니다.
ru: <code>DataAdapter</code> предоставит <code>TableNames</code> , как показано в предыдущем примере, но он не анализирует имена из таблицы SQL или базы данных. В результате <code>ds.Tables("TICKET_RESERVATION")</code> ссылается на несуществующую таблицу.
zh_cn: <code>DataAdapter</code> 将提供上一个示例中所示的 <code>TableNames</code> ，但不会解析SQL或数据库表中的名称。 结果， <code>ds.Tables("TICKET_RESERVATION")</code> 引用了不存在的表。

source: The <code>IsDBNull</code> function is used to test if a <em>value</em> equals <code>System.DBNull</code>: <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">From MSDN:</a>
es: La funci&oacute;n <code>IsDBNull</code> se usa para probar si un <em>valor</em> es igual a <code>System.DBNull</code> : <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">desde MSDN:</a>
ja: <code>IsDBNull</code> 関数は、 <em>値</em>が <code>System.DBNull</code> と等しいかどうかをテストするために使用され<em>ます</em> <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">。MSDNから：</a>
ko: <code>IsDBNull</code> 함수는 <em>값</em> 이 <code>System.DBNull</code> 과 같은지 테스트하는 데 사용됩니다 <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">.</a>
ru: Функция <code>IsDBNull</code> используется для проверки того, равно ли <em>значение</em> <code>System.DBNull</code> : <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">из MSDN:</a>
zh_cn: <code>IsDBNull</code> 函数用于测试<em>值是否</em>等于 <code>System.DBNull</code> ： <a href="https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2008/tckcces5(v=vs.90)">来自MSDN：</a>

source: The <code>New</code> operator can often be used to create the instance when you declare it:
es: El operador <code>New</code> menudo se puede usar para crear la instancia cuando la declaras:
ja: <code>New</code> 演算子は、宣言時にインスタンスを作成するためによく使用されます。
ko: <code>New</code> 연산자는 종종 선언 할 때 인스턴스를 만드는 데 사용될 수 있습니다.
ru: Оператор <code>New</code> часто можно использовать для создания экземпляра при его объявлении:
zh_cn: 在声明实例时，通常可以使用 <code>New</code> 运算符来创建实例：

source: The <code>NullReference Exception</code> for <strong>Visual Basic</strong> is no different from the one in <strong>C#</strong>. After all, they are both reporting the same exception defined in the .NET Framework which they both use. Causes unique to Visual Basic are rare (perhaps only one).
es: La <code>NullReference Exception</code> para <strong>Visual Basic</strong> no es diferente de la de <strong>C #</strong> . Despu&eacute;s de todo, ambos informan la misma excepci&oacute;n definida en .NET Framework que ambos usan. Las causas exclusivas de Visual Basic son raras (quiz&aacute;s solo una).
ja: <strong>Visual Basic</strong>の <code>NullReference Exception</code> は、 <strong>C＃の</strong> 例外と同じです。 結局のところ、どちらも.NET Frameworkで定義されている同じ例外を報告しており、どちらも使用しています。 Visual Basicに固有の原因はまれです（おそらく1つのみ）。
ko: <strong>Visual Basic</strong> 의 <code>NullReference Exception</code> 는 <strong>C #의</strong> 예외 와 다르지 않습니다. 결국 둘 다 .NET Framework에 정의 된 것과 동일한 예외를보고합니다. Visual Basic에 고유 한 원인은 거의 없습니다 (아마도 하나만).
ru: <code>NullReference Exception</code> для <strong>Visual Basic</strong> ничем не отличается от <strong>C #</strong> . В конце концов, они оба сообщают об одном и том же исключении, определенном в .NET Framework, которое они оба используют. Причины, уникальные для Visual Basic, встречаются редко (возможно, только одна).
zh_cn: <strong>Visual Basic</strong>的 <code>NullReference Exception</code> 与<strong>C＃中的</strong> 异常相同。 毕竟，它们都报告了它们都使用的.NET Framework中定义的相同异常。 Visual Basic特有的原因很少（也许只有一个）。

source: The <code>new Person</code> only creates an instance of <code>Person</code>, but the <code>Books</code> collection is still <code>null</code>. The collection <code>Initializer</code> syntax does not create a collection for <code>p1.Books</code>, it only translates to the <code>p1.Books.Add(...)</code> statements.
es: La <code>new Person</code> solo crea una instancia de <code>Person</code> , pero la colecci&oacute;n de <code>Books</code> sigue siendo <code>null</code> . La sintaxis de <code>Initializer</code> de la colecci&oacute;n no crea una colecci&oacute;n para <code>p1.Books</code> , solo se traduce en las <code>p1.Books.Add(...)</code> .
ja: <code>new Person</code> は <code>Person</code> のインスタンスを作成するだけですが、 <code>Books</code> コレクションは依然として <code>null</code> です。 コレクション <code>Initializer</code> 構文は、 <code>p1.Books</code> のコレクションを作成せず、 <code>p1.Books.Add(...)</code> ステートメントに変換するだけです。
ko: <code>new Person</code> 은 <code>Person</code> 의 인스턴스 만 생성하지만 <code>Books</code> 컬렉션은 여전히 <code>null</code> 입니다. Collection <code>Initializer</code> 구문은 <code>p1.Books</code> 에 대한 모음을 만들지 <code>p1.Books.Add(...)</code> 문으로 만 변환됩니다.
ru: <code>new Person</code> только создает экземпляр <code>Person</code> , но коллекция <code>Books</code> по-прежнему <code>null</code> . Синтаксис <code>Initializer</code> коллекции не создает коллекцию для <code>p1.Books</code> , он только транслируется в <code>p1.Books.Add(...)</code> .
zh_cn: <code>new Person</code> 只创建Person的一个实例，但是 <code>Books</code> 集合仍然为 <code>null</code> 。 集合 <code>Initializer</code> 语法不会为 <code>p1.Books</code> 创建一个集合，它仅转换为 <code>p1.Books.Add(...)</code> 语句。

source: The <code>runtime</code> throwing a <code>NullReferenceException</code><strong>always</strong> means the same thing: you are trying to use a reference, and the reference is not initialized (or it was <em>once</em> initialized, but is <em>no longer</em> initialized).
es: El <code>runtime</code> arroja una <code>NullReferenceException</code> <strong>siempre</strong> significa lo mismo: est&aacute; tratando de usar una referencia, y la referencia no se inicializa (o se inicializ&oacute; <em>una vez</em> , pero <em>ya no se</em> inicializa).
ja: <code>runtime</code> が <code>NullReferenceException</code> をスローすることは、 <strong>常に</strong>同じことを意味します。参照を使用しようとしているが、参照が初期化されていない（または、 <em>一度</em>初期化されたが、初期化されてい<em>ない</em> ）。
ko: <code>NullReferenceException</code> 을 던지는 <code>runtime</code> 은 <strong>항상</strong> 같은 것을 의미합니다. 참조를 사용하려고 시도하고 있고 참조가 초기화되지 않았거나 <em>한 번</em> 초기화되었지만 <em>더 이상</em> 초기화 <em>되지 않았습니다</em> .
ru: Время <code>runtime</code> выбрасывающее <code>NullReferenceException</code> <strong>всегда</strong> означает одно и то же: вы пытаетесь использовать ссылку, и ссылка не инициализируется (или была <em>однажды</em> инициализирована, но <em>больше не</em> инициализирована).
zh_cn: <code>runtime</code> 抛出 <code>NullReferenceException</code> <strong>总是</strong>意味着同一件事：您正在尝试使用引用，并且该引用未初始化（或者<em>曾经</em>被初始化，但是<em>不再</em>初始化）。
