Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: It also arises when we forget to instantiate our objects. Using methods, properties, collections etc. which can return or set null values can also be the cause of this exception.
es: También surge cuando olvidamos instanciar nuestros objetos.El uso de métodos,propiedades,colecciones,etc.que pueden devolver o establecer valores nulos también puede ser la causa de esta excepción.
ja: また、オブジェクトのインスタンス化を忘れたときにも発生します。null 値を返したり設定したりできるメソッドやプロパティ、コレクションなどを使用すると、この例外が発生することがあります。
ko: 객체를 인스턴스화하는 것을 잊었을 때도 발생합니다. null 값을 반환하거나 설정할 수있는 메서드, 속성, 컬렉션 등을 사용하는 것도이 예외의 원인 일 수 있습니다.
ru: Она также возникает,когда мы забываем конкретизировать наши объекты.Использование методов,свойств,коллекций и т.д.,которые могут возвращать или устанавливать нулевые значения,также может быть причиной этого исключения.
zh_cn: 当我们忘记实例化我们的对象时,也会出现这种异常。使用方法、属性、集合等可以返回或设置空值的方法、属性、集合等也会导致这种异常。

source: It is curious that VB does not provide a warning, but the remedy is to <strong>declare</strong> the containers at the form level, but <strong>initialize</strong> them in form load event handler when the controls <strong>do</strong> exist. This can be done in <code>Sub New</code> as long as your code is after the <code>InitializeComponent</code> call:
es: Es curioso que VB no proporcione una advertencia, pero el remedio es <strong>declarar</strong> los contenedores a nivel de formulario, pero <strong>inicializarlos</strong> en el controlador de eventos de carga de formulario cuando existan los controles. Esto se puede hacer en <code>Sub New</code> siempre que su c&oacute;digo sea posterior a la llamada <code>InitializeComponent</code> :
ja: VBが警告を出さないのは不思議ですが、救済策はフォームレベルでコンテナーを<strong>宣言</strong>する<strong>ことです</strong>が、コントロール<strong>が</strong>存在する場合はフォームロードイベントハンドラーでそれらを<strong>初期化</strong> <strong>し</strong>ます。 コードが <code>InitializeComponent</code> 呼び出しの後であれば、これは <code>Sub New</code> で実行できます。
ko: VB가 경고를 제공하지 않는 것이 궁금하지만 해결 방법은 컨테이너를 양식 레벨에서 <strong>선언</strong> 하는 것이지만 컨트롤 <strong>이</strong> 존재하면 양식로드 이벤트 핸들러에서 컨테이너를 <strong>초기화</strong> 하는 것입니다. 코드가 <code>InitializeComponent</code> 호출 이후에있는 한 <code>Sub New</code> 에서 수행 할 수 있습니다.
ru: Любопытно, что VB не выдает предупреждение, но решение состоит в том, чтобы <strong>объявить</strong> контейнеры на уровне формы, но <strong>инициализировать</strong> их в обработчике события загрузки формы, когда элементы управления существуют. Это можно сделать в <code>Sub New</code> , если ваш код находится после вызова <code>InitializeComponent</code> :
zh_cn: 奇怪的是，VB没有提供警告，但补救措施是在窗体级别<strong>声明</strong>容器，但在控件<strong>确实</strong>存在时在窗体加载事件处理程序中<strong>初始化</strong>它们。 只要您的代码在 <code>InitializeComponent</code> 调用之后，就可以在 <code>Sub New</code> 中完成：

source: It is not possible to reference anything 'downstream' of a <code>null</code> object. This also applies to controls:
es: No es posible hacer referencia a nada 'aguas abajo' de un objeto <code>null</code> . Esto tambi&eacute;n se aplica a los controles:
ja: <code>null</code> オブジェクトの「下流」を参照することはできません。 これはコントロールにも適用されます。
ko: <code>null</code> 오브젝트의 '다운 스트림'을 참조 할 수 없습니다. 이것은 컨트롤에도 적용됩니다.
ru: Невозможно ссылаться на что-либо &laquo;вниз по потоку&raquo; от <code>null</code> объекта. Это также относится к элементам управления:
zh_cn: 不可能引用任何 <code>null</code> 对象的&ldquo;下游&rdquo;。 这也适用于控件：

source: It means that the variable in question is pointed at nothing. I could generate this like so:
es: Significa que la variable en cuestión no apunta a nada.Podría generar esto así:
ja: 問題の変数が何も指していないことを意味します。こんな感じで生成できました。
ko: 문제의 변수가 아무것도 가리 키지 않았 음을 의미합니다. 나는 이것을 이렇게 생성 할 수있다 :
ru: Это означает,что рассматриваемая переменная ни на что не указывает.Я мог бы сгенерировать это так:
zh_cn: 意思是说,这个变量指向的是什么都不是。我可以这样生成。

source: It means your code used an object reference variable that was set to null (i.e. it did not reference an actual object instance).
es: Significa que su código utilizó una variable de referencia de objeto que se fijó en nulo (es decir,no hizo referencia a una instancia de objeto real).
ja: これは、あなたのコードがnullに設定されたオブジェクト参照変数を使用していることを意味します(つまり、実際のオブジェクトのインスタンスを参照していないことを意味します)。
ko: 이는 코드에서 null로 설정된 객체 참조 변수를 사용했음을 의미합니다 (즉, 실제 객체 인스턴스를 참조하지 않음).
ru: Это означает,что в вашем коде использовалась переменная ссылка на объект,которая была установлена в ноль (т.е.она не ссылалась на фактический экземпляр объекта).
zh_cn: 这意味着你的代码使用了一个被设置为空的对象引用变量(即它没有引用一个实际的对象实例)。

source: It will throw a <code>NullReferenceException</code> on the cast. It seems quite obvious in the above sample, but this can happen in more "late-binding" intricate scenarios where the null object has been returned from some code you don't own, and the cast is for example generated by some automatic system.
es: <code>NullReferenceException</code> una NullReferenceException en el elenco. Parece bastante obvio en el ejemplo anterior, pero esto puede suceder en escenarios m&aacute;s intrincados de "enlace tard&iacute;o" en los que el objeto nulo ha sido devuelto por alg&uacute;n c&oacute;digo que no es de su propiedad, y el reparto es generado, por ejemplo, por alg&uacute;n sistema autom&aacute;tico.
ja: キャストで <code>NullReferenceException</code> をスローします。 上記のサンプルではそれは明らかなようですが、これは、所有していないコードからnullオブジェクトが返され、キャストがたとえば自動システムによって生成された、より「遅延バインディング」の複雑なシナリオで発生する可能性があります。
ko: 캐스트에서 <code>NullReferenceException</code> 이 발생합니다. 위의 샘플에서는 매우 분명해 보이지만 소유하지 않은 일부 코드에서 null 객체가 반환되고 캐스트가 일부 자동 시스템에 의해 생성되는보다 "늦은 바인딩"복잡한 시나리오에서 발생할 수 있습니다.
ru: Это бросит <code>NullReferenceException</code> на приведение. Это кажется вполне очевидным в приведенном выше примере, но это может произойти в более сложных запоздалых сценариях, когда нулевой объект был возвращен из некоторого кода, который вам не принадлежит, и приведение, например, генерируется некоторой автоматической системой.
zh_cn: 它将在演员表上抛出 <code>NullReferenceException</code> 。 在上面的示例中，这似乎很明显，但是这可能发生在更复杂的&ldquo;后期绑定&rdquo;场景中，其中空对象是从您不拥有的某些代码中返回的，而强制转换例如是由某些自动系统生成的。

source: It would be nice if C# had something like the <code>NotNull&lt;T&gt;</code> struct above and had a similar shorthand, maybe the exclamation point (!) so that you could write something like: <code>public void WriteName(Person! person)</code>.
es: Ser&iacute;a bueno que C # tuviera algo como la <code>NotNull&lt;T&gt;</code> anterior y tuviera una taquigraf&iacute;a similar, tal vez el signo de exclamaci&oacute;n (!) Para que pueda escribir algo como: <code>public void WriteName(Person! person)</code> .
ja: C＃に上記の <code>NotNull&lt;T&gt;</code> 構造体のようなものがあり、同様の省略形、おそらく感嘆符（！）があれば、 <code>public void WriteName(Person! person)</code> ように書くことができればいいでしょう。
ko: C #에 위의 <code>NotNull&lt;T&gt;</code> 구조체와 같은 것이 있고 느낌표 (!)와 비슷한 속기 (!)가 있으면 <code>public void WriteName(Person! person)</code> 과 같이 쓸 수 있습니다.
ru: Было бы хорошо, если бы C # имел что-то вроде структуры <code>NotNull&lt;T&gt;</code> выше и имел бы подобную стенограмму, может быть, восклицательный знак (!), Чтобы вы могли написать что-то вроде: <code>public void WriteName(Person! person)</code> .
zh_cn: 如果C＃上面有类似 <code>NotNull&lt;T&gt;</code> 结构，并且具有类似的速记（也许是感叹号（！）），那么您可以这样写： <code>public void WriteName(Person! person)</code> 。

source: It's a great feature, but it gives you less information. It doesn't make it obvious which of the 4 is null.
es: Es una gran característica,pero te da menos información.No hace obvio cuál de los 4 es nulo.
ja: 素晴らしい機能ですが、情報量が少ないです。4のうちどれがヌルなのかが明らかにならない。
ko: 훌륭한 기능이지만 적은 정보를 제공합니다. 4 중 어느 것이 null인지는 분명하지 않습니다.
ru: Это отличная функция,но она дает меньше информации.Это не делает очевидным,какой из 4-х является нулевым.
zh_cn: 这是一个很好的功能,但它给你的信息比较少。它并不能让你明显地看出这4个中的哪一个是空的。

source: It's used to test for null before performing a member access (?.) or index (?[) operation.
es: Se utiliza para comprobar la nulidad antes de realizar una operación de acceso (?.)o de indexación (?[).
ja: これは、メンバーアクセス(?)やインデックス(?[)操作を実行する前に、NULLをテストするために使用されます。
ko: 멤버 액세스 (?.) 또는 인덱스 (? [) 조작을 수행하기 전에 널을 테스트하는 데 사용됩니다.
ru: Используется для проверки на ноль перед выполнением операции доступа к члену (?)или индекса (?[).
zh_cn: 它用于在执行成员访问(?)或索引(?[)操作之前测试空值。

source: Jagged Arrays
es: Arreglos dentados
ja: ジャグド配列
ko: 들쭉날쭉 한 배열
ru: зубчатые рейки
zh_cn: 锯齿形阵列

source: JetBrains' Resharper tool will identify every place in your code that has the possibility of a null reference error, allowing you to put in a null check. This error is the number one source of bugs, IMHO.
es: La herramienta Resharper de JetBrains identificará cada lugar de su código que tenga la posibilidad de un error de referencia nulo,permitiéndole hacer una comprobación nula.Este error es la fuente número uno de errores,IMHO.
ja: JetBrainsのResharperツールは、コード内のヌル参照エラーの可能性がある箇所をすべて特定し、ヌルチェックを行うことができます。このエラーはバグの一番の原因です。
ko: JetBrains의 Resharper 도구는 코드에서 null 참조 오류가 발생할 가능성이있는 모든 위치를 식별하여 null 검사를 수행 할 수 있습니다. 이 오류는 버그의 가장 큰 원인 인 IMHO입니다.
ru: Инструмент Resharper от JetBrains определит каждое место в вашем коде,которое имеет возможность ошибки нулевой ссылки,позволяя вам поставить нулевую проверку.Эта ошибка является источником ошибок номер один,IMHO.
zh_cn: JetBrains的Resharper工具将识别出代码中每一个可能出现空引用错误的地方,让你可以进行空检查。这个错误是造成BUG的头号源头,IMHO。

source: Key Points
es: Puntos clave
ja: キーポイント
ko: 키 포인트
ru: Ключевые точки
zh_cn: 关键点

source: LINQ <code>FirstOrDefault()</code> and <code>SingleOrDefault()</code>
es: LINQ <code>FirstOrDefault()</code> y <code>SingleOrDefault()</code>
ja: LINQ <code>FirstOrDefault()</code> および <code>SingleOrDefault()</code>
ko: LINQ <code>FirstOrDefault()</code> 및 <code>SingleOrDefault()</code>
ru: LINQ <code>FirstOrDefault()</code> и <code>SingleOrDefault()</code>
zh_cn: LINQ <code>FirstOrDefault()</code> 和 <code>SingleOrDefault()</code>

source: Like anything else, <code>null</code> gets passed around. If it is <code>null</code><em>in</em> method "A", it could be that method "B" passed a <code>null</code><em>to</em> method "A".
es: Como cualquier otra cosa, se pasa <code>null</code> . Si es <code>null</code> <em>en el</em> m&eacute;todo "A", podr&iacute;a ser que el m&eacute;todo "B" pas&oacute; un <code>null</code> <em>al</em> m&eacute;todo "A".
ja: 他と同様に、 <code>null</code> が渡されます。 メソッド「A」で <code>null</code> の場合、メソッド「B」がメソッド「A」に <code>null</code> <em>を</em>渡した可能性があります 。
ko: 다른 것과 마찬가지로 <code>null</code> 도 전달됩니다. 메소드 "A" <em>에서</em> <code>null</code> 경우, 메소드 "B" <em>가</em> 메소드 "A"에 <code>null</code> <em>을</em> 전달했을 수 있습니다.
ru: Как и все остальное, <code>null</code> передается. Если <em>в</em> методе &laquo;A&raquo; он равен <code>null</code> , возможно, метод &laquo;B&raquo; передал <code>null</code> методу &laquo;A&raquo;.
zh_cn: 像其他任何东西一样， <code>null</code> 会被传递出去。 如果<em>在</em>方法&ldquo; A&rdquo;中为 <code>null</code> ，则可能是方法&ldquo; B&rdquo; <em>向</em>方法&ldquo; A&rdquo;传递了 <code>null</code> 。

source: Likewise, for arrays you can use <code>?[i]</code> as follows:
es: Del mismo modo, para las matrices puede usar <code>?[i]</code> siguiente manera:
ja: 同様に、配列の場合は、 <code>?[i]</code> を次のように使用できます。
ko: 마찬가지로 배열의 경우 다음과 같이 <code>?[i]</code> 를 사용할 수 있습니다.
ru: Аналогично, для массивов вы можете использовать <code>?[i]</code> следующим образом:
zh_cn: 同样，对于数组，可以使用 <code>?[i]</code> ，如下所示：

source: Lists and Collection will simply be empty
es: Las listas y la colección simplemente estarán vacías
ja: リストとコレクションは単に空になります。
ko: 목록과 컬렉션은 단순히 비어 있습니다
ru: Списки и Коллекция будут просто пустыми
zh_cn: 列表和集合将是空的

source: Lists and Collections
es: Listas y colecciones
ja: リストとコレクション
ko: 리스트와 컬렉션
ru: Списки и коллекции
zh_cn: 列表和收藏品

source: Literally the easiest way to fix a NullReferenceExeption has two ways. If you have a GameObject for example with a script attached and a variable named rb (rigidbody) this variable will start null when you start your game.
es: Literalmente,la forma más fácil de arreglar una Exepción de Referencia Nula tiene dos maneras.Si tienes un GameObject por ejemplo con un script adjunto y una variable llamada rb (rigidbody)esta variable comenzará nula cuando empieces el juego.
ja: NullReferenceExeptionを修正する最も簡単な方法は2つあります。例えば、スクリプトをアタッチしたGameObjectとrb(rididbody)という名前の変数がある場合、この変数はゲームを開始したときにNULLになります。
ko: 말 그대로 NullReferenceExeption을 수정하는 가장 쉬운 방법은 두 가지 방법이 있습니다. 예를 들어 스크립트가 첨부 된 게임 오브젝트와 rb (rigidbody)라는 변수가있는 경우 게임을 시작할 때이 변수는 null로 시작합니다.
ru: Буквально самый простой способ исправить NullReferenceExeption имеет два пути.Если у вас есть объект GameObject,например,с прикрепленным скриптом и переменной rb (жесткое тело),то эта переменная начнет с нуля,когда вы начнете игру.
zh_cn: 从字面上看,修复NullReferenceExeption最简单的方法有两种。如果你有一个GameObject,比如说你有一个附加脚本的GameObject,并且有一个名为rb(rigidbody)的变量,当你启动游戏的时候,这个变量就会开始空。

source: MSDN NullReference Exception
es: Excepción de referencia nula de MSDN
ja: MSDN NullReference例外
ko: MSDN NullReference 예외
ru: Исключение из правил MSDN NullReference

source: MSDN: Best Practices for Exceptions
es: MSDN:Mejores prácticas para las excepciones
ja: MSDN.例外のベストプラクティス
ko: MSDN : 예외에 대한 모범 사례
ru: MSDN:Передовая практика для исключений
zh_cn: MSDN。例外的最佳做法

source: MSDN: How to: Use the Try/Catch Block to Catch Exceptions
es: MSDN:Cómo:Usar el bloque TryCatch para capturar excepciones
ja: MSDN.How to.TryCatch ブロックを使用して例外をキャッチする
ko: MSDN : 방법 : Try / Catch 블록을 사용하여 예외 포착
ru: MSDN:Как:Используйте блок TryCatch,чтобы поймать исключений
zh_cn: MSDN。How to:使用 TryCatch 块来捕获异常

source: Memory is virtualized in <code>Windows</code>; each process gets a virtual memory space of many "pages" of memory that are tracked by the operating system. Each page of memory has flags set on it which determine how it may be used: read from, written to, executed, and so on. The <em>lowest</em> page is marked as "produce an error if ever used in any way".
es: La memoria est&aacute; virtualizada en <code>Windows</code> ; cada proceso obtiene un espacio de memoria virtual de muchas "p&aacute;ginas" de memoria que son rastreadas por el sistema operativo. Cada p&aacute;gina de memoria tiene marcas establecidas que determinan c&oacute;mo se puede usar: leer, escribir, ejecutar, etc. La p&aacute;gina <em>m&aacute;s baja</em> est&aacute; marcada como "producir un error si alguna vez se usa de alguna manera".
ja: メモリは <code>Windows</code> で仮想化されています 。 各プロセスは、オペレーティングシステムによって追跡されるメモリの多くの「ページ」の仮想メモリ空​​間を取得します。 メモリの各ページにはフラグが設定されており、使用方法（読み取り、書き込み、実行など）を決定します。 <em>一番下の</em>ページは、「なんらかの方法で使用するとエラーが発生する」とマークされます。
ko: 메모리는 <code>Windows</code> 에서 가상화됩니다. 각 프로세스는 운영 체제에서 추적하는 많은 "페이지"메모리의 가상 메모리 공간을 확보합니다. 각 메모리 페이지에는 읽기, 쓰기, 실행 등 사용 방법을 결정하는 플래그가 설정되어 있습니다. <em>가장 낮은</em> 페이지는 "어쨌든 사용 된 경우 오류 생성"으로 표시됩니다.
ru: Память виртуализирована в <code>Windows</code> ; каждый процесс получает пространство виртуальной памяти из множества &laquo;страниц&raquo; памяти, которые отслеживаются операционной системой. На каждой странице памяти установлены флаги, которые определяют, как ее можно использовать: чтение, запись, выполнение и т. Д. Самая <em>нижняя</em> страница помечена как &laquo;выдает ошибку, если когда-либо использовалась каким-либо образом&raquo;.
zh_cn: 内存在 <code>Windows</code> 中虚拟化; 每个进程都会获得由操作系统跟踪的许多&ldquo;页面&rdquo;内存的虚拟内存空间。 内存的每一页上都设置了标志，这些标志确定如何使用它：读取，写入，执行等。 <em>最低的</em>页面被标记为&ldquo;如果以任何方式使用都会产生错误&rdquo;。

source: Methods call you expect to return an instance can return <code>null</code>, for example when the object being sought cannot be found. You can choose to return a default value when this is the case:
es: Los m&eacute;todos de llamada que espera devolver una instancia pueden devolver <code>null</code> , por ejemplo, cuando no se puede encontrar el objeto que se busca. Puede elegir devolver un valor predeterminado cuando este es el caso:
ja: たとえば、探しているオブジェクトが見つからない場合など、インスタンスを返すと予想されるメソッド呼び出しは <code>null</code> を返す可能性があります。 この場合、デフォルト値を返すように選択できます。
ko: 찾고있는 객체를 찾을 수없는 경우와 같이 인스턴스를 반환 할 것으로 예상되는 메서드 호출은 <code>null</code> 을 반환 할 수 있습니다. 이 경우 기본값을 반환하도록 선택할 수 있습니다.
ru: Вызов методов, которые вы ожидаете вернуть экземпляр, может вернуть <code>null</code> , например, когда искомый объект не может быть найден. Вы можете вернуть значение по умолчанию, если это так:
zh_cn: 您期望返回实例的方法调用可以返回 <code>null</code> ，例如，在找不到要查找的对象时。 在这种情况下，您可以选择返回默认值：

source: More Specifically
es: Más específicamente
ja: より具体的には
ko: 더 구체적으로
ru: Более конкретно
zh_cn: 更多具体内容

source: More information is in <em><a href="https://www.dotnetperls.com/nullreferenceexception">C# NullReferenceException and Null Parameter</a></em>.
es: M&aacute;s informaci&oacute;n est&aacute; en <em><a href="https://www.dotnetperls.com/nullreferenceexception">C # NullReferenceException y Null Parameter</a></em> .
ja: 詳細については、 <em><a href="https://www.dotnetperls.com/nullreferenceexception">C＃NullReferenceExceptionおよびNull Parameterを参照して</a></em>ください。
ko: 자세한 내용은 <em><a href="https://www.dotnetperls.com/nullreferenceexception">C # NullReferenceException 및 Null Parameter에</a></em> 있습니다.
ru: Больше информации в <em><a href="https://www.dotnetperls.com/nullreferenceexception">C # NullReferenceException и Null Parameter</a></em> .
zh_cn: 有关更多信息，请参见<em><a href="https://www.dotnetperls.com/nullreferenceexception">C＃NullReferenceException和Null参数</a></em> 。

source: More realistic example - select nodes from XML document. Will throw if nodes are not found but initial debugging shows that all properties valid:
es: Un ejemplo más realista:seleccionar nodos del documento XML.Se lanzará si no se encuentran nodos pero la depuración inicial muestra que todas las propiedades son válidas:
ja: より現実的な例-XML ドキュメントからノードを選択します。ノードが見つからない場合にスローされますが、最初のデバッグではすべてのプロパティが有効であることが示されています。
ko: 보다 현실적인 예-XML 문서에서 노드를 선택하십시오. 노드를 찾을 수 없지만 초기 디버깅에서 모든 속성이 유효한 것으로 표시되면 throw됩니다.
ru: Более реалистичный пример-выберите узлы из XML-документа.Будет бросаться,если узлы не найдены,но начальная отладка показывает,что все свойства действительны:
zh_cn: 更现实的例子--从XML文档中选择节点。如果没有找到节点,将抛出,但初始调试显示所有属性有效。

source: My.Settings (StringCollection)
ko: 내 설정 (StringCollection)
ru: Мои.настройки (StringCollection)

source: Name the columns manually, or reference by index:
es: Nombrar las columnas manualmente,o la referencia por el índice:
ja: カラムに手動で名前を付けるか、インデックスで参照します。
ko: 열 이름을 수동으로 지정하거나 색인으로 참조하십시오.
ru: Назовите столбцы вручную или ссылку по индексу:
zh_cn: 手动命名列,或按索引参考。

source: Nested Collection Initializers
es: Iniciadores de la colección anidada
ja: 入れ子になったコレクション初期化子
ko: 중첩 컬렉션 이니셜 라이저
ru: Инициализаторы вложенной коллекции
zh_cn: 嵌套收集初始化器

source: Nested Object Initializers
es: Inicializadores de objetos anidados
ja: 入れ子になったオブジェクトの初期化子
ko: 중첩 객체 이니셜 라이저
ru: Инициализаторы вложенных объектов
zh_cn: 嵌套对象初始化器

source: New Operator
es: Nuevo operador
ja: 新オペレーター
ko: 새로운 연산자
ru: Новый оператор
zh_cn: 新操作员

source: Note: <strong>Do not</strong> use <code>Dim</code> again in a procedure, including the constructor (<code>Sub New</code>):
es: Nota: <strong>No</strong> use <code>Dim</code> nuevamente en un procedimiento, incluido el constructor ( <code>Sub New</code> ):
ja: 注：コンストラクター（ <code>Sub New</code> ）を含むプロシージャで <code>Dim</code> を再度使用<strong>しないでください</strong> 。
ko: 참고 : 생성자 ( <code>Sub New</code> )를 포함하여 프로 시저에서 <code>Dim</code> 을 다시 사용 <strong>하지 마십시오</strong> .
ru: Примечание: <strong>не</strong> используйте <code>Dim</code> снова в процедуре, включая конструктор ( <code>Sub New</code> ):
zh_cn: 注意： <strong>不要</strong>在过程中再次使用 <code>Dim</code> ，包括构造函数（ <code>Sub New</code> ）：

source: Note: Beginning with VS 2010, when initializing a local array using a literal and <code>Option Infer</code>, the <code>As &lt;Type&gt;</code> and <code>New</code> elements are optional:
es: Nota: a partir de VS 2010, cuando se inicializa una matriz local utilizando un literal y una <code>Option Infer</code> , los elementos <code>As &lt;Type&gt;</code> y <code>New</code> son opcionales:
ja: 注：VS 2010以降、リテラルと <code>Option Infer</code> を使用してローカル配列を初期化する場合、 <code>As &lt;Type&gt;</code> および <code>New</code> 要素はオプションです。
ko: 참고 : VS 2010부터 리터럴 및 <code>Option Infer</code> 를 사용하여 로컬 배열을 초기화 할 때 <code>As &lt;Type&gt;</code> 및 <code>New</code> 요소는 선택 사항입니다.
ru: Примечание. Начиная с VS 2010, при инициализации локального массива с использованием литерала и <code>Option Infer</code> элементы <code>As &lt;Type&gt;</code> и <code>New</code> являются необязательными:
zh_cn: 注意：从VS 2010开始，使用文字和 <code>Option Infer</code> 初始化本地数组时， <code>As &lt;Type&gt;</code> 和 <code>New</code> 元素是可选的：

source: Now the title variable will be null instead of throwing an exception. C# 6 introduces a shorter syntax for this:
es: Ahora la variable del título será nula en lugar de lanzar una excepción.C#6 introduce una sintaxis más corta para esto:
ja: これで、タイトル変数は例外を投げる代わりにNULLになります。C#6では、このためのより短い構文が導入されています。
ko: 이제 제목 변수는 예외를 던지는 대신 null이됩니다. C # 6은 이에 대한 더 짧은 구문을 소개합니다.
ru: Теперь вместо того,чтобы бросить исключение,переменная заголовка будет нулевой.C#6 вводит более короткий синтаксис:
zh_cn: 现在标题变量将为空,而不是抛出一个异常。C#6为此引入了一个更短的语法。

source: Now you are accessing this prop1 in some other class just like below:
es: Ahora estás accediendo a esta prop1 en alguna otra clase como la de abajo:
ja: このprop1は、以下のように他のクラスでアクセスしています。
ko: 이제 다음과 같이 다른 클래스 에서이 prop1에 액세스하고 있습니다.
ru: Теперь вы получаете доступ к этому prop1 в каком-то другом классе,как показано ниже:
zh_cn: 现在你在其他类中访问这个道具1,就像下面这样。

source: Now, consider another class where you are trying to retrieve the student's full name.
es: Ahora,considere otra clase en la que intente recuperar el nombre completo del estudiante.
ja: さて、別のクラスで学生のフルネームを取得しようとしている場合を考えてみましょう。
ko: 이제 학생의 전체 이름을 검색하려는 다른 수업을 고려하십시오.
ru: Теперь рассмотрим другой класс,где ты пытаешься получить полное имя ученика.
zh_cn: 现在,再来考虑另一个班级,你想找回学生的全名。

source: Now, when I try to print the length of the string <strong>str</strong>, I do get <em>An unhandled exception of type &lsquo;System.NullReferenceException&rsquo; occurred</em> message because member <strong>str</strong> is pointing to null and there can&rsquo;t be any length of null.
es: Ahora, cuando intento imprimir la longitud de la cadena <strong>str</strong> , recibo <em>un</em> mensaje <em>de excepci&oacute;n no controlada del tipo 'System.NullReferenceException'</em> porque la <strong>cadena</strong> miembro apunta a nulo y no puede haber ninguna longitud nula.
ja: ここで、文字列<strong>strの</strong>長さを出力しようとすると、メンバー<strong>str</strong>がnullを指しているため、長さがnullであってはならないため、 <em>「System.NullReferenceException」タイプの未処理の例外が発生しました</em> 。
ko: 이제 문자열 <strong>str</strong> 의 길이를 인쇄하려고하면 멤버 <strong>str</strong> 이 null을 가리키고 null 길이를 가질 수 없으므로 <em>'System.NullReferenceException'유형의 처리되지 않은 예외가 발생했습니다</em> .
ru: Теперь, когда я пытаюсь напечатать длину строки <strong>str</strong> , я получаю сообщение о <em>необработанном исключении типа &laquo;System.NullReferenceException&raquo;,</em> потому что член <strong>str</strong> указывает на ноль и не может быть никакой длины ноль.
zh_cn: 现在，当我尝试打印字符串<strong>str</strong>的长度时，我确实得到了<em>一条类型为'System.NullReferenceException'的未处理的异常</em>消息，因为成员<strong>str</strong>指向null并且不能有任何长度的null。

source: Now, when the NullReferenceException is thrown (or unhandled) the debugger will stop (remember the rule set above?) on the line on which the exception occurred. Sometimes the error will be easy to spot.
es: Ahora,cuando la excepción de la referencia nula es lanzada (o desatendida)el depurador se detendrá (¿recuerda la regla establecida anteriormente?)en la línea en la que se produjo la excepción.A veces el error será fácil de detectar.
ja: さて、NullReferenceException がスローされた (または処理されなかった)場合、デバッガは例外が発生した行で停止します (上記のルールを覚えていますか?)。時には、エラーを簡単に見つけることができます。
ko: 이제 NullReferenceException이 발생하거나 처리되지 않으면 디버거는 예외가 발생한 행에서 중지됩니다 (위의 규칙을 기억하십니까?). 때로는 오류를 쉽게 발견 할 수 있습니다.
ru: Теперь,когда NullReferenceException брошен (или не обработан),отладчик остановится (помните вышеприведенное правило?)на той строке,на которой произошло исключение.Иногда ошибку будет легко обнаружить.
zh_cn: 现在,当NullReferenceException被抛出(或未处理)时,调试器会在异常发生的行上停止(还记得上面设定的规则吗?)。有时,错误会很容易被发现。
