Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: If you are expecting the type conversion to always succeed (ie. you know what the object should be ahead of time), then you should use a cast:
es: Si esperas que la conversión de tipos siempre tenga éxito (es decir,sabes de antemano cuál debe ser el objeto),entonces debes usar un molde:
ja: 型変換が常に成功することを期待している場合(つまり、オブジェクトが何であるべきかを事前に知っている場合)は、キャストを使うべきです。
ko: 타입 변환이 항상 성공할 것으로 기대한다면 (즉, 객체가 무엇보다 앞서야하는지 알고 있다면) 캐스트를 사용해야합니다.
ru: Если вы ожидаете,что преобразование типа всегда будет успешным (т.е.вы заранее знаете,каким должен быть объект),то вам следует использовать приведение:
zh_cn: 如果你期望类型转换总是成功的(即你提前知道对象应该是什么),那么你应该使用 cast。

source: If you are unsure of the type, but you want to <em>try</em> to use it as a specific type, then use <code>as</code>:
es: Si no est&aacute; seguro del tipo, pero desea <em>intentar</em> usarlo como un tipo espec&iacute;fico, use <code>as</code> :
ja: タイプがわからないが、特定のタイプとして使用したい場合は、次のように使用 <code>as</code> ます。
ko: 유형이 확실하지 않지만 특정 유형으로 사용하려는 경우 다음 <code>as</code> 사용하십시오.
ru: Если вы не уверены в типе, но хотите <em>попробовать</em> использовать его как конкретный тип, используйте:
zh_cn: 如果不确定类型，但想<em>尝试</em>将其用作特定类型，请使用：

source: If you are working with unsafe code and you get a null dereference exception, just be aware that the offending pointer need not be null. It can be any location in the lowest page, and this exception will be produced.
es: Si estás trabajando con un código inseguro y obtienes una excepción de dereferencia nula,sólo ten en cuenta que el puntero ofensivo no tiene por qué ser nulo.Puede estar en cualquier lugar de la página más baja,y esta excepción se producirá.
ja: 安全ではないコードで作業をしていて、NULL 宣言解除例外が発生した場合、問題となるポインタは NULL である必要はないことに注意してください。最下層ページのどの位置でもよいのですが、この例外が発生します。
ko: 안전하지 않은 코드로 작업하고 null 역 참조 예외가 발생하는 경우 문제가되는 포인터가 null 일 필요는 없습니다. 가장 낮은 페이지의 어느 위치 에나있을 수 있으며이 예외가 발생합니다.
ru: Если вы работаете с небезопасным кодом и получаете исключение по нулевой ссылке,просто знайте,что указатель-нарушитель не обязательно должен быть нулевым.Это может быть любое место на самой нижней странице,и это исключение будет произведено.
zh_cn: 如果你正在使用不安全的代码,并且得到一个null dereference异常,只需注意,违规的指针不需要是null。它可以是最底层页面中的任何位置,这个异常就会产生。

source: If you do use a <code>For n</code> loop, modify the row count or use <code>Exit For</code> when <code>IsNewRow</code> is true.
es: Si usa un bucle <code>For n</code> , modifique el recuento de filas o use <code>Exit For</code> cuando <code>IsNewRow</code> sea ​​verdadero.
ja: <code>For n</code> ループを使用する場合は、行数を変更するか、 <code>IsNewRow</code> がtrueのときに <code>Exit For</code> を使用します。
ko: <code>For n</code> 루프 를 사용하는 경우 <code>IsNewRow</code> 가 true 일 때 행 수를 수정하거나 <code>Exit For</code> 를 사용하십시오.
ru: Если вы используете цикл <code>For n</code> , измените счетчик строк или используйте <code>Exit For</code> , когда <code>IsNewRow</code> имеет значение true.
zh_cn: 如果确实使用 <code>For n</code> 循环， <code>Exit For</code> 在 <code>IsNewRow</code> 为true时修改行数或使用Exit For 。

source: If you examine the reference source for <code>LINQ</code> to Objects you will see that this technique is used throughout. It is slightly more clunky to write, but it makes debugging nullity errors much easier. <strong>Optimize your code for the convenience of the caller, not the convenience of the author</strong>.
es: Si examina la fuente de referencia para <code>LINQ</code> to Objects, ver&aacute; que esta t&eacute;cnica se utiliza en todo momento. Es un poco m&aacute;s torpe escribir, pero hace que la depuraci&oacute;n de errores de nulidad sea mucho m&aacute;s f&aacute;cil. <strong>Optimice su c&oacute;digo para la conveniencia de la persona que llama, no para la conveniencia del autor</strong> .
ja: <code>LINQ</code> to Objectsの参照ソースを調べると、この手法が全体で使用されていることがわかります。 書くのは少し不格好ですが、ヌルエラーのデバッグがはるかに簡単になります。 <strong>作成者の便宜ではなく、呼び出し元の便宜のためにコードを最適化します</strong> 。
ko: <code>LINQ</code> to Objects의 참조 소스를 살펴보면이 기술이 전체적으로 사용되는 것을 볼 수 있습니다. 작성하는 것이 약간 더 복잡하지만 nullity 오류 디버깅이 훨씬 쉽습니다. <strong>작성자의 편의가 아닌 발신자의 편의를 위해 코드를 최적화하십시오</strong> .
ru: Если вы изучите источник ссылки для <code>LINQ</code> to Objects, вы увидите, что этот метод используется повсеместно. Это немного более неуклюже, чтобы написать, но это делает отладку ошибок ничтожности намного легче. <strong>Оптимизируйте свой код для удобства звонящего, а не для удобства автора</strong> .
zh_cn: 如果检查 <code>LINQ</code> to Objects的参考源，您会发现在整个过程中都使用了此技术。 编写起来有点笨拙，但是它使调试null错误更加容易。 <strong>为方便调用者而不是为作者方便而优化代码</strong> 。

source: If you expect the reference sometimes to be null, you can check for it being <code>null</code> before accessing instance members:
es: Si espera que la referencia a veces sea nula, puede verificar que sea <code>null</code> antes de acceder a los miembros de la instancia:
ja: 参照がnullになることが予想される場合は、インスタンスメンバーにアクセスする前に <code>null</code> かどうかを確認できます。
ko: 때때로 참조가 널이 될 것으로 예상되는 경우 인스턴스 멤버에 액세스하기 전에 참조가 <code>null</code> 확인할 수 있습니다.
ru: Если вы ожидаете, что ссылка иногда будет нулевой, вы можете проверить ее на <code>null</code> прежде чем обращаться к членам экземпляра:
zh_cn: 如果您期望引用有时为空，则可以在访问实例成员之前检查其是否为 <code>null</code> ：

source: If you have not initialized a reference type, and you want to set or read one of its properties, it will throw a <strong>NullReferenceException</strong>.
es: Si no ha inicializado un tipo de referencia y desea establecer o leer una de sus propiedades, arrojar&aacute; una <strong>NullReferenceException</strong> .
ja: 参照型を初期化しておらず、そのプロパティの1つを設定または読み取る場合は、 <strong>NullReferenceException</strong>がスローされます。
ko: 참조 유형을 초기화하지 않고 해당 속성 중 하나를 설정하거나 읽으려면 <strong>NullReferenceException이 발생</strong> 합니다.
ru: Если вы не инициализировали ссылочный тип и хотите установить или прочитать одно из его свойств, оно выдаст <strong>исключение NullReferenceException</strong> .
zh_cn: 如果尚未初始化引用类型，并且要设置或读取其属性之一，则它将抛出<strong>NullReferenceException</strong> 。

source: If you want to avoid the child (Person) null reference, you could initialize it in the parent (Book) object's constructor.
es: Si quieres evitar la referencia nula del hijo (Persona),podrías inicializarlo en el constructor del objeto padre (Libro).
ja: 子(Person)のnull参照を避けたい場合は、親(Book)オブジェクトのコンストラクタで初期化することができます。
ko: 하위 (Person) 널 참조를 피하려면 상위 (Book) 오브젝트의 생성자에서이를 초기화 할 수 있습니다.
ru: Если вы хотите избежать дочерней (Person)нулевой ссылки,вы можете инициализировать ее в конструкторе родительского (Book)объекта.
zh_cn: 如果你想避免子对象(Person)空引用,可以在父对象(Book)的构造函数中初始化它。

source: If you want to find out where the reference is or isn't set, right-click its name and select "Find All References". You can then place a breakpoint at every found location and run your program with the debugger attached. Every time the debugger breaks on such a breakpoint, you need to determine whether you expect the reference to be non-null, inspect the variable, and verify that it points to an instance when you expect it to.
es: Si quiere saber dónde está o no la referencia,haga clic con el botón derecho del ratón en su nombre y seleccione "Buscar todas las referencias".A continuación,puede colocar un punto de interrupción en cada ubicación encontrada y ejecutar su programa con el depurador adjunto.Cada vez que el depurador se rompe en un punto de ruptura de este tipo,debe determinar si espera que la referencia no sea nula,inspeccionar la variable y verificar que apunte a una instancia cuando lo espera.
ja: リファレンスが設定されている場所や設定されていない場所を確認したい場合は、その名前を右クリックして "すべてのリファレンスを検索" を選択します。そして、見つかったすべての場所にブレークポイントを置き、デバッガを接続した状態でプログラムを実行することができます。このようなブレークポイントでデバッガがブレークするたびに、参照が NULL ではないと予想しているかどうかを判断し、変数を検査し、予想しているときにインスタンスを指しているかどうかを確認する必要があります。
ko: 참조가 설정되어 있거나 설정되어 있지 않은 곳을 찾으려면 해당 이름을 마우스 오른쪽 단추로 클릭하고 "모든 참조 찾기"를 선택하십시오. 그런 다음 발견 된 모든 위치에 중단 점을 배치하고 디버거가 연결된 상태에서 프로그램을 실행할 수 있습니다. 디버거가 이러한 중단 점에서 중단 될 때마다 참조가 널이 아닌 것으로 예상되는지 판별하고 변수를 검사하여 예상시 인스턴스를 가리키는 지 확인해야합니다.
ru: Если вы хотите узнать,где находится или не находится ссылка,щелкните правой кнопкой мыши по ее имени и выберите "Найти все ссылки".После этого Вы можете поместить точку останова в каждое найденное место и запустить программу с приложенным отладчиком.Каждый раз,когда отладчик прерывает работу в такой точке останова,необходимо определить,ожидаете ли вы,что ссылка не будет нулевой,осмотреть переменную и убедиться,что она указывает на экземпляр,когда вы этого ожидаете.
zh_cn: 如果你想知道这个引用在哪里或没有设置,右击它的名字,选择 "查找所有引用"。然后,你可以在每一个找到的位置都放置一个断点,然后在连接调试器的情况下运行你的程序。每当调试器在这样的断点上断点时,你需要确定你期望的引用是否为非空,检查变量,并验证它是否在你期望的时候指向一个实例。

source: If you're not sure whether the object is null, check it with <code>object == null</code>.
es: Si no est&aacute; seguro de si el objeto es nulo, verif&iacute;quelo con <code>object == null</code> .
ja: オブジェクトがnullかどうかわからない場合は、 <code>object == null</code> で確認してください。
ko: 객체가 null인지 확실하지 않은 경우 <code>object == null</code> 확인하십시오.
ru: Если вы не уверены, является ли объект нулевым, проверьте его с помощью <code>object == null</code> .
zh_cn: 如果不确定对象是否为null，请使用 <code>object == null</code> 检查。

source: Imagine that <code>country</code> is an object of type <code>Country</code> that has a property called <code>State</code> and so on. If <code>country</code>, <code>State</code>, <code>County</code>, or <code>City</code> is <code>null</code> then <code>address will be</code>null<code>. Therefore you only have to check whether</code>address<code>is</code>null`.
es: Imagine que el <code>country</code> es un objeto de tipo <code>Country</code> que tiene una propiedad llamada <code>State</code> etc. Si el <code>country</code> , <code>State</code> , <code>County</code> o <code>City</code> es <code>null</code> , la <code>address will be</code> nula <code>. Therefore you only have to check whether</code> Por lo tanto, solo tiene que verificar si la direcci&oacute;n <code>is</code> nula`.
ja: その <code>country</code> が、 <code>Country</code> のプロパティを持つ国タイプのオブジェクトであるとします。 <code>country</code> 、 <code>State</code> 、 <code>County</code> 、または <code>City</code> が <code>null</code> の場合、 <code>address will be</code> null になります <code>. Therefore you only have to check whether</code> したがって、アドレス <code>is</code> nullであるかどうかを確認するだけで済みます 。
ko: 해당 <code>country</code> 가 <code>State</code> 등의 속성을 가진 <code>Country</code> 유형의 객체라고 가정합니다. <code>country</code> , <code>State</code> , <code>County</code> 또는 <code>City</code> 가 <code>null</code> 이면 <code>address will be</code> null <code>. Therefore you only have to check whether</code> 따라서 주소 <code>is</code> null 인지 확인하기 만하면됩니다.
ru: Представьте, что <code>country</code> - это объект типа <code>Country</code> , у которого есть свойство <code>State</code> и так далее. Если <code>country</code> , <code>State</code> , <code>County</code> или <code>City</code> имеют <code>null</code> тогда <code>address will be</code> нулевым <code>. Therefore you only have to check whether</code> Поэтому вам нужно только проверить, <code>is</code> ли адрес пустым.
zh_cn: 想象一下， <code>country</code> 是&ldquo; <code>Country</code> &rdquo;类型的对象，它具有一个称为&ldquo; <code>State</code> 的属性，依此类推。 如果 <code>country</code> ， <code>State</code> ， <code>County</code> 或 <code>City</code> 为 <code>null</code> 则 <code>address will be</code> 空 <code>. Therefore you only have to check whether</code> 因此，您只需要检查地址是否 <code>is</code> 空。

source: In <code>C# 5</code> and below, this can be guarded with:
es: En <code>C# 5</code> y abajo, esto se puede proteger con:
ja: <code>C# 5</code> 以下では、これは次のようにして保護できます。
ko: <code>C# 5</code> 이하에서는 다음과 같이 보호 할 수 있습니다.
ru: В <code>C# 5</code> и ниже это может быть защищено с помощью:
zh_cn: 在 <code>C# 5</code> 及以下版本中，可以通过以下方式进行保护：

source: In Visual Studio this is usually easy thanks to the <a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">Visual Studio Debugger</a>.
es: En Visual Studio, esto suele ser f&aacute;cil gracias al <a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">Visual Studio Debugger</a> .
ja: Visual Studioでは、これは<a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">Visual Studio Debuggerの</a>おかげで通常は簡単です。
ko: Visual Studio에서는 일반적으로 <a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">Visual Studio Debugger</a> 덕분에 쉽습니다.
ru: В Visual Studio это обычно легко благодаря <a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">отладчику Visual Studio</a> .
zh_cn: 在Visual Studio中，这通常很容易，这要归功于<a href="https://msdn.microsoft.com/en-us/library/sc65sadd.aspx">Visual Studio调试器</a> 。

source: In comparison to an ArgumentNullException which is typically thrown as a defensive measure if a method expects that what is being passed to it is not null.
es: En comparación con un ArgumentoNuloExcepción que es típicamente lanzado como una medida defensiva si un método espera que lo que se le pasa no es nulo.
ja: ArgumentNullExceptionは、メソッドに渡されたものがNullではないことを期待している場合に、通常は防御手段としてスローされます。
ko: 메소드가 전달되는 것이 널 (null)이 아닌 것으로 예상하는 경우 일반적으로 방어 수단으로 발생하는 ArgumentNullException과 비교합니다.
ru: По сравнению с ArgumentNullException,который обычно бросается в качестве защитной меры,если метод ожидает,что то,что передается ему не является нулевым.
zh_cn: 与ArgumentNullException相比,ArgumentNullException通常是在方法期望传递给它的东西不是null时作为防御措施而抛出。

source: In general, you should use a cast or <code>as</code>, as follows:
es: En general, debe usar un yeso o <code>as</code> , de la siguiente manera:
ja: 通常、次のように、キャストまたは <code>as</code> を使用する必要があります。
ko: 일반적으로 다음과 같이 캐스트 또는 <code>as</code> 사용해야합니다.
ru: В общем, вы должны использовать приведение или как:
zh_cn: 通常，您应按以下方式使用强制转换或 <code>as</code> ：

source: In more advanced cases, such as the following, you'll need to use one of the techniques above (Watch or Immediate Windows) to inspect the expressions to determine if <code>str1</code> was null or if <code>str2</code> was null.
es: En casos m&aacute;s avanzados, como el siguiente, deber&aacute; usar una de las t&eacute;cnicas anteriores (Watch o Windows Inmediato) para inspeccionar las expresiones para determinar si <code>str1</code> era nulo o si <code>str2</code> era nulo.
ja: 次のようなより高度なケースでは、上記の手法の1つ（ウォッチまたはイミディエイトウィンドウ）を使用して式を検査し、 <code>str1</code> がnullであるか、 <code>str2</code> がnullであるかを判断する必要があります。
ko: 다음과 같은 고급 사례의 경우 위의 기술 중 하나 (Watch 또는 Immediate Windows)를 사용하여 식을 검사하여 <code>str1</code> 이 null인지 또는 <code>str2</code> 가 null인지 확인해야합니다.
ru: В более сложных случаях, таких как следующие, вам нужно использовать один из методов, описанных выше (Watch или Immediate Windows), чтобы проверить выражения, чтобы определить, был ли <code>str1</code> нулевым или <code>str2</code> нулевым.
zh_cn: 在更高级的情况下，例如以下情况，您将需要使用上述技术之一（&ldquo;监视&rdquo;或&ldquo;即时Windows&rdquo;）来检查表达式以确定 <code>str1</code> 是否为null或 <code>str2</code> 为null。

source: In short, <em>class invariants</em> ensure that there will be some constraints in your class that will not get violated in normal use (and therefore, the class will <em>not</em> get in an inconsistent state). <em>Preconditions</em> mean that data given as input to a function/method must follow some constraints set and <strong>never</strong> violate them, and <em>postconditions</em> mean that a function/method output must follow the set constraints again without ever violating them. Contract conditions should <strong>never</strong> be violated during execution of a bug-free program, therefore design by contract is checked in practice in debug mode, while being <em>disabled in releases</em>, to maximize the developed system performance.
es: En resumen, <em>los invariantes de clase</em> aseguran que habr&aacute; algunas restricciones en su clase que no ser&aacute;n violadas en el uso normal (y, por lo tanto, la clase <em>no</em> entrar&aacute; en un estado inconsistente). <em>Las condiciones previas</em> significan que los datos proporcionados como entrada para una funci&oacute;n / m&eacute;todo deben seguir algunas restricciones establecidas y <strong>nunca</strong> violarlas, y las condiciones <em>posteriores</em> significan que una salida de funci&oacute;n / m&eacute;todo debe seguir las restricciones establecidas nuevamente sin violarlas nunca. Las condiciones del contrato <strong>nunca</strong> deben violarse durante la ejecuci&oacute;n de un programa libre de errores, por lo tanto, el dise&ntilde;o por contrato se verifica en la pr&aacute;ctica en modo de depuraci&oacute;n, mientras se <em>desactiva en las versiones</em> , para maximizar el rendimiento del sistema desarrollado.
ja: つまり、 <em>クラスの不変</em>条件は、通常の使用で違反しないクラスにいくつかの制約があることを保証します（したがって、クラスが矛盾した状態になることはあり<em>ませ</em>ん）。 <em>前提条件</em>は、関数/メソッドへの入力として与えられたデータがいくつかの制約セットに従う必要があり、それらに違反し<strong>ないことを</strong>意味し、 <em>事後条件</em>は、関数/メソッド出力が設定制約に違反することなく再び従わなければならないことを意味します。 バグのないプログラムの実行中は、契約条件に違反し<strong>ない</strong>でください。したがって、開発モードでは契約による設計が実際にデバッグモードでチェックされ<em>ますが、リリース</em>では<em>無効に</em>なり、開発されたシステムパフォーマンスを最大化します。
ko: 요컨대, <em>클래스 불변</em> 은 클래스에 정상적인 사용에서 위반되지 않는 제약이 있는지 확인합니다 (따라서 클래스가 일관성이없는 상태에 <em>있지 않음</em> ). <em>전제 조건</em> 은 함수 / 메소드에 대한 입력으로 제공된 데이터가 일부 제한 조건 세트를 따라야하며이를 위반 <strong>하지</strong> 않아야 함을 의미하며, <em>사후 조건</em> 은 함수 / 메소드 출력이 설정된 제한 조건을 다시 위반하지 않고 다시 설정 제한 조건을 따라야 함을 의미합니다. 버그없는 프로그램을 실행하는 동안 계약 조건을 위반해서는 안되므로 개발 된 시스템 성능을 최대화하기 위해 <em>릴리스</em> 에서 <em>비활성화 된</em> 상태에서 디버그 모드에서 계약에 의한 설계를 실제로 검사합니다.
ru: Короче говоря, <em>инварианты класса</em> гарантируют, что в вашем классе будут некоторые ограничения, которые не будут нарушаться при обычном использовании (и, следовательно, класс <em>не</em> попадет в противоречивое состояние). <em>Предварительные условия</em> означают, что данные, предоставляемые в качестве входных данных для функции / метода, должны следовать некоторым установленным ограничениям и <strong>никогда не</strong> нарушать их, а <em>постусловия</em> означают, что выходные данные функции / метода должны снова следовать установленным ограничениям, никогда не нарушая их. Условия контракта <strong>никогда не</strong> должны нарушаться во время выполнения безошибочной программы, поэтому проектирование по контракту проверяется на практике в режиме отладки, хотя и <em>отключается в выпусках</em> , чтобы максимизировать производительность разработанной системы.
zh_cn: 简而言之， <em>类不变式可</em>确保您的类中存在一些在正常使用中不会受到违反的约束（因此，该类<em>不会</em>处于不一致的状态）。 <em>前提条件</em>意味着作为函数/方法的输入提供的数据必须遵循一定的约束条件，并且<strong>永不</strong>违反它们； <em>而后置条件</em>意味着函数/方法的输出必须再次遵循设置的约束条件，而又从未违反它们。 在执行无错误的程序期间，不得违反合同条件，因此，按合同进行的设计实际上是在调试模式下检查的，而<em>在发行版中</em>被<em>禁用</em> ，以最大限度地提高开发系统的性能。

source: In the other direction, a <strong><em>boxing</em></strong> conversion <em>from</em> a <code>Nullable&lt;&gt;</code> which has <code>HasValue</code> equal to <code>false</code><em>to</em> a reference type, can give a <code>null</code> reference which can then later lead to a <code>NullReferenceException</code>. The classic example is:
es: En la otra direcci&oacute;n, una conversi&oacute;n de <strong><em>boxeo</em></strong> <em>de</em> un <code>Nullable&lt;&gt;</code> que tiene un valor de <code>HasValue</code> igual a <code>false</code> <em>a</em> un tipo de referencia, puede dar una referencia <code>null</code> que luego puede conducir a una <code>NullReferenceException</code> . El ejemplo cl&aacute;sico es:
ja: 反対方向では、 <code>HasValue</code> が <code>false</code> <em>に</em>等しい <code>Nullable&lt;&gt;</code> <em>から</em>参照型<em>への</em> <strong><em>ボクシング</em></strong>変換<em>により</em> 、 <code>null</code> 参照が発生し、後で <code>NullReferenceException</code> が発生する可能性があります。 古典的な例は次のとおりです。
ko: 다른 방향으로, <code>HasValue</code> 가 <code>false</code> 인 <code>Nullable&lt;&gt;</code> 에서 참조 유형으로의 <strong><em>복싱</em></strong> 변환 <em>은</em> <code>null</code> 참조를 제공 한 다음 나중에 <code>NullReferenceException</code> 으로 이어질 수 있습니다. 전형적인 예는 다음과 같습니다.
ru: В другом направлении преобразование <strong><em>бокса</em></strong> <em>из</em> <code>Nullable&lt;&gt;</code> которого <code>HasValue</code> равно <code>false</code> <em>для</em> ссылочного типа, может дать <code>null</code> ссылку, которая впоследствии может привести к <code>NullReferenceException</code> . Классический пример:
zh_cn: 在另一个方向上， <em>从</em> <code>HasValue</code> 等于 <code>false</code> 的 <code>Nullable&lt;&gt;</code> <em>到</em>引用类型的<strong><em>装箱</em></strong>转换可以提供 <code>null</code> 引用，该引用随后可以导致 <code>NullReferenceException</code> 。 经典示例是：

source: In unsafe mode, you should be aware of two important facts:
es: En el modo inseguro,debe ser consciente de dos hechos importantes:
ja: 不安モードでは、2つの重要な事実を知っておく必要があります。
ko: 안전하지 않은 모드에서는 다음 두 가지 중요한 사실을 알고 있어야합니다.
ru: В небезопасном режиме вы должны знать два важных факта:
zh_cn: 在不安全模式下,你应该注意两个重要的事实。

source: In-built method: System methods such as GetValueOrDefault(),IsNullOrWhiteSpace() and IsNullorEmpty() checks for nulls and assign the default value if there is a null value.
es: Método incorporado:Los métodos del sistema como GetValueOrDefault(),IsNullOrWhiteSpace()e IsNullorEmpty()comprueban si hay nulos y asignan el valor por defecto si hay un valor nulo.
ja: 内蔵メソッド。GetValueOrDefault(),IsNullOrWhiteSpace(),IsNullorEmpty()などのシステムメソッドは、ヌルをチェックし、ヌル値がある場合はデフォルト値を代入します。
ko: 내장 된 메소드 : GetValueOrDefault (), IsNullOrWhiteSpace () 및 IsNullorEmpty ()와 같은 시스템 메소드는 널을 점검하고 널값이 있으면 기본값을 지정합니다.
ru: Встроенный метод:Системные методы,такие как GetValueOrDefault(),IsNullOrWhiteSpace()и IsNullorEmpty()проверяют на наличие нулей и присваивают значение по умолчанию,если есть нулевое значение.
zh_cn: 内建方法。系统方法,如GetValueOrDefault()、IsNullOrWhiteSpace()和IsNullorEmpty()等系统方法会检查空值,如果有空值,则会分配默认值。

source: Initialize the settings collection in the form's <code>Load</code> event handler, if/when needed:
es: Inicialice la colecci&oacute;n de configuraciones en el controlador de eventos <code>Load</code> del formulario, si es necesario:
ja: 必要に応じて、フォームの <code>Load</code> イベントハンドラーで設定コレクションを初期化します。
ko: 필요한 경우 양식의 <code>Load</code> 이벤트 처리기에서 설정 컬렉션을 초기화합니다.
ru: Инициализируйте коллекцию настроек в обработчике события <code>Load</code> формы, если / когда это необходимо:
zh_cn: 如有必要，请在表单的 <code>Load</code> 事件处理程序中初始化设置集合：

source: Integral types
es: Tipos integrales
ja: 積分型
ko: 일체형
ru: Интегральные типы
zh_cn: 整数类型

source: Interestingly, none of the answers on this page mention the two edge cases, hope no one minds if I add them:
es: Curiosamente,ninguna de las respuestas de esta página menciona los dos casos extremos,espero que a nadie le importe si los añado:
ja: 興味深いことに、このページのどの回答も、2つのエッジケースについて言及していませんでした。
ko: 흥미롭게도,이 페이지의 어떤 답변도 두 가지 경우를 언급하지 않으며, 내가 추가해도 아무도 신경 쓰지 않기를 바랍니다.
ru: Интересно,что ни в одном из ответов на этой странице не упоминаются два крайних случая,надеюсь,никто не возражает,если я их добавлю:
zh_cn: 有趣的是,这个页面上的答案都没有提到这两种边缘情况,希望大家不要介意我补充一下。

source: Introduced in <code>C# 8</code> there null context's and nullable reference types perform static analysis on variables and provides a compiler warning if a value can be potentially null or have been set to null. The nullable reference types allows types to be explicitly allowed to be null.
es: Introducido en <code>C# 8</code> contexto nulo y los tipos de referencia anulables realizan un an&aacute;lisis est&aacute;tico de las variables y proporciona una advertencia del compilador si un valor puede ser potencialmente nulo o se ha establecido en nulo. Los tipos de referencia anulables permiten que los tipos sean expl&iacute;citamente nulos.
ja: <code>C# 8</code> 導入されたnullコンテキストおよびnull可能な参照型は、変数の静的分析を実行し、値が潜在的にnullであるかnullに設定されている可能性がある場合にコンパイラ警告を提供します。 null可能な参照型により、型を明示的にnullにすることができます。
ko: <code>C# 8</code> 도입 된 null 컨텍스트 및 nullable 참조 유형은 변수에 대한 정적 분석을 수행하고 값이 null이거나 잠재적으로 null로 설정된 경우 컴파일러 경고를 제공합니다. nullable 참조 형식을 사용하면 형식을 명시 적으로 null로 허용 할 수 있습니다.
ru: Введенный в <code>C# 8</code> нулевой контекст и нулевые ссылочные типы выполняют статический анализ переменных и выдают предупреждение компилятора, если значение может быть потенциально нулевым или для него установлено нулевое значение. Обнуляемые ссылочные типы позволяют типам быть явно пустыми.
zh_cn: 在 <code>C# 8</code> 引入了null上下文和nullable引用类型，它们对变量执行静态分析，并在值可能为null或已设置为null时提供编译器警告。 可为空的引用类型允许将类型明确允许为null。
