Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Button2" resides on a <code>Panel</code>
es: "Button2" reside en un <code>Panel</code>
ja: 「Button2」は <code>Panel</code> 上にあります
ko: "Button2"는 <code>Panel</code>
ru: &laquo;Button2&raquo; находится на <code>Panel</code>
zh_cn: &ldquo; Button2&rdquo;位于 <code>Panel</code>

source: &lsquo;<strong><em>NullReferenceException</em></strong>&rsquo; also occurs when we forget to instantiate a reference type.
es: ' <strong><em>NullReferenceException</em></strong> ' tambi&eacute;n ocurre cuando olvidamos instanciar un tipo de referencia.
ja: ' <strong><em>NullReferenceException</em></strong> 'は、参照型のインスタンス化を忘れた場合にも発生します。
ko: ' <strong><em>NullReferenceException</em></strong> '은 참조 유형을 인스턴스화하는 것을 잊었을 때도 발생합니다.
ru: <strong><em>NullReferenceException</em></strong> также возникает, когда мы забываем создать экземпляр ссылочного типа.
zh_cn: 当我们忘记实例化引用类型时，也会发生' <strong><em>NullReferenceException</em></strong> '。

source: (Another reason for non-using unsafe code unless you need it, by the way)
es: (Otra razón para no usar el código inseguro a menos que lo necesites,por cierto)
ja: (ところで、安全でないコードを必要としない限り使わないもう一つの理由)
ko: (필요하지 않은 한 안전하지 않은 코드를 사용하지 않는 또 다른 이유)
ru: (Кстати,еще одна причина неиспользования опасного кода,если он вам не нужен).
zh_cn: (另一个不使用不安全代码的原因,除非你需要,否则不使用不安全代码)

source: .NET collections (of which there are many varieties - Lists, Dictionary, etc.) must also be instantiated or created.
es: Las colecciones .NET (de las cuales hay muchas variedades-Listas,Diccionario,etc.)también deben ser instanciadas o creadas.
ja: .NETコレクション(リスト、辞書など多くの種類があります)もインスタンス化または作成する必要があります。
ko: .NET 컬렉션 (목록, 사전 등 다양한 종류가 있음)도 인스턴스화하거나 만들어야합니다.
ru: NET-коллекции (из которых существует множество разновидностей-Списки,Словарь и т.д.)также должны быть инстанциированы или созданы.
zh_cn: .NET集合(其中有很多种类----列表、字典等)也必须被实例化或创建。

source: <a href="https://stackoverflow.com/a/11244949/5407188">Simon Mourier gave this example</a>:
es: <a href="https://stackoverflow.com/a/11244949/5407188">Simon Mourier dio este ejemplo</a> :
ja: <a href="https://stackoverflow.com/a/11244949/5407188">Simon Mourierがこの例を示しました</a> 。
ko: <a href="https://stackoverflow.com/a/11244949/5407188">Simon Mourier가이 예를 들었습니다</a> .
ru: <a href="https://stackoverflow.com/a/11244949/5407188">Саймон Мурье привел этот пример</a> :
zh_cn: <a href="https://stackoverflow.com/a/11244949/5407188">西蒙&middot;穆里尔（Simon Mourier）举了这个例子</a> ：

source: <code>AndAlso</code> is important. Subsequent tests will not be performed once the first <code>False</code> condition is encountered. This allows the code to safely 'drill' into the object(s) one 'level' at a time, evaluating <code>myFoo.Bar</code> only after (and if) <code>myFoo</code> is determined to be valid. Object chains or paths can get quite long when coding complex objects:
es: <code>AndAlso</code> es importante. Las pruebas posteriores no se realizar&aacute;n una vez que se encuentre la primera condici&oacute;n <code>False</code> . Esto permite que el c&oacute;digo 'se desplace' de forma segura en el (los) objeto (s) un 'nivel' a la vez, evaluando <code>myFoo.Bar</code> solo despu&eacute;s (y si) se determina que <code>myFoo</code> es v&aacute;lido. Las cadenas o rutas de objetos pueden ser bastante largas al codificar objetos complejos:
ja: <code>AndAlso</code> 重要です。 最初の <code>False</code> 条件が発生すると、その後のテストは実行されません。 これにより、コードは一度に1レベルずつオブジェクトに安全に「ドリル」でき、 <code>myFoo</code> が有効であると判断された後にのみ <code>myFoo.Bar</code> を評価します。 複雑なオブジェクトをコーディングすると、オブジェクトチェーンまたはパスが非常に長くなることがあります。
ko: <code>AndAlso</code> 중요합니다. 첫 번째 <code>False</code> 조건이 발생하면 후속 테스트는 수행되지 않습니다. 이를 통해 코드는 한 번에 하나의 '레벨'로 객체를 안전하게 '드릴'할 수 있으며 <code>myFoo</code> 가 유효한 것으로 판단 된 후에 만 <code>myFoo.Bar</code> 를 평가할 수 있습니다. 복잡한 객체를 코딩 할 때 객체 체인 또는 경로가 상당히 길어질 수 있습니다.
ru: <code>AndAlso</code> важно. Последующие тесты не будут выполняться после того, как будет <code>False</code> первое ложное условие. Это позволяет коду безопасно &laquo;углубляться&raquo; в объект (ы) по одному &laquo;уровню&raquo; за раз, оценивая <code>myFoo.Bar</code> только после того, как (и если) <code>myFoo</code> определено как допустимое. Цепочки объектов или пути могут быть довольно длинными при кодировании сложных объектов:
zh_cn: <code>AndAlso</code> 也很重要。 一旦遇到第一个 <code>False</code> 条件，将不执行后续测试。 这使代码可以一次安全地&ldquo;钻探&rdquo;对象一个&ldquo;级别&rdquo;，仅在（如果确定） <code>myFoo</code> 有效之后评估 <code>myFoo.Bar</code> 。 编码复杂对象时，对象链或路径可能会变得很长：

source: <code>C#</code> has an "unsafe" mode which is, as the name implies, extremely dangerous because the normal safety mechanisms which provide memory safety and type safety are not enforced. <strong>You should not be writing unsafe code unless you have a thorough and deep understanding of how memory works</strong>.
es: <code>C#</code> tiene un modo "inseguro" que, como su nombre lo indica, es extremadamente peligroso porque no se aplican los mecanismos de seguridad normales que proporcionan seguridad de memoria y de tipo. <strong>No debe escribir c&oacute;digo inseguro a menos que tenga un conocimiento profundo y profundo de c&oacute;mo funciona la memoria</strong> .
ja: <code>C#</code> には、「安全でない」モードがあります。これは、その名前が示すように、メモリの安全性と型の安全性を提供する通常の安全メカニズムが強制されないため、非常に危険です。 <strong>メモリがどのように機能するかを十分に理解していない限り、安全でないコードを書くべきではありません</strong> 。
ko: <code>C#</code> 에는 "안전하지 않은"모드가 있는데, 이는 이름에서 알 수 있듯이 메모리 안전 및 형식 안전성을 제공하는 일반적인 안전 메커니즘이 적용되지 않기 때문에 매우 위험합니다. <strong>메모리 작동 방식을 철저하고 깊이 이해하지 않으면 안전하지 않은 코드를 작성해서는 안됩니다</strong> .
ru: <code>C#</code> имеет &laquo;небезопасный&raquo; режим, который, как следует из названия, чрезвычайно опасен, поскольку обычные механизмы безопасности, которые обеспечивают безопасность памяти и безопасность типов, не применяются. <strong>Вы не должны писать небезопасный код, если у вас нет глубокого и глубокого понимания того, как работает память</strong> .
zh_cn: 顾名思义， <code>C#</code> 具有&ldquo;不安全&rdquo;模式，这是非常危险的，因为没有强制执行提供内存安全和类型安全的常规安全机制。 <strong>除非您对内存的工作原理有透彻和深入的了解，否则不要编写不安全的代码</strong> 。

source: <code>C#</code> supports "iterator blocks" (called "generators" in some other popular languages). Null dereference exceptions can be particularly tricky to debug in iterator blocks because of deferred execution:
es: <code>C#</code> admite "bloques iteradores" (llamados "generadores" en algunos otros lenguajes populares). Las excepciones de anulaci&oacute;n de referencia pueden ser particularmente dif&iacute;ciles de depurar en bloques iteradores debido a la ejecuci&oacute;n diferida:
ja: <code>C#</code> は「イテレーターブロック」（他の一部の一般的な言語では「ジェネレーター」と呼ばれます）をサポートしています。 実行の遅延のため、null逆参照例外は反復子ブロックでデバッグするのが特に難しい場合があります。
ko: <code>C#</code> 은 "반복자 블록"(일부 인기있는 다른 언어에서는 "생성기"라고 함)을 지원합니다. Null 역 참조 예외는 지연된 실행으로 인해 반복기 블록에서 디버그하기가 특히 까다로울 수 있습니다.
ru: <code>C#</code> поддерживает &laquo;блоки итераторов&raquo; (называемые &laquo;генераторами&raquo; в некоторых других популярных языках). Исключения нулевого разыменования могут быть особенно сложны для отладки в блоках итератора из-за отложенного выполнения:
zh_cn: <code>C#</code> 支持&ldquo;迭代器块&rdquo;（在其他一些流行语言中称为&ldquo;生成器&rdquo;）。 由于延迟执行，在迭代器块中调试空解除引用异常可能特别棘手：

source: <code>Fill</code> is a function returning the number of <code>Rows</code> affected which can also be tested:
es: <code>Fill</code> es una funci&oacute;n que devuelve el n&uacute;mero de <code>Rows</code> afectadas que tambi&eacute;n se pueden probar:
ja: <code>Fill</code> は、影響を受ける <code>Rows</code> の数を返す関数であり、これもテストできます。
ko: <code>Fill</code> 는 영향을받는 <code>Rows</code> 수를 반환하는 함수이며 테스트 할 수도 있습니다.
ru: <code>Fill</code> - это функция, возвращающая количество затронутых <code>Rows</code> которая также может быть проверена:
zh_cn: <code>Fill</code> 是一个返回受影响的 <code>Rows</code> 数的函数，也可以对其进行测试：

source: <code>FirstOrDefault</code> returns the first item or the default value, which is <code>Nothing</code> for reference types and never <code>DBNull</code>:
es: <code>FirstOrDefault</code> devuelve el primer elemento o el valor predeterminado, que es <code>Nothing</code> para los tipos de referencia y nunca <code>DBNull</code> :
ja: <code>FirstOrDefault</code> は、最初の項目またはデフォルト値を返します。これは、参照型では <code>Nothing</code> であり、 <code>DBNull</code> にはなりません。
ko: <code>FirstOrDefault</code> 는 첫 번째 항목 또는 기본값을 반환합니다.이 값은 참조 유형에 대해서는 <code>Nothing</code> 이며 결코 <code>DBNull</code> 이 아닙니다.
ru: <code>FirstOrDefault</code> возвращает первый элемент или значение по умолчанию, которое является <code>Nothing</code> для ссылочных типов и никогда не <code>DBNull</code> :
zh_cn: <code>FirstOrDefault</code> 返回第一项或默认值，对于引用类型为 <code>Nothing</code> ，从不为 <code>DBNull</code> ：

source: <code>NotNull&lt;T&gt;</code> is implicitly cast to and from <code>T</code> so you can use it just about anywhere you need it. For example, you can pass a <code>Person</code> object to a method that takes a <code>NotNull&lt;Person&gt;</code>:
es: <code>NotNull&lt;T&gt;</code> est&aacute; impl&iacute;citamente emitido hacia y desde <code>T</code> para que pueda usarlo en cualquier lugar donde lo necesite. Por ejemplo, puede pasar un objeto <code>Person</code> a un m&eacute;todo que toma un <code>NotNull&lt;Person&gt;</code> :
ja: <code>NotNull&lt;T&gt;</code> はTとの間で暗黙的にキャストされるため、必要な場所であればどこでも使用できます。 たとえば、 <code>Person</code> オブジェクトを <code>NotNull&lt;Person&gt;</code> メソッドに渡すことができます。
ko: <code>NotNull&lt;T&gt;</code> 은 T에서 암시 적으로 캐스트되므로 필요한 곳 ​​어디에서나 사용할 수 있습니다. 예를 들어, <code>Person</code> 객체를 <code>NotNull&lt;Person&gt;</code> 을 취하는 메소드에 전달할 수 있습니다.
ru: <code>NotNull&lt;T&gt;</code> неявно преобразуется в T и из <code>T</code> , так что вы можете использовать его где угодно. Например, вы можете передать объект <code>Person</code> в метод, который принимает <code>NotNull&lt;Person&gt;</code> :
zh_cn: <code>NotNull&lt;T&gt;</code> 与 <code>T</code> 隐式转换，因此您可以在任何需要的地方使用它。 例如，您可以将 <code>Person</code> 对象传递给采用 <code>NotNull&lt;Person&gt;</code> ：

source: <code>WPF</code> controls are created during the call to <code>InitializeComponent</code> in the order they appear in the visual tree. A <code>NullReferenceException</code> will be raised in the case of early-created controls with event handlers, etc. , that fire during <code>InitializeComponent</code> which reference late-created controls.
es: <code>WPF</code> controles WPF se crean durante la llamada a <code>InitializeComponent</code> en el orden en que aparecen en el &aacute;rbol visual. Se generar&aacute; una <code>NullReferenceException</code> en el caso de los controles creados anteriormente con controladores de eventos, etc., que se activan durante <code>InitializeComponent</code> que hace referencia a los controles creados recientemente.
ja: <code>WPF</code> コントロールは、ビジュアルツリーに表示される順序で <code>InitializeComponent</code> の呼び出し中に作成されます。 初期化されたコントロールを参照するイベントハンドラーなどを備えた初期に作成されたコントロールの場合、 <code>NullReferenceException</code> が発生します。
ko: <code>InitializeComponent</code> 를 호출하는 동안 시각적 트리에 나타나는 순서대로 <code>WPF</code> 컨트롤이 만들어집니다. 늦게 생성 된 컨트롤을 참조하는 <code>InitializeComponent</code> 중에 발생하는 이벤트 처리기 등을 사용하여 초기에 생성 된 컨트롤의 경우 <code>NullReferenceException</code> 이 발생합니다.
ru: Элементы управления <code>WPF</code> создаются во время вызова <code>InitializeComponent</code> в порядке их появления в визуальном дереве. В случае ранее созданных элементов управления с обработчиками событий и т. <code>NullReferenceException</code> Будет сгенерировано исключение NullReferenceException , которое срабатывает во время <code>InitializeComponent</code> , ссылающегося на последние созданные элементы управления.
zh_cn: <code>WPF</code> 控件是在调用 <code>InitializeComponent</code> 的过程中按照它们在可视树中出现的顺序创建的。 对于带有事件处理程序等的早期创建的控件，将引发 <code>NullReferenceException</code> ，该事件在引用早期创建的控件的 <code>InitializeComponent</code> 期间触发。

source: <code>foreach</code> throws when you try to iterate null collection. Usually caused by unexpected <code>null</code> result from methods that return collections.
es: <code>foreach</code> lanza cuando intenta iterar una colecci&oacute;n nula. Generalmente causado por un resultado <code>null</code> inesperado de m&eacute;todos que devuelven colecciones.
ja: nullコレクションを反復しようとすると <code>foreach</code> がスローします。 通常、コレクションを返すメソッドからの予期しない <code>null</code> 結果が原因です。
ko: null 수집을 반복하려고하면 <code>foreach</code> 가 발생합니다. 일반적으로 컬렉션을 반환하는 메서드에서 예기치 않은 <code>null</code> 결과가 발생합니다.
ru: <code>foreach</code> бросает, когда вы пытаетесь повторить нулевую коллекцию. Обычно вызвано неожиданным <code>null</code> результатом от методов, которые возвращают коллекции.
zh_cn: 当您尝试迭代null集合时， <code>foreach</code> 引发。 通常由返回集合的方法的意外 <code>null</code> 结果引起。

source: <code>null</code> can have different meanings:
es: <code>null</code> puede tener diferentes significados:
ja: <code>null</code> にはさまざまな意味があります。
ko: <code>null</code> 은 다른 의미를 가질 수 있습니다.
ru: <code>null</code> может иметь разные значения:
zh_cn: <code>null</code> 可以具有不同的含义：

source: <em>&ldquo;Hey wait, that member has no values so it can&rsquo;t perform the task which you are handing it over.&rdquo;</em>
es: <em>"Oye, espera, ese miembro no tiene valores, por lo que no puede realizar la tarea que le est&aacute;s entregando".</em>
ja: <em>「ちょっと待ってください、そのメンバーには値がないので、あなたが引き渡そうとしているタスクを実行できません。」</em>
ko: <em>"잠깐만 요, 그 멤버는 가치가 없어서 당신이 맡고있는 작업을 수행 할 수 없습니다."</em>
ru: <em>&laquo;Эй, подождите, у этого члена нет значений, поэтому он не может выполнить задачу, которую вы передаете&raquo;.</em>
zh_cn: <em>&ldquo;嘿，等等，该成员没有值，因此它无法执行您要移交给它的任务。&rdquo;</em>

source: <em>The arrays and collections cannot be initialized this way.</em> This initialization code will run <em>before</em> the constructor creates the <code>Form</code> or the <code>Controls</code>. As a result:
es: <em>Las matrices y colecciones no se pueden inicializar de esta manera.</em> Este c&oacute;digo de inicializaci&oacute;n se ejecutar&aacute; <em>antes de que</em> el constructor cree el <code>Form</code> o los <code>Controls</code> . Como resultado:
ja: <em>配列とコレクションは、この方法では初期化できません。</em> この初期化コードは、コンストラクターが <code>Form</code> または <code>Controls</code> を作成する<em>前</em>に実行されます。 結果として：
ko: <em>이 방법으로 배열과 컬렉션을 초기화 할 수 없습니다.</em> 이 초기화 코드는 생성자가 <code>Form</code> 또는 <code>Controls</code> 를 만들기 <em>전에</em> 실행됩니다. 결과적으로 :
ru: <em>Массивы и коллекции не могут быть инициализированы таким образом.</em> Этот код инициализации будет запущен <em>до</em> того, как конструктор создаст <code>Form</code> или <code>Controls</code> . Как результат:
zh_cn: <em>数组和集合不能以这种方式初始化。</em> 此初始化代码将<em>在</em>构造函数创建 <code>Form</code> 或 <code>Controls</code> <em>之前</em>运行。 结果是：

source: <strong>Built-in like Nullable?</strong>
es: <strong>&iquest;Incorporado como Nullable?</strong>
ja: <strong>Nullableのような組み込みですか？</strong>
ko: <strong>Nullable처럼 내장되어 있습니까?</strong>
ru: <strong>Встроенный как Nullable?</strong>
zh_cn: <strong>像Nullable一样内置？</strong>

source: <strong>Check arguments</strong>
es: <strong>Verificar argumentos</strong>
ja: <strong>引数を確認する</strong>
ko: <strong>인수 확인</strong>
ru: <strong>Проверьте аргументы</strong>
zh_cn: <strong>检查参数</strong>

source: <strong>Combine with Extension</strong>
es: <strong>Combinar con extensi&oacute;n</strong>
ja: <strong>拡張機能と組み合わせる</strong>
ko: <strong>확장과 결합</strong>
ru: <strong>Объединить с расширением</strong>
zh_cn: <strong>与扩展结合</strong>

source: <strong>Example 1</strong>
es: <strong>Ejemplo 1</strong>
ja: <strong>例1</strong>
ko: <strong>실시 예 1</strong>
ru: <strong>Пример 1</strong>
zh_cn: <strong>例子1</strong>

source: <strong>Example 2</strong>
es: <strong>Ejemplo 2</strong>
ja: <strong>例2</strong>
ko: <strong>실시 예 2</strong>
ru: <strong>Пример 2</strong>
zh_cn: <strong>例子2</strong>

source: <strong>Example 3</strong>
es: <strong>Ejemplo 3</strong>
ja: <strong>例3</strong>
ko: <strong>실시 예 3</strong>
ru: <strong>Пример 3</strong>
zh_cn: <strong>例子3</strong>

source: <strong>Example: Array of class objects</strong>
es: <strong>Ejemplo: matriz de objetos de clase</strong>
ja: <strong>例：クラスオブジェクトの配列</strong>
ko: <strong>예 : 클래스 객체의 배열</strong>
ru: <strong>Пример: массив объектов класса</strong>
zh_cn: <strong>示例：类对象数组</strong>

source: <strong>Missing the <code>New</code> operator is the #1 cause of <code>NullReference Exceptions</code></strong> seen in the Stack&nbsp; Overflow questions reviewed.
es: <strong>La falta del <code>New</code> operador es la causa n. &deg; 1 de las <code>NullReference Exceptions</code> de referencia nula</strong> observadas en las preguntas de desbordamiento de pila revisadas.
ja: <strong> <code>New</code> 演算子がないことは、</strong>レビューされたスタックオーバーフローの質問で見られる<strong> <code>NullReference Exceptions</code> の最大の原因です</strong> 。
ko: <strong> <code>New</code> 연산자 누락은</strong> 검토 된 스택 오버플로 질문에서 볼 수있는 <strong> <code>NullReference Exceptions</code> 원인입니다</strong> .
ru: <strong>Отсутствие оператора <code>New</code> является # 1 причиной <code>NullReference Exceptions</code> </strong> замеченных в рассмотренных вопросах переполнения стека.
zh_cn: <strong>缺少 <code>New</code> 运算符是导致 <code>NullReference Exceptions</code> 的＃1原因，</strong>在所检查的堆栈溢出问题中可见。

source: <strong>Note</strong> that accessing it via <code>a.Value</code> throws an <code>InvalidOperationException</code> instead of a <code>NullReferenceException</code> if <code>a</code> is <code>null</code> - you should do the check beforehand, i.e. if you have another on-nullable variable <code>int b;</code> then you should do assignments like <code>if (a.HasValue) { b = a.Value; }</code> or shorter <code>if (a != null) { b = a; }</code>.
es: <strong>Tenga en cuenta</strong> que el acceso a trav&eacute;s de <code>a.Value</code> arroja una <code>InvalidOperationException</code> en lugar de una <code>NullReferenceException</code> si <code>a</code> es <code>null</code> ; debe hacer la verificaci&oacute;n de antemano, es decir, si tiene otra variable en nulo <code>int b;</code> entonces debe hacer asignaciones como <code>if (a.HasValue) { b = a.Value; }</code> } o m&aacute;s corto <code>if (a != null) { b = a; }</code> } .
ja: <code>a</code> が <code>null</code> の場合、 <code>a.Value</code> を介してアクセスすると <code>NullReferenceException</code> ではなく <code>InvalidOperationException</code> がスローされることに注意してください。事前に確認する必要があります。つまり、null可能な別の変数 <code>int b;</code> 次に、 <code>if (a.HasValue) { b = a.Value; }</code> ような割り当てを行う必要があります。 }以下の <code>if (a != null) { b = a; }</code> }
ko: <code>a</code> 가 <code>null</code> 인 경우 <code>a.Value</code> 를 통해 액세스하면 <code>NullReferenceException</code> 대신 <code>InvalidOperationException</code> 이 발생합니다. 미리 검사를 수행해야합니다. 예를 들어 다른 널 입력 가능 변수가있는 경우 <code>int b;</code> 그런 다음 <code>if (a.HasValue) { b = a.Value; }</code> 와 같은 할당을 수행해야합니다 . } 또는 더 짧은 <code>if (a != null) { b = a; }</code> } .
ru: <strong>Обратите внимание,</strong> что доступ к нему через <code>a.Value</code> вызывает <code>InvalidOperationException</code> вместо <code>NullReferenceException</code> , если <code>a</code> равно <code>null</code> - вы должны выполнить проверку заранее, т. Е. Если у вас есть другая переменная on-nullable <code>int b;</code> тогда вы должны делать назначения вроде <code>if (a.HasValue) { b = a.Value; }</code> } или короче, <code>if (a != null) { b = a; }</code> }
zh_cn: <strong>请注意</strong> ，如果 <code>a</code> 为 <code>null</code> ，则通过 <code>a.Value</code> 访问它会引发 <code>InvalidOperationException</code> 而不是 <code>NullReferenceException</code> -您应该事先进行检查，即，如果您有另一个on-nullable变量 <code>int b;</code> 那么您应该像 <code>if (a.HasValue) { b = a.Value; }</code> }或更短， <code>if (a != null) { b = a; }</code> } 。

source: <strong>Note</strong> this applies to any and all control and component references making these illegal where they are:
es: <strong>Tenga en cuenta que</strong> esto se aplica a todas y cada una de las referencias de control y componentes que las hacen ilegales donde est&aacute;n:
ja: これは、すべてのコントロールおよびコンポーネントの参照に適用され、これらが以下の場所で違法になることに<strong>注意してください</strong> 。
ko: 이는 다음과 같은 경우 불법으로 만드는 모든 제어 및 구성 요소 참조에 적용됩니다.
ru: <strong>Обратите внимание, что</strong> это относится ко всем без исключения ссылкам на элементы управления и компонентов, что делает их недопустимыми, если они:
zh_cn: <strong>请注意，</strong>这适用于所有和所有控件和组件引用，使它们在以下位置非法：

source: <strong>Partial Remedy</strong>
es: <strong>Remedio parcial</strong>
ja: <strong>部分的な救済</strong>
ko: <strong>부분 치료</strong>
ru: <strong>Частичное Средство</strong>
zh_cn: <strong>部分补救</strong>

source: <strong>Plain Code Solution</strong>
es: <strong>Soluci&oacute;n de c&oacute;digo simple</strong>
ja: <strong>プレーンコードソリューション</strong>
ko: <strong>일반 코드 솔루션</strong>
ru: <strong>Решение с простым кодом</strong>
zh_cn: <strong>普通代码解决方案</strong>

source: <strong>Reason</strong> I am still not sure about the reason. But whenever any of the entity class will extend System.Web.UI.Page this error occurs.
es: <strong>Motivo</strong> Todav&iacute;a no estoy seguro del motivo. Pero cada vez que cualquiera de la clase de entidad extender&aacute; System.Web.UI.Page, se produce este error.
ja: <strong>理由</strong>私はまだ<strong>理由がわかり</strong>ません。 しかし、エンティティクラスのいずれかがSystem.Web.UI.Pageを拡張するたびに、このエラーが発生します。
ko: <strong>이유</strong> 나는 여전히 그 이유에 대해 확신하지 못한다. 그러나 엔터티 클래스가 System.Web.UI.Page를 확장 할 때마다이 오류가 발생합니다.
ru: <strong>Причина,</strong> я все еще не уверен в причине. Но всякий раз, когда какой-либо из классов сущностей расширяет System.Web.UI.Page, эта ошибка возникает.
zh_cn: <strong>原因</strong>我仍然不确定原因。 但是，只要任何实体类将扩展System.Web.UI.Page，就会发生此错误。

source: <strong>Reference types (these ones must be checked):</strong>
es: <strong>Tipos de referencia (estos deben ser verificados):</strong>
ja: <strong>参照タイプ（これらはチェックする必要があります）：</strong>
ko: <strong>참조 유형 (이 유형을 확인해야 함) :</strong>
ru: <strong>Типы ссылок (эти должны быть проверены):</strong>
zh_cn: <strong>引用类型（必须检查这些类型）：</strong>

source: <strong>Related Language Feature</strong>
es: <strong>Caracter&iacute;stica relacionada del lenguaje</strong>
ja: <strong>関連言語機能</strong>
ko: <strong>관련 언어 기능</strong>
ru: <strong>Родственный язык</strong>
zh_cn: <strong>相关语言功能</strong>

source: <strong>TL;DR:</strong> Try using <code>Html.Partial</code> instead of <code>Renderpage</code>
es: <strong>TL; DR:</strong> intente usar <code>Html.Partial</code> en lugar de <code>Renderpage</code>
ja: <strong>TL; DR：</strong> <code>Html.Partial</code> 代わりに <code>Renderpage</code> を使用してみてください
ko: <strong>TL; DR :</strong> <code>Html.Partial</code> 대신 Html.Partial을 사용해보십시오 <strong>.</strong>
ru: <strong>TL; DR:</strong> попробуйте использовать <code>Html.Partial</code> вместо <code>Renderpage</code>
zh_cn: <strong>TL; DR：</strong>尝试使用 <code>Html.Partial</code> 而不是 <code>Renderpage</code>

source: <strong>This is basically is a Null reference exception</strong>. As <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">Microsoft</a> states-
es: <strong>Esto es b&aacute;sicamente una excepci&oacute;n de referencia nula</strong> . Como dice <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">Microsoft</a>
ja: <strong>これは基本的にnull参照の例外</strong>です。 <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">マイクロソフトが</a>述べているように-
ko: <strong>이것은 기본 적으로 Null 참조 예외</strong> 입니다. <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">Microsoft는 다음과</a> 같이 말합니다.
ru: <strong>Это в основном является нулевым ссылочным исключением</strong> . Как заявляет <a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">Microsoft,</a>
zh_cn: <strong>这基本上是一个Null引用异常</strong> 。 如<a href="https://msdn.microsoft.com/en-us/library/system.nullreferenceexception(v=vs.110).aspx">Microsoft所述-</a>
