Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: This is concept-based: there is no code for you to paste into your project. It is intended to help you understand what causes a <code>NullReferenceException</code> (NRE), how to find it, how to fix it, and how to avoid it. An NRE can be caused many ways so this is unlikely to be your sole encounter.
es: Esto est&aacute; basado en el concepto: no hay c&oacute;digo para pegar en su proyecto. Su objetivo es ayudarlo a comprender qu&eacute; causa una <code>NullReferenceException</code> (NRE), c&oacute;mo encontrarla, c&oacute;mo solucionarla y c&oacute;mo evitarla. Una NRE puede ser causada de muchas maneras, por lo que es poco probable que sea su &uacute;nico encuentro.
ja: これは概念ベースです。プロジェクトに貼り付けるコードはありません。 これは、 <code>NullReferenceException</code> （NRE）の原因、その検出方法、修正方法、および回避方法を理解するのに役立つことを目的としています。 NREはさまざまな原因で発生する可能性があるため、これが唯一の遭遇であるとは限りません。
ko: 이것은 개념 기반입니다. 프로젝트에 붙여 넣을 코드는 없습니다. NRE ( <code>NullReferenceException</code> )의 원인, 찾는 방법, 해결 방법 및 피하는 방법을 이해하는 데 도움이됩니다. NRE는 여러 가지 방법으로 발생할 수 있으므로 이것이 유일한 만남은 아닐 것입니다.
ru: Это основано на концепции: нет кода для вставки в ваш проект. Он предназначен для того, чтобы помочь вам понять, что вызывает <code>NullReferenceException</code> (NRE), как его найти, как его исправить и как его избежать. NRE может быть вызвано многими способами, так что вряд ли это будет ваша единственная встреча.
zh_cn: 这是基于概念的：没有代码可粘贴到项目中。 它旨在帮助您了解导致 <code>NullReferenceException</code> （NRE）的原因，如何查找，如何修复它以及如何避免它。 NRE可以通过多种方式引起，因此这不太可能是您唯一遇到的问题。

source: This is why you get a NullReferenceExeption because the computer does not have data stored in that variable.
es: Por eso se obtiene una excepción de NullReferenceExeption porque el ordenador no tiene datos almacenados en esa variable.
ja: これが、コンピュータがその変数にデータを保存していないために NullReferenceExeption を取得する理由です。
ko: 컴퓨터에 해당 변수에 저장된 데이터가 없기 때문에 NullReferenceExeption을 얻는 이유입니다.
ru: Поэтому вы получаете NullReferenceExeption,потому что на компьютере нет данных,хранящихся в этой переменной.
zh_cn: 这就是为什么你会得到一个NullReferenceExeption,因为计算机没有在该变量中存储数据。

source: This line of code works best under your <code>Start()</code> or <code>Awake()</code> functions.
es: Esta l&iacute;nea de c&oacute;digo funciona mejor bajo sus funciones <code>Start()</code> o <code>Awake()</code> .
ja: このコード行は、 <code>Start()</code> または <code>Awake()</code> 関数の下で最適に機能します。
ko: 이 코드 줄은 <code>Start()</code> 또는 <code>Awake()</code> 함수에서 가장 잘 작동합니다.
ru: Эта строка кода лучше всего работает под вашими функциями <code>Start()</code> или <code>Awake()</code> .
zh_cn: 此代码行在 <code>Start()</code> 或 <code>Awake()</code> 函数下效果最佳。

source: This means the reference is <code>null</code>, and you cannot access members (such as methods) through a <code>null</code> reference. The simplest case:
es: Esto significa que la referencia es <code>null</code> y no puede acceder a los miembros (como los m&eacute;todos) a trav&eacute;s de una referencia <code>null</code> . El caso m&aacute;s simple:
ja: これは、参照が <code>null</code> であり、 <code>null</code> 参照を通じてメンバー（メソッドなど）にアクセスできないことを意味します。 最も単純なケース：
ko: 이는 참조가 <code>null</code> 이며 <code>null</code> 참조를 통해 멤버 (예 : 메소드)에 액세스 할 수 없음을 의미합니다. 가장 간단한 경우 :
ru: Это означает, что ссылка <code>null</code> , и вы не можете получить доступ к элементам (таким как методы) через <code>null</code> ссылку. Самый простой случай:
zh_cn: 这意味着引用为 <code>null</code> ，并且您无法通过 <code>null</code> 引用访问成员（例如方法）。 最简单的情况：

source: This reduces the number of null checks you have to do in some cases. The syntax is to put a question mark before each dot. Take the following code for example:
es: Esto reduce el número de controles nulos que tienes que hacer en algunos casos.La sintaxis es poner un signo de interrogación antes de cada punto.Tome el siguiente código por ejemplo:
ja: これにより、いくつかのケースで行わなければならないヌルチェックの数を減らすことができます。構文は、各ドットの前にクエスチョンマークを付けることです。例えば、次のコードを見てみましょう。
ko: 이를 통해 일부 경우에 수행해야하는 null 검사 횟수가 줄어 듭니다. 구문은 각 점 앞에 물음표를 넣는 것입니다. 예를 들어 다음 코드를 사용하십시오.
ru: Это уменьшает количество нулевых проверок,которые в некоторых случаях приходится делать.Синтаксис заключается в том,чтобы поставить знак вопроса перед каждой точкой.Возьмем,к примеру,следующий код:
zh_cn: 这样可以减少在某些情况下必须做的空校验的次数。语法是在每个点前加一个问号。以下面的代码为例。

source: This translates to
es: Esto se traduce en
ja: これは次のように翻訳されます。
ko: 이것은
ru: Это означает,что
zh_cn: 这相当于

source: This way, you can avoid <code>NullReferenceException</code> cases that are results of violation of the constraints set. For example, if you use an object property <code>X</code> in a class and later try to invoke one of its methods and <code>X</code> has a null value, then this will lead to <code>NullReferenceException</code>:
es: De esta manera, puede evitar los casos de <code>NullReferenceException</code> que son el resultado de la violaci&oacute;n del conjunto de restricciones. Por ejemplo, si usa una propiedad de objeto <code>X</code> en una clase y luego intenta invocar uno de sus m&eacute;todos y <code>X</code> tiene un valor nulo, esto conducir&aacute; a <code>NullReferenceException</code> :
ja: このようにして、制約セットの違反の結果である <code>NullReferenceException</code> ケースを回避できます。 たとえば、クラスでオブジェクトプロパティ <code>X</code> を使用し、後でそのメソッドの1つを呼び出そうとし、 <code>X</code> にnull値がある場合、これにより <code>NullReferenceException</code> が発生します。
ko: 이러한 방식으로, 제한 조건 설정을 위반 한 결과 인 <code>NullReferenceException</code> 을 피할 수 있습니다. 예를 들어 클래스에서 객체 속성 <code>X</code> 를 사용하고 나중에 메소드 중 하나를 호출하려고 시도하고 <code>X</code> 에 null 값이 있으면 <code>NullReferenceException</code> 이 발생합니다 .
ru: Таким образом, вы можете избежать случаев исключения <code>NullReferenceException</code> , которые являются результатом нарушения установленных ограничений. Например, если вы используете свойство объекта <code>X</code> в классе, а затем пытаетесь вызвать один из его методов, а <code>X</code> имеет нулевое значение, то это приведет к <code>NullReferenceException</code> :
zh_cn: 这样，您可以避免由于违反约束集而导致的 <code>NullReferenceException</code> 情况。 例如，如果您在类中使用对象属性 <code>X</code> ，然后稍后尝试调用其方法之一，并且 <code>X</code> 具有空值，则这将导致 <code>NullReferenceException</code> ：

source: This will create a <em>local</em> variable, <code>reg</code>, which exists only in that context (sub). The <code>reg</code> variable with module level <code>Scope</code> which you will use everywhere else remains <code>Nothing</code>.
es: Esto crear&aacute; una variable <em>local</em> , <code>reg</code> , que existe solo en ese contexto (sub). La variable <code>reg</code> con <code>Scope</code> de nivel de m&oacute;dulo que usar&aacute; en cualquier otro lugar sigue siendo <code>Nothing</code> .
ja: これにより、そのコンテキスト（サブ）にのみ存在する<em>ローカル</em>変数 <code>reg</code> が作成されます。 他の場所で使用するモジュールレベルの <code>Scope</code> を持つ <code>reg</code> 変数は <code>Nothing</code> のままです。
ko: 그러면 해당 컨텍스트 (sub)에만 존재하는 <em>로컬</em> 변수 <code>reg</code> 가 생성됩니다. 다른 곳에서 사용할 모듈 레벨 <code>Scope</code> 의 <code>reg</code> 변수는 <code>Nothing</code> 으로 남아 있습니다.
ru: Это создаст <em>локальную</em> переменную, <code>reg</code> , которая существует только в этом контексте (sub). Переменная <code>reg</code> с уровнем модуля <code>Scope</code> , которую вы будете использовать везде, <code>Nothing</code> не остается.
zh_cn: 这将创建一个<em>局部</em>变量 <code>reg</code> ，该<em>局部</em>变量仅在该上下文（子）中存在。 模块级别 <code>Scope</code> 的 <code>reg</code> 变量将保持不变。

source: This will do the following: If <code>myIntArray</code> is null, the expression returns null and you can safely check it. If it contains an array, it will do the same as: <code>elem = myIntArray[i];</code> and returns the <code>i&lt;sup&gt;th&lt;/sup&gt;</code> element.
es: Esto har&aacute; lo siguiente: Si <code>myIntArray</code> es nulo, la expresi&oacute;n devuelve nulo y puede verificarlo con seguridad. Si contiene una matriz, har&aacute; lo mismo que: <code>elem = myIntArray[i];</code> y devuelve el elemento <code>i&lt;sup&gt;th&lt;/sup&gt;</code> .
ja: これにより、次の <code>myIntArray</code> が行われます。myIntArrayがnullの場合、式はnullを返し、安全に確認できます。 配列が含まれている場合は、次と同じことを行い <code>elem = myIntArray[i];</code> そして <code>i&lt;sup&gt;th&lt;/sup&gt;</code> 要素を返します。
ko: <code>myIntArray</code> 가 null 인 경우 표현식은 null을 반환하므로 안전하게 확인할 수 있습니다. 배열이 포함 된 경우 다음과 동일하게 수행됩니다. <code>elem = myIntArray[i];</code> <code>i&lt;sup&gt;th&lt;/sup&gt;</code> 요소를 반환합니다.
ru: Это будет делать следующее: если <code>myIntArray</code> имеет значение null, выражение возвращает значение null, и вы можете безопасно проверить его. Если он содержит массив, он будет делать то же самое, что и: <code>elem = myIntArray[i];</code> и возвращает элемент <code>i&lt;sup&gt;th&lt;/sup&gt;</code> .
zh_cn: 这将执行以下操作：如果 <code>myIntArray</code> 为null，则表达式返回null，您可以安全地对其进行检查。 如果包含数组，则将执行以下操作： <code>elem = myIntArray[i];</code> 并返回第 <code>i&lt;sup&gt;th&lt;/sup&gt;</code> 元素。

source: This will result in the title variable being <code>null</code>, and the call to <code>ToUpper</code> is not made if <code>person.Title</code> is <code>null</code>.
es: Esto dar&aacute; como resultado que la variable de t&iacute;tulo sea <code>null</code> y que la llamada a <code>ToUpper</code> no se realice si <code>person.Title</code> es <code>null</code> .
ja: これにより、title変数が <code>null</code> になり、 <code>person.Title</code> が <code>null</code> の場合、 ToUpperへの <code>ToUpper</code> は行われません。
ko: 타이틀 변수는 <code>null</code> 이되고, <code>person.Title</code> 가 <code>null</code> 인 경우, <code>ToUpper</code> 에의 호출은 행해지 지 않습니다.
ru: Это приведет к тому, что переменная title будет иметь значение <code>null</code> , а вызов <code>person.Title</code> не будет выполнен, если person.Title имеет значение <code>null</code> .
zh_cn: 这将导致title变量为 <code>null</code> ，如果 <code>person.Title</code> 为 <code>null</code> ,则不会调用 <code>ToUpper</code> 。

source: This will throw a <code>NullReferenceException</code> at the second line because you can't call the instance method <code>ToUpper()</code> on a <code>string</code> reference pointing to <code>null</code>.
es: Esto arrojar&aacute; una <code>NullReferenceException</code> en la segunda l&iacute;nea porque no puede llamar al m&eacute;todo de instancia <code>ToUpper()</code> en una referencia de <code>string</code> apunta a <code>null</code> .
ja: <code>null</code> を指す <code>string</code> 参照でインスタンスメソッド <code>ToUpper()</code> を呼び出すことができないため、2行目に <code>NullReferenceException</code> がスローされます 。
ko: <code>null</code> 을 가리키는 <code>string</code> 참조에서 인스턴스 메소드 <code>ToUpper()</code> 를 호출 할 수 없기 때문에 두 번째 줄에서 <code>NullReferenceException</code> 이 발생합니다.
ru: Это создаст <code>NullReferenceException</code> во второй строке, потому что вы не можете вызвать метод экземпляра <code>ToUpper()</code> для <code>string</code> ссылки, указывающей на <code>null</code> .
zh_cn: 这将在第二行抛出 <code>NullReferenceException</code> ，因为您不能在指向 <code>null</code> 的 <code>string</code> 引用上调用实例方法 <code>ToUpper()</code> 。

source: Though this check <a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">will not end up in your release build</a>, causing it to throw the <code>NullReferenceException</code> again when <code>book == null</code> at runtime in release mode.
es: Aunque esta comprobaci&oacute;n <a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">no terminar&aacute; en su versi&oacute;n de lanzamiento</a> , lo que har&aacute; que arroje la <code>NullReferenceException</code> nuevamente cuando <code>book == null</code> en tiempo de ejecuci&oacute;n en modo de lanzamiento.
ja: このチェック<a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">はリリースビルド</a>で終了しないため 、リリースモードでの実行時に <code>book == null</code> ときに再度 <code>NullReferenceException</code> をスローします。
ko: 이 검사 <a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">는 릴리스 빌드에서 끝나지</a> 않지만 릴리스 모드에서 런타임에 <code>book == null</code> 일 때 <code>NullReferenceException</code> 을 다시 발생시킵니다.
ru: Хотя эта проверка <a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">не закончится в вашей сборке релиза</a> , она снова <code>NullReferenceException</code> когда <code>book == null</code> во время выполнения в режиме выпуска.
zh_cn: 尽管此检查<a href="https://stackoverflow.com/questions/3021538/debug-assert-appears-in-release-mode">将不会在您的发行版本中结束，</a>但会导致在发行模式下运行时 <code>book == null</code> 时再次引发 <code>NullReferenceException</code> 。

source: To avoid this error:
es: Para evitar este error:
ja: このエラーを回避するために
ko: 이 오류를 피하려면
ru: Чтобы избежать этой ошибки:
zh_cn: 为了避免这种错误。

source: To be clear, <code>Dim</code> (or <code>Private</code>) only <em>declares</em> a variable and its <code>Type</code>. The <em>Scope</em> of the variable - whether it exists for the entire module/class or is local to a procedure - is determined by <em>where</em> it is declared. <code>Private | Friend | Public</code> defines the access level, not <em>Scope</em>.
es: Para ser claros, <code>Dim</code> (o <code>Private</code> ) solo <em>declara</em> una variable y su <code>Type</code> . El <em>alcance</em> de la variable, ya sea que exista para todo el m&oacute;dulo / clase o sea local para un procedimiento, se determina por el lugar <em>donde</em> se declara. <code>Private | Friend | Public</code> Amigo | P&uacute;blico define el nivel de acceso, no el <em>alcance</em> .
ja: 明確にするために、 <code>Dim</code> （または <code>Private</code> ）は変数とその <code>Type</code> のみを<em>宣言</em>します。 変数の<em>スコープ</em> （モジュール/クラス全体に存在するか、プロシージャに対してローカルかどうか）は、変数が宣言されている<em>場所</em>によって決まります。 <code>Private | Friend | Public</code> 友達| Publicは<em>Scope</em>ではなくアクセスレベルを定義します。
ko: 명확히하기 위해 <code>Dim</code> (또는 <code>Private</code> )은 변수와 <code>Type</code> 만 <em>선언</em> 합니다. 변수의 <em>범위 (</em> 전체 모듈 / 클래스에 존재하는지 아니면 프로 시저에 로컬인지)는 선언 된 <em>위치에</em> 따라 결정됩니다. <code>Private | Friend | Public</code> 친구 | 공개 는 <em>범위가</em> 아닌 액세스 레벨을 정의합니다.
ru: Для ясности, <code>Dim</code> (или <code>Private</code> ) <em>объявляет</em> только переменную и ее <code>Type</code> . <em>Область</em> действия переменной - существует ли она для всего модуля / класса или является локальной для процедуры - определяется тем, <em>где</em> она объявлена. <code>Private | Friend | Public</code> Друг | Public определяет уровень доступа, а не <em>Scope</em> .
zh_cn: 需要明确的是， <code>Dim</code> （或 <code>Private</code> ）仅<em>声明</em>一个变量及其 <code>Type</code> 。 变量的<em>作用域</em> -是否存在于整个模块/类中还是过程的局部性-由声明<em>位置</em>确定。 <code>Private | Friend | Public</code> 朋友| Public定义访问级别，而不是<em>Scope</em> 。

source: To fix this you have to instantiate (assign object to reference of that class).
es: Para arreglar esto hay que instanciar (asignar el objeto a la referencia de esa clase).
ja: これを修正するには、インスタンス化(オブジェクトをそのクラスの参照に代入する)する必要があります。
ko: 이 문제를 해결하려면 인스턴스화해야합니다 (객체를 해당 클래스의 참조로 지정).
ru: Чтобы это исправить,необходимо инстанцировать (назначить объект на ссылку этого класса).
zh_cn: 为了解决这个问题,你必须实例化(将对象分配给该类的引用)。

source: To fully understand why a NullReferenceException is thrown, it is important to know the difference between <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">value types</a> and [reference types][3].
es: Para comprender completamente por qu&eacute; se produce una NullReferenceException, es importante conocer la diferencia entre los <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">tipos de valor</a> y [tipos de referencia] [3].
ja: NullReferenceExceptionがスローされる理由を完全に理解するには、 <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">値タイプ</a>と[参照タイプ] [3]の違いを理解することが重要です。
ko: NullReferenceException이 발생하는 이유를 완전히 이해하려면 <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">값 유형</a> 과 [참조 유형] [3]의 차이를 아는 것이 중요합니다.
ru: Чтобы полностью понять, почему выбрасывается исключение NullReferenceException, важно знать разницу между <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">типами значений</a> и [ссылочными типами] [3].
zh_cn: 要完全理解为什么会引发NullReferenceException，了解<a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/value-types">值类型</a>和[引用类型] [3]之间的区别非常重要。

source: To prevent the error, objects that could be null should be tested for null before being used.
es: Para evitar el error,los objetos que podrían ser nulos deben ser probados para ser nulos antes de ser utilizados.
ja: エラーを防ぐために、NULLになる可能性のあるオブジェクトは、使用する前にNULLかどうかをテストする必要があります。
ko: 오류를 방지하기 위해 널이 될 수있는 오브젝트를 사용하기 전에 널을 테스트해야합니다.
ru: Чтобы предотвратить ошибку,объекты,которые могут быть нулевыми,должны быть проверены на нулевой уровень перед использованием.
zh_cn: 为了防止错误,应该在使用前对可能为空的对象进行空的测试。

source: To understand why that is, it helps to understand how .NET produces null dereference exceptions in the first place. (These details apply to .NET running on Windows; other operating systems use similar mechanisms.)
es: Para entender por qué es así,ayuda a entender cómo el .NET produce excepciones de dereferencia nula en primer lugar.(Estos detalles se aplican al .NET que se ejecuta en Windows;otros sistemas operativos utilizan mecanismos similares).
ja: その理由を理解するには、そもそも.NET がどのようにして NULL 参照解除例外を生成しているのかを理解するのに役立ちます (これらの詳細は Windows で動作する .NET に適用されます。(これらの詳細は Windows 上で動作する .NET に適用されます。他のオペレーティングシステムでも同様のメカニズムを使用しています)。
ko: 그 이유를 이해하려면 .NET이 우선 null 역 참조 예외를 생성하는 방법을 이해하는 데 도움이됩니다. (이 세부 사항은 Windows에서 실행되는 .NET에 적용되며 다른 운영 체제에서도 유사한 메커니즘을 사용합니다.)
ru: Чтобы понять,почему это так,в первую очередь помогает понять,как .NET производит нулевые исключения разыменования.(Эти подробности применимы к .NET,работающей под Windows;другие операционные системы используют аналогичные механизмы).
zh_cn: 为了理解为什么会出现这种情况,首先要了解.NET是如何产生null dereference异常的。(这些细节适用于在Windows上运行的.NET;其他操作系统使用类似的机制。)

source: Typically, the <code>Settings</code> collection will only need to be initialized the first time the application runs. An alternate remedy is to add an initial value to your collection in <strong>Project -&gt; Settings | FooBars</strong>, save the project, then remove the fake value.
es: Por lo general, la colecci&oacute;n de <code>Settings</code> solo deber&aacute; inicializarse la primera vez que se ejecute la aplicaci&oacute;n. Una soluci&oacute;n alternativa es agregar un valor inicial a su colecci&oacute;n en <strong>Proyecto -&gt; Configuraci&oacute;n |</strong> <strong>FooBars</strong> , guarde el proyecto, luego elimine el valor falso.
ja: 通常、 <code>Settings</code> コレクションは、アプリケーションの初回実行時にのみ初期化する必要があります。 別の方法は、 <strong>プロジェクト-&gt;設定|で</strong>コレクションに初期値を追加することです<strong>。</strong> <strong>FooBars</strong> 、プロジェクトを保存してから、偽の値を削除します。
ko: 일반적으로 <code>Settings</code> 모음은 응용 프로그램을 처음 실행할 때만 초기화하면됩니다. 다른 해결 방법은 <strong>프로젝트-&gt; 설정 |</strong> <strong>FooBars</strong> , 프로젝트를 저장 한 다음 가짜 값을 제거하십시오.
ru: Как правило, коллекцию <code>Settings</code> необходимо инициализировать только при первом запуске приложения. Альтернативное решение - добавить начальное значение к вашей коллекции в <strong>Project -&gt; Settings |</strong> <strong>FooBars</strong> , сохраните проект, затем удалите поддельное значение.
zh_cn: 通常，仅在应用程序第一次运行时才需要初始化 <code>Settings</code> 集合。 另一种解决方法是在&ldquo; <strong>项目&rdquo;-&gt;&ldquo;设置&rdquo; |&ldquo;设置&rdquo;中</strong>为您的集合添加初始值<strong>。</strong> <strong>FooBars</strong> ，保存项目，然后删除假值。

source: Typically, the simplest remedy is used.
es: Normalmente,se utiliza el remedio más simple.
ja: 一般的には、最も単純な救済措置が使用されます。
ko: 일반적으로 가장 간단한 치료법이 사용됩니다.
ru: Как правило,используется простейшее средство.
zh_cn: 通常情况下,采用最简单的补救方法。

source: UI Controls
es: Controles de UI
ja: UI コントロール
ko: UI 컨트롤
ru: элементы управления пользовательским интерфейсом
zh_cn: UI控制

source: Under certain circumstances, trying to use an item from <code>My.Settings</code> which is a <code>StringCollection</code> can result in a NullReference the first time you use it. The solution is the same, but not as obvious. Consider:
es: En determinadas circunstancias, intentar usar un elemento de <code>My.Settings</code> que es una <code>StringCollection</code> puede generar una NullReference la primera vez que la use. La soluci&oacute;n es la misma, pero no tan obvia. Considerar:
ja: 特定の状況下では、 <code>StringCollection</code> である <code>My.Settings</code> のアイテムを使用しようとすると、初めて使用したときにNullReferenceが発生する可能性があります。 解決策は同じですが、それほど明白ではありません。 検討してください：
ko: 특정 상황에서 <code>My.Settings</code> 에서 <code>StringCollection</code> 인 항목을 사용하려고하면 처음 사용할 때 NullReference가 발생할 수 있습니다. 해결책은 동일하지만 명확하지 않습니다. 치다:
ru: При определенных обстоятельствах попытка использовать элемент из <code>My.Settings</code> , который является <code>StringCollection</code> , может привести к NullReference при первом его использовании. Решение то же самое, но не так очевидно. Рассматривать:
zh_cn: 在某些情况下，尝试使用 <code>My.Settings</code> 中的一个 <code>StringCollection</code> 项目可能会在您首次使用它时导致NullReference。 解决方案是相同的，但不是很明显。 考虑：

source: Unhandled Exception:
es: Excepción no manejada:
ja: 手つかずの例外。
ko: 처리되지 않은 예외 :
ru: Исключение без обращения:
zh_cn: 未处理的例外情况。

source: Use <code>Debug.Assert</code> if a value should never be <code>null</code>, to catch the problem earlier than the exception occurs.
es: Utilice <code>Debug.Assert</code> si un valor nunca debe ser <code>null</code> , para detectar el problema antes de que ocurra la excepci&oacute;n.
ja: 値が <code>null</code> になり <code>Debug.Assert</code> ない場合は、 Debug.Assertを使用して、例外が発生する前に問題をキャッチします。
ko: 예외가 발생하기 전에 문제점을 조기에 발견하려면 값이 <code>null</code> 이 아니어야하는 경우 <code>Debug.Assert</code> 를 사용하십시오.
ru: Используйте <code>Debug.Assert</code> , если значение никогда не должно быть <code>null</code> , чтобы поймать проблему раньше, чем возникнет исключение.
zh_cn: 如果值永远不能为 <code>null</code> ，请使用 <code>Debug.Assert</code> 来在出现异常之前更早地发现问题。

source: Use <code>GetValueOrDefault()</code> for <code>nullable</code> value types to provide a default value when they are <code>null</code>.
es: Use <code>GetValueOrDefault()</code> para <code>nullable</code> tipos de valores anulables para proporcionar un valor predeterminado cuando son <code>null</code> .
ja: <code>nullable</code> 値の型に対して <code>GetValueOrDefault()</code> を使用して、 <code>null</code> のときにデフォルト値を提供します。
ko: <code>nullable</code> 값 유형에 대해 <code>GetValueOrDefault()</code> 를 사용하여 <code>null</code> 일 때 기본값을 제공하십시오.
ru: Используйте <code>GetValueOrDefault()</code> для типов значений, <code>nullable</code> значение NULL, чтобы обеспечить значение по умолчанию, когда они равны <code>null</code> .
zh_cn: 将 <code>GetValueOrDefault()</code> 用于 <code>nullable</code> 值类型，以在它们为 <code>null</code> 时提供默认值。

source: Use a <code>For/Each</code> loop and test the <code>IsNewRow</code> property to determine if it is that last row. This works whether <code>AllowUserToAddRows</code> is true or not:
es: Use un bucle <code>For/Each</code> y pruebe la propiedad <code>IsNewRow</code> para determinar si es esa &uacute;ltima fila. Esto funciona si <code>AllowUserToAddRows</code> es verdadero o no:
ja: <code>For/Each</code> ループを使用し、 <code>IsNewRow</code> プロパティをテストして、最後の行かどうかを判断します。 これは、 <code>AllowUserToAddRows</code> がtrueかどうかに関係なく機能します。
ko: <code>For/Each</code> 루프를 사용하고 <code>IsNewRow</code> 속성을 테스트하여 마지막 행인지 확인하십시오. <code>AllowUserToAddRows</code> 가 true인지 여부에 관계없이 작동합니다.
ru: Используйте цикл <code>For/Each</code> и протестируйте свойство <code>IsNewRow</code> , чтобы определить, является ли он последней строкой. Это работает, является ли <code>AllowUserToAddRows</code> истинным или нет:
zh_cn: 使用 <code>For/Each</code> 循环并测试 <code>IsNewRow</code> 属性以确定它是否是最后一行。 无论 <code>AllowUserToAddRows</code> 为true，这都可以工作：

source: Use null context (available in C# 8):
es: Utilice el contexto nulo (disponible en C#8):
ja: nullコンテキストを使用します(C#8で利用可能)。
ko: null 컨텍스트 사용 (C # 8에서 사용 가능) :
ru: Использовать нулевой контекст (доступно на C#8):
zh_cn: 使用空上下文(在C#8中可用)。
