Repository: rueisnom/feedback
Catalog: xlf/46/60/14/2/4660142.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Debug and let the debugger break... It will directly take you to the variable that is broken... Now your task is to simply fix this.. Using the <strong>new</strong> keyword in the appropriate place.
es: Depura y deja que el depurador se rompa ... Te llevar&aacute; directamente a la variable que est&aacute; rota ... Ahora tu tarea es simplemente solucionar esto ... Usando la <strong>nueva</strong> palabra clave en el lugar apropiado.
ja: デバッグしてデバッガーを中断させます...中断された変数に直接移動します...ここでの作業は、これを単に修正することです。適切な場所で<strong>新しい</strong>キーワードを使用します。
ko: 디버그하고 디버거를 중단 시키십시오 ... 직접 깨진 변수로 이동합니다 ... 이제 작업을 간단하게 수정하는 것입니다. 적절한 위치에서 <strong>새</strong> 키워드를 사용하십시오.
ru: Отладьте и дайте отладчику сломаться ... Он напрямую приведет вас к сломанной переменной ... Теперь ваша задача просто исправить это ... Используя ключевое слово <strong>new</strong> в соответствующем месте.
zh_cn: 调试并让调试器中断...它将直接带您到已损坏的变量...现在您的任务是简单地解决此问题。.在适当的位置使用<strong>new</strong>关键字。

source: Debugger: For developers, we have the big weapon of Debugging with us. If have we face NullReferenceException during the development face we can use the debugger to get to the source of the exception.
es: Depurador:Para los desarrolladores,tenemos la gran arma de la depuración con nosotros.Si nos hemos enfrentado a la NullReferenceException durante la fase de desarrollo podemos usar el depurador para llegar al origen de la excepción.
ja: デバッガーです。開発者にとって、私たちはデバッグという大きな武器を持っています。開発中に NullReferenceException に直面した場合、デバッガを使って例外の発生源を突き止めることができます。
ko: 디버거 : 개발자에게는 큰 디버깅 무기가 있습니다. 개발 단계에서 NullReferenceException에 직면 한 경우 디버거를 사용하여 예외 소스에 도달 할 수 있습니다.
ru: Отладчик:Для разработчиков у нас есть большое оружие отладки.Если мы столкнулись с NullReferenceException во время разработки,мы можем использовать отладчик,чтобы добраться до источника исключения.
zh_cn: 调试器。对于开发者来说,我们身边有一个大的武器就是调试器。如果我们在开发过程中遇到了NullReferenceException,我们可以通过调试器找到异常的源头。

source: Debugging showed the model was Null inside MyOtherView. Until I changed it to:
es: La depuración mostró que el modelo era Nulo dentro de MyOtherView.Hasta que lo cambié a:
ja: デバッグするとMyOtherViewの中でモデルがNullになっていました。それを変更するまでは
ko: 디버깅 결과 모델이 MyOtherView 내부에 Null 인 것으로 나타났습니다. 내가 그것을 바꿀 때까지 :
ru: Отладка показала,что модель была Null внутри MyOtherView.Пока я не изменил ее:
zh_cn: 调试显示MyOtherView内部的模型为Null。直到我把它改成了。

source: Don't ignore compiler warnings (ever) and use <code>Option Strict On</code> (always).
es: No ignore las advertencias del compilador (nunca) y use <code>Option Strict On</code> (siempre).
ja: コンパイラの警告を無視しないで（常に）、 <code>Option Strict On</code> を常に使用します。
ko: 컴파일러 경고를 무시하지 말고 <code>Option Strict On</code> (항상)을 사용하십시오.
ru: Не игнорируйте предупреждения компилятора (всегда) и используйте <code>Option Strict On</code> (всегда).
zh_cn: 永远不要忽略编译器警告，而要始终使用 <code>Option Strict On</code> 。

source: Don't use empty Try/Catch blocks - let the code crash so you can a) identify the cause b) identify the location and c) apply a proper remedy. Try/Catch blocks are not intended to hide exceptions from the person uniquely qualified to fix them - the developer.
es: No uses bloques TryCatch vacíos-deja que el código se bloquee para que puedas a)identificar la causa b)identificar la ubicación y c)aplicar un remedio adecuado.Los bloques TryCatch no están pensados para ocultar las excepciones a la persona especialmente capacitada para arreglarlas-el desarrollador.
ja: 空の TryCatch ブロックを使用しないでください-コードをクラッシュさせて、a)原因を特定し、b)場所を特定し、c)適切な救済策を適用することができます。TryCatch ブロックは、例外を修正する資格のある開発者から例外を隠すことを目的としたものではありません。
ko: 빈 Try / Catch 블록을 사용하지 마십시오. 코드 충돌을 일으켜 a) 원인을 식별합니다. b) 위치를 식별하고 c) 적절한 해결책을 적용하십시오. Try / Catch 블록은 예외를 해결할 자격이있는 사람 (개발자)의 예외를 숨기려는 것이 아닙니다.
ru: Не используйте пустые блоки TryCatch-дайте коду упасть,чтобы вы могли а)определить причину b)определить местоположение и в)применить соответствующее средство правовой защиты.Блоки TryCatch не предназначены для того,чтобы скрывать исключения от человека,который обладает уникальной квалификацией для их исправления-разработчика.
zh_cn: 不要使用空的 TryCatch 块-让代码崩溃,这样你就可以 a)确定原因 b)确定位置 c)应用适当的补救措施。TryCatch 块的目的不是为了向有资格修复异常的人--开发人员--隐藏异常。

source: Edge case #1: concurrent access to a Dictionary
es: Caso límite #1:acceso simultáneo a un diccionario
ja: エッジケース #1:ディクショナリへの同時アクセス
ko: 에지 사례 # 1 : 사전에 동시 액세스
ru: Крайний регистр #1:одновременный доступ к словарю
zh_cn: 边缘情况#1:同时访问一个字典

source: Edge case #2: unsafe code
es: Caso límite #2:código inseguro
ja: エッジケース2:安全でないコード
ko: 에지 사례 # 2 : 안전하지 않은 코드
ru: Образец кода #2:небезопасный код
zh_cn: 边缘案例2:不安全代码

source: Either procedure will result in an NRE, because <code>barList</code> is only declared, not instantiated. Creating an instance of <code>Foo</code> will not also create an instance of the internal <code>barList</code>. It may have been the intent to do this in the constructor:
es: Cualquiera de los procedimientos dar&aacute; como resultado una NRE, porque la lista de <code>barList</code> solo se declara, no se instancia. Crear una instancia de <code>Foo</code> no crear&aacute; tambi&eacute;n una instancia de la <code>barList</code> interna. Puede haber sido la intenci&oacute;n de hacer esto en el constructor:
ja: <code>barList</code> はインスタンス化されずに宣言されるだけなので、どちらの手順でもNREになります。 <code>Foo</code> のインスタンスを作成しても、内部の <code>barList</code> のインスタンスは作成されません。 コンストラクタでこれを行う意図があったかもしれません：
ko: <code>barList</code> 는 인스턴스화되지 않고 선언되기 때문에 두 프로 시저 중 하나가 NRE가됩니다. <code>Foo</code> 인스턴스를 만들면 내부 <code>barList</code> 인스턴스도 만들어지지 않습니다. 생성자 에서이 작업을 수행하려는 의도 일 수 있습니다.
ru: Любая процедура приведет к NRE, потому что <code>barList</code> только объявлен, но не создан. Создание экземпляра <code>Foo</code> также не создаст экземпляр внутреннего <code>barList</code> . Возможно, это было сделано в конструкторе:
zh_cn: 这两个过程都将导致NRE，因为只声明了 <code>barList</code> ，没有实例化它。 创建 <code>Foo</code> 的实例也不会创建内部 <code>barList</code> 的实例。 可能是想在构造函数中执行此操作：

source: Enjoy and have fun making games!
es: ¡Disfruta y diviértete haciendo juegos!
ja: 楽しく、楽しくゲームを作っていきましょう
ko: 즐기고 재미있는 게임 만들기!
ru: Наслаждайтесь и получайте удовольствие,делая игры!
zh_cn: 尽情享受并享受制作游戏的乐趣吧!

source: Example 2 &mdash; Beware of the NewRow
es: Ejemplo 2 - Cuidado con el NewRow
ja: 例2 &mdash; NewRowに注意してください
ko: 예 2 &mdash; NewRow에주의
ru: Пример 2 - Остерегайтесь NewRow
zh_cn: 示例2 &mdash;提防NewRow

source: Examples and Remedies
es: Ejemplos y remedios
ja: 事例とレメディ
ko: 예와 치료
ru: Примеры и средства правовой защиты
zh_cn: 例子和补救措施

source: Exception handling: One of the important ways of managing this exception. Using simple try-catch-finally blocks we can control this exception and also maintain a log of it. This can be very useful when your application is on production stage.
es: Manejo de excepciones:Una de las formas importantes de manejar esta excepción.Usando simples bloques de prueba y captura podemos controlar esta excepción y también mantener un registro de la misma.Esto puede ser muy útil cuando su aplicación está en fase de producción.
ja: 例外の処理。この例外を管理する重要な方法の一つです。シンプルなtry-catch-finallyブロックを使用することで、この例外を制御し、そのログを維持することができます。これは、アプリケーションが運用段階にあるときに非常に便利です。
ko: 예외 처리 :이 예외를 관리하는 중요한 방법 중 하나입니다. 간단한 try-catch-finally 블록을 사용하여이 예외를 제어하고 로그를 유지할 수도 있습니다. 응용 프로그램이 프로덕션 단계에있을 때 매우 유용합니다.
ru: Обработка исключений:Один из важных способов управления этим исключением.Используя простые блоки try-catch-finally,мы можем контролировать это исключение,а также вести его журнал.Это может быть очень полезно,когда ваше приложение находится на стадии производства.
zh_cn: 异常处理。管理这个异常的重要方法之一。使用简单的 try-catch-finally 块,我们可以控制这个异常,并且还可以维护它的日志。当你的应用程序处于生产阶段时,这可能是非常有用的。

source: Explicit Checking: We should adhere to the tradition of checking the objects, properties, methods, arrays, and collections whether they are null. This can be simply implemented using conditional statements like if-else if-else etc.
es: Comprobación explícita:Debemos adherirnos a la tradición de comprobar los objetos,propiedades,métodos,conjuntos y colecciones si son nulos.Esto puede ser implementado simplemente usando declaraciones condicionales como if-else if-else etc.
ja: 明示的なチェック オブジェクト、プロパティ、メソッド、配列、コレクションがNULLであるかどうかをチェックする伝統を守るべきです。これは if-else if-else などの条件文を使って簡単に実装できます。
ko: 명시 적 검사 : 개체, 속성, 메서드, 배열 및 컬렉션이 null인지 여부를 확인하는 전통을 준수해야합니다. if-else if-else 등과 같은 조건문을 사용하여 간단하게 구현할 수 있습니다.
ru: Прямая проверка:Мы должны придерживаться традиции проверки объектов,свойств,методов,массивов и коллекций на предмет того,являются ли они нулевыми.Это можно просто реализовать,используя условные операторы,такие как if-else if-else и т.д.
zh_cn: 显式检查。我们应该坚持检查对象、属性、方法、数组、集合是否为空的传统。这可以简单的用条件语句来实现,如if-else if-else等。

source: Explicitly check for <code>null</code> and ignore null values.
es: Verifique expl&iacute;citamente si hay valores <code>null</code> e ignore los valores nulos.
ja: <code>null</code> を明示的にチェックし、 null値を無視します。
ko: <code>null</code> 명시 적으로 확인하고 널 값을 무시하십시오.
ru: Явно проверяйте <code>null</code> и игнорируйте нулевые значения.
zh_cn: 明确检查 <code>null</code> 并忽略null值。

source: Explicitly check for <code>null</code> and provide a default value.
es: Verifique expl&iacute;citamente <code>null</code> y proporcione un valor predeterminado.
ja: <code>null</code> を明示的にチェックして、デフォルト値を指定します。
ko: 명시 적으로 <code>null</code> 을 확인하고 기본값을 제공하십시오.
ru: Явно проверьте наличие <code>null</code> и укажите значение по умолчанию.
zh_cn: 明确检查 <code>null</code> 并提供默认值。

source: Explicitly check for <code>null</code> from method calls and throw a custom exception.
es: Verifique expl&iacute;citamente el <code>null</code> de las llamadas al m&eacute;todo y arroje una excepci&oacute;n personalizada.
ja: メソッド呼び出しから <code>null</code> を明示的にチェックし、カスタム例外をスローします。
ko: 메소드 호출에서 <code>null</code> 을 명시 적으로 확인하고 사용자 정의 예외를 발생시킵니다.
ru: Явно проверяйте <code>null</code> из вызовов методов и генерируйте пользовательское исключение.
zh_cn: 显式检查方法调用中是否为 <code>null</code> 并引发自定义异常。

source: Finding The Cause
es: Encontrar la causa
ja: 原因を見つける
ko: 원인 찾기
ru: Поиск причины
zh_cn: 寻找原因

source: First, make sure that the correct error is going to be caught - see <a href="https://stackoverflow.com/questions/4475464/">How do I allow breaking on 'System.NullReferenceException' in VS2010?</a><em>Note<sup>1</sup></em>
es: Primero, aseg&uacute;rese de detectar el error correcto: consulte <a href="https://stackoverflow.com/questions/4475464/">&iquest;C&oacute;mo permito romper en 'System.NullReferenceException' en VS2010?</a> <em>Nota <sup>1</sup></em>
ja: 最初に、正しいエラーがキャッチされることを確認します<a href="https://stackoverflow.com/questions/4475464/">-VS2010で「System.NullReferenceException」のブレークを許可するに</a>はどうすればよいですか？を参照してください。 <em>注<sup>1</sup></em>
ko: 먼저 올바른 오류가 발생하는지 확인하십시오 <a href="https://stackoverflow.com/questions/4475464/">-VS2010의 'System.NullReferenceException'차단을 어떻게 허용합니까?를</a> 참조하십시오 . <em>참고 <sup>1</sup></em>
ru: Во-первых, убедитесь, что будет обнаружена правильная ошибка - см. <a href="https://stackoverflow.com/questions/4475464/">Как разрешить разрыв на System.NullReferenceException в VS2010?</a> <em>Примечание <sup>1</sup></em>
zh_cn: 首先，确保将捕获正确的错误-请参阅<a href="https://stackoverflow.com/questions/4475464/">VS2010中的&ldquo; System.NullReferenceException&rdquo;如何允许中断？</a> <em>注<sup>1</sup></em>

source: Floating-point types
es: Tipos de punto flotante
ja: 浮動小数点型
ko: 부동 소수점 유형
ru: Типы с плавающей точкой
zh_cn: 浮动点类型

source: For More details : <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">Null-conditional Operators</a>
es: Para m&aacute;s detalles: <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">Operadores condicional nulo</a>
ja: 詳細： <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">ヌル条件演算子</a>
ko: 자세한 내용 : <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">Null 조건부 연산자</a>
ru: Для более подробной информации: <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">Нулевые операторы</a>
zh_cn: 有关更多详细信息： <a href="https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/operators/null-conditional-operators">空条件运算符</a>

source: For discussion have a look at <a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">NullReferenceException in DbContext.saveChanges()</a>
es: Para discusi&oacute;n, eche un vistazo a <a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">NullReferenceException en DbContext.saveChanges ()</a>
ja: 議論のため<a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">にDbContext.saveChanges（）のNullReferenceExceptionを</a>見てください
ko: 논의를 위해 <a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">DbContext.saveChanges ()의 NullReferenceException을</a> 살펴보십시오.
ru: Для обсуждения взгляните на <a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">NullReferenceException в DbContext.saveChanges ()</a>
zh_cn: 为了讨论，请查看<a href="https://stackoverflow.com/questions/17136455/nullreferenceexception-in-dbcontext-savechanges">DbContext.saveChanges（）中的NullReferenceException</a>

source: For example :
es: Por ejemplo:
ja: 例えば。
ko: 예를 들면 다음과 같습니다.
ru: Например :
zh_cn: 比如说:

source: For example, methods can check the different arguments to see if they are null and throw an <code>ArgumentNullException</code>, an exception obviously created for this exact purpose.
es: Por ejemplo, los m&eacute;todos pueden verificar los diferentes argumentos para ver si son nulos y lanzar una excepci&oacute;n <code>ArgumentNullException</code> , una excepci&oacute;n obviamente creada para este prop&oacute;sito exacto.
ja: たとえば、メソッドはさまざまな引数をチェックしてそれらがnullかどうかを確認し、 <code>ArgumentNullException</code> をスローできます。これは、まさにこの目的のために作成された例外です。
ko: 예를 들어, 메소드는 다른 인수를 검사하여 인수가 널인지 확인하고 <code>ArgumentNullException</code> 을 던질 수 있습니다. ArgumentNullException 이 예외적 인 목적으로 작성된 예외입니다.
ru: Например, методы могут проверять различные аргументы, чтобы определить, являются ли они нулевыми, и генерировать <code>ArgumentNullException</code> , исключение, явно созданное для этой конкретной цели.
zh_cn: 例如，方法可以检查不同的参数以查看它们是否为空，并抛出 <code>ArgumentNullException</code> ，显然是为此目的而创建的异常。

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:
zh_cn: 例如:

source: For instance, in the following line the only code that <em>can</em> cause the exception is if <code>myString</code> evaluates to null. This can be verified by looking at the <a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">Watch Window</a> or running expressions in the <a href="https://msdn.microsoft.com/en-us/library/f177hahy.aspx">Immediate Window</a>.
es: Por ejemplo, en la siguiente l&iacute;nea, el &uacute;nico c&oacute;digo que <em>puede</em> causar la excepci&oacute;n es si <code>myString</code> se eval&uacute;a como nulo. Esto se puede verificar mirando la <a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">Ventana de Observaci&oacute;n</a> o ejecutando expresiones en la <a href="https://msdn.microsoft.com/en-us/library/f177hahy.aspx">Ventana Inmediata</a> .
ja: たとえば、次の行で例外が発生する<em>可能</em>性<em>が</em>ある唯一のコードは、 <code>myString</code> がnullと評価された場合です 。 これは、 <a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">ウォッチウィンドウ</a>を確認するか、 <a href="https://msdn.microsoft.com/en-us/library/f177hahy.aspx">イミディエイトウィンドウで</a>式を実行することで確認できます。
ko: 예를 들어, 다음 줄에서 예외를 일으킬 <em>수</em> 있는 유일한 코드는 <code>myString</code> 이 null로 평가되는 경우입니다. 이는 <a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">조사</a> 식 창을 보거나 직접 실행 창 에서 식을 실행하여 확인할 수 있습니다.
ru: Например, в следующей строке единственный код, который <em>может</em> вызвать исключение, - это если <code>myString</code> имеет значение null. Это можно проверить, посмотрев в <a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">окно просмотра</a> или запустив выражения в <a href="https://msdn.microsoft.com/en-us/library/f177hahy.aspx">Immediate Window</a> .
zh_cn: 例如，在以下行中，唯一导致该异常的代码是 <code>myString</code> 的评估结果是否为null。 可以通过查看<a href="http://msdn.microsoft.com/en-us/library/aa290869(v=vs.71).aspx">监视窗口</a>或在<a href="https://msdn.microsoft.com/en-us/library/f177hahy.aspx">即时窗口中</a>运行表达式来验证这一点。

source: For me the reason was that I had rename the file and old file was still open.
es: Para mí la razón era que había cambiado el nombre del archivo y el viejo archivo seguía abierto.
ja: 私の場合は、ファイル名を変更しても古いファイルが開いたままだったのが原因でした。
ko: 나에게 그 이유는 파일 이름을 바꾸고 이전 파일이 여전히 열려 있기 때문입니다.
ru: Для меня причина была в том,что я переименовал файл,а старый файл все еще был открыт.
zh_cn: 对我来说,原因是我重命名了文件,而旧文件还在打开。

source: For more information, see <a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"><code>List(Of T)</code> Class</a>.
es: Para obtener m&aacute;s informaci&oacute;n, consulte <a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"> <code>List(Of T)</code> Clase</a> .
ja: 詳細については、「 <a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"> <code>List(Of T)</code> Class</a> 」を参照してください。
ko: 자세한 내용은 <a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"> <code>List(Of T)</code> Class를</a> 참조하십시오.
ru: Для получения дополнительной информации см. <a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"> <code>List(Of T)</code> Class</a> .
zh_cn: 有关更多信息，请参见<a href="https://msdn.microsoft.com/en-us/library/6sh2ey19(v=vs.110).aspx"> <code>List(Of T)</code> 类</a> 。

source: For more information, see:
es: Para más información,véase:
ja: 詳細はこちらをご覧ください。
ko: 자세한 내용은 다음을 참조하십시오.
ru: Для дополнительной информации,смотрите:
zh_cn: 欲了解更多信息,请参见:

source: For the sake of completeness DataContext class
es: Para completar la clase de DataContext...
ja: 完全性のために DataContext クラス
ko: 완전성을 위해 DataContext 클래스
ru: Для полноты класса DataContext
zh_cn: 为了完整起见,DataContext类

source: For this cause, <em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">Code Contracts</a></em> project exists for .NET applications.
es: Por esta causa, el proyecto de <em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">contratos de c&oacute;digo</a></em> existe para aplicaciones .NET.
ja: このため、.NETアプリケーション用の<em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">Code Contracts</a></em>プロジェクトが存在します。
ko: 이로 인해 .NET 애플리케이션에 대한 <em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">Code Contracts</a></em> 프로젝트가 존재합니다.
ru: По этой причине проект <em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">Code Contracts</a></em> существует для приложений .NET.
zh_cn: 因此，存在用于.NET应用程序的<em><a href="http://msdn.microsoft.com/en-us/library/dd264808%28v=vs.110%29.aspx">Code Contracts</a></em>项目。

source: For your reference I made the code above available on GitHub, you can find it at:
es: Para su referencia,he puesto el código de arriba a disposición de GitHub,lo puede encontrar en:
ja: 参考までに、上記のコードをGitHubで利用できるようにしました。
ko: 참고로 GitHub에서 위의 코드를 사용할 수 있도록 만들었습니다.
ru: Для справки:я сделал код,приведённый выше,доступным на GitHub,вы можете найти его по адресу:
zh_cn: 为了供大家参考,我在GitHub上提供了上面的代码,你可以在以下网址找到它。

source: Function Returning Nothing
es: La función no devuelve nada
ja: 何も返さない関数
ko: 아무것도 반환하지 않는 함수
ru: Функция возврата Ничего
zh_cn: 函数返回无

source: Further Notes: If you want unity to add a component to your object and you might have forgotten to add one, you can type <code>[RequireComponent(typeof(RigidBody))]</code> above your class declaration (the space below all of your usings).
es: Notas adicionales: Si desea la unidad para agregar un componente a su objeto y puede haber olvidado agregar uno, puede escribir <code>[RequireComponent(typeof(RigidBody))]</code> arriba de su declaraci&oacute;n de clase (el espacio debajo de todos sus usos).
ja: 詳細注記：単一でコンポーネントをオブジェクトに追加したいが、コンポーネントを追加するのを忘れた場合は、クラス宣言の上に <code>[RequireComponent(typeof(RigidBody))]</code> と入力できます（すべての使用の下のスペース）。
ko: 추가 참고 사항 : 개체에 구성 요소를 추가하고 단일 구성 요소를 추가하지 않은 경우 클래스 선언 (모든 사용 아래의 공간 <code>[RequireComponent(typeof(RigidBody))]</code> 위에 [RequireComponent (typeof (RigidBody))]를 입력 할 수 있습니다.
ru: Дополнительные примечания: Если вы хотите, чтобы <code>[RequireComponent(typeof(RigidBody))]</code> добавил компонент к вашему объекту, и вы, возможно, забыли добавить его, вы можете ввести [RequireComponent (typeof (RigidBody))]] выше объявления класса (пробел под всеми вашими использованиями).
zh_cn: 附加说明：如果要统一向对象添加组件，并且可能忘记添加一个组件，则可以在类声明上方（所有用法下方的空格 <code>[RequireComponent(typeof(RigidBody))]</code> 键入[RequireComponent（typeof（RigidBody））] 。

source: Furthermore, the reason I didn't have <code>Html.Partial</code> to begin with was because Visual Studio <strong>sometimes</strong> throws error-looking squiggly lines under <code>Html.Partial</code> if it's inside a differently constructed <code>foreach</code> loop, even though it's not really an error:
es: Adem&aacute;s, la raz&oacute;n por la que no ten&iacute;a <code>Html.Partial</code> para empezar era porque Visual Studio a <strong>veces</strong> arroja l&iacute;neas <code>Html.Partial</code> con aspecto de error debajo de Html.Partial si est&aacute; dentro de un bucle <code>foreach</code> construido de manera diferente, aunque en realidad no es un error:
ja: さらに、私が <code>Html.Partial</code> を持っていなかった理由は、実際にはエラーではありませんが、異なる構成の <code>foreach</code> ループ内にある場合、Visual Studio <strong>が</strong> <code>Html.Partial</code> の下でエラーに見える波線を<strong>時々</strong>スローするためです。
ko: 또한 <code>Html.Partial</code> 을 시작하지 않은 이유는 Visual Studio가 <code>Html.Partial</code> 아래에 오류처럼 보이는 구불 구불 한 줄을 던지기 때문입니다. 실제로 오류가 아니더라도 다르게 구성된 <code>foreach</code> 루프 안에 있으면
ru: Кроме того, причина, по которой у меня не было <code>Html.Partial</code> для начала, заключалась в том, что Visual Studio <strong>иногда</strong> бросает волнистые строки, выглядящие как ошибки, в <code>Html.Partial</code> , если он находится внутри цикла <code>foreach</code> , сконструированного по-другому, даже если это на самом деле не ошибка:
zh_cn: 此外，我之所以没有 <code>Html.Partial</code> 的原因是因为Visual Studio <strong>有时</strong>会在 <code>Html.Partial</code> 下抛出看似扭曲的行，即使它不是在错误构造的 <code>foreach</code> 循环中，即使它不是在错误中：
