Repository: rueisnom/feedback
Catalog: xlf/56/23/03/562303.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <sup>Although this isn't a book as such, many programmers recommend reading and implementing as much of it as possible. MISRA-C was originally intended as guidelines for safety-critical applications in particular, but it applies to any area of application where stable, bug-free C code is desired (who doesn't want fewer bugs?). MISRA-C is becoming the de facto standard in the whole embedded industry and is getting increasingly popular even in other programming branches. There are (at least) three publications of the standard (1998, 2004, and the current version from 2012). There is also a MISRA Compliance Guidelines document from 2016, and MISRA C:2012 Amendment 1 &mdash; Additional Security Guidelines for MISRA C:2012 (published in April 2016).<br/> Note that some of the strictures in the MISRA rules are not appropriate to every context. For example, directive 4.12 states "Dynamic memory allocation shall not be used". This is appropriate in the embedded systems for which the MISRA rules are designed; it is not appropriate everywhere. (Compilers, for instance, generally use dynamic memory allocation for things like symbol tables, and to do without dynamic memory allocation would be difficult, if not preposterous.)</sup>
es: <sup>Aunque este no es un libro como tal, muchos programadores recomiendan leer e implementar la mayor cantidad posible.</sup> <sup>MISRA-C fue originalmente pensado como una gu&iacute;a para aplicaciones cr&iacute;ticas de seguridad en particular, pero se aplica a cualquier &aacute;rea de aplicaci&oacute;n donde se desee un c&oacute;digo C estable y libre de errores (&iquest;qui&eacute;n no quiere menos errores?).</sup> <sup>MISRA-C se est&aacute; convirtiendo en el est&aacute;ndar de facto en toda la industria integrada y se est&aacute; volviendo cada vez m&aacute;s popular incluso en otras ramas de programaci&oacute;n.</sup> <sup>Hay (al menos) tres publicaciones de la norma (1998, 2004 y la versi&oacute;n actual de 2012).</sup> <sup>Tambi&eacute;n hay un documento de Pautas de cumplimiento de MISRA de 2016, y MISRA C: 2012 Enmienda 1 - Pautas de seguridad adicionales para MISRA C: 2012 (publicado en abril de 2016).</sup> <sup><br/></sup> <sup>Tenga en cuenta que algunas de las restricciones en las reglas MISRA no son apropiadas para cada contexto.</sup> <sup>Por ejemplo, la directiva 4.12 establece "No se utilizar&aacute; la asignaci&oacute;n din&aacute;mica de memoria".</sup> <sup>Esto es apropiado en los sistemas integrados para los cuales est&aacute;n dise&ntilde;adas las reglas MISRA;</sup> <sup>No es apropiado en todas partes.</sup> <sup>(Los compiladores, por ejemplo, generalmente usan la asignaci&oacute;n de memoria din&aacute;mica para cosas como tablas de s&iacute;mbolos, y prescindir de la asignaci&oacute;n de memoria din&aacute;mica ser&iacute;a dif&iacute;cil, si no absurdo).</sup>
ja: <sup>これ自体は本ではありませんが、多くのプログラマーは、できるだけ多くの本を読んで実装することを推奨しています。</sup> <sup>MISRA-Cはもともと、特に安全性が重要なアプリケーションのガイドラインとして意図されていましたが、安定したバグのないCコードが必要なアプリケーションのすべての領域に適用されます（バグを減らしたくない人はいますか？）。</sup> <sup>MISRA-Cは組み込み業界全体で事実上の標準になりつつあり、他のプログラミングブランチでも人気が高まっています。</sup> <sup>この規格には（少なくとも）3つの出版物があります（1998年、2004年、および2012年の最新バージョン）。</sup> <sup>2016年のMISRAコンプライアンスガイドラインドキュメント、およびMISRA C：2012改訂1 &mdash; MISRA C：2012の追加のセキュリティガイドライン（2016年4月に発行）もあります。</sup> <sup><br/></sup> <sup>MISRAルールの一部の制限は、すべてのコンテキストに適切ではないことに注意してください。</sup> <sup>たとえば、指令4.12は「動的メモリ割り当ては使用してはならない」と述べています。</sup> <sup>これは、MISRAルールが設計されている組み込みシステムに適しています。</sup> <sup>それはどこでも適切ではありません。</sup> <sup>（たとえば、コンパイラは通常、シンボルテーブルのようなものに動的メモリ割り当てを使用します。動的メモリ割り当てなしで行うことは、途方もないものであるとしても、困難です。）</sup>
ko: <sup>이 책은 그런 책이 아니지만, 많은 프로그래머들은 가능한 많은 책을 읽고 구현할 것을 권장합니다.</sup> <sup>MISRA-C는 원래 특히 안전에 중요한 응용 프로그램을위한 지침으로 고안되었지만, 버그가없는 안정적이고 버그가없는 C 코드가 필요한 모든 응용 분야에 적용됩니다 (버그 수를 줄이려는 사람은 누구입니까?).</sup> <sup>MISRA-C는 전체 임베디드 산업에서 사실상의 표준이되고 있으며 다른 프로그래밍 분야에서도 점점 인기를 얻고 있습니다.</sup> <sup>표준 (1998 년, 2004 년 및 2012 년의 현재 버전)에는 최소한 3 개의 간행물이 있습니다.</sup> <sup>2016 년의 MISRA 준수 지침 문서와 MISRA C : 2012 개정 1-MISRA C : 2012의 추가 보안 지침 (2016 년 4 월에 게시)도 있습니다.</sup> <sup><br/></sup> <sup>MISRA 규칙의 일부 제한 사항은 모든 상황에 적합한 것은 아닙니다.</sup> <sup>예를 들어, 지시문 4.12에는 "동적 메모리 할당을 사용해서는 안됩니다"라고되어 있습니다.</sup> <sup>이것은 MISRA 규칙이 설계된 내장 시스템에 적합합니다.</sup> <sup>모든 곳에서 적합하지 않습니다.</sup> <sup>예를 들어, 컴파일러는 일반적으로 심볼 테이블과 같은 것들에 동적 메모리 할당을 사용하며 동적 메모리 할당없이 수행하는 것은 어리석지 않은 경우 어려울 것입니다.</sup>
ru: <sup>Хотя это не книга как таковая, многие программисты рекомендуют читать и реализовывать как можно больше.</sup> <sup>Первоначально MISRA-C был задуман как руководство для приложений, критически важных для безопасности, но он применим к любой области применения, где требуется стабильный, безошибочный C-код (кто не хочет меньше ошибок?).</sup> <sup>MISRA-C становится стандартом де-факто во всей индустрии встраиваемых систем и становится все более популярным даже в других областях программирования.</sup> <sup>Существует (как минимум) три публикации стандарта (1998, 2004 и текущая версия от 2012).</sup> <sup>Существует также документ с рекомендациями по соответствию MISRA от 2016 года и поправка 1 к MISRA C: 2012 - Дополнительные рекомендации по безопасности для MISRA C: 2012 (опубликовано в апреле 2016 года).</sup> <sup><br/></sup> <sup>Обратите внимание, что некоторые ограничения в правилах MISRA не подходят для каждого контекста.</sup> <sup>Например, директива 4.12 гласит: &laquo;Динамическое распределение памяти не должно использоваться&raquo;.</sup> <sup>Это подходит для встроенных систем, для которых разработаны правила MISRA;</sup> <sup>это не везде уместно.</sup> <sup>(Например, компиляторы обычно используют динамическое выделение памяти для таких вещей, как таблицы символов, и обойтись без динамического выделения памяти будет сложно, если не абсурдно.)</sup>
zh_cn: <sup>尽管这不是本书，但许多程序员还是建议阅读并尽可能多地实施。</sup> <sup>MISRA-C最初旨在作为对安全性至关重要的应用程序的指导原则，但它适用于需要稳定，无错误的C代码（谁不想减少错误的人？）的任何应用程序领域。</sup> <sup>MISRA-C正在成为整个嵌入式行业的事实上的标准，并且甚至在其他编程分支中也越来越受欢迎。</sup> <sup>该标准至少有三本出版物（1998年，2004年和2012年的最新版本）。</sup> <sup>还有2016年以来的《 MISRA遵从性指南》文件和MISRA C：2012修正案1 &ndash; MISRA C：2012的附加安全性指南（于2016年4月发布）。</sup> <sup><br/></sup> <sup>请注意，MISRA规则中的某些限制并非适用于每种情况。</sup> <sup>例如，指令4.12指出&ldquo;不得使用动态内存分配&rdquo;。</sup> <sup>这对于设计了MISRA规则的嵌入式系统是合适的。</sup> <sup>这并不适合在任何地方。</sup> <sup>（例如，编译器通常对符号表之类的东西使用动态内存分配，并且如果没有荒谬的话，不进行动态内存分配将很困难。）</sup>

source: <sup>Some have argued for the removal of 'Traps and Pitfalls' from this list because it has trapped some people into making mistakes; others continue to argue for its inclusion. Perhaps it should be regarded as an 'expert' book because it requires a moderately extensive knowledge of C to understand what's changed since it was published.</sup>
es: <sup>Algunos han abogado por la eliminaci&oacute;n de 'Trampas y trampas' de esta lista porque ha atrapado a algunas personas a cometer errores;</sup> <sup>otros contin&uacute;an defendiendo su inclusi&oacute;n.</sup> <sup>Quiz&aacute;s deber&iacute;a considerarse como un libro "experto" porque requiere un conocimiento moderadamente extenso de C para comprender lo que ha cambiado desde su publicaci&oacute;n.</sup>
ja: <sup>一部の人々は間違いを犯すことになるので、このリストから「罠と落とし穴」を削除することを主張している人もいます。</sup> <sup>他のものはその包含について主張し続けます。</sup> <sup>おそらく、それが出版されてから何が変更されたかを理解するために、Cについて中程度に広範な知識を必要とするため、「専門家」と見なされるべきです。</sup>
ko: <sup>어떤 사람들은이 목록에서 '트랩과 함정'을 제거한다고 주장했습니다.</sup> <sup>다른 사람들은 그 포함에 대해 계속 주장하고있다.</sup> <sup>아마도 출판 된 이후 변경된 내용을 이해하려면 C에 대한 지식이 어느 정도 필요하기 때문에 '전문가'책으로 간주해야 할 것입니다.</sup>
ru: <sup>Некоторые выступают за исключение &laquo;ловушек и ловушек&raquo; из этого списка, потому что некоторые люди попадают в ловушку ошибок;</sup> <sup>другие продолжают отстаивать его включение.</sup> <sup>Возможно, это следует рассматривать как &laquo;экспертную&raquo; книгу, потому что для понимания того, что изменилось с момента ее публикации, требуется умеренно обширное знание языка Си.</sup>
zh_cn: <sup>一些人主张从该清单中删除&ldquo;陷阱和陷阱&rdquo;，因为它使某些人陷于犯错。</sup> <sup>其他人继续争论将其纳入。</sup> <sup>也许应该将其视为&ldquo;专家&rdquo;书，因为它需要一定程度的C语言方面的知识才能了解自发布以来所发生的变化。</sup>

source: A similar list for <a href="/questions/tagged/c%2b%2b">c++</a>: <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">The Definitive C++ Book Guide and List</a>
es: Una lista similar para <a href="/questions/tagged/c%2b%2b">c ++</a> : la <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">gu&iacute;a y lista definitiva de libros de C ++</a>
ja: <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">C ++</a>の同様のリスト： The Definitive C ++ Book Guide and List
ko: <a href="/questions/tagged/c%2b%2b">C ++에</a> 대한 비슷한 목록 : <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">결정적 C ++ 책 가이드 및 목록</a>
ru: Аналогичный список для <a href="/questions/tagged/c%2b%2b">C ++</a> : <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">The Definitive C ++ Book Guide и List</a>
zh_cn: <a href="/questions/tagged/c%2b%2b">c ++的</a>类似清单： <a href="https://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">权威的C ++书籍指南和清单</a>

source: Also do not use the book <a href="https://smile.amazon.com/dp/9387284492/">Let Us C</a> (16<sup>th</sup> Edition, 2017) by Yashwant Kanetkar. Many people view it as an outdated book that teaches Turbo C and has lots of obsolete, misleading and incorrect material. For example, page 137 discusses the expected output from <code>printf("%d %d %d\n", a, ++a, a++)</code> and does not categorize it as <a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">undefined behaviour</a> as it should.
es: Tampoco use el libro <a href="https://smile.amazon.com/dp/9387284492/">Let Us C</a> (16th Edition, 2017) de Yashwant Kanetkar. Muchas personas lo ven como un libro obsoleto que ense&ntilde;a Turbo C y tiene mucho material obsoleto, enga&ntilde;oso e incorrecto. Por ejemplo, la p&aacute;gina 137 analiza el resultado esperado de <code>printf("%d %d %d\n", a, ++a, a++)</code> y no lo clasifica como <a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">un comportamiento indefinido</a> como deber&iacute;a.
ja: また、Yashwant Kanetkarによる本「 <a href="https://smile.amazon.com/dp/9387284492/">Let Us C</a> （16 <sup>th</sup> Edition、2017）」も使用しないでください。 多くの人々はそれをターボCを教える時代遅れの本とみなし、多くの時代遅れで誤解を招くそして不正確な資料を持っています。 たとえば、137ページでは、 <code>printf("%d %d %d\n", a, ++a, a++)</code> からの予想される出力について説明し、予期しない<a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">未定義の動作</a>として分類していません。
ko: 또한 Yashwant Kanetkar의 <a href="https://smile.amazon.com/dp/9387284492/">Let Us C</a> (16 판, 2017) 책을 사용하지 마십시오. 많은 사람들이이 책을 터보 C를 가르치는 구식 책으로보고, 쓸모없고 오해의 소지가 있으며 잘못된 자료가 많이 있습니다. 예를 들어, 137 페이지는 <code>printf("%d %d %d\n", a, ++a, a++)</code> 의 예상 출력에 대해 설명하고 <a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">정의되지 않은 동작</a> 으로 분류하지 않습니다.
ru: Также не пользуйтесь книгой Яшванта Канеткара &laquo; <a href="https://smile.amazon.com/dp/9387284492/">Let Us C&raquo;</a> (16th Edition, 2017). Многие люди рассматривают ее как устаревшую книгу, которая учит Turbo C и содержит много устаревшего, вводящего в заблуждение и неправильного материала. Например, на странице 137 обсуждается ожидаемый вывод из <code>printf("%d %d %d\n", a, ++a, a++)</code> и не классифицирует его как <a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">неопределенное поведение,</a> как следует.
zh_cn: 也不要使用Yashwant Kanetkar的《 <a href="https://smile.amazon.com/dp/9387284492/">让我们吧》</a> （2017年<sup>第</sup> 16版）。 许多人将其视为一本过时的书，该书教授Turbo C，并且包含许多过时，误导和不正确的资料。 例如，第137页讨论了 <code>printf("%d %d %d\n", a, ++a, a++)</code> 的预期输出，并且并未将其分类为<a href="https://stackoverflow.com/questions/949433/why-are-these-constructs-using-pre-and-post-increment-undefined-behavior">未定义的行为</a> 。

source: Archived lists of ACCU-reviewed books on <a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">Beginner's C</a> (116 titles) from 2007 and <a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> (76 titles) from 2008. Most of these don't look to be on the main site anymore, and you can't browse that by subject anyway.
es: Listas archivadas de libros revisados ​​por ACCU sobre <a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">Beginner's C</a> (116 t&iacute;tulos) de 2007 y <a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> (76 t&iacute;tulos) de 2008. La mayor&iacute;a de estos ya no parecen estar en el sitio principal, y no puede navegar por tema de todas formas.
ja: 2007年の<a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">Beginner's C</a> （116タイトル）および2008年の<a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> （76タイトル）に関するACCUレビュー済み書籍のアーカイブリスト。これらのほとんどはメインサイトにないようで、件名で閲覧することはできません。とにかく。
ko: 2007 년 <a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">의 Beginner 's C</a> (116 권) 및 2008 년의 <a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> (76 권)에 대한 ACCU 검토 도서의 보관 된 목록입니다.이 중 대부분은 더 이상 기본 사이트에있는 것으로 보이지 않으므로 주제별로 찾아 볼 수 없습니다. 어쨌든.
ru: Архивные списки рецензируемых ACCU книг о <a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">C для начинающих</a> (116 наименований) с 2007 года и <a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> (76 названий) с 2008 года. Большинство из них больше не предназначены для просмотра на основном сайте, и вы не можете просматривать их по темам так или иначе.
zh_cn: ACCU审阅过的书籍的存档列表，这些书籍分别来自2007年的<a href="https://web.archive.org/web/20071105015557/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/beginner_s_c.htm">Beginner's C</a> （116个标题）和2008年的<a href="https://web.archive.org/web/20081020081215/http://www.accu.informika.ru/bookreviews/public/reviews/0sb/advanced_c.htm">Advanced C</a> （76个标题）。大多数看起来不再是主要网站，您无法按主题浏览无论如何。

source: Be wary of books written by <a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">Herbert Schildt</a>. In particular, you should stay away from <a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">C: The Complete Reference</a> (4th Edition, 2000), known in some circles as C: The Complete Nonsense.
es: Tenga cuidado con los libros escritos por <a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">Herbert Schildt</a> . En particular, debe mantenerse alejado de <a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">C: The Complete Reference</a> (4th Edition, 2000), conocido en algunos c&iacute;rculos como C: The Complete Nonsense.
ja: <a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">ハーバート・シルトが</a>書いた本に注意してください。 特に、 <a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">C：The Complete Reference</a> （4th Edition、2000）から離れてください。これは、一部のサークルではC：The Complete Nonsenseとして知られています。
ko: <a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">Herbert Schildt가</a> 쓴 책에주의하십시오. 특히 C : The Complete Nonsense라고하는 일부 서클에서는 C : The Complete <a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">Reference</a> (2000 년 4 판)에서 멀리 떨어져 있어야합니다.
ru: Остерегайтесь книг, написанных <a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">Гербертом Шильдтом</a> . В частности, вам следует держаться подальше от <a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">C: The Complete Reference</a> (4th Edition, 2000), известной в некоторых кругах как C: The Complete бессмыслица.
zh_cn: 警惕<a href="http://catb.org/~esr/jargon/html/B/bullschildt.html">希尔伯特&bull;希尔德</a> （ Herbert Schildt）写的书。 特别是，您应该远离<a href="https://rads.stackoverflow.com/amzn/click/com/0072121246">C：《完全参考》</a> （2000年第4版），在某些圈子中被称为C：《完全废话》。

source: C is a complex programming language that is difficult to pick up on-the-go by reading online tutorials. A comprehensive book is often the best way to learn the language, and finding a good book is the first step. It is important to avoid badly-written books, and even more importantly, books that contain serious technical errors.
es: El C es un lenguaje de programación complejo que es difícil de captar sobre la marcha leyendo tutoriales en línea.Un libro completo es a menudo la mejor manera de aprender el lenguaje,y encontrar un buen libro es el primer paso.Es importante evitar los libros mal escritos,y aún más importante,los libros que contienen graves errores técnicos.
ja: C言語は複雑なプログラミング言語で、外出先でオンラインチュートリアルを読んでもなかなか手に取ることができません。この言語を学ぶには、総合的な本を読むことが最善の方法であることが多く、良い本を見つけることが最初の一歩となります。書き味の悪い本は避け、さらに重要なのは、深刻な技術的エラーが含まれている本を避けることです。
ko: C는 온라인 자습서를 읽음으로써 이동이 어려운 복잡한 프로그래밍 언어입니다. 포괄적 인 책은 종종 언어를 배우는 가장 좋은 방법이며, 좋은 책을 찾는 것이 첫 번째 단계입니다. 잘못 작성된 서적, 그리고 더 중요한 것은 심각한 기술적 오류가있는 서적을 피하는 것이 중요합니다.
ru: C-это сложный язык программирования,который трудно подхватить на ходу,читая онлайн-уроки.Всеобъемлющая книга часто является лучшим способом изучения языка,а поиск хорошей книги-это первый шаг.Важно избегать плохо написанных книг и,что еще более важно,книг,содержащих серьезные технические ошибки.
zh_cn: C语言是一门复杂的编程语言,靠看网上的教程是很难入门的。全面的书籍往往是学习这门语言的最好方法,找到一本好书是第一步。重要的是要避免写得不好的书,更重要的是要避免写得不好的书,更重要的是要避免出现严重的技术错误的书。

source: Feel free to debate book choices, quality, headings, summaries, skill levels, and anything else you see that is wrong. Books that are deemed satisfactory by the C community here will stick around on the list; the rest will be regularly removed.
es: Siéntase libre de debatir las elecciones de libros,la calidad,los encabezados,los resúmenes,los niveles de habilidad y cualquier otra cosa que vea que esté mal.Los libros que la comunidad C considere satisfactorios aquí se quedarán en la lista;el resto se eliminarán regularmente.
ja: 本の選択、質、見出し、要約、スキルレベル、その他間違っていると思うことは何でも自由に議論してください。ここのCコミュニティが満足していると判断した本は、リストの中に残っています。
ko: 책 선택, 질, 제목, 요약, 기술 수준 및 기타 잘못된 점에 대해 자유롭게 토론하십시오. C 커뮤니티가 만족스럽게 여기는 책은 목록에 남을 것입니다. 나머지는 정기적으로 제거됩니다.
ru: Не стесняйтесь обсуждать выбор книги,качество,заголовки,резюме,уровень квалификации и все остальное,что вы видите,что это неправильно.Книги,которые сообщество C сочтет удовлетворительными здесь,останутся в списке,остальные будут регулярно удаляться.
zh_cn: 欢迎大家对书的选择、质量、标题、摘要、技巧水平以及其他任何你认为不对的地方进行辩论。在这里,C社认为满意的书会留在榜单上,其他的书会定期删除。

source: For books that have reviews by the Association of C and C++ Users (ACCU), a link to those reviews should be added along with the book.
es: Para los libros que tienen reseñas de la Asociación de Usuarios de C y C++(ACCU),se debe agregar un enlace a esas reseñas junto con el libro.
ja: Association of C and C++Users (ACCU)によるレビューがある書籍については、そのレビューへのリンクを書籍と一緒に追加してください。
ko: CCU 및 C ++ 사용자 협회 (ACCU)의 리뷰가있는 책의 경우 해당 검토에 대한 링크가 책과 함께 추가되어야합니다.
ru: Для книг,имеющих отзывы Ассоциации пользователей C и C++(ACCU),ссылка на эти отзывы должна быть добавлена вместе с книгой.
zh_cn: 对于有C和C++用户协会(ACCU)评论的书籍,应在书中附上这些评论的链接。

source: Other C-related resources in the <a href="/questions/tagged/c">c</a><a href="https://stackoverflow.com/tags/c/info">tag wiki</a>
es: Otros recursos relacionados con C en el <a href="https://stackoverflow.com/tags/c/info">wiki de etiqueta</a> <a href="/questions/tagged/c">c</a>
ja: <a href="/questions/tagged/c">c</a> <a href="https://stackoverflow.com/tags/c/info">タグwikiの</a>他のC関連リソース
ko: <a href="/questions/tagged/c">c</a> <a href="https://stackoverflow.com/tags/c/info">태그 위키</a> 의 다른 C 관련 리소스
ru: Другие связанные с C ресурсы в <a href="https://stackoverflow.com/tags/c/info">вики-теге</a> <a href="/questions/tagged/c">c</a>
zh_cn: <a href="/questions/tagged/c">c</a> <a href="https://stackoverflow.com/tags/c/info">标签Wiki</a>中的其他与C相关的资源

source: Please suggest edits to the accepted answer to add quality books, with an approximate skill level and a short blurb/description about each book. (<em>Note that the question is locked, so no new answers will be accepted. A single answer is being maintained with the list</em>)
es: Sugiera modificaciones a la respuesta aceptada para agregar libros de calidad, con un nivel de habilidad aproximado y una breve descripci&oacute;n / descripci&oacute;n de cada libro. ( <em>Tenga en cuenta que la pregunta est&aacute; bloqueada, por lo que no se aceptar&aacute;n nuevas respuestas. Se mantiene una sola respuesta con la lista</em> )
ja: 承認された回答に編集を加えて、おおよそのスキルレベルと各本についての短い説明/説明を付けて、質の高い本を追加してください。 （ <em>質問はロックされているため、新しい回答は受け入れられないことに注意してください。単一の回答がリストで維持されています</em> ）
ko: 대략적인 기술 수준과 각 책에 대한 간략한 설명과 함께 양질의 책을 추가하려면 허용 된 답변의 수정 사항을 제안하십시오. ( <em>질문은 잠겨 있으므로 새 답변은 수락되지 않습니다. 단일 답변은 목록과 함께 유지됩니다.</em> )
ru: Пожалуйста, предложите внести изменения в принятый ответ, чтобы добавить качественные книги, с приблизительным уровнем квалификации и кратким описанием / описанием каждой книги. ( <em>Обратите внимание, что вопрос заблокирован, поэтому новые ответы не будут приняты. В списке сохраняется один ответ</em> )
zh_cn: 请提出对已接受答案的修改建议，以添加高质量的书，并附上大致的技能水平，并简要介绍每本书。 （ <em>请注意，该问题已锁定，因此不会接受新的答案。列表中仅保留一个答案</em> ）

source: Reference (All Levels)
es: Referencia (Todos los niveles)
ja: リファレンス(全レベル
ko: 참조 (모든 레벨)
ru: Ссылка (все уровни)
zh_cn: 参考资料(所有级别)

source: See also:
es: Ver también:
ja: も参照してください。
ko: 또한보십시오:
ru: См.также:
zh_cn: 也见。

source: The Definitive C Book Guide and List
es: La Guía y Lista de Libros C Definitivos
ja: 決定版Cブックガイドとリスト
ko: 결정적인 C 책 가이드 및 목록
ru: Определительный справочник и список книг на языке Си
zh_cn: 绝对的C语言书籍指南和列表

source: This question attempts to collect a community-maintained list of <strong><em>quality</em></strong> books on the <a href="/questions/tagged/c">c</a> programming language, targeted at various skill levels.
es: Esta pregunta intenta recopilar una lista mantenida por la comunidad de libros de <strong><em>calidad</em></strong> sobre el lenguaje de programaci&oacute;n <a href="/questions/tagged/c">c</a> , dirigida a varios niveles de habilidad.
ja: この質問は、さまざまなスキルレベルを対象とした、コミュニティが管理する<a href="/questions/tagged/c">C</a>プログラミング言語の<strong><em>質の高い</em></strong>本のリストを収集しようとしています。
ko: 이 질문은 다양한 기술 수준을 목표로하는 <a href="/questions/tagged/c">c</a> 프로그래밍 언어에 대한 커뮤니티 유지 <strong><em>품질</em></strong> 책 목록을 수집하려고합니다.
ru: Этот вопрос пытается собрать поддерживаемый сообществом список <strong><em>качественных</em></strong> книг на языке программирования <a href="/questions/tagged/c">c</a> , ориентированных на различные уровни квалификации.
zh_cn: 这个问题试图收集针对各种技能水平的社区维护的<a href="/questions/tagged/c">c</a>编程语言<strong><em>优质</em></strong>图书清单。
