Repository: rueisnom/feedback
Catalog: xlf/56/23/03/562303.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://www.amazon.com//dp/0133976890">C: How to Program (8th Edition)</a> - Paul Deitel and Harvey M. Deitel (2015). Lots of good tips and best practices for beginners. The index is very good and serves as a decent reference (just not fully comprehensive, and very shallow).
es: <a href="https://www.amazon.com//dp/0133976890">C: C&oacute;mo programar (8a edici&oacute;n)</a> - Paul Deitel y Harvey M. Deitel (2015). Muchos buenos consejos y mejores pr&aacute;cticas para principiantes. El &iacute;ndice es muy bueno y sirve como una referencia decente (solo que no es completamente completa y muy superficial).
ja: <a href="https://www.amazon.com//dp/0133976890">C：プログラミング方法（第8版）</a> -Paul DeitelおよびHarvey M. Deitel（2015）。 初心者のためのたくさんの良いヒントとベストプラクティス。 インデックスは非常に優れており、まともなリファレンスとして機能します（完全に包括的ではなく、非常に浅い）。
ko: <a href="https://www.amazon.com//dp/0133976890">C : 프로그래밍 방법 (제 8 판)</a> -Paul Deitel 및 Harvey M. Deitel (2015). 초보자를위한 많은 유용한 팁과 모범 사례. 지수는 매우 우수하고 적절한 기준으로 제공됩니다 (완전히 포괄적이지 않고 매우 얕음).
ru: <a href="https://www.amazon.com//dp/0133976890">C: Как программировать (8-е издание)</a> - Пол Дейтель и Харви М. Дейтель (2015). Много хороших советов и лучших практик для начинающих. Индекс очень хороший и служит достойной ссылкой (просто не полностью и очень поверхностно).
zh_cn: <a href="https://www.amazon.com//dp/0133976890">C：《如何编程》（第8版）</a> -Paul Deitel和Harvey M. Deitel（2015）。 为初学者提供了许多好的技巧和最佳实践。 该指数非常好，可以作为一个不错的参考（只是不够全面，而且很浅）。

source: <a href="https://www.apress.com/book/9781430248811">Beginning C (5th Edition)</a> - Ivor Horton (2013). Very good explanation of pointers, using lots of small but complete programs.
es: <a href="https://www.apress.com/book/9781430248811">Beginning C (5th Edition)</a> - Ivor Horton (2013). Muy buena explicaci&oacute;n de punteros, usando muchos programas peque&ntilde;os pero completos.
ja: <a href="https://www.apress.com/book/9781430248811">Beginning C（5th Edition）</a> -Ivor Horton（2013）。 小さいながらも完全なプログラムをたくさん使って、ポインタの非常に良い説明。
ko: <a href="https://www.apress.com/book/9781430248811">시작 C (제 5 판)</a> -아이보 호튼 (2013). 작지만 완전한 프로그램을 많이 사용하여 포인터에 대한 아주 좋은 설명.
ru: <a href="https://www.apress.com/book/9781430248811">Начало C (5-е издание)</a> - Айвор Хортон (2013). Очень хорошее объяснение указателей, использующих множество небольших, но полных программ.
zh_cn: <a href="https://www.apress.com/book/9781430248811">Beginning C（第5版）</a> -Ivor Horton（2013年）。 指针的很好的解释，使用了许多小而完整的程序。

source: <sub><strong>Other contributors</strong>, not necessarily credited in the revision history, include:<br/> <a href="https://stackoverflow.com/users/844882/alex-lockwood">Alex Lockwood</a>, <a href="https://stackoverflow.com/users/479989/ben-jackson">Ben Jackson</a>, <a href="https://stackoverflow.com/users/631423/bubbles">Bubbles</a>, <a href="https://stackoverflow.com/users/193653/claws">claws</a>, <a href="https://stackoverflow.com/users/14463/coledot">coledot</a>, <a href="https://stackoverflow.com/users/3161/dana-robinson">Dana Robinson</a>, <a href="https://stackoverflow.com/users/1322636/daniel-holden">Daniel Holden</a>, <a href="https://stackoverflow.com/users/50305/dervin-thunk">Dervin Thunk</a>, <a href="https://stackoverflow.com/users/57301/dwc">dwc</a>, <a href="https://stackoverflow.com/users/2226524/eric-hou">Erci Hou</a>, <a href="https://stackoverflow.com/users/102600/garen">Garen</a>, <a href="https://stackoverflow.com/users/714232/haziz">haziz</a>, <a href="https://stackoverflow.com/users/1029106/johan-bezem">Johan Bezem</a>, <a href="https://stackoverflow.com/users/15168/jonathan-leffler">Jonathan Leffler</a>, <a href="https://stackoverflow.com/users/141186/joshua-partogi">Joshua Partogi</a>, <a href="https://stackoverflow.com/users/74660/lucas">Lucas</a>, <a href="https://stackoverflow.com/users/584518/lundin">Lundin</a>, <a href="https://stackoverflow.com/users/52734/mattk">Matt K.</a>, <a href="https://stackoverflow.com/users/487623/mossplix">mossplix</a>, <a href="https://stackoverflow.com/users/147192/matthieu-m">Matthieu M.</a>, <a href="https://stackoverflow.com/users/3991400/midor">midor</a>, <a href="https://stackoverflow.com/users/39892/nietzche-jou">Nietzche-jou</a>, <a href="https://stackoverflow.com/users/41661/norman-ramsey">Norman Ramsey</a>, <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a>, <a href="https://stackoverflow.com/users/2395058/ridthyself">ridthyself</a>, <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Robert S. Barnes</a>, <a href="https://stackoverflow.com/users/3923896/steve-summit">Steve Summit</a>, <a href="https://stackoverflow.com/users/3685/tim-ring">Tim Ring</a>, <a href="https://stackoverflow.com/users/207003/tony-bai">Tony Bai</a>, <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a> </sub>
es: <sub><strong>Otros contribuyentes</strong> , no necesariamente acreditados en el historial de revisiones, incluyen:</sub> <sub><br/></sub> <sub><a href="https://stackoverflow.com/users/844882/alex-lockwood">Alex Lockwood</a> , <a href="https://stackoverflow.com/users/479989/ben-jackson">Ben Jackson</a> , <a href="https://stackoverflow.com/users/631423/bubbles">Bubbles</a> , <a href="https://stackoverflow.com/users/193653/claws">garras</a> , <a href="https://stackoverflow.com/users/14463/coledot">coledot</a> , <a href="https://stackoverflow.com/users/3161/dana-robinson">Dana Robinson</a> , <a href="https://stackoverflow.com/users/1322636/daniel-holden">Daniel Holden</a> , <a href="https://stackoverflow.com/users/50305/dervin-thunk">Dervin Thunk</a> , <a href="https://stackoverflow.com/users/57301/dwc">dwc</a> , <a href="https://stackoverflow.com/users/2226524/eric-hou">Erci Hou</a> , <a href="https://stackoverflow.com/users/102600/garen">Garen</a> , <a href="https://stackoverflow.com/users/714232/haziz">haziz</a> , <a href="https://stackoverflow.com/users/1029106/johan-bezem">Johan Bezem</a> , <a href="https://stackoverflow.com/users/15168/jonathan-leffler">Jonathan Leffler</a> , <a href="https://stackoverflow.com/users/141186/joshua-partogi">Joshua Partogi</a> , <a href="https://stackoverflow.com/users/74660/lucas">Lucas</a> , <a href="https://stackoverflow.com/users/584518/lundin">Lundin</a> , <a href="https://stackoverflow.com/users/52734/mattk">Matt K.</a> , <a href="https://stackoverflow.com/users/487623/mossplix">mossplix</a> , <a href="https://stackoverflow.com/users/147192/matthieu-m">Matthieu M.</a> , <a href="https://stackoverflow.com/users/3991400/midor">midor</a> , <a href="https://stackoverflow.com/users/39892/nietzche-jou">Nietzche-jou</a> , <a href="https://stackoverflow.com/users/41661/norman-ramsey">Norman Ramsey</a> , <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a> , <a href="https://stackoverflow.com/users/2395058/ridthyself">ridthyself</a> , <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Robert S. Barnes</a> , <a href="https://stackoverflow.com/users/3923896/steve-summit">Steve Summit</a> , <a href="https://stackoverflow.com/users/3685/tim-ring">Tim Ring</a> , <a href="https://stackoverflow.com/users/207003/tony-bai">Tony Bai</a> , <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a></sub>
ja: <sub>改訂履歴に必ずしも記載されていない<strong>他の貢献者</strong>には、次のものが含まれます。</sub> <sub><br/></sub> <sub><a href="https://stackoverflow.com/users/844882/alex-lockwood">アレックスロックウッド</a> 、 <a href="https://stackoverflow.com/users/479989/ben-jackson">ベンジャクソン</a> 、 <a href="https://stackoverflow.com/users/631423/bubbles">泡</a> 、 <a href="https://stackoverflow.com/users/193653/claws">爪</a> 、 <a href="https://stackoverflow.com/users/14463/coledot">コレド</a> 、 <a href="https://stackoverflow.com/users/3161/dana-robinson">ダナロビンソン</a> 、 <a href="https://stackoverflow.com/users/1322636/daniel-holden">ダニエルホールデン</a> 、 <a href="https://stackoverflow.com/users/57301/dwc">ダービン</a> <a href="https://stackoverflow.com/users/50305/dervin-thunk">サンク</a> 、 dwc 、 <a href="https://stackoverflow.com/users/2226524/eric-hou">エルシーホウ</a> 、 <a href="https://stackoverflow.com/users/102600/garen">ガレン</a> 、 <a href="https://stackoverflow.com/users/714232/haziz">ハジズ</a> 、 <a href="https://stackoverflow.com/users/1029106/johan-bezem">ヨハンベゼム</a> 、 <a href="https://stackoverflow.com/users/15168/jonathan-leffler">ジョナサンレフラー</a> 、 <a href="https://stackoverflow.com/users/141186/joshua-partogi">ジョシュアパルトギ</a> 、 <a href="https://stackoverflow.com/users/74660/lucas">ルーカス</a> <a href="https://stackoverflow.com/users/52734/mattk">マット</a> 、 <a href="https://stackoverflow.com/users/487623/mossplix">ルダン</a> 、 マットキンス <a href="https://stackoverflow.com/users/147192/matthieu-m">M</a> 、 <a href="https://stackoverflow.com/users/3991400/midor">midor</a> 、 <a href="https://stackoverflow.com/users/39892/nietzche-jou">Nietzche-jou</a> 、 <a href="https://stackoverflow.com/users/41661/norman-ramsey">Norman Ramsey</a> 、 <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a> 、 <a href="https://stackoverflow.com/users/2395058/ridthyself">ridthyself</a> 、 <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Robert S. Barnes</a> 、 <a href="https://stackoverflow.com/users/3923896/steve-summit">Steve Summit</a> 、 <a href="https://stackoverflow.com/users/3685/tim-ring">Tim Ring</a> 、 <a href="https://stackoverflow.com/users/207003/tony-bai">Tony Bai</a> 、 <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a></sub>
ko: <sub>개정 내역에 반드시 포함되지 않은 <strong>다른 제공자</strong> 는 다음과 같습니다.</sub> <sub><br/></sub> <sub><a href="https://stackoverflow.com/users/844882/alex-lockwood">Alex Lockwood</a> , <a href="https://stackoverflow.com/users/479989/ben-jackson">Ben Jackson</a> , <a href="https://stackoverflow.com/users/631423/bubbles">거품</a> , <a href="https://stackoverflow.com/users/193653/claws">발톱</a> , <a href="https://stackoverflow.com/users/14463/coledot">coledot</a> , <a href="https://stackoverflow.com/users/3161/dana-robinson">Dana Robinson</a> , <a href="https://stackoverflow.com/users/1322636/daniel-holden">Daniel Holden</a> , <a href="https://stackoverflow.com/users/50305/dervin-thunk">Dervin</a> <a href="https://stackoverflow.com/users/57301/dwc">Thunk</a> , <a href="https://stackoverflow.com/users/2226524/eric-hou">dwc</a> , Erci Hou , <a href="https://stackoverflow.com/users/102600/garen">Garen</a> , <a href="https://stackoverflow.com/users/714232/haziz">haziz</a> , <a href="https://stackoverflow.com/users/1029106/johan-bezem">Johan Bezem</a> , <a href="https://stackoverflow.com/users/15168/jonathan-leffler">Jonathan Leffler</a> , <a href="https://stackoverflow.com/users/141186/joshua-partogi">Joshua Partogi</a> , <a href="https://stackoverflow.com/users/74660/lucas">Lucas</a> , <a href="https://stackoverflow.com/users/584518/lundin">Lundin</a> , <a href="https://stackoverflow.com/users/52734/mattk">Matt K.</a> , <a href="https://stackoverflow.com/users/487623/mossplix">moshie</a> <a href="https://stackoverflow.com/users/147192/matthieu-m">M.</a> , <a href="https://stackoverflow.com/users/3991400/midor">midor</a> , Nietzche <a href="https://stackoverflow.com/users/39892/nietzche-jou">-jou</a> , <a href="https://stackoverflow.com/users/41661/norman-ramsey">Norman Ramsey</a> , <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a> , <a href="https://stackoverflow.com/users/2395058/ridthyself">ridthyself</a> , <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Robert S. Barnes</a> , <a href="https://stackoverflow.com/users/3923896/steve-summit">Steve Summit</a> , <a href="https://stackoverflow.com/users/3685/tim-ring">Tim Ring</a> , <a href="https://stackoverflow.com/users/207003/tony-bai">Tony Bai</a> , <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a></sub>
ru: <sub><strong>Другие участники</strong> , не обязательно отмеченные в истории изменений, включают:</sub> <sub><br/></sub> <sub><a href="https://stackoverflow.com/users/844882/alex-lockwood">Алекс Локвуд</a> , <a href="https://stackoverflow.com/users/479989/ben-jackson">Бен Джексон</a> , <a href="https://stackoverflow.com/users/631423/bubbles">Пузыри</a> , <a href="https://stackoverflow.com/users/193653/claws">Когти</a> , <a href="https://stackoverflow.com/users/14463/coledot">Коледот</a> , <a href="https://stackoverflow.com/users/3161/dana-robinson">Дана Робинсон</a> , <a href="https://stackoverflow.com/users/1322636/daniel-holden">Даниэль Холден</a> , <a href="https://stackoverflow.com/users/50305/dervin-thunk">Дервин Тунк</a> , <a href="https://stackoverflow.com/users/57301/dwc">DWC</a> , <a href="https://stackoverflow.com/users/2226524/eric-hou">Эрчи Хоу</a> , <a href="https://stackoverflow.com/users/102600/garen">Гарен</a> , <a href="https://stackoverflow.com/users/714232/haziz">Хазиз</a> , <a href="https://stackoverflow.com/users/1029106/johan-bezem">Йохан Безем</a> , <a href="https://stackoverflow.com/users/15168/jonathan-leffler">Джонатан Леффлер</a> , <a href="https://stackoverflow.com/users/141186/joshua-partogi">Джошуа Партоги</a> , <a href="https://stackoverflow.com/users/74660/lucas">Лукас</a> , <a href="https://stackoverflow.com/users/584518/lundin">Лундин</a> , <a href="https://stackoverflow.com/users/52734/mattk">Мэтт К.</a> , <a href="https://stackoverflow.com/users/487623/mossplix">Мосспликс</a> , <a href="https://stackoverflow.com/users/147192/matthieu-m">Матье М.</a> , <a href="https://stackoverflow.com/users/3991400/midor">Мидор</a> , <a href="https://stackoverflow.com/users/39892/nietzche-jou">Ницше-Жу</a> , <a href="https://stackoverflow.com/users/41661/norman-ramsey">Норман Рэмси</a> , <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a> , <a href="https://stackoverflow.com/users/2395058/ridthyself">Риттхейф</a> , <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Роберт С. Барнс</a> , <a href="https://stackoverflow.com/users/3923896/steve-summit">Стив Саммит</a> , <a href="https://stackoverflow.com/users/3685/tim-ring">Тим Ринг</a> , <a href="https://stackoverflow.com/users/207003/tony-bai">Тони Бай</a> , <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a></sub>
zh_cn: <sub><strong>其他贡献者</strong> （不一定要记入修订历史）包括：</sub> <sub><br/></sub> <sub><a href="https://stackoverflow.com/users/844882/alex-lockwood">亚历克斯&middot;洛克伍德</a> （ Alex Lockwood） ， <a href="https://stackoverflow.com/users/479989/ben-jackson">本&middot;杰克逊</a> （ Ben Jackson） ， <a href="https://stackoverflow.com/users/631423/bubbles">泡泡</a> ， <a href="https://stackoverflow.com/users/193653/claws">爪子</a> ， <a href="https://stackoverflow.com/users/14463/coledot">凉拌卷心菜</a> ， <a href="https://stackoverflow.com/users/3161/dana-robinson">达娜&middot;罗宾逊</a> ， <a href="https://stackoverflow.com/users/1322636/daniel-holden">丹尼尔&middot;霍尔顿</a> ， <a href="https://stackoverflow.com/users/57301/dwc">德文&middot;唐克</a> ， <a href="https://stackoverflow.com/users/714232/haziz">dwc</a> ， <a href="https://stackoverflow.com/users/1029106/johan-bezem">埃尔西</a> <a href="https://stackoverflow.com/users/15168/jonathan-leffler">&middot;</a> <a href="https://stackoverflow.com/users/2226524/eric-hou">侯</a> ， <a href="https://stackoverflow.com/users/102600/garen">加伦</a> ， 哈兹兹 ， 约翰&middot;贝泽姆 ， 乔纳森&middot;莱夫勒 ， <a href="https://stackoverflow.com/users/141186/joshua-partogi">约书亚&middot;帕托吉</a> ， <a href="https://stackoverflow.com/users/74660/lucas">卢卡斯</a> ， <a href="https://stackoverflow.com/users/584518/lundin">伦丁</a> ， <a href="https://stackoverflow.com/users/52734/mattk">马特&middot;K&middot;</a> <a href="https://stackoverflow.com/users/487623/mossplix">莫斯皮克斯</a> ， <a href="https://stackoverflow.com/users/147192/matthieu-m">马蒂厄M.</a> ， <a href="https://stackoverflow.com/users/3991400/midor">midor</a> ， <a href="https://stackoverflow.com/users/39892/nietzche-jou">Nietzche-jou</a> ， <a href="https://stackoverflow.com/users/41661/norman-ramsey">Norman Ramsey</a> ， <a href="https://stackoverflow.com/users/416623/r3st0r3">r3st0r3</a> ， <a href="https://stackoverflow.com/users/2395058/ridthyself">ridthyself</a> ， <a href="https://stackoverflow.com/users/71074/robert-s-barnes">Robert</a> S.Barnes ， <a href="https://stackoverflow.com/users/3923896/steve-summit">Steve Summit</a> ， <a href="https://stackoverflow.com/users/3685/tim-ring">Tim Ring</a> ， <a href="https://stackoverflow.com/users/207003/tony-bai">Tony Bai</a> ， <a href="https://stackoverflow.com/users/213550/vmatm">VMAtm</a></sub>

source: <sub>This question was discussed on <a href="https://meta.stackoverflow.com/a/378475">Meta</a> as part of the <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">Deleted Questions Audit 2018</a>.<br/>The consensus was to keep it undeleted and actively maintained.</sub>
es: <sub>Esta pregunta se discuti&oacute; en <a href="https://meta.stackoverflow.com/a/378475">Meta</a> como parte de la <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">Auditor&iacute;a de preguntas eliminadas 2018</a> .</sub> <sub><br/></sub> <sub>El consenso fue mantenerlo intacto y mantenido activamente.</sub>
ja: <sub>この質問は、 <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">削除された質問の監査2018の</a>一部として<a href="https://meta.stackoverflow.com/a/378475">メタ</a>で議論されました。</sub> <sub><br/></sub> <sub>コンセンサスは、削除せずに積極的に維持することでした。</sub>
ko: <sub>이 질문은 <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">2018 년 삭제 된 질문 감사의</a> 일부로 <a href="https://meta.stackoverflow.com/a/378475">메타</a> 에 대해 논의되었습니다.</sub> <sub><br/></sub> <sub>합의는 삭제되지 않고 적극적으로 유지되는 것이 었습니다.</sub>
ru: <sub>Этот вопрос обсуждался на <a href="https://meta.stackoverflow.com/a/378475">Meta</a> в рамках <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">аудита удаленных вопросов 2018 года</a> .</sub> <sub><br/></sub> <sub>Консенсус состоял в том, чтобы сохранить его и активно поддерживать.</sub>
zh_cn: <sub>该问题已在<a href="https://meta.stackoverflow.com/a/378475">Meta</a>上进行了讨论，作为<a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">2018年已删除问题审核的</a>一部分。</sub> <sub><br/></sub> <sub>共识是不删除它并积极维护它。</sub>

source: <sup> This is a list of random books of diverse quality. In the view of some people (with some justification), it is no longer a list of recommended books. Some of the listed books contain blatantly incorrect statements or teach wrong/harmful practices. People who are aware of such books can edit this answer to help improve it. See <a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">The C book list has gone haywire. What to do with it?</a>, and also <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">Deleted question audit 2018</a>. </sup>
es: <sup>Esta es una lista de libros aleatorios de diversa calidad.</sup> <sup>En opini&oacute;n de algunas personas (con alguna justificaci&oacute;n), ya no es una lista de libros recomendados.</sup> <sup>Algunos de los libros enumerados contienen declaraciones descaradamente incorrectas o ense&ntilde;an pr&aacute;cticas incorrectas / da&ntilde;inas.</sup> <sup>Las personas que conocen estos libros pueden editar esta respuesta para ayudar a mejorarla.</sup> <sup>Ver <a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">La lista de libros C se ha vuelto loca.</a></sup> <sup>&iquest;Qu&eacute; hacer con ello?</sup> <sup>, y tambi&eacute;n <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">Auditor&iacute;a de preguntas eliminadas 2018</a> .</sup>
ja: <sup>これは、多様な品質のランダムな本のリストです。</sup> <sup>一部の人々の見解（正当化あり）では、推奨される書籍のリストではなくなりました。</sup> <sup>掲載されている書籍の一部には、露骨に不正確な記述が含まれているか、誤った/有害な慣行が含まれています。</sup> <sup>このような本を知っている人は、この回答を編集して改善することができます。</sup> <sup><a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">Cの本のリストが大騒ぎになっているのを</a>見てください。</sup> <sup>どうする？</sup> <sup>、および<a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">削除された質問監査2018</a> 。</sup>
ko: <sup>이것은 다양한 품질의 무작위 도서 목록입니다.</sup> <sup>일부 사람들의 견해 (일부 타당 함)는 더 이상 권장 도서 목록이 아닙니다.</sup> <sup>열거 된 책들 중 일부는 엄청나게 잘못된 진술을 포함하거나 잘못되거나 유해한 관행을 가르치고 있습니다.</sup> <sup>그러한 책을 알고있는 사람들은이 답변을 편집하여 개선 할 수 있습니다.</sup> <sup><a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">C 책 목록이 사라졌습니다.를</a> 참조하십시오 .</sup> <sup>그것으로 무엇을해야합니까?</sup> <sup>, 또한 <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">삭제 된 질문 감사 2018</a> .</sup>
ru: <sup>Это список случайных книг разного качества.</sup> <sup>По мнению некоторых людей (с некоторым обоснованием), это больше не список рекомендуемых книг.</sup> <sup>Некоторые из перечисленных книг содержат явно неверные утверждения или учат неправильным / вредным практикам.</sup> <sup>Люди, которые знают о таких книгах, могут редактировать этот ответ, чтобы улучшить его.</sup> <sup>См <a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">. Список книг C потерял свою актуальность.</a></sup> <sup>Что с этим делать?</sup> <sup>, а также <a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">удаленный вопрос аудита 2018 года</a> .</sup>
zh_cn: <sup>这是质量各异的随机书籍的清单。</sup> <sup>在某些人看来（有理由），它不再是推荐书籍的列表。</sup> <sup>其中一些列出的书包含明显不正确的陈述或教导错误/有害的做法。</sup> <sup>了解此类书籍的人可以编辑此答案以帮助改进它。</sup> <sup>请参阅<a href="https://meta.stackoverflow.com/questions/355588/the-c-book-list-has-gone-haywire-what-to-do-with-it">C书籍清单。</a></sup> <sup>怎么办呢？</sup> <sup>，还<a href="https://meta.stackoverflow.com/questions/378437/deleted-question-audit-2018">删除了问题审核2018</a> 。</sup>
