Repository: rueisnom/feedback
Catalog: xlf/56/23/03/562303.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: "Learn C The Hard Way" is not a book that I could recommend to someone who is both learning to program and learning C. If you're already a competent programmer in some other related language, then it represents an interesting and unusual exposition on C, though I have reservations about parts of the book. <sub><em>Jonathan Leffler</em></sub>
es: "Learn C The Hard Way" no es un libro que podr&iacute;a recomendar a alguien que est&aacute; aprendiendo a programar y aprendiendo C. Si ya eres un programador competente en alg&uacute;n otro idioma relacionado, entonces representa una exposici&oacute;n interesante e inusual sobre C, aunque tengo reservas sobre partes del libro. <sub><em>Jonathan Leffler</em></sub>
ja: 「Learn C The Hard Way」は、プログラムの学習とCの学習の両方をしている人にお勧めできる本ではありません。すでに他の関連言語の有能なプログラマーである場合、それは興味深い珍しい説明です。 C、本の一部について予約があります。 <sub><em>ジョナサン・レフラー</em></sub>
ko: "Learn C The Hard Way"는 C를 배우고 배우는 사람에게 추천 할 수있는 책이 아닙니다. 이미 다른 관련 언어로 유능한 프로그래머라면이 책은 흥미롭고 특이한 설명을 나타냅니다. C, 책의 일부에 대한 예약이 있지만. <sub><em>조나단 레 플리 어</em></sub>
ru: "Learn C The Hard Way" - это не книга, которую я мог бы порекомендовать кому-то, кто одновременно учится программировать и изучает C. Если вы уже являетесь компетентным программистом на каком-либо другом родственном языке, то это интересная и необычная экспозиция С, хотя у меня есть оговорки по поводу частей книги. <sub><em>Джонатан Леффлер</em></sub>
zh_cn: &ldquo;我很难向那些学习编程和学习C的人推荐这本书&rdquo;。如果您已经是其他一些相关语言的熟练程序员，那么它代表了关于C，尽管我对本书的某些部分有所保留。 <sub><em>乔纳森&middot;莱夫勒</em></sub>

source: <a href="http://c-faq.com/">The comp.lang.c FAQ</a> - Steve Summit. Web site with answers to many questions about C.
es: <a href="http://c-faq.com/">Las preguntas frecuentes de comp.lang.c</a> - Steve Summit. Sitio web con respuestas a muchas preguntas sobre C.
ja: <a href="http://c-faq.com/">comp.lang.c FAQ</a> -Steve Summit。 Cに関する多くの質問への回答があるWebサイト。
ko: <a href="http://c-faq.com/">comp.lang.c FAQ</a> -Steve Summit. C에 대한 많은 질문에 대한 답변이있는 웹 사이트
ru: <a href="http://c-faq.com/">Comp.lang.c FAQ</a> - Стив Саммит. Веб-сайт с ответами на многие вопросы о C.
zh_cn: <a href="http://c-faq.com/">comp.lang.c常见问题-Steve</a> Summit。 该网站提供有关C的许多问题的答案。

source: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">Essential C</a> (Free PDF) - Nick Parlante (2003). Note that this describes the C90 language at several points (<em>e.g.</em>, in discussing <code>//</code> comments and placement of variable declarations at arbitrary points in the code), so it should be treated with some caution.
es: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">Essential C</a> (PDF gratuito) - Nick Parlante (2003). Tenga en cuenta que esto describe el lenguaje C90 en varios puntos ( <em>por ejemplo</em> , al discutir <code>//</code> comentarios y ubicaci&oacute;n de declaraciones de variables en puntos arbitrarios en el c&oacute;digo), por lo que debe tratarse con cierta precauci&oacute;n.
ja: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">Essential C</a> （無料PDF）-Nick Parlante（2003）。 これはC90言語をいくつかの点で説明していることに注意してください（ <em>たとえば</em> 、コメント内での <code>//</code> コメントおよび変数宣言のコード内の配置に関する説明）。このため、注意が必要です。
ko: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">필수 C</a> (무료 PDF)-Nick Parlante (2003). 이것은 C90 언어를 여러 지점에서 설명합니다 ( <em>예 :</em> <code>//</code> 주석 및 코드의 임의 지점에서 변수 선언 배치에 대해 논의 할 때). 따라서 조심스럽게 다루어야합니다.
ru: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">Essential C</a> (бесплатный PDF) - Ник Парланте (2003). Обратите внимание, что это описывает язык C90 в нескольких точках ( <em>например</em> , при обсуждении <code>//</code> комментариев и размещении объявлений переменных в произвольных точках в коде), поэтому к нему следует относиться с некоторой осторожностью.
zh_cn: <a href="http://cslibrary.stanford.edu/101/EssentialC.pdf">Essential C</a> （免费PDF）-Nick Parlante（2003）。 请注意，这在多个方面描述了C90语言（ <em>例如</em> ，在讨论 <code>//</code> 注释和将变量声明放置在代码中的任意点时），因此应谨慎对待。

source: <a href="http://knking.com/books/c2/index.html">C Programming: A Modern Approach (2nd Edition)</a> - K. N. King (2008). A good book for learning C.
es: <a href="http://knking.com/books/c2/index.html">Programaci&oacute;n en C: un enfoque moderno (2a edici&oacute;n)</a> - KN King (2008). Un buen libro para aprender C.
ja: <a href="http://knking.com/books/c2/index.html">Cプログラミング：モダンアプローチ（第2版）</a> -KNキング（2008）。 Cを学ぶための良い本
ko: <a href="http://knking.com/books/c2/index.html">C 프로그래밍 : 현대적인 접근 방식 (제 2 판)</a> -KN King (2008). 배우기에 좋은 책 C.
ru: <a href="http://knking.com/books/c2/index.html">Программирование на C: современный подход (2-е издание)</a> - KN King (2008). Хорошая книга для изучения C.
zh_cn: <a href="http://knking.com/books/c2/index.html">C编程：一种现代方法（第二版）</a> -KN King（2008）。 一本学习C的好书。

source: <a href="http://publications.gbdirect.co.uk/c_book/">The C Book</a> (Free Online) - Mike Banahan, Declan Brady, and Mark Doran (1991).
es: <a href="http://publications.gbdirect.co.uk/c_book/">The C Book</a> (Gratis en l&iacute;nea) - Mike Banahan, Declan Brady y Mark Doran (1991).
ja: <a href="http://publications.gbdirect.co.uk/c_book/">Cブック</a> （無料オンライン）-マイクバナハン、デクランブレイディ、マークドラン（1991）。
ko: <a href="http://publications.gbdirect.co.uk/c_book/">The C Book</a> (무료 온라인)-Mike Banahan, Declan Brady 및 Mark Doran (1991).
ru: <a href="http://publications.gbdirect.co.uk/c_book/">The C Book</a> (Free Online) - Майк Банахан, Деклан Брейди и Марк Доран (1991).
zh_cn: <a href="http://publications.gbdirect.co.uk/c_book/">C书</a> （免费在线）-Mike Banahan，Declan Brady和Mark Doran（1991）。

source: <a href="http://www.apress.com/9781430259114">Pointers in C</a> - Naveen Toppo and Hrishikesh Dewan (2013).
es: <a href="http://www.apress.com/9781430259114">Punteros en C</a> - Naveen Toppo y Hrishikesh Dewan (2013).
ja: <a href="http://www.apress.com/9781430259114">Cのポインター</a> -Naveen ToppoおよびHrishikesh Dewan（2013）。
ko: <a href="http://www.apress.com/9781430259114">C</a> -Naveen Toppo와 Hrishikesh Dewan의 포인터 (2013).
ru: <a href="http://www.apress.com/9781430259114">Указатели на Си</a> - Навин Топпо и Хришикеш Деван (2013).
zh_cn: <a href="http://www.apress.com/9781430259114">C语言中的指针</a> -Naveen Toppo和Hrishikesh Dewan（2013）。

source: <a href="http://www.buildyourownlisp.com/">Build Your Own Lisp</a> &mdash; Daniel Holden (2014). An enjoyable way to learn C.
es: <a href="http://www.buildyourownlisp.com/">Crea tu propia lista</a> - Daniel Holden (2014). Una forma divertida de aprender C.
ja: <a href="http://www.buildyourownlisp.com/">独自のLispを構築する</a> &mdash; Daniel Holden（2014）。 Cを学ぶ楽しい方法
ko: <a href="http://www.buildyourownlisp.com/">자신 만의 리스프 만들기</a> &mdash; Daniel Holden (2014). C를 배우는 즐거운 방법
ru: <a href="http://www.buildyourownlisp.com/">Создай свой собственный Лисп</a> - Даниэль Холден (2014). Приятный способ выучить C.
zh_cn: <a href="http://www.buildyourownlisp.com/">建立自己的Lisp</a> -Daniel Holden（2014）。 一种学习C语言的有趣方式。

source: <a href="http://www.cs.princeton.edu/software/cii/">C Interfaces and Implementations</a> - David R. Hanson (1997). Provides information on how to define a boundary between an interface and implementation in C in a generic and reusable fashion. It also demonstrates this principle by applying it to the implementation of common mechanisms and data structures in C, such as lists, sets, exceptions, string manipulation, memory allocators, and more. Basically, Hanson took all the code he'd written as part of building <a href="http://www.cs.arizona.edu/icon">Icon</a> and <a href="http://www.cs.princeton.edu/software/lcc/">lcc</a> and pulled out the best bits in a form that other people could reuse for their own projects. It's a model of good C programming using modern design techniques (including Liskov's data abstraction), showing how to organize a big C project as a bunch of useful libraries.
es: <a href="http://www.cs.princeton.edu/software/cii/">C Interfaces e implementaciones</a> - David R. Hanson (1997). Proporciona informaci&oacute;n sobre c&oacute;mo definir un l&iacute;mite entre una interfaz y la implementaci&oacute;n en C de forma gen&eacute;rica y reutilizable. Tambi&eacute;n demuestra este principio al aplicarlo a la implementaci&oacute;n de mecanismos comunes y estructuras de datos en C, como listas, conjuntos, excepciones, manipulaci&oacute;n de cadenas, asignadores de memoria y m&aacute;s. B&aacute;sicamente, Hanson tom&oacute; todo el c&oacute;digo que hab&iacute;a escrito como parte de la construcci&oacute;n de <a href="http://www.cs.arizona.edu/icon">Icon</a> y <a href="http://www.cs.princeton.edu/software/lcc/">lcc</a> y sac&oacute; los mejores fragmentos en una forma que otras personas podr&iacute;an reutilizar para sus propios proyectos. Es un modelo de buena programaci&oacute;n en C que utiliza t&eacute;cnicas de dise&ntilde;o modernas (incluida la abstracci&oacute;n de datos de Liskov), que muestra c&oacute;mo organizar un gran proyecto en C como un conjunto de bibliotecas &uacute;tiles.
ja: <a href="http://www.cs.princeton.edu/software/cii/">Cインターフェイスと実装</a> -David R. Hanson（1997）。 一般的な再利用可能な方法でCのインターフェイスと実装の間の境界を定義する方法に関する情報を提供します。 また、リスト、セット、例外、文字列操作、メモリアロケータなど、Cの一般的なメカニズムとデータ構造の実装に適用することで、この原則を示しています。 基本的に、Hansonは、 <a href="http://www.cs.arizona.edu/icon">Icon</a>と<a href="http://www.cs.princeton.edu/software/lcc/">lccのビルドの</a>一部として作成したすべてのコードを取り、他の人が自分のプロジェクトに再利用できる形で最高のビットを引き出しました。 これは、モダンな設計手法（リスコフのデータ抽象化を含む）を使用した優れたCプログラミングのモデルであり、大きなCプロジェクトを一連の便利なライブラリとして編成する方法を示しています。
ko: <a href="http://www.cs.princeton.edu/software/cii/">C 인터페이스와 구현</a> &ndash; David R. Hanson (1997). C에서 인터페이스와 구현 사이의 경계를 일반적이고 재사용 가능한 방식으로 정의하는 방법에 대한 정보를 제공합니다. 또한 목록, 집합, 예외, 문자열 조작, 메모리 할당 자 등과 같은 일반적인 메커니즘과 C의 데이터 구조 구현에 적용하여이 원리를 보여줍니다. 기본적으로 Hanson은 <a href="http://www.cs.arizona.edu/icon">Icon</a> 및 <a href="http://www.cs.princeton.edu/software/lcc/">lcc</a> 빌드의 일부로 작성한 모든 코드를 가져 와서 다른 사람들이 자신의 프로젝트에 재사용 할 수있는 형태로 최고의 비트를 가져 왔습니다. 현대적인 디자인 기술 (Liskov의 데이터 추상화 포함)을 사용하여 유용한 C 프로그래밍 모델로, 큰 C 프로젝트를 유용한 라이브러리로 구성하는 방법을 보여줍니다.
ru: <a href="http://www.cs.princeton.edu/software/cii/">Интерфейсы и реализации C</a> - Дэвид Р. Хэнсон (1997). Предоставляет информацию о том, как определить границу между интерфейсом и реализацией в C общим и многократно используемым способом. Он также демонстрирует этот принцип, применяя его к реализации общих механизмов и структур данных в C, таких как списки, наборы, исключения, манипуляции со строками, распределители памяти и многое другое. По сути, Хансон взял весь код, который он написал как часть создания <a href="http://www.cs.arizona.edu/icon">Icon</a> и <a href="http://www.cs.princeton.edu/software/lcc/">lcc,</a> и вытащил лучшие биты в форме, которую другие люди могли бы использовать для своих собственных проектов. Это модель хорошего C-программирования с использованием современных методов проектирования (включая абстракцию данных Лискова), показывающая, как организовать большой C-проект в виде набора полезных библиотек.
zh_cn: <a href="http://www.cs.princeton.edu/software/cii/">C接口和实现</a> -David R. Hanson（1997）。 提供有关如何以通用且可重用的方式在C中定义接口和实现之间的边界的信息。 它还通过将其应用于C中的常见机制和数据结构（例如列表，集合，异常，字符串操作，内存分配器等）的实现来证明该原理。 基本上，Hanson接受了他在构建<a href="http://www.cs.arizona.edu/icon">Icon</a>和<a href="http://www.cs.princeton.edu/software/lcc/">lcc中</a>编写的所有代码，并以其他人可以重用于自己的项目的形式提取了最好的代码。 它是使用现代设计技术（包括Liskov的数据抽象）进行良好C编程的模型，展示了如何将大型C项目组织为一堆有用的库。

source: <a href="http://www.knosof.co.uk/cbook/cbook.html">The new C standard - an annotated reference</a> (Free PDF) - Derek M. Jones (2009). The "new standard" referred to is the old C99 standard rather than C11.
es: <a href="http://www.knosof.co.uk/cbook/cbook.html">El nuevo est&aacute;ndar C - una referencia anotada</a> (PDF gratuito) - Derek M. Jones (2009). El "nuevo est&aacute;ndar" al que se hace referencia es el antiguo est&aacute;ndar C99 en lugar del C11.
ja: <a href="http://www.knosof.co.uk/cbook/cbook.html">新しいC標準-注釈付き参照</a> （無料PDF）-Derek M. Jones（2009）。 参照される「新しい標準」は、C11ではなく古いC99標準です。
ko: <a href="http://www.knosof.co.uk/cbook/cbook.html">새로운 C 표준-주석이 달린 참조</a> (무료 PDF)-Derek M. Jones (2009). "새로운 표준"은 C11이 아닌 이전 C99 표준입니다.
ru: <a href="http://www.knosof.co.uk/cbook/cbook.html">Новый стандарт С - аннотированная ссылка</a> (Free PDF) - Дерек М. Джонс (2009). Упоминаемый &laquo;новый стандарт&raquo; - это старый стандарт C99, а не C11.
zh_cn: <a href="http://www.knosof.co.uk/cbook/cbook.html">新的C标准-带有注释的参考</a> （Free PDF）-Derek M. Jones（2009）。 所指的&ldquo;新标准&rdquo;是旧的C99标准，而不是C11。

source: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C</a> - industry standard published and maintained by the Motor Industry Software Reliability Association. Covers C89 and C99.
es: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C</a> : est&aacute;ndar de la industria publicado y mantenido por la Motor Industry Software Reliability Association. Cubiertas C89 y C99.
ja: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C-</a>自動車産業ソフトウェア信頼性協会によって発行および維持されている業界標準。 C89およびC99をカバーしています。
ko: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C-</a> 자동차 산업 소프트웨어 신뢰성 협회에서 발행하고 유지하는 업계 표준. C89와 C99를 다룹니다.
ru: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C</a> - отраслевой стандарт, публикуемый и поддерживаемый Ассоциацией по надежности программного обеспечения автомобильной промышленности. Обложки С89 и С99.
zh_cn: <a href="http://www.misra-c.com/Activities/MISRAC/tabid/160/Default.aspx">MISRA-C-</a>由汽车工业软件可靠性协会发布和维护的工业标准。 涵盖了C89和C99。

source: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">Rationale for C99 Standard</a>.
es: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">Justificaci&oacute;n de la norma C99</a> .
ja: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">C99標準の根拠</a> 。
ko: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">C99 표준의 이론적 근거</a> .
ru: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">Обоснование стандарта C99</a> .
zh_cn: <a href="http://www.open-std.org/JTC1/SC22/WG14/www/C99RationaleV5.10.pdf">C99标准的依据</a> 。

source: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">Object-oriented Programming with ANSI-C</a> (Free PDF) - Axel-Tobias Schreiner (1993). The code gets a bit convoluted. If you want C++, use C++. It only uses C90, of course.
es: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">Programaci&oacute;n orientada a objetos con ANSI-C</a> (PDF gratuito) - Axel-Tobias Schreiner (1993). El c&oacute;digo se vuelve un poco complicado. Si quieres C ++, usa C ++. Solo usa C90, por supuesto.
ja: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">ANSI-Cを使用したオブジェクト指向プログラミング</a> （無料PDF）-Axel-Tobias Schreiner（1993）。 コードは少し複雑になります。 C ++が必要な場合は、C ++を使用します。 もちろんC90のみを使用します。
ko: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">ANSI-C를 사용한 객체 지향 프로그래밍</a> (무료 PDF)-Axel-Tobias Schreiner (1993). 코드가 약간 복잡해집니다. C ++를 원하면 C ++을 사용하십시오. 물론 C90 만 사용합니다.
ru: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">Объектно-ориентированное программирование с использованием ANSI-C</a> (Free PDF) - Аксель-Тобиас Шрайнер (1993). Код становится немного запутанным. Если вы хотите C ++, используйте C ++. Конечно, он использует только C90.
zh_cn: <a href="http://www.planetpdf.com/codecuts/pdfs/ooc.pdf">使用ANSI-C进行面向对象的编程</a> （免费PDF）-Axel-Tobias Schreiner（1993）。 代码有点混乱。 如果要使用C ++，请使用C ++。 当然，它仅使用C90。

source: <a href="https://learncodethehardway.org/c/">Learn C The Hard Way</a> (2015) by Zed Shaw. A book with mixed reviews. <a href="http://hentenaar.com/dont-learn-c-the-wrong-way">A critique of this book</a> by Tim Hentenaar:
es: <a href="https://learncodethehardway.org/c/">Aprenda C The Hard Way</a> (2015) de Zed Shaw. Un libro con cr&iacute;ticas mixtas. <a href="http://hentenaar.com/dont-learn-c-the-wrong-way">Una cr&iacute;tica de este libro</a> de Tim Hentenaar:
ja: Zed Shawによる<a href="https://learncodethehardway.org/c/">C The Hard Way</a> （2015）を学んでください 。 レビューが混在する本。 ティム・ヘンテナーによる<a href="http://hentenaar.com/dont-learn-c-the-wrong-way">この本の批評</a> ：
ko: Zed Shaw의 <a href="https://learncodethehardway.org/c/">C The Hard Way</a> (2015)를 배우십시오 . 리뷰가 혼합 된 책. Tim Hentenaar <a href="http://hentenaar.com/dont-learn-c-the-wrong-way">의이 책</a> 에 대한 비평 :
ru: <a href="https://learncodethehardway.org/c/">Узнайте С трудный путь</a> (2015) Зед Шоу. Книга со смешанными рецензиями. <a href="http://hentenaar.com/dont-learn-c-the-wrong-way">Критика этой книги</a> Тимом Хентенааром:
zh_cn: Zed Shaw的《 <a href="https://learncodethehardway.org/c/">Learn C The Hard Way》</a> （2015年）。 一本评论不一的书。 蒂姆&middot;亨特纳尔（Tim Hentenaar） <a href="http://hentenaar.com/dont-learn-c-the-wrong-way">对这本书</a>的评论：

source: <a href="https://modernc.gforge.inria.fr/">Modern C</a> &mdash; Jens Gustedt (2017 1st Edn; 2020 2nd Edn). Covers C in 5 levels (encounter, acquaintance, cognition, experience, ambition) from beginning C to advanced C. It covers C11 and C17, including threads and atomic access, which few other books do. Not all compilers recognize these features in all environments.
es: <a href="https://modernc.gforge.inria.fr/">Modern C</a> - Jens Gustedt (2017 1st Edn; 2020 2nd Edn). Cubre C en 5 niveles (encuentro, conocimiento, cognici&oacute;n, experiencia, ambici&oacute;n) desde el principio C hasta el avanzado C. Cubre C11 y C17, incluidos hilos y acceso at&oacute;mico, que pocos otros libros hacen. No todos los compiladores reconocen estas caracter&iacute;sticas en todos los entornos.
ja: <a href="https://modernc.gforge.inria.fr/">モダンC</a> &mdash;イェンス・ガステッド（2017 1st Edn; 2020 2nd Edn） 初級Cから上級Cまでの5つのレベル（出会い、知人、認知、経験、野心）でCをカバーしています。スレッドやアトミックアクセスを含む、C11とC17をカバーしています。 すべてのコンパイラがすべての環境でこれらの機能を認識するわけではありません。
ko: <a href="https://modernc.gforge.inria.fr/">현대 C</a> &mdash; Jens Gustedt (2017 1st Edn; 2020 2nd Edn). C부터 초급 C까지 5 단계 (만남, 지인,인지, 경험, 야망)의 C를 다룹니다. 스레드와 원자 적 접근을 포함하여 C11과 C17을 다루며 다른 책은 거의 없습니다. 모든 컴파일러가 모든 환경에서 이러한 기능을 인식하는 것은 아닙니다.
ru: <a href="https://modernc.gforge.inria.fr/">Modern C</a> - Jens Gustedt (2017, 1-й Edn; 2020, 2-й Edn). Охватывает C на 5 уровнях (встреча, знакомство, познание, опыт, амбиции) от начала C до продвинутого C. Он охватывает C11 и C17, включая потоки и атомарный доступ, что делают немногие другие книги. Не все компиляторы распознают эти функции во всех средах.
zh_cn: <a href="https://modernc.gforge.inria.fr/">《现代C》</a> -延斯&middot;古斯特（Jens Gustedt）（2017年第一届爱丁堡; 2020年第二届爱丁堡）。 从入门C到高级C，它涵盖5个级别的C（相遇，相识，认知，经验，野心）。涵盖C11和C17，包括线程和原子访问，这是其他书籍所没有的。 并非所有的编译器都能在所有环境中识别这些功能。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">Applications Programming in ANSI C</a> - Richard Johnsonbaugh and Martin Kalin (1996).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">Programaci&oacute;n de aplicaciones en ANSI C</a> - Richard Johnsonbaugh y Martin Kalin (1996).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">ANSI Cでのアプリケーションプログラミング</a> -Richard JohnsonbaughおよびMartin Kalin（1996）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">ANSI C의 응용 프로그램 프로그래밍</a> -Richard Johnsonbaugh 및 Martin Kalin (1996).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">Программирование приложений в ANSI C</a> - Ричард Джонсонбо и Мартин Калин (1996).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0023611413">ANSI C中的应用程序编程</a> -Richard Johnsonbaugh和Martin Kalin（1996）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C: A Reference Manual (5th Edition)</a> - Samuel P. Harbison and Guy R. Steele (2002). An excellent reference book on C, up to and including C99. It is not a tutorial, and probably unfit for beginners. It's great if you need to write a compiler for C, as the authors had to do when they started.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C: A Reference Manual (5th Edition)</a> - Samuel P. Harbison and Guy R. Steele (2002). Un excelente libro de referencia sobre C, hasta C99 inclusive. No es un tutorial, y probablemente no sea apto para principiantes. Es genial si necesita escribir un compilador para C, como los autores tuvieron que hacer cuando comenzaron.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C：リファレンスマニュアル（第5版）</a> -Samuel P. HarbisonおよびGuy R. Steele（2002）。 Cまでの優れたリファレンスブック。C99まで。 これはチュートリアルではなく、おそらく初心者には不向きです。 C向けのコンパイラを作成する必要がある場合は、作成者が作成時に作成しなければならなかったので、すばらしいことです。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C : 참조 설명서 (제 5 판)</a> -Samuel P. Harbison 및 Guy R. Steele (2002). C에 관한 훌륭한 참고서, C99 이하. 튜토리얼이 아니며 초보자에게는 적합하지 않을 수 있습니다. 작성자가 시작했을 때해야 했으므로 C 용 컴파일러를 작성 해야하는 경우 좋습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C: Справочное руководство (5-е издание)</a> - Сэмюэль П. Харбисон и Гай Р. Стил (2002). Отличный справочник по C, вплоть до C99. Это не учебник, и, вероятно, не подходит для начинающих. Замечательно, если вам нужно написать компилятор для C, как это делали авторы, когда начинали.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/013089592X">C：参考手册（第5版）</a> -Samuel P. Harbison和Guy R. Steele（2002）。 优秀的C语言参考书，直至C99。 它不是教程，可能不适合初学者。 如果您需要为C编写一个编译器，那是很棒的，就像作者开始时要做的那样。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">The C Programming Language (2nd Edition)</a> - Brian W. Kernighan and Dennis M. Ritchie (1988). Still a good, short but complete introduction to C (C90, not C99 or later versions), written by the inventor of C. However, the language has changed and good C style has developed in the last 25 years, and there are parts of the book that show its age.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">El lenguaje de programaci&oacute;n C (2&ordf; edici&oacute;n)</a> - Brian W. Kernighan y Dennis M. Ritchie (1988). Sigue siendo una buena, breve pero completa introducci&oacute;n a C (C90, no C99 o versiones posteriores), escrita por el inventor de C. Sin embargo, el lenguaje ha cambiado y se ha desarrollado un buen estilo de C en los &uacute;ltimos 25 a&ntilde;os, y hay partes de El libro que muestra su edad.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">Cプログラミング言語（第2版）</a> -Brian W. KernighanおよびDennis M. Ritchie（1988）。 Cの発明者によって記述された、Cの優れた、短いが完全な導入（C90、C99以降のバージョンではありません）。その年齢を示す本。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">C 프로그래밍 언어 (제 2 판)</a> -Brian W. Kernighan과 Dennis M. Ritchie (1988). C의 발명가에 의해 작성된 C에 대한 훌륭하고 짧지 만 완전한 소개 (C99 이상 버전이 아닌 C90). 그러나 지난 25 년간 언어가 바뀌었고 C 스타일이 발전했으며, 나이를 보여주는 책.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">Язык программирования Си (2-е издание)</a> - Брайан В. Керниган и Деннис М. Ричи (1988). Все еще хорошее, краткое, но полное введение в C (C90, а не C99 или более поздние версии), написанное изобретателем C. Однако язык изменился, и за последние 25 лет был разработан хороший стиль C, и есть части книга, показывающая его возраст.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0131103628">C编程语言（第二版）</a> -Brian W. Kernighan和Dennis M. Ritchie（1988）。 由C的发明者编写的C（C90，而不是C99或更高版本）仍然是一个简短，完整的入门指南。但是，在过去25年中，语言发生了变化，良好的C风格得到了发展，并且显示其年代的书。
