Repository: rueisnom/feedback
Catalog: xlf/56/23/03/562303.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">The Standard C Library</a> - P.J. Plauger (1992). It contains the complete source code to an implementation of the C89 standard library, along with extensive discussion about the design and why the code is designed as shown.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">The Standard C Library</a> - PJ Plauger (1992). Contiene el c&oacute;digo fuente completo para una implementaci&oacute;n de la biblioteca est&aacute;ndar C89, junto con una extensa discusi&oacute;n sobre el dise&ntilde;o y por qu&eacute; el c&oacute;digo est&aacute; dise&ntilde;ado como se muestra.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">標準Cライブラリ</a> -PJ Plauger（1992）。 これには、C89標準ライブラリの実装への完全なソースコードが含まれ、設計と、コードが示されているように設計されている理由に関する広範な議論が含まれています。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">표준 C 라이브러리</a> -PJ Plauger (1992). 여기에는 C89 표준 라이브러리 구현에 대한 완전한 소스 코드와 함께 디자인에 대한 광범위한 토론과 코드가 표시된대로 디자인 된 이유가 포함되어 있습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">Стандартная библиотека C</a> - PJ Plauger (1992). Он содержит полный исходный код для реализации стандартной библиотеки C89, а также подробное обсуждение дизайна и того, почему код разработан так, как показано.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0131315099">标准C库</a> -PJ Plauger（1992）。 它包含C89标准库实现的完整源代码，以及有关设计以及为什么设计所示代码的广泛讨论。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">Expert C Programming: Deep C Secrets</a> - Peter van der Linden (1994). Lots of interesting information and war stories from the Sun compiler team, but a little dated in places.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">Programaci&oacute;n experta en C: Secretos profundos en C</a> - Peter van der Linden (1994). Mucha informaci&oacute;n interesante e historias de guerra del equipo de compilaci&oacute;n de Sun, pero un poco anticuado en algunos lugares.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">エキスパートCプログラミング：ディープCの秘密-Peter</a> van der Linden（1994）。 Sunコンパイラー・チームからの興味深い情報や戦争の話がたくさんありますが、場所によっては少し古くなっています。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">전문가 C 프로그래밍 : 깊은 C 비밀-Peter</a> van der Linden (1994). 썬 컴파일러 팀의 많은 흥미로운 정보와 전쟁 이야기가 있지만 약간의 날짜가 있습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">Эксперт C Программирование: Deep C Secrets</a> - Питер ван дер Линден (1994). Много интересной информации и военных историй от команды компиляторов Sun, но немного устаревших местами.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0131774298">专家C编程：深刻的C秘密</a> -Peter van der Linden（1994）。 Sun编译器团队提供了许多有趣的信息和战争故事，但有些地方过时了。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">C Traps and Pitfalls</a> by A. Koenig (1989). Very good, but the C style pre-dates standard C, which makes it less recommendable these days.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">C Trampas y trampas</a> por A. Koenig (1989). Muy bueno, pero el estilo C es anterior al est&aacute;ndar C, lo que lo hace menos recomendable en estos d&iacute;as.
ja: A. Koenig（1989）による<a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">Cの罠と落とし穴</a> 。 非常に良いですが、Cスタイルは標準Cよりも古いため、最近はあまりお勧めできません。
ko: A. Koenig (1989)의 <a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">C 함정과 함정</a> . 매우 좋지만 C 스타일은 표준 C보다 이전 버전이므로 요즘에는 권장하지 않습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">C Ловушки и ловушки</a> А. Кениг (1989). Очень хорошо, но стиль C предшествует стандарту C, что делает его менее рекомендуемым в наши дни.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0201179288">C陷阱与陷阱</a> A. Koenig（1989）。 很好，但是C风格早于标准C，这使得它在当今不那么受欢迎。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">A Book on C</a> - Al Kelley/Ira Pohl (1998).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">Un libro sobre C</a> - Al Kelley / Ira Pohl (1998).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">Cに関する本</a> -Al Kelley / Ira Pohl（1998）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">C</a> -Al Kelley / Ira Pohl (1998) 에 관한 책 .
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">Книга о Си</a> - Келли / Ира Поля (1998).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0201183994">关于C的书</a> -Al Kelley / Ira Pohl（1998）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">Algorithms in C</a> - Robert Sedgewick (1997). Gives you a real grasp of implementing algorithms in C. Very lucid and clear; will probably make you want to throw away all of your other algorithms books and keep this one.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">Algoritmos en C</a> - Robert Sedgewick (1997). Le da una idea real de la implementaci&oacute;n de algoritmos en C. Muy l&uacute;cido y claro; probablemente har&aacute; que quieras tirar todos tus otros libros de algoritmos y conservar este.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">Cのアルゴリズム</a> -Robert Sedgewick（1997）。 Cでのアルゴリズムの実装についての理解を深めます。非常に明快で明確です。 おそらく、他のすべてのアルゴリズムの本を捨てて、これを保持したいと思うでしょう。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">C의 알고리즘</a> -Robert Sedgewick (1997). C로 알고리즘을 구현할 수있는 실질적인 지식을 제공합니다. 매우 명확하고 명확합니다. 아마도 다른 모든 알고리즘 책을 버리고 이것을 유지하고 싶을 것입니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">Алгоритмы на Си</a> - Роберт Седжвик (1997). Дает вам реальное понимание реализации алгоритмов на C. Очень ясный и понятный; вероятно, вы захотите выбросить все остальные книги по алгоритмам и оставить эту.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0201314525">C中的算法</a> -Robert Sedgewick（1997）。 使您真正掌握了用C语言实现算法的过程。 可能会让您想抛弃所有其他算法书籍，并保留其中一本。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">Functional C</a> - Pieter Hartel and Henk Muller (1997). Teaches modern practices that are invaluable for low-level programming, with concurrency and modularity in mind.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">Funcional C</a> - Pieter Hartel y Henk Muller (1997). Ense&ntilde;a pr&aacute;cticas modernas que son invaluables para la programaci&oacute;n de bajo nivel, teniendo en cuenta la concurrencia y la modularidad.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">ファンクショナルC</a> -Pieter HartelおよびHenk Muller（1997）。 並行性とモジュール性を念頭に置いて、低レベルのプログラミングに非常に貴重な最新のプラクティスを教えます。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">기능성 C-</a> 피터 하텔 (Pieter Hartel)과 k 뮬러 (Henk Muller) (1997). 동시성 및 모듈성을 염두에두고 저수준 프로그래밍에 없어서는 안될 현대적인 방법을 교육합니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">Функционал С.</a> - Питер Хартел и Хенк Мюллер (1997). Обучает современным методам, которые неоценимы для низкоуровневого программирования, с учетом параллелизма и модульности.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0201419505">功能性C</a> -Pieter Hartel和Henk Muller（1997）。 在考虑并发性和模块化的情况下，讲授对低级编程无价的现代实践。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201604612">The C Puzzle Book</a> - Alan R. Feuer (1998)
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201604612">El libro del rompecabezas C</a> - Alan R. Feuer (1998)
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0201604612">Cパズルブック</a> -アランR.フォイヤー（1998）
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0201604612">C 퍼즐 북</a> -앨런 R. 파이어 (1998)
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201604612">The C Puzzle Book</a> - Алан Р. Фейер (1998)

source: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">The Practice of Programming</a> - Brian W. Kernighan and Rob Pike (1999). A very good book to accompany K&amp;R. It uses C++ and Java too.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">La pr&aacute;ctica de la programaci&oacute;n</a> - Brian W. Kernighan y Rob Pike (1999). Un muy buen libro para acompa&ntilde;ar a K&amp;R. Utiliza C ++ y Java tambi&eacute;n.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">プログラミングの実践</a> -ブライアンW.カーニハンとロブパイク（1999）。 K＆Rに同行するのにとても良い本です。 C ++とJavaも使用しています。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">프로그래밍 실습</a> -Brian W. Kernighan 및 Rob Pike (1999). K &amp; R과 함께하는 아주 좋은 책. C ++과 Java도 사용합니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">Практика программирования</a> - Брайан У. Керниган и Роб Пайк (1999). Очень хорошая книга для сопровождения K &amp; R. Он также использует C ++ и Java.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/020161586X">编程实践</a> -Brian W. Kernighan和Rob Pike（1999）。 与K＆R一起读的好书。 它也使用C ++和Java。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">C Programming FAQs: Frequently Asked Questions</a> - Steve Summit (1995). This is the book of the web site listed earlier. It doesn't cover C99 or the later standards.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">C Preguntas frecuentes sobre programaci&oacute;n: Preguntas frecuentes</a> - Steve Summit (1995). Este es el libro del sitio web mencionado anteriormente. No cubre C99 o los est&aacute;ndares posteriores.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">CプログラミングFAQ：よくある質問</a> -Steve Summit（1995）。 これは、前にリストしたWebサイトの本です。 C99以降の標準は対象外です。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">C 프로그래밍 FAQ : 질문과 대답</a> -Steve Summit (1995). 이 책은 앞에서 설명한 웹 사이트의 책입니다. C99 이상 표준에는 적용되지 않습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">Вопросы и ответы по программированию: часто задаваемые вопросы</a> - Стив Саммит (1995). Это книга сайта, перечисленного ранее. Это не покрывает C99 или более поздние стандарты.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0201845199">C编程常见问题解答：常见问题</a> -Steve Summit（1995）。 这是前面列出的网站的书。 它不涵盖C99或更高版本的标准。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">Problem Solving and Program Design in C (6th Edition)</a> - Jeri R. Hanly and Elliot B. Koffman (2009).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">Resoluci&oacute;n de problemas y dise&ntilde;o de programas en C (6&ordf; edici&oacute;n)</a> - Jeri R. Hanly y Elliot B. Koffman (2009).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">Cでの問題解決とプログラム設計（第6版）</a> -Jeri R. HanlyおよびElliot B. Koffman（2009）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">C (6 판)의 문제 해결 및 프로그램 설계</a> -Jeri R. Hanly 및 Elliot B. Koffman (2009).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">Решение проблем и разработка программ на языке Си (6-е издание)</a> - Джери Р. Ханли и Эллиот Б. Коффман (2009).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0321535421">C中的问题解决和程序设计（第6版）</a> -Jeri R. Hanly和Elliot B. Koffman（2009）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">Advanced Programming in the UNIX Environment</a> - Richard W. Stevens and Stephen A. Rago (2013). Comprehensive description of how to use the Unix APIs from C code, but not so much about the mechanics of C coding.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">Programaci&oacute;n avanzada en el entorno UNIX</a> - Richard W. Stevens y Stephen A. Rago (2013). Descripci&oacute;n completa de c&oacute;mo usar las API de Unix a partir del c&oacute;digo C, pero no tanto sobre la mec&aacute;nica de la codificaci&oacute;n C.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">UNIX環境での高度なプログラミング</a> -Richard W. StevensおよびStephen A. Rago（2013）。 CコードからUnix APIを使用する方法の包括的な説明。ただし、Cコーディングのメカニズムについてはそれほどではありません。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">UNIX 환경에서의 고급 프로그래밍</a> -Richard W. Stevens 및 Stephen A. Rago (2013). C 코드에서 유닉스 API를 사용하는 방법에 대한 포괄적 인 설명이지만 C 코딩의 메커니즘에 대해서는 그리 많이 설명하지 않습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">Расширенное программирование в среде UNIX</a> - Ричард У. Стивенс и Стивен А. Раго (2013). Подробное описание того, как использовать API Unix из кода C, но не столько о механике программирования C.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0321637739">UNIX环境中的高级编程</a> -Richard W. Stevens和Stephen A. Rago（2013）。 关于如何使用C代码中的Unix API的全面描述，但是关于C编码的原理并没有那么多。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">Programming in C (4th Edition)</a> - Stephen Kochan (2014). A good general introduction and tutorial.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">Programaci&oacute;n en C (4a edici&oacute;n)</a> - Stephen Kochan (2014). Una buena introducci&oacute;n general y tutorial.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">Cでのプログラミング（第4版）</a> -Stephen Kochan（2014）。 優れた一般的な紹介とチュートリアル。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">C 프로그래밍 (4 판)</a> -Stephen Kochan (2014). 좋은 일반적인 소개 및 튜토리얼.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">Программирование на С (4-е издание)</a> - Стивен Кочан (2014). Хорошее общее введение и учебник.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0321776410">《用C编程》（第4版）</a> -Stephen Kochan（2014）。 一个很好的一般介绍和教程。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">Advanced C Programming by Example</a> - John W. Perry (1998).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">Programaci&oacute;n avanzada de C por ejemplo</a> - John W. Perry (1998).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">例による高度なCプログラミング-John</a> W. Perry（1998）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">예제 별 고급 C 프로그래밍</a> -John W. Perry (1998).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">Расширенное программирование на С на примере</a> - Джон В. Перри (1998).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0534951406">实例高级C编程</a> -John W. Perry（1998）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C Pocket Reference (O'Reilly)</a> - Peter Prinz and Ulla Kirch-Prinz (2002).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C Pocket Reference (O'Reilly)</a> - Peter Prinz y Ulla Kirch-Prinz (2002).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C Pocket Reference（O'Reilly）</a> -Peter PrinzおよびUlla Kirch-Prinz（2002）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C 포켓 레퍼런스 (오라일리)</a> -피터 프린 츠 (Peter Prinz)와 울라 키르 치 프린스 (2002).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C Pocket Reference (O'Reilly)</a> - Питер Принц и Улла Кирх-Принц (2002).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0596004362">C袖珍参考书（O'Reilly）</a> -Peter Prinz和Ulla Kirch-Prinz（2002）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">C in a Nutshell</a> - Peter Prinz and Tony Crawford (2005). Excellent book if you need a reference for C99.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">C en pocas palabras</a> - Peter Prinz y Tony Crawford (2005). Excelente libro si necesita una referencia para C99.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">C in a Nutshell</a> -Peter Prinz and Tony Crawford（2005）。 C99のリファレンスが必要な場合は、優れた本です。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">간단히 말해서 C</a> -Peter Prinz와 Tony Crawford (2005). C99에 대한 참조가 필요한 경우 훌륭한 책입니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">C в двух словах</a> - Питер Принц и Тони Кроуфорд (2005). Отличная книга, если вам нужна ссылка на C99.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0596006977">C简而言之</a> -彼得&middot;普林兹和托尼&middot;克劳福德（2005）。 如果您需要C99的参考书，那是一本很棒的书。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">C Unleashed</a> - Richard Heathfield, Lawrence Kirby, et al. (2000). Not ideal, but it is worth intermediate programmers practicing problems written in this book. This is a good cookbook-like approach suggested by comp.lang.c contributors.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">C desatado</a> - Richard Heathfield, Lawrence Kirby, et al. (2000) No es ideal, pero vale la pena que los programadores intermedios practiquen problemas escritos en este libro. Este es un buen enfoque tipo libro de cocina sugerido por los colaboradores de comp.lang.c.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">解き放たれたC-</a>リチャード・ヒースフィールド、ローレンス・カービー、他 （2000）。 理想的ではありませんが、この本で書かれている問題を実践する中級プログラマに価値があります。 これはcomp.lang.cの貢献者が提案する料理本のような良いアプローチです。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">C Unleashed</a> -Richard Heathfield, Lawrence Kirby 등 (2000). 이상적이지는 않지만이 책에 쓰여진 문제를 연습하는 중급 프로그래머에게는 가치가 있습니다. 이것은 comp.lang.c 기고자들이 제안한 훌륭한 요리 책과 같은 접근 방식입니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">C Unleashed</a> - Ричард Хитфилд, Лоуренс Кирби и др. (2000). Не идеально, но стоит программистам среднего уровня, практикующим задачи, написанные в этой книге. Это хороший подход к кулинарной книге, предложенный авторами comp.lang.c.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0672318962">C释放</a> -理查德&middot;希思菲尔德，劳伦斯&middot;柯比等。 （2000）。 这并不理想，但是值得中级程序员练习本书中编写的问题。 这是comp.lang.c贡献者建议的一种类似于菜谱的好方法。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">Sams Teach Yourself C in 21 Days</a> - Bradley L. Jones and Peter Aitken (2002). Very good introductory stuff.
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">Sams Teach You C en 21 d&iacute;as</a> - Bradley L. Jones y Peter Aitken (2002). Muy buenas cosas introductorias.
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">Sams Teach Yourself C in 21 Days</a> -Bradley L. Jones and Peter Aitken（2002） 非常に良い入門的なもの。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">Sams는 21 일 만에 C를 가르친다-Bradley</a> L. Jones와 Peter Aitken (2002). 아주 좋은 소개 자료.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">Самс учит себя за 21 день</a> - Брэдли Л. Джонс и Питер Эйткен (2002). Очень хороший вводный материал.
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0672324482">萨姆斯21天自学C-</a>布拉德利&middot;琼斯和彼得&middot;艾特肯（2002）。 很好的入门资料。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">C Primer Plus (5th Edition)</a> - Stephen Prata (2004)
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">C Primer Plus (5a edici&oacute;n)</a> - Stephen Prata (2004)
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">Cプライマープラス（第5版）</a> -スティーブンプラタ（2004）
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">C Primer Plus (5 판)</a> -Stephen Prata (2004)
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">C Primer Plus (5-е издание)</a> - Стивен Прата (2004)
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0672326965">C Primer Plus（第5版）</a> -Stephen Prata（2004）

source: <a href="https://rads.stackoverflow.com/amzn/click/com/0673999866">Pointers on C</a> - Kenneth Reek (1997).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/0673999866">Punteros sobre C</a> - Kenneth Reek (1997).
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/0673999866">C-</a> 케네스 렉 (1997) 에 대한 포인터 .
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/0673999866">Указатели на C</a> - Кеннет Рик (1997).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/0673999866">C上的指针</a> -Kenneth Reek（1997）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">21st Century C: C Tips from the New School</a> - Ben Klemens (2012). In addition to the C language, the book explains gdb, valgrind, autotools, and git. The comments on style are found in the last part (Chapter 6 and beyond).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">Siglo XXI C: C Consejos de la nueva escuela</a> - Ben Klemens (2012). Adem&aacute;s del lenguaje C, el libro explica gdb, valgrind, autotools y git. Los comentarios sobre el estilo se encuentran en la &uacute;ltima parte (Cap&iacute;tulo 6 y m&aacute;s adelante).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">21世紀C：新しい学校のCのヒント</a> -ベンクレメンス（2012）。 C言語に加えて、本はgdb、valgrind、autotools、およびgitを説明します。 スタイルに関するコメントは、最後の部分（第6章以降）にあります。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">21 세기 C : 새로운 학교의 C 팁</a> -Ben Klemens (2012). 이 책은 C 언어 외에도 gdb, valgrind, autotools 및 git에 대해 설명합니다. 스타일에 대한 주석은 마지막 부분 (6 장 이상)에 있습니다.
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">21-й век C: C Советы от новой школы</a> - Бен Клеменс (2012). В дополнение к языку C в книге описываются gdb, valgrind, autotools и git. Комментарии к стилю находятся в последней части (глава 6 и далее).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/1449327141">《 21世纪的C：新学校的C小贴士</a> -Ben Klemens（2012）》。 除了C语言外，这本书还介绍了gdb，valgrind，autotools和git。 有关样式的注释可在最后一部分（第6章及以后）中找到。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/1449399916">Head First C</a> - David Griffiths and Dawn Griffiths (2012).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/1449399916">Head First C</a> - David Griffiths y Dawn Griffiths (2012).
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/1449399916">머리 우선 C</a> -David Griffiths와 Dawn Griffiths (2012).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/1449399916">Head First C</a> - Дэвид Гриффитс и Дон Гриффитс (2012).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/1449399916">Head First C</a> -David Griffiths和Dawn Griffiths（2012）。

source: <a href="https://rads.stackoverflow.com/amzn/click/com/1565923065">Practical C Programming (3rd Edition)</a> - Steve Oualline (1997)(Beginner)
es: <a href="https://rads.stackoverflow.com/amzn/click/com/1565923065">Programaci&oacute;n pr&aacute;ctica C (3a edici&oacute;n)</a> - Steve Oualline (1997) (Principiante)
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/1565923065">실용 C 프로그래밍 (제 3 판)</a> -Steve Oualline (1997) (초보자)
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/1565923065">Практическое программирование на С (3-е издание)</a> - Стив Уоллин (1997) (для начинающих)
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/1565923065">实用C编程（第3版）</a> -Steve Oualline（1997）（入门）

source: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">Data Structures - An Advanced Approach Using C</a> - Jeffrey Esakov and Tom Weiss (1989).
es: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">Estructuras de datos: un enfoque avanzado con C</a> - Jeffrey Esakov y Tom Weiss (1989).
ja: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">データ構造-Cを使用した高度なアプローチ</a> -Jeffrey EsakovおよびTom Weiss（1989）。
ko: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">데이터 구조-C를 사용한 고급 접근</a> -Jeffrey Esakov 및 Tom Weiss (1989).
ru: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">Структуры данных - расширенный подход с использованием C</a> - Джеффри Эсаков и Том Вайс (1989).
zh_cn: <a href="https://rads.stackoverflow.com/amzn/click/com/B00101Y58Q">数据结构-使用C的高级方法</a> -Jeffrey Esakov和Tom Weiss（1989）。
