Repository: rueisnom/feedback
Catalog: xlf/56/23/03/562303.*.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: To summarize my views, which are laid out below, the author presents the material in a greatly oversimplified and misleading way, the whole corpus is a bundled mess, and some of the opinions and analyses he offers are just plain wrong. I've tried to view this book through the eyes of a novice, but unfortunately I am biased by years of experience writing code in C. It's obvious to me that either the author has a flawed understanding of C, or he's deliberately oversimplifying to the point where he's actually misleading the reader (intentionally or otherwise.)
es: Para resumir mis puntos de vista,que se exponen a continuación,el autor presenta el material de una manera muy simplificada y engañosa,todo el corpus es un lío,y algunas de las opiniones y análisis que ofrece son simplemente erróneos.He tratado de ver este libro a través de los ojos de un novato,pero desafortunadamente estoy sesgado por los años de experiencia escribiendo código en C.Es obvio para mí que,o el autor tiene una comprensión errónea de C,o está deliberadamente simplificando demasiado hasta el punto de que en realidad está engañando al lector (intencionalmente o no).
ja: 私の見解を要約すると、著者は非常に単純化されすぎて誤解を招くような方法で資料を提示し、コーパス全体がごちゃごちゃしていて、彼が提示した意見や分析のいくつかはただ単に間違っているだけです。私は初心者の目を通してこの本を見ようとしましたが、残念ながら私は長年C言語でコードを書いてきた経験があるので偏っています。
ko: 아래에 제시된 나의 견해를 요약하기 위해 저자는 자료를 크게 단순화되고 오도하는 방식으로 제시하고, 전체 말뭉치가 번들로 묶여 있으며, 그가 제안하는 의견과 분석 중 일부는 명백히 잘못되었습니다. 나는 초보자의 눈을 통해이 책을 보려고 노력했지만 불행히도 나는 C로 코드를 작성해 온 경험에 편향되어있다. 저자가 C에 대한 결함에 대한 이해가 있거나 의도적으로 과도하게 단순화하고 있다는 것은 분명하다 그가 의도적으로 또는 다른 방식으로 독자를 실제로 오도하는 곳을 지적하십시오.
ru: Подводя итог моим взглядам,которые изложены ниже,автор представляет материал в сильно упрощенном и вводящем в заблуждение виде,все тело-сплошная неразбериха,а некоторые мнения и анализы,которые он предлагает,просто ошибочны.Я пытался взглянуть на эту книгу глазами новичка,но,к сожалению,я предвзято отношусь к многолетнему опыту написания кода на Си.Для меня очевидно,что либо автор неправильно понимает Си,либо он сознательно упрощает до такой степени,что на самом деле вводит читателя в заблуждение (умышленно или иным образом).
zh_cn: 总结一下我的观点,以下是我的看法,作者以一种极大的过度简化和误导性的方式介绍了这些材料,整个语料库是一个捆绑式的混乱,而且他提供的一些观点和分析完全是错误的。我试着用一个新手的眼光来看待这本书,但很遗憾,由于多年的C语言代码编写经验,我对这本书有一定的偏见。

source: Various versions of the C language standards can be found <a href="http://www.iso-9899.info/wiki/The_Standard">here</a>. There is an online version of the <a href="http://port70.net/~nsz/c/c11/n1570.html">draft C11 standard</a>.
es: <a href="http://www.iso-9899.info/wiki/The_Standard">Aqu&iacute;</a> se pueden encontrar varias versiones de los est&aacute;ndares del lenguaje C. Existe una versi&oacute;n en l&iacute;nea del <a href="http://port70.net/~nsz/c/c11/n1570.html">borrador del est&aacute;ndar C11</a> .
ja: C言語標準のさまざまなバージョンが<a href="http://www.iso-9899.info/wiki/The_Standard">ここにあります</a> 。 <a href="http://port70.net/~nsz/c/c11/n1570.html">ドラフトC11標準の</a>オンラインバージョンがあります。
ko: C 언어 표준의 다양한 버전은 <a href="http://www.iso-9899.info/wiki/The_Standard">여기</a> 에서 찾을 수 있습니다 . <a href="http://port70.net/~nsz/c/c11/n1570.html">C11 표준 초안</a> 의 온라인 버전이 있습니다 .
ru: Различные версии стандартов языка Си можно найти <a href="http://www.iso-9899.info/wiki/The_Standard">здесь</a> . Существует онлайн-версия <a href="http://port70.net/~nsz/c/c11/n1570.html">проекта стандарта C11</a> .
zh_cn: 在<a href="http://www.iso-9899.info/wiki/The_Standard">这里</a>可以找到C语言标准的各种版本。 有<a href="http://port70.net/~nsz/c/c11/n1570.html">C11标准草案</a>的在线版本。
